{
  "website_summaries": [
    {
      "verdict": "A reputable and economical  cooling pad for laptops greater than 15 inches.",
      "pros": [
        "Nearly silent fans",
        "Two extra USB ports",
        "The fan lights up when in use",
        "Height setting is adjustable for user comfort",
        "Anti-skid arms keep laptop from falling",
        "Built with four fans"
      ],
      "cons": [
        "Some buyers had issues with the product's durability",
        "Fans are a little slow for some users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Immediate benefit!",
      "text": "Day 1 review - I really am happy I purchased this cooling pad. I'm a software developer and I'm pretty hard on my laptop - it's an I7 from System-76 and it normally runs hot. I run netdata to monitor services and am including a screenie that makes it pretty obvious at what point I put the laptop onto the cooling pad. So, yeah - 5-stars. Over a reasonable period of time, I'll make edits if necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Emopausal",
      "helpful_votes": 372,
      "publication_date": 20161006
    },
    {
      "title": "... 5 years and this is by far the most sturdy. It doesn't adjust like the others I had ...",
      "text": "I have had four laptop coolers over the last 5 years and this is by far the most sturdy. It doesn't adjust like the others I had and that is why it works. It has two legs in the back that can be pulled out to elevate your laptop, and two arms in front that are high enough to stop it from sliding, and unless dropped I can't see how either could break, and most importantly, it keeps my laptop cool while I play my games. A simple design that makes sense.",
      "rating": 5.0,
      "verified": true,
      "author": "Doreen Connors",
      "helpful_votes": 314,
      "publication_date": 20160817
    },
    {
      "title": "Good deal, works as described.",
      "text": "Fans *even* quieter than you'd expect. I can sleep on the couch 3 feet from my coffee table where this thing sits, and the noise from my home heating and air is louder than the fans. It was my only concern with this product, and it's a non-issue. LEDs are nice, not too overbearing, and the fans move a good amount of air on any setting. Been running this thing on high 24/7 for almost 3 months with zero complaints. Worth the buy to save your laptop some of its life. Heat is the #1 killer of electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 311,
      "publication_date": 20160324
    },
    {
      "title": "... am not sure how this has got some many good reviews. I bought an alienware 17r5 (a very ...",
      "text": "I am not sure how this has got some many good reviews. I bought an alienware 17r5 (a very heavy laptop) and judging by the reviews and description I assumed this would handle it fine. Within the first hour of owning it, one of the front clips that keeps it from sliding had snapped off, a day later the other side snapped off as well. There is also some type of debris in the fan area on the back fans, so when you run the back set of fans, you get a horrible noise. You can not disassemble (without breaking) this thing to retrieve whatever it is. Planning on returning this item today.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin powell",
      "helpful_votes": 5,
      "publication_date": 20180621
    },
    {
      "title": "Stopped working after 6 weeks",
      "text": "Very disappointed. I ordered this product 4/25. It's 6/6 and 2 of the 4 fans have already stopped working. It's no longer returnable under Amazon's return policy, so I'm stuck with a product that didn't even make it for 60 days. I'd love to find a way to get a replacement but I'm not sure how to seek that via Amazon. At any rate, this product appears to be very poor quality if this is typical.",
      "rating": 1.0,
      "verified": true,
      "author": "HermUser",
      "helpful_votes": 16,
      "publication_date": 20160606
    },
    {
      "title": "Keeps my laptop cool!",
      "text": "The noise is quiet, albeit not silent, and is almost a relaxing white noise. My biggest problem and the only reason it gets 4 stars is because the legs that keep it propped up and the things that help keep the laptop in place break off REALLY easily. I've lost count of how many times I've had to put them back in. Since I got a desk, I've found little use for it, as I used it mainly to keep the heat from my laptop off my legs since I could only game on my bed before. That, and my new laptop does a better job of regulating its temperature.",
      "rating": 4.0,
      "verified": true,
      "author": "Tasha Mounts",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Better airflow, yet quieter operation than expected",
      "text": "Happy for this price. Seems sturdy, good airflow, and quieter than expected. Like most Chinese made fans these days, one of the four inside this unit makes a bit of noise, suggesting it will eventually burn out. Nothing you can do when everyone is buying from the cheapest-cost manufacturer. (I don't expect any cooling pad that costs less than $ 50 dollars to have quality fans, or to last very long.) They just won't. So this one is par for the course in that sense. As long as three of the four fans work, I will keep using this product.",
      "rating": 4.0,
      "verified": true,
      "author": "sipy",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Would be a 5 start but for",
      "text": "This would be a 5 star review but for the fact that the tabs at the front of the unit that are designed to be pulled up so the laptop will stay in place keep coming out. And they are not always easy to get back in place. Seems like such a little thing. But, it interferes a lot with the use of the fan. At least one comes out daily if not more often. I cannot give it s good ergonomic rating for that reason. Put the back legs down so the laptop stays in place and it is not the best position.",
      "rating": 2.0,
      "verified": true,
      "author": "KHT",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Did nothing for my laptop",
      "text": "I left my laptop run for about 4-5 hours using a synthetic workload. I then disconnected the USB port so the fans were no longer spinning and changed nothing else and the max temp only went up 1C. I would consider the 1C temp difference within margin of error also it would have been running for longer under load at that point. Others may have better results but for me this didn't help at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Decent fan, developed noise very quickly though",
      "text": "This product is decent but seems a little.... cheap? It ran great for the first few hours and then developed quite a loud noise to it. I would venture to guess that the bearings in the fans might be shotty and they just broke down very quickly on the side that the noise is coming from. I probably would choose another product if I had to do it again. Maybe I just got a dud though.",
      "rating": 3.0,
      "verified": true,
      "author": "The Sun Knight",
      "helpful_votes": 76,
      "publication_date": 20160424
    },
    {
      "title": "It feels like it's blowing air from a tiny 1 inch fan",
      "text": "Wheres the air? It feels like it's blowing air from a tiny 1 inch fan. Not what i imagined..highly dissapointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Amrtrazon Customeryyyrrrttttt",
      "helpful_votes": 19,
      "publication_date": 20151203
    },
    {
      "title": "Pretty nice.",
      "text": "Works fine for me. I'd like it to have stronger fans but I understand the \"quiet\" quality of them would have to take a hit. I mean, if you run these things at max they give a half-decent cooling for your laptop, nothing that will save it from excessive heating up but good enough for me. The fans are decently loud when you run them at max, and pretty quiet when on low. So far haven't had any issues but I did need to replace the double-sided USB wire they gave in the first month. But it was a cheap fix and it's still working fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Benny",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Best cooling fan for a laptop",
      "text": "Okay, buy this right now. My 8 year old laptop was having problems turning on and I noticed the bottom getting very hot. Then it would turn off on it's own. I saw this product and bought it. It cooled down my computer and it finally worked again. You can prop it up so the computer wont slide, and it's very quiet. The lighting is cool too; but heres the best part.... you can dim the light and control the fan speed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Williams",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Amazing cooler",
      "text": "Beyond impressed by the product and company. They were super fast in shipping this product. But besides that point, the product is so beautifully thin and the LEDs look amazing. Just ONE DAY using it I'm in love with this product already. I use two external monitors because I program and the monitors help me program more efficiently for hours. Usually when my laptop is charging with two monitors hooked up, my laptop is burning hot and has shut down many times due to heat. But just one day of using the product my laptop is pretty cool and not burning hot at all! 100% recommended",
      "rating": 5.0,
      "verified": true,
      "author": "YJ",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "moves lots of air, too tall",
      "text": "I debated on how to review this item. I ended up returning it since it did not fulfill my needs. it definitely moves a lot of air with the multiple fans, I can see how it would keep the laptop cooler. it was too noisy for my likings though and makes the laptop non ergonomic with putting it up much higher. if you have a laptop on a desk or counter your arms will be raised up several inches. on your lap it might be ok. I will continue looking for a much slimmer fan pad.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Locke",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "ok... well for now it is working",
      "text": "It stopped working and I was about to return it and as I unplugged it I noticed there are switches in the back... and apparently they got turned off... ok... don't know how that happened.. but apparently the unit IS working for now...",
      "rating": 3.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 2,
      "publication_date": 20190621
    },
    {
      "title": "Cheaply Made Stop Tabs let our Laptop keep sliding forward. Pass on this.",
      "text": "The cooling functionality of this laptop platform is perfectly adequate. The reason it has a single star for ergonomics is that the cheaply made/secured stop tabs popped off nearly immediately and were not able to be made to stay in place when we tried. This renders this cooling platform relatively useless. This product is sub-par in manufacturing quality and is, therefore, a waste of your money. Keep looking.",
      "rating": 3.0,
      "verified": true,
      "author": "BoredCutter",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Low Noise with constant cooling",
      "text": "This product does a great job of keeping the unit cool. Temperature mitigation is great. The blue led is a nice touch. My laptop is lager than what this pad specifies, but still handles well. Perfect addition to a docking station setup. The tilt feature raises my laptop high enough to get a perfect dual monitor configuration. The only thing I would have suggested is the location for the power be placed to the front or side. Currently they are located at the rear of the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph S",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Missing a clip. Seller please contact me.",
      "text": "My computer constantly slides off because the clips at the bottom won't stay up. Now after only 3 days of use, I am missing one of the clips that has popped off. I have looked everywhere, who knows where it went. grrr! Other than the annoying clips, the rest of the unit works well. I need for the seller to please contact me for a replacement clip or I'll need to send this back.There is no place in my order history to contact the seller. Thank you kindly.",
      "rating": 1.0,
      "verified": true,
      "author": "American Mom",
      "helpful_votes": 3,
      "publication_date": 20170224
    },
    {
      "title": "USB ports are in a good spot",
      "text": "We have bought quite a few of these kinds of accessories through the years, and all of them have put USB ports on the outside edge. That's the worst place for them as that's where they can be snapped off easily. This unit has them located in a recessed space on the bottom. The one I bought came with a non-essential piece of plastic broken off. I can use superglue, so I don't care about that shipping damage.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Quiet and cools",
      "text": "The cooler works well for me. I have a 17.3\" Clevo PB71RF-G laptop and it fits just fine on it. The fans are super quiet and I even use them to cool me down at times when I'm in my office which gets really hot. I have had to issues with the quality or construction of the structure with my particular laptop and I really enjoy the tilt stands which position the laptop into a really comfortable way that keeps my hands stress free while I type. Totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasonc73",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "AMAZING",
      "text": "This is literally amazing. This cooling pad makes my computer idle CPU at 31C... Without the cooling pad the CPU idles at 45-50C.. I have a gaming laptop MSI GE72 Apache Pro GTX 1060 Intel I7th with 16g of ram. I have tried several cooling pads and this is the most powerful and the only I tried so far that made my computer Idle at 31C. My fellow MSI users I will edit this review to give you the brands of the cooling pads you should avoid at all costs as some of them are best sellers on Amazon. Please see below the pics for proof",
      "rating": 5.0,
      "verified": true,
      "author": "D. Karkason",
      "helpful_votes": 2,
      "publication_date": 20170710
    },
    {
      "title": "Pretty good for the price",
      "text": "This is a pretty good fan/laptop cooler. It does the job well enough by keeping my laptop up off of my desk and the fans help with airflow. It isn't super strong so if your laptop runs really hot this may not work for you. But it works well enough with little noise. It is a little flimsy though, so if you are rough with your belongings this might not be for you either.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhys N.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "he was constantly having to let it cool off as it was overheating too easily",
      "text": "My husband is using the 17\" HP laptop I used before I got a new one. Before I got him this cooling pad, he was constantly having to let it cool off as it was overheating too easily. Since we got this cooler, he's able to be on it 12 hours at a time if he cares to. And neither one of us are 'gamers.' I bought a new one since and it doesn't work nearly as well as this one, but my newer 17\" HP laptop doesn't heat up like the one my husband now uses does, so it suffices, despite the fact that mine is left on almost 24/7/365.",
      "rating": 5.0,
      "verified": true,
      "author": "Purrfect Storm",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "it works great I have a 17 in HP probook that it ...",
      "text": "Oh how I wish I could give more stars but sadly I cannot, it works great I have a 17 in HP probook that it fits fine ( almost too small tho) and a 7 year old Toshiba about 15.5 in screen that def had overheat issues, but I have to use it for work, so I put it on this cool pad and it keeps it functional great and minimally heated ( ive had this fan like 6 months ish BTW) BUT the back leg tabs and the front tabs to prevent comp sliding are ridiculous!!! break off ALL THE TIME and yeah they pop back in but uit happens wayyyyyyy more than it should on a quality product.",
      "rating": 2.0,
      "verified": true,
      "author": "NeffBrooke",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "20 to 25% cooler",
      "text": "My laptop has been getting hotter and hotter, even after cleaning the vents, to the point where I've nearly burned my hands. This cooling pad has kept it 20 to 25% cooler, even when running graphic-heavy programs. I had to find a shorter TV tray to compensate for the extra height, but it was definitely worth it. The only complaint I have is the flip-up pieces that keep my laptop from sliding off the front of the pad. They are placed right where my wrists rest on the computer, and they have somewhat sharp corners. If they were a bit rounded off, the cooling pad would be perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Briddie",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Cooling is power",
      "text": "Heat causes most modern CPUs to throttle down. You can see this is Linux with #dmesg -tw from the command line. This cooler is very quiet and positions the laptop at a nice tilt on non-slip feet with nice thingies to keep it from sliding down. Having said that, you might get a degree or two difference but do not expect miracles. Most laptops lack sufficient ventilation for this to be highly effective. Essentially this cools the bottom of the laptop a bit in the hope that it will radiate upward.",
      "rating": 4.0,
      "verified": true,
      "author": "Eyeconic",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Durable and gets the job done!",
      "text": "Got a pair for our laptops a few months ago and I love them. My laptop is an aging Ho pavilion that started heating up to the extent of turning off by itself. Got this baby and it took care of that problem. No more overheating. Although the noise level could be better but I’m still giving it a 5 star for its performance and durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Kal",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Great Until it Doesn't Work!!!",
      "text": "This is the second fan I've purchased from the seller. The first one became problematic after about a year. When turned on, it would come on and then off and I would have to wiggle the cord to see if I could get it in a place where the fans stayed on. I finally decided to buy a new one. Unfortunately, this one hasn't even lasted a month. I've ordered a new cord to see if that helps, but if not, I will be returning!",
      "rating": 2.0,
      "verified": true,
      "author": "hd4baja",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Great Product, Even Greater Customer Service!",
      "text": "Great Cooling Pad, lightweight but has great air movement with 2 banks of 2 fans in each bank that you can control the speed of each bank. Since I started using this my laptop has run cool and I only use 1 bank of fans. Tree New Bee also has GREAT customer service! One of the lighted fans stopped working,I contacted the manufacturer through Amazon and had a new unit delivered to my door within 4 days! WOW you can't ask for better customer service than that. If you are looking for a cooling pad, don't look any further.... buy this one. Not only does it work great, but has GREAT customer service behind it!.",
      "rating": 5.0,
      "verified": true,
      "author": "wmitch1000",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "On/off control broken after a few days worth of use. Can not turn rear fans off now.",
      "text": "I have been using this cooling pad for a few days and already I can not turn it off. The wheel that is the on/off mechanism for the back fans is so loose in its housing that instead of clicking to the off position, the whole control just gets pushed into the housing and it will not turn off. I was worried this would happen from the beginning because it has always felt poorly made. But since the fans are quiet and effective, i decided to stick it out and hope for the best. Now I'm past the return date and I am very unhappy.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Freberg",
      "helpful_votes": 4,
      "publication_date": 20160120
    },
    {
      "title": "Total coolness all the way around, but now there's an update . . .",
      "text": "I love this cooling pad! It works great for my 17\" hp laptop, and even looks cool with the blue lights. I like the option of having four or two fans on. Highly recommend it. UPDATE: After using this pad for 3 months, this cooling pad is mostly working on and off. It appears the usb cord is a bit iffy and the pad goes off sometimes. I then have to wiggle the usb cord to get it going again. I'll have to check if I can get another male to male usb cord to replace the one the pad came with. Hopefully that will solve the problem. Downgrading the review to 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Martinez",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Good Product with inaccurate description",
      "text": "Product description says \"Extra USB ports and switch: Extra USB port and wind speed switch design, built-in dual-USB hub allows for connecting more USB devices\". This product only has 2 usb ports, 1 of which is required to power it and the other is a passthrough. I'm not complaining about the product itself because it works extremely well and its nice to have a pass through where others don't, however the description should describe this accurately. When the descriptions is corrected, I'll update my review and stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Dev",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Amazing Product",
      "text": "I have an ASUS gaming laptop and before I ordered the Tree New Bee cooling pad, my laptop struggled to keep itself cool during some of the more demanding games I play. In fact, it was quite uncomfortable to sit the laptop on my legs during gaming, as the bottom of the case would be hot. Also, the internal cooling fan was very noisy as it struggled to keep up with the heat generated by the processor. Now, the fan noise is gone and my laptop stays cool. Ahhh, peace and quiet. I recommend this cooling pad to anyone who games on a laptop!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Turner",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "One Of The Best Laptop Coolers On Amazon",
      "text": "I said this in another version of the Tree New Bee Laptop Cooler & I'll say it again. This cooling pad is the best for keeping laptops cool! I use them all the time at work for laptops with defective cooling systems or processors that run extremely hot! 10/10 would highly recommend for owners with hot laptops or gamers who need that extra cooling for long gaming sessions! :D",
      "rating": 5.0,
      "verified": true,
      "author": "TechAzn",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Great product. Love the adjustable fan switches",
      "text": "Great product. Love the adjustable fan switches. Slight tilt is a good feature also. My only complaint (not really a complaint but a curiosity) is the blue light. It is dim and not overpowering. That's good but it's purely for aesthetics I'm sure but it has no benefit to the overall unit. (Does look kinda cool!) And if your laptop is like mine, (Dell Insprion 15\") then it covers the entire surface anyway so most of the light cant be seen! Other than that, it's whisper quiet. Just a little fan noise can be heard when there is no other sound. Does the intended job. Just wish there was a switch to cut off the light!",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey L.",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Keeps the laptop cool for hours",
      "text": "Bought this for our teenaged daughter along with her gaming laptop. This item is a must have! It keeps the laptop cool even after hours of gameplay. And since it’s powered by a USB plugged into the computer, it lasts as long as the laptop provides power. It also has a neat little stand to keep the laptop elevated... which also helps the laptop to maintain a cooler temperature. Finally, the cool blue color is soft and pleasant and doesn’t detract away from the laptop screen. Overall 5 out of 5.",
      "rating": 5.0,
      "verified": true,
      "author": "S Logan",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Support pegs WILL break...",
      "text": "The fans on this cooling pad are very nice. I'll give it that. However, the support legs and pegs are made of cheap plastic. Mine broke within 2 weeks! This hasn't made the unit inoperative, but it's disappointing and annoying. I haven't been able to find replacement pegs anywhere. Also, as others have stated, the LEDs are not optional. When the fans are on, the LEDs will be on & can't be turned off. Why not? I almost gave this cooling pad 3 star because the fans are pretty decent, but poor design & materials just don't cut it for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Cooling pad works as expected",
      "text": "My laptop seemed to get a little too warm at times, so I gave this a try. It is exactly what was needed to control the temperature. The fan is not loud at all, but I can tell when it's on. It doesn't take too much to break off a plastic leg, so the durability feature is not top rated. When I had one break, I did turn right around and order this same item again, though, because the price is reasonable and it does work as expected. It's also at a slant/angle so it keeps the laptop up off the flat surface of the desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Toonces",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Lots of air flow, weak feet.",
      "text": "This cooling pad keeps my Alienware 17 R4 Cool and running fast on even the most demanding games. My Laptop does not typically run hot except when playing Fallout 4 on the Ultra High graphics setting with the High Detail pack activated. With this cooling pad beneath my Laptop the games run smooth and fast. The only down side is the feet that hold the laptop on the pad when elevated are weak and when they pop off your laptop may slide off of the cooling pad. I have overcome the issue with a small amount of hook and loop tape (Velcro) on the base of the laptop and top of the pad, far away from the cooling vents. .",
      "rating": 4.0,
      "verified": true,
      "author": "J. Chapman",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Nope",
      "text": "It looks like the picture. It's lightweight (not as sturdy as I thought it would be), the back right fan makes a hideous clicking sound from the moment it was taken from the box, the fans don't move very much air, it is three inches too short from front to back for my 17\" laptop, the \"off switch\" (two dials) are located awkwardly on the back of the unit (which is three inches under the laptop) so the laptop needs to be moved to access the switches or the USB plugs, and one of the stops to keep the laptop from sliding forward has already fallen off. It doesn't seem to cool the laptop.",
      "rating": 2.0,
      "verified": true,
      "author": "Tm",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "You can’t go wrong with this one!",
      "text": "Very good product and arrangement of fans keep my laptop running very cool and for long periods without crapping out from excess heat. I would recommend to anyone who has a laptop. It’s a great price and I also have the name branded ones with just one fan that costs more but this one has better cooler power 4 fans! Variable speeds , colored lights and a lot of bang for the buck. You can’t go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry M Public",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Decent cooling fans, but could be better",
      "text": "I got this cooling pad and having been using for a few weeks and unfortunately I am not too thrilled with it. It has nice looking led lights and fans that seem powerful, but I do not like the cheap construction of the product and do not like the fact that if you pick it up with the laptop on it the fans run the plastic because of the poor construction. I will be looking for a new product...",
      "rating": 3.0,
      "verified": true,
      "author": "JeffW",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "as amazing as it is",
      "text": "This thing is a miracle worker. My old gaming laptop, as amazing as it is, overheats like it wants to burn the world down. These fans are COLD. I can barely explain how awesome they are and how much I love this cooling pad. There are simply not enough adjectives. I love that it has an extra usb port, to make up for the one used to power the fans. I love that the front 2 fans and the back 2 fans can be operated independently with their repsective switches, which can toggle how hard the fans blow or turn them off completely. This thing... oh man. Get this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "LlamaKid Barrith",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Cooling pad too weak to support 17\" computer.",
      "text": "Great cooling, but the weight of the computer presses the pad surface against the fans. One has to keep repositioning the computer to stop the noise caused by the rubbing.",
      "rating": 2.0,
      "verified": true,
      "author": "Iamchris",
      "helpful_votes": 11,
      "publication_date": 20160115
    },
    {
      "title": "Awesome, long-lasting budget choice",
      "text": "Really great product for the price and holds up for years. Drops temps by 4°C on idle and as much as 9°C on heavy load. Doesn't sound like much, but for me, this is the difference between being able to run at 1920x1080 instead of reeling back to 1600x900! Running an ROG Strix laptop with an NVIDIA GTX 970M and quad-core i7 @ 2.6GHz base. For deeper context, I went from playing Risk of Rain 2 on medium graphics at 1600x900 to medium-high graphics at 1920x1080 with this cooling pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew \"Tyviette\" S.",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Good cooling pad for the price.",
      "text": "This cooling pad is quiet, powerful, and lightweight. The only reason I gave it 4/5 stars instead of 5/5 is because it is rather flimsy and the brackets that hold the weight of the laptop would often snap out of place. After having it about a year, one of the brackets broke completely off. That being said, it is relatively cheap and I consider it a decent buy for only about $20.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren Edwards",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Very good product.",
      "text": "Fans work great and are reasonably quiet considering the air output. Fan speed is adjustable which is nice. Keeps my old-ish laptop significantly cooler even in my upstairs office which runs a bit warmer than the rest of the house. Only down side is that the blue LED lights on it don't seem to have a switch (unless I'm blind). Not a huge issue since the laptop blocks the majority of the light. Still 5-star worthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin O.",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Not powerful enough for gaming laptops",
      "text": "It's cool looking and easy to use. But it's not nearly powerful enough. I tried using it with my Alienware M18x. Even though it's a bit smaller than my laptop (about 1 inch on each side), it still fits fine and it's sturdy enough to handle the 13lbs laptop. The problem is that it's designed to be ultra quiet instead of ultra cooling. Initially, I turning it on and just put my hand over it to see how much air this thing is actually moving and wasn't impressed. I gave it a go anyhow and it didn't even slow down my laptop from heating up when I started gaming. It's probably fine for smaller laptops.",
      "rating": 2.0,
      "verified": true,
      "author": "Val S.",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Just buy it already",
      "text": "There are so many of these out there I am happy I picked this one. The products used for the price are well done. Fans are not just silent the have absolutely no sound at all and work great. I was worried about draining battery but hours of running I could not notice any difference in battery drain. If you're trying to decide you should buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Well worth the investment",
      "text": "The fans have adjustable speeds and the top and bottom fans have separate switches which is very handy. I use this with a 15.6\" laptop and it's barely noticeable underneath it but I have not had my laptop get even mildly warm once since I've been using it. It has tabs at the front to keep your laptop from sliding when you have the feet down is fairly quiet. It's not silent, but if that's what you're expecting then you'll be disappointed in any cooling pad you find that does it's job, but the noise it does make is just the airflow generated.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristy",
      "helpful_votes": 0,
      "publication_date": 20170321
    },
    {
      "title": "Works great",
      "text": "I've had a number of cooling pads over the years, and this is one of the best that I've used. I currently own 2 of these Tree New Bee cooling pads, using one for my Alienware 17 gaming laptop and the other for my wife's Dell Inspiron 15. Both units run quietly and do a good job of dissipating heat generated from the laptops. The Alienware 17 in particular can get quite hot when playing some game, and this cooling pad efficiently disperses the heat buildup under the laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Eustis Gator Man",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great till it stops working...",
      "text": "Ordered this the day after Christmas 2018, it has been great. I noticed in mid-July that the two top fans quit working, it has a one year warranty on it, so I contacted the company. They quickly responded and asked for my order number, I responded with my order number shortly after. Now, here it is 2 weeks later and they have still not responded back to help with the problem!!",
      "rating": 3.0,
      "verified": true,
      "author": "Home Mommy",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Works better than I imagined.",
      "text": "We have a 4 year old laptop that was overheating when playing games. With this cooling pad, the computer doesn't even get warm. When the computer's fan does blow, in is only a little warm, not hot like it was without the cooling pad. I didn't believe this would help, but it seems to be working great. Update: 6 months and it stills works like a charm. Never overheats now, even when running games that are a bit overpowered for this particular laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "It keeps my gaming laptop very cool even when using intensive graphics.",
      "text": "This is very neat looking and is very quiet for having 4 fans. It keeps my gaming laptop very cool even when using intensive graphics. My keyboard would quit working for a few minutes while my laptop cooled down, but now I have no problems no matter how I push it. I play SKYRIM and on a 64 bit computer with an NIVIDA GeFORCE video card with 8 gig onboard, it can make a thin computer run hot. This cooling pad has 4 variable speed fans [you can control] and looks nice all lit up in blue. definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "rd cook",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "LEDs are nice, not too overbearing",
      "text": "Fans *even* quieter than you'd expect. I can sleep on the couch 3 feet from my coffee table where this thing sits, and the noise from my home heating and air is louder than the fans. It was my only concern with this product, and it's a non-issue. LEDs are nice, not too overbearing, and the fans move a good amount of air on any setting. Been running this thing on high 24/7 for almost 3 months with zero complaints. Worth the buy to save your laptop some of its life. Heat is the #1 killer of electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli B",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Provides full base coverage and ample power to cool my unit...",
      "text": "A high(er) quality market cooling pad for the money than others sold on Amazon for the same price. I'm on a 5-year old HP 17\" Envy 3D and it's a beast and runs hot. The Bee Cooling Pad provides full base coverage and ample power to cool my unit. It's also quieter than my alternate -- Kootek Laptop Cooling Pad 12\"-17\" Cooler Pad Chill Mat 5, which is just as excellent a cooling pad. Recommend both.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Bad Cord",
      "text": "Works great and cools my laptop, but the cord stopped working within a few days. I just ordered a new one and hopefully it works. If not I might return it... UPDATE I got the new cord and the fan now works great again! It really does cool my laptop, I have a hp spectre 360 and one of the fans has stopped working. It’s starting to overheat and I don’t want the computer to fry. I’ve found that this fan has really helped and the computer hasn’t overheated sense.",
      "rating": 4.0,
      "verified": true,
      "author": "Shania",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Disappointed (edited)",
      "text": "Just received this an hour ago and the second I turned it on there's a whirring sound and the fan sounds like it's flapping. Noise occurs no matter how it's positioned. Not silent at all. Waited an extra day for it to be delivered (because Prime is never two days anymore) only to have to send it right back. Very disappointed because I was hoping for a decent product based in the reviews. *Edit: Amazon sent a replacement quickly. This new product works well but giving four stars for the inconvenience.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Pietrzak",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Great cooling pad.",
      "text": "Awesome cooling pad. I use this for my PS4. I have a separate USB power source so it doesn't draw power off of my PS4 and I would recommend the same for a laptop or other device that you're using this for. I really enjoy how this thing tilts to create space between the device and the ground. The fans are a really strong and the blue lights are a nice cosmetic touch. I would recommend this cooling pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Severn Kraut",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": ".",
      "text": "I had an issue with overheating since my laptop is on 24/7 so decided to get some additional cooling pad. It worked great for me and my laptop since it's kept on the table constantly. Fans are not loud at all but they do cool which I can see by my laptops temperature. I wish the legs would be more adjustable. Also plastic pieces that stops laptop from sliding seems not very effective for heavier laptops but with the one I use I would probably order it again. I love the blue lights.",
      "rating": 4.0,
      "verified": true,
      "author": "Slronhill",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "It Brought My Laptop Back To Life",
      "text": "The case fans in my 17\" Alienware laptop stopped working. The fans were fan. The circitry was the issue as the fans were not receiving power. It's a beast of a computer and generates a lot of heat. I shelved the computer because it was useless. However, I recently discovered this product. I took the fans out of the laptop and used this cooling pad, which is the best decision I could have made. At one point, I left it running for two days straight. The laptop was at the perfect temperature when I checked on it. Couldn't ask for more.",
      "rating": 5.0,
      "verified": true,
      "author": "Reflex",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "It does the job but...",
      "text": "I have a gaming laptop and this cooling pad definitely does the job that I need it to however I do have a couple of complaints. Just by touching the pad you can tell it's built cheaply. The plastic is flimsy and it feels like it could brake with one drop. I've had issues with the feet at the bottom that are supposed to keep my laptop in place. They just keep on popping off although they are easy enough to put back in. Overall it will do the job but down the road I'd definitely want something built a little better.",
      "rating": 3.0,
      "verified": true,
      "author": "Blase",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "The is an awesome cooler. Keeps my laptop extremely chiled and helps ...",
      "text": "The is an awesome cooler. Keeps my laptop extremely chiled and helps keep it up for an easier viewing angle. The durability is nice too. One thing that everyone should know is that if you leave the cooler plugged in, it'll go continue to run till your laptop battery dies It has the potential of killing your battery beyond the ability to revive it if the drain is strong enough. Remember to unplug it after use. I've had my HP give me a warning about undercharging dangerously twice now because of this",
      "rating": 4.0,
      "verified": true,
      "author": "Kewal D",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Awesome Cooling Pad",
      "text": "I love the cooling pad. It has a fan in the location that continued to get hot with other coolers and it works just awesome. I like the extra long fold down feet on the bottom so when I sit in my chair with a blanket on, the cooler sits high enough to still cool the laptop. I was having my laptop overheat and shut down a lot before I bought this and I have not had any problems with it since then. I also enjoy the option of choosing either 2 or 4 fans running, depending on the cooling needs. The light up fans are also cool. Thank you so much for such a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "raysoldier55",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Don't Let Your Laptop Take the Heat",
      "text": "So far this is working very well for keeping my MacBook Pro cooler. Before the cooling pad my MacBook would get very hot where the power supply comes in. And as everyone knows heat is not a computers best friend. One thing I did not think about was the support for my wrists while typing, this cooling pad when angled up makes typing much more enjoyable. The only thing I had to do was to shove some folded paper under the angled support arms at the bottom of the pad. These support arms keep the computer from sliding off the cooling pad, but they are easy to inadvertently push down while use.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Henson",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "Solid fan that really keeps computer cool.",
      "text": "This fan is very powerful and keeps my computer nice and cool. Honestly, it's strong enough that sometimes I get cold sitting in front of it. The color is fun and not too disruptive. It shuts off automatically if the computer is off or asleep. It's a little bulkier than some fans and I don't think it would be useful if it was actually on my lap, butt it's perfect for the desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn F.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Couldn't be happier with purchase!",
      "text": "Gave this to my daughter for Christmas. She was so excited to try it out. She loves to video chat but her computer had been overheating & shutting down. Now she plugs in the stand to her computer and she's set for the night. The fans are quiet & do their job well. She also loves the bright blue color of the lights. The product arrived quickly & was packaged nicely. I would definitely buy it again!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DSMAmy",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Didn’t do anything at all",
      "text": "I bought this to keep my laptop cool while encoding DVD’s. My laptop idles at 28 Celsius. When it encodes a dvd, it jumps up to 66 celsius. With the cooler there was NO difference at all. With the cooler, the idle temp was 1 degree cooler for a few seconds, but it was probably just a coincidence. Very disappointing. For me that’s where it ends. It doesn’t matter what it looks like, how many lights, or how many USB ports it has. If it can’t do the job it was created to, then it’s useless and I don’t want it.",
      "rating": 1.0,
      "verified": true,
      "author": "OGSERB",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Started smelling like smoke and stopped working",
      "text": "I'm giving this 1 star because It just started smelling like smoke amd stopped working after a year and a half of use. It's a cool device to keep your laptop cool, but it does not have a very high incline for sitting properly for long periods of time infront of a laptop and I'm only 5\"8.",
      "rating": 1.0,
      "verified": true,
      "author": "Just Another Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Works great when used on a hard surface",
      "text": "Works great when used on a hard surface. Cannot use while having laptop on your lap or a padded surface (bed or upholstered furniture). If I use it on my lap, I put it on a lap board or something hard to keep the fan open to ventilation. The fans are encased inside the unit, but when blocked on the bottom, the air doesn't circulate well. Avoid having the motor burn out, I am keeping the ventilation open and air available to move around. It is pretty quiet now, will see how it holds up as it ages.",
      "rating": 4.0,
      "verified": true,
      "author": "nmart",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Used it to cool down my Razer Blade 15 Laptop.",
      "text": "Couple of things that I like about this cooler is, 1. There’s a lot of airway which does a good job cooling down your laptop. 2. Fan is huge! Which is good as well. Big fan, big wind. 3. Extra USB pod.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacky Cheng",
      "helpful_votes": 2,
      "publication_date": 20190307
    },
    {
      "title": "Keeps laptop cool!",
      "text": "I’ve read quite a bit on laptop coolers and was a bit skeptical before I purchased but it does work. I have an Alienware 17r4 and the cooler does a great job of keeping the laptop cool. After gaming for a couple of hours, the fan speed never got above a whisper on the laptop. The bottom of the laptop was cool to the touch. Without the cooler and sitting directly on my desk, the laptop would get pretty warm and the fans would speed up and get quite loud after just a few minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Does its job with or without fans. Non-standard USB connectors, skinny USB cords.",
      "text": "I don't even use the fans. Plus the USB connectors are non-standard and the included cords are skinny, not good for high-power applications. But you don't need the fans to keep a laptop from overheating when they otherwise would due using on a carpeted floor or on a bed or on a couch armrest. Liked that video review with the teenager promoting the product. He did well in promoting it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jesse Roberge",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Good System But Pegs are not molded in correctly.",
      "text": "My games no longer overheat my system, so just that is a huge plus with this system. However, as stated on other reviews, the flip-up pegs that keep the computer on DO NOT stay in the molded configuration that they're suppose to. I've heard that they break and fall out. Well, yes, my units pegs have fallen out and I've had to rig it so it stays put. For this reason only I took off 2 stars to an average. If they would fix this it would be 5-stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris McNeal",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Comes down to the cable....",
      "text": "Would be 5 star but the cable goes bad quickly. This makes for intermittent connections, then failure once the cable breaks. If you plan purchasing and move your laptop around, then invest in a nice female to female cable or spring the extra cash for a higher quality item.",
      "rating": 2.0,
      "verified": true,
      "author": "redw",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "I am not using this to cool my Laptop",
      "text": "I am not using this to cool my Laptop, but to cool the cabinet where my PC is located. The small cabinet would get too warm with the PC running despite ventilation port in the cabinet. I was able to hang this cooler against a ventilation grill and have it blowing cooler air onto the PC. Now the cabinet is nice and cool and the PC has no complaints about the cabinet bing too warm. Also, being able to draw its power from a USB port, the cooler is only running when the PC is on.",
      "rating": 5.0,
      "verified": true,
      "author": "AZNetCowboy",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Excellent Product",
      "text": "Sets up nicely, allows for easier typing, great ventilation, good materials, good price, 10 for 10 👍 I run Logic Pro, a DAW “Digital Audio Workstation” for Mixing and Mastering Music. I use a lot of simultaneous processing on my 2018 MacBook Pro. Even though I have a 6 core processor, it still creates a lot of heat. This Fan Cools very well. Not noisy by any means. All-in-All I am very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve1739",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Looks good but...",
      "text": "Quality seems fine at this point, However, the following things need to be noted. First the base legs tend to collapse/fold back to hidden/stowed position far to easily. Secondly the slide stop for the laptop tend to be easily displaced ie come out of its socket. Thirdly this could be improved with either side guards to prevent left right movement or some sort of non slip/grip pads for the laptop",
      "rating": 3.0,
      "verified": true,
      "author": "Ann Marie Anderson",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Provides minimal airflow",
      "text": "I bought this for a Razer Blade Pro since it runs real hot during gaming. I have been just elevating the computer on a small box at an angle and having a desk fan blow on it. This cooling pad did not cool the computer much at all. It is nice in the fact that it elevates the laptop without it sliding off but I have now placed my desk fan behind this to keep the computer from getting too hot. I just wish it cooled the laptop better.",
      "rating": 3.0,
      "verified": true,
      "author": "Cakesaurus",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "The front holders could be stronger",
      "text": "Been using this for over 8 months and not a single problem. Holds out the dust from entering the laptop vents, adjustable fan speeds, helps cooling while gaming. The surface with its adhisive holes is still smooth enough for the laptop to slip. Just wish the front holders were stronger because they are fragile as hell.",
      "rating": 4.0,
      "verified": true,
      "author": "Sanjay Bhat",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "cooling pad",
      "text": "my laptop was over heating a lot with this cooling pad it dosent get hot the only thing is the legs kept pooping off and the laptop would side off so I took Velcro to each side and it fine and I put glue to the legs it dose keep my laptop cooled",
      "rating": 5.0,
      "verified": true,
      "author": "theresa",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "The concept is good. But you have 4-12 volt fans running on ...",
      "text": "The concept is good. But you have 4-12 volt fans running on your laptops 5 volt source... {USB}. For most every day commutes will be fine... But for the gamer, your gonna want to up the voltage, to the fan to cool your system... I have the Asus 702 laptop 17\" and I still have a 6\" fan blowing on top of my laptop to keep it cool... If you are a gamer, prepare to modify...",
      "rating": 3.0,
      "verified": true,
      "author": "Jpd",
      "helpful_votes": 2,
      "publication_date": 20170415
    },
    {
      "title": "I used every week about 4 a 8 hours and its perfect I live in Puerto Rico the normal temperature is ...",
      "text": "I was looking for some cooling pad without making a hole in my pocket after a expensive laptop. I look this Bee Cooling pad after read the feedbacks I decided to buy it. I used every week about 4 a 8 hours and its perfect I live in Puerto Rico the normal temperature is 32C to 35C and manages to keep cool. I would liked it in another color like red or each fan changing color but I like it anyways.",
      "rating": 5.0,
      "verified": true,
      "author": "Omar A. Perez Ruiz",
      "helpful_votes": 4,
      "publication_date": 20170205
    },
    {
      "title": "Has a design flaw.",
      "text": "The two tabs that hold the laptop in place, also detach in the same direction that the force of the laptop is pushing. I have a larger 17inch laptop and the tabs started to pop loose after about a month of use. Makes the item a lot less stable and a lot less useful for me. The design is flawed. The hinges need to be stronger then a simple plastic pop pin , especially when the failure of the pin could mean a laptop taking a trip to the floor.",
      "rating": 3.0,
      "verified": true,
      "author": "DrPucci",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Best cooling fan I have bought.",
      "text": "I have had this fan for almost two years and it works like a charm. I'm a gamer and it's gets heavy use and is able to keep my laptop cool. In these two years it consistently works and the noise level is tolerable. I have no complaints and highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "POS POS POS!!!!!!! DON'T BUY !!!!!!!",
      "text": "This POS is made so poorly that in less then 90 days I have had to fix the rear legs twice they keep popping off, and so do the front ones on the top. I did read other reviews and I swear that those reviews were written by people who were high as a kite. If I could really rate it, it would get a -10 stars. As a cooler it works great, but it is built to the extremely high LOWEST COST standards in China. Buyer Beware",
      "rating": 1.0,
      "verified": true,
      "author": "Davindra",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Excellent cooling pad for laptops with cooling intake vents on the bottom of the laptop case.",
      "text": "I use this for my company laptop. I was just putting my laptop on the desk and noticed that there was very little air flow from the vents (on the bottom of the laptop) and the laptop was getting quite warm I bought this cooling pad and it blows quite a bit of air into the cooling vents on the back of the laptop case and I've noticed that the laptop doesn't heat up at all. In fact, after a day's work, I unplug the laptop and feel the back of the case for any hot/warm spots and I cannot find any after using this excellent cooling pad.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "it works great. I have the GTX1070 so it tends to ...",
      "text": "I use this for my Alienware 17 R4, it works great. I have the GTX1070 so it tends to heat up on ultra settings but this thing is so good the fans for the laptop shut off soon after turning it on. Another use is that I use it for ventilation since I have only 1 window in my room and am a light sleeper so this is so quiet that I can actually sleep while it's still on.. I've also been using it as a book stand while studying that's why I'm considering buying another one. Great value for that price",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Zalzaly",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Not for gaming laptops",
      "text": "This product helps to keep your laptop cool, but if you game a lot on your laptop this may not keep your system cool enough. This product doesn't seem to be powerful enough. During laptop test it only dropped the temperature by 8 degrees. So if you have a gaming laptop consider a different product.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20151214
    },
    {
      "title": "Not bad but needs some more work",
      "text": "My biggest complaint is the little pegs that are used to hold your laptop on the cooling pad. They pop off constantly! I would have given this product 4 stars if it wasn't for that these pegs pop off so much and are such a pain! Other than that, it does work pretty well. There is one area of my laptop that still gets pretty hot, but the rest stays cool. Nice design overall except for those pegs. Please make something that is more sturdy in that regard.",
      "rating": 3.0,
      "verified": true,
      "author": "AmeliaBedelia",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Great Laptop Cooling Fan",
      "text": "The cooling fan is very useful and practically designed. The pegs at the bottom to prevent the computer from falling off are very nice (I am using a heavy 15 inch MacBook Pro and it is being held in place perfectly). The variable fans cool my computer quite significantly, as it would tend to get quite hot without the fan and is now much cooler with it. The fan also has an area to store the strong USB cable, which makes it very convenient to travel with, and the extra USB port (aside from the one used for the USB cable) also allows me to plug in something else. Overall, very nice cooling fan. Would certainly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Michaelson",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Keeping cool during gaming sessions...",
      "text": "I bought a gaming laptop about a year and a half ago. I love it, it's great, it handles my light gaming well... But it gets so hot. I purchased the Tree New Bee Cooling Pad because it had thousands of reviews and one of the highest star ratings. I'm so glad I went with this product. It keeps my computer much cooler when I play games; in fact, the temperature difference with and without it is incredibly noticeable. I've had the product for a couple months now and I've had no issues. If you find your laptop gets extremely hot, I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndal C.",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Good cooler but problems with shipping and cable",
      "text": "The cooler works very well and the variable speed knobs for the front and back fans can allow the cooler to run quieter when you want it to which i really like. However when i got the package it was rather banged up and was just shipped in its original box. Also my included usb to usb cable did not work so i had to order another and couldnt even use the cooler until that arrived, so it lost a star for that.",
      "rating": 3.0,
      "verified": true,
      "author": "Walking in comfort",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Smart Purchase",
      "text": "Sorry it took So long to write this review . The cooling pad was for my Son's new collectors edition StarTrek Gaming laptop, I Finally pulled him away from playing LOL long enough to ask how its holding up. He doesn't turn the laptop on without first turning/plugging in the Tree New Bee Pad . It works Great , And Looks VERY Cool (no pun) It was delivered Very quickly and I'm More than Satisfied . Thanks for an Awesome Product And Service. DF",
      "rating": 5.0,
      "verified": true,
      "author": "Ssgt. Frady",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Very quiet yet powerful!",
      "text": "I use this fan for my laptop and home theater receiver. It has two powerful USB powered fans that are very quiet. It has two built in legs to tilt the platform at an angle, however I do not use this feature. It is well worth the money and I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Magnus",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Fantastic Product",
      "text": "Right now I'm shopping on Amazon while streaming Prime movies and my computer is only 31 degrees Celsius, instead of the usual 40-45. This is thanks to my New Bee Cooling Pad. The kick stands in the back prop my keyboard up and they're retractable. It's small enough and light enough that one can take it on a business trip. The extra USB port may come in handy when traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Excellent product/upgrade for any laptop within the size description",
      "text": "Excellent product/upgrade for any laptop within the size description. Helps my laptop perform faster and helps with air flow. Also it looks really cool. However sometimes the tabs at the bottom, to hold the laptop on the pad at an angle, come out of place so when you use it at an angle do not rest a lot of weight on the laptop when using or the tabs will come out of place. You can put them back in place, so its not really a problem as to reassembling them, but just beware of that because your laptop could fall off and onto the ground.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian D.",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "The racket is basically annoying. On my i5 Intel Acer Aspire",
      "text": "I don't leave my laptop running all the time. I only turn on the cooling pad,when I have the laptop on. I had used the cooling pad for less than five hours of running time, when the fan in the lower left started making a clicking sound. It has not stopped, but is running visibly slower than the other three fans. The racket is basically annoying. On my i5 Intel Acer Aspire, when Google Drive updates, my core temp is still in the low 60s, which is not much better than it used to be. I regret this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Doug Barnhart",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Not for online games, with voice chat",
      "text": "Ok so this is a generic laptop cooling pad with nice looks, glows blue, you cannot turn off the light or lower it. It is very loud, to the point that I cant use it for online gaming because my teammates complain they cant hear me because it sounds like I'm in a wind tunnel, basically I have to turn it off during online games.",
      "rating": 2.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20191117
    }
  ],
  "product_meta": {
    "title": "Tree New Bee High Performance Gaming Laptop Cooling Pad for 15.6 - 17-Inch Laptops with (4 Fans) Four 120mm Fans at 1200 RPM, Black (TNB-K0025)",
    "description": "• Our Tree New Bee products are built to the highest quality standards. Specification • 408mm L x 287mm W x 29mm H (16.06in. L x 11.29in. W x 1.14in. H) • Total of 4 fans @ 110mm L x 110mm W x 15mm H (4.33in. L x 4.33in. W x 0.61in. H) • Rated voltage: 5V DC • USB Ports: 2 • Speed: 1200 +/- 10%RPM • Material: Plastic cover and metal net • USB cable length: 60cm (23.62in.) • Weight: 707g (1.59lb.) • Life/MTBF: 10,000 hours Product Includes • 1 Cooling Pad • 1 USB Cable",
    "rating": 4.3,
    "feature_bullets": [
      "【Compatible Laptop】Fancy Buying laptop fan cooling pad compatible with almost all 12''-17.3'' laptop, such as Apple Macbook Pro Air, Hp, Alienware, Dell, Lenovo, ASUS, etc.",
      "【Super Cooling & Quiet】Laptop cooling pad with 4 quite fans create a noise-free & interference-free environment for you. with Green LED, The fans rapid cooling effect prevents your laptop from overheating and is perfect for gaming.",
      "【Ergonomic Design】Ergonomic stand with adjustable height settings to play games or watch movies at the most comfortable angle for all-day viewing. Laptop cooling pad stand can be hidden if you don't need to use it. High and low shield anti-skid mats in the front to prevent laptop from slipping off，design for different thickness laptop.",
      "【Unique USB & Port Desgin】Laptop cooling pad with built-in Two USB ports, allows to connect other USB; with built-in USB cable storage box; Using Nylon braided cable, more cool and durable, also easy to set into storage box;",
      "【Non-Slip Baffle】: Two suppressible non-slip baffle, effectively prevent laptop slipping off"
    ],
    "specifications": {
      "Brand": "Tree New Bee",
      "Item model number": "TNB-K0025",
      "Operating System": "Mac OS X, Windows 10",
      "Item Weight": "1.6 pounds",
      "Product Dimensions": "16 x 12 x 1.5 inches",
      "Item Dimensions  LxWxH": "16 x 12 x 1.5 inches",
      "Color": "K25 with 4 Fans",
      "Manufacturer": "Tree New Bee",
      "ASIN": "B016PMVM7Q",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 16, 2015",
      "Customer Reviews": "4.3 out of 5 stars4,953 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#5,101 in Computers & Accessories"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Cooling Pads & External Fans",
      "Laptop Accessories"
    ],
    "price": ""
  }
}