{
  "website_summaries": [
    {
      "verdict": "Luxuriously pampering, these sheet masks restore moisture and bring back a youthful glow to your skin. The organic ingredients, lack of any potentially harmful additives, and effectiveness in improving skin tone make this our best buy.",
      "pros": [
        "All organic ingredients with no chemical preservatives",
        "Made in the USA in an FDA-approved facility",
        "Suitable for any skin type, even sensitive",
        "The Ecoderma fabric promotes absorption of ingredients into your skin, and won't fall off if you move around during your treatment"
      ],
      "cons": [
        "Somewhat expensive for a box of four masks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Allergic reaction",
      "text": "I used this for the first time Saturday night. My entire face and neck got extremely red and itchy and felt hot. Not just after taking off the mask but even throughout the entire next day and through the evening Sunday. I had to take Benadryl to calm down the redness and itching. Obviously I can't purchase this again. It's too bad but something in the ingredient list gave me the allergic reaction.",
      "rating": 1.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 13,
      "publication_date": 20190121
    },
    {
      "title": "LOVE THIS",
      "text": "It's hard to find sheet masks that don't contain methylparaben, fragrance, or a long laundry list of chemicals that I have never heard of, so I was beyond excited when I came across these organic sheet masks. I love that I know exactly what's going on my sensitive, acne prone skin. I leave this on for about 30 minutes after I cleanse my face and notice that my skin is immediately moisturizer and glowing. Vitamin c is supposed to help with hyperpigmentation and sun spots so I'm hoping to see some results after I use all of the masks. Going to try the Greek yogurt mask next:)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170209
    },
    {
      "title": "Good staple in nighttime routine",
      "text": "I appreciate that these aren't wrapped in plastic like most face masks. Very refreshing and soothing when on. The residue feels just fine under my nighttime moisturizer - no pilling or flaking.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer L.",
      "helpful_votes": 5,
      "publication_date": 20180630
    },
    {
      "title": "Simply the Best!! Your face will glow the day after ...",
      "text": "Simply the Best!! Your face will glow the day after you use it! (I usually put it on after I take a bath in the evening. I wish it goes on sale soon so I can purchase more.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 6,
      "publication_date": 20170119
    },
    {
      "title": "It becomes my favorite!",
      "text": "I was seeking a better skincare routine for my sensitive skin. I tried many kinds of natural stuff and some worked for me, some didn’t. I read some good things about this company(they made everything in house with small batches) and used all 3 different kinds of their select. Among 3, anti aging mask works the best!!! My skin feels so hydrated and I feel like some wrinkles go faint. Now, I am trying to do this mask every Sunday to keep my skin firm and moisturized, and it makes me feel like going to spa every weekend! Hope you guys have a happy moment with this amazing mask!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 2,
      "publication_date": 20190605
    },
    {
      "title": "Great product but too small",
      "text": "I like them but the size is too small for me, more like for normal girl size face.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay Yu",
      "helpful_votes": 7,
      "publication_date": 20160929
    },
    {
      "title": "Simply phenomenal",
      "text": "I order quite a lot from amazon.com for me, and my family, but I don’t usually write reviews. But I am doing it now, because this sheet mask is phenomenal, so I just want to share my thought. I’m 40+ woman living in dry Los Angeles and this is the only sheet mask that is fully hydrating enough to make a real difference on my skin. I applied it before bed and took it off after 25 minutes and then I covered my skin with face oil that I use to lock the moisture longer. On next morning, I definitely noticed my skin fully hydrated and plumped. It is worth giving it a try as a mini home-spa!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "I LOVE this mask!!",
      "text": "I LOVE this mask!!! I have very dehydrated skin especially in winter and sensitive, so I have used several kinds of masks since last year. However, after using this mask a few times a week, I think my skin looks and feels smooth and radiant. Also, it does not have too much fragrance so that I could believe it has organic ingredients. I will keep using this mask.",
      "rating": 5.0,
      "verified": true,
      "author": "Won Cho",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Satisfied and pleased",
      "text": "I thought the products packaging was very cutesy. I bought the package so it came in a little box for you to store the masks in. I am usually picky about my face masks because I don't like the ones where it leaves a sticky residue after peeling it off, but this mask hydrated and brought bounce back to my skin. It smells very clean and spa-like. I am satisfied and pleased with my purchase. Would recommend it to a friend or would make a great gift for someone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170301
    },
    {
      "title": "Helped my rosacea - Love this product",
      "text": "this sheet mask did wonders for my skin - I've had so many problems with my rosacea-induced breakouts and this is the only product that calmed and cleared my skin. I'm so grateful for these! Prescription medications didn't even help me. The only thing I wish were improved with this product: different fit sheet mask. It doesn't completely cover my forehead and nose (half of my forehead doesn't get covered). Also, the eye slits aren't big enough for my eyes. Other than that, this has been a miracle product for me! I already bought my second round :)",
      "rating": 5.0,
      "verified": true,
      "author": "Grace F",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Will repurchase",
      "text": "Luxurious spa feeling from home! It’s definitely a step in my skincare that I look forward to. I put one on after the shower while I watching tv at night for 30min and then take it off and my skin feels so smooth and hydrated. Doesn’t break me out. Clean ingredients. Love! Makes a good gift too!",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle Garza",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "A pleasant experience",
      "text": "I was very pleased with this mask. I’ve been using this mask twice in a week and people around me already noticed the improvement right away. My skin feels wonderful and it smoothes out wrinkles. Also, a good part is no fragrance in it which has been brought to my attention these days when I choose skincare products. One tip is that I store mine in my refrigerator for more fresh and cool feeling. Definitely, recommended for all!!!",
      "rating": 5.0,
      "verified": true,
      "author": "JA",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Detox!!!!!",
      "text": "I wish people understood that you go through a detox when you switch from regular skincare to natural/organic. It lasts 2 to 3 weeks. You may stink and some people even get a rash. With that said, I have tried several natural brands’ sheet masks since I know how good sheet mask works as a simple home treatment for a spa-like effect and this is by far the best. It smells good(no artificial at all), it doesn't leave stickiness on my skin, and it makes my skin feel refreshed and fully moisturized. I love this stuff!!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "I’m obsessed with this mask!!",
      "text": "Recently I've changed my beauty stuff to organic. By doing so, I'm getting knowledgable about good/bad ingredients. This is why I bought Orgaid sheet mask which includes lots of GOOD ingredients, no chemical preservatives. And I'm SO obsessed with its natural but strong effect! It really soothes my skin and lasts so long. Love love love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Best natural sheet masks!",
      "text": "Love the clean ingredients! My face love each mask and I'm looking forward to buying the variety pack again. Other brands always have some kind of perfume while this one did not!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Excellent",
      "text": "Great purchase! I'm a licensed esthetician and use this sheet mask on myself regularly. Super hydrating and leaves my skin very smooth and minimizes my pores. This is a great organic, natural sheet mask, easy to apply and I love the eco packaging. It would also make a great gift! Nice presentation",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "wastage of money",
      "text": "Just the packaging was impressive. It did nothing to my face at all. I had some expectations as this was organic and all.. but i was very much disspointed",
      "rating": 2.0,
      "verified": true,
      "author": "ss",
      "helpful_votes": 2,
      "publication_date": 20180905
    },
    {
      "title": "refreshing and nourishing",
      "text": "Very refreshing and nourishing mask! My skin felt amazing! Also sheet masks are great for scaring your husband with xD",
      "rating": 5.0,
      "verified": true,
      "author": "Butterfly",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "disappointed",
      "text": "The mask did not fit as well as cheaper products and I did not see much benefit after multiple use. Will not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Don’t bother",
      "text": "Just ok. No significant results from mask other than it is cooling onthe face.",
      "rating": 3.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Great mask, affordable, for sensitive skin!",
      "text": "Works well on sensitive skin. No redness, itching or hives from mask. Skin feels smooth, soft, subtlety brighter, even the under-eye areas. Wear one while taking an herbal bath for extra stress relief! Helps restore moisture from hard water (even with a water filter).",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Y.",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "LOVE THIS SHEET MASK!!!",
      "text": "I absolutely love this sheet mask. I bought the product because it was organic and I am trying to eliminate harsh chemicals that I use. With just one time use of this mask, my skin looks and feels amazingly wonderful! Much better than it looked when I was using the other brand. I highly recommend anyone who wants to try all natural and safe skincare for healthy and glowing skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia ",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Works for all skin types!",
      "text": "Love this product, my skin feels so soft and looks so youthful after every used. The only down side is that my eyes get very watery every time I use them, other than that, they work wonderfully.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Bad reaction",
      "text": "Caused my face to be red and irritated the next day. Had a bad reaction! Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Sparacia",
      "helpful_votes": 2,
      "publication_date": 20180815
    },
    {
      "title": "Best. Mask. Ever.",
      "text": "This mask worked well with my sensitive skin. I applied it to freshly washed face. The sheet was soothing and formed perfectly. Keeping it on for a little longer than 20 mins, left my skin feeling refreshed and moisturized. I would highly recommend this mask to anyone who is looking for a great all around face mask. It is also organic and made in the USA.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "I have sensitive and dry skin and this mask works ...",
      "text": "I have sensitive and dry skin and this mask works well on me! Very moisturizing and the product was throughly absorbed by skin. But the sheet is on the thick side though and not always stay firmly on face, which I don't mind considering the results! Buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "kimoo kim",
      "helpful_votes": 2,
      "publication_date": 20170114
    },
    {
      "title": "which is perfect for dry weather",
      "text": "I use a facial mask sheet at least once or twice a week. When I used this ORGAID brand, it seemed staying on my skin long, and I felt my skin was moisturized until the next day, which is perfect for dry weather. When I opened it, I could see the sheet contains solutions rich in nutrition. Also, the sheet is well made to adhere to the skin better than other ones, so it is absorbed well. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "kristoffer copon",
      "helpful_votes": 2,
      "publication_date": 20170123
    },
    {
      "title": "It feels good knowing the ingredients are organic",
      "text": "Very moisturizing and effect lasts until next day. It feels good knowing the ingredients are organic.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 3,
      "publication_date": 20170317
    },
    {
      "title": "BEST Mother's Day gift",
      "text": "Since I couldn't go get a facial (due to COVID) I decided to give myself a facial at home on Mother's Day. These masks felt amazing! My skin was so nourished and glowing when I took it off. I will definitely buy them again. PS. The packaging is beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine I Wied",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Great product! My skin feels amazing",
      "text": "I have very pleasant experience with Orgaid Greek yogurt sheet masks before. So, I purchased Vitamin C sheet mask to try and the results are way better than I expected. The sheet gently hugs me with cooling effect and changed my skin to very hydrated and soft. I will definitely purchase more!",
      "rating": 5.0,
      "verified": true,
      "author": "Mk",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Must try",
      "text": "These are the best. I try everything love these masks",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Allen",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "The best cleanest mask I have tried so far!",
      "text": "All the ingredients are healthy. The packaging is simple; no plastic. This is a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "dea",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Not worth the money",
      "text": "It didnt do any improvements to my skin. Facial cut outs did not fit my face. Ill fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Franziska Coleman",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Expensive but value for money mask",
      "text": "I like this mask that make my skin very moist and whitening. The serum absorb quickly and no worry about the ingredients as they are all organic.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorganic",
      "helpful_votes": 2,
      "publication_date": 20170109
    },
    {
      "title": "It does the right thing!!!",
      "text": "Love, love, love this vitamin c sheet mask! Smells just like lemon&lime and non sticky afterwards. It's perfect as a home treatment on a daily basis which is more convenient and economical than going to a spa. Truly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Doo C.",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Allergic reaction to an ingredient?",
      "text": "This product turned my face red and hot and it was red the day after. I tried again a few months later but same result. Not very comfortable for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunny",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Pampering!",
      "text": "Great way to, inexpensively, pamper yourself & take care of your beautiful skin. Enjoy yourself ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "A little disappointed",
      "text": "Am very impressed with packaging. I assume it is recyclable. Like the ingredients for the most part, but there are things in this which can be irritating. Each time I’ve used these, feel an unpleasant stinging sensation, which means it’s not good for skin. Might try some of their other masks, but this wasn’t soothing at all and I didn’t notice any results. Am an almost daily sheet-masker, but these are a miss for me. 😕",
      "rating": 3.0,
      "verified": true,
      "author": "None",
      "helpful_votes": 4,
      "publication_date": 20180219
    },
    {
      "title": "Five Stars",
      "text": "love this product it works, been using it for 4 months now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "The perfect hydrating mask",
      "text": "I was skeptical at first, but this mask was so hydrating! My face looked amazing after. Will definetely be purchasing againnnn and trying their other masks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Five Stars",
      "text": "It is great after you chill it in the refrigerator!",
      "rating": 5.0,
      "verified": true,
      "author": "Kwong",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "By far the best sheet masks on the market",
      "text": "By far the best sheet masks on the market. No chemicals or words I can't pronounce. Just quality, organic ingredients. I love the way my face feels after I use the mask.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "A Must Buy",
      "text": "I absolutely love these face masks. I have normal type skin and apply the mask after dermarolling my face. My skin is left refreshed and soft. I just bought more and would recommend to friends. The sheets are thin and adhere perfectly to my face.",
      "rating": 5.0,
      "verified": true,
      "author": "Megnmcg",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Works!",
      "text": "Love these masks. Well worth the price to me. Skin feels soft and moisturized unlike any product I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Caborn",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Best sheet mask ever!",
      "text": "These masks are amazing! I've tried so many that felt nice on my face but didn't have a huge impact on how my skin looked after. These make your skin GLOW. I go without foundation for days after using these!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161229
    },
    {
      "title": "This mask is exactly what I need!",
      "text": "My friend strongly recommended me this mask. So, I tried it and LOVE it. It doesn't make any trouble on my skin and works wonders! Looks like reducing pores, making my skin tighter. Hope many others try too!",
      "rating": 5.0,
      "verified": true,
      "author": "Eun",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "These are the best !!",
      "text": "Love love love these masks. Reduces redness over night and I wake up with amazing skin",
      "rating": 5.0,
      "verified": true,
      "author": "Lauryn",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "First I should mention that I really like the package",
      "text": "First I should mention that I really like the package! How cute it is! I didn't expect much on this initially as for many other similar products. But this thing is different. It's mask design is a little bit different in a way that it allows firm holding on my face. Also it has lot of liquids so that I can apply it with my neck. After a week usage, I felt a difference! My skins are much more moisturized than before. I definitely recommend this to anyone (don't worry about allergic reactions, as they use 'organic' materials and the mask works for me who has sensitive skin) and will buy it again for my family!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160404
    },
    {
      "title": "It is the Best!!!",
      "text": "It is awesome!!! I'd like to recommend this item for this season..!! I love this..",
      "rating": 5.0,
      "verified": true,
      "author": "Ji-hyun Kim",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "I think this vitamin sheet is the best for sensitive skin for that reason",
      "text": "After I used this mask, I bought some more for my friends and family as a Christmas gift since it is highly recommendable. The sheet is very thin but contains lots of condensed solution. I normally apply the sheet for about 20-30 minutes and it's still soft and moist. I don't get any rashes after using these due to the organic ingredients. I think this vitamin sheet masks are best for sensitive skin for that reason.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrisco",
      "helpful_votes": 3,
      "publication_date": 20170202
    },
    {
      "title": "Didn't see it working better than other products",
      "text": "Bit overpriced for its effectiveness. If you want something organic, I guess the price is justified. Didn't see it working better than other products",
      "rating": 4.0,
      "verified": true,
      "author": "Us702",
      "helpful_votes": 3,
      "publication_date": 20160331
    },
    {
      "title": "They're easy and she says that they make your skin soft ...",
      "text": "My wife LOVES these. They're easy and she says that they make your skin soft and create a glowing effect. I can see the difference as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Vaderpool",
      "helpful_votes": 3,
      "publication_date": 20160604
    },
    {
      "title": "Best sheet masks ever",
      "text": "The leftover serum in the packet lasts me a good 3 days. Just pour the serum in your palm and use the leftover. My skin looks and feels great with these.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Spa treatment at home",
      "text": "I've been using this for weeks now, and I am super satisfied with its quality for the price I paid. I have used sheet masks from high end brand to cheap ones out there, but this one is so far the BEST. Its like having a spa quality treatment with the money I would spend on a cup of coffee. And they say its all made with organic stuff, so thats awesome! I would definately recommend to my friends and infact I am stocking up for b-day gifts for my friends. I can't wait to see more product from this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Brown",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "after putting on my face for 5 minutes, it's ...",
      "text": "after putting on my face for 5 minutes, it's already starting to dry out. There isn't a lot of liquid or essence in those sheets to begin with...",
      "rating": 3.0,
      "verified": true,
      "author": "Qiu Yilan",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "It feels like this sheet mask soaks up all the dirt out ...",
      "text": "I used this after work and before I sleep. It feels like this sheet mask soaks up all the dirt out of my skin, which is perfect right before sleep. I would definitely recommend to anybody that's looking for sheet masks to use regularly. It's pretty neat. Also a great, easy gift for almost anyone. You would enjoy them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyu",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Five Stars",
      "text": "Haven't tried many sheet masks, so cant compare to cheaper options, but made my skin smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Webb",
      "helpful_votes": 2,
      "publication_date": 20160623
    },
    {
      "title": "Caused face to turn red",
      "text": "This mask turned my face very red the next morning.",
      "rating": 1.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 4,
      "publication_date": 20180124
    },
    {
      "title": "These are my new favorite face masks EVER!",
      "text": "I eat organic so I want to put organic on my skin too since product can get in our bloodstream that way. Super happy I found these masks. I like that there is no peel-off plastic on the mask that goes in the trash. Just unfold and smooth it on. The shape fits my face better than most too...maybe it is more pliable. The juice that's on these is awesome. Leave my skin soft and glowing. I use these once a week now before bed. Really impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "happyveg",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "It keeps my skin glow and firm all day long!",
      "text": "I love vitamin c and it really works for my dry, spotty skin. This vitamin c sheet mask works the best among other vitamin c moisturizers or serums. Whenever I use serum or cream, I feel like they are gone away in a couple of minutes. However, this sheet mask really stays on my face and feels like delivering all the serum into my deep skin. Even after taking it off, I still feel very hydrated and it looks like fading brown spots on my face. And the good thing of sheet mask is that I can apply makeup right after removing the sheet, and it keeps my skin glow and firm all day long. I really like it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "HJC",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Excellent Face Mask with Great Ingredients",
      "text": "I’ve been trying to update my skincare with products that contain truly clean ingredients. Finding a face mask that has only clean ingredients was difficult. This was the only sheet mask and brand that I could find without harsh/harmful ingredients and I will continue to use these masks. They are definitely worth the purchase/investment and your skin will benefit as well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Smith",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "One of the purest masks on the market",
      "text": "I bought this as a gift for a friend. I shopped options based on the purest ingredient profile I could find. I've seen her use it a number of times and she always raves. She's very particular about her skin care and especially about her masks and has probably used dozens of brands. She said this is the finest mask she's ever used, the main thing she likes is how all of the liquid is still in the mask when you take it out of the package and not in the bottom of the package, and the how the mask is nearly bone dry after taking it off so you know the liquid absorbed into your skin. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh B",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Maybe not for sensitive skin",
      "text": "I love to use organic sheet masks, but I think this brand is nor for me, it caused me itching, small red spots, burns my eyes, so no, I do not think is good for sensitive skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Gonzales",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Clean Ingredients with Great Results!",
      "text": "You can see results from this mask immediately and the next morning, the results are even better! My skin looks hydrated and glowing afterward. For reference, I have sensitive, acneic skin and these do not break me out or cause any redness. Can’t say the same for the other two masks in this line, but that’s just my skin. I’ll be a fan of these for life!",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Skin rash! Beware...",
      "text": "I was so disappointed in this product. My husband and I tried this and we both had a really bad reaction to it. My face got really red and my spouses face immediately got tingly and irritated. Neither of us have sensitive skin and use masks regularly. Will not purchase from this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristy Phillips",
      "helpful_votes": 7,
      "publication_date": 20180520
    },
    {
      "title": "Short on delivery",
      "text": "I was looking forward to a good facial and was disappointed. The sheets did not cover all of my face, and, they are not as easy to apply as others I have used. I do not plan on ordering this product again.",
      "rating": 2.0,
      "verified": true,
      "author": "Darlene  MF",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "These are great masks! My face feels and looks so hydrated ...",
      "text": "These are great masks! My face feels and looks so hydrated after using them. I just wish they weren't as expensive as they are, but I appreciate how natural they are and how effective they are.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous Review",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Unhappy",
      "text": "Was very disappointed that although the product is made with natural and organic ingredients and made in USA, it has with ‘selective global sources’ which I am not happy about. Will not buy again because of that.",
      "rating": 1.0,
      "verified": true,
      "author": "Hope2018",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "I really like this product",
      "text": "I really like this product! I have very sensitive skin and it did not irritate my skin at all. It left my face feeling soft and glowing. I recommend it to all my friends and family!",
      "rating": 5.0,
      "verified": true,
      "author": "MultitaskingManhattanMama",
      "helpful_votes": 3,
      "publication_date": 20161219
    },
    {
      "title": "Five Stars",
      "text": "Good for my skin! Awesome product.. has a lot of serum in the package! Will get more!",
      "rating": 5.0,
      "verified": true,
      "author": "KPR",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Brightens & helps acne scars ✨",
      "text": "By far the BEST face mask I’ve ever used. I get a facial by a professional every month and this is her go to. I finally bought them for home use and you will not be disappointed. Helps brighten my face and helps reduce my red acne marks! ✨",
      "rating": 5.0,
      "verified": true,
      "author": "tailor j.",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Five Stars",
      "text": "These are the best! I have tried so many and i will be sticking with these!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Lombardo",
      "helpful_votes": 2,
      "publication_date": 20180129
    },
    {
      "title": "Worth every dollar",
      "text": "In my 50s. Mad dash to minimize wrinkles. Tried mid to low end $ products (Dermatologica, Clinique, Lancôme, Vanicream, Nivea, L’Oréal). Adore this product, will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Refreshing and soothing",
      "text": "I am very picky about what I put on my face. I was pleasantly surprised with this. It felt and smelled like I had just used fresh ingredients to make it. Not the kind of scented 'fresh', but more like a freshly sliced cucumber type fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Totally lovely!",
      "text": "I love these, they are super gentle and hydrating. I have acne prone skin, and these really help to calm any angry spots.",
      "rating": 5.0,
      "verified": true,
      "author": "AModernGal",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Absolutely love these face masks",
      "text": "Absolutely love these face masks. Been trying to find a fragrance-free sheet mask for so long and these are amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "... wearing one of these - left my skin feeling pretty good though",
      "text": "I think I scared the wits out of my kids while wearing one of these - left my skin feeling pretty good though ... kinda pricey.",
      "rating": 4.0,
      "verified": true,
      "author": "Shiolet",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "Baby soft skin with healthy ingredients",
      "text": "My skin feels soft and so smooth! I wish I had enough to use them daily!",
      "rating": 5.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Great Moisturizing and Smoothing",
      "text": "Liked the fact that there was a very subtle scent. Great product although a bit overpackaged.",
      "rating": 5.0,
      "verified": true,
      "author": "JLM",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Must have product during winter",
      "text": "Love this product! It’s a weekly must during the cold Canadian winters!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Five Stars",
      "text": "I kept getting compliments on how my skin looked after this facial",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Kim",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Five Stars",
      "text": "Best mask ever so addicted to this brand. My face looks young and beautiful .Will defenetly buy it again .",
      "rating": 5.0,
      "verified": true,
      "author": "Oana",
      "helpful_votes": 2,
      "publication_date": 20160319
    },
    {
      "title": "Safe alternative to the other sheet masks on the market!",
      "text": "This is a safe alternative to the other sheet masks on the market. Ingredients are organic and safe for use on sensitive skin. I thought these would be rejuvenating/fun to use after a stressful day at work or on a day off and so far I've used one sheet mask. They are easy to apply, fun to use, and I like the ingredient list.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 3,
      "publication_date": 20160724
    },
    {
      "title": "I am still using it and possibly will purchase another until I find better (in terms of effect and safety) one",
      "text": "I am using my second sets of the mask pack, and I do not observe that special effect yet. However, this is organic mask pack and no troubles occurred, I am still using it and possibly will purchase another until I find better (in terms of effect and safety) one. Almost no smells, which is good to me.",
      "rating": 4.0,
      "verified": true,
      "author": "User100",
      "helpful_votes": 4,
      "publication_date": 20160331
    },
    {
      "title": "Love this product! Skin is nicely hydrated!",
      "text": "This is the nicest sheet mask I have ever experienced! I love that it's an organic sheet mask. I also love the feel of the mask and how near translucent it is and that it stays in place while i perform simple stretches. I love how it feels when the face is bring hydrated and repaired from the damage it experienced from the the sun and stress from work. It slowly allows my skin to absorb the ingredients. All the extra serum from the package, I massaged onto the dry hands not wasting any drop. Paid full price for the product and worth every penny!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Wynn",
      "helpful_votes": 7,
      "publication_date": 20160417
    },
    {
      "title": "On the right track but not there yet.",
      "text": "My skin wasn't hydrated at all by these. While wearing them it gives off a funky scent. There's also a lot of citrus ingredients and there's no scent of it at all. Make your own for an immensely cheaper, and fresher, experience that will actually refresh and moisturize.",
      "rating": 2.0,
      "verified": true,
      "author": "RayChu",
      "helpful_votes": 6,
      "publication_date": 20161004
    },
    {
      "title": "Love.",
      "text": "Love.Love.Love this mask! Really plumps the skin and gives it a youthful glow. Buy a six pack -- individually packaged, so it comes in handy as a last minute gift for a friend, too!",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20160504
    }
  ],
  "product_meta": {
    "title": "ORGAID Organic Sheet Mask 4-packs (Anti-aging & Moisturizing)",
    "rating": 4.5,
    "feature_bullets": [
      "Safe and organic ingredients",
      "No harmful chemical preservatives",
      "Made in the USA",
      "Ecoderma sheet technology",
      "Unique efficient formulation by Dr. Baek"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.7 x 0.6 x 6.7 inches; 4.94 Ounces",
      "Item model number": "OSM12",
      "UPC": "860451000239",
      "Manufacturer": "ORGAID",
      "ASIN": "B016SCEN06",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Masks"
    ],
    "price": 22.0
  }
}