{
  "website_summaries": [
    {
      "verdict": "A solid choice for the budget-conscious consumer – has as much to offer as most competitors for a money-saving price.",
      "pros": [
        "Has a lot to offer for a price the competitors can't beat",
        "Reasonable light and noise filtering insulation, several stylish color options, and grommets",
        "Washes nicely"
      ],
      "cons": [
        "A few reports of mismatching lengths",
        "Not quite as wide as some competitors",
        "Only one panel per pack, but still less costly than others"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Low quality garbage. Claiming they're black out curtains is just false ...",
      "text": "Low quality garbage. Claiming they're black out curtains is just false advertising. The sun can still be seen through them. They're full of runs top to bottom and the stiching is pulled out in some areas at the top. What was almost comical is I noticed something didn't look right about the center rings. As you can see in my picture, the center rings on the right are super close together, and the on the left they're spaced evenly. Is it that noticable when hung, not exactly, but it's ridiculous that they would even be packaged and sent out like that.",
      "rating": 1.0,
      "verified": true,
      "author": "Jordan G.",
      "helpful_votes": 377,
      "publication_date": 20180730
    },
    {
      "title": "Love These Curtains.  Helps Keep Light Out",
      "text": "Okay not perfect. Some light shows through. Not fancy and yes hems are not perfect. Saying all this I am very happy with these curtains. They do not block noise as some have said, I wish they did since my neighborhood is party central. But they are simple easy to hang and I am order more. I got the dark gray. I included pictures to show how light does come through but it’s not a blinding stream of light that used to wake me early every morning. If you are a perfectionist these may not be for you. For the price and the job they do I love them",
      "rating": 5.0,
      "verified": true,
      "author": "J S",
      "helpful_votes": 157,
      "publication_date": 20181226
    },
    {
      "title": "Dark room, happy napping! :)",
      "text": "Love them!.. I had black curtains before and you can notice the huge difference!.. I ordered 2 of the 42x63 and they fit perfectly. The sun doesn't come in anymore, and my room doesn't get as hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Araceli",
      "helpful_votes": 685,
      "publication_date": 20160328
    },
    {
      "title": "These are soft and nice quality! They do block out a good amount ...",
      "text": "These are soft and nice quality! They do block out a good amount of light and I'm very happy with them! I would buy again for sure. Fast shipping too! (I was not offered any free products for my review)",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Rauer",
      "helpful_votes": 200,
      "publication_date": 20170107
    },
    {
      "title": "Stunning",
      "text": "It is stunning. I love the dramatic look. We wanted to blend in the 70\" TV. The curtains are not lined but still seem to do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherrie Lebron",
      "helpful_votes": 144,
      "publication_date": 20170103
    },
    {
      "title": "LOVE!",
      "text": "These curtains are amazing! They could easily sell for two or three times the price. They don't wrinkle, and they feel so nice (kind of soft) to the touch. I have them in light grey and they fully block out the light during the day. I hung them on a bay window in my baby's room. They look gorgeous!",
      "rating": 5.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 120,
      "publication_date": 20161203
    },
    {
      "title": "Really disappointed with these curtains",
      "text": "Really disappointed with these curtains. First of all, I ordered 2 panels- they are not only different sizes (one is a few inches shorter than the other) but they are also different colors- I ordered \"off-white\" and one came off white, the other one is sort of beige. The also do not block out much light in our west facing room. It's very thin material and I would avoid buying these, spend the money on better ones.",
      "rating": 1.0,
      "verified": true,
      "author": "Breezy",
      "helpful_votes": 17,
      "publication_date": 20180515
    },
    {
      "title": "What a difference!!",
      "text": "Wow, my room in the middle of the day is now as dark as night! Great for day sleepers!!",
      "rating": 5.0,
      "verified": true,
      "author": "Well Read Btch",
      "helpful_votes": 14,
      "publication_date": 20181219
    },
    {
      "title": "\"Blackout\" Curtains...",
      "text": "It's 8:30pm in June and, despite no direct sunlight, these curtains still let light shine through the fabric. In the photo I took you can clearly see light coming through the \"blackout\" fabric. We purchase these curtains for our childrens' room that has an west-facing window that gets direct sunlight at 5:30am. But if these can't keep out dusk light how can they possibly keep out direct morning light??? Do yourself a favor and buy something else or buy double the panels and layer two for each side of the window...",
      "rating": 1.0,
      "verified": true,
      "author": "Iain0707",
      "helpful_votes": 10,
      "publication_date": 20190615
    },
    {
      "title": "These are the worst \"curtains\" I've ever seen",
      "text": "Don't buy these!! These are the worst \"curtains\" I've ever seen!!!! They are just a cheap piece of fabric poorly sewn. None of the panels match in size, and 2 of the 3 panels have snags across the width of the material. The material is so thin in places the sunlight shines through. Horrible purchase!! No stars is what I give them!!",
      "rating": 1.0,
      "verified": true,
      "author": "Angela Brandt",
      "helpful_votes": 30,
      "publication_date": 20160801
    },
    {
      "title": "You're going to LOVE them!",
      "text": "These are amazing at blocking out the light yet so beautiful you'd never know they were room darkening curtains! There is no tacky plastic stuff making the curtains stiff and ugly looking. They're soft and very well made and look just as pretty hanging on your window as they look in the picture shown. Loved them so much I went back and ordered more in different colors, and they're just as pretty! If you want to block out annoying outside light from street lights, traffic, neighbors with over powering outdoor lighting, but still want beautiful curtains then these are for you! And they come in multiple sizes! Beautiful!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy O.",
      "helpful_votes": 6,
      "publication_date": 20171014
    },
    {
      "title": "Not the right length.",
      "text": "Ordered the 84\" length and received 63\" length on two separate panels ordered. The sticker on the packaging says 84\" but they were shorter than my current 63\" curtains. Returning and buying a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "GumballWizard",
      "helpful_votes": 13,
      "publication_date": 20170126
    },
    {
      "title": "Happy with purchase",
      "text": "Thicker material but not thermal lined. No rips in the seams. Overall satisfied for price and material!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 65,
      "publication_date": 20160306
    },
    {
      "title": "Not for east or west facing windows.",
      "text": "Doesn't work if your window faces the sun. You can see in the photo that it doesn't block out much of the sun at all on our east facing window. Once the sun gets over the house and is not shining on the window they work alright but it defeats the purpose if it can't handle direct sunlight.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 8,
      "publication_date": 20180915
    },
    {
      "title": "Great buy",
      "text": "These work better than the expensive blackout curtains with that awful backing that breaks down in the washer. I've been telling everyone I know about these curtains. The grey isn't too dark and lets in just a touch of light, so if you want more darkening maybe black is better. I just needed to block enough sunlight to have my AC not work so hard in the summer and block enough light to watch TV and work on my laptop without glare.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 2,
      "publication_date": 20190623
    },
    {
      "title": "Great Buy",
      "text": "Got these to keep out cool air that seeps in during winter and to keep closed in summer on hot days to keep room from getting too hot from sunlight. And also to keep room dark while sleeping. This color works great for all 3. Also have a beige color that works well except for keeping room dark which I did not want to do in the room I have them.",
      "rating": 5.0,
      "verified": true,
      "author": "HEATHER",
      "helpful_votes": 3,
      "publication_date": 20190430
    },
    {
      "title": "Blackout Curtains are a Knockout!",
      "text": "Beautiful, excellent quality, REAL SATIN, silver rings at top are modern looking and gorgeous. These curtains are not for you unless you truly want BLACKOUT. They were a little too long, but I believe that is my fault when I ordered them I was thinking I didn't want them too short at the ledge and they might look more decorative slightly passed the window seal. It's ok. They do EXACTLY what they say and are EXACTLY the quality mentioned. Excellence.",
      "rating": 5.0,
      "verified": true,
      "author": "stonemax11",
      "helpful_votes": 2,
      "publication_date": 20190622
    },
    {
      "title": "Peeping Tom's Paradise",
      "text": "I mean they ARE pretty however, they aren't room darkening or thermal insulated. You feel and see everything as evident by the fact that my neighbor called and said he could see in my window. Which, is troubling because I was changing at the time. So, one star for being pretty and one star for being the right size but anything else, well I hope you don't like privacy.",
      "rating": 2.0,
      "verified": true,
      "author": "satiana",
      "helpful_votes": 4,
      "publication_date": 20180308
    },
    {
      "title": "Nice Quality For The Price",
      "text": "I purchased these a month ago for a bedroom and liked them so well, I purchased another set. As a side note, you have to purchase two because they are not sold in a set i.e., only one panel per package. The material is heavy enough that you cannot see thru, but, not enough so your room will be dark as a cave. Straight out of the package requires ironing due to all the creases where they were folded. All in all, these are a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "JLC740",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "NOT blackout, and no sound proofing at all. But they are nice curtains....",
      "text": "These would are BEIGEOUT curatins, Did not make the room dark, they are not thermal and no sound proofing at all. And It's just regular fabric, it's not going to block out any sound or cold, seriously, how can they even say that?!? To compare, we also purchased the NICETOWN curtains that have black liners attached and those darkened the room immensely, but much more expensive, natch.",
      "rating": 1.0,
      "verified": true,
      "author": "JavaJed",
      "helpful_votes": 3,
      "publication_date": 20190805
    },
    {
      "title": "Beautiful color, works perfectly",
      "text": "I love these curtains. I bought them for my spare bedroom when recently redecorating and they tie the room together perfectly as the room is very bright and cheery. I also have these in my bedroom, black ones, and I can attest to them completely blacking out any light. They're heavy and well-made and the yellow color was just as described. I would highly recommend these curtains!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica J.",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Street lights were keeping my daugther awake... these curtains solved the problem",
      "text": "The Deconovo Room Darkening Thermal Insulated Blackout Grommet Window Curtains were ready to go right out of the box. They arrived quickly and were well packed. We opened them up and hung them immediately. The large metal-clad grommets made for easy installation and look great. I took these pictures on a sunny afternoon. The first picture is without a flash to show how much sun they are blocking out, and the second picture is with a flash to show how the curtains look. We did not make a special effort to blackout all of the light, so you can see they do a pretty good job. Overall, I think they were an excellent purchase for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "EricinHuntersville",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Love these curtains!",
      "text": "I have 3 sets of these curtains - two pairs for two sets of windows on adjacent walls in my bedroom, and one set for my son's room. These curtains are thick, black, and made of heavy material. When we first opened them they had the typical expected fold mark creases, but in a few days after hanging the creases disappear. You could also iron them if you wanted, but it would eventually be unnecessary. These curtains completely black out the sun, and are the best quality black-out curtains that I've come across (and due to my insomnia, and incredibly light sleeping, I've tried at least 5 others brands thus far). Highly recommended, would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Good for the price. Makes a perfect \"liner\" to darken the room.",
      "text": "These are not totally light blocking, but are better than the curtains that I already had. I wanted a lighter color but went with the dark blue, figuring it would block the light better than light colors and I do believe it does. What I ended up doing was doubling up my curtains, using these dark blue ones as \"liners\" behind my lighter green ones, and the result is awesome light blocking curtains! For the price, they are good. I think it's difficult to find true light blocking curtains without paying a lot of money. I washed these, put them in the dryer for 15 minutes to take wrinkles out, and then hung them.",
      "rating": 5.0,
      "verified": true,
      "author": "meadowlark",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Love Them!",
      "text": "I love these curtains! I've bought three sers, two sets in black and one set in turquoise. The turquoise is bold, the black being truly black and not faded. The curtains didn't wrinkle after washing/drying/hanging and they block the majority of light; obviously the black blocking more than the turquoise. The only downfall is I've found it a bit too easy to oversleep and more difficult to wake up my kids, lol.",
      "rating": 5.0,
      "verified": true,
      "author": "AMD",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "This is a single panel but it is very wide",
      "text": "Maybe I shopped too many curtains because I thought I ordered 2 sets of two panels not 2 single panels. I bought these to put behind my existing curtains that are pretty but let light through. My curtain rod is set up for two rods, so I thought this would be good solution. They block out the light. They're thick so they're probably also keeping cold & heat out of my room. They're wide, so they cover the entire window, it's just awkward to open and close them vs moving two panels apart. They seem to be of good quality, grommets are spaced properly, stitches are uniform.",
      "rating": 4.0,
      "verified": true,
      "author": "M. J. Marsallo",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Doesn't darken the room like Navy or Black colors",
      "text": "I love the Deconovo Room Darkening curtains...as long as you get the navy or black. Those colors really are room darkening. The lighter silver color dims the light coming into the room, but does not darken the room like the darker color curtains. If you truly need a darkened room, go for the black or navy colors. I started out with the navy in my room and switched to a lighter color when I had to replace them. Big mistake! While the curtains filter the light, they are not truly room darkening in the lighter colors. More like room dimming.",
      "rating": 3.0,
      "verified": true,
      "author": "C Purnell aka Sailor",
      "helpful_votes": 2,
      "publication_date": 20171106
    },
    {
      "title": "Really nice for the price",
      "text": "We bought these for a baby boys nursery. The sun hits the window when the sunsets so it gets full direct sunlight and needed something that would block the light. These do a really nice job. I'd say 9 out of 10 when it comes to blocking the sunlight in our window. It allows little to no light in and will allow our little boy to sleep without being woken up by light in his face. Thats all I could ask for. A big plus with these is the feel. They are incredibly soft. I've had other black out curtains and the feel tough do to the material. These are soft to the touch and is a big plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Amazing product",
      "text": "These curtains are great. They are perfect for blocking out all light from my apartment complex. They also keep my room cooler in over 100°F weather. My son splashed some very red punch on them and they did not stain and are easily washable. They do not wrinkle even when tied back daily. These are lighter than most blackout curtains I have tried. They are a bit shinier than I thought, but overall blend in well to my room decor.",
      "rating": 5.0,
      "verified": true,
      "author": "AwsmSteph",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Wouldn’t do without them!",
      "text": "If you live in the South you know the value of anything that reduces the heat on a triple digit day. We’ve had far too many of these super heated days so I’m grateful for these curtains. They significantly reduce the heat in a room, allow a little less wear and tear on our a/c unit, and are a real saver on our summer bills.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather H.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Absolutely horrible!!!",
      "text": "First of all it makes it seem as though you get the full set up when in reality you have to buy double what you need so already horrible salesmanship. Terrible quality and will not unwrinkle! No matter how much ironing you do or washing it is terrible. I am so annoyed I waited so long to hang these because now I can’t even return them. These will be going directly In the garbage. Beyond angry with these",
      "rating": 1.0,
      "verified": true,
      "author": "Jen Gambuti",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Pretty good",
      "text": "Not bad. Bought one for the nursery and even though I can still see lights through it, it dims the room enough. Not a complete blackout. Maybe if it was black color and bought 2? I bought 1 navy. The material seems soft and nice but did came wrinkled. Overall, it's decent for the price. The window was 36\" wide and this curtain was 42\". It covered the window fine, just need it stretch flat, and if I really don't want to see lights through curtains, I think 2 curtains will do the job but seems too much for a small window.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica Dingle",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Love these",
      "text": "Have 3 windows that get direct sunlight, in Ca with many days 90-106° wanted to block out the sun and heat. These work great!! So much cooler in there before. I also have the gray ones in my bedroom. My in law has the white ones and they are not equal to the red or gray at all but still pretty just not light blocking. I have the red and gray and they are great couldnt be happier. Using tenton rods so in the winter we can take them down and have open windows, we living in the country and dont need to block out neighbors",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth L. Cook",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Looks really nice!",
      "text": "Mother-in-law needed blackout/thermal drapes and I thought I'd give these a try. They look great (still fold-wrinkles from the package) and really blackout her room. Hopefully, they'll be thermal this winter - time will tell. I bought a pair but when we hung them she decided on a fuller look so I just ordered another pair. These are nice because at 89 years old all she needs to do is slide the grommets to open or close them. She really loves the feel of the fabric too. Soft and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "J. L. Clark",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Not bad for the price",
      "text": "The only reason why I don't give this 5 stars because it doesn't cover the window all the way you can still see things on the side from looking outside of my window if I have the lights on but other than that is definitely pretty it definitely does darken the room where the sun is not shining and hopefully as we get to the winter months it helps keep the house warmer I wish there was a quantity of 2 when you purchase one because when I first bought this I thought that I was going to have two curtains",
      "rating": 4.0,
      "verified": true,
      "author": "Seleda",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Good quality. Color is not as pictured.",
      "text": "Great product but, I ordered two sets in two different colors and both colors were not what I expected from the pictures. The beige is very close to gray rather than tan. And the darker beige is an odd brown color. I wish I would’ve bought the white/ivory looking color as I suspect that’s probably closer to a light beige. On the plus side, they are well made and keep out light and also keep a/c in and heat out. They also were 100% wrinkle free right out of the box.",
      "rating": 4.0,
      "verified": true,
      "author": "Apryl",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "DIfferent material than others I ordered",
      "text": "I have this brands black out curtains, in Navy with Silver / metallic highlights. The Navy/Silver ones I have completely block out the light! At night, I can't make out my hand in front of my face - that kinda dark. It was disappointing to order the same drapes in a solid Navy and receive a thinner material - which does not block the light as well. When I opened the package, I could see my hand behind the drape, it was that thin - where the other sets with the silver - no way to see thru....",
      "rating": 4.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Would recommend and purchase again",
      "text": "My living room has a large bay window that does nothing to minimize the intensity of the sun. I have attempted many variations of trying to keep the house energy efficient without turning it into a cave. However, I was redoing my living room colors and decided the curtains needed to change too. I didn't want to spend a lot and I didn't want the black out curtains with the white backing.... these are amazing! Nice khaki like color on both sides , nice material and they do a great job blacking out the sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Bbrl00",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Great curtains, disappointed in color",
      "text": "It was hard to get a good picture of these showing the true color, but the light purple was definitely not light. The picture shows almost a periwinkle, and these are definitely more like a grape. Disappointed in the color, but not the quality. this is actually my 3rd time ordering these for my girls bedrooms. I've had the lilac and the pink, both lovely. They do a great job of keeping the room dark for naps and block the street lamps. Only gave 4 stars because of the color.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Do the Trick",
      "text": "I order the light grey and dark grey curtains and kept the light grey (you could hardly tell a difference between the colors and the light grey was less expensive). They work really well, especially for the price. I will say though that they don't make the room pitch black, some light does seep through the fabric! They came exactly as described though and if you don't want to invest a lot of money, these are very worth it!!",
      "rating": 5.0,
      "verified": true,
      "author": "mk342",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Not fully opaque",
      "text": "I purchased these curtains in light beige. They are not fully opaque, true blackout curtains like you might find in a hotel. They do block quite a lot of light - enough for the room I'm using them in. I'm actually very happy with them, but taking off two stars because they are not really blackout curtains as advertised.",
      "rating": 3.0,
      "verified": true,
      "author": "E.C.",
      "helpful_votes": 4,
      "publication_date": 20160816
    },
    {
      "title": "Just what I needed",
      "text": "These block out light enough for me to sleep in past sunrise again. Also my room is DARK at night instead of neighborhood lights shining in through the blinds. Keep in mind that darker colors will block more light. I have the dark grey (which isn’t actually that dark of a grey). Two photos during the day and one photo at night with color contrast curtains beside these grey ones. Definitely not wrinkle free. Idk about energy efficiency because I only just got them.",
      "rating": 5.0,
      "verified": true,
      "author": "Hillary",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "They Darken a room",
      "text": "For some reason I thought these curtains would be double lined. However, I really like the thickness of the material and quality. I did need to throw them in the dryer to get the wrinkles out before I hung them but they looked great once they were up. They don't completely black out a room but they do a decent job of darkening it up. I'm happy with my purchase and plan on getting more colors for the rest of the house.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Reyes",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "This is a no brained",
      "text": "I loved them. My husband is a restaurant manager and his days and nights vary throughout the week. We got them so if he closes at night and gets in at 3am, he can sleep in without the sun waking him up. They work like a charm. We also noticed we didn’t have to bring portable air conditioner up to our room this year. We have central air but it’s never enough in our bedroom to be comfortable, so I got a portable unit. We never even turned it on this year because Of these",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine Miller",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Awesome!",
      "text": "Looks awesome and it truly blacks out the room. Put them in the bedroom and they completely blacken out any sunlight which calls for a great Sunday sleep in undisturbed by sunlight... ***Be aware that they come folded so when you hang them up they will have some creases, but that common for all curtains that you are not spending a ton of money on. We fixed it but hitting it with the steamer a few times, and now they look great..",
      "rating": 5.0,
      "verified": true,
      "author": "jonathan forstall",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Good for the price I guess",
      "text": "I guess i assumed it would come in a set of 2...i only got one and didnt even buy the other. It was nice and thick but the color wasnt exactly what i was ecpextong and didnt match the look i was going for. Not bad though.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190108
    },
    {
      "title": "Dark Room",
      "text": "Great black out Curtains I was a little skeptical about buying them online but these are even better than the ones I had before keeps the room dark and cool the only thing I wish it would have an option of the two panels I forgot to read the fine print and ordered one and then had to order a second on and had to wait for the second one to come in but I love them. I would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica  R Guijarro",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Great Value",
      "text": "After reading 5-star and 1- star reviews I think I should weigh in. These curtains are cheap $ price-wise. The material may not be what you're looking for if you have a photo printing room... but if that's the case, buy some appropriately priced curtains. If you're using residential, and need some pesky lights blocked out at night, then these curtains are a huge value when compared to some of the sh** that Target or even Walmart want to charge you for. These curtains are great. Note, only 1 curtain comes in a package... which I didn't realize at first. That would have been a super value. But these are absolutely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Singmaster",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "98% dark",
      "text": "I like the material the curtains are made of and yes they are wrinkle free, they do provide 98% darkness, the area where the grommets are, allow light to come through. If the manufacturer did a wrap over the grommets, then light would not come through the grommets, I took a large Black Throw and covered the grommets, I feel I shouldn't of had to do this if they were made correctly! other than that they are nice curtains!",
      "rating": 4.0,
      "verified": true,
      "author": "Gerald Wilson",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Great product !",
      "text": "I bought it in brown (2), true color dark brown or dark chocolate , really cover from the sun ; I just received them , So I can not say about the save energy . My mistake was I got the exact measure from the wide part of the window , it covered exactly ; and, I would like a little extra for the look when is close; But they look good , very good fabric , no wrinkles . Anybody who read this , You wont be disappointed .",
      "rating": 5.0,
      "verified": true,
      "author": "ElizaMe",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "You must BUY two... to cover ONE window!",
      "text": "Well, I guess I should have read a little deeper... THIS ITEM Does NOT COVER the window. You must buy two for one window. I like the soft texture. The light is not blacked out completely and also the top loops allow light in.",
      "rating": 3.0,
      "verified": true,
      "author": "Johanna Booms",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "2 different color curtains when I ordered light grey",
      "text": "I was excited About the curtains I bought but once I stood back to look at them they are 2 different shades of gray. One is even a shade of gray green. The other is dark grey Not to mention they are made from 2 different materials",
      "rating": 1.0,
      "verified": true,
      "author": "Lety m",
      "helpful_votes": 15,
      "publication_date": 20160210
    },
    {
      "title": "Surprising Value",
      "text": "Pleasantly surprised at the quality and workmanship of these curtains. The material has a nice feel and I could feel the reduction of the heat from the sun as soon as I hung them. They also do a great job in blocking the light both from the outside during the day and from the inside at night. The price was so low that I have to admit I never expected them to work so well.",
      "rating": 5.0,
      "verified": true,
      "author": "James J. Zendrosky",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Great Curtains!",
      "text": "My son LOVES these. He gets the morning sun in his room and it gets really hot and he cannot sleep with all of the sunlight. The curtains are a God Send. When we got them, I unfolded them and sprayed a little water on them and put them in the dryer on low, to get the creases out of them from being folded. They came out perfect and hang really nicely. They block out the sun and keep his room cooler. They also look great, a very nice material. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "LDJ",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Room darkening. But not blackout.",
      "text": "Summary: I purchased these curtains to use with a small home theater room. The curtains are a good quality material. But they are room darkening, not a completely blackout curtain. Pros: 1) Resistant to dust accumulation. 2) Quality material. 3) Nice colors. 4) Grommets are nice, but lets some light through because of their size. Cons: 1) Not complately blackout.",
      "rating": 4.0,
      "verified": true,
      "author": "JKN",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Great value, better product",
      "text": "Less expensive than some other blackout curtains, but works surprisingly well. They look thinner and don't have lining like other brands I have purchased, but do a better job of blocking out the light. I've had them up for a couple days and have noticed a difference at the window. They are working better than the set I previously purchased for another window, and I will be upgrading!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Does a great job!",
      "text": "This is a great curtain. It only comes with one tho, so don’t make the mistake of ordering just one if you need it for wide windows. I only needed one tho, but it’s so great I may actually get more for the other rooms!",
      "rating": 5.0,
      "verified": true,
      "author": "Some guy",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Switcharroo, but good product",
      "text": "The product itself is great. However as a seller I wanted tonratenlower.. I bought 12 panels so far.. original order was for 10.. when I first ordered the panels were 2 in a pack, i did a reorder for 2 more packs so it goes right to the order so I selected the quantity (although price went up a bit as well, but unwanted my curtains to match).. unfortunately nonone told me they switched it from 2 panels an order to 1.. i was pretty upset, I could have bought it alot cheaper at local store if I knew that.",
      "rating": 3.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Could not have asked for better!",
      "text": "These curtains are true to color, true to measurements, and a very heavy and silky fabric that does block out the light very well. They will even fit larger decorative rods. Note, if you have double windows you will need at least three panels to cover as they are a bit narrow. If your single windows are wide I would suggest getting two per window. They will overlap slightly when drawn closed if you weave them on the rod the right way (front, back, front). I bought two sets for my boys rooms and loved them so much I bought more for my daughter's. For the price you cannot find better blackout curtains!! I am thrilled with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah U",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Very Satisfying Product",
      "text": "Before my purchase of this product, I had never purchased blackout curtains before. I bought these because of a deal/feature on Prime Day, and I must say, I have been VERY satisfied with this product. The average temperature in our living room has dropped significantly because of these curtains blocking out the sun that beats on our windows every morning. I would recommend these to anyone who is looking for new and inexpensive blackout curtains.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great quality, great price",
      "text": "I am a pretty particular person...I love quality but not a high price. I was skeptical if these would be good quality but took a chance and ordered a set of two in black for my daughter's room. I was very happy when I received them. The fabric is a thick, heavy polyester that hangs well and blocks out the light. It has a bit of a sheen but not too shiny, which I like. It's almost like the set I have in my dining room that cost more from Bed Bath and Beyond , but honestly I think the fabric of these Deconovo drapes is thicker. I wish they had patterns and stripes. I would definitely order again!",
      "rating": 5.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Nice quality",
      "text": "These curtains wash very well and are almost wrinkle free out of the dryer. No lose threads after washing, no puckering, and no shrinkage. The only reason I gave this 3 stars instead of 5 was they do darkening the room but not as much as I expected with the description of \"room darkening thermal insulated curtains\". I can't say if they help keep a room cool or warm because I live in California and the weather is pretty mild.",
      "rating": 3.0,
      "verified": true,
      "author": "Meli",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "I like the curtains but wouldnt call it thermal or blackout curtains",
      "text": "I like the curtain, I dont love it. It is not thick enough for blacking out sunlight nor would it help with any type of thermal insulation. Is it pretty and gets the job done of covering up my window? YES. beautifully. Does the curtain live up to its name and rating? No. Its more of a \"you looked different online\" kind of situation. Its not enough for me to return it but not something I'd recommend especially you are looking for a specific blackout curtain.",
      "rating": 3.0,
      "verified": true,
      "author": "Chung",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Keeps Drafts Out of My Old House",
      "text": "I bought these because they were affordable, and I live in a very old house with many windows and my oil consumption was out of control. These keep it very dark, but the drafts have been cut down by probably 75% at a minimum. It's such a simple solution for keeping heat in but one I so rarely see being used. They are black and not beautiful, but in upstate NY what counts is being warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Locked Lamora",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Good Quality",
      "text": "I’ve had these for a couple months now. Right outside my room is a very bright street lamp so even during the dead of night my room is heavily illuminated even through my blinds. I bought these to help solve the problem and they’ve worked really well. The room is definitely as dark as it should be. If anything my only problem is that they’re a little on the heavier side but that’s a given and when I got them they were a bit wrinkly from packaging but it’s not like it was bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany U.",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Truly blackout!",
      "text": "I bought these curtains for my sons room. We've only had them for a few days so I can't say 100% for sure if they are energy efficient, however they are definitely black out! We closed them midday while the sun was brightly shining in and they completely darkened the room. I like the feel too! They were a little wrinkly out of the bag, but look much better after hanging for a few days. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Aracena",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "A GREAT INEXPENSIVE SOLUTION THAT JUST WORKS.",
      "text": "We bought these panels to deal with excessive heat in a west facing window, they work nicely. Prior to install it would be 10 degrees warmer than the rest of the house now the semi is only 1 degree warmer. I also wanted to darken the room in the daytime and they are just perfect for that. I ordered a 3rd panel so i can get complete coverage as the windows is slightly bigger than i thought.",
      "rating": 5.0,
      "verified": true,
      "author": "Hal O. Elledge",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Easy to attach",
      "text": "I liked that I could add these to my existing curtains. I liked that they are white for light reflection. I liked that I could cut them to the correct size easily, as they were about 6\" too wide for my curtains, but cutting off the excess was a breeze. I am hoping I will find this room cooler on a hot day now. There is already a big difference in how bright the room is, which will make it easier to sleep in.",
      "rating": 5.0,
      "verified": true,
      "author": "Bon",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Just as Advertised",
      "text": "We bought these to solve two problems in my father's bedroom. First, his room faces east, so he could use some darkening in the early mornings. Second, his room has been very chilly, so we were looking for insulating properties as well as light blocking. He tends to like greens and browns, so we let him pick the color. I've seen this type of curtain before that achieves the desired results with white rubber glop sprayed on the backside. Nothing like that here. The curtains are the same mellow color on both sides, so much so that I actually hung one the wrong way by accident. These same curtains, in another color, are destined for our bedroom, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin W. Novak",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "Got greyish white as they look great in the picture and white curtains are tough to ...",
      "text": "Got greyish white as they look great in the picture and white curtains are tough to find. They are very unappealing in person. They look like a blackout liner that you would add to another curtain. Not a pretty sheen or look that you would want as a stand alone curtain. Was hoping to brighten my little girls room with bright white curtains against the purple walls and these will not be the ones we will use. A",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20160714
    },
    {
      "title": "Works great - should have measured instead of going off of pictures",
      "text": "I have a really small window that just this one panel covers, and it works great. Totally blocks the sun out. However, I didn't care to check the measurements and went off of the photos, which made the curtains look shorter than what I thought. It's not a huge deal though, since it covers everything nicely. My window is just a single pane, so if you have two panes next to each other, make sure you order two of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiana",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Blackout Curtains, they do it well for a good price",
      "text": "I was genuinely surprised by the supple feel of the curtains. I expected a more coarse, cheap feel, but these have a very nice smoothness to them. Not satin or silk or anything, but unexpectedly good for the price. Silly me saw the picture of TWO curtains and thought it was a two pack, but I don't think it's intentional deception, just a personal mistake. I have a second one coming and the deliveries are very fast. 10/10, literally bought again.",
      "rating": 5.0,
      "verified": true,
      "author": "TOm",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "If your goal is to get a good light blocker or insulator for cheap - then you ...",
      "text": "If your goal is to get a good light blocker or insulator for cheap - then you have found a product that will fit that bill. That's the reason they get 2 starts. They didn't get the remaining 3 because these curtails look cheap synthetic fabric that I chose to return and not hang up in my house. I took 1 out of the package and it had a run in the fabric and the stitching was irregular. There are better options out there for a better deal.",
      "rating": 2.0,
      "verified": true,
      "author": "Mason A.",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "... curtains a few months ago and the quality was fine, so I bought another pair a few days ...",
      "text": "I bought a pair of these curtains a few months ago and the quality was fine, so I bought another pair a few days ago to completely cover our window. Took one curtain out the of the packaging, and one of the rings just fell off, and I cant even try glue it back on the curtain somehow because it's not a complete ring (see photos)",
      "rating": 1.0,
      "verified": true,
      "author": "Hong N",
      "helpful_votes": 3,
      "publication_date": 20180515
    },
    {
      "title": "Pretty Thick",
      "text": "I know these are blackout curtains and they should be thick, but I thought because of the price the quality would be average. This surprised me! They are pretty great quality and seem to not wrinkle easily. It does block out the street lights and the sun light, if hung properly on the rod. I ended up ordering another one because this turned out to be a good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "SugarCuppyCake",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Only One Panel/check measurements!",
      "text": "Even though I searched for two panel set and thought this item was, it is only one panel. And from the photo with the smallest size I assumed it would fit the area I needed, but it is super long and basically goes to the floor. I can't use this and don't want to pay $15 or whatever for another single panel so I will see if any of my family members can use this.",
      "rating": 3.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Definitely recommend it, but be mindful to choose a dark ...",
      "text": "The curtain blocks sunlight very well. My window is facing the east side. When I first moved in, I'll always be woken up by sunshine in early morning. Until I can't stand it any more and got this curtain. I can sleep tight until mid-day now. The room wouldn't be completely dark in day time, but the light is dimmed enough that once I thought noon time is almost evening. Definitely recommend it, but be mindful to choose a dark color to maximize its effect.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Wu",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "We love these curtains",
      "text": "We love these curtains. We actually bought some for each bedroom in the house. However, I would not say the grayish white ones are blackout curtains. They are definitely room darkening, but not blackout. The beige ones are only room darkening as well, not blackout.The khaki colored ones are more similar to blackout curtains. We ended up doubling up the grayish white ones in our daughters room so she can easily take naps during the day. That did the trick....completely dark in there during the day now and still make affordable curtains. Also, I love how these feel...velvety soft to the touch. Look expensive, but aren't!",
      "rating": 4.0,
      "verified": true,
      "author": "KDS",
      "helpful_votes": 2,
      "publication_date": 20160627
    },
    {
      "title": "Not totally blackout",
      "text": "These are good curtains, by mistake, I ordered thinking they came in a pair, but the price was still cheaper buying two of these vs what you’d find them retail. Love the color. Blackout would not be the word I would use for these though. I have true blackouts in another room & no light goes through. These were put in a room that has a huge tree outside the window so it has plenty of shade. Probably wouldn’t purchase for other rooms if they need total blackout. All in all good curtains",
      "rating": 4.0,
      "verified": true,
      "author": "heather kimbrough",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Excellent Product - Well Made",
      "text": "These curtains lowered the temperature considerably in the guest room. It get the afternoon sun and gets pretty warm in there. Now, with the new curtains, it's great! Well made product! Reasonable price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Self",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "i love the superman color but i must return because they ...",
      "text": "When i ordered the curtains i odered the first set which were one pink and one royal blue. I noticed that the rail i purchased were long so then i ordered another set of one pink and one royal blue. I then noticed the navy blue curtain did not match. i love the superman color but i must return because they dont match.",
      "rating": 1.0,
      "verified": true,
      "author": "Sonia Mendez",
      "helpful_votes": 13,
      "publication_date": 20160426
    },
    {
      "title": "These are great! Backdrop curtain",
      "text": "I did not get these for a window so not sure about the blackout capabilities. I am an actress and got 2 of them to create a backdrop for self-taped auditions. They work perfectly and with a curtain rod are super easy to hang. While they do not have crazy wrinkles, they do show a deep wrinkle where they were folded. Very easy to iron or steam. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "lug",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Works great on Phoenix heat ☀️ Bought a couple brands and sizes for lab windows.",
      "text": "Keeps the heat down in Phoenix. Every outside wall to our Lab is floor to ceiling glass. We live & work on the top af one of the taller buildings downtown. I put these up in the studio behind computer racks, between the blinds and glass. They knocked down temperatures in the lab by 5-6 degrees immediately. 👍",
      "rating": 5.0,
      "verified": true,
      "author": "USAForensic, llc.",
      "helpful_votes": 4,
      "publication_date": 20170805
    },
    {
      "title": "Feeds My Vamp Needs",
      "text": "I sleep during the day, so I desperately needed curtains that would keep out the light. These do the trick perfectly. Not a single ray of sunshine gets past them, and they fit my window perfectly while looking very nice. They're nice and heavy, good quality and feel nice to the touch. Could not have asked for better blackout curtains than these.",
      "rating": 5.0,
      "verified": true,
      "author": "Japanerd",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Amazing",
      "text": "I brought black out shades from target and they just weren't blocking enough light out so I purchased these and it was a huge difference! Not an ounce of light comes through these curtains and they don't wrinkle. I put them on a regular curtain rod from Ikea and used command hooks to attach it to my wall and haven't had an issue of the curtains falling down. If you need to sleep during the day these are perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Not blackout.",
      "text": "They're not blackout. They are a nice curtain, soft and beautiful color, but not blackout. I will have to buy a second type to go behind them to truly black out the room. Only reason I'm not returning them is because they are pretty and match my bedroom. Save your money on these and go to a store to find real black out curtains. Bed bath and beyond have great ones.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa Hood",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Not as described....",
      "text": "Do not be fooled that they are labeled \"room darkening black out curtains\"... these were hardly such! Not only did they not function as described, the color of \"Gray-White\" has more of a bluish tint. I do not recommend these curtains. Although the price may be tempting, spend the extra dollars to receive a better product.",
      "rating": 1.0,
      "verified": true,
      "author": "scott hankard",
      "helpful_votes": 10,
      "publication_date": 20170416
    },
    {
      "title": "Probably one of the best buys I've made on Amazon",
      "text": "We bought five of these for our bedroom (we have lots of windows) because my husband sometimes works overnight and regular curtains weren't cutting it. I can't tell you what a difference it has made. He sleeps SO much better in the dark room and I'm going to order more for our other rooms as well. Because it blocks the sunlight so well it cools down our bedroom as well as keeps it dark. I can't wait to see the difference in our electric bill after installing these throughout our house.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah M",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Like Persian Arrows - These WILL Blot out the Sun",
      "text": "I bought a set of these for my bedroom because I like to have things very dark. These are amazing! I don't know if they are energy efficient, I do not know if they are wrinkle free, but what I do know is that they don't let the sunlight that hits my bedroom window wake me or blind me. I could almost sleep too late because the fact I almost can't tell what time of day it is. These are a great bang for the buck!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Love, love, love these curtains",
      "text": "I cannot stress enough how much I love these curtains. I have now bought these curtains for my living room, dining room and now my bedroom. The material is soft, and very thick. I have noticed a huge difference in the temperature of the rooms I have them in. My huge living room gets full afternoon sun, and this room used to get sooo hot in the evening. Now that I have these, it is still warmer in this room than the others, but nowhere near as bad as it was before. I will probably never buy any other type of curtain again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany H",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "They’re ok.",
      "text": "I knew I should have listened to the other comments. The reason I’m giving it a 1 Star is because I ordered one panel thinking it would cover my window but it didn’t so I ordered another one and the second one I ordered is completely different. The first one is blackout for the most part but the second one is like a cheap sheer material that is nothing like the first. Since the didn’t match I put the second one in storage because I don’t have the patience to send it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Elle",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "I love them!",
      "text": "What a difference black out curtains make. These have been such a great investment! I have wooden slat blinds that kept some light out but not enough. These make the room so dark even with bright morning sun you can't notice what time of day it is. Sometimes though I think they might work too well since I don't want to wake up haha perfect for my husband who works nights and sleeps during the day.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Smith",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "I have 4 panels",
      "text": "These curtains are blackout as stated! They are easy to install. I already had curtains on 2 windows that leaked light, so I purchased 4 more panels (solid color) and hung them behind the decorative curtains and now there is not any light leakage! Just beware that one order = one panel. So for my windows, I had to order a quantity of 2 for each window.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Economical and effective",
      "text": "Wow, what a difference these made in our bedroom at night! The black curtains block an annoying light right outside the bedroom window in our condo, and we both sleep so much better. We’re using them as a temporary solution until our shutters are installed, but they’re so effective that I’d have no trouble using them for a permanent solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Beach dweller",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Does everything as advertised. I was frankly quite surprised ...",
      "text": "Does everything as advertised. I was frankly quite surprised at how thin and light it actually is, considering how well it blocks light, heat, and sound. The fabric is soft and the color is true to the pictures (I bought the navy blue).",
      "rating": 5.0,
      "verified": true,
      "author": "Chris_1200",
      "helpful_votes": 3,
      "publication_date": 20180707
    },
    {
      "title": "Unacceptable light blocking. Don't buy if that's important.",
      "text": "Light blocking is worse than the old curtains I wanted to replace. Unfortunately I'm stuck with them as I waited a few weeks to install. Worthless. Aqua/light blue color.",
      "rating": 1.0,
      "verified": true,
      "author": "Ian Douglas",
      "helpful_votes": 7,
      "publication_date": 20171001
    },
    {
      "title": "Original was way better",
      "text": "So I recently moved to a place with more windows and so I needed more curtains. I ordered two brands of black our curtains to tear them both and inspect the quality and make. My first purchase of these curtains were from 3 years ago and they’re still holding strong , however the red ones I bought in 2019 are a much darker red , the weave of the fabric is a bit larger and rough. I’ll attach a picture.",
      "rating": 4.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Bought for nursery",
      "text": "I bought these for my kid’s nursery for the Summer months and they seem to work great! Even in the light gray color, light is blocked out. They’re also really soft, which curtains don’t need to be, but that was a bonus. Note that that an order buys you one curtain; this may be obvious to some but I thought I was buying a pair but only one arrive. Happy though to buy a second since they are a good price and will last.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie R.Top Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Amazing Blackout Curtains",
      "text": "These curtains are great. I had brought some about 3 years ago and wanted to purchase more. Still the same quality as the ones before. It definitely does block out the sun and keep the temperature cool in the house. Makes the house completely dark. I have the color black so those are the only ones I can speak for. I would DEFINITELY recommend these blackout curtains.",
      "rating": 5.0,
      "verified": true,
      "author": "Arkeela Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Lightweight yet efficient",
      "text": "I like these for windows that get only west, hot setting. I got spring tension rods and each morning put them up overtop of my blinds. They are really making a big difference in how much my air conditioning runs.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy J. Fuller",
      "helpful_votes": 0,
      "publication_date": 20200630
    }
  ],
  "product_meta": {
    "title": "Deconovo Room Darkening Thermal Insulated Blackout Grommet Window Curtain for Bedroom, Black,42x84-inch,1 Panel",
    "rating": 4.6,
    "feature_bullets": [
      "Available in three different size options (42x63 inch, 42x84 inch, 42x95 inch), these amazing curtains are sold in one panel per package.",
      "6 Silver Color Grommets on each Panel. Deconovo blackout curtains can reduce light. The darker the color, the better the light reducing capabilities.",
      "Our grommet blackout curtains are also energy saving/efficient curtains as they are made of materials with thermal insulation properties. They will prevent from heat escapes and blocks sunlight from entering into the room. Helping you to save on energy bills..",
      "These thermal insulated blackout curtains are silky, soft, drapery and very pleasant to touch. Matches perfectly your windows, provides utmost privacy.",
      "Machine washable for easy care. Imported"
    ],
    "specifications": {
      "Package Dimensions": "15 x 10.5 x 1.5 inches",
      "Item Weight": "1.45 pounds",
      "Manufacturer": "Deconovo",
      "ASIN": "B016MB5MOE",
      "Item model number": "SYNCHKG084779",
      "Customer Reviews": "4.6 out of 5 stars19,063 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#163 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Material Care Instructions": "Machine Wash",
      "Batteries Required": "No"
    },
    "categories": [
      "Panels",
      "Home & Kitchen",
      "Curtains & Drapes",
      "Window Treatments",
      "Home Décor"
    ],
    "price": 19.99
  }
}