{
  "website_summaries": [
    {
      "verdict": "An attractive and versatile waterproof lighter that works perfectly at the click of a button.",
      "pros": [
        "USB lighter is rechargeable and will provide up to 300 uses on a single charge",
        "Will not light when the lid is closed for added safety",
        "Sleek and elegant design is sure to grab your attention",
        "Environmentally friendly"
      ],
      "cons": [
        "Some users found that this option suddenly stopped working after minimal use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A safe, user-friendly electric lighter that is proven to perform consistently.",
      "pros": [
        "Can be recharged via USB",
        "Offers up to 300 uses on a single charge",
        "Easy to light with a single click of a button",
        "Will not light when the lid is closed for added safety",
        "Sleek, elegant design gives the lighter a look and feel all its own"
      ],
      "cons": [
        "Can be tough to use the lighter for candles",
        "Lid must be placed in just the right position to get the lighter to work properly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Arguably the best-looking plasma lighter on the market, if style is a major factor. Lightweight and compact but well built and durable.",
      "pros": [
        "This single arc lighter is an excellent, environmentally friendly alternative to traditional butane models",
        "A full charge lasts up to a week",
        "Comes in 6 attractive colors",
        "Designed not to light up if the lid is closed"
      ],
      "cons": [
        "Best for cigarettes or candles due to its limited burn area"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not recommend",
      "text": "I bought this for my husband on January 26th but didn’t give it to him until Valentines Day. It already does not work. It will not charge. It has not been abused and is used for only lighting cigarettes. I do not recommend this. I spent a lot of time researching these types of lighters and this was the highest, best rated. Do not waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Hribal",
      "helpful_votes": 66,
      "publication_date": 20180223
    },
    {
      "title": "... a deployed location with a lot of wind worked fine for a few days now it won't charge and ...",
      "text": "Ordered it from a deployed location with a lot of wind worked fine for a few days now it won't charge and lights up green when I try and charge it... has anyone had this problem and got a replacement? How do I go about doing so?",
      "rating": 1.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 22,
      "publication_date": 20180106
    },
    {
      "title": "Stopped functioning after two days",
      "text": "The product was great for a couple days until it completely stopped functioning. Now when I press the button, I may hear a slight buzz like it is trying to light then the red light blinks on the bottom. When plugged in to charge the light is already green. I've tried charging it for a while as per instructions and have seen no improvement. It's been about a week now since it stopped working. Not pleased.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 25,
      "publication_date": 20170214
    },
    {
      "title": "It’s beautiful, productive but broken",
      "text": "Will change to 5 stars definitely if I get a proper response. It’s beautiful, productive; saves money from not buying lighters. Personal so if you let someone borrow it everyone knows it’s obviously yours. Sadly the charger does not work. When plugged, it doesn’t read or pick it up. It began to dim and eventually gave out. Very sad I really wanted this as a stocking gift to my husband..",
      "rating": 1.0,
      "verified": true,
      "author": "Adrianne",
      "helpful_votes": 13,
      "publication_date": 20171214
    },
    {
      "title": "Awesome Futuristic Igniter",
      "text": "I love this weird little device. Neat gift item. In fact, perfect gift item for that person who has everything...they likely don't have this Tesla Coil lighter. It makes a neat high-pitched zappy sound. It lights up incense, candles, fireworks and paper instantly. Very neato. The pyro within you deserves the intrigue.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy Montgomery",
      "helpful_votes": 9,
      "publication_date": 20170830
    },
    {
      "title": "A Quality Product",
      "text": "This lighter works better then I expected. I am not a smoker so I use it for other things, lighting candles, incense, etc. It works great for these. I find that it works best in short bursts. I am very pleased and satisfied and would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "C. M. Guzowsky",
      "helpful_votes": 6,
      "publication_date": 20180130
    },
    {
      "title": "The lid is awkwardly positioned so that the coil can't reach",
      "text": "The lighter technically works, and it's cool that I can easily recharge it. However, the lid is awkwardly positioned so that the coil can't reach anything. It's probably just fine for lighting a cigarette, but I don't smoke. I bought this to light candles, and the stupid cap prevent the coils from getting close enough to the wick on most of my candles. I would just return it, but it's not technically defective - it's just stupidly designed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170124
    },
    {
      "title": "Very nice quality with mirror-like finish.",
      "text": "The first thing you notice about this lighter is it's beautiful. Then when you pick it up, it feels so nice in your hand. It comes with a velvet pouch, and I recommend keeping it in there when not in use. Somehow I got a small scratch on it and the finish has flaked off around it. The battery lasts a while and doesn't take long to charge. I vape more than smoke, so for me, it's later a few weeks without needing a charge. The purple arc is very cool too. It's a bit tricky to use though. Don't try to use it with a metal smoking pipe either. It's a shockingly strong electric current. Pun intended 😉.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Porter",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "When working right its great but one of the ones I bougth had a problem",
      "text": "When it worked it was great. My wife is the smoker in the house and she was pleased. We bought two but after a week one of the lighters would immediately turn on when you opened the top and would run out of power quickly. It also made it more likey you might accidently get zapped if you where not carefull. It was supposed to turn on when pressed the button the side but the problem came on right away. The other one woeks fine and we have no problem",
      "rating": 2.0,
      "verified": true,
      "author": "H. A. Kaskoff",
      "helpful_votes": 5,
      "publication_date": 20160822
    },
    {
      "title": "Anyone who likes gadgets needs one of these",
      "text": "Great for lighting candles, totally rechargeable via USB so free 'fire' folks. Looks cool as well. As for what else it might be good at lighting without me mentioning any specifics thus promoting bad behavior, keep in mind... - it's a slight arc in between 2 posts so a candle wick that fits in between is perfect - the space between the posts is thin...meaning the tip of what you light would need to be thin - You can still light something if it is wider than the arc, just have to tilt and maneuver a tad to do so and is easy",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gardner",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Very Cool lighter, not the most effective at Lighting.",
      "text": "This is a very interesting lighter, HUGE hit at any social event. Lasts significantly long on one charge (via micro-USB). However, this lighter does have some lighting limitations, The aperture between the two nodes is fairly small which limits what can be lit from this lighter. The flip top also can sometimes get in the way when trying to light something upside down. Although this lighter will NOT blow out in high wind, it only makes a interesting noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Gavin Brackett",
      "helpful_votes": 2,
      "publication_date": 20180114
    },
    {
      "title": "YES YES",
      "text": "It zaps it lights while looking cool. Every now and then clean the little heads on the lighter where the arc is created it gets clogged up when lighting ciggys. DO NOT use a metal piece like a screwdriver or alike i shocked myself and it felt weird definitely not a good feeling pushed the button on accident when cleaning. It charges in a pretty short amount of time and id say it can light maybe a pack or two before you need to charge it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Rey",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Awesome lighter!!",
      "text": "Bought this for my boyfriend for Christmas and he loves it. It’s a very cool lighter, it works when it’s windy and also when it’s frigid cold outside. The best part for me is that he isn’t constantly carrying around lighter fluid to fill his Zippos, because that makes me nervous. The Tesla Coil lighter is chargeable via USB port. High quality and cool product, makes a great gift! I may buy one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "SuzeTop Contributor: Makeup",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "Great gifting item",
      "text": "Bought it for my fiance for Christmas, it was having a charging issue after the first day of use. I proceeded to reach out to the seller in an email they responded quickly. Seller is sending out a new one, I under that sometimes production issues happen and not every single item will be perfect. The fact that they seem to also understand and just send a new one is very telling of the type of people who run this company. Overall I'm a happy customer and I will be purchasing more as gifts for my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicolette Pal",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Treat the charge cord gently.",
      "text": "Loved the lighter till the charging cord broke and now every cord I try to use does not work. They fit but you need to hold them down tightly to get them to charge at all.. I love the looks of the lighter and got a good 3 to 4 months use out of it till the charge cord issue. Oh well lesson learned. Not sure if they would replace it t for me, but I'm guessing not.",
      "rating": 3.0,
      "verified": true,
      "author": "Flopper85",
      "helpful_votes": 4,
      "publication_date": 20161211
    },
    {
      "title": "Stops working in few days!!!",
      "text": "I initially loved this lighter, but after a week the arc just kept getting weaker and weaker. I recharged it only once. But within a week it was dead! Thought it was discharged, so I recharged it again. And the led went from red to green too, indicating it was fully charged. But now it just doesn’t even light up. Did not drop or damage it. So save yourself some money, and DO NOT buy this crap!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Sanju Naik",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great Lighter...Bad Cable",
      "text": "I like these lighters and would have loved to give this one a higher rating...but the charging cable that came with it would not work. We had an old cable from a previous purchase (lost the lighter!). That one worked and appeared to be of a much higher quality. If I did not have this cable I would have had a lighter that would not work. Otherwise I love these lighters and \"would\" have given this a 4 or 5 if not for the cable issue.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill- Nevada",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Doesn't light, awful noise",
      "text": "I bought this to take camping so that I didn't need to keep my zippo filled all the time. Unfortunately, it will not light anything I try to use as a fire starter. Not to mention the face it emits a deafening screech every time you press the button.",
      "rating": 1.0,
      "verified": true,
      "author": "FafnirSpiral",
      "helpful_votes": 2,
      "publication_date": 20181117
    },
    {
      "title": "Don't Waste Your Money",
      "text": "This lighter worked great for about 10 minutes then the charging light quit working. Can't tell if it's charged or not. Lighter still works even with lid closed. I don't think its supposed to. I would not recommend this lighter. Get a Zippo instead. Thanks",
      "rating": 1.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 2,
      "publication_date": 20181018
    },
    {
      "title": "Fun to play with, hard to reach some places.",
      "text": "This thing is seriously so cool. I got it for my husband for Christmas and he loves it. The only issue is that it has protective prongs on it that make it kind of hard to reach certain areas. For example, we have a couple of the large candles from Bath and Body works. Once the wax had gotten down to about halfway, we couldn't light the wick with this lighter any more because of those safety prongs. They are all about safety, which is great, but the design is somewhat flawed in that aspect. Otherwise, really enjoy!",
      "rating": 4.0,
      "verified": true,
      "author": "Julie Banta",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Not windproof.",
      "text": "I live in California's High Desert and experiencing strong wind is nothing new for me. Since this lighter toted itself as being \"windproof\", I have to call the manufacturer out for lying. The \"flame\" splits in multiple streams whenever the wind is moving faster than 7 MPH. Basically, this thing will work quite nicely if you are only experiencing a mild breeze. As for its battery life? I get about 36 hours per charge, so not bad. All in all, it is a nice looking lighter that does what I need it to do whenever it is not super windy.",
      "rating": 4.0,
      "verified": true,
      "author": "Adonya",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "May be okay for some, but not for me",
      "text": "While this looks cool, and works, it doesn't really do me a lot of good. You can only light what you can insert into the \"flame\". Meaning that if you want to light something like a cigarette that you can insert directly, then it works fine, but if you want to light something that might be in a confined space, like a candle wick inside a jar, then you don't have access. I'll probably just return it. Mine didn't come with a charging cable either.",
      "rating": 3.0,
      "verified": true,
      "author": "J. K. Given",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Good lighter",
      "text": "This lighter is incredibly reliable, and holds a charge for a surprisingly long time, still going strong after several days of frequent use. As a non-smoker, it is a good addition to my pockets on a day-to-day basis. my only complaint is that the lid does not open very far, making it somewhat difficult to use it for things like candles. Other than that, it looks neat and functions better than expected. Overall highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Larson",
      "helpful_votes": 3,
      "publication_date": 20170207
    },
    {
      "title": "Lid does not hinge further than on picture",
      "text": "This isn't like an old Zippo lighter or whatever, that lid barely goes out any, making it really difficult to use on candles and kind of annoying on other things. Overall, a bad design idea on an otherwise quite good product. Also doesn't come with an actual charger, just a cable for one, so you may need to buy one or connect it to a PC to charge.",
      "rating": 3.0,
      "verified": true,
      "author": "Logan Warner",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Love this lighter!",
      "text": "I bought this lighter through amazon approximately one year ago. I have had zero issues with it so far. The lighter holds a charge for a while. I've taken it on weekend trips and typically only have to charge it every other day with frequent use. It doesn't take very long to recharge either, and plugging it in for a few minutes will give it enough juice to use a few more times if you need it in a pinch after it is dead. I've found this much more convenient than other refillable lighters like Zippos and butane lighters, plus as an added benefit this one works just as well when it is cold.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty Shackleford",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Cool lighter but, it has its issues!",
      "text": "Like others on here, mine worked very well for a while but has since stopped charging. I've had it for almost a year and for the last couple months it has not charged correctly, you had to mess with the charging plug to get the light to turn red indicating it was charging and often it wouldn't fully charge. I'm really surprised considering it would last weeks on a single charge so, I didn't have to charge it often. The charging port should not be having issues already...",
      "rating": 2.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Really great but not for bowls.",
      "text": "If you want an electric lighter for a tobacco bowl please go look elsewhere! This is definitely only usable on cigarettes and the like. I will use it as my camping/toke lighter and the other ''cylindrical'' one for smoking. Charge time is short and it lasts a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Great buy!",
      "text": "Battery life is beyond great. Perfect for lighting incense, cigarettes, and pillar candles. Not so great for candles that are in a container (as in, don't use this, you'll burn yourself once you get the candle lit). I've had the thing for months and only had to recharge it once. Really high quality and it's an awesome conversation piece. I'm the only person who can light my friend's cigarettes in a storm when they come to my house.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Handy - futuristic Lighter",
      "text": "Best gift to buy for someone who needs a lighter. It charges via usb. It lasts a heck of a long time. It's cool - flashy - thick so you can drop it 100 times (please don't do that lol). It's something that - if you're a smoker - the only draw back is you got to turn the cigarette. The base to light is so narrow, you sort of need to turn the cigarette while inhaling to fully light it correctly. Otherwise, it's lit on one side and a hassle to keep a flame. Other than that - does what it says. Cheers.",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "You Will Like It!!!!!!!!",
      "text": "Having seen the \"Atomic Lighter\" advertised on tv, I looked into that same product on your website. I found one that was what I wanted and purchased it. It was a gift for my husband and he LOVES IT. Being a smoking man, he was always buying lighters or looking for one that was working. With this rechargeable one, he no longer has to buy them and recharging is very easy and simple. Anyone who smokes will enjoy this particular lighter. It came with a USB cord, but you can charge it with a regular phone charger. You had other choices, but I liked this one best!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CARLA BATES",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Neat little electric lighter.",
      "text": "I bought this electric coil lighter because I have never seen them before and I thought it looked cool. I read reviews and it said you would probably need to charge once a week or around 300 lights before recharging in less than 30 minutes. I don't have to charge mine but every 2 weeks and it takes at the most 15 minutes to get a full charge. I guess I got a good lighter.",
      "rating": 4.0,
      "verified": true,
      "author": "American son",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Cool lighter-bye bye butane",
      "text": "I love that this looks like a zippo but I don’t have to buy butane for it to work! My friends loved it. My only complaint is the high pitch it makes, but it’s just the Tesla coils working so I guess it’s just an necessary evil. I love that this produces less waste than disposable lighters too. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Annoying sound",
      "text": "I love this lighter because it's rainbow chrome and looks really cool. Great to show off at loud parties, but by myself it isn't the most convenient to light up with, and it makes this high pitch sound that hurts my ears. Otherwise is just like it should be. Charging lasts forever too.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180104
    },
    {
      "title": "Good for a year....maybe.",
      "text": "Well...it was good while it lasted. It will no longer charge. I plugged it in yesterday and the charge light flickered....went out and now will not charge at ALL.... How disappointing. Bought it April 2016 and here is it April 2017. Guess I know better than to buy this product hoping for longevity.",
      "rating": 3.0,
      "verified": true,
      "author": "LesT",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Cool Tech Gift for Him",
      "text": "Not a smoker in anyway and neither is my SO but it’s definitely a nifty tech gift that his friends actually liked oOo-ing over too. And yes, just in case people are wondering, it really does work. Used it for fireworks this past Fourth of July and worked wonderfully!",
      "rating": 5.0,
      "verified": true,
      "author": "Moriah",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Handy & unique",
      "text": "Digging the concept, it's still fun to have. But tbh because it doesnt produce an open flame it can actually be more difficult to light things cause it only makes a string of electricity basically. So cigarettes are hard, also the top part of it, the cap, makes it hard to light candles that are getting low. Other than that it's cool. I really like how even though it's been dead and uncharged for forever now, it still produces a spark even when its lifeless which still makes fire. Handy.",
      "rating": 4.0,
      "verified": true,
      "author": "Raja Jagnandan",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Greater than just \"great\".",
      "text": "It is well made and just damn, cool! The only downside is that you can't light a deep candle as the plasma does not flame up like a regular lighter. I admit I touched it and it shocked me... so don't do that. LOL! It is great though as even in the wind I can easily light a fire. Also, I assume it will last as long as the usb keeps working. I am impressed for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "iggy",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "This is a winner!",
      "text": "Works perfectly right from the start. It has never ran out of charge for me during a days use. I bought this in order to light cigarettes while riding my motorcycle or out on the boat. No matter the wind speed, it works well. It's also a good looking lighter with a very nice black and gun metal finish. In fact, it's now my every day lighter. No more Zippo's or disposables for me. Instructions that come with it are clear and easy to understand. Recharging is pretty quick also. Less then 40 min after heavy use day. Another advantage is if lightning a cigg while driving in the dark, your not blinded by it. Nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Bad design lid gets in the way impossible to light most things.",
      "text": "very difficult to light things The flip back lid gets in the way, it doesn't flip all the way back. What you want to light can't near the ignition element. Impossible to light a candles and most things, even a joint! Normal lighters have a flame that's about 1/2 to 3/4 tall and the lid goes all the way back and does not get in the way. Poor DESIGN!!",
      "rating": 2.0,
      "verified": true,
      "author": "Patrick A. Armstrong",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Worthless for lighting cigarettes.",
      "text": "This is junk if you're purchasing as a smoker. I am not but the individual is that I gifted it to. The opening where you'd light the cigarette is slightly smaller than a cigarette so you have to pay attention and get it at just the right angle. A simple zippo is much better and thoughtless when using.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Awesome eco-friendly alternative to disposable lighters!",
      "text": "This is a well-made e-lighter that is still working so far! It charges quickly (about 1 hour for me) and the cap is sturdy enough to ensure there are no accidents when traveling. The only negative is the USB outlet is a bit wonky and shifts by a millimeter sometimes (enough to make it difficult to plug in completely) so I just leave the cable plugged in.",
      "rating": 5.0,
      "verified": true,
      "author": "Lola Liu",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Hit with all my friends!",
      "text": "Super neat lighter! A friend of mine had one and I thought it was pretty cool. I love that it's rechargeable. It's a little tricky to get used to at first when lighting a cigarette, but once you get the hang of it then it's not so bad! It was a huge hit with all my friends they all loved them and kept asking me to use it!",
      "rating": 5.0,
      "verified": true,
      "author": "megan",
      "helpful_votes": 2,
      "publication_date": 20170609
    },
    {
      "title": "Sleek and convenient",
      "text": "This is such a cool product. Has a high end look and operates reliably. It lights cigars more reliably and evenly than butane lighters. It's always a conversation piece, as well. The lighter arrived with a charge and I haven't had to charge it yet after 3 weeks of use. Ended up purchasing another as a gift and they are very happy with it as well. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Fox",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "This lil guy is lots of fun. I use it more so for a fidget ...",
      "text": "This lil guy is lots of fun. I use it more so for a fidget tool than to light anything. The design is definitely aimed at lighting cigarettes which works great. However, my intended purpose was to light candles and without the cap flipping 260 degrees, the arc will not reach a wick in candles with much depth. Solid lighter for smoking!",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Very Great Product.",
      "text": "This is a very cool lighter it is as depicted in the product description. The lighter last a long time before needing to be recharged. sometimes I find myself holding my smoking product to it for a longer but all you have to do is give it a good pull and it works wonderfully. I recommend this to smokers especially if its windy by where you smoke.",
      "rating": 5.0,
      "verified": true,
      "author": "Tech_Geek",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Not suitable for cigarettes",
      "text": "I purchased this to light cigarettes with, but after a week of really trying to like this product I had to return it. I think the idea for the lighter is a good one, and your friends will enjoy the novelty of it, however the two prongs are just too close together. A cigarette does not fit between them and you have to \"zap\" about 3 different portions of the cigarette for it to light well enough for you to start smoking. It of course removes the need for a typical Zippo or Bic which relies on liquid fuel, but at a price. For me the trade-off wasn't worth it and I am back to my Zippo.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel Hanson",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Long Lasting Lighter and Rechargeable",
      "text": "It’s a pretty sweet item with a few drawbacks. You can’t really lit many items, sometimes you have to jam it between the coils. Not to mention it’s sometimes difficult to light cigarettes or blunts. You may have to light the same item for 10+ seconds. Though I still recommend it as a gift for anyone. Especially if you plan on going camping for multiple days.",
      "rating": 4.0,
      "verified": true,
      "author": "Camacho",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Very happy with this purchase!",
      "text": "At first I was really hesitant to order this but I figured if it doesn't work, I will return it. Not only I am not returning it, I am using it on a regular basis. It works awesome! The packaging that it came in gives you the feel that you just bought a very expensive jewelry. Extremely happy with this purchase and the seller had great customer service too.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ghaemi",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Sleek design & rechargeable. Easy to carry in pocket when doing outdoor activities. Love it!",
      "text": "Got this for my husband and he loves it! Wouldn't recommend using it while driving because you do have to look at it if you are lighting a cigarette. Great item to keep in emergency back pack, which is something which people should always carry in their car. We put one in our vehicles for every season. I love the fact that this is rechargable! Slim design makes it easy to carry in your pocket!",
      "rating": 5.0,
      "verified": true,
      "author": "junipers",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Fun novelty item. Really long charge time.",
      "text": "I use this to light incense sticks, but the cathodes do build up gunk on them over time and eventually the arc will short itself to the chassis and can give you an unpleasant shock. I've zapped my hand once because I didn't clean it, so take good care of it!",
      "rating": 5.0,
      "verified": true,
      "author": "Wooly Woolag",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Easy for arthritic hands",
      "text": "While I don't promote smoking or smoke myself, my mom does. I noticed she has been dropping matches and lighters more lately because of aggressive erosive arthritis. So I figured I'd find something easier (ideally safer) for her to use. And this lighter has done the trick. She works outside all year and can attest that she has no trouble using it in the wind. The only improvement could be if the lighter itself was not so slick and rather had a more gripping material. Also, if the on/off button was a bit bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "This lighter is falsely advertised and it sucks",
      "text": "Falsely advertised on Teslacoillighters.com not at all a dual arc lighter, comes scratched up an the battery won’t hold a charge after two days. Don’t waste your time or money on it or the game informer advert, it is an absolute waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Gaither",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "ABSOLUTELY AWESOME!!",
      "text": "We were looking for a lighter that we could use on the motorcycle. We've had 2 others that just didn't cut it! I'm a \"3 strikes and you're out\" kind of person, meaning this was the last one I was willing to try! And OMG...I found the right one on the final try! You want a cigarette while you're riding without having to stop....yup, works awesome for that! You want a cigar....Yup, works awesome for that too!!! Not 1 single complaint about this product will you get from me! At the price, if it lasts the riding season in Michigan, I'll order another one for next season!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "works great but the leads are too shallow",
      "text": "The product works great charges easily, although I would like an LED on it. My main complaint is that the leads are so shallow that it's hard to light things that are not protruding. a flame extends from the lighter the arc here is tough to expose. lighting things like candles becomes very complicated.",
      "rating": 3.0,
      "verified": true,
      "author": "alan",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Lighter lasted 1 day, burns off toxic plastic.",
      "text": "This product lasted me 1 day. I followed the instructions of not lighting the product for more than 5 seconds at a time, and gave it ample time to cool down, yet when I opened the lighter up the day after buying it, the electrodes had plastic melted over them. Who builds a heating product where the heating element is cased in cheap plastic? I scratched some of the plastic off but now when it lights it burns off plastic smoke which is very likely toxic, I wouldn't feel safe keeping this product in my pocket, let alone lighting anything with it, especially anything you plan on inhaling.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Gigante",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Coolest lighter ever",
      "text": "Everyone I show this to is like \"OMG WTF THATS SICK\" but not only is it just cool it's very functional too. The charge lasts a long time and it has no trouble sparking cigarettes or incense. The only thing negative is that the case scratches very easily. Its not really noticeable unless you look at it in direct light but they are there. The top opens and closes with a nice \"snap\" and it has a nice weight. Feels very well built. Plan to always have one of these around for fun and emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "The Perfect Lighter",
      "text": "I was so impressed with this lighter. I live at the beach and it works perfectly in my often windy city. I couldn't believe how affordable the lighter was either. It's so much better than a Zippo in my opinion because you don't have to worry about filling it with lighter fluid and all that. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer J",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Cheap, doesn't work, never held a charge",
      "text": "I purchased this in 2016 and charged it once. It worked as specified. But then never worked again. Most disappointing. I stuck it in a drawer and moved 3 times. Totally forgot about it. Just found it, charged it until it was full. Nothing. Going to call Amazon and request a replacement, lol. Good luck to me.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Pretty freaking awesome lighter",
      "text": "Pretty freaking awesome lighter! Definitely has a cool factor and it draws attention when it's used out in public. We also found out that it's basically a mini taser as it does give quite a sting and shock if you touch the current.",
      "rating": 5.0,
      "verified": true,
      "author": "Celeste",
      "helpful_votes": 2,
      "publication_date": 20160805
    },
    {
      "title": "It works and it's amazing at first",
      "text": "It works and it's amazing at first, but it's one of those gadgets that you use for a couple of weeks before the novelty wears out and you go back to your zippo or even a bic. The main problem is that the space between the metal pieces that creates the current isn't wide enough to fit a regular cigarette so it takes extra effort and time to light the cigarette. And it gets annoying real quick if you light one up 20x a day like I do.",
      "rating": 3.0,
      "verified": true,
      "author": "King Kong Sr.",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Definitely worth it!",
      "text": "This lighter is awesome. Purchased for my husband and he loves it. Everyone is always asking where he got it. Works great and definitely gets people's attention! Would also be an awesome gift for any science nerd or Tesla fan :). Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ehimmelman",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Really cool plasma arc lighter !",
      "text": "I love this lighter ! Really cool plasma arc lighter. Very well made with a quality feel & weight. Charged quick & works good. Came with a small velvet pouch & charging cord. The size of the probes the arc emits from is rather small, but works fine to light cigarettes, doubtful it would light anything else though (candles etc.) I would definitely recommend this lighter. Definitely a conversation piece & beautifully colored.",
      "rating": 5.0,
      "verified": true,
      "author": "Darkstar420",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Not for camping",
      "text": "I am not a smoker, bought this for lighting a solid fuel camp stove. It was a bad idea on my part. The arch took numerous tries to get the fuel tablet to light. I got a butane conversation for a Zippo and now am good to go.",
      "rating": 2.0,
      "verified": true,
      "author": "JDM",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Poorly made.",
      "text": "If you get the lid positioned exactly right, it will light. Otherwise...Worthless There must be some kind of lockout switch that prevents the lighter from operating unless the lid is open. If you open the lid fully (natural to do), it doesn't work. If you close it 5%, it will light...",
      "rating": 1.0,
      "verified": true,
      "author": "Great One",
      "helpful_votes": 3,
      "publication_date": 20170721
    },
    {
      "title": "Dead at 3 months in.",
      "text": "I was very happy with this lighter, but it is unusable after 3 months. Physically, the charging port holds on to the USB cable, but it stopped charging suddenly. The LED flashes red for a few seconds when inserting the plug, then nothing. Is it a bad battery? Who knows. For the price I would think it would last at least 2 years. However, I'm still going to buy another, prettier Tesla. If that fails, I quit (but not smoking! ;-)",
      "rating": 4.0,
      "verified": true,
      "author": "Zut",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "I just love it. It works even on my Harley while ...",
      "text": "I just love it. It works even on my Harley while riding......not that I MUST smoke while riding but it's good to have that option anyway (long rides or maybe just bored) Color is awesome also",
      "rating": 5.0,
      "verified": true,
      "author": "Alex M.",
      "helpful_votes": 3,
      "publication_date": 20170505
    },
    {
      "title": "Coil isn't wide enough to fit the whole tip of a cigarette",
      "text": "First of all, the coil isn't wide enough to fit the whole tip of a cigarette so you can only light half of a cigarette tip at a time which is a real pain in the ass. Second of all the battery goes pretty fast with very moderate use. I think this is because of how long you have to hold it to light one cigarette since you have to move it around to light the whole thing. Great novelty but not very practical. It IS wind proof however so that is a bonus.",
      "rating": 3.0,
      "verified": true,
      "author": "Lea",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "This works fantastic, better than advertised",
      "text": "This works fantastic, better than advertised. Charge it and boom you get a spark that will create fire. The only negative is it has a small profile where the coils create the spark making it very hard to light a scented candle. I simply lit a piece of paper with the coil and lit the candle that way. I'm sure it's perfect for cigarettes (because of the small opening btw the coils) but I do not smoke.",
      "rating": 5.0,
      "verified": true,
      "author": "Titan Art 6",
      "helpful_votes": 2,
      "publication_date": 20160425
    },
    {
      "title": "Inexpensive and efficient lighter",
      "text": "This comes partially charged, but for best use you should plug it in right away. The bottom has an LED that will turn green when it’s ready. So far, I can say it’s light, windproof, safe to use (nothing to spill and it only ignites when the top is open), and comes in a nice velvet bag so nothing in your pocket will scratch it. Buy a few and toss them in your car or kitchen drawer for emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Meehan",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great idea! Highly recommend.",
      "text": "I was a bit apprehensive when I began looking into this lighter. I'm so glad I made purchase. A great invention. Mine arrived fully charged.There's a little red light that is supposed to go on when it needs charging. I like that idea. It goes off when fully charged. I'll use it as a back up for camping, hiking etc. Easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "University DocTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Cool, But There’s a downside.",
      "text": "This was definitely a cool lighter, but it really wasn’t wind proof like they said. The electricity would “break” and not allow you to light a cigarette in the summer breeze or whatever breeze it may be. It is definitely a unique item and I recommend getting this cool lighter, especially if you don’t live in a Windy City.",
      "rating": 3.0,
      "verified": true,
      "author": "Kim Dix",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Initially bought this for a cool gadget. Received it and noticed that the arc ...",
      "text": "Initially bought this for a cool gadget. Received it and noticed that the arc does not reach across both electrodes, further inspection revealed that the casing around some internal wires starts to burn up and melt during use. This is all right out of the box, having not used it at all before finding out about these flaws.",
      "rating": 1.0,
      "verified": true,
      "author": "Generic Human",
      "helpful_votes": 4,
      "publication_date": 20170513
    },
    {
      "title": "Very cool to use!",
      "text": "very cool to use and it's rechargeable. This is exactly what they say it is. Windproof and all. The only downside for me is that I like to smoke cigars and some times pipes and this won't do the job for that. Otherwise I love it! I look forward to them make one with a wider arch gap for cigars.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerhart Hauptman-diaz",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Great product, just a minor annoyance.",
      "text": "It's a nice device, and I love the idea behind it. The lighter does emit a high pitch noise when 'lit', but that's to be expected as it is electric. The lighter itself is very slim and feels great to hold, but I am having a slight issue with it. The button only works when you press the top down, and the bottom of the button just goes in without a click. It's just more of a mild annoyance. I don't know if this is a common issue, or if it's just something the one I got is having issues with, but other than that I like the lighter.",
      "rating": 4.0,
      "verified": true,
      "author": "Jesse Bittle",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Only thing not good about this product is the low power indicator",
      "text": "Only thing not good about this product is the low power indicator. It only goes on red when there's already not enough power to burn anything. But hey if there's no power to burn up anything I would know already cuz it won't light up anything and it's too late for the indicator to tell me that. It should've told me that earlier so I can go charge it before it runs out.",
      "rating": 4.0,
      "verified": true,
      "author": "neil",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "Great Lighter",
      "text": "This lighter works great. I like the concept that to refill it I just plug in in and don't have to use butane or go and by another disposable lighter. For all you reviewers that complain about a cigarette not fitting between the electrodes, you are wrong, because you don't have to put the cigarette between the electrodes. You just get the cigarette close to the arc and the arc jumps up and lights the cigarette.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Makes a weird noise",
      "text": "This lighter is really neat. I got it for my fiance for a stocking stuffer this year. If you like something that doesn't have an open flame, then I reccommend this. HOWEVER, it makes a godawful high-pitched noise. I've noticed that women seem to notice the noise more-so than men, as do dogs. But other than that, this is a nifty little gift!",
      "rating": 4.0,
      "verified": true,
      "author": "d.bachman",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Love the sleek, slim design, rechargeable, easy to use!",
      "text": "Love it! Sleek, slim design, easy to use, but best of all: it's rechargeable! No more having to buy lighter fluids for other types of lighters. It came charged, so I can't make comment on how long it lasts on one charge or how long it takes to recharge. USB port can be used in cars as well, which is a bonus when traveling. AWESOME!",
      "rating": 5.0,
      "verified": true,
      "author": "junipers",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Worked.",
      "text": "I received this lighter and loved it. Only needed to charge it once a week. It looks cool, and feels solid because it is made of metal. My only issue, and why I returned it, is that it stopped charging after 3 weeks. Very disappointed because I loved it. I have a Jeep and when the top was down, this lighter worked great. I may going to try another because I love the tech.",
      "rating": 2.0,
      "verified": true,
      "author": "William K. Redding",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "This is a decent lighter when it works. However ...",
      "text": "This is a decent lighter when it works. However, be forewarned that it really is not large enough to light anything wider than your standard cigarette. Very small arcs. Mine also needed to be returned immediately because the charging port (by far the cheapest part of the lighter) was broken and thus it wouldn't accept a charge at all. I'll be buying something nicer this time.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe C",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Great Gift for Techies",
      "text": "The perfect gift for a techie who has everything. My brother in law had never heard of one of these and is getting a Tesla car, so this was ideal to surprise him! The \"spark\" between the plates is an awesome purple color and is really fun to watch. My only complaint is that it is almost impossible to light a candle with unless it's a stick candle. But that's not too different from a Zippo",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Mickelson",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "I love this lighter",
      "text": "From time to time I'll smoke a little cigar. Simply stated, I love this lighter. It uses electricity to create heat - no flame to get blown out. It's easy to charge although I wish there was an LED to indicate the state of charge remaining in the lighter.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Wasserman",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Shockingly cool",
      "text": "Had one I got as a gift from someone else, got one for a friend that thought it was cool. Mine lasted a long time, pretty good wind resistance, and really a conversation piece of a lighter. Know any smokers that wanna look like bounty hunters from the future? This is a good gift then!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Not really usable",
      "text": "The arc doesn't go far enough out from the device to do much. The fliptop doesn't open far enough to use it well. I can barely light a smoke much less anything else. Looks kinda neat otherwise not very functional.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristi E",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Too narrow to light cigarettes, stops working after 1 week",
      "text": "I ordered this for my girlfriend when it was on sale as a surprise gift. She had problems using it to light cigarettes as the space between the arc points is too narrow to fit a cigarette between. She ended up having to angle it to get a light. The lighter also stopped working after a week. After charging it overnight and ensuring that the charge indicator is green, pressing the button produces a faint noise, but no arc. The indicator is then red when I immediately it back in.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Martin",
      "helpful_votes": 2,
      "publication_date": 20171206
    },
    {
      "title": "Super convenient lighter",
      "text": "This is the best n coolest lighter I've ever had. When I need to light up in a windy day or just in generaL.. People impressed when they ask me for a light. Great gift to a smoker who appreciates a convenient and very expensive looking lighter.",
      "rating": 5.0,
      "verified": true,
      "author": "works great",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Its hard with candles!",
      "text": "I love this little flip lighter. However, I'm not a smoker, I just have a lot of candles and it didn't take me long to find the flaw in the design with candles. The top doesn't open completely so you're left with about a 75 degree angle which makes it challenging to light candles because you're pushing the lit into the wax. However, I can tell by the design that if you're a smoker, this will work perfectly and the little coil lighter is super cool and works well!",
      "rating": 4.0,
      "verified": true,
      "author": "Maria H",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "This lighter worked great for 3 weeks and it went out on me ...",
      "text": "This lighter worked great for 3 weeks and it went out on me just recently. Not sure whats wrong with it but when I charge it till the green light comes on and try to use it, no plasma beam. Luckily there are a bunch of other companies that make these kind of lighters, hopefully my next one lasts longer than 3 weeks.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheshire Storm",
      "helpful_votes": 2,
      "publication_date": 20161103
    },
    {
      "title": "awesome arc lighter",
      "text": "awesome arc lighter. purple arc looks very neat. it only gets 4 stars because the utility is low as in its difficult to use on candles, and really anything if you dont smoke. i use it for melting the nylon coating on magnet wiring and showing off to friends/family",
      "rating": 4.0,
      "verified": true,
      "author": "Damon",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Money up in smoke. Junk junk",
      "text": "Bought one and it lasted about a month or so just beyond return.... then poof nothing . Waste of money should of listened to others who said it was junk , couldn't even find a way to warranty it through tesla or online.",
      "rating": 1.0,
      "verified": true,
      "author": "Fishman",
      "helpful_votes": 2,
      "publication_date": 20171124
    },
    {
      "title": "CStops working/Low battery life",
      "text": "Pretty disappointed with this purchase. For the price I figured I would get something that would last at least a year, but after only a couple weeks, it gets buildup and stops working when there is the slightest amount of wind. The battery does not hold out very long either.",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Barely worked two months!",
      "text": "This was exactly what my husband wanted for Christmas. Initially it charged slow and after lighting a couple cigarettes he would have to recharge it. I assumed that was normal. Well it stopped working in February. It was past the return wondow, otherwise I would request a replacemet. Maybe this one was a lemon.",
      "rating": 1.0,
      "verified": true,
      "author": "RMJ",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Unique Item, Plus It Makes a Great Gift",
      "text": "I liked this so much I bought a second one as a gift. Great quality, it's obviously made well. Unlike old school lighters, this doesn't require pungent fuel or explosive butane, you just plug it into your computer or any USB charger. Well worth the price. Don't hesitate to buy one.",
      "rating": 5.0,
      "verified": true,
      "author": "jerry550",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "WON'T HOLD A CHARGE",
      "text": "Love the look and feel of the lighter and very excited about having it; however after only one week, it's dead. You can't get it to charge, nothing. Waste of $16.00.",
      "rating": 1.0,
      "verified": true,
      "author": "MOMAGAIN",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "broke after a year",
      "text": "I barely used this thing, the narrow area the arc can light limits its use, considering the number of times I used this over the year it worked would be about 3 recharges until it broke (just stopped doing anything with no cause, after attempting to charge, drying, and seeing if the contacts where broken, there still is no reason). for 16 dollars this device is not worth it. 1 in 4 sparks will go to the shell rather than actually sparking due to the bad contacts for the arc.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew Carrell",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Low powered lighter takes a long time and good aim to ignite.",
      "text": "Cool looking but ultimately limited and under-powered. Its low powered and takes forever to ignite unless you can get directly into the arc. The snap cover on cover limits how you can hold this. If you want to light something holding the lighter downwards the cover gets in the way. The small ignition area means you have to have a steady hand and good aim.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Carey",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Too heavy, very dim arc.",
      "text": "It works but it is very mild and not very bright at all. I was hoping from the photos that it would have an amount of brilliance. It is also extremely heavy, which cannot be placed in a shirt pocket or comfortably in a pant pocket. The weight will pucker your shirt and the same for a pant pocket if you have on slacks. These may seem niggling complaints but they are certainly factors to me.",
      "rating": 2.0,
      "verified": true,
      "author": "DAVISION INC.",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "The idea and concept are cool but this stopped working three times after I used ...",
      "text": "The idea and concept are cool but this stopped working three times after I used it on a full charge. Returned it for my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "jkuligow",
      "helpful_votes": 2,
      "publication_date": 20180109
    },
    {
      "title": "Stopped working after a couple weeks",
      "text": "When I got this, it worked very well. Then it stopped working suddenly. I recharged it overnight hoping that was the issue, but it was not. I've tried contacting the company, and they got back to me once an earlier draft of this review was posted. I was able to return this through Amazon, but remain disappointed in the product.",
      "rating": 1.0,
      "verified": true,
      "author": "JN",
      "helpful_votes": 2,
      "publication_date": 20170622
    },
    {
      "title": "Limited purpose lighter",
      "text": "Cool product, nice conversation piece and it satisfied that impulse buying urge for me. However, it's not very practical for lighting cigarettes, cigars, grills, etc. The arch of electricity is way too small. For an \"emergency\" lighter that you can charge with a USB, I'm sure it could be useful.",
      "rating": 3.0,
      "verified": true,
      "author": "PAHunter",
      "helpful_votes": 2,
      "publication_date": 20160806
    }
  ],
  "product_meta": {
    "title": "Tesla Coil Lighters™ USB Rechargeable Windproof Arc Lighter (1. Gun Metal)",
    "description": "Color:1. Gun MetalTake charge with the Tesla Coil Lighters, a rechargeable electric lighter that requires no flame, no butane, no hassle! \nThis innovative lighter works by creating an electric arc with one press of a button. Simply charge up via USB and you’re ready to go -- Anytime, anywhere. \nSince the lighter uses no flame, it is not only windproof, but also economical and environmentally friendly. No more lighter fluid refills or throwing out those cheap plastic lighters! \nThe lighter also has a safety feature, so it will not light up when the lid is closed. \nHere at Tesla Coil Lighters, we believe in forging the way with inventive new products designed for the modern world. The Tesla Coil Lighter is simple, safe, reliable, and with its sleek and elegant design, it makes a great gift for yourself or your friends. \n\nWARNING \n\nUse away from face, body, clothing, metallic and flammable clothing. DO NOT puncture or use near open electric arc flame. DO NOT expose to temperatures above 50° C (122° F) DO NOT please in sunlight for long periods of time. DO NOT keep flame lit for more then 5 seconds at a time. Lighter are NOT toys- keep away from children. Use only in well ventilated area. Ensure the electric arc flame is extinguished after use. \n\n****************************************************************************************\n***DO NOT touch the arc, as it will result in burn or possible small shock.***\n****************************************************************************************",
    "rating": 4.2,
    "feature_bullets": [
      "1 – Tesla Coil Lighters Arc Lighter",
      "Size: 3” x 1.75” x 0.5” / Weight 3 oz (Arc length: 5mm)",
      "USB Rechargeable",
      "Safe and easy to use, lights at the click of a button",
      "A full charge can last up to a week or 100-300 uses"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.75 x 0.5 x 3 inches; 4 Ounces",
      "Item model number": "B016P8A1K4RCM",
      "Batteries": "1 Lithium ion batteries required.",
      "Date First Available": "October 15, 2015",
      "Manufacturer": "Tesla Coil Lighters",
      "ASIN": "B016P8A1K4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Household Supplies",
      "Lighters",
      "Health & Household",
      "Health, Household & Baby Care",
      "Lighters & Matches"
    ],
    "price": 16.99
  }
}