{
  "website_summaries": [
    {
      "verdict": "Survival rated for 0°F, this duck-down mummy bag should keep you comfortable at temperatures above 10°F.",
      "pros": [
        "Mummy-style bag with 800+ fill power duck down",
        "Shell fabric is 20D ripstop with VitalDry DWR coating",
        "Internal fabric is 320T ripstop",
        "YKK heavy-duty zippers with zipper guards",
        "Grid baffle design locks down in place",
        "Compresses to a small space",
        "Choice of colors and sizes",
        "Survival rating of 0°F"
      ],
      "cons": [
        "The stitching could be better"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It probably got to 10-15 F and I was nice and warm",
      "text": "I've used it three times above 11'000ft in the snow covered Rocky Mountains. It probably got to 10-15 F and I was nice and warm Update: A yea and a half in and its still going strong. It may have lost a little loft but not enough to notice. It is currently my go to bag or 3 season camping in Colorado. I've used it in multiple bivy and hammock sleeping systems.",
      "rating": 5.0,
      "verified": true,
      "author": "S.",
      "helpful_votes": 38,
      "publication_date": 20160602
    },
    {
      "title": "Worth the Money",
      "text": "Just did 5 days in The Smokies with this bag in the middle of November. Temperatures got down to 20 degrees, with 30 mile an hour winds. I was in a 3 season Kelty TN2 tent. Slept with longjons, no socks and the bag was completely closed up. It held up well, kept me nice and warm. For the price you can't beat this bag. If you need a lite more warmth get the liner. I would have gave it 5 stars but i need to see how it holds up.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 20,
      "publication_date": 20161120
    },
    {
      "title": "First Impressions",
      "text": "First impressions: *Bag is light for how warm it is. *Cinches well. *Down appears to be distributed evenly. *Good for price. *Bag is slightly shorter than I would have expected. I am 6'3\" and I feel like the length is shorter than other 6'6\" bags I have purchased. This being said, there is plenty of room especially on the side such that I do not feel claustrophobic, which is really nice!",
      "rating": 5.0,
      "verified": true,
      "author": "WasatchWranglerJon",
      "helpful_votes": 11,
      "publication_date": 20161010
    },
    {
      "title": "It smelled like a dead animal",
      "text": "It smelled like something died in it. As soon as I pulled it out of the box and laid it out the smell filled the room. I don’t know if it was already used or maybe the material is cheap. It smelled awful! I laid it out for a could days to let it air out, but that did nothing. I couldn’t use it for my trip. It really smelled like a dead animal. Had to send it back. Thankfully they accepted my return without conflict. I read other reviews and they had the same problem Beware!!",
      "rating": 1.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 5,
      "publication_date": 20200106
    },
    {
      "title": "The bag is great, I slept in it at -2 °C and ...",
      "text": "The bag is great, I slept in it at -2 °C and it was real comfy (of course you have to wear enough clothes too), but it's also comfortable at higher temperatures because of double-zipper (which btw works great). I just wish there was a medium size because I'm exactly 6 feet tall and a long size is too long (I read in previous reviews that a regular would be too short). And I think for that price it should be waterproof too, considering it's not a big name brand (yet).",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 4,
      "publication_date": 20171114
    },
    {
      "title": "Very poor quality control down leaks out of all the seams ...",
      "text": "Very poor quality control down leaks out of all the seams and there is 0 degree bag only keeps me warm down to 30 degrees. Left my 30 degree outdoor vitals bag behind at a campsite wasn't worth my time carrying. I will never buy anything from one vitals again junk!",
      "rating": 1.0,
      "verified": true,
      "author": "Steven Gaskill",
      "helpful_votes": 6,
      "publication_date": 20180630
    },
    {
      "title": "Highly recommended!",
      "text": "Bought this bag just in time for the snow to hit. Couldn't be happier. Besides having great YKK zippers, being lightweight and very compressible, it kept me warm down to the low 20's on the last few trips. Being a huskier build, I purchased the long size and had plenty of room. Due to using a 3 season tent in the snow, a considerable amou t of condensation dripped on the bag but didn't penetrate the shell. It was also extremely quick to dry off. Looking at buying a warmer weather version for summer now too. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh D",
      "helpful_votes": 7,
      "publication_date": 20170213
    },
    {
      "title": "Quality bag at reasonable price.",
      "text": "Nice construction, down looks fairly evenly distributed when looking through the shell up at the sun. Some squares are certainly more empty than others, which is the nature of such a value bag. At 40 F, the bag is much too warm to have zipped up and head inside bag. I have no doubt I'd be plenty warm at 20 F, I do sleep hot however, and always sleep in a base layer outside. Packs down nice and small even without yanking on compression straps. Significantly smaller and a bit lighter than my 20F Kelty Synthetic Cosmic bag I've had for years. This has to be the best bag for the money out there.",
      "rating": 5.0,
      "verified": true,
      "author": "eyebeatbadgers",
      "helpful_votes": 3,
      "publication_date": 20161112
    },
    {
      "title": "Wider / More shoulder space than other brands",
      "text": "I’m 6’2”, 200lbs and a side sleeper (purchased the long version). I needed a really warm, light-weight bag, but didn’t want to feel claustrophobic or cramped. I narrowed my decision down to 3 bags and then noticed the difference in dementions between brands. This bag had more width in the shoulder area and feet than other brands. This was the deciding factor for me. I’m a very deserning buyer and could not be more pleased with the design and quality of this bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 4,
      "publication_date": 20171019
    },
    {
      "title": "A very high quality sleeping bag",
      "text": "I used it snow camping and with a base layer and fleece jacket I was quite comfortable with the temperature in single digits. I'm always careful when zipping my bags but this one is easy to use and didn't hang up or get caught on the material. The stuff sack is also a compression bag which is a nice bonus. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan S.",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Warm and Light",
      "text": "I love this bag. It is warm and light and very compact for backpacking. I am overall happy with the bag, but I do doubt that it is truly rated for 0*F. One night got below freezing and I was borderline cold. I had a bag liner, plus wore a long sleeve and longjohns and winter hat, but I was still slightly chilled. Seeing that I won't be winter camping I won't make a fuss, but if you are looking for a TRUE 0* bag, I think you should look further.",
      "rating": 5.0,
      "verified": true,
      "author": "canadanika",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "This Sleeping bag is great for cold weather camping",
      "text": "Have the 0 degree Summit model and used it the other night in 26 F weather and stayed very warm in it. Can't wait to use it more this winter to see how warm it will keep me in 0 degree coldness. I like that the bag is roomy inside and not too tight which is good for layering. It's nice that it also packs small, is light weight and fits in my backpack and kayak with no problems. Looking forward to many years of camping with this sleeping bag!",
      "rating": 5.0,
      "verified": true,
      "author": "James B.",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "So far so good!",
      "text": "I haven't used this in freezing Temps yet but did take it up for a weekend backpacking trip where the Temps were only just chilly. This bag is super lofty and comfy and I used it as a blanket because how warm it is. It compresses nice and easy and legit only ways less then 3.07 pounds. I'll update my review once Ive used it in colder temps!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S",
      "helpful_votes": 9,
      "publication_date": 20160619
    },
    {
      "title": "A light-weight and durable sleeping bag for high-altitude trekking",
      "text": "I purchased this sleeping bag in April 2016 and used it in the Himalayas for a trek to the frozen lake of Roopkund @ 15,696 ft in May 2016. The bag compressed down to nicely fit into the bottom of my 65-litre backpack and was no trouble to carry at ~2 lb in weight. The bag is rated to 0 F and was very comfortable with blizzard conditions outside our tent @ 14,100 ft at advanced base camp. The bag takes around 5 min to stuff inside its compression sack in the morning. Great value for money!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Ramakrishnan",
      "helpful_votes": 5,
      "publication_date": 20160523
    },
    {
      "title": "Oh yeah!",
      "text": "I love this bag! Super compact, extremely roomy, very light weight and you can't beat the price!!!! I live in the tongass rainforest in southeast alaska and our level of rain is no joke! 13 feet a year on average! So if course the first thing I had to do was test it's water repellant-ness! Epic! I poured water and let it sit ...nothing soaked! Sooo important! Next most important thing is omg so comfortable!! Great fabric and perfectly roomy! I'm 6ft tall and fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessi R.",
      "helpful_votes": 3,
      "publication_date": 20170826
    },
    {
      "title": "sleeping bag",
      "text": "seams to be good .the bag is to short for me .wanted to return it for a longer one but could not get a return label for it would of had to drive to a ups shipping store to return .the closes one is a 80 mile trip for me so make sure you order the right one . I will give this one away to a friend. 9-1-19 I was able to get out and use this bag in cooler weather at last . It was warm I always sleep in shorts and no shirt. It was windy and 41 degrees cowboy camping for the weekend..There was heavy dew in the morning water resistant worked well.",
      "rating": 3.0,
      "verified": true,
      "author": "william",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Outstanding bag",
      "text": "I purchased this bag before a trip. I put it through a ringer and it still looks, feels, and sleeps like new. It kept me warm down to 24 degrees with just shorts and socks on. At 19 degrees, I needed a shirt, pants and socks but I stayed warm and slept well. I did use it with a quality sleeping pad. After 87 nights, i would and do recommend this bag to everyone. It is still my go-to and I have no doubt it will last for a long time. I have noticed a bit of down leakage, but I expect that after this much use. Hats off to outdoor vitals for making an outstanding and affordable bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20161230
    },
    {
      "title": "Uinta elk hunt",
      "text": "Purchased this sleeping bag based off of price and reviews. Im pleased with the performance and materials used with this bag. Used this bag close to the Wyoming and Utah line on a elk hunt with nights dipping into the low 20's bag was alot warmer than I thought it would be. Still could feel a lite chill creeping in so I dont know if it would be as comfortable down around 0 deg. My biggest complaint was my Q core sl lite sleeping pad. Back was getting almost to the point of becoming uncomfortable with the cold coming from my backside. So with a better insulated pad it might be a true 0deg bag.",
      "rating": 4.0,
      "verified": true,
      "author": "mitemag 270",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Works well as a sleeping bag or top quilt in a hammock.",
      "text": "Used the bag on a three night backpacking trip when the temperature dropped to 27 degrees. I used it one night in a hammock zipped up and the other two nights as a top quilt, unzipped. Also have used it on a sleeping pad on the ground, zipped up as a sleeping bag. It is light, compresses very well and was plenty warm. I'm very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "This was perfect! Light weight and kept me warm",
      "text": "I've been looking for a sleeping bag that could fit me as I'm a short (4'11\"). This was perfect! Light weight and kept me warm. I'm always cold so even 50 degrees is cold for me. I noticed feathers coming out but when folding it, not sure from where. I'm wondering if this will affect it. I will update if there other issues, but for now I'm in love with it. #scoutmom #itsascoutthing",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda Colon",
      "helpful_votes": 2,
      "publication_date": 20170913
    },
    {
      "title": "A Complete Letdown",
      "text": "I had high hopes for this bag but it was a flop. There were two major flaws: First, the zipper is tough to zip and it snags even though it is supposed to be snag proof model. Second, I spent one night in the bag and my feet were covered in feathers the next morning. The stitching is very poor. Going back!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "MP",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Buy this bag!",
      "text": "Great bag. Used it a lot and it's still in perfect condition. Has kept me warm in 15f degrees with no tent. The morning dew drys off quickly when held near a fire, you can watch the moisture evaporate from the bag. Follow my adventures with this bag on Instagram @spiritovermind88",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 7,
      "publication_date": 20170107
    },
    {
      "title": "Best Sleeping Bag yet.",
      "text": "Super light, tough construction. Down fluffs up quickly and keeps the temps warm. Used it on two occasions and I love it. Temps were around 40 degrees. Will keep testing as it gets colder. Zippered are excellent. No snagging. This is by far the best value for a QUALITY bag. P.S. Get the liner to keep it clean!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kochman",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Warm bag",
      "text": "Nice and warm only complaint is zipper cannot be operated from the inside have to reach out through hood opening. I have the zero degree long version and wish the compression bag was larger. Update: Carried this bag on AT for 5 months Feb-July. Ignore me wishing the compression bag was larger, it's fine I was just too gentle initially. After stuffing it almost everyday for 5 months it fits fine and has retained its loft as far as I can tell. Always warm enough in the cold months and as you might expect way too warm later. Very satisfied, still looks almost new, no odors or plumage leaking.",
      "rating": 4.0,
      "verified": true,
      "author": "Marion M.",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Great for the price! So far so good.",
      "text": "Great for the price but loses down material every time you get in and out of the bag. Compact and packable.The shell protected the fallen snow from moisture during winter camping. Can't complain too much as it kept me warm during cold winter camping but soon enough I feel like I will notice the lost down. Until then 4 stars! ⭐️ ⭐️ ⭐️ ⭐️",
      "rating": 4.0,
      "verified": true,
      "author": "Peter F",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "I bought this for my duaghter and we took it ...",
      "text": "I bought this for my duaghter and we took it on a two night backpacking trip. We noticed some down feathers on the outside of the bag and when she woke up and left her sleeping bag, there were feathers on her legs. We returned the sleeping bag when we got back , thus the two stars. However, we are giving Outdoor Vitals the benefit of the doubt by assuming this was a \"one off\" and we have sinced ordered a new bag. I will offer an update when we receive the new bag.",
      "rating": 2.0,
      "verified": true,
      "author": "Adventurer",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "It was warm enough that I had to unzip to cool off at temperature of 30 and warmer",
      "text": "I spent my first night in this bag in 15 degree weather, and 45 mile an hour winds. I never got cold during the stay. The next several days were in the mid to low thirties. It was warm enough that I had to unzip to cool off at temperature of 30 and warmer. I am 5.10 and it provides plenty of room. I had no issues with the bag what so ever, and it seems pretty solid. Overall, I am completely satisfied with the product, and still can't believe the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason T Swaggart",
      "helpful_votes": 3,
      "publication_date": 20161219
    },
    {
      "title": "Great bag, Great service, Great Price",
      "text": "Purchased this bag a few months ago and have been to Montana in the Crazy's and a Boy Scouting camp with my oldest. Both nights got down in the 30's. Nice and warm both nights. Used different tents on both occasions so I know it is the bag that is doing the work. Great feel, not loud when moving inside, comfortable, and great price for a 800 fill bag. Would buy over and over. Add to cart, check out!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Great value for the price",
      "text": "Really liked this bag. Used it on a recent hunt where overnight temps were 7F, 14F, 21F, then 20F. I did back it up with a MegaWarmer in the toe box but overall was very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "C. RobinsonTop Contributor: Archery",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Champagne quality on a PBR budget!",
      "text": "This bag is great! I tried it out last week on a weekend trip. Got in, zipped up and was warm and toasty all night. Excellent quality materials. Smooth working zipper, no snagging! I like that the zipper is longer than some other bags I've had makes it easier to make a late night bathroom run without waking anyone else up. I have used bags that cost twice what this cost would not stand up to the quality of this bag. I am extremely happy with this bag and would Highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "William Scanlon",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Quality product at a fantastic price",
      "text": "I was looking for a lightweight sleeping bag for backpacking at a decent price and this sleeping bag fit the bill perfectly. I have plans to take it out in a couple of weeks to see how it performs in the mountains of Colorado. Initial impressions are that the sleeping bag is well made and every bit as nice as sleeping bags twice as expensive. I like the idea of supporting young startup companies like this who create quality products at a reasonable price. At 6'1\", I'm glad that I purchased the long size as the bag would be extremely snug at the regular size (6 inches smaller).",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "Comfy but might not be enough for 20°F",
      "text": "I just spent the night outside with this sleeping bag and I'm a bit disappointed. The coldest expected temperature of the night was 21°F so I put an extra down liner to keep myself warmer. I wore long Merino underwears, sleeping over a duvet air mattress ( Exped down mat), had a wool hat on. At first, I feel asleep easily and comfortably. Unfortunately, a few hours later, I woke up shivering and couldn't sleep well for the rest of the night. It might be caused by my cotton socks that were under my wool socks. To be tested again. Also, I found the shoulders were not covered enough since the elastic doesn't go all around the neck.",
      "rating": 3.0,
      "verified": true,
      "author": "Jenny Du",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "weather was cool and the temps hit low forties",
      "text": "Went camping, weather was cool and the temps hit low forties.... Wasn't comfortable. A. Cold sleeper. B. Was wearing shorts. I would recommend this bag, and advise that you wear more than I, if the temps are cooler out. Pros: compacts very small Good temp Lightweight DOWN! Con: Not quite wide enough for me (I know, I'm broad shouldered and large chest.) I'd rate it as a thirty degree bag I'll still use it thru the summer and early fall.",
      "rating": 4.0,
      "verified": true,
      "author": "Hiking Joe",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "This is one of the best values for a zero degree sleeping bag.",
      "text": "It is a very light weight sleeping bag. It retains the users body heats extremely well. I've use it in ~20 degree condition and it does the job perfectly. It is so comfortable that I use it as a blanket sometimes.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "So far very impressed.",
      "text": "Upon receiving my new bag I fluffed it out and payed it to allow full loft. I measured from the ground up and it clears 5\". It has been an unusually warm winter here in N Georgia so I haven't had it down to super low temps. But I have no worries at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Howard",
      "helpful_votes": 6,
      "publication_date": 20160131
    },
    {
      "title": "I love it. I took off a star because the ...",
      "text": "I love it. I took off a star because the stuff sack was poorly made and ripped the first time I pulled in tight. I bought an REI 15 little stuff sack so problem solved. I highly recommend the inflatable pillow these guys make. It fits PERFECTLY.",
      "rating": 4.0,
      "verified": true,
      "author": "pbike908",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Great bag, especially for the price",
      "text": "Bought it earlier this summer for backpacking and car camping. Got out with it a couple times and was very pleased. I struggle with getting cold at night and find I need a bag rated much cooler than the temp I'm expecting to be in. This one really delivered. I stayed warm every night I used it. Good quality construction. Looks great. Very light for the price and performance, and packs down to nothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Gibson",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Time to hit the trails!",
      "text": "The 20 degree bag is perfect for me. Compresses very small to fit my bag leaving plenty of room for other gear while keeping me more than toasty at temps around 32 degrees (was sweating at times). I have no doubt I would be comfortable if I had the opportunity to take it out in the low 20s. Double zipper and footbox loops for hanging storage were great additions to such a high quality yet low cost bag. Use a bag liner to keep it clean longer and you won't be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian K",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Great bag, Sleep Naked",
      "text": "Worked awesome for living in a yurt during the Winter in the PNW and kept me warm on a caribou hunt in the Arctic Circle in Alaska. One suggestion is to not wear clothes in this bag because if you sweat inside you will wake up freezing because it traps everything inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan Stencil",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Stop looking and buy.",
      "text": "I did a lot of research before buying a sleeping bag. I live in Colorado and needed a fairly light weight, warm bag that would also compact well for motorcycle camping. It packs down small and is still big enough for taller people I am 6'1 and fit no problem. The down is evenly distributed. I have not camped with it yet but I can tell it'll keep me warm. I'll update if I have any issues. Definitely comparable to $300 and up bags I've seen. Can't beat this for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "miles",
      "helpful_votes": 2,
      "publication_date": 20160622
    },
    {
      "title": "Works",
      "text": "I used this sleeping bag at 11,000 feet elevation in November. Light and fairly warm. Needed a fleece to be completely warm as I got cold sleeping in just base layers. For the price this bag gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 2,
      "publication_date": 20161228
    },
    {
      "title": "zero degree bag...a great buy for the money",
      "text": "I very much liked this bag. I was warmer in this bag than any other I have ever used. It is not fancy but does the job. 4 solid stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas R. Johnson",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Performs in cold weather like bags twice the price",
      "text": "Value for money. Performs in cold weather like bags twice the price, used in freezing temps with a mattress pad and no additional clothing layers. I do plan on waterproofing it, as it got wet from water droplets in the tent walls. I did not feel the wetness on the inside wall of the bag. I turn in place all night, so the extra space was great (I am mid 5 height). A shorter version would have been great, so it wouldn't touch the tent walls",
      "rating": 5.0,
      "verified": true,
      "author": "mkk",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "Best bag for the money.",
      "text": "I'm 6'2\" 245 lbs., and got the long 0 degree Summit. It took a day to fully loft after shipment. I'm very pleased, the bag is as described. The roomy mummy fit allows me to roll in the bag to sides and stomach, and bend and separate the knees. Very pleased with this quality bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Excellent bag!!",
      "text": "Wow! This is my first down bag and I was a little leery of how comfortable I would be but 29 degrees Fahrenheit was a piece pf cake for this bag with only pajama bottoms and a t-shirt for night clothes. Packs down pretty small too! I've found my new go to sleeping bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Seeker 1160Top Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "I LOVE how easily this bag compresses",
      "text": "I was staying in a mountain hut in Switzerland and the room was without heating with a window that would not fully close. Even with this and the resulting freezing conditions, I woke up sweating in my bag. I am confident that I will be able to use this bag outdoors, as well. Additionally, I LOVE how easily this bag compresses. I carry a smaller backpack by most standards and I still had plenty of room for the bag, my 10L bladder, and all my various pieces of equipment. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Hayley Meyer",
      "helpful_votes": 2,
      "publication_date": 20160913
    },
    {
      "title": "great value. The stuff sack is a bit flimsy ...",
      "text": "Warm, compressible, great value. The stuff sack is a bit flimsy seeming when your crank down the compression straps but other than that the bag itself is great. I returned other big name bags of twice the price and use this one now.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "These bags are great for the price and I recommend them to anyone ...",
      "text": "Hello fellow outdoor enthusiasts! I was waiting to post my review until I had used the bag. I just got back from a 3 day hammock camping trip in Colorado at about 10,000 feet. the lows got into the teens and had to order this bag as the 0 degree wasn't in my size. I used a diy 30 degree underquilt and this bag with a warm waterbottle and was warm all night. These bags are great for the price and I recommend them to anyone looking for a warm, inexpensive down bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean karika",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "I'm 5'3\" and the short bag was too short",
      "text": "I liked the bag, it was comfortable but it did not get as lofty and full as the pictures. I'm 5'3\" and the short bag was too short. The shoulder baffle did not seal me in with my feet all the way scrunched down in the bag. I had to return it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kerri",
      "helpful_votes": 2,
      "publication_date": 20170220
    },
    {
      "title": "Great purchase",
      "text": "Very pleased with this bag. The night it arrived I used it and slept well enough on a 32f night. This was before it really had a chance to fluff up. Next night I was maybe a little too warm on another freezing night. Light weight and packs small. I was sleeping in a very light down Jacket and flannel pajama bottoms. I think with the correct sleepwear this is absolutely a 0 degree bag.",
      "rating": 5.0,
      "verified": true,
      "author": "chris flom",
      "helpful_votes": 3,
      "publication_date": 20161109
    },
    {
      "title": "Amazing, warm compact",
      "text": "Amazing, warm compact. I was in the Grand Tetons for 4 days. I have to admit, I do wish I would have got a bag for a little cooler temperatures. I think it got down into the low 40s high 30s and I was a bit cold.",
      "rating": 5.0,
      "verified": true,
      "author": "B Spencer",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Very nice bag! Recommend it.",
      "text": "I've only used the bag on one camping trip so far but I love it! It's super warm and fits me perfectly. I'm 5'10\" so the 6 foot bag is a great fit. The weather was mild 39 one night, 29 the next and then 36 the next. I had to remove all over clothing because it was too warm. It should work great in the mountains into the teens. Look forward to backpacking with it. Two thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C.",
      "helpful_votes": 2,
      "publication_date": 20161121
    },
    {
      "title": "Not a warm bag",
      "text": "This is one of the worst description is a bag! This bag was NOT warm whatsoever for the temperature it states. We just took this bag bow hunting and the temp at night was 40 degrees and I was cold! Horrible horrible bag! Do not spend the money it’s not worth it! You have to sleep on you back and it needs to be 50 degrees to be warm in it! Sorry! It’s not a good bag!",
      "rating": 1.0,
      "verified": true,
      "author": "Gina Treganza",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "first impression not the best, was hoping it would compress a bit smaller",
      "text": "Compression bag buckle broke 5 seconds out the box, first impression not the best, was hoping it would compress a bit smaller, other than that everything seems in check",
      "rating": 4.0,
      "verified": true,
      "author": "josue",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Very warm, packs down great",
      "text": "Love this bag, it's warm and light. First night out it was 3° and snowing, in a hamok just my rear got cold, but I added an insulated pad and was sung the rest of the night. I campout at least once a month in the Rockies, so far December- April I have not been disappointed. Seems to be holding up well, and I love that it wasn't $$$$ for a high quality down bag. I'm going to buy a 30° bag for the warmer months.",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina Hansen",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Good but expensive",
      "text": "I just camped out with this sleeping bag, got rained on and soaked",
      "rating": 4.0,
      "verified": true,
      "author": "Russell C.",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great bag. Bought it with slight reservations just based ...",
      "text": "Great bag. Bought it with slight reservations just based on the price being lower than what you get for mainstream high end sleeping bags. But my girlfriend used this bag on a recent hike where temperatures got near zero with wind chill, and she was having to take layers off from how warm she was, which was more than I could say for myself in my marmot!",
      "rating": 5.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 14,
      "publication_date": 20160222
    },
    {
      "title": "Very good quality",
      "text": "I use this bag for backpacking. It's lightweight and warm, and seems to be good quality",
      "rating": 5.0,
      "verified": true,
      "author": "Werner N.",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Great loft equals great warmth",
      "text": "I love this bag. Finally, a bag that keeps me warm. I spent a couple night in cold, snowy conditions and this bag kept me toasty and comfortable. It has great loft.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Great product. I used this sleeping recently while trekking ...",
      "text": "Great product. I used this sleeping bag recently while trekking up Mt. Kilimanjaro. It's light, compact, and keeps you warm and comfortable on very cold nights. The price of this product was nice as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Breview",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "Warm enough for Canadian Winter",
      "text": "Great sleeping bag! Took this on a 3 day ski touring trip and have zero complaints. Packs up nice and small, great water resistant material for the shell, and its warm enough for Canadian winter. Plus a great price. Couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170108
    },
    {
      "title": "It was great! It kept me so warm",
      "text": "I used this up in the high mountains of Montana. It was great! It kept me so warm, was light in my pack and can compress to conserve space. Overall I really enjoyed going with this company. I have a marmot trestles that I purchased at REI and this sleeping bag is just as good, if not better. My 60 yo mother who used it one night said she wasn't cold and had plenty of space. This was a big deal considering she is always cold and has talked about how she dislikes mummy bags. I would definitely recommend this to friends and family!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah H",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Keeps you warm, is lightweight and packs nicely. Great bag for the price.",
      "text": "Bag is light, compresses easily and is very packable. So far I've used it for two trips, and overnight car camping trip, and a 2 night backpacking trip, and it kept me very warm (read: hot) on nights that were in the 40s and 50s. I haven't had a chance to try this out on cooler nights, but I 'm confident it would keep me warm and comfortable down into the 30s. For the price, this bag was a steal. Overall I am very pleased with this bag thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Drotar",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "seems to be made nicely. seams are straight looks great can't wait to ...",
      "text": "seems to be made nicely. seams are straight looks great can't wait to use it. Very roomy upper.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 2,
      "publication_date": 20170101
    },
    {
      "title": "Great quality and unbeatable price!",
      "text": "We purchased these bags for an overnight above 10,000 feet on Mount Rainier this summer and were not disappointed. Cant wait to try them out in winter conditions. Incredibly warm and soft. Lightweight, easy to pack and unbeatable price. Great customer service. Thanks Outdoor Vitals. Would definitely recommend to anyone looking for an affordable 0 degree bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Helm",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Great for hunting in mountains",
      "text": "Nice quality. Light weight. Has zipper access. Cold weather ratings. Arrived in time for Christmas",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Hunter",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Great bag",
      "text": "This is a fantastic bag. It has an incredible amount of loft. Is very light and super warm. Construction quality is good. Zippers don't snag. No down leaking out. The inner baffle is a nice touch. This is also a roomy bag. I'm a side sleeper and like to move my legs around. This lets me sleep comfortably. Outdoor Vitals recommends shaking the bag out to let it get loft. Agreed. This is easily a $300 bag for half the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Turneruwf",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Great in cold weather!",
      "text": "I just came back from an overnight trip near Winter Park, CO. The overnight lows were in the single digits, if not 0 degr. F. This sleeping bag kept me warm all night. Best sleeping bag I've ever purchased!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Wojniak",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Really like this company",
      "text": "I've bought a couple sleeping from OV and really the quality of their work. I have the 25 degree and 0 degree bags. Both of which have performed flawlessly. As advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Ball",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "I'm happy with the purchase",
      "text": "I used this sleeping bag in a snow cave last week. Outside temperature dropped to 17 degrees but this sleeping bag (and I'm sure being in the snow cave helped too) kept me warm throughout the night! I'm happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160226
    },
    {
      "title": "I got this as a gift and I absolutely love it! I haven't been able to take it ...",
      "text": "I got this as a gift and I absolutely love it! I haven't been able to take it backpacking yet, but I took it outside when it was really cold and it seemed to work great, I didn't feel cold at all. The Outdoor Vitals website has great videos about how to best care for the sleeping bag as well. Definitely worth the buy!",
      "rating": 5.0,
      "verified": true,
      "author": "RandJ",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Bag looks and feels nice but the shoulder cord pulled out the first time ...",
      "text": "Bag looks and feels nice but the shoulder cord pulled out the first time I used it and the zipper snags easily. I don't generally use the shoulder cord so hopefully this is not a sign of the general overall quality and the zipper is just an annoyance which is common on many bags.",
      "rating": 3.0,
      "verified": true,
      "author": "K.L.",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "but I stayed nice and warm",
      "text": "The first night I used it, the temps went into the high 20s. I was not using a liner or wearing a hat, but I stayed nice and warm. It compresses nice and small, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Bought this bag for my daughter and I am impressed ...",
      "text": "Bought this bag for my daughter and I am impressed! She needed a bag for backpacking and this compresses very small and light. So far she hasn’t tested it outside but I think it will keep her plenty warm too! Looking to get one for my son who has a huge/heavy bag currently.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Anderson",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "It's a good one.",
      "text": "Packs light, great color, and is very warm. I got this for my wife as I have the male version. We were toasty on a snowy night at 9k feet last Fall. It must have been around 30 degrees and no need for much of a base layer. That's what I'd expect from a 20 degree bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "I am very happy sleeping bag came quickly after ordering",
      "text": "I am very happy sleeping bag came quickly after ordering. It appears to be very warm and is very comfortable would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Great economical bag!",
      "text": "Used just once, but i already like it better than my Sierra Designs bag. The material is comfortable to sleep in. Was actually too warm on a 45degree night. Slept with zipper opened and it was good. Packs very small.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Hall",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Pretty Descent for the Price",
      "text": "While the night weather didn't drop below 35 degrees, I was still pretty chilly in this bag. Mainly my feet was cold. However I did sleep in a hammock. I'll review again when sleeping on the ground to see if that would make a difference.",
      "rating": 4.0,
      "verified": true,
      "author": "nevans",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "No issues at all!",
      "text": "I love this bag. For the price it holds its function very well. I love the feel of it and Ive spent the night in the low teens and i was fine even though my body can be sensitive to the cold. It compresses to a decent size and it really fluffs up when laid out. Excited to use it again for another winter camping trip",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Great buy",
      "text": "This bag is a must. Very lightweight great quality of material and zipper. I was honestly very skeptical of this because the price of a 0 degree down bag usually is a couple hundred, after doing research about this company it was a no brainer. The friends and family I go backpacking with are ordering one as well",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Nice zipper. Kept me very warm but it wasn't ...",
      "text": "I have only used this bag on one trip so far but I was very impressed with it. It compresseddown small enough for backpacking and comes with a compression sack. It has Velcro and a draw string to cinch around your head. Nice zipper. Kept me very warm but it wasn't quite freezing temperature so I'm excited to test it out once it gets a bit colder. Company offers great info for proper care of the bag and lifetime warranty!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "Awesome, light, and great value",
      "text": "Used this for hiking/backpacking trip to the grand canyon with my son over spring break. Days were in the 80's nights down to the mid to high 40's. My son used this and was hot. this kept him comfortable. I was using a similar 800 fill down sleeping bag. We both were sweating. These are light weight and easy to pack. Highly recommend. These pack small and light. Great for backpacking.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Navarro",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Great value!",
      "text": "At the time of writing this, the Outdoor Vitals Summit 0 degree is the best value zero degree down bag on the market. Performed excellent on several occasions in sub freezing temperatures.",
      "rating": 5.0,
      "verified": true,
      "author": "Peyton",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Perfect sleeping bag for cold weather.",
      "text": "Currently went on a 3-day AT hiking trip in 10 f degree weather. This sleeping bag was phenomenal in keeping me warm. My feet did get cold but once I layered properly I was very cozy. Pull strings were an amazing help to keep the cold out. Great size for long camping and back packing trips!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "This is the best sleeping bag I've every used",
      "text": "This is the best sleeping bag I've every used. Keeps me warm when it's very cold but breathable so it doesn't feel like your sleeping in a ziplock baggie.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Great purchase",
      "text": "Just used this for a camping trip in Alaska. Night time temps were about 25 and I was super warm and comfy, could easily have handled colder. The compression bag works really well, so this packed nice and small, I was able to fit a number of other items in the sleeping bag compartment of my backpack with it. The seems and construction are solid, I certainly don't notice anything amiss with any seams or zippers. I doubt you can get a better bag for this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "Easy to pack",
      "text": "Easy to back. Doesn't take a lot space. Warm for warmer camping.",
      "rating": 5.0,
      "verified": true,
      "author": "ag",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Four Stars",
      "text": "While it's quite snuggly and warm, it isn't waterproof at all so can get quite soggy.",
      "rating": 4.0,
      "verified": true,
      "author": "Arbella",
      "helpful_votes": 2,
      "publication_date": 20160714
    },
    {
      "title": "Lifesaver!",
      "text": "Awesome sleeping bag!! Bought for a trip to the Andes and it was warm and comfortable. My very first time using it I was a snug little caterpillar and it packed right back up. Excellent value so glad I bought it",
      "rating": 5.0,
      "verified": true,
      "author": "FrequentShopper",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Awesome! That best bag I have ever had",
      "text": "Awesome! That best bag I have ever had! Super compact, super light, and super warm! It met all my expectations and more! The only thing is that you would feel the ground more firmly or hard, because it can get so compacted, but that's perfectly okay given its advantages.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo Cantu Calderon",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Superb value!",
      "text": "Awesome value. Light, compact, warm! Used for a winter camp in ND and stayed toasty warm at about 30 degrees outside.",
      "rating": 5.0,
      "verified": true,
      "author": "cargeek",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Great for price",
      "text": "So soft - Drys terrible when wet but it's 800 down. Warm, comfy What's there not to like?",
      "rating": 5.0,
      "verified": true,
      "author": "aimology",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "It has plenty of fill and fluffs up nicely. The zipper is not bad",
      "text": "Considering the cost of this bag, the quality far surpassed my expectations. I've used it twice already in about 50 degree weather and it's too hot! It has plenty of fill and fluffs up nicely. The zipper is not bad, but could be a little more heavy duty. Other than that, I'm thoroughly satisfied with this product. Almost as equal as some of the higher dollar bags. You won't be disappointed.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Like sleeping in a warm fluffy cloud!",
      "text": "I have recently used this sleeping bag in 30-40 degree temps and was pleasantly warm and toasty! Have yet to try it in colder temps but expect that it will perform well. I'm amazed at how much loft the bag regains after unpacking and giving it a few shakes. My only concern is the zipper feels a little cheap compared to the rest of the bag, but have not had any problems with it yet. Overall I have been satisfied with this bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "item",
      "text": "For the price...the best sleeping bag out there. Worked for the temps rated for and was very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "I like to sleep under the stars",
      "text": "Toasty Toasty Toasty Warm. I like to sleep under the stars, and I like light durable camping equipment with common sense design. OV's Summit 800 loft sleeping bag was all that and at a very affordable price. I look forward to many comfortable down wrapped nights under the stars in the OV Summit mummy bag. I also appreciated the extra long zipper, 2x as long as my other bag, a Kelty.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Used to climb Kings Peak 30 degrees",
      "text": "Kept me plenty warm wearing nothing and using thermarest air pad at about 30 degrees. Unzipped 2ft to keep a little cooler. First night did not use tent and woke up with lots of dew moisture on top of bag but did not seem to soak through. Dried out nicely in sun at base camp. Length was perfect for me at 5'7. 6 foot would be tight. I weigh 186 and it is a snug fit. For the price I give it five stars. Will see how it holds up after a few trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Royal J.",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Great product! Purchased the 0 degree bag and love ...",
      "text": "Great product! Purchased the 0 degree bag and love it. The price is UNBEATABLE for this kind of quality! I bought it for winter backpacking and have used it only twice but have really looked over the bag and noticed that its of good quality and Im confident it will last!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike R Jensen",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "000 ft 18 deg F - super warm and comfy when paired with an insulated inflatable ...",
      "text": "Tested it out camping at 11,000 ft 18 deg F - super warm and comfy when paired with an insulated inflatable Klymit sleeping pad. Fortunately was able to unzip near the foot pocket to cool off a little because it was too cold to unzip top and expose torso. Going to be great this elk season.",
      "rating": 5.0,
      "verified": true,
      "author": "PrimeCustomer",
      "helpful_votes": 0,
      "publication_date": 20160529
    },
    {
      "title": "Cramped and degree rating inaccurate",
      "text": "Got the 0 degree bag and tried it out in 30 degree weather. Froze. Also I'm a bigger guy, 5'10\" 250 lb. and had a hard time zipping myself into this bag. Very cramped but this is a common issue I have with sleeping bags",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20201021
    }
  ],
  "product_meta": {
    "title": "Outdoor Vitals Summit 0 15 30 Degree F 800+ Fill Power Starting Under 2lbs Ultralight Backpacking Mummy Down Sleeping Bag for Lightweight Hiking & Camping",
    "rating": 4.4,
    "feature_bullets": [
      "►REAL WARMTH: Summit sleeping bags are real world tested to be warm within 5 DegreeF of their rated temperature, making it warmer than industry standard “lower comfort ratings”and a more true temp rating!",
      "►ULTRALIGHT WEIGHT: Premium selected 800 fill power (IDFL tested) down fills the backpacking sleeping bag and holds the highest warmth to weight ratio of any insulation type. Our down and down processes have been updated and are outside certified, and significantly reduce down product odor. We wrap the down in a baffled (not sewn threw) ultralight 20 denier ripstop shell to complete the ultralight sleeping bag and prevent down loss!",
      "►WARMER FEET: We know warm feet are critical for a good night’s sleep so we removed some down from underneath your back (where it is compressed and not adding warmth) and moved it to your feet, giving you warmer feet in this light sleeping bag without extra weight!",
      "►PACK LESS: Not only does down have the highest weight to warmth ratio of any insulation, but it also is the most compressible insulation available! With the FREE compression bag we include, easily compress your down sleeping bag to fit in any pack or space without needing to buy it separate! After purchase, we send you resources to help loft, compress, & store your down sleeping bag for backpacking correctly!",
      "►WATER RESISTANT PROTECTION: We coat both our down and the shell fabric with a water resistant coating giving you the added piece of mind when the weather turns bad or condensation occurs that you’ll sleep warm and cozy!",
      "►LIFETIME WARRANTY: We work hard to test our gear through torture tests and only use top quality partners ranging from certified down, top shelf fabrics, and highly proven sewers! All this leads to us having the confidence to provide a lifetime warranty on your purchase. If there is a craftsmanship problem, we'll fix it!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "14 x 8 x 8 inches; 3 Pounds",
      "Date First Available": "April 8, 2019",
      "Manufacturer": "Outdoor Vitals",
      "ASIN": "B07QJD7GLX",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sleeping Bags",
      "Sports & Outdoors",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": 264.97
  }
}