{
  "website_summaries": [
    {
      "verdict": "With presets for brewing tea at ideal temperatures and an internal steep timer, the Mr. Coffee Tea Maker does more than merely boil water, but this is no fully automatic tea dream machine.",
      "pros": [
        "For just a little bit more than a basic electric kettle, the Mr. Coffee Tea Maker matches water temperature with specific types of tea and keeps tabs on steeping time",
        "The appliance is also compact occupying less kitchen counter space, and is artfully styled"
      ],
      "cons": [
        "The Mr. Coffee Tea Maker sometimes overshoots its target brewing temperature, and its lack of a display can be confusing",
        "The brewer isn't fully automatic and requires you to add and remove tea leaves by hand"
      ],
      "aspects": {
        "Performance": 7.0,
        "Design": 7.0,
        "Features": 7.0,
        "Maintenance": 6.0
      },
      "publication_date": 20151028,
      "rating": 6.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "PLEASE, PLEASE, DO NOT BUY THIS PRODUCT! ...",
      "text": "PLEASE, PLEASE, DO NOT BUY THIS PRODUCT!!!!! it is NOT stainless steel inside, and PLEASE do not get it from Amazon either, it is not the first time that people complain of receiving used items. About Mr. Coffee tea maker: it is dangerous to boil your water in pure metal, I just can NOT believe that they even had the gall to sell it at 120.00 dollars!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 25,
      "publication_date": 20180314
    },
    {
      "title": "Disappointed...",
      "text": "I was quite happy to receive my Hot Tea Maker after reading all of the wonderful reviews. It was very easy to set up, use & make lovely tea. I was careful to read & follow all cleaning directions to care for the carafe properly. After each use, it was rinsed and dried or air dried before retuning to the base. After less than 8 uses, there appeared a rust line on the interior of the carafe. I tried to clean it but after the next use, it was more distinct. Stainless steel should not be showing rust after use.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa-Marie Lane",
      "helpful_votes": 18,
      "publication_date": 20180125
    },
    {
      "title": "We are so happy with this purchase Good BYE expensive plastic k-cups",
      "text": "We are so happy with this purchase Good BYE expensive plastic k-cups, hello to healthy living and homemade organic tea. This makes wonderful tea and works great. It does not take very long to heat up; less than a minute. I am enjoying having a plastic free way to make organic healthy tea. There is some plastic parts but none that come in contact with our tea or water. Thank you Mr Coffee for making a safe plastic free tea maker. I wish more companies would listen to their costumer request for Healthy safe plastic free products.",
      "rating": 5.0,
      "verified": true,
      "author": "TK",
      "helpful_votes": 24,
      "publication_date": 20160525
    },
    {
      "title": "Disappointing...",
      "text": "The Mr. Coffee kettle disappointed right out of the box when it proved defective, failing to turn off. Amazon's great customer service was ready to replace it, however I didn't like the design enough to try another one. It is very bulky and obtrusive on the counter top. Instead I purchased the Molla Puro kettle and am very happy with both its much sleeker European look and very efficient operation.",
      "rating": 2.0,
      "verified": true,
      "author": "KitKat",
      "helpful_votes": 6,
      "publication_date": 20170724
    },
    {
      "title": "Couldn't Do Without My Mr. Coffee Tea Maker",
      "text": "Originally I purchased this for my daughter, a tea drinker. She loved it but so did I. I ended up keeping it for just boiling water (faster than my top of the stove tea kettle). So this is my second purchase, as her housewarming gift. My only complaint is that the price almost doubled since I bought the first one.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Ellie",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Disappointed!",
      "text": "Disappointed after the first use of this teapot! Scaling and rust appeared after the initial use.",
      "rating": 1.0,
      "verified": true,
      "author": "Dana Reese",
      "helpful_votes": 6,
      "publication_date": 20180404
    },
    {
      "title": "Lasted less than 6 months",
      "text": "I really loved it until unfortunately after less than 6 months of use it quit working 2 days ago.",
      "rating": 1.0,
      "verified": true,
      "author": "Terri King",
      "helpful_votes": 7,
      "publication_date": 20171126
    },
    {
      "title": "Stopped Working After 1 Month!",
      "text": "I requested a refund after my pot stopped turning on, 1 month after purchasing. I returned the package via FedEx in a pre-paid label sent by the manufacturer. I was sent an email stating that I will be mailed a check in the amount of $79.99. I paid $85.29 with the sales tax and they won't refund me for the entire amount!!! It's not the amount but the principle. I have never had tax withheld for an item that I was returning. Ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Just what I was looking for.",
      "text": "For years, is been looking for a nice tea kettle that keeps the tea hot. I love this. So easy to use and clean. It's also convenient for just boiling water. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lissa",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Fantastic. I drink tea throughout out the day and ...",
      "text": "Fantastic. I drink tea throughout out the day and love how easy it is to use and that it will keep warm for an hour after brewing! Remember to take the tea leaves out if you are keeping it on warm!",
      "rating": 5.0,
      "verified": true,
      "author": "ESK",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Great Tea Maker - Best One on the Market!",
      "text": "If you are a fine tea aficionado (like myself) then this is the tea steeper for you! If you are a standard run of the mill Lipton Tea drinker (not there is anything wrong with that) this would probably be a waste of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Tea Drinker's Teakettle",
      "text": "If you don't know what to get the tea drinker in your life, this is it. My son was tickled pink with this tea kettle's operations and functions. It's an added benefit that he's on his own with room-mates, and this tea kettle operates on the dresser or side table, just as well as the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Durable and long lasting",
      "text": "This has lasted me a year and a half with no problems. I just dropped the glass part on the floor and it broke, so I don't know how much longer it would have lasted me. And yes, small appliances like this SHOULD last many years, but they often break right around the year mark. I've been very happy with it for making loose leaf tea.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Godlewski",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Love this.",
      "text": "I was gifted one. I gifted one. I bought another for myself. The different temps are great for different beverage requirements. Quick easy way to get hot water for oatmeal too.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Dicienzo",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "So simple",
      "text": "Idiot proof tea every time. Simple just pick your tea type and within a few minutes proper brewed fresh tea.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff w",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Nice quality",
      "text": "Extremely high quality tea maker. My only complaint is that it doesn't do well with low volume brewing. Needs to be at least 4 cups.",
      "rating": 4.0,
      "verified": true,
      "author": "PRC",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Doesn't last",
      "text": "I bought this less than 2 years ago and it no longer works. My husband and I have both contacted the company and heard nothing after more than a week. Really disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Hot Tea Kettle",
      "text": "I have used many contraptions for making my herbal blends, this takes the cake! What a great, great appliance.",
      "rating": 5.0,
      "verified": true,
      "author": "Brigit Haucke",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Bad",
      "text": "Something is wrong with it I can not touch it it shocks me",
      "rating": 1.0,
      "verified": true,
      "author": "Pepper Marley",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "... been using it for about 6 months and I love it.",
      "text": "I've been using it for about 6 months and I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 2,
      "publication_date": 20160705
    },
    {
      "title": "fantastic tea kettle",
      "text": "This is the best little pot for fixing the perfect cup of tea, it's more than I had expected. A great value if you are a tea lover.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy dee O'Brien",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great product",
      "text": "Best purchase for tea kettle! Love love love this. Easy to use, clean and convenient!",
      "rating": 5.0,
      "verified": true,
      "author": "Apson",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Great inspite of the rain...",
      "text": "My Mr Coffee hot tea pot is great! Luckily...The delivery person placed it outside in the rain next to my garage even though I have a covered porch across the entire front of my house! Thank goodness I came home early that day or my Mr Coffee Hot tea pot might not have survived! Whew!",
      "rating": 4.0,
      "verified": true,
      "author": "Donna King",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Five Stars",
      "text": "I really like the way this works, It is quick and easy and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "No plastic!  Great quality!",
      "text": "I've been using our new kettle almost everyday. I was in search of a tea kettle that had limited plastic, this product won! There's a rubber ring on the top lid, which is the only area non glass or stainless steel.. A very attractive and easy to care for product. I also like the rubber feet/knows on the bottom of pot, no slipping on surfaces. The only plastic is under the heating element unit and handle. The buttons are even stainless steel! Nice smooth and sleek feel. Both measuring units of ml and cups are printed on side of the handle. This would be a perfect gift for any loose leaf/bag tea lover!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20160203
    },
    {
      "title": "Very light and good stuff",
      "text": "A bit surprised the kettle is pretty light. And easy to operate",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "great water heater",
      "text": "easy to use. heats up water fast. easy to clean. keeps water at the right temperature. takes up very little space. Absolutely no negatives.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Four Stars",
      "text": "Love it wonderful for tea lovers and steeping your tea",
      "rating": 4.0,
      "verified": true,
      "author": "Regina Howard",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Love the pot",
      "text": "The pot holds condensation and a rim of rust around the top has started to form. Love the pot, can't keep it dry enough",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170103
    },
    {
      "title": "Using it to make tea and coffee",
      "text": "Works perfectly! Also removed the Keurig from the counter top and use this as a kettle for making instant coffee.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Schulte",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "There *is* plastic",
      "text": "There IS plastic in this boiler. Look on the bottom, there is a silicone ring around what seems to be the thermostat then again around the metal base which connects to the glass. Other than that it is great.",
      "rating": 3.0,
      "verified": true,
      "author": "albert88",
      "helpful_votes": 4,
      "publication_date": 20160302
    },
    {
      "title": "Two Stars",
      "text": "pouring with the lid on spatters water all over the place I've had this product less than a year and the inside is rusted",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryl Duerr",
      "helpful_votes": 10,
      "publication_date": 20160601
    },
    {
      "title": "Great all around, love the stainless parts. Two minor complaints",
      "text": "Great all around, love the stainless parts. Two complaints: So much beeping, honest to god. This thing makes too much noise. I miss my old tea kettle that had the gentle 'click' The lid is completely separate from base. On old kettle just lift lid, fill and done. With this lid I have to set it down on counter and put back on.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric K",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "Makes my Hibiscus Tea in a Snap!  Love it.",
      "text": "I am currently enjoying a wonderful glass of hibiscus iced tea. I have been wanting one of these forever and wish I hadn't waited so long. I use loose tea and this tea maker is so easy to use. Made exactly the strength I wanted really quickly. I will be using this every day for my hot and iced teas.",
      "rating": 5.0,
      "verified": true,
      "author": "KFISH7800",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Beware !!!",
      "text": "Worked for about a year and then started to boil tea after brewing cycle was completed. Very dangerous !!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Bobby",
      "helpful_votes": 8,
      "publication_date": 20170126
    },
    {
      "title": "Great kettle!",
      "text": "Love that this kettle has different temperatures. We use this for pour over coffee, tea, and boiling eggs quickly. Also one of the few kettles without plastic touching the water. Have been using it for three months now with no complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 2,
      "publication_date": 20170812
    },
    {
      "title": "Perfect for Tea Lovers!!!",
      "text": "Awesome Electric Hot tea kettle! It quickly heats up the water and keeps it hot and waiting on me. It has a brew basket insert option to make tea right in the pot. My favorite feature is the preset options for brewing tea at different temperatures depending on the type of tea. Also, I love that the carafe is glass and that the bottom of the pot is not hot once lifted off the heating stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Gram",
      "helpful_votes": 3,
      "publication_date": 20160527
    },
    {
      "title": "Brings out the subtle flavors and scents, Great Products",
      "text": "Quick, and makes any tea have the subtle flavors and scent. Easy to blend teas and add fruit. Eady clean. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Donnelly",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "5 stars down to 2 stars.",
      "text": "I initially gave this product a 5 star review, I love this product, but, after only 7 months of use it has quit working. I'm very disappointed. For whatever reason it started working again, it didn't work for 2 days.",
      "rating": 3.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Used it for two days and liked it a lot",
      "text": "Used it for two days and liked it a lot, EXCEPT the inside bottom of the Kettle (supposed to be Stainless steel) is already stained and has brown spots. Returning for a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "You have to press the same button multiple times to ...",
      "text": "You have to press the same button multiple times to get through the boil-steep-warm sequence..beep when steeping is completed. Both the Breville and MC will keep the tea warm for an hour. very expensive for this product .",
      "rating": 2.0,
      "verified": true,
      "author": "Rami-Dorlido",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "This is the one!",
      "text": "This is a great tea maker! I really like it. It's really fast and has a small footprint on the counter as well. We use it all the time. My daughter's fiance prefers tea over coffee and this is a great solution for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Scrapper Mom",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Five Stars",
      "text": "love this tea pot! It you owned a bottle brush the steeper is easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Suzan A. Thompson",
      "helpful_votes": 4,
      "publication_date": 20160329
    },
    {
      "title": "Great tea maker!",
      "text": "The tea infuser is just the right thing for brewing tea.",
      "rating": 4.0,
      "verified": true,
      "author": "sassygirl233",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Well done",
      "text": "Well made product. But found better price in Walmart. This is life.",
      "rating": 5.0,
      "verified": true,
      "author": "Lutin Emeric",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "the first one is DOA, so i receive a ...",
      "text": "the first one is DOA, so i receive a replacement, works well, use it daily now at my office.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul H.",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Buy one!",
      "text": "I love this thing! It brews tea perfectly and QUICKLY",
      "rating": 5.0,
      "verified": true,
      "author": "aprilb",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Coffee is a very nice equipment. It makes perfect teas and coffees in ...",
      "text": "Mr. Coffee is a very nice equipment. It makes perfect teas and coffees in a short period of time. Definitely a must have. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Mahwish",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "Great tea maker!",
      "text": "This pot is excellent! Change the way I drink tea in a good way. Very convenient to use.",
      "rating": 5.0,
      "verified": true,
      "author": "TY",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Five Stars",
      "text": "Great way to easily brew tea at the right temp.",
      "rating": 5.0,
      "verified": true,
      "author": "MichelleGriffith27",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "I ordered this tea maker, I used it once ...",
      "text": "I ordered this tea maker, I used it once after that It doesn't work anymore. what happened, the first time when I made the tea everything went well, the other day when I tried to make tea again, It doesn't work anymore the light just on for one second and goes off with a sound. I tried, nothing. Every when I see the tea maker on the table, I regret to have spent my money on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua A.",
      "helpful_votes": 4,
      "publication_date": 20160924
    },
    {
      "title": "Mr. Coffee Makes Tea Right",
      "text": "As a Breville fan I was extremely hesitant to find this tea making alternative but It's been a hit this Christmas. The lights are multi-colored and the materials of brushed metal and glass make it every bit as nice as it's competition for twice the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Ink Vine",
      "helpful_votes": 2,
      "publication_date": 20170110
    },
    {
      "title": "Good Tea Maker",
      "text": "I works just fine. I have had three different Breville tea makers and got tired of replacing them every time a guest put them in the sink in water and shorted them out. I decided to try a cheaper version. This tea maker works fine. I think the tea is good but I don't like the rim around the top. It traps tea and debris and is hard to clean. I wish the entire top came off for cleaning. Other than that, I am happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie S.",
      "helpful_votes": 2,
      "publication_date": 20170409
    },
    {
      "title": "Great teapot",
      "text": "Hand down it is worth every dollar I spent! Easy to use and males a great cup of tea or a big pot of tea! I've been looking at teapots for some time now and really didn't want to spend 250 foe the other brands. I'm so thankful I went with Mr. Coffee teapot!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sid & Robin",
      "helpful_votes": 3,
      "publication_date": 20160219
    }
  ],
  "product_meta": {
    "title": "Mr. Coffee BVMC-HTKSS200 Hot Tea Maker and Kettle, Stainless Steel, 1",
    "description": "Color:Stainless SteelMr. Coffee's Hot Tea Maker and Kettle is a must-have for tea lovers who want to enjoy the ultimate at-home steeping experience using loose tea leaves or tea bags. Add fruits and other additions to create sumptuous, custom tea infusions—or use it to boil water for instant beverages and meals.",
    "rating": 4.3,
    "feature_bullets": [
      "1.2 liter capacity with water level indicator up to 5 cups",
      "Preset selections for steeping different types of tea: black, herbal, oolong, white, and green tea",
      "Convenient \"Boil\" and \"Keep Warm\" controls",
      "Includes stainless steel kettle with premium quality SCHOTT DURAN glass",
      "Stainless steel tea infuser is removable and dishwasher safe"
    ],
    "specifications": {
      "Product Dimensions": "8.65 x 12.1 x 11.2 inches",
      "Item Weight": "4.09 pounds",
      "Manufacturer": "Mr. Coffee",
      "ASIN": "B0173EMLW0",
      "Item model number": "BVMC-HTKSS200",
      "Customer Reviews": "4.3 out of 5 stars125 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#297,417 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 23, 2015"
    },
    "categories": [
      "Home & Kitchen",
      "Kettles & Tea Machines",
      "Coffee, Tea & Espresso",
      "Kitchen & Dining"
    ],
    "price": 69.99
  }
}