{
  "website_summaries": [
    {
      "verdict": "An overall excellent barrel that comes in several sizes and can be customized.",
      "pros": [
        "Comes in several sizes, from 1 liter to 5 liters",
        "Handcrafted from American white oak, with a medium toast char on the inside to enhance aging",
        "Add your text to personalize it",
        "Nice craftsmanship",
        "Most report that this option doesn't leak",
        "Good gift idea"
      ],
      "cons": [
        "Some point to quality issues with this barrel that include poor engraving, faulty plug gaskets, and overall leaking problems"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Had a massive leak! Totally ruined my Father’s Day gift",
      "text": "I am so bummed out about this!! I gave it as a fathers day gift to my husband, who LOVED it and was super excited to fill it up.... and then it leaked EVERYWHERE. So incredibly disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "pinkcadillac",
      "helpful_votes": 22,
      "publication_date": 20180617
    },
    {
      "title": "So good. When I placed my order I was told ...",
      "text": "So good. When I placed my order I was told a week to ten days for delivery. Got it in 2 days! The engraving was perfect, the water soak completely sealed the barrel in a few hours. I let it soak for a week anyway (4 to 5 day minimum recommended), then drained the water. Water came out tinted by the oak with a beautiful oak bouquet. I filled this 3 liter barrel with Makers Mark Whisky on the 19th of April. Can't wait to taste the barrel aged result (giving it a month to age). I am buying another one for red wine. Awesome company, awesome product!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim OB",
      "helpful_votes": 6,
      "publication_date": 20180430
    },
    {
      "title": "Love at first sight",
      "text": "I ordered the 10 liter, customized for my son-in-law's birthday/house -warming. Poor packaging resulted in minor damage which I was able to repair. Seasoned it per seller instructions, filled it up with Costco scotch (all I could afford), and not a drop of anything leaked. Upon delivery, my recipient's eyes slammed open and he went bonkers...it was love at first sight ! Said it's the best gift he ever received and kept caressing it and tasting the scotch. Gotta call over there and see if he ever went back to work... Note that I rated this item 5 stars despite the packaging problem (which I discussed with the vendor by phone). The product is just THAT GOOD !",
      "rating": 5.0,
      "verified": true,
      "author": "brainsalad",
      "helpful_votes": 2,
      "publication_date": 20180801
    },
    {
      "title": "Great Gift",
      "text": "This is a Christmas gift, I opened the package to make sure it was done correctly. I was pleasantly surprised not only was it done correctly but was beautiful and it came so quickly. The only disappointment and it is my fault is the size was smaller than I had expected it to be. The ad stated the size I just imaged it to be larger, this is not the seller fault. It is a great gift and I am sure it will be well received.",
      "rating": 5.0,
      "verified": true,
      "author": "Suni",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Used this for my wedding and it was awesome! Everyone raved",
      "text": "It arrived SUPER fast, I couldn't even believe it. I cured it for a week but the spout kept leaking. I contacted the company and they shipped me 2 replacements super quick. I soaked those before malleting them in and that worked perfectly. I had no leaks anywhere else. Put some bourbon in and let it sit for about 6 weeks. We served it in the cigar tent at our wedding and it was a HUGE hit! I believe that might have been the only alcohol we ran out of during our wedding. My fiance (now husband) was delighted!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela_GTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Good communication",
      "text": "Let me preface this by stating that initially I had an issue. So for any of you who purchase and run in to any problems or have any issues, this review is a must read. I jumped the gun and left a bad review at first, but quickly found that a little better communication on my part would have solved the problem. The owner actually took the time to reach out to me and we exchanged a few emails and my problem was dealt with. Now on to curing the barrel and aging some spirits.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff T.",
      "helpful_votes": 2,
      "publication_date": 20180622
    },
    {
      "title": "Great Barrel",
      "text": "It took a long time to get the barrel so it properly sealed and didn't leak. I finally boiled water and poured it in and that seemed to help. I aged Manhattans in here and they turned out great. The spout, like all spouts like this only worked for a short while. My wife thought having our names on the barrel was great. This would make a great gift idea.",
      "rating": 4.0,
      "verified": true,
      "author": "D. F. Smith",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Aging as we speak",
      "text": "I received the beautifully engraved barrel a week ago and just started my first batch of unaged whiskey. I cured it with hot water and let it sit for two days, had a small leak which sealed right away with expansion. I didn't realize the barrel had a clear finish to it. I like the look of it and it will keep the wood looking nice longer. My other barrel is all natural and is showing some dark coloring in the wood, it's all about preference. Happy with my purchase so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Live in WA",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Seemed awesome at first but leaks whiskey!",
      "text": "I am sorry to report that while the big leaks sealed in 4 hours I found a small leak on the very bottom under the front band. I had noticed the stand was stained and when I flipped the barrel over I found a very soft, wet spot. I have had to revise my score from 5 to 1 because I won't be able to use it. The worst part is that I am losing the whiskey I put in two days ago to age.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Metz",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Unity Ceremony Barrel",
      "text": "We purchased this custom barrel for our unity ceremony at our wedding to do a whiskey pour & whiskey mixing. It was SUCH a fun idea and we got a million compliments. We've been aging this barrel a few months, and taking small samples and it seems to be holding up well. No issues with leaking after we sealed it and it doesn't seem like much has evaporated out. Overall, it was a really fun and customized purchase that we are very satisfied with.",
      "rating": 5.0,
      "verified": true,
      "author": "MMK",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Definitely Ages Booze....Good/Not So Good Depending on Your Tastes",
      "text": "Made Manhattans in this and stored it for a year, and presented it to someone as a gift. What came out was definitly nicely aged and drinkable...but not quite to my taste, but that is just me. A bit too smokey for me. I might try this again with another drink, but I would not hesitate to recomend this as a unique gift for someone who appreciates spirits.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "It's Perfect!",
      "text": "I'm so happy that we choose this as our unity ceremony! It's perfect, very different from the traditional sand, candle etc types of unity ceremony. Our friends loved it too cause it is so unique and personalized. I didn't have any issues with leaking during the curing time. We intend on having the first aged tasting during our 1 year anniversary. FYI, we put Jameson as choice of aging.",
      "rating": 5.0,
      "verified": true,
      "author": "Pompom",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "and also likes working on little projects like his little herb garden which he uses in making ...",
      "text": "I bought this as a gift for my friend's 70th birthday. He enjoys his whiskey and scotch, and also likes working on little projects like his little herb garden which he uses in making awesome dishes. This seemed like the perfect gift that would be both functional and fun for him. I was right, because he was totally thrilled!! His eyes lit up like a kid who scored a new PlayStation. He is currently aging a bottle of scotch and we can't wait to try it. Needless to say I got plenty of cool points for that one!",
      "rating": 5.0,
      "verified": true,
      "author": "M. ITO",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "High Quality",
      "text": "The quality of the barrel construction is excellent with no flaws or leaks. Just make sure you follow the break in directions. The custom personalized etching was right on. I was impressed with the easy to follow directions for break in and maintenance. I have ordered two as gifts and will be ordering another. I purchased an aging barrel at the Reno Rodeo which was high quality and MORE EXPENSIVE. I will also purchase one from this company for myself in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Grizzman",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Great gift",
      "text": "Bought this for my husband and he loved it. For the size of the barrel, the whiskey doesn’t last long enough in our house to turn into anything special. But it looks cool. The spigot broke almost immediately and the seller was incredibly responsive. They had a new one shipped out right away. Great customer service!",
      "rating": 4.0,
      "verified": true,
      "author": "CA Mama",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Fantastic Product",
      "text": "It is just as I had imagined and wanted. The price is great. I followed the instructions of curing it for 5 days and then poured in whisky. Lovely product. I can't say anything about durability yet, as I just got it a week back. But I am hoping it will last long. I strongly recommend for people who like the wooden barrel taste and also for an embellishment to their bar. Makes a great conversation piece too.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Second chances",
      "text": "I preveiolsly wrote a review about the barrel that was less than flattering. The company reached out to me and addressed my issues. I can tell you that I am more than pleased with the customer service and product support than I have ever been with any other company. In today's culture of instant gratification we have gotten a bit spoiled. We need to recognize that not all products are going to be 100% perfect the first time. But what sets this company apart is that there attention to the customer is 100% perfect. I will be buying more for gifts this Christmas and so should you. Stay thirsty my friends and drink responsibly.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Eure",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Great gift!",
      "text": "This was a great gift for my whiskey loving boss! It looks exactly as I imagined and it had arrived only 6 days after I purchased it! The look on my boss’ face when he received it was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Synthia N",
      "helpful_votes": 2,
      "publication_date": 20181217
    },
    {
      "title": "Great Gift Idea /Solid Product /customized whisky barrel",
      "text": "The Barrel was for my infant son. I'm gonna age the whiskey that we were drinking 9 months ago ;) Suntory Whiskey. And when my son is of age we will all enjoy it together. The barrel arrived post haste, the look is stunning (quite the conversation starter) and we are prepping it for the next few days as per the instructions. Highly recommend this for groomsmen gifts or a liquor lover in your network. I would buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "The product is amazing. The barrel was made with great quality and ...",
      "text": "The product is amazing. The barrel was made with great quality and looks fantastic. I am floored with how the barrel looks; I’m very pleased. The stand to place the barrel on was a little too brittle for the mailing/portal travel and broke. However, glue fixed the problem",
      "rating": 4.0,
      "verified": true,
      "author": "Benny",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Great gift. Very nice whiskey barrel",
      "text": "Great gift. Works great. Beautiful barrel and personalization. We followed the directions and have not had any trouble with it leaking. My husband has enjoyed adding the spirits and making his own flavors",
      "rating": 5.0,
      "verified": true,
      "author": "carol mcneely",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Don't hesitate, these people are old timey true craftsmen",
      "text": "This came faster than we thought it would. It is exactly how we ordered it. Explicit usage instructions that are well laid out, on postcard sized paper in full color. We put limited edition Kraken coffee inside. Will update flavor when it has aged.",
      "rating": 5.0,
      "verified": true,
      "author": "The Redneck",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Excellent gift",
      "text": "This was a Christmas gift for a family member. He was surprised by it and was very pleased. He kept picking it up and looking at it. He had been using regular glass bottles to age his brew. Now he has a personalized oak keg. I'm very happy with gifting this product.",
      "rating": 5.0,
      "verified": true,
      "author": "L Beebe",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "PERFECT!",
      "text": "I was a little hesitant to order due to a few negative reviews about leakage, but decided to take a chance for the perfect Father's Day gift. Did I say perfect? Yes! Husband loved it. Order arrived on time & engraved correctly. Had very little leakage around spout on day #1 when first adding water to seal, but nothing since. Definitely would recommend for the whiskey drinker in your circle of friends or family.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Absolutely Awesome!",
      "text": "What a great gift! My kids absolutely loved it! So cute and the personalization was a huge hit! Highly recommend for a fun gift for the couple who has just about everything! Five Stars and two thumbs way-way up!!! Thanks for a great Christmas gift!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rupert T",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Sadly leaking after a few months",
      "text": "Very sad to write a negative review because my husband loved this gift but after a few months of use it has started leaking. Hoping the seller will contact me with a way to fix it?!?!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180413
    },
    {
      "title": "I feel professional now lol",
      "text": "So, if you do not follow instructions you could see some issues. We followed it and LOVE IT! We have started moonshine in ours and within a week it has really changed and more smooth. The barrel gives a wonderful flavor. We really want to purchase more! Also the engraving was the perfect touch with no flaws! It shippined a day after purchase and arrived on time :)",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Bright",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Looks great, but leaks",
      "text": "The barrel itself looks great, smells great, but it seems like there is a defect in the bottom that's causing a leak. My husband treated the barrel for over a week and as we thought the leak stopped and put whiskey in it, it started leaking all over again",
      "rating": 3.0,
      "verified": true,
      "author": "Galina",
      "helpful_votes": 3,
      "publication_date": 20170110
    },
    {
      "title": "Amazing Customer Service",
      "text": "Ordered one for myself and found it to be very cool so ordered as gifts for family for Christmas present. Can't provide a review on finished result as the first batch is in a aging but so far no leaks in the barrel when curing so anxious to try on Christmas day! Received the gift order with a misspelling my error but they were quick to reolve and shopped anew one ASAP amazing customer service! Will be buying more of these.",
      "rating": 5.0,
      "verified": true,
      "author": "MVT",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "It makes a great gift for someone,looks great on my bar!!!!",
      "text": "I read the instructions and filled it with water,it took 3 days to stop leaking. I then filled it with bourbon and am extremely happy with this product!! I haven't tasted it yet,but am super excited to see how the barrel changes the flavor of the Bulleit Bourbon I put in it!!! It holds alot more than I thought it would, I use a full 1.75 liter bottle and it took 2/3 of a 750 ml bottle I had as back up!! Thanks again!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Robinson",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Super fast processing, shipping, and delivery!",
      "text": "I’m extremely satisfied with my purchase experience of this product. I ordered 2 barrels, hours apart and they both shipped THE SAME DAY that I ordered them!! They arrived a day ahead of the estimated delivery date, and were perfect! The personalization was amazing, they were packaged well to prevent damage. I bought them as Christmas gifts so I can’t speak for How they work yet, but customer service was outstanding!!",
      "rating": 4.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Very happy. Super high quality.",
      "text": "Very happy with this purchase. The customizing turned out perfect on both barrels. The quality, attention to detail, and craftsmanship of these barrels is of the highest standards. The price was very reasonable for the quality of these barrels, and the shipping was quicker than promised!",
      "rating": 5.0,
      "verified": true,
      "author": "Rex Bluetarski",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Great Gift",
      "text": "Was a gift and the person receiving it was over the moon. They have set it up and are now working on their first batch.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Husband is having so much fun!",
      "text": "Our little oak barrel arrived in good time and is super cute! That said, it also seems to be working really well. We followed the directions to fill with water for 3 days and it it leaked a bit the first day, then sealed tight. My husband is the whiskey drinker in the family and he is quite tickled with it. He's filled it with his everyday inexpensive whiskey and says the flavor is changing and improving even during the first week. -- Thanks for a great gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "I really love the barrel it's awesome the inscriptions are great but ...",
      "text": "I really love the barrel it's awesome the inscriptions are great but I can't get it to still up after 7 days. I will try it for the rest of the days for the 10-day. That they ask you to try but I don't think it's going to work cuz it has a crack in it. So I can't really ride an honest review until I get a hold of the company and see if they will make it right or tell me how to fix it.",
      "rating": 5.0,
      "verified": true,
      "author": "darron arnold",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Good Quality, very very presentable",
      "text": "I did my research before purchasing, with an expectation of not being able to cure perfectly. However, the barrow cured within the first 12 hours. I replaced water with whiskey on the second day. The seller also stated in the order that they will ship a replacement if barrel does not cure after 10 days. The barrel arrived two days after ordering. Engraved letters are firm and done with good quality. One small patch of the barrel is not sanded well, but I personally like that. Overall, very presentable as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Prinsy",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Great gift",
      "text": "We bought this as a gift, the person loved it. I’d say though they need to get the lettering a little better on the bottom, it was very faded only reason I did not give 5stars but still readable.",
      "rating": 4.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Great barrel. Doesn't leak",
      "text": "I bought this barrel to age moonshine and its getting some good color and flavor. Barrel did not leak at all when I recieved it. My only complaint is the wood shavings and splinters inside. Make sure you rinse well before use.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "He loved the overall look",
      "text": "I gave this to my Irish Whiskey Drinking brother in law. He is curing it as I write. He loved the overall look, and feel of it and easy instructions. I hope his whiskey goes up 10 fold. If not, it is still a great conversation starter!",
      "rating": 5.0,
      "verified": true,
      "author": "Kstorm",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "A gift for someone who likes whiskey.",
      "text": "Bought this as a gift for a youtuber who likes his whiskey. I havnt heard him say anything about it but from what I saw I the unboxing video, it looked nice. Hope you like it Gundam!",
      "rating": 5.0,
      "verified": true,
      "author": "enclave_strong",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "The Best Gift for the Whiskey Drinker",
      "text": "My Husband loves his personalized Whiskey Barrell. It sits on our bar full of Bullet and it has given it a nice flavor. Some people complain of it leaking however, you need to let the wood soak and expand first...read the directions!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Great",
      "text": "Got this for my dad for Father’s Day. Made his day. Super cute and fun. Very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "chera' wilson",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "LOVE!",
      "text": "Used this barrel for our whiskey unity ceremony at our wedding! It looked so great! We combined two whiskey's and after 2 months we added them to a decanter and will have a glass on our first year anniversary. Great quality and received it very quickly. Instructions were clear. The paper funnel was the only thing I can complain about. It didn't work at all, but that's seriously grasping at straws. I just used a small funnel we already had.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie Owens",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "A barrel of perfection.",
      "text": "This barrel was the perfect birthday gift for my fiance. He loves it. It is beautiful, sealed nicely, and adds a fine touch to our home. I am very satisfied with this purchase, and will be making more purchases from this company in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon ",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Perfect",
      "text": "Too cool! I've only had it a few hours and already i can tell the curing is going great. Looks very cool and I can't wait to get some bourbon in it. Going to get a second one, as once this one has had Michter's in it for a few months, it'll be ready for scotch.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Looks great, no leaks, few personal dislikes",
      "text": "Lost a star for the ugly stand. There was some large chucks of the barrel in there due to when the hole was drilled. To big to be removed. I'm sure they would be ok with replaceing it but I didn't bother. It will still work. No leaks at all when filled to start the curing process.",
      "rating": 4.0,
      "verified": true,
      "author": "Timbotron",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Won’t stop leaking",
      "text": "It leaks like crazy. I followed the instructions perfectly. Filled it daily with water for 10-day. Figured the sugar would slow it down or stop it but it’s now leaking worse. I’m running Amaretto and cognac in it.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael R.",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Makes an awesome gift!!",
      "text": "The product was smaller than expected but held 2 liters. It looks so cool! The custom engraving turned out wonderfully. My boyfriend absolutely loves it. Minor leaking during curing process but that’s supposed to happen I think. And we haven’t noticed any issues with the whiskey in there yet. Can’t wait to taste it! So happy with this purchase!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrey",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Looks awesome!",
      "text": "We have not used our Barrel yet but it arrived so fast and looks great! We are using it for out unity ceremony at our wedding with moonshine. We love how this will add something extra and unique to our ceremony! Haven't used it yet so I can't comment on leaks or anything but the craftsmanship and look is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Shania",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "👍🏻👍🏻",
      "text": "I’ve had whiskey in it for over a year now. Tastes better and better",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Cearfoss Jr",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Great looking product. Did buy again, and will tell others about.",
      "text": "This is my first time trying out a small batch to age whisky. I have not tried the spirits yet, as it is still needs to sit a while. I have a bottle the exact same whisky that I am not aging to compare. I was so impressed with the 1 liter so much, I went ahead a purchased a 2 liter for aging a 12 year old single malt I normally enjoy. It did only take about 3 days to cure barrel and stop any leaks, I left it cure an additional 2 days before filling. I am excited to try this with some good friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodger Pomahac",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Way better than expected!!!",
      "text": "I bought the barrel as a Christmas present. I am pleasantly surprised by the craftsmanship of the barrel. Looks Awesome!! Just might keep it for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Philip Lis",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Bought as a gift",
      "text": "This was purchased as a gift so I really can't say how everything is. I guess we'll let you know at a later date. The graphics are well done. It looks very nicely done. It is a very nice gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis Baker",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great product",
      "text": "Looks beautiful, arrived quickly, I'm excited to taste my first batch of aged Manhattan's.",
      "rating": 5.0,
      "verified": true,
      "author": "margiemic",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "the writing is nicely done and I love that it does not look ...",
      "text": "I purchased this for my whiskey loving fiancé for Christmas. After searching for a barrel for a couple of days, I decided to purchase this one due to the reviews. I received the package 2 days ago and was content with the packaging. As to the barrel, the writing is nicely done and I love that it does not look cheap! It is a bit smaller than I thought it would be and I purchased the 3 liter.",
      "rating": 5.0,
      "verified": true,
      "author": "Lenchita",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Perfect gift!",
      "text": "This is the second we order. The first I had it personalized for my husband which we have been enjoying the best barrel Manhattans.",
      "rating": 5.0,
      "verified": true,
      "author": "PTdoc",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "PRODUCT EXCELLENT, EVEN BETTER IN PERSON! SELLER'S VERY HONEST & GOOD COMMUNICATOR!",
      "text": "10 OUT OF 5 STARS!!! They did a GREAT JOB on the barrel! It looks even way better in person! So creative and they really followed through with our request and made it even better! Shipped secured and quick, too! They had instructions inside the box, as well. Seller's communication pre and post payment is EXCELLENT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaite Katie",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Great product!",
      "text": "I gifted this to my dad for Christmas and he absolutely loves it! The engraving came out wonderfully and looks so natural on the barrel. He has used it several times and he says it only gets better. He has even used a cheaper whiskey and he says it comes out perfectly. Great product and a great gift! Update: Two years later, my dad still loves this product and still uses it. It has held up great!",
      "rating": 5.0,
      "verified": true,
      "author": "Katlynd R. ",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "these are really cool for the bourbon drinker in the family.",
      "text": "these are really cool for the bourbon drinker in the family.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert T Terry",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Beautiful",
      "text": "Beautiful and functional. We had a messed up order at first, but the seller was super helpful and friendly. They got it fixed right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie, Kristen & co.",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Good looking barrel, now for the waiting...",
      "text": "I purchased the one liter, but if this works I might be getting a larger one. It looks great and the engraving is a really nice touch. I soaked it for 5 days and after the first few days it stopped leaking, so it's sealed up nicely. I've filled it with my Manhattan recipe so I'm now waiting until my aged Manhattans will be ready.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Jones",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Good product,  I would buy it again.",
      "text": "The product is of good quality. It was a retirement gift and the employee loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "Big",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Impressed so far! Fast shipment too",
      "text": "Haven’t cured this barrel yet, as it is a anniversary gift for my husband next week. But it arrived in beautiful condition with excellent personal engraving. My husbands in the whiskey business so having a barrel made from American white oak that was charred was so important. Can’t wait to try it out!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Carpenter",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Would definitely order from Oak Barrel again.",
      "text": "Barrel arrived ahead of schedule. Good, quality workmanship. Filled as requested with no leaks. Started using the barrel that same day. Looking forward to my first test run.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Fischer",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Couldn’t have been better!",
      "text": "Perfect gift for father in law! Well made. Fine details. Quality product for sure. I looked at several and this had best reviews. Easy to see why. I am in no way compensated for my review.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Marks",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Quality barrel!",
      "text": "Nice product for adding oak flavor to a beverage. Followed setup/curing instructions and had no issues with leaking. So far so good! Will follow up when craft cocktail aging is complete.",
      "rating": 5.0,
      "verified": true,
      "author": "VinoFan123",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "It is a great usable size in which to store cocktails",
      "text": "It is a great usable size in which to store cocktails. It leaked for the first 5 to 6 days of seasoning and then no leaks after that. The personalized message put on it is really cool. It can make a wonderful gift for other cocktail makers or those who want to age liquor in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sidney Buckman",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Great gift for dad",
      "text": "This was a perfect gift idea for my dad who loves a good bourbon or whiskey. The only suggestion would be more font choices. The standard font was good, don't get me wrong. But choices are nice. Otherwise the product itself is fantastic",
      "rating": 5.0,
      "verified": true,
      "author": "Ruby Red",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great barrel!",
      "text": "My barrel is beautiful! It leaked about 10 drops, when I first added water to seal it, and it never leaked another drop. The quality was great on the custom writing, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Monkey boy",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Leaking...",
      "text": "Leaking on the back ring.... cool little piece... but I have to keep a rag under it for the slow drip.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick Gaul",
      "helpful_votes": 3,
      "publication_date": 20180502
    },
    {
      "title": "Awesome!",
      "text": "Awesome product! Gifted to a friend and he loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "T Jones",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Anniversary Gift",
      "text": "Was perfect, my husband loved it and was great addition to his home bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "... as a gift for my stepfather and he absolutely loved it. The engraving was perfect and the cask ...",
      "text": "This was purchased as a gift for my stepfather and he absolutely loved it. The engraving was perfect and the cask is great quality with the right rustic look and feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Bierkamp",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "I was very pleased with this unit",
      "text": "I was very pleased with this unit. Everything was as described and worked just like it was advertised. Will get back to the taste of the spirits once I decide to crack open the spout. I will recommend this company as honest and prompt.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "This oak barrel is adorable and you get what is pictured",
      "text": "This oak barrel is adorable and you get what is pictured. The personalization is wonderful and a nice touch though seems to have been done in a rush. Shipping and delivery was extremely fast for a personalized item. The barrel does leak quite a bit but we just keep a dish towel or glass under the spout. Overall a nice purchase and I am pleased with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Liz S.",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Outstanding Customer Service and a Beautiful Product!",
      "text": "Love my 1 L. Oak Aging Barrel. It is an awesome addition to my bar. Most importantly American Oak Barrel's customer service was outstanding. They made a typo in the customization of my barrel and within days I received a new barrel with the correct name. They even told me I could keep the incorrect barrel so now I have 2! I am aging a Casamigos Reposado Tequila in one and a batch of Negronis in the other. Looking forward to tasting both in a few weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "David C. Rosenberg",
      "helpful_votes": 0,
      "publication_date": 20160318
    },
    {
      "title": "I like the product",
      "text": "I like the product. The stand was broken upon arrival, but I called American Oak Barrel and they sent out a replacement immediately. I was extremely pleased with the customer service and response.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Makes Black Velvet so smooth!",
      "text": "Bought this as a gift for my dad for his birthday. He loves it. The fact that it was customizable made it extra special!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "The shipping time was better than I expected",
      "text": "The shipping time was better than I expected. The barrel arrived in perfect conditions, the details were engraved without errors. I bought this product as a gift for my father-in-law, and he liked it a lot. I'm happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Great gift",
      "text": "Great gift for anyone but where is the stuff that it is in the picture to make the whiskey",
      "rating": 5.0,
      "verified": true,
      "author": "nielsy a.",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Lovely, but not as described",
      "text": "Beautiful, and my husband loves it. Only complaint is that it is NOT a 3 liter....it is a 2 liter. I contacted the company to clarify, and they were completely disinterested in the issue. Fun item, lousy customer service.",
      "rating": 4.0,
      "verified": true,
      "author": "norcal",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Looks good but leaks",
      "text": "The barrel itself is very cute and I hope the whiskey that is left if any after filling it gives me some good oak flavors. It is leaking slowly and I followed the instructions before adding the whiskey.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah Avery",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Love it",
      "text": "My father was so excited for this! This is a GREAT gift",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan W.",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "good birthday gift",
      "text": "Only just got the barrel, so I can't comment on its durability, or even how well it will age whiskey, but so far it seems like a great product. Fast and easy and affordable. Gave it to my brother as a birthday gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Ray",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Excellent quality and craftsmanship!",
      "text": "Barrell never leaked, not even on the first day. I still followed instructions just to be safe and ensure it cured properly. Don't know about the flavor yet because I want to let it sit for a while, but overall display and quality has surpassed my expectations!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Quick Delivery! Cute barrel. Will update once it's ...",
      "text": "Quick Delivery! Cute barrel. Will update once it's cured and We can try using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Great addition to my bar",
      "text": "Great looking product and doesn’t leak. Great addition to my bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Coach",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "high quality",
      "text": "This was perfect, did not leak or drip one drop during the 5 day curing, so easy to empty and fill I would highly recommend this for anyone looking to try this for the first time, now I want to do 10 more...",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Huber",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Customer Care and Quality",
      "text": "A great product that is well made. Add to this , reat customer communication throughout sell, customization and post arrival of item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "... person who received this as a gift was very happy with it",
      "text": "The person who received this as a gift was very happy with it. In fact he feels it will make him quite happy for years to come",
      "rating": 5.0,
      "verified": true,
      "author": "Linda C.",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Neat product!",
      "text": "Nice product, cured very quickly, but spout very poor and difficult to dispense. Need to tip the barrel and liquid comes out very slowly.",
      "rating": 4.0,
      "verified": true,
      "author": "Cme42thdk",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Nice quality and value",
      "text": "I have gotten 2 of these, both sealed up within 2 days. Engraving is nice. Nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Pierce",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Beauty and Function!",
      "text": "Fantastic product with even better customer service/support. I had a curing question and spoke directly with the owner. When I need another barrel, I will be buying from American Oak Barrel.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Was a gift for a friend and he absolutely loved it! It came quicker than expected and he ...",
      "text": "Was a gift for a friend and he absolutely loved it! It came quicker than expected and he couldn't stop showing it off lol",
      "rating": 5.0,
      "verified": true,
      "author": "Leka",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Thumbs Up!",
      "text": "Bought it for my husband and he thought this was great! The instructions are easy to follow and the whiskey has a good flavor too! Arrived on time.",
      "rating": 5.0,
      "verified": true,
      "author": "bon",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "It works as it should.",
      "text": "Great product. I had a small problem and they fixed it right away. It took a few days to stop leaking as they said it would, but now it’s working great. I can’t wait to try my whiskey blend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Perfect size, perfect customized look",
      "text": "Perfect size, perfect customized look... It did leak quite a bit at first (during the curing stage) but then it slowed. I called customer service and was reassured about that leaking was part of the process. They have great customer service. They stand behind their product.... Which is huge to me.",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "When l reached inner wall with my little finger it Was all black like charcoal. When we fill the Barrel with Wine ...",
      "text": "As l was cleaning and sensitizing the interior of the barrel lots of loose wood chips came out along with some black substances thank could not identify. When l reached inner wall with my little finger it Was all black like charcoal . When we fill the Barrel with Wine and taste it in time, l am hoping will be fine and not effected. I will be in touch.",
      "rating": 3.0,
      "verified": true,
      "author": "Mete' Yilmaz",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Great Gift Idea!",
      "text": "Got this for my son-in-law... perfect size for one bottle of whiskey and being able to have it personalized with his name made it extra special.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Alfonzo",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great service, product arrived on time. Good Job !!!",
      "text": "I bought this Whiskey Barrel for a B-Day present for a friend. Had it customized and it looked great. My friend was surprised and extremely happy. Can't go wrong with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Campbell",
      "helpful_votes": 0,
      "publication_date": 20190501
    }
  ],
  "product_meta": {
    "title": "Personalized American Oak Whiskey Aging Barrel (063) - Custom Engraved Barrel From Skeeter's Reserve Outlaw Gear - MADE BY American Oak Barrel - (Natural Oak, Black Hoops, 1 Liter)",
    "rating": 4.7,
    "feature_bullets": [
      "LASER ENGRAVED PERSONALIZATION - Beautifully engraved featuring your personal attributes in stunning detail | 2014 Barrel Aged Series - Design 063: Barrel Aged Whiskey | Popular gift selection for spirit enthusiasts",
      "AGE YOU OWN SPIRITS - Everything needed to transform inexpensive spirits to top shelf flavor in weeks, not years | Includes Customized, Handcrafted, Charred Oak Aging Barrel, Bung, Spigot, Aging Stand, Funnels, Storing Tablets, Instruction Card | Ideal for Bourbon, Whiskey, Scotch, Tequila, Rum, Brandy, Cognac, Liqueurs, Schnapps, Wine, Vinegar & Hot Sauce",
      "EASY TO USE - Simple instructions included to cure and enjoy your barrel for many years | Just pour your favorite store bought spirits into the barrel and age to your desired taste | This American oak aging barrel easily accommodates a fifth of spirit",
      "BONUS TIP FOR ADVENTURE SEEKERS - You can make your own spirits with this barrel too | Enjoy up to 70% savings crafting your own Whiskey | Upgrade this same custom engraved barrel to the Outlaw Kit | Paste the following helpful term in the above search window to see our available options: Outlaw Kit 063",
      "CERTIFIED GENUINE AMERICAN OAK BARREL PRODUCT - Buy With Confidence | Built, sold and serviced by our company American Oak Barrel | 90 Day Oak Barrel Warranty | Guaranteed To Seal Or We'll Replace It Hassle Free | Responsive Customer Care Team for help setting up and maintaining your barrel at 941-227-7357"
    ],
    "specifications": {
      "Product Dimensions": "5.5 x 4.5 x 4.5 inches",
      "Item Weight": "3 pounds",
      "Manufacturer": "American Oak Barrel",
      "ASIN": "B017S9KTFQ",
      "Item model number": "AOB01LBK063",
      "Customer Reviews": "4.7 out of 5 stars565 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#143,636 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 8, 2015"
    },
    "categories": [
      "Wine Making",
      "Home & Kitchen",
      "Home Brewing & Wine Making",
      "Barrels",
      "Kitchen & Dining"
    ],
    "price": 59.95
  }
}