{
  "website_summaries": [
    {
      "verdict": "Get low-sheen satin, spray-gun style results with aerosol can convenience with this quality Spray Max product.",
      "pros": [
        "Satin or semi-matte, low-luster finish",
        "Provides durable weather resistance",
        "Unique nozzle design gives spray-gun results",
        "Provides low-gloss look",
        "Gas- and oil-resistant"
      ],
      "cons": [
        "Be sure to use eye protection, proper breathing equipment, and skin protection when you apply",
        "Solidifies in can in a number of hours"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "If it's Toxic, it Works!",
      "text": "This brand and product is the best spray clear coat I've ever used. The semi matte was not what I was looking for, however. The other option I've used, 2k high-gloss was too glossy and stood out against the rest of the vehicle. So this time I bought the semi matte, but it was too matte. I don't know if there's an in between option, but if there was it would be perfect. In the future I might buy the high gloss and just take it down a bit with sand paper. WEAR A MASK WITH THIS STUFF! It's really toxic, but like most modern products: that's how you know it's going to work.",
      "rating": 4.0,
      "verified": true,
      "author": "Ocean",
      "helpful_votes": 8,
      "publication_date": 20170701
    },
    {
      "title": "BUYER BEWARE",
      "text": "Edit #1: Decided to spray what was left and hope for the best. What I thought had eaten through the frame is a white buildup from the can. This was mentioned by multiple other people in their reviews. My plan now is to wet sand these white areas down in order to try and save my time and money. Original review: Bought this to finish a project and ended up ruining that project. Ate through the paint and down to the primer. I could not be more disappointed and upset. Complete waste of money and a ton of time!!",
      "rating": 1.0,
      "verified": true,
      "author": "Red Madsin",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Resistant to gasoline. Exceptional sprayer dispersion.",
      "text": "This is by far the best sprayer on a rattle can that I’ve ever used. With good preparation and clean environment (preferably paint booth) you would be hard pressed to notice any difference between this can and a regular higher quality paint gun. The clear coat is very durable and resistant to most automotive chemicals (oil, gas, brake cleaner) once fully cured.",
      "rating": 5.0,
      "verified": true,
      "author": "Mihailo K.",
      "helpful_votes": 4,
      "publication_date": 20180625
    },
    {
      "title": "Easy to use",
      "text": "I painted an aftermarket fuel tank for my 883 Iron and used this to seal the paint. Worked perfectly. Easy to use. Just make sure it is well ventilated or wear a respirator (recommended) Just make sure to let it cure for at least two weeks before you do your final cut and polish.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Hodgkins",
      "helpful_votes": 3,
      "publication_date": 20170805
    },
    {
      "title": "Been Great But...",
      "text": "Produces a great and durable coating. I've used this product before with no problem but this last can of semi matte finish (0067) started spitting paint causing some blotches on the finish - this was not acceptable. For the price this should never happen.",
      "rating": 3.0,
      "verified": true,
      "author": "DMC",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Nice",
      "text": "Very durable. I used this to clear coat my diff covers after I painted them. It's holding up very well. It is a one time use thing though. Use what you need and dispose of it as it will not last after you mix the components.",
      "rating": 5.0,
      "verified": true,
      "author": "J. R. O. Neal",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Disappointed",
      "text": "Dripped all over my project and left white residue. Very disappointed especially after what I paid for this. I am very familiar with spray paint since I have done many home projects over the last few years. My ceiling fan is basically ruined. Update: 3 stars because Amazon took care of this for me right away. I’m not sure if this was defective since majority of the reviews are good.",
      "rating": 3.0,
      "verified": true,
      "author": "mjake",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "This is a true 2 stage finish in a can",
      "text": "No comparison to single stage clears on the market. This stuff finishes beautifully. If you take the time to color sand the color and then the clear. When you polish it all out it's like looking into infinity. Take your time and the results will amaze.",
      "rating": 5.0,
      "verified": true,
      "author": "trwilliams3",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Not worth the money!",
      "text": "Attached are pics of the spray results after following instructions and watching videos. Product coming out in drops...not spray form. Expensive and not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "terry finnigan",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Its just ok, nothing special",
      "text": "This product might be ok if you're doing some at home bs, but overall its not a very good clearcoat. It doesn't dry very clear even when sprayed in a booth. It was ok though for what i used it for, to seal in the burned paint after my moped lit on fire, cuz thats punk rock. Follow us @kickstandbois",
      "rating": 3.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Very nice",
      "text": "Great product really tough but once you activate it the can says use in 48 hours after that it will not spray trust me a week is to long.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Wasted a whole can!!!",
      "text": "I've used this product before and it works great. However one of the cans opened up a leak and sprayed right in my eye when I cut the tape so I could remove the cap. A knife should not so easily cut a metal can.It did not do any serious damage to my eye but it did not feel very pleasant. I had to waste a whole can.",
      "rating": 2.0,
      "verified": true,
      "author": "anthony whitaker",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Well worth the price",
      "text": "Seems a bit expensive for canned paint but this stuff was so much less pricey than special auto paint. Used it to coat my motorcycle and worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Looks good, poor coverage rate",
      "text": "Nice product, but disappointing amount of coverage for a very high price",
      "rating": 3.0,
      "verified": true,
      "author": "Robert G.",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Ruined my project",
      "text": "Went through the instructions as needed, instantly started to spray thick droplets all over, ruining my paint job and hours invested. Terribly disappointed in the product.",
      "rating": 1.0,
      "verified": true,
      "author": "raul zelaya",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Five Stars",
      "text": "Unbelievable product. Gas/oil resistant. Not only resistant but fuel cannot penetrate this paint/substance",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Amazing clear coat",
      "text": "Such a great product. Used semi and gloss. Both great. Semi is still a little glossier than I wanted but still great",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Not worth time and money",
      "text": "Have milky cloud sports. Have to sand and repaint. Going to clear with Krylon Fusion. Have never had a problem with that. Waste of time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "James F.",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "why cant other spray cans spray like this?",
      "text": "covered great, the spray is the best of any spray can i have ever seen",
      "rating": 5.0,
      "verified": true,
      "author": "J. Strickland",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Wear a mask, the product is toxic AF",
      "text": "Product is T H I C C. Works great! Definitely wear a mask, product is very toxic. Careful wien) when spraying, as the flow is very fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Mathew neises",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "About expiry date of the Spray Can ... Is it the one appearing in the Can nozzle side?",
      "text": "This product was delivered to me on October 25 2018. When i opened it today Feb 8 2019 only to noticed that the can shows a date of 09/28/2017. I tried using it but its having intermitent pressure resulting to inconsistent nozzle spray . am i due for replacement for this matter?",
      "rating": 1.0,
      "verified": true,
      "author": "eduardo a.",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Bet clear coat  I've ever used",
      "text": "This was better than I thought it would be .",
      "rating": 5.0,
      "verified": true,
      "author": "monty pennington",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Paint inside can was the wrong color.",
      "text": "The order and sticker said clear. Paint itself was black.",
      "rating": 1.0,
      "verified": true,
      "author": "J. O. ",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Not perfect but would buy again",
      "text": "Worked well on wide flat surface but chipped after a weekend letting it cure on a narrow surface.",
      "rating": 4.0,
      "verified": true,
      "author": "David F.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Eh...",
      "text": "Couple things. 1. The can flings drops of paint everywhere every time you shake it after you start painting. 2. Towards the end of the can it gets very sloppy spitting out huge drops.",
      "rating": 2.0,
      "verified": true,
      "author": "Steven W",
      "helpful_votes": 0,
      "publication_date": 20180516
    }
  ],
  "product_meta": {
    "title": "Spray max 2K Clear Coat Semi Matte",
    "description": "Spray Max 2K Clear Coat Semi Matte WARNING: This product can expose you to chemicals which is [are] known to the State of California to cause cancer and birth defects or other reproductive harm. For more information go to www.P65Warnings.ca.gov.",
    "rating": 4.2,
    "feature_bullets": [
      "Satin, low luster clear coat in an easy to use aerosol",
      "2K Clear Coat for durability and weather resistance",
      "Unique nozzle delivers spray gun life results",
      "Dries to a hard finish",
      "Professional quality automotive clear coat"
    ],
    "specifications": {
      "Manufacturer": "Spray max",
      "Part Number": "3680067",
      "Item Weight": "1 pounds",
      "Product Dimensions": "8.5 x 2.5 x 2.5 inches",
      "Item model number": "8",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Clear",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B017Y4QTVI",
      "Customer Reviews": "4.2 out of 5 stars77 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#21,017 in Automotive",
      "Date First Available": "November 16, 2015"
    },
    "categories": [
      "Body Paint",
      "Paints & Primers",
      "Tools & Home Improvement",
      "Paint & Paint Supplies",
      "Automotive"
    ],
    "price": 25.04
  }
}