{
  "website_summaries": [
    {
      "verdict": "Though the LG G Stylo's stylus is more of an afterthought, it's still a highly affordable big-screen handset.",
      "pros": [
        "The LG G Stylo has a competitively low prepaid price, a long-lasting battery and a built-in stylus for added functionality"
      ],
      "cons": [
        "The handset picked up a subtle amount of static during calls, 4G LTE data speeds were slow in our area and its stylus doesn't have as many productivity tools as the Samsung Galaxy Note 4's S-Pen"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 7.0,
        "Camera": 7.0,
        "Battery": 8.0
      },
      "publication_date": 20150707,
      "rating": 7.2,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good phone for the price",
      "text": "Good phone for the price. Does everything my expensive galaxy was doing before i cracked the screen. Make sure you get a sim card it doesnt come with one. I installed a sim and it was up and running in minutes. It doesnt transfer the data easily and several things i had to manually input back in but i think thats pretty standard in all electronic stuff today. Im a budget minded person that doesnt want to spend big bucks on phones any more that your gonna replace in two years or less anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Terrible Terry",
      "helpful_votes": 30,
      "publication_date": 20170808
    },
    {
      "title": "Expectations Exceeded!!!",
      "text": "Let me start by saying I got this phone after ordering and returning an AWFUL phone (5.5 Fusion5 Gen II) - so I was a bit skeptical about ordering another phone online. Boy am I glad I did!!! This is a DELIGHTFUL PHONE. MARVELOUS QUALITY. DURABLE. BEST CAMERA I\"VE HAD, etc. At this cost it is a pure steal!! Buy it. You won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 25,
      "publication_date": 20171004
    },
    {
      "title": "I bought this phone, \"refurbished! \". Yeah ...",
      "text": "I bought this phone, \"refurbished!\". Yeah right. It was a stolen phone that RED MOON TRADING COMPANY SOLD ME! I returned it to the rightfull owner.",
      "rating": 1.0,
      "verified": true,
      "author": "Beth Barrilleaux",
      "helpful_votes": 16,
      "publication_date": 20180831
    },
    {
      "title": "Very dissatisfied",
      "text": "The phone e is not worth the money. I paid $200 for this phone and it arrived without a charger or anything just the phone and the camera doesn't work the volume will go down but not up. Would give zero stars if I could very dissatisfied.",
      "rating": 1.0,
      "verified": true,
      "author": "Taryn",
      "helpful_votes": 4,
      "publication_date": 20181029
    },
    {
      "title": "A Few Hiccups, but totally fine",
      "text": "Phone works well. It will not update the Android operating system for some reason, but that doesn't interfere with anything so far. WiFi, Bluetooth, Sound, Speakers, etc all work great. It connected to T-Mobile with the SIM card (MicoSIM, not nano) for a few minutes and then disconnected. I took it to TMobile where they reinserted the card and restarted it after verifying it wasn't a stolen phone and it has been great ever since.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia Rodriguez",
      "helpful_votes": 8,
      "publication_date": 20180207
    },
    {
      "title": "Not a happy customer.",
      "text": "Front and back picture terrible. My phone wasn't new when I received it. Showed up in a open retapped box. The phone was in Spanish with someone else's information. Currently the phone freezes up and I have to restart for it to work properly. I'm always getting the error messages that my phone isn't up to date nor is the internet.",
      "rating": 1.0,
      "verified": true,
      "author": "Bridget ",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "I LOVE IT!",
      "text": "I was a little worried after reading some comments...It took 2.5 days to get my trac phone set up but...I LOVE IT!!!.It is very easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "millie",
      "helpful_votes": 9,
      "publication_date": 20160310
    },
    {
      "title": "and it's just simply perfect for him",
      "text": "Got it for our 9 year old son as his first phone, and it's just simply perfect for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie W",
      "helpful_votes": 3,
      "publication_date": 20170907
    },
    {
      "title": "One Star",
      "text": "Back camera didn't work, can only use speakerphone to talk on phone 😑",
      "rating": 1.0,
      "verified": true,
      "author": "Sherri Mendez",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Five Stars",
      "text": "For the price one of the best phones I've ever had",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Richman",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Wont order from this seller again",
      "text": "Phone arrived in Spanish the battery doesn't hold a charge you can't put it on total silent there are application on it in Spanish I'm unable to delete now I still have to buy a new phone",
      "rating": 1.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Make sure u read what the discription",
      "text": "It was google locked. It wasnt waht i thought. I was so disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "kristin",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Phone not working good",
      "text": "It always dropping call and when you dail out it take five minutes before the phone ring and a lot of time it don't ring it keep hanging up i have to turn off my phone and start over",
      "rating": 1.0,
      "verified": true,
      "author": "Sandra B.",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Be Cautious",
      "text": "Not what I ordered. I wanted a T-Mobile compatible device. This is AT&T and only takes Micro and Standard size Sim cards. Will be returning",
      "rating": 1.0,
      "verified": true,
      "author": "Cassandra Beluckman",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Lg stylo",
      "text": "We have three of these phones and they are great. large screen takes great pictures easy to navigate, battery last all day , runs smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "tonya",
      "helpful_votes": 9,
      "publication_date": 20170507
    },
    {
      "title": "It was a perfect phone for 100 dollars",
      "text": "It was a perfect phone for 100 dollars. I wanted a iphone 6s but I'm glad i got this.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Williams",
      "helpful_votes": 4,
      "publication_date": 20160417
    },
    {
      "title": "Don't buy",
      "text": "Purchased this phone on November 10. Didn't even have it for 3 month before I had to purchase another phone. DO NOT BUY!!",
      "rating": 1.0,
      "verified": true,
      "author": "jesse granados",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "HORRIBLE",
      "text": "Horrible phone.. worked for two days and now is saying it cannot read sim card. It keeps freezing and just is not worth the purchase. dont do it .",
      "rating": 1.0,
      "verified": true,
      "author": "Tiana A Smith",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Best Phone!!!!",
      "text": "Shipping went well and everything was just amazing will order again!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Montano",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "bought refurbished and acts brand new I love it!",
      "text": "Phone came quickly and looked as if I bought it right out of the store.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Renee",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "locked frp phone",
      "text": "Phone is not advertised as a locked phone. Beware on purchase. Phone comes in with previous owner info. Had to pay 55$ more to unlock.",
      "rating": 1.0,
      "verified": true,
      "author": "P-nut",
      "helpful_votes": 4,
      "publication_date": 20180128
    },
    {
      "title": "My new phone.",
      "text": "I love my phone and if i had a problem they fixed it right away, i was just hoping that it came with a headset. But im still so happy that i ordered it. And if i had a chance to do it all over again i definitely would.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Brown",
      "helpful_votes": 3,
      "publication_date": 20160613
    },
    {
      "title": "Buy elsewhere",
      "text": "I thought the charger that was sent didn't work..turns out the phone is defective. If you wiggle and not move it..another charger does work. The charger we are using works on the other phones so I take it the phone I was sold has a bad port. Bit of an inconvenience. My husband turned off his old phone and now we are stick with this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Justy Abejuela",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Great!",
      "text": "The product was better than expected and the shipping time frame was amazing! Would buy from seller again with out a doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Melero",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Bought this on July 6 2016 and as of today ...",
      "text": "Bought this on July 6 2016 and as of today 5-1-2017 it doesn't turn on, found out that these phones have a manufacturing defect (if it over heats it will lift the semiconductors off the main board) that will cause it to fail and LG is well aware of this and will not acknowledge fault. Never again LG never again!",
      "rating": 1.0,
      "verified": true,
      "author": "OZ",
      "helpful_votes": 4,
      "publication_date": 20170430
    },
    {
      "title": "This model is good.",
      "text": "I returned the one I ordered because my original from T-mobile dried out and works just fine after an overnighter in the sheep water tank. Thanks to Amazon and Amazon partners for easy returns .Original phone of same model dried out undamaged after dunking 12hrs underwater.",
      "rating": 4.0,
      "verified": true,
      "author": "Stagehand Jim",
      "helpful_votes": 4,
      "publication_date": 20170429
    },
    {
      "title": "Like new!",
      "text": "Perfect condition! Like new! Works great! Missing stylo pen. Phone updated to marshmallow. It said \"nicks on edges\"...haven't found them yet! No scratches on screen either. Thanks for a great phone.",
      "rating": 5.0,
      "verified": true,
      "author": "emilio",
      "helpful_votes": 6,
      "publication_date": 20170101
    },
    {
      "title": "Pretty decent, but not a flagship obviously",
      "text": "Great screen size, brightness drains battery passed 60, games run smooth and as long as you have an SD card you should be fine in terms of memory",
      "rating": 5.0,
      "verified": true,
      "author": "Carter O.",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Never again!",
      "text": "Could not use it in the network I was told I could use it on,and constantly kicks me off site like gmail,amazon and Facebook. Not a good phone! Can't contact seller either!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Don't like the phone",
      "text": "It's not a good phone the sim part doesn't work good",
      "rating": 1.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Love..",
      "text": "Love ....Love ....Love is ALL I can say about this phone .... Thanks Amazon! It's everything I expected it to be .....",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 10,
      "publication_date": 20160128
    },
    {
      "title": "One Star",
      "text": "I am not happy with this phone. The gps system does not work well.",
      "rating": 1.0,
      "verified": true,
      "author": "samantha",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Turned out to be a crappy phone because all of a sudden the person you ...",
      "text": "Turned out to be a crappy phone because all of a sudden the person you are talking to can't hear you!",
      "rating": 2.0,
      "verified": true,
      "author": "jdbsea",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "One Star",
      "text": "It don't work. It restarts at the lg screen. I'll be alright though.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 3,
      "publication_date": 20160620
    },
    {
      "title": "Order it. Just do it!",
      "text": "Love it! Pros -Fast -Crisp bright screen. -Big -Great Space (16gb) -Runs as well as a modern phone (skip the $800 phones, trust me.) -Gets alot of compliments. Cons: Sometimes the screen light flickers.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 14,
      "publication_date": 20171119
    },
    {
      "title": "NOT UNLOCKED",
      "text": "I never see this kind of description, its not TRUE, This is Locked by T-Mobile, When I try this phone in India it is not working. When I Call T-Mobile, since its not bought it from T-Mobile, Checking wiht the Vendor who has given this mobile phone to me. I Recommened not to buy this one",
      "rating": 1.0,
      "verified": true,
      "author": "Srinivasa Medicharla",
      "helpful_votes": 8,
      "publication_date": 20180712
    },
    {
      "title": "Terrible Phone",
      "text": "Absolutely horrible phone. It had a severe back light problem. It would start flickering and the only way to not be annoyed was to keep the brightness as low as possible. It was has rather large. I found very annoying that the up down button were on the back instead of on the side like most phones.",
      "rating": 1.0,
      "verified": true,
      "author": "Serina S.",
      "helpful_votes": 3,
      "publication_date": 20180824
    },
    {
      "title": "and a pretty good battery life",
      "text": "I was pleasantly surprised at the ease of use and the quality of this ridiculously (compared to my s3 mini) large smartphone. It is sleek, lighter than assumed, has the capability to support a 32 gig microSD, and a pretty good battery life. Highly recommend this phone, for those looking to climb from the Galaxy s2, s3, and s3 mini stone age.",
      "rating": 5.0,
      "verified": true,
      "author": "Vaetagarius",
      "helpful_votes": 14,
      "publication_date": 20160709
    },
    {
      "title": "Darn good phone so far",
      "text": "Only down side is I need to get a purse with a bigger phone pocket and/or pants with bigger pockets. I expected it to take better photos with a 13MP camera insde it, so that was a little bit of a downer, but I'm happy with it. The constant updates throughout the day, either from Tmobile or Android a a little annoying because without those the phone would have an amazing battery life.",
      "rating": 4.0,
      "verified": true,
      "author": "jewells68",
      "helpful_votes": 12,
      "publication_date": 20170917
    },
    {
      "title": "Five Stars",
      "text": "It worked perfectly and was a great replacement for the one that went bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Seidensticker",
      "helpful_votes": 5,
      "publication_date": 20170601
    },
    {
      "title": "The phone works well, however the charger it came ...",
      "text": "The phone works well, however the charger it came with only charges the phone to %50 so I needed to buy a different charger.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180220
    },
    {
      "title": "Was not new!",
      "text": "This phone was far from being new like the description said but it does work. I most likely will not buy from this vendor again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Great phone",
      "text": "I already had the phone and I bought one for my wife. I love the phone and the price was right.",
      "rating": 5.0,
      "verified": true,
      "author": "edward f bartley",
      "helpful_votes": 25,
      "publication_date": 20160130
    },
    {
      "title": "Five Stars",
      "text": "great phone for a great price.. my daughter loved it..",
      "rating": 5.0,
      "verified": true,
      "author": "J.Stillwell",
      "helpful_votes": 2,
      "publication_date": 20180305
    },
    {
      "title": "Awsome",
      "text": "Writing from the phone now. Am absolutely loving it. Worth the buy in my opinion. Larger than i expected which was a plus. It is awsome for people who like stylus phones. May buy one for my fiance later!",
      "rating": 5.0,
      "verified": true,
      "author": "samuel scaife",
      "helpful_votes": 4,
      "publication_date": 20161117
    },
    {
      "title": "I love this phone great price its used but it looks ...",
      "text": "I love this phone great price its used but it looks new, no trouble yet if any i will let know, gfor the moment everything is great, shipping on time phone works perfect it gets everything done great for games,movies camara is very good apps work well, i give it a 10 im happy with my buy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20160308
    },
    {
      "title": "Screen scratches so easy!!!!",
      "text": "So far phone is as i expected. Screen scratches so easy DO NOT BUY without screen protector. Shipping was slow. They used a filler to hide scratches but the second you wipe finger prints off youll see the scratches come out.",
      "rating": 3.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 2,
      "publication_date": 20170603
    },
    {
      "title": "Not happy with this purchse!!!",
      "text": "The phone had more scratches than expected. It was a gift for my sister in Mexico. when she inserted her sim card, the phone turned out to be locked.",
      "rating": 2.0,
      "verified": true,
      "author": "RUBEN",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Wonderful",
      "text": "I cannot distance myself from this phone long enough to write a full review lol",
      "rating": 5.0,
      "verified": true,
      "author": "Jeramy D",
      "helpful_votes": 2,
      "publication_date": 20160602
    },
    {
      "title": "Don't judge this phone by it's cover.",
      "text": "The exterior of the phone was in good shape, minus a small scratch, but this phone is MUCH slower than my other phone, which was the same make and model. It also freezes from time to time, requiring that the battery be taken out and put back in to restart it. I wish I had spent my money somewhere else.",
      "rating": 2.0,
      "verified": true,
      "author": "K.S.",
      "helpful_votes": 5,
      "publication_date": 20170220
    },
    {
      "title": "Ordered it April 8th, received it April 11!",
      "text": "Ordered it April 8th, received it April 11! Very very fast shipping. Phone is in very nice condition, only spot I see on the back is where a sticker used to be. Functions as it should, looks nice, and definitely an upgrade from my LG Volt. For this price, I'm honestly amazed. I recommend it if you're looking for a bigger, newer phone with a nice camera. The stylus is a plus!",
      "rating": 5.0,
      "verified": true,
      "author": "Joeshultz96",
      "helpful_votes": 7,
      "publication_date": 20160411
    },
    {
      "title": "***DONT GIVE THEM YOUR MONEY****",
      "text": "****DONT DO IT.... PHONE DOES NOT WORK AND THEY HAVE NOOOOO CUSTOMER SERVICE****!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180202
    }
  ],
  "product_meta": {
    "title": "LG G Stylo 4G LTE Mobile Stylus Smartphone GSM Unlocked",
    "description": "The Good The LG G Stylo has a competitively low prepaid price, a long-lasting battery and a built-in stylus for added functionality. The Bad The handset picked up a subtle amount of static during calls, 4G LTE data speeds were slow in our area and its stylus doesn't have as many productivity tools as the Samsung Galaxy Note 4's S-Pen. The Bottom Line Though the LG G Stylo's stylus is more of an afterthought, it's still a highly affordable big-screen handset.",
    "rating": 3.5,
    "feature_bullets": [
      "DOES THIS DEVICE NEED A SIM CARD: Yes it does Being that this device is GSM unlocked it will work on any GSM Network with a Standard size SIM Card The sim card does not come included and you will need to contact your Network Provider to acquire your complimentary Sim card (Free from most Carriers with activating of an account)",
      "WHAT NETWORK FREQUENCIES ARE SUPPORTED BY THIS DEVICE: B2 (1900 PCS) B4 (1700/2100 AWS 1) B12 (700 ac) B1 (2100) UMTS B2 (1900 PCS) UMTS B4 (1700/2100 AWS 1) UMTS B5 (850) 850 GSM 900 (E-GSM) GSM 1800 (DCS) GSM 1900 (PCS)",
      "HOW LONG CAN I EXPECT THE BATTERY TO LAST ME: Well the battery has 2900mAh which in a Usage time frame means 10 solid hours of Usage streaming at 4G LTE speeds as well it has a Standby time of up to 10 days before you need to recharge the battery",
      "DOES 4G MEAN THIS DEVICE IS THE 4TH GENERATION STYLO: No. All 4G means is that this device supports the latest technology in Network broadband so that you'll have a better connection to the network and more reliable service with less dropped calls (the sale is for it they first generation Stylo). please note this device is unlocked from the MetroPCS Network and will have some preloaded MetroPCS applications that will be irremovable though irrelevant to the functionality of the device",
      "WHAT DOES UNLOCKED REALLY MEAN: Unlocked devices are compatible with GSM carriers like AT&T and T-Mobile as well as with GSM SIM cards (e.g. H20, Straight Talk, and select prepaid carriers) Unlocked Devices will NOT work with CDMA Carriers like Sprint, Verizon, Boost or Virgin. The Device is Internationally Compatible in many Countries that support GSM Frequencies (contact your network provider prior to purchasing for verification that they support GSM frequencies that are listed above)"
    ],
    "specifications": {
      "Product Dimensions": "3.12 x 0.37 x 6.08 inches",
      "Item Weight": "5.9 ounces",
      "ASIN": "B017N453FC",
      "Item model number": "MS631TN",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.5 out of 5 stars122 ratings3.5 out of 5 stars",
      "Best Sellers Rank": "#158,860 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Google_android",
      "Wireless communication technologies": "Cellular",
      "Additional Features": "Touchscreen, Bluetooth-enabled, Lte, Smartphone",
      "Other display features": "Wireless",
      "Form Factor": "Smartphone",
      "Colour": "Silver",
      "Manufacturer": "LG",
      "Date First Available": "June 4, 2015"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": 94.99
  }
}