{
  "website_summaries": [
    {
      "verdict": "Reputable choice among surfers. Good for any sized boards, including SUPs. Comes in four sizes (6-9 feet) and four colors.",
      "pros": [
        "Affordable and reliable",
        "Tested in big waves",
        "Top rated customer service",
        "Popular features include easy quick-release tab and key pocket"
      ],
      "cons": [
        "Ankle cuff thin and could be more comfortable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Maybe for tiny surf but broke in 5’ waves.",
      "text": "This leash broke on the second use in a moderate size set. It might be fine for a foam board in 2’ surf. But in 5’ waves I don’t think it will last long. I didn’t notice any nicks or cuts or damage. It was literally the second use of the leash.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Owen",
      "helpful_votes": 14,
      "publication_date": 20171117
    },
    {
      "title": "and thus a bit less comfortable. Overall",
      "text": "Leash is well made and survived the biggest hurricane surf of the summer in New Jersey, when my board was ripped out of my hands a couple of times and I wound up diving under a few macking sets with the board strapped to my ankle and the leash fully stretched closer to the beach. The board never snapped back at me, and while surfing I never once stepped on the leash. Would have been 5 stars, but the ankle strap is thinner than the leashes I usually use, and thus a bit less comfortable. Overall, though, I am a satisfied customer. It's a great leash for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Vish the Dish",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "The leash held like a champ",
      "text": "First of all, epic epic brand name. Ho stevie, braddah! I just put this little green beauty through its paces while getting flogged in punchy, Central American surf. Occasionally bailing my board at shallow pointbreaks and reefs, because a deep duckdive would lead to angry kisses from big boulders and sharp rocks. The leash held like a champ. Only reason I'm giving it four stars is because the ankle cuff is a bit thin (widthwise) and liked to loosen up a little over the course of a session. Otherwise, a fantastic budget leash. Took it as a backup and ended up using it on all my boards for the entire trip. Ho Stevie!",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Minardi",
      "helpful_votes": 0,
      "publication_date": 20160815
    },
    {
      "title": "Feels great",
      "text": "Well made leash, don't really even feel it, easy to grab and take off. Used it in Indonesia with the reefs and had no problems at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Surf Dude",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Great leash!",
      "text": "I ordered the product for my husband, and he was truly happy with the item, and said that it is of great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Ayala",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "Great leash, good velcro",
      "text": "Compared to the wavestorm leash this replaced, this is a great leash. Velcro seems very strong and never comes off, but the handle loop makes it easy to take off. I am buying a second one for my other board in need of a leash.",
      "rating": 5.0,
      "verified": true,
      "author": "evan",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Awesome, solid, affordable leash!",
      "text": "I have been using this leash for almost 2 years now! I have a white one, and it's been on my lost puddle jumper since I bought the board. It's been through many rough wipeouts and has never come close to snapping. I've sent it in some heavy 8ft+ Florida hurricane swell with this thing on and never lost my board. The ankle cuff is super comfortable and and the twisty thingy's keep the the leash tangles to a minimum. Highly recommend! Ho Stevie!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "I really like the product",
      "text": "I really like the product, it was everything that i was hoping for. It looks like it will last a long time. If i can make one request i wish there was a yellow color option. I purchased one green and one Blue. Im using them for my stand up boards. I also use them to tie the boards to my boat when we are at the lake. I like that Stevie is a real hands on owner and i like that. I hope this was helpfull, I will be recommending this product to everyone. Thanks for reading, David Thompson",
      "rating": 5.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Good enough for overhead surf",
      "text": "Solid for the price. In Hawaii, any leash can snap without notice. This leash is similar in strength to most high quality leashes. The only gripe I have is that the ankle strap could be a little more reinforced. Overall not bad and I feel comfortable using it in 6 ft, plus (12 ft. faces) wave heights in Hawaii. Anything bigger you need a true big wave leash anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas Bruce",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Ho stevie is for the surfers!",
      "text": "These leashes are awesome. I bought 5 in the past year. They're 10-15 dollar's cheaper than the bane brand leashes and just as good! I'm not taking these leashes out at small waves either.. they all survived the big waves up at north shore, Oahu. I always buy my leashes from Ho Stevie. Keep up the good work guys, giving us affordable yet great quality products! Mahalo!",
      "rating": 5.0,
      "verified": true,
      "author": "Micah",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Great surfboard leash",
      "text": "This is a great surfboard leash! Reasonably priced. Owner is great. Sent an email making sure we were happy with the purchase, which we are. Product is made of good quality material and the part that goes around the ankle is nice and comfortable with a good amount of padding. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy K.",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "IN LOVE! Fit very comfortable around my ankle",
      "text": "IN LOVE! Fit very comfortable around my ankle, I was worried because I have larger legs and it looks like it would fit any size! The length was perfect for my 11' boards and arrived on time. I received a nice email from the owner steve asking about the product and explaining how to attach the cord to my board which was very helpful. I would totally recommend this to any paddleboader who is tired of swimming after your board!",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "Note i still think it deserves 4 stars because it was great during its heavy use over the pas 22 months",
      "text": "Finally broke after almost 2 years. Note i still think it deserves 4 stars because it was great during its heavy use over the pas 22 months. I just wanted to post so Steve knows that in my case it was the plastic ring within the ankle strap that broke in half, in case you want to look into that ;) I'll be ordering a new one soon though!",
      "rating": 4.0,
      "verified": true,
      "author": "Nathaniel",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Well made",
      "text": "Great price for a very quality looking and functional product. Great find.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Great price, great product",
      "text": "Tested today in overhead surf. Comfortable and so far reliable",
      "rating": 5.0,
      "verified": true,
      "author": "Decker Bros",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Most affordable leash that won’t break",
      "text": "Bought a leash that wasn’t Ho Stevie and it broke and sent my board all the way to shore, got this leash and have had it for a couple months and it has no signs of breaking. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Frobenius",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Mikey likes it",
      "text": "This is the 2nd lease I bought for my husband. He loved the first one. So I bought another one for him. Not sure about durability as he hasn't had it that long but seems to work great for him",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Got this as an upgrade for the leash that came with my board and I'm stoked!",
      "text": "Got this as an upgrade for the leash that came with my board and I'm stoked! It's super comfy and very flexible. Weird, but my last leash kept getting tangled on my toe when I stood up and that's not the case with this one. With the waves about to start picking up around here, I'll be thankful that I paid a few extra bucks for a super sturdy leash like this one.",
      "rating": 5.0,
      "verified": true,
      "author": "HammerHead Showers",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Works great!",
      "text": "Works great! Swivels save a lot of tangle problems that I had with my old Costco leash. Package arrived almost before I ordered it! I have already sent the link to a friend who also needs a replacement for his Costco board leash, just to make our friendly competitions more fair.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Freiling",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Only benefit above stock wavestorm leash is that it's removable",
      "text": "I ordered this as a removable replacement for my 8ft wavestorm board. I'm a beginner surfer and the leash that comes with the wavestorm can't be removed easily (unless you remove the fin) and tangles up a lot. This leash has a double swivel but still gets wrapped around my legs. It's a good leash but if your tight on cash just keep the stock wavestorm leash.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Macarthur",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "My dog love it.",
      "text": "This leash is not so bad... but sometimes it makes tangle. Once my ankle got really hurt from the leash. Leash is not stable in my ankle.. My dog love it.",
      "rating": 3.0,
      "verified": true,
      "author": "Han",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Good service, fast delivery ...",
      "text": "Good service, fast delivery ... leash(s) look nice, seem good quality however have not installed the leash yet/used it on the board....so for now 5 stars with reserve right to re-rate later :-)",
      "rating": 5.0,
      "verified": true,
      "author": "MjM",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "No tangle",
      "text": "Great leash, Doesn't get tangled around feet when walking to the water",
      "rating": 5.0,
      "verified": true,
      "author": "GILNSB13",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Two mice fell into a bucket of cream. The ...",
      "text": "Two mice fell into a bucket of cream. The first mouse quickly gave up and drowned. The second mouse kicked so hard that he churned that cream into butter and walked out. My friends I am that second mouse. Thank you, Ho Stevie! Sincerely yours",
      "rating": 5.0,
      "verified": true,
      "author": "MattAzpi",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Close your eyes and buy, check your lenght first,6\" may be too short for some.But, Great quality.",
      "text": "These are as strong as they claim! Great Great quality. this leash snagged on a buried tree branch between my kiteboard and my ankle, and with 30knot wind on my kite,it held. Luckily,it was shallow and I was able to retrieve. But I was amazing how strong it was. GOOD STUFF Ho Stevie!",
      "rating": 5.0,
      "verified": true,
      "author": "GREGSON C.",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Great Surfboard Leash",
      "text": "This is a great leash. The swivel is very smooth and the leash feels great while you have it on. I used this to replace a leash that kept coiling and did not have swivels. The color I choose was blue and it was very cool matching my board color.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry R",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "This is a great leash and I highly recommend it",
      "text": "Didn't want to write a review till I had used it for a few months. This is a great leash and I highly recommend it. Sort of wish the velcro strap was a little wider, but it hasn't been a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "james g king",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "What I needed",
      "text": "This leash should be able to handle bigger waves. I'm not a fan of comp leashes, this is just what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary S.",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "The leash is sturdy and has held up in the moderate swell I've ...",
      "text": "The leash is sturdy and has held up in the moderate swell I've been riding lately with a heavier than usual 9ft longboard. The double swivel is nice. A point for improvement would be the ankle cuff- if it were wider it would stay positioned better on my ankle/calf and not twist around as much. Not a deal breaker, this is a solid leash with high quality velcro, key pouch, and fittings.",
      "rating": 4.0,
      "verified": true,
      "author": "john a plominski",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "I also bought the other leash at a good price here",
      "text": "Seems really well-made. I also bought the other leash at a good price here, the Dorsal and while it's fine, you can see the extra quality of the Ho Stevie leash when they are side by side. Will update if I have any issues over the first year of use.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lewis",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "Great Leash!",
      "text": "Great leash. Looks nice and feels solid. I've been using this thing for a few months now and it's going strong. My last two leashes (dakine and some other brand) didn't even last me a few months. This leash is much more sturdy and less expensive. It's an easy choice for me.",
      "rating": 5.0,
      "verified": true,
      "author": "HighImpact",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "So far, so good!",
      "text": "Appears to be good quality for the price. Only Used once so far in small surf on a SUP. Durability to be determined...Got it fast. So far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Yew",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "WHAT!!! READ THIS!",
      "text": "After using this leash, all my problems have been solved. At the moment I attached it to my board the dark clouds cleared and the sky became blue. I rode my first wave catching major barrels and ripping lip of the wave like a endless summer movie. People stopped at the beach and watched me like Moses parting the sea. This leash has magic powers because I never got wet surfing and every wave was perfect that carried from the break to shore. After buying this leash all my credit card debit was also magically paid. Also it cured my impotence and I shall name my first born after this leash. BELIEVE ME THIS IS ALL TRUE!",
      "rating": 5.0,
      "verified": true,
      "author": "David Kurlander",
      "helpful_votes": 6,
      "publication_date": 20170512
    },
    {
      "title": "Poor Quality, Broke After 6 Months",
      "text": "This leash broke after less than 6 months of light - medium use. Do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Hidden",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Excited to take it out with my board!",
      "text": "It is excellent quality, build, and color (Orange)! I haven't taken it out with my new board yet but very excited to. I will update if anything other than 5 stars (but I don't expect to)",
      "rating": 5.0,
      "verified": true,
      "author": "Una Veritas",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Excellent product",
      "text": "Great legrope. Seems to be made from quality materials. Excellent service and follow up. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "John Fahey",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Looks very well made!",
      "text": "This looks like a great leash. I haven't had the chance to use it in the water yet, but by all appearances it is exceedingly well made and will last a long time. Shipping and delivery was very prompt. I'll update this review once I've had some board time with it!",
      "rating": 5.0,
      "verified": true,
      "author": "PH",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Awesome Seller / Customer Service",
      "text": "The product is high quality and the sellers ability to connect and provide exceptional customer service is out of this world! Mahalo Ho Stevie, you’re the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Fernandes",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Great Leash",
      "text": "Bought one for my older son. Good price. High quality and comfortable. Works so well, I bought a second one for my younger son.",
      "rating": 5.0,
      "verified": true,
      "author": "NoCal Tee",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "The cuff is comfortable to wear and a good sized pull tab",
      "text": "I have to say I was pleasantly surprised with this leash. It's heavy duty especially compared to my previous leash. The cuff is comfortable to wear and a good sized pull tab. The cord seem indestructible and and has some girth to it. Lastly the rail saver is nice and thick. I've used this leash for a couple weeks now and I'm planning to buy another one to replace an older creature leash.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Porto",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "and it worked great. Waves weren't too big (~3-4ft)",
      "text": "I just used it today for the first time, and it worked great. Waves weren't too big (~3-4ft), so it didn't get any big yanks, but it had no problems with the ones it did see. All in all, a nice leash, at a good price! I also like the big, easy-to-grab loop for ripping it off.",
      "rating": 5.0,
      "verified": true,
      "author": "John L",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "This 5' leash works well with my 8.2' waveski where I attach it to a cord around my foot straps and the bottom of my life vest.",
      "text": "This 5' leash works well with my 8.2' waveski where I attach it to a cord around my foot straps and the bottom of my life vest. The longer straps tended to get in my way while rowing.",
      "rating": 5.0,
      "verified": true,
      "author": "Schulner",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Super durable and comfortable!",
      "text": "I love this leash. it's super comfortable and has held up for me even on bigger days.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Ahmad",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "This a very good leash, it is really thick and no way ...",
      "text": "This a very good leash, it is really thick and no way it's going to break. Very durable, but the ankle cuff could be a bit more padded, after getting pounded by wave after wave when you're stuck on the inside it begins to hurt, overall a very strong unbreakeable leash.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "As expected, another quality product from Ho Stevie! ...",
      "text": "As expected, another quality product from Ho Stevie! I also have the quad fins. My last FCS leash only lasted one season. I hope this one puts it to shame.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Jones",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "Have not used it yet, but it is of ...",
      "text": "Have not used it yet, but it is of the same quality as all the major brands, just waiting for my new LB to be completed from my shaper.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Quick release",
      "text": "Finally got a chance to use my Ho Stevie leash last weekend. No issues and really like the large quick release tab. Love the leash!!",
      "rating": 5.0,
      "verified": true,
      "author": "dedgetnt",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Great quality product from Ho Stevie",
      "text": "Great quality product from Ho Stevie. Compared to the big popular surf brands, these guys provide the same product at such a better value. Hopefully Ho Stevie doesn't start raising prices and lowering quality as they get more and more successful.",
      "rating": 5.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Standard high quality surf leash. No design break through ...",
      "text": "Standard high quality surf leash. No design break through, just a high quality leash that in a few years will eventually fail as do all leashes of this design. Does the job, is adequate.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Mueller",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Great product and service",
      "text": "As quality as any product on the market, like the security of the key pocket as well, thanks Stevie!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert James King",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Very good quality at a great price!",
      "text": "I have about 6 leashes from various manufacturers. This one is the most impressive because it is thick, doesn't tangle, and has plenty of padding. I even like the little pull tab to help pull it off my ankle. Great quality and price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany G. Davidson",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Very satisfied. Using as an arm leash for safety on ...",
      "text": "This is my second leash. Very satisfied. Using as an arm leash for safety on a Hobie Tandem Mirage (two seater). Keeps me and the kayak in contact after overboard situation.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Twoof Everything",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "New Smyrna beach happy surfer",
      "text": "This is the absolute best made, very functional leash I have ever used. It is very well made. I have a 9' board and it performs terrific. I will definitely be purchasing for my 7'4\" board when the time comes.",
      "rating": 5.0,
      "verified": true,
      "author": "K Hutch",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Great Leash!",
      "text": "Appears to be just as good if not better than my Dakine Leashes. I've used a few times already in shoulder high to head high surf and seems to withstand the strength of my 9 foot SUP.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Great leash, fair price",
      "text": "Excellent leash. I was honestly surprised at the quality for the price. Very heavy duty swivels, lots of padding around the ankle and a key hider. Well done Stevie. Update - Ordered a second leash for a second board. Wouldn't get anything else. It has held to to very large surf with no problems. Highly re-recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Bishop Shady",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Durable",
      "text": "I've been using this leash for a couple years bow and it still just as good as the first day. Very comfortable and well made. Would definetly recommend buying this.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Money well spent!",
      "text": "I received the leash quickly and my husband went out and surfed the day we got it, he has surfed for over a week straight every day with it and is very happy with it! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Donelle",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "Support small businesses",
      "text": "Haven’t tried it out yet, but looks great... and well made. Quick delivery. It’s also nice to have my name on the leash 🤙🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen J Majewski",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "The leash seems as advertised. Velcro was secure. ...",
      "text": "The leash seems as advertised. Velcro was secure. Only issue was the memory in the bends which kept looping over on itself but that will fade with time.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley Hunt",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Works Great!",
      "text": "First time trying out this style of leash but it surprisingly can withstand getting tossed around with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "... at Seal Beach with my new leash and I love it so far",
      "text": "Paddled out at Seal Beach with my new leash and I love it so far. I would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanilee",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Very well built leash.",
      "text": "This is a great leash. We took it out last weekend, and it did great.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "great value, high quality materials",
      "text": "I was pleasantly surprised by the bright high-quality plastic the cord is made of. The leash strap is a tad too big for my ankle, but other than that it works great so far. They also include a matching leash loop in case you don't already have one which is super convenient.",
      "rating": 4.0,
      "verified": true,
      "author": "Christian Gimber",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "he was so happy and said it was exactly what he needed",
      "text": "Mr. Steve I ordered this leash for my son, who loves to surf and is a lifeguard. When I gave it to him, he was so happy and said it was exactly what he needed. So if he is happy then sir I am happy too.",
      "rating": 5.0,
      "verified": true,
      "author": "letty",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "... leash for about three months and it has been great. Works as a leash should",
      "text": "I've had this leash for about three months and it has been great. Works as a leash should, and the only minor problem is that the key pocket isn't big enough for my car keys. Definitely fits my bike lock key so I guess the company did that on purpose to promote driving less. In all seriousness I would for sure recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "It seems to be pretty good quality and was easy to attach to my ...",
      "text": "It seems to be pretty good quality and was easy to attach to my surfboard. I received it very quickly after ordering it.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie/Marina del Rey",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Excellent!",
      "text": "Excellent product, very happy with it. Also, the seller communication is outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "MAD026",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Not safe",
      "text": "Safety loop ripped right off while hung up underwater. Do yourself a favor and don’t purchase cheaply made equipment that your life may depend on. Would give it no stars if possible.",
      "rating": 1.0,
      "verified": true,
      "author": "jarred metz",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Five Stars",
      "text": "Awesome leash love the pull tab! Spot on I highly recommend this shock cord!",
      "rating": 5.0,
      "verified": true,
      "author": "marksharky",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "One Star",
      "text": "The product broke after used one time. Wish I get my money back or an exchange.",
      "rating": 1.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Five Stars",
      "text": "Great price. I really enjoy the color. Very comfortable around the ankle. Easy to put on the board",
      "rating": 5.0,
      "verified": true,
      "author": "Sliquerick",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Great quality and the green color is vibrant",
      "text": "Great quality and the green color is vibrant. The leash appears to be everything I'd hoped for and should be perfect for surfing on the Southern California waves.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Five Stars",
      "text": "It’s great to find a short lightweight leash for heavy surf.",
      "rating": 5.0,
      "verified": true,
      "author": "tricia onufrey",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Five Stars",
      "text": "Perfect - great quality, fast shipping - very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Looks great!",
      "text": "Received the leash on time and looks great. Haven't had a chance to try it in the water yet but looking forward to putting my new Ho Stevie leash to work.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter M.",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "It works great. The leash held up beautifully and looks like ...",
      "text": "I got this in record time, Living in Alaska it usually takes at least a month to get things to shipped to me. This took just about a week! I just tried it out this weekend with my father and fiance for some wake surfing. It works great. The leash held up beautifully and looks like it will for a while to come. Over all wonderful, I only gave it 4 stars because I don't like the straight cord as much as a curled, but that might be my fault for ordering a straight cord.",
      "rating": 4.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "This leash was exactly what I was looking for! ...",
      "text": "This leash was exactly what I was looking for! The construction is heavy duty and the swivels are \"as advertised\". Steve followed through from start to finish when the package ended up on my doorstep \"on time\" as promised. Thanks Stevie!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Jones",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Great value!",
      "text": "Perfect! Great price, fast delivery! We bought a 9_ft leash a while back and now a 6ft and they're both awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Leigh",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "AWESOME, WELL BUILD PRODUCT!",
      "text": "AWESOME!! Heavy nylon material backs the super-strong velcro. DUAL SWIVELS (one at the ankle cuff and one at the board tie-in) makes the lease virtually tangle free. Extra thick cord, and the PERFECT COLOR to match my 5'6\" fish!! I would definitely recommend your product. I will definitely buy my next lease (if I ever need one again) from your company! ALOHA!! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory Gluz",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "Great!!",
      "text": "This a Christmas gift for my Grandneice and her dad says it perfect. Very pleased with fast delivery..",
      "rating": 5.0,
      "verified": true,
      "author": "Martispeak",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Good Value Surf Leash",
      "text": "He likes it. He says it's no better or worse than his old Dakine leash. Hopefully it lasts as long as his old one. He goes several days a week, when the waves are good.",
      "rating": 4.0,
      "verified": true,
      "author": "C. P.",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Five Stars",
      "text": "Good leash at a great price. I particularly like the narrow leg strap.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevincent",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Great leash great price",
      "text": "I bought this leash for me son's short board. He has already used it a couple of times and loves it. Works as intended.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori E",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "this is an awesome product at the perfect price",
      "text": "I am incredibly impressed with this construction of this leash, this is an awesome product at the perfect price. I will definitely be buying my leashes from Ho Stevie! from now on. I would buy another one in a heart beat and would highly recommend it to any one else. .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "I love the leash",
      "text": "I love the leash! It has been tangling up on me a little bit but I'm still getting use to it. It was super easy to put on my board with the instruction which were provided by the company. I think you all have great customer service. The only reason I'm giving it a 3 star is because it has tangled up while surfing.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "well made",
      "text": "Love the leash!! Nothing negative to say!! I highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert N.",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Can't beat this leash!",
      "text": "For the price you can't beat it. Quality is on par with more expensive brand name leashes. The customer service is terrific.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael V. Romeo",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Works Great.",
      "text": "I haven't had it long but it looks like it's made of good quality and has a lot of nice features. I'm happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "kbf",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Perfect",
      "text": "Leash was great. The key pocket is a nice touch. The swivel at the cuff and at the board keeps things tangle free.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Mieczkowski",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Surf Leash Ho Stevie",
      "text": "The leash worked well. Bought it for my kids, and they love the quick release handle etc. Like the green color as well. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Mendes",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Excellent quality at a great price !",
      "text": "Ok havent got it wet yet but the build quality is evident right out the box. Seems really top notch. I feel confident it will hold up and excited to try it out. Will update after use.",
      "rating": 5.0,
      "verified": true,
      "author": "andré",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Longboard 9' surf leash",
      "text": "I unpackaged it but haven't used it yet. It looks fine, has a cool comb attachment and key compartment in the ankle strap. I bought it for the color (school bus yellow) to match the pin striping on my red McTavish Original. The leash is translucent, I thought it would be solid color, but it's fine. It looks like it is made with quality. Time and testing will tell.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Really Bad Volcro",
      "text": "The Velcro open on every session since I got the leash and I found myself stuck on the point without my board",
      "rating": 1.0,
      "verified": true,
      "author": "aviv carmi",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Solid leash",
      "text": "Great leash for the price. I usually use DaKines but needed a leash asap. Can't tell the difference other than the name.",
      "rating": 5.0,
      "verified": true,
      "author": "???",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Great product at an affordable price",
      "text": "Great product at an affordable price. Spins freely at the joints and Velcro is holding up so far. Been out 5 times with no issues. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Brookmyer",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Very nice leash. The hieght of the velcro band is ...",
      "text": "Very nice leash. The hieght of the velcro band is a bit shorter than others, so was worried at first, but it grips better than the taller band on my other board. Great leash.",
      "rating": 4.0,
      "verified": true,
      "author": "kpisa",
      "helpful_votes": 0,
      "publication_date": 20160409
    },
    {
      "title": "Leash held up fine in 6 ft barrels on the North Shore of ...",
      "text": "Leash held up fine in 6 ft barrels on the North Shore of Oahu, faka is prime if you gotta ditch your board, or you no make um out of z chube!",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Yeh",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Five Stars",
      "text": "Very nice leash. Really sturdy and it is just the right length.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Sims",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Five Stars",
      "text": "Great leash and great price. Why pay more for a brand name?",
      "rating": 5.0,
      "verified": true,
      "author": "Kbones",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "AMAZING",
      "text": "Amazing leash!!! Best one one the market for an amazing price!!!! Would recommend 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "davide1130",
      "helpful_votes": 0,
      "publication_date": 20180627
    }
  ],
  "product_meta": {
    "title": "Ho Stevie! Premium Surf Leash [1 Year Warranty] Maximum Strength, Lightweight, Kink-Free, for All Types of Surfboards. 7mm Thick (1/4\") 6/7/8/9 Feet",
    "rating": 4.6,
    "feature_bullets": [
      "💪 MAXIMUM STRENGTH surfboard leash won't snap and leave you stranded! Designed and tested in California... we surf every day, and we designed our leashes to withstand rigorous use. 100% Money-Back Guarantee, and 1 Year Warranty.",
      "🏄‍♂️ Available in 6 feet, 7 feet, 8 feet, or 9 feet sizes. We recommend choosing a leash length similar to the length of your surfboard. PERFECT FOR ANY SIZE BOARD - shortboards, longboards, funboards, fishes, or SUPs. Solid black color matches any color scheme, and never gets \"dirty\".",
      "🔑 SUPER COMFORTABLE High Density Neoprene padded 1.5\" ankle cuff won't slide around on your ankle. Store your key in the SECURE KEY POCKET in the cuff.",
      "🌊 STAINLESS STEEL double-swivel system prevents your leash from tangling and wrapping around your legs.",
      "🎁 Leash plug string/cord included."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "16 x 3 x 1 inches; 7 Ounces",
      "Date First Available": "November 3, 2015",
      "Manufacturer": "Ho Stevie!",
      "ASIN": "B017JNO0O2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Surfing",
      "Sports & Outdoors",
      "Leashes",
      "Water Sports"
    ],
    "price": 19.97
  }
}