{
  "website_summaries": [
    {
      "verdict": "If you want a simple, clean pull-on water shoe for water activities, this is it. Basic design with breathable, stretchy upper, grippy sole, and cushioned insole.",
      "pros": [
        "Great protection from sand/rocks/shells",
        "Simple and clean look for all types of water-based activity and water sports",
        "Great for pools, water parks, and even as a shower shoe at the gym",
        "Snug fit – won’t slip off during activity and snugger sock-type fit helps repel sand"
      ],
      "cons": [
        "Shoes can run long in the toes",
        "Construction isn’t as durable as other water shoes",
        "Little arch support"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for swim and short walks",
      "text": "Used in Caribbean. Better than swim socks, perfect for short walks on beach and swims. Shells and seagrass no longer issue. Lightweight and stays on so did not effect swim effort at all. May fail early if one attempted use them as everyday active sneaker but should last if used as designed. Also have a sturdy pair of Keens water shoes to use as everyday sneaker but they are little too heavy to swim with. The two are good pairing. Because of sock-like design, there is little extra room in toe area so if 1/2 size may consider ordering down.",
      "rating": 5.0,
      "verified": true,
      "author": "SanFran",
      "helpful_votes": 2,
      "publication_date": 20181209
    },
    {
      "title": "It appears the thin bottom layer (attached to the thicker sole) is wearing out and tearing of the shoe and looks like it will be",
      "text": "NON-RECOMMENDED. Considering the high price the soles are badly worn very fast, far sooner than other much lower priced water shoes (under $10) on sale at retails stores) I used in the past. Used them walking in the pool just 4 times for roughly 8-hours and already serious wear on bottom. It appears the thin bottom layer (attached to the thicker sole) is wearing out and tearing of the shoe and looks like it will be seriously worn very soon.",
      "rating": 2.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20160418
    },
    {
      "title": "I bought because of the reviews saying they were comfortable enough to wear all day when swimming involves light ...",
      "text": "They fit snug as swim shoes should but with a tall and wide foot, the tension was hard to take more than the first hour. I suppose they will relax some. I bought because of the reviews saying they were comfortable enough to wear all day when swimming involves light hiking. However the soles are a little too thin as I tried them standing on some rocks. Some protection but not enough to use as light hiking. Bet the will be great for the water.",
      "rating": 4.0,
      "verified": true,
      "author": "garysum",
      "helpful_votes": 3,
      "publication_date": 20150521
    },
    {
      "title": "The pair that was sent to me has a very ...",
      "text": "The pair that was sent to me has a very rough inside seams on both shoes that run from the shoe opening to the toe. The seams are so rough that I felt that I was getting blisters on the top of my big toes, just by wearing them inside for a few minutes. I'm sending them back.",
      "rating": 1.0,
      "verified": true,
      "author": "SteveF",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Great Customer Service",
      "text": "Great shoe. Just what I needed for stream crossing as they fit snug and will keep the gravel out. They will provide comfort as a camp shoe as well. But more importantly, I wanted to write about the great customer service from Outdoor Equipped. I had inquired about getting the shoes a little quicker as I had planned a backpack trip for next week. The original estimated ship date would have the shoe arriving while I was in the mountains camping. Michelle in customer service replied promptly and politely to my email. The shoes arrived much much earlier than estimated. Awesome!!! Now I can use them on my trip next week!! Thank you Outdoor Equipped!!",
      "rating": 5.0,
      "verified": true,
      "author": "LeRoy",
      "helpful_votes": 3,
      "publication_date": 20150605
    },
    {
      "title": "They were good on sand",
      "text": "I went to a resort in Cuba and bought these ahead of time. They were good on sand, hard surfaces, the ocean, pools, etc... Very comfortable and kept my feed protected at all times. I usually wear either a 7.5 or 8 mens, and an 8 was the perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Olshansky",
      "helpful_votes": 2,
      "publication_date": 20151227
    },
    {
      "title": "Great water shoes",
      "text": "Do their job, slip on easy, breathable, OK for walking a bit when outside the water.",
      "rating": 5.0,
      "verified": true,
      "author": "legnofdoom",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Just what I needed for water aerobics classes.",
      "text": "Use for three water aerobics classes per week. Fit is a half size large but that has turned out to not be a issue for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip in Cuenca, Ecuador",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Fit",
      "text": "My shoe size is 8.5 and I ordered size 9 water shoes. This shoes are too tight making it almost impossible to fit your feet in the shoes. Dont recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "The stitching across the top rubs blisters on my feet",
      "text": "I bought these to use in the water resistance channel at our fitness center. I used them 3 times and have discontinued using them because the diagonal stripe across the top causes blisters on my feet. It is the seam and stiching that is causing the problem. If they were smooth across the top there would be no problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin H.",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Kayakers take notice !",
      "text": "Good for intended purpose only, like boating, kayaking, surf board, standup board, not walking a lot. Sole insert stays soaked so needs be removed to dry out as does shoe. I landed the yak stepping into 3' of a muddy bank but the shoes didn't get pulled off, cleaned up nice. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "PressureWasherGuy",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "Very uncomfortable fit.",
      "text": "I ordered these for a vacation in which I knew the ocean had a rocky bottom. I wore them only once and they gave me blisters on the tops of my feet. Very uncomfortable fit. I would like to return them but if its too late I will give them away. I am a 13 shoe size and that is what I ordered.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas H Hopkins",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Sorry to say that these shoes run smaller than normal ...",
      "text": "Sorry to say that these shoes run smaller than normal. I bought a size too large and they still did not fit...very tight. I am unable to give a review for that reason. Only to say that the shoes I received ran small as to fit and I was unable to try them. They do seem to be well made.",
      "rating": 3.0,
      "verified": true,
      "author": "RS",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Great fit.",
      "text": "Wear a 13.5, and these feel great! They stay on your feet no matter what.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "These are great when you're going to walk in wet places like ...",
      "text": "These are great when you're going to walk in wet places like the pool or near a lake. Buy one size smaller and its a perfect fit. It does give you foot cramps after an hour since its so flexible and has no sole support.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinnie",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Five Stars",
      "text": "These are perfect!! They are true to size and work amazingly well!!",
      "rating": 5.0,
      "verified": true,
      "author": "Grams",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Great so far",
      "text": "Great so far, haven't been wet yet but nice fit, good soles, should do fine",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "snug.seemed well built.better if came in half sizes",
      "text": "Well if ur a 9.5 order a 9 they are very snug but ok.better than fall ing off.would be nice if came in half sizes would have been perfect",
      "rating": 4.0,
      "verified": true,
      "author": "Chaz",
      "helpful_votes": 4,
      "publication_date": 20150512
    },
    {
      "title": "Great water shoes",
      "text": "I wear water shoes in the creek while trout fishing. I've tried 3 different kinds and these have been the best yet--snug enough to keep the sand and rocks out, great grip.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Roman",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "These shoes are flippin great",
      "text": "These water shoes were PERFECT. We went for a weekend at a lake and we didn’t have to worry about the sharp rocks at all. Not to mention they fit great and were rather comfortable. They dried pretty quickly too! Actually blown away by how much I liked these shoes. I feel silly. Lmao",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Very comfortable and looks great.",
      "text": "Slightly tight but very comfortable. Great traction. Looks great. Very stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "EagleMan",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "but it's way better than having cuts in my feet due to the ...",
      "text": "Everytime I wear them I end up having blisters in the back of my feet, but it's way better than having cuts in my feet due to the rocks, For that purpose, they are great. Ill try a trick a friend just told me, vaseline around my uncle. ;0)",
      "rating": 4.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Love it.",
      "text": "Specially ordered for my trip to Kalahari Resort. Fits great. Absolutely loved it. Lightweight but solid construction. Very comfortable and offers very good grip.",
      "rating": 5.0,
      "verified": true,
      "author": "MWorks",
      "helpful_votes": 2,
      "publication_date": 20150909
    },
    {
      "title": "Good Value & Fit",
      "text": "Snug fitting and flexible with a sturdy sole and decent arch for a surf shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Willard",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Good water shoe",
      "text": "Was in Rhode Island a lot of the summer and these worked great for around the docks. On and off the boat for clamming. Shoes are always a little tough if you can't try them on but these were as expected.",
      "rating": 4.0,
      "verified": true,
      "author": "James ConWorth",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Great",
      "text": "Great grip and feel! Perfect for boat, solid white bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "😀",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Good shoe for walking the beach and surf",
      "text": "Good shoe for walking the beach and surf. None of these will have much arch support -- just the nature of the beast.",
      "rating": 4.0,
      "verified": true,
      "author": "Eagles Wings",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "size matters",
      "text": "Wasted money. Shoe is too long. I was overseas and upon my return, I could not return because the return period had expired.",
      "rating": 1.0,
      "verified": true,
      "author": "herbert f gonzalez",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "their great, don't make my feet too hot",
      "text": "This is the 2nd pair of speedos I've bought. I use one pair for kayaking, their great, don't make my feet too hot, and the 2nd newer pair in the garden. 2nd pair feels tighter, probably will be fine after they get broken in.",
      "rating": 5.0,
      "verified": true,
      "author": "F C.",
      "helpful_votes": 0,
      "publication_date": 20151224
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable to wear. Only drawback is there's no air flow inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Junfang Deng",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Fits good and protects my feet from Conch shells",
      "text": "They are what they are. Wet Shoes. Fits good and protects my feet from Conch shells.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Awesome",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Three Stars",
      "text": "did not wear yet keep them for my next vacation to cancun",
      "rating": 3.0,
      "verified": true,
      "author": "Emilio Cesar Cuellar",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Five Stars",
      "text": "good quality, looks to be more durable than other less expensive comparables",
      "rating": 5.0,
      "verified": true,
      "author": "Ron George",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "but worked excellent for my week trip to Mexico",
      "text": "Have not used extensively, but worked excellent for my week trip to Mexico.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lion",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "does take a while to dry and sand gets in pretty easily but made it through a 4+ mile hike ...",
      "text": "fit well, holds up well in and out of water, does take a while to dry and sand gets in pretty easily but made it through a 4+ mile hike and did its job.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "or better yet, wear them until they dry",
      "text": "As with all beach shoes, the have a breaking in period to conform to your foot. It helps to wash them before you wear them and let them air dry, or better yet, wear them until they dry, just like Levi's.",
      "rating": 5.0,
      "verified": true,
      "author": "Vickii Darnall",
      "helpful_votes": 2,
      "publication_date": 20150927
    },
    {
      "title": "Four Stars",
      "text": "Fits fine for normal use, but was almost sucked off while whitewater rafting.",
      "rating": 4.0,
      "verified": true,
      "author": "KevinW",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Four Stars",
      "text": "Size just a1/2 smaller got a size 9 should got a 10",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "These wear comfortably, no chaffing or skin irritations",
      "text": "These wear comfortably, no chaffing or skin irritations. The elastic around the angle area does a great job keeping the sand out. Able to remove sole padding at the bottom, clean them or replace them with something better.",
      "rating": 5.0,
      "verified": true,
      "author": "thewayiseeit240",
      "helpful_votes": 0,
      "publication_date": 20160216
    }
  ],
  "product_meta": {
    "title": "Speedo Men's Water Shoe Surfwalker Pro 3.0 - Manufacturer Discontinued",
    "description": "The surf walker pro 3.0 takes guys from sea to shore in total comfort. It features a stretchy pull-on upper with mesh insets for quick-dry breathability and a secure fit. Inside, a cushioned insole provides great impact protection; outside, speedo’s s-trac™ outsole streams water away from the shoe, enhancing direct surface contact for even better traction and slip resistance.\n\nRelaxed lifestyle footwear for the beach and beyond by Speedo - #1 swim brand worldwide! This is a super comfortable slide sandal with a seaweed message footbed sure to make your foot say \"ahhhh\"! Great athletic styling suitable for all day wear. Great as a shower shoe as well!",
    "rating": 4.1,
    "feature_bullets": [
      "80% Neoprene/20% Sandwich Mesh",
      "Imported",
      "Synthetic lining",
      "Pull On closure",
      "Pull-on water shoe with durable four-way stretch upper, air-mesh interior panel, and s-trac rubber outsole"
    ],
    "categories": [
      "Men",
      "Athletic",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Water Shoes"
    ],
    "price": 27.99,
    "specifications": {}
  }
}