{
  "website_summaries": [
    {
      "verdict": "Versatile wear, soft material, and variety of looks make it the best value on our list – you won't find a more affordable, comfortable option.",
      "pros": [
        "Its hood and soft cotton make it versatile for various weather conditions",
        "Owners comment their dogs are comfortable wearing it",
        "Comes in a variety of fun colors and sizes for dogs with chests up to 21.7 inches"
      ],
      "cons": [
        "The most common complaint among consumers is its small fit – some recommend going up 1 to 2 sizes",
        "Not for very large dogs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Rosy looks So darn cute",
      "text": "This is one of the best hoodies. It’s soft and stretchy and covers up to her tail. Keeps her warm and stylish. I bought a large for my 8lb toy poodle. Her measurements are: girth 13 inches, back length 13inches and neck 9 inches. It was a perfect fit with room for her to grow into. The only thing I wish, that dog clothes manufacturers make a hole in the back for a harness. I only use harnesses. So I have to dig into it to attach and it stretches collar. But most pet clothes don’t have harness holes. I make my own.",
      "rating": 5.0,
      "verified": true,
      "author": "geli",
      "helpful_votes": 106,
      "publication_date": 20180220
    },
    {
      "title": "Absolutely love this puppy shirt",
      "text": "Absolutely love this puppy shirt. As my boys have grown we have had to get bigger ones because they just look so adorable. They are about 11 & 12 lbs and XL fits great. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Cole",
      "helpful_votes": 103,
      "publication_date": 20170909
    },
    {
      "title": "Adorable!",
      "text": "I love this little hoodie it's the cutest thing ! I have a female pom-chi who weighs about 8 pounds & I ordered her a large as all the reviews I read said to order a size larger than you think you need , it fits well & looks adorable but when I order more I think I will try a medium for her instead . Definitely will be purchasing more colors I love this on my pup !",
      "rating": 5.0,
      "verified": true,
      "author": "Rdaw",
      "helpful_votes": 79,
      "publication_date": 20170604
    },
    {
      "title": "Absolute love and relaxing for my pup",
      "text": "So my Shiba Inu is a puppy and weights about 12 pounds right now, pretty small but she fit an XL perfectly. She's somehow calmer in this? It's like those storm vests for dog, and she is way more relaxed when she puts it on. Not why I bought it, but I love it and am contemplating ordering them in more colors!",
      "rating": 5.0,
      "verified": true,
      "author": "C and E",
      "helpful_votes": 66,
      "publication_date": 20171115
    },
    {
      "title": "Love, love",
      "text": "Love, love, love. It's our favorite sweatshirt to wear for our daily walks. Got one in each color. We got the XL for our 11 lb Shihtzu.",
      "rating": 5.0,
      "verified": true,
      "author": "DogLoverTop Contributor: Pets",
      "helpful_votes": 88,
      "publication_date": 20161029
    },
    {
      "title": "I love how the fabric feels",
      "text": "These are meant for small dogs btw! I ordered a L for my friends chihuahua which fit perfectly. She's a tiny dog as well. I love how the fabric feels, it inside is super soft and warm. I have the exact same hoodies for my dogs as well, sadly, one one likes to wear it here and there. They're really cute and I think it's something great to have and show off how cute your tiny dogs are in these.",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla Do",
      "helpful_votes": 76,
      "publication_date": 20170315
    },
    {
      "title": "Great fit, looks awesome!",
      "text": "Got the grey/black classic for my basenji mix to help keep her warm in the chilly months. Fits her perfectly and looks great! Love that it's cotton but since the fit is perfect, I will be washing it in cold and line drying so it won't shrink. I ordered the XXL and her measurements are 13\"neck, 15\"back, 21\"chest. Weighs 20lbs. -- product clearly not meant for large dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Lara D",
      "helpful_votes": 69,
      "publication_date": 20161227
    },
    {
      "title": "Love it!",
      "text": "I don't usually write reviews but I felt obligated to write one for this one. I absolutely love this jacket. The material was great and it looked super cute on my dog. I bought it with the intent to warm her during her trips to the dog park. Everyone there complimented her jacket and asked where to buy one as well. I ordered my dog an XL and it fit her perfectly with enough room to allow her to run without it being uncomfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 68,
      "publication_date": 20170325
    },
    {
      "title": "He loves it so much!",
      "text": "I was looking for a nice, cool clothing for my poodle, who's name is Hodu, and found this for him! He doesn't feel itchy compared to some products that the cotton is not soft, but this one has a real soft texture inside and he looked comfortable. Now he wears everytime he goes out. Thanks a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia Chang",
      "helpful_votes": 69,
      "publication_date": 20170209
    },
    {
      "title": "Properly size your pup for correct fit!",
      "text": "This particular listing is for small dogs. I ordered an XL for my small dog but it was far from fitting her. I gave it away to family who has a dog it fit. The product was very well made and it’s a really cute dog sweater. The only downfall was sizing but I admit that I just guessed when ordering. It only goes up to XXL for this listing and I’m sure it still wouldn’t have fit. My dog is a rat terrier mix so she’s on the small side, but not small enough for this product unfortunately.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanine M. Olguin",
      "helpful_votes": 28,
      "publication_date": 20181202
    },
    {
      "title": "The sizes run super small, I bought a medium for my 12 ...",
      "text": "The sizes run super small, I bought a medium for my 12 lb maltipoo and I had to return it I got an XL and it fits perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Xavier Saenz",
      "helpful_votes": 54,
      "publication_date": 20170126
    },
    {
      "title": "Go by the size chart.",
      "text": "I bought the yellow/green version of this Adidog hoodie. My 10 lb Miniature Long Haired Dapple Dachshund loves it. I bought the size Large according to other reviews and the size chart given. Def measure your dog if you're unsure. The size chart is very accurate in my opinion. Great quality, no flaws or damages I could come across. Sadly it's still too hot in Nevada for him to wear it, but he loves how cozy it is. :-) I washed it on a regular cycle in cold water, and hung it to dry. No shrinkage. Highly Recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 28,
      "publication_date": 20180820
    },
    {
      "title": "Love this sweater!",
      "text": "It looks great on my dog Oso. I got a size XL and it's a little tight on him, but that's my fault should have gotten an XXL. I plan on getting more in the other colors for my other dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr.Mrs.Adame",
      "helpful_votes": 60,
      "publication_date": 20170202
    },
    {
      "title": "Definitely recommend!!",
      "text": "This sweater is adorable! Every time my puppy wears it he gets so many compliments. I have a small Pomchi and I got a medium because of the reviews. It is a little big on him but he still able to wear it. He might have been able to get away with a small but because I ordered online it's better to be safe than sorry.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlie",
      "helpful_votes": 56,
      "publication_date": 20161026
    },
    {
      "title": "Five Stars",
      "text": "Super soft and cute! My frenchie Milky loves it 😊 and it's just so stylish 😉",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanine Valerio",
      "helpful_votes": 53,
      "publication_date": 20170124
    },
    {
      "title": "Cute ,cute ,cute",
      "text": "I like this sweater, will be ordering more it's so cute",
      "rating": 5.0,
      "verified": true,
      "author": "janice",
      "helpful_votes": 47,
      "publication_date": 20170109
    },
    {
      "title": "Super Cute",
      "text": "Super Cute!!! Absolutely love this hoodie...I've purchased the red, grey and black. 2 size L and 1 XL. The size large fits my little 11 week old mini schnauzer pretty well. He will have another few months to wear this. The XL he will have to grow into although it's not super big right now; just the tail end is lower than I'd like for right now. Overall, I am pleased with the quality and product as a whole.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20170123
    },
    {
      "title": "Winter dog sweatshirt",
      "text": "My little dog loves his shirt. He gets cold easy, fit was perfect, used the measurement chart to pick the size.",
      "rating": 5.0,
      "verified": true,
      "author": "dfausset",
      "helpful_votes": 33,
      "publication_date": 20161116
    },
    {
      "title": "Great buy!",
      "text": "I love this sweat. My French Bulldog looks soooooo cute in it!! The only thing I wish it had was a hole on the back for the leash to slip through for dogs that wear harnesses. If it had that, I would of given it 5 stars. Regardless, for under $9, this has been great for the cold nights and going outside during winter storms.",
      "rating": 4.0,
      "verified": true,
      "author": "Cate8818",
      "helpful_votes": 18,
      "publication_date": 20170317
    },
    {
      "title": "Good Looking Sweater",
      "text": "I have a 12lb shitzu, 7 months old... Chest 17in / Neck 13in.. I bought the pup an XL and its a bit snug on his neck but it fits his body great. Will most likely buy again but in XXL. The material doesn't feel cheap, the letters look and feel like they can fall off, and the hood is a bit to small for his head but no complaints there since my dog hates anything on his head. Hope this helps...",
      "rating": 4.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 39,
      "publication_date": 20170224
    },
    {
      "title": "Crappy Fabric",
      "text": "I buy a new hoodie for my boy every year and this particular one is made out of this horrible synthetic fabric. He’s always so excited when I show him the new one and wants to try it on. It’s stiff and there’s no stretch. I will not buy this particular one again (the red one shown in the picture). I bought him a red one a few years ago that was made out of cotton like the gray one he’s wearing in the picture. After a few years it started to pill, so I thought I was buying the same one. Hate it.",
      "rating": 1.0,
      "verified": true,
      "author": "S. L. Graves",
      "helpful_votes": 6,
      "publication_date": 20190104
    },
    {
      "title": "Writing comes off after one gentle wash!",
      "text": "I washed this as a delicate item and the writing is all cracked and \"og\" at the end and one of the bones is compeltely missing. Unfortunte because it is a cute design. I also ordered an XL for my 8 pound maltese and that fit pretty good (maybe even a tad small), so PLEASE order bigger than you think.",
      "rating": 1.0,
      "verified": true,
      "author": "Alyssa Kelley",
      "helpful_votes": 7,
      "publication_date": 20190205
    },
    {
      "title": "Shrunk and Falling Apart",
      "text": "We bought this for our chihuahua for Christmas and he thoroughly enjoyed it for the first few days. We washed it shortly thereafter, but did not dry. Two of the letters came off and he looked visibly uncomfortable. Poor boy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190216
    },
    {
      "title": "GARBAGE FROM CHINA",
      "text": "This dog sweatshirt is crap. First cold water wash in washing machine, than air dry, decal pealed off by itself. Do NOT BUY!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Marge Jones",
      "helpful_votes": 7,
      "publication_date": 20190220
    },
    {
      "title": "Crap!",
      "text": "Extremely unhappy with this product. I ordered a large and got like a extra extra small. Almost the size of my hand.",
      "rating": 1.0,
      "verified": true,
      "author": "Lydia",
      "helpful_votes": 8,
      "publication_date": 20190222
    },
    {
      "title": "Cute but definitely NOT 100% COTTON!",
      "text": "I still like these on my dog. They are very cute. Keep in mind that they run VERY small & are NOT 100% COTTON! They used to be, but not anymore, & they should correct the info & title. They are polyester and the letters are screen printed on, not imbedded into the fabric like the old cotton ones. My chihuahua is just 5 lbs, would normally take an extra small here in the US, but a small fits her.",
      "rating": 2.0,
      "verified": true,
      "author": "izzysmommom",
      "helpful_votes": 3,
      "publication_date": 20190126
    },
    {
      "title": "Great for Small Dogs",
      "text": "I have a hard time finding clothes for my yorkie that is 3.5lbs and the small fit him perfectly not too loose and not too snug either. It’s super cute and fashionable. Material isn’t anything special but seems to keep him warm enough for the winter in California wouldn’t recommend for super cold climates. It seems to be put together well and I don’t see why it wouldn’t last awhile. Washed it already as well and seems fine with no fading. Would recommend for smaller dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Lia",
      "helpful_votes": 2,
      "publication_date": 20190210
    },
    {
      "title": "Desired Fit Determines Size",
      "text": "Sizing: My long haired Chihuahua is about 9lbs, tall and slim. His chest is about 15 inches around, so I figured I'd try the Medium. It fits him, so the size chart is accurate, but it is a close fit so there is definitely no room for anything under. The material does have a bit of stretch to it, but I'd recommend going the next size up if you don't like a fitted look or were thinking of putting a harness or shirt underneath. The sweater itself is great quality and a vibrant, beautiful color. The material is thick enough for a cool day on its own, or to layer under a jacket in the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Alisa love",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Adorable, fashionable, keeps her warm!",
      "text": "I have a Mini Schnauzer who's a bit of a diva when it comes to the temperature. She always wants to be under blankets, and though she loves going outside, she shivers the entire time when the temp drops below 50°. We have other jackets and sweaters, but this one is literally the cutest thing! She usually gets upset with me when I put clothes on her, but she seems to really love this sweater almost as much as I do 💙 I followed the size chart, which seemed a little crazy ordering an XL for a 12lb dog, but it fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "SJoyner",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Err on the side of a larger size. Very nice product.",
      "text": "This sweatshirt is adorable, and seems to be nice and warm. My Maltese /poodle mixed breed is old and very thin at 8 lbs. I measured carefully and his chest is 14.5 and his back is 12. I choose to get large even though I was worried it would be too big in the chest but it's perfect. I am submitting a photo (he's fine, he's just a really old sweet foster dog who doesn't have eyes or teeth and his tongue sticks out and he's very sleepy.)",
      "rating": 5.0,
      "verified": true,
      "author": "Laine Wing",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Careful with sleeves. Good purchase.",
      "text": "I bought a XL for my 19lb. Min Pin. Yes he over eats and is on the big side. Thanks to the other reviews I was able to just guess at size. Cute sweater. My complaints would be 1. As soon as I put it on him the sleeve tore a little bit and I'm a pretty gentle person. It is something that only needs a couple stitches to close up again. 2. The sleeves do not slide on easily like most dog clothes. The placement with the arms is a bit weird or it could be that the sleeves are longer and fit almost like sweats with the elastic at the ankle. Besides that I'm happy with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great...except the fabric pills terribly",
      "text": "I want to love this sweatshirt because it’s so cute, comfortable, and warm...but it has a major flaw: the fabric pills with minimal use. This is nothing you can keep up with a sweater shaver, or you’ll be shaving your dog’s sweatshirt every day. This photo is after day 2 of wear, and we’re talking minimal wear. She didn’t wear it to the dog park. Overall, it suits the purpose of keeping my dog warm, but it’s definitely a play sweatshirt because it looks pretty raggedy.",
      "rating": 2.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Adorable shirt, great quality",
      "text": "This shirt is fabulous! The quality is so much better than I hoped for. It’s a super soft, thick, warm sweatshirt. If I could have gotten myself a matching one I would have. I have a basset hound and nothing fits him right because he is so long and short but this shirt is cut true to size. I got a size up and it fits him nicely. It’s long enough on his back and the chest fits nicely without being too snug. The sleeves are also a good length. They hit just below his elbows. Perfect! I already ordered a matching one for my sisters dog.",
      "rating": 5.0,
      "verified": true,
      "author": "ReadingRover",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Runs very small",
      "text": "I got this for my Morkie (Maltese - Yorkie mix) who weighs 6 pounds and while it is cute on him I am not sure I would order it again. Based on the other reviews I went with a medium instead of a small. The medium was a good size for him however it is almost too small. The hood does not stay on his head and the back end rolls up his back pretty easily. If I ordered this again I would consider a large, although I would worry that it would be too big on him. I will add pictures to this review when I get a chance.",
      "rating": 3.0,
      "verified": true,
      "author": "jopmav",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "LETTERS FALLING OFF",
      "text": "Falling apart!!! HORRIBLE! RUNS SMALL!! XXL bearly fits our male frenchie",
      "rating": 1.0,
      "verified": true,
      "author": "Chris&Krystal Towne",
      "helpful_votes": 6,
      "publication_date": 20181011
    },
    {
      "title": "These run a bit small",
      "text": "I have bought these before apparently made by another manufacture. The two I got this time were a small and a extra-large, they do fit just not fit well, they are usable but too tight. (I had bought a small before but it is larger than this one.) The dogs look like they are in a sausage casing, not sure if they will even fit after they are washed. I measured the dogs as instructed and as I had done before, but these seem to be about 1 - 1 1/2 inches smaller around than as expected.",
      "rating": 3.0,
      "verified": true,
      "author": "CherTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "So stylish - so cute for my furry sond",
      "text": "This blue dog sweater was originally for my baby Rottweiler (3 month & 20 days old) puppy at the time. It was the perfect size for him he looks so handsome in it. Unfortunately he quickly grew out of it however, I was able to pass it on to my 2.5 year old miniature Schnauzer. He’s so absolutely adores them both he knows that they are his and he gets so excited when he hast to put them on. 😊. After washing them several times the material does start to fuss however I believe if I get one of those fuzz removal device is it should be in good condition.",
      "rating": 4.0,
      "verified": true,
      "author": "MoeMoe",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Perfect Sweatshirt!",
      "text": "I have bought my Dachshund many sweatshirts over the years and this one is the best! The sleeves are a great length (others were too long and he'd step on them). It's easy to put on and he looks SOOOO cute! I'm sorry I don't have a picture to prove! Pay attention to this manufacturer's sizing chart as my handsome boy wears a size large and he's only 12 pounds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181101
    },
    {
      "title": "Runs very small!",
      "text": "I bought this for my chihuahua/terrier mix she is a smaller medium size normally fits in size small or medium and I had to buy the XL size for her for this hoody and it fits perfect. But so the sizing is very off, my small dog shouldn’t be in a XL so if you were buying for a big dog I don’t think any would fit. Runs very very small! Other than that the material is really nice and super soft the little hood it cute my dog loves it and the pink color is adorable!",
      "rating": 5.0,
      "verified": true,
      "author": "Missy!",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Arrived with a hole in the seam",
      "text": "I’ve ordered 2 of these in the past for 2 of my dogs and they were awesome, I loved them so when I went to order one for my 3rd dog, I made sure to order exactly the same. The first two were awesome, good quality, I ordered them over 2 years ago and they’re still holding up really well. This 3rd sweatshirt, right off the bat arrived with a hole in the seam, and the overall quality (other than the hole) was not nearly the same as the first 2. Maybe I just got a dud? But I was super disappointed",
      "rating": 3.0,
      "verified": true,
      "author": "Alyshia Fournier",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "For the sporty dog",
      "text": "Perfect to keep my miniature schnauzer warm in the winter in the cool house. It is his \"daytime\" sweatshirt and he wears the Adidog with pants for his PJs. Note that this one goes \"over the head\" while the version \"with pants\" has snaps under the chest. This one fits better for potty-ing (thus daytime use) while the \"with pants\" version sometimes gets wet and needs to be pulled off his tail (covers more of body for the night). Same size in both.",
      "rating": 5.0,
      "verified": true,
      "author": "Fun in the sun",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "RUNS SUPER SMALL ORDER 2-3 sizes up",
      "text": "I gave 4 starts because this does run super small. I read the reviews so I ordered a large for my 8 week old French bulldog and it will only fit him for a month if that. It was way smaller then you would think. I was thinking it would be a little big on him to get the Large but it wasn't. I recommend ordering 2-3 sizes up. Overall it is a great material. Super soft and good quality. Price matched what I was expecting! I would buy again. I wish they had some even bigger sizes thought. I cant imaging a big dog wearing this. Like I said my frenchie puppy fit a large",
      "rating": 4.0,
      "verified": true,
      "author": "emily  costa",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "NO HOLE FOR LEASH; 2 SIZES TOO SMALL; NOT SWEATSUIT MATERIAL.",
      "text": "If your fog falls within the listed measurements you should go 2 sizes up if you want it to fit a bit big like a sweatshirt & if you just want it to fit and not be absolutely too small go 1 size up. The material of the one sent to me is not standard sweatshirt material, but is stretchy thick polyester type of a sweatsuit material. What really disappoints me and prevents me from just ordering a bigger size is that there’s no hole for a leash to fit through... ridiculous.",
      "rating": 3.0,
      "verified": true,
      "author": "karlee harris",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Perfect for my dog",
      "text": "I read all reviews about this product before shop and I realize that a lot of people get a wrong size for its dogs. So I made sure to check all the sizes like length, neck, chest, etc and compared with the real size of my dog. I ordered L size for my 9.5pounds poodle/maltese toy dog, and it fitted perfectly. She is sooo thin but when she has a long hair, looks a little bit fatter, so this size was really perfect for her. I even could have bought a XL size, I'm pretty sure also would be good for her. She looks so pretty and confortable with her new sweater. I really recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "NEEDS A HOLE",
      "text": "I truly love it but one problem, it needs a hole to put the leash to go through for me larger dog it kept rising up , I have a body leash its not around his neck . I am going to take to the cleaners for them to cut it . If it had i would have rate a 5",
      "rating": 4.0,
      "verified": true,
      "author": "mexveracruz",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "disappointed",
      "text": "The first time she wore this it got slightly damp from the grass. I laid it out to dry and it had mold spots on it. never wore it again. its adorable on and prettier than the pics but no way would I put something with black stain spots on my pup.",
      "rating": 1.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 6,
      "publication_date": 20170725
    },
    {
      "title": "Great quality love it",
      "text": "I absolutely love it. I did have to buy an XXL. My shih tzu Terrier mix is about 24lbs. He is very solid. It fits him comfortably. The quality is great it is very soft and thick material. My dog has glided all over the carpets and outside in the grass. One hour in and he is definitely breaking it in. He is a rescue dog who was left outside so he just has to get used to wearing clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "Renée",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "Perfect Fit For Bella & Chloe",
      "text": "Bella is a 7.5 lb Yorkie and Chloe is 5.5 lbs. I purchased the Large for Bella and the Medium for Chloe - they run slightly small as the listing and some reviews indicate. I typically would have gotten a medium and small (respectively), but I'm glad I heeded the reviews. These fit them just right. The material is soft and seems to be very good quality. We're all really happy with these doggy hoodies! :)",
      "rating": 5.0,
      "verified": true,
      "author": "FlyGirl",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Fits very small, short and no warmth",
      "text": "My dog is typically a medium in sweaters...but having recently ordered off somewhere else it did not fit. So I went for an XL. It fit perfectly... I would of gone with XXL to make it baggy for her. But the XL is an alright fit. I dont recommend the hoodie for dogs. The inside is smooth, feels like a sports Jersey. No warmth for the dog ... also it fits a tad short on her back. ...not long enough.",
      "rating": 2.0,
      "verified": true,
      "author": "RocketGracie",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Rockin' My Adidog Sweatshirt!",
      "text": "Love it! So soft and cute and affordable! Came really fast and just as expected and pictured! I did have to reorder a larger size. My Havanese is 2 years old and 18 lbs, the XXL is the perfect fit! I ordered M first time and was far to small. Speaking of the return, it could not have been easier, I love this and will buy more!",
      "rating": 5.0,
      "verified": true,
      "author": "Jungle Jolene",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "It's Okay as a Temporary Solution Only",
      "text": "In The Beginning This Hoodie Was Amazing For my Baby And He Also Seemed To Love it But After The First Wash it is Completely Ruined. This is a Case of You Get what you pay for. The Material is Soft and Comfortable For Your Fur Babies But Very Cheap and Low Quality. I washed it once and The Stitching Came Undone and it Will Definitely Never Be The Same Again Nor Will it be comfortable or Suitable For my Poor Baby. If you are Looking for a Quick Fix Solution This is it but by No Means Should you Expect This To Last Very Long.",
      "rating": 4.0,
      "verified": true,
      "author": "Moonchildmonarch",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "THE CUTEST!",
      "text": "I got this for my new black lab mix puppy and OMG its a dream. I followed the size guide and even at 6 pounds she needed a medium which I was surprised about. And of course she is growing fast! I may have to order the next size up! Its great for these cool spring days since she is so small--all the other sweaters out there seemed too heavy for the season. Its very soft, slightly stretchy and she seems very comfortable to wear it. And its just too freakin' cute!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Every hair sticks to this fabric..",
      "text": "This is advertised as cotton, I will have to double check that... By the time we walked out of the door, it was covered in dog hair... No rolling around, this is just from being placed over his head.... None of his other sweaters are like this... Are clothes don't look like this... nasty.. Forewarned..",
      "rating": 1.0,
      "verified": true,
      "author": "sherry sweeney",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Love",
      "text": "Only thing I’d change is the length of the shelve. I have a dachshund so it’s a little difficult finding something that totally fits. This is the second o e I ordered. First one for ten bucks but from a different distributor. This one seven bucks and they both are exactly the same. Very nice. Only got a new one cause I misplaced the other",
      "rating": 5.0,
      "verified": true,
      "author": "Serena D.",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Puppies deserve to be flexin too",
      "text": "This is the cutest thing ever! One thing to be aware of: size up. Like a lot. I was planning on getting a small for my brothers’ new frenchie puppy and ended up getting a large after reading reviews. It fit him with room to grow. With that said, if you have a big dog get the largest size possible. Other than that, super warm, stylish and cute!",
      "rating": 4.0,
      "verified": true,
      "author": "Macie Eddy",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Vibrant color",
      "text": "No stretch what so ever...had I known would have ordered a much bigger size for my pre mature poodle who is small but this is still too small for her. It rides up on her back as well as the neck area was very narrow had to cut a V shape hole for easier access for her head. The color is excellent.",
      "rating": 3.0,
      "verified": true,
      "author": "Ari",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "This is trash. Don’t bother.",
      "text": "I wasn’t expecting much from an $8 item, but this product is just horrible. The sleeves are not equal lengths One sleeve is a full inch shorter than the other! The stitching is incomplete. It’s not even fully sewn! And the material is terrible. It’s not a light fabric. It has no stretch whatsoever, and isn’t even slightly breathable. Definitely returning this ASAP.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Thomas",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Good looking hoodie that gets compliments",
      "text": "The weather is getting colder here and we want to stock up on warmer clothes for our shit tzu. Most of the clothes are not a good fit because she tends to have a longer length. It covered most of her back unless she stretches and with an overcoat, it keeps her pretty warm when walking outdoors. She received several compliments and everyone finds the brand name funny.",
      "rating": 5.0,
      "verified": true,
      "author": "HF",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Runs VERY small.",
      "text": "These are so stinking cute! We bought one for our little 8 week old puppy! I ordered the medium so he had a little growing room. I am happy we ordered the medium however, because a small wouldn't of fit our 8 week old pit! These run VERY small. I saw the reviews before we ordered, and was very hesitant to ordering the medium because I wanted to use it now (while its cold outside) but it most likely wont fit him in another week or 2. To put this sizing to the test, other dog clothing brands, our pup is wearing a small (with extra room to grow) but fits mostly in a xs for a perfect fit.",
      "rating": 3.0,
      "verified": true,
      "author": "Kaylakax3",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Super Cute!",
      "text": "Super cute! My 6 lb Chi is hard to get a good fit for, but this fits her pretty good. She doesn’t try to get it off her body like some of her other clothing. Keeps her warm as she’s been shivering cold in winter. Wish the hood was bigger. Doesn’t really fit her head. She has big ears and I don’t want to break her cartilage down so leave good down on hers.",
      "rating": 5.0,
      "verified": true,
      "author": "Marjamo",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Ordear size or 4 x  bigger than u expect",
      "text": "I now had to order 2 Medium and large neither fit my 10 lb dog seriously a large is to small.. Large size was more like small or extra small...ordear size or 4 x bigger waist of a week buying waiting returning then rebuying returning nope il.pass looks cute but even material wont stand up to roughness and looks lile will shrink 1st wash it is for a toy doll",
      "rating": 1.0,
      "verified": true,
      "author": "bobby digital",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Keeps my part Yorkie warm",
      "text": "The hoodie fits my 6 pound Yorkie mix perfectly. There was enough stretch in the material to easily pull his front legs through the front sleeves. It keeps him warm. It’s 27 degrees outside and he’s been out chasing rabbits for the last 3 hours. The bottom covers the front of his chest, but it’s cut in the back to allow him to pee without spilling onto his clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Takenaka",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "My pup loves it! but do your homework on the size",
      "text": "My dog loves this sweatshirt. NOTE my pup is usually a small or medium (13 lb toy dog). After reading other reviews, I bought a 2XL. Fits perfectly but I would have never bought him that size without reading others’ experience. Unlike other doggie sweatshirts/jackets, they thought about the dog (especially my boy pup in pink) needing to use the potty and have not connected it to the back legs. It’s great for protecting his belly and front legs from the snow where he usually gets painful snowballs.",
      "rating": 4.0,
      "verified": true,
      "author": "Carly",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Such a cute little hoodie",
      "text": "I cannot believe how perfect this little hoodie is. First of all, the material is soft, very sturdy, just like a hoodie that I would wear. I have a 6 1/2 pound Maltese Puppy, and the large fits perfectly, with a little room for him to grow. He’s super comfortable in it, and it’s pretty easy to put on. This is definitely going to be cute and keep them warm in the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "LNG",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "RUNS VERY SMALL BE AWARE!",
      "text": "I purchased this for my small dog, we are going camping where it gets cold at night, and I thought this would be awesome! I purchased a Medium size and it did not even go over here head!!!! Crazy small size for sure. I ended up getting something cuter and less money at Pet Smart, in a size Medium, that actually fit my dog!!!! Please if you are going to order this, get bigger size because it is very small.",
      "rating": 2.0,
      "verified": true,
      "author": "W H",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Didn’t even last 6 hours",
      "text": "My dog wore this on one occasion for about 6hrs. We noticed it had already started cracking. After only 6hrs. It also runs very small. I’m bummed because I loved the idea of this and wanted to love it so bad, but the quality is just terrible for it falling apart after not even having for 12hrs. I would advise other shoppers to scroll past this one and spend your money on better quality material.",
      "rating": 1.0,
      "verified": true,
      "author": "Shannon ",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Very nice quality ⭐️⭐️⭐️⭐️⭐️",
      "text": "I have a Bichon Frisé and he’s 14 pounds. He looks gorgeous in this hoodie! I got him the track suit too. He’s not spoiled. He’s well taken care of. The way I would like to be taken care of if I were a fur baby. These aren’t made cheap either. I’m impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Great quality and actually fits",
      "text": "These are the only dog shirts/sweatshirts that actually fit AND are really good quality. I purchased six of these - two for each dog - and I'll probably get more if other colors ever come out. Also, they didn't shrink in the wash or fade in color. They stay on and keep the pups warm. From my experience, I recommend these Adidog sweatshirts.",
      "rating": 5.0,
      "verified": true,
      "author": "MGTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Would purchase again.",
      "text": "I have two dogs and this fits my smallest dog perfectly. It was a bit snug on my bigger dog. I’d go up a size for him. Although I measured him, I think he’s just not proportioned the same way most dogs are. He’s rather long, has a long neck but his chest is smaller, etc. I’d definitely purchase again. They keep our little guy warm! He loves his sweatshirt.",
      "rating": 5.0,
      "verified": true,
      "author": "TealSpirit78",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Your dog will thank you!",
      "text": "I was scared to order this because I thought the quality must not be good since it's so inexpensive. I was wrong though. I have a Chihuahua puppy and he is constantly searching for a blanket to keep him warm. Once I put this on him he is much happier and more comfortable. He weighs about four pounds and I got him a small. It gives him a little room to grow while still fitting comfortably.",
      "rating": 5.0,
      "verified": true,
      "author": "littleboysmom",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Wonderful Hooded Activewear!",
      "text": "The two I ordered were absolutely great! Very well made and totally adorable on my two dogs. The material was a very good quality and loved the active look of the little hoodie sweatshirt. Unfortunately, I ordered the wrong sizes and had to return them. It's horrible trying to fit miniature dachshunds! If the body fits, the length is too short. If the length fits, the body is too big. Maybe one day, a manufacturer out there will make these adorable hooded sweatshirts especially for miniature dachshunds!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Ordered XL for a 10LB Maltese",
      "text": "Very cute! The quality is nice and the material is soft inside. It almost feels like the Adidas sweat-proof material. It is a little warm for my dog now so I don't put it on her for too long. Like what other comments have been saying, the sizes aren't true to size. My dog is a 10 pound Maltese and I had to get an XL. That's fine but my only complain with that is the sleeves are a little longer than I wanted. So I roll it up a little for her~",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 2,
      "publication_date": 20170422
    },
    {
      "title": "Cozy",
      "text": "Fit our 11lb Jack Russell very well. He seemed very cozy and quite pleased. Usually he's a bit irritable and restless in harnesses and clothing but he enjoyed putting this on and likes having it on in the Fall temperatures. You can see some seam issues but that's what you pay for. I'm still satisfied with my purchase for our little guy.",
      "rating": 5.0,
      "verified": true,
      "author": "BriiShopsHere",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Something they can all wear and mostly fits great color and look",
      "text": "Still a bit big but I can slip it on two of the three dogs. The little one well she is very picky but walked cautiously to do her morning relief. But I could tell that she was not happy with the contraption I put in her. She’ll get over it ☺️",
      "rating": 4.0,
      "verified": true,
      "author": "Sylvia",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Cute pet wear",
      "text": "I love this! I wish I read the reviews before checkout. I ordered too small. I will gift it to a smaller dog because it’s super cute!! I ordered an XL for my 11 pound Shih Tzu. He’s happy and we match in Adidas! I’m going to order more colors!!",
      "rating": 5.0,
      "verified": true,
      "author": "rooseveltq",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Sooooo cute!! I have 4!",
      "text": "I love these Adidog hoodies! Soooo cute! They’re warm, fit great, nice cut (easy to pee) & look pimp. My only complaint is material is getting ‘bally’ after a couple washings. Sizes run a little small, so my 7lb chihuahua is actually a medium. Other than that, I have 4!! Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "mrPam",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Too cute..... but definitely order up a couple sizes!",
      "text": "So cute and very good quality! So glad I read other reviews though because they do run extremely small! I have a 14 lb mini schnauzer and he usually wears a size small but I ordered a size xl in this and it fits perfectly! Haven’t washed it yet so I don’t know how it holds up after washing but it’s a good thickness and keeps my little fur baby warm after his haircuts lol! Plus it’s freaking cute!!",
      "rating": 5.0,
      "verified": true,
      "author": "KyKy",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "WRONG HOODIE SIZING",
      "text": "Apparently it’s not stretchy material. The large looks real small in my dog he barely has a hood attached to the hoodie the measurements are all wrong. I measured my dog to see what would be the exact size he needs and looked at the chart but somehow it doesn’t match. I love the hoodie though overall it’s looks warm and cute but I would order up a size",
      "rating": 2.0,
      "verified": true,
      "author": "anastasia",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Will be ordering ALL colors!",
      "text": "I ordered size large baby blue for my 6 month old mixed pup. He's about 8-10 lb, long and skinny. It for him perfectly. The sweater is nice and thick and very sturdy. But still stretchy where it needs to be to get the arms and head in. I will be ordering another for my girl pup. But I wanted to make sure on the sizing",
      "rating": 5.0,
      "verified": true,
      "author": "Jenstar8621",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Great for the price",
      "text": "I purchased these for our new addition. Currently have the same ones for my 65 lb female bully by same seller. I got a size small for our 5lb Yorkie. The blue color is great , material is sturdy, thick and not see thru. The grey is thinner, smaller and see thru. It is still soft and will work as an addition to keep him warm at home. These run extremely small. Check their size chart my bully is a size 7XL.",
      "rating": 5.0,
      "verified": true,
      "author": "Monique Munoz",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Cute",
      "text": "So cute but runs a little tight, arms are kind of hard to get his little legs through and the hood was a little too high on his neck. Let me be clear he loves sweaters so he has a lot of them. But it’s still cute and once he was in it he seemed fine with it. Need to go up a size for him though because he has a bigger chest since he’s part wiener dog. Sizing was a little hard. Kids thought it was hilarious though.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica Leonard",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "not cotton, is some sort of poly",
      "text": "its very cute, the fit is good, however, this is NOT cotton, its some sort of polyester or synthetic fiber. one wear for a day walking about on a leash and its all pilled and snagged. as cute as it looks on? I cant recommend, one wear should not leave it looking like a rag pile reject. the entire shirt is covered in pills and snags.",
      "rating": 2.0,
      "verified": true,
      "author": "AnnieL",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "exceeded my expectations",
      "text": "I’m very satisfied with my purchase! It’s a adorable and affordable. Fits my dog perfectly according to the chart provided. I plan on buying more in different colors. I love the material and it’s soft/cozy feel. More importantly my dog isn’t bothered by it and walks around easily in it. She’s 7ish-no more than 8pounds and fits a Large",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Warm and adorable!",
      "text": "I purchased this for my chihuahua and it looks so cute!!! It’s very warm and not so hard to get on. He is 18 pounds and was an extra large so definitely pay attention to the size charts.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 2,
      "publication_date": 20190112
    },
    {
      "title": "Inaccurate sizing chart causes a lot of difficulty",
      "text": "I like the shape and softness of the sweater. I love that it's an Adidas sweater made specifically for dogs. The sweaters seemed to shed a bit and no matter what size I order none of them fit right. I measured my dog's girth, chest, and length and got the recommended size and one up since it said they run small. Both sweaters were too small. I ordered the bugger sizes based on weight as well according to other reviews and then they were way too big. I have a 10lb chiweenie and overall this sweater just doesn't seem like it's made for longer dogs and the sizes are very inaccurate to the sizing chart.",
      "rating": 1.0,
      "verified": true,
      "author": "Ej",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Love it!",
      "text": "As my dog got older she would get cold quick and started losing weight. I would put this on her and she loved it! It kept her warm. Even kept her warm outside as well. The color of it is very bright and vibrant. I washed it multiple times and the color never faded.",
      "rating": 5.0,
      "verified": true,
      "author": "Bug",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Too small",
      "text": "Not true to size...I bought this for my sons dog and shipped it to Colorado. He loved it but it's way to small. I reordered and went with another seller with better sizing chart and reviews. Lesson learned.",
      "rating": 1.0,
      "verified": true,
      "author": "marilyn",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "NOT COTTON!!!",
      "text": "This is not cotton. This is a either polyester or a high polyester blend and a low quality at that. VERY disappointed. I contacted the seller who informed me it was 'mostly' cotton...but I work with material and this is NOT cotton. It started pilling within a day. Very disappointing product",
      "rating": 1.0,
      "verified": true,
      "author": "kate",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Sweatshirt Review",
      "text": "This sweatshirt is so cute! I purchase the blue one. The sizing if very off. I have a 22 lb French bulldog and I had ordered a S it was way too small and barley fit a small Yorkie. I would recommend to order a size up, it runs very small. I ended up ordering a M, still very snug. The material is great, and it’s very cute on a dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Monique Kase",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Way too small",
      "text": "Way too small. I ordered the small for my 6lb chihuahua and it is smaller than the extra-smalls I have from other places. These are more like clothes for extra small stuffed toys.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "LOVE LOVE THIS LIL HOODIE",
      "text": "I couldn’t believe how nice this lil sweatshirt was for the price. It was exactly like pics when it arrived which is usually not the case when ordering online. It fits my lil yorkie perfect. I thought the hoodie may bother him but he doesn’t even notice it. It actually keeps him extra warm. I got the blue one and it’s so adorable on him. Very good material and soft. Will definitely be ordering more like this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan F.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Runs small :(",
      "text": "I saw that it said to be sure to measure your dog FIRST, so I did. I ordered a size up because she is a young puppy and still growing. The one I ordered is supposed to be a 2XL, but it barely fits her. She's only 14.5 pounds. I would suggest ordering at least two sizes bigger than shown on their size chart.",
      "rating": 4.0,
      "verified": true,
      "author": "Shari",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Disappointed in sizing & quality.",
      "text": "I ordered two different colors, but the same size. One was too small & the other barely fit my dog. She's a medium - roughly 16 pounds. Pilled up the first time washed. None of her other hoodies have done this. So, order in a larger size & hand wash would be my recommendation.",
      "rating": 1.0,
      "verified": true,
      "author": "Carla Sloke",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Apollo approved 👍🏽🦮",
      "text": "My little fur baby loves his Adidog hoodie. He’s about 16 lbs and xl fits him perfectly. This hoodie feels like a good quality material. It will keep him warm this fall. It has a little stretch to it. I haven't washed it yet. So I’m not sure how it will hold up after a wash. So far it’s great!",
      "rating": 5.0,
      "verified": true,
      "author": "Black Butterfly",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "It arrived dirty but after wash it looks really cute",
      "text": "I mean, once you see your puppy in a hoodie, what's cuter than that?!?!? the item arrived dirty and I was afraid it was a stain hard to take off, but an easy hand wash cleaned it well and it's really really a cute hoodie! I hope it will also keep my pup a little warm in the fall",
      "rating": 4.0,
      "verified": true,
      "author": "ludovicabu",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Take your chances...",
      "text": "These are super cute! I got 2 in different colors since I have 2 dogs. I like the blue one, however the red one has 2 different size sleeves. I feel like they sewed a medium size sleeve onto a size small body. This will bother me and i feel like this is something that should have been caught in quality control. I hate having to return items.",
      "rating": 3.0,
      "verified": true,
      "author": "teach43",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Buddy approved",
      "text": "Our chizer buddy has been wearing these sweatshirts since he was a puppy. He is almost 2 now so we reordered another round of his new size. As always they fit very well and are good quality sweatshirt material. I suggest air dry, otherwise they wash up well. Buddy wears these daily and I’ve noticed he doesn’t shake from cold as much:) arrived on time as always!",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa Hopkins",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Too small but very cute!!!!",
      "text": "So cute! But had to return because was too small. They are very specific on sizes but I tried anyways. Bummer didn’t work. But I do want to note their were some thread snags and didn’t seem to be the best quality. But the fabric is nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Kae Christine",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Good hoodie, sizes vary.",
      "text": "I ordered a medium for our 8lb Yorkie and it was a Little too small. I like quality of the hoodie but the sizes vary I would say.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie ",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Bad Sz Chart - Good Product",
      "text": "The size chart is inaccurate. I ordered a medium by my dogs measurements but evidently I needed to add one more size. The chart is not referencing the dog measurements that it will fit but the garment’s stretched measurements. I will be returning.",
      "rating": 3.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20200501
    }
  ],
  "product_meta": {
    "title": "Idepet Soft Cotton Adidog Cloth for Dog",
    "description": "Size:XXL| Color:Navy BlueHigh Quality Pet Dog Clothes Coat Soft Cotton Adidog Clothing 7 Colors Small Size S M L Xl XXL Dog Jacket \n\nSize information: \n\nS:Neck Girth:9\", Back Length:7.9\", Chest Girth:13.38\" ; \n\nM:Neck Girth:10.2\"; Back Length:9.8\", Chest Girth:14.6\";\n\nL:Neck Girth:11.5\", Back Length:11.9\", Chest Girth:17.3\" ; \n\nXL:Neck Girth:12\", Back Length:13.8\", Chest Girth:19.3\" ; \n\nXXL:Neck Girth:13.8\",Back Length:15.7\", Chest Girth:21.7\" \n\nPlease choose size very carefully according to the size information above \n\n*Measuring Your Dog for a Perfect Fit* \n\n1.How to measure your dog? \n\nThere is a picture to show how to measure your dog above,please check it. \n\n2.Your baby usually wears size S doesn't mean all size S will fit him/her,please check the size information carefully before you buy. \n\nYou looked at one size chart and found that your dog is a size small. But that doesn't mean he/she is a size small for all the clothes. Different designers and manufacturers use their own size charts. So the measurements given in a size SMALL by manufacturer \"A\" will be a size XS in manufacturer B's size chart. Don't buy a particular size because that is what you always buy in a pet shop or online store. Always look at the size chart for chest girth and length and confirm the size before you commit to buy. \n\n3.If any of the measurements are 'between' two sizes, choose the larger size. \n\n4.If your pet dog is growing up,you can order a bigger size \n\n5.Take each measurement a bit loosely. \n\nTake each measurement a bit loosely, so there will be room for your dog to move and breathe, but not too loose. \n\nPlease measure carefully before buying and email us if you have any questions about fit before you bid or make a purchase.",
    "rating": 4,
    "feature_bullets": [
      "⚠️⚠️Measure Your Pet 🐶 🐱Read the Size Chart to Choose the Correct Size⚠️⚠️.Some buyers ordered the wrong size because they ordered the size according to their pet's usual size or weight,did not measure their pet and did not read the size chart.This is the main reason that causes the sizing problem.(PS:According to our customers reviews,you can order 1 size up).",
      "Material: 100% Cotton;Color: Red, Blue, Navy Blue, Yellow, Pink, Black, Gray",
      "This brightly colored pet sweatshirt is made of 100% cotton and accessorized with the same attributes as hoodies made for human",
      "Size: S(Neck Girth:9\", Back Length:7.9\", Chest Girth:13.38\";) ;M(Neck Girth:10.2\";, Back Length:9.8\", Chest Girth:14.6\"); L(Neck Girth:11.5\", Back Length:11.9\", Chest Girth:17.3\") ;XL(Neck Girth:12\", Back Length:13.8\", Chest Girth:19.3\") ;XXL(Neck Girth:13.8\",Back Length:15.7\", Chest Girth:21.7\")",
      "Item Includes: 1*dog clothes.(Please measure your pet and read the size chart before you choose size)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "8.6 x 7 x 1.2 inches; 4.8 Ounces",
      "Date First Available": "November 13, 2015",
      "Manufacturer": "Idepet",
      "ASIN": "B017XMFZL6",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Apparel & Accessories",
      "Dogs",
      "Pet Supplies",
      "Hoodies"
    ],
    "price": 9.29
  }
}