{
  "website_summaries": [
    {
      "verdict": "Light but durable w/choice of hard or soft case. If you like the style, you'll love the price.",
      "pros": [
        "Classic style without the Ray-Ban price",
        "Complete UV protection and 100% satisfaction guarantee"
      ],
      "cons": [
        "Glasses don’t wrap the eye like modern sports sunglasses",
        "Not real Ray-Bans!"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Hit or miss",
      "text": "07/08/2018 - Updated review. I received an apologetic email and a refund from Eye Love. I will update my rating from 1 star to 4. I admire their service recovery and \"do-good\" practice, but still disappointed with the second pair. 07/07/2018 - First pair purchased last February, I was really impressed with the quality. Last week, that pair was stolen from my car. I ordered another pair, and I'm disappointed to report they're not the same. The frame is bigger, the lenses aren't polarized. The first pair came with a nice zip up case - the second order did not. Highly disappointed with the recent purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Baker",
      "helpful_votes": 10,
      "publication_date": 20180707
    },
    {
      "title": "Poor durability and no response from the company",
      "text": "I purchased this sunglass on Sept. 21st and have been enjoying it so far. Last week, when I tried to use it, the joint area broke off like shown in the picture. It wouldn't be fair to compare this to similar style of Rayban but I never had this problem with them. I reached out to EyeLove to let them know and I didn't get any response.",
      "rating": 1.0,
      "verified": true,
      "author": "Seung",
      "helpful_votes": 20,
      "publication_date": 20161107
    },
    {
      "title": "Carful",
      "text": "I bought a pair of these a few months back and loved them. I bought another pair and they aren’t the same product. Smaller sized lens the second time. Super unfortunate. I loved the first pair.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristi T.",
      "helpful_votes": 10,
      "publication_date": 20180602
    },
    {
      "title": "LOVE!!!",
      "text": "In the 90s I had a beloved pair of Ray-Ban Wayfarer sunglasses. They vanished somehow at a mall food court and I've missed them since then. I decided to find a good knock off and picked these. I am in love again! I love how light weight they are, can't stand heavy glasses. They are well made and come with nice extras. This is exactly the look I wanted. Very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Colander",
      "helpful_votes": 52,
      "publication_date": 20160315
    },
    {
      "title": "So dark they're only suitable for full sun",
      "text": "Con: These are EyeLove's darkest sunglasses. This unfortunately means they're too dark to wear while driving on an overcast day, or when you're in the shade of a building. Be prepared to flip them up a lot to see what you're doing in less than fully-sunny conditions. Pro: good customer service (they offered me a discount on another style), good corporate social responsibility (with their donations to people in need), and sturdy construction.",
      "rating": 3.0,
      "verified": true,
      "author": "W. Tersch",
      "helpful_votes": 4,
      "publication_date": 20180822
    },
    {
      "title": "Long eyelashes?  No problem!!!",
      "text": "Excellent purchase, I was skeptical to buy sunglasses online because I have long eyelashes and uneven eyebrows. These sunglasses are so comfortable and lightweight and fit is perfect. I can shop for sunglasses for a year and not find a pair that are this comfortable. Some other reviewers said they can’t see their phone but I have no problems with mine plus I have a zagg privacy screen protector. Very pleased with the quality and the price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 4,
      "publication_date": 20180814
    },
    {
      "title": "Comfortable",
      "text": "These glasses were purchased to replace my RayBans that shattered when dropped. This was a quick impulse purchase as I needed something sooner rather than later. I don't feel like the picture shown of the glasses really shows how dark the \"wood\" side pieces are. Thankfully for me, I'm not that picky, so I was fine with it. But just for those who want a particular look, the wood is pretty dark, almost looks fully dark brown/black so the wood grain look is almost missed. But otherwise, these are a nice, simple pair of glasses that are stylish enough.",
      "rating": 4.0,
      "verified": true,
      "author": "rodz77",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Eye Love Polarized",
      "text": "I have been wearing these glasses exclusively for two months. One thing you will notice right away is the loud plastic screech noise that happens when you open the shades to put them on. It was nearing the point that I might send them back and it stopped, I would say over a month in. The reason that I was patient is because I like that these shades have dark, black lenses where you can't see my eyes, and they are well polarized. If you can get past the screech noise I believe you will like them too. I also appreciate that they give to charity with each purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Love these sunglasses and the company",
      "text": "My eyes are very light colored, so they are extremely sensitive to light. Many casual or fashion sunglasses don't do a great job for me due to how sensitive my eyes are, so I'm always overly critical of sunglasses. These glasses provide great protection from the sun while also being stylish, which is fantastic at the price point. Plus, you get an added bonus of providing eye care to someone less fortunate, which is not a bad thing at all. I will continue to buy these sunglasses and support this wonderful company.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Cheap.",
      "text": "Just got them about an hour ago. First thought was “woah, these are not worth $20 and I got them on sale”. Super cheap plastic, the lens are brown which is what I wanted but just not dark enough. Sunlight still pretty bright through them. And they arrived missing one of the silver corner pieces which proves how cheap they are. Unfortunately these are the 3rd pair of sunglasses I’ve bought off amazon and I’m tired of returning things so I have to keep them. Bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Loved them for a short while...easily scratched and weak hinge",
      "text": "Love the idea behind the brand. Loved the glasses but they didn't last long. My first pair lasted a few months but were easily scratched. The second pair lasted a month and a half before one of the metal hinges cracked. I contacted Eye Love and they promised a replacement (which was great since I had the glasses beyond 30 days) but then, despite follow up emails from me.....(crickets)... I still recommend these sunglasses with a caution to be very careful with them or consider them as disposable in the short term.",
      "rating": 3.0,
      "verified": true,
      "author": "tabhastal",
      "helpful_votes": 3,
      "publication_date": 20170905
    },
    {
      "title": "Nice product.",
      "text": "Wasn't sure when these first arrived. They are lightweight, look great, and are polarized as advertised. I am slightly concerned that they may break under any sort of extreme circumstance, but I guess considering I knew these glasses were constructed with wooden arms. It comes with a nice zippered durable carrying case, glasses tool & cleaning rag. Unfortunately, I had to knock off one star as the carrying case & glasses smelled terrible when they arrived - they smelled as if they had been stored in an area where all the workers smoked cigarettes/cigars. Thankfully, the smell wore off after a couple of weeks.",
      "rating": 4.0,
      "verified": true,
      "author": "Ross K.",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "it is very nice knowing that in purchasing them you are helping someone ...",
      "text": "These are reasonably priced, polarized, & provide protection against damaging sun's rays on both sides of the spectrum. They are also lightweight with a classic \"Wayfarers\" design.They come accompanied by both a hard case and a protective sack (in case you don't have room in your purse for the case). In addition, it is very nice knowing that in purchasing them you are helping someone who needs glasses but can't afford to buy them! Great product & business model!",
      "rating": 5.0,
      "verified": true,
      "author": "Anastasia",
      "helpful_votes": 2,
      "publication_date": 20171103
    },
    {
      "title": "Good pair at a good price",
      "text": "This pair of sunglasses replaces a similar pair I accidentally broke. They are very comfortable and go a great job of cutting out the glare. My eyes are light-sensitive. OK, so they don't have the high-end lenses of my $200 pairs of sunglasses with better optics, but I don't mind. I like the fact that I could accidentally break or lose this pair and not feel so bad. So, I find myself wearing them more often.",
      "rating": 5.0,
      "verified": true,
      "author": "David S",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Helps with glare",
      "text": "If you have problems handling glare, these dark sunglasses are a help. I have severe Dry Eye which is complicated with Photo Sensitivity. Sunglasses are not an option, I can't go outside during a bright day without them. I would like this pair even better if they were even darker...but these are certainly a step in the right direction. I did not give them a 5 because they are so lightweight...but for the price, I did not expect anything made better. I do not think you will regret buying them.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn In Houston, TXTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Sun Glasses did not last",
      "text": "Glasses fell apart within 3 months. there was a break in the one of the lens frames. I took them out of the case one day and all I got was pieces. I bought some other sunglasses from Amazon same style different seller and they are still in perfect condition. I do really like these sun glasses because of the style and texture that they were made with, I just wish the quality was better.",
      "rating": 1.0,
      "verified": true,
      "author": "RONALD P.",
      "helpful_votes": 3,
      "publication_date": 20180511
    },
    {
      "title": "Worth the price and more, the value is definetly here on the sunglasses.",
      "text": "If you landed here and are considering sunglasses from Eye Love don't hesitate. Just the extras and commitment from Eye Love in providing for others is worth the cost. This model was my choice based on reviews from others that implied these are for a larger face profile. Well, well that's me one giant mug. Very happy with the fit. I've spent big bucks on polarized fly fishing sunglasses that didn't match these.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "High quality but huge",
      "text": "I have a relatively large head, and usually I have a hard time finding sunglasses that don't pinch my temples and give me a headache. Not so with these--they are very large, and would not stay on my face! Will have to return them which is too bad because they seem really nice. Came with a soft protective pouch, a screwdriver keychain, and a sticker, all in a hard box that can double as a hard glasses case.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve Charney",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "So good I'm buying several more pairs",
      "text": "Great product! I'm really happy with the look, feel, and quality. I've only ever purchased $10 sunglasses so this was a step up for me (would never spend $100+ on sunglasses), and I am not disappointed. Much better than a $10 pair and pratically as good (aesthetically, anyway) as a much more expensive name brand. Will be buying more!",
      "rating": 5.0,
      "verified": true,
      "author": "Evan Perkins",
      "helpful_votes": 4,
      "publication_date": 20170317
    },
    {
      "title": "Great glasses at an affordable price",
      "text": "I needed new sunglasses and took a chance on these. They fit perfectly and don’t slide off. The polarized lenses are great and the lenses are very dark as I had hoped they would be. After paying well over $100 for Ray bans, I am very pleased with these much more reasonably-priced sunglasses. They also come with a handy screwdriver to tighten the hinges.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Gottesman",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Lens smaller than 58mm in product description. OK otherwise",
      "text": "Description on web page was 58-14-150 .They seemed small to me and my lens width measurement was 54-55mm. This amount does make a difference in sunglasses. Build quality seems OK for this price point. Returned rather than exchanged since all Eye Love models I could find on Amazon seemed similar just different frame and lens colors.",
      "rating": 3.0,
      "verified": true,
      "author": "H. T. Nelson",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "HIGHLY RECOMMENDED!!",
      "text": "HIGH QUALITY sunglasses that are even so much more than what I had been expecting. Besides really looking great, they are SO easy on the eyes!! Wish I had discovered these long ago...but my eyes are very grateful that I discovered them at any rate!! HIGHLY recommended!! I was so grateful to receive the accessories as well....the hard protective case is especially wonderful! **UPDATE** Just ordered a second pair so that I can keep one in the car too. These are still my FAVOURITE sunglasses!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Holzmann",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "Great dark lenses, sturdy frames. Lense coating removing.",
      "text": "Perfectly dark and the polarized lenses are great. The frames are sturdy and lightweight. The only thing is that the coating on the lenses seems to be fading, flaking or pulling off the lenses now after maybe a year or two(see my attached picture). I can still see through them but I'll probably need another pair soon.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave Mozdzanowski",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Fantastic-- until a kid stepped on them :(",
      "text": "I bought these sunglasses because I wanted an affordable, quality pair of polarized sunglasses to wear while working on the waterfront at a summer camp. It made such a difference to be able to watch the water without squinting from the glare, and the dark lenses were fantastic! I absolutely LOVED them and wore them every day, and they stood up to lots of rough and tumble wear. Until one day I took them off and left them on the ground... they were stepped on and the hinge snapped. I don't know if any sunglasses would have survived such a direct hit, but I was wondering if EyeLove offers a warranty on them?",
      "rating": 5.0,
      "verified": true,
      "author": "Colorado_girl",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Great Purchase for light sensitive eyes!!! Very Fashionable!!!",
      "text": "These fit perfect and really help my light sensitive eyes. Autoimmune issues and cataract surgery have been tough and these really help cut glare!!!! They are larger than others, but not too large for my feminine face. Hubby says they look cool, retro! LOL This was a smart purchase after lots of research on sunglasses. Came with great accessories too!! Case, mini-screwdriver, clothe and more! Highly recommended & very fashionable!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Fondaw",
      "helpful_votes": 0,
      "publication_date": 20170218
    },
    {
      "title": "Not as expected",
      "text": "I misplaced these sunglasses for over a year. I found them, tried them on and found there is no polarized lenses in this pair. My purchase was in March, 2019. I noticed while browsing this vendor, the reviews are really old. I know it is impossible for you to inspect each pair, but the reviews of hit and miss quality control should be addressed.",
      "rating": 2.0,
      "verified": true,
      "author": "John A.",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Nice quality, very attractive, excellent fit, very dark shading",
      "text": "I purchased these sunglasses as an extra pair for my husband. If he didn't like them, I figured I would use them as an extra pair! He loves them and he looks great. The sunglasses are nice quality and the fit is good. It was nice to see a little tool in the box for tightening as needed. Highly recommend purchasing these sunglasses.",
      "rating": 5.0,
      "verified": true,
      "author": "donna531",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "My new sunglasses",
      "text": "The process of ordering and receiving these glasses was efficient - am a Prime member. The glasses fit well and I am pleased with the coverage provided to my eyes. Only giving 4 stars at this point because the weather has been cloudy this past week and I haven't been able to wear them in bright sunny conditions yet. In the current weather conditions they seem to perform well.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "GOOD for you",
      "text": "These are beyond cheap. Whomever took the pictures should work for natgeo. They are straight-up $5 dollar shades. This person is making a killing. GOOD for you...bad for us. They weigh as much as a sugar cube...case in pointe",
      "rating": 1.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 7,
      "publication_date": 20160426
    },
    {
      "title": "Honest Company",
      "text": "This company is amazing. Not only are the sunglasses great but they give a portion of their proceeds to help people in other countries in need of eye exams etc.. Very impressive. The sunglasses are exactly what I wanted. They are lightweight, polarized and provide the right amount of protection for my eyes.. The price cannot be beat. Good company to do business with..",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "WILL NOT DISAPPOINT",
      "text": "I purchased these sunglasses in hopes of getting something that looked as good as Ray Ban at a significantly lower cost. Eye Love Polarized Sunglasses did not disappoint! I wear soft contact lens so glare from the sunlight is often problematic. With other dark sunglasses, I sometimes found myself removing them because while they reduced the sunlight and glare, they inhibited my already poor vision. Not true with these sunglasses. The clarity is excellent. I LOVE THEM! Knowing that my purchase resulted in a person receiving a needed eye exam and glasses just adds to my joy!",
      "rating": 5.0,
      "verified": true,
      "author": "bcd",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Stylish. Comfortable. A Perfect Fit!",
      "text": "These glasses are are stylish and are a perfect fit! I wore these during my trip to Paris and these were indistinguishable from the more expensive sunglasses the locals were wearing. I recommended these glasses for anyone who needs a slightly larger frame to fit a bigger head. I had a slight issue with these glasses but the seller took care of the issue right away. Actually, the seller went above and beyond to exceed my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick A. Moreno",
      "helpful_votes": 2,
      "publication_date": 20160705
    },
    {
      "title": "Not worth it",
      "text": "They are too wide when you put them on your head they fall down!!! They are very lite weight I didn’t see it work well when fishing on the lake!!I did not see a difference then other glasses that is why I bought them!!",
      "rating": 3.0,
      "verified": true,
      "author": "Denise J.",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Loose Fit!  :(",
      "text": "I love everything about these sunglasses except for the very loose fit. I wear cheap readers that fit better than these sunglasses. My panama jacks fit better than these sunglasses and they are also polarized. I will keep the 'eye loves' in my glove compartment and use as a spare and stick with my panama jacks.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn Kennedy",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "They’re for shrek sized heads! 🙌🏼",
      "text": "Pretty good picture. Not fully sure how much they’re polarized, but they do cut down the glare a lot. If you have a large head then these are for you!! They’re almost too big for my head and I have a shrek head!! I can’t wear them in top of my head because of how large they are and my bald head, they slide right off. I’ll buy them again and again!!",
      "rating": 4.0,
      "verified": true,
      "author": "Twon423",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Not good the second time around",
      "text": "This is my second pair, so I must have liked the first pair but this pair is cheaply assembled. I lens fallout during the first cleaning and the hinge is too tight on one side. Glasses lack a quality inspection. Not sure if I’ll return or just move on.",
      "rating": 2.0,
      "verified": true,
      "author": "mel mallard",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "The Best Sunglasses!",
      "text": "These are the perfect sunglasses. The best I have worn. The descriptions before I bought them are accurate. I had a cataract removed so it was critical they shield me from the sun. I am happy I purchased these sunglasses. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "ABG1143",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Not what described and gets worse",
      "text": "Cheap black acetate frames, not a speck of wood on them. Should have paid attention to the recent one star reviews. After weeks finally got refund and was shorted 20%. I am truly getting tired of Amazon's lack of quality control or responsibility.",
      "rating": 1.0,
      "verified": true,
      "author": "paul mktv",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Great pair of sunglasses",
      "text": "I was very pleasantly surprised when my new shades exceeded my expectations They are attractive and very well-made. The shades also helped with driving by reflecting the Sun so that you were able to see better. lI would definitely recommend this product to my friends",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Carbone",
      "helpful_votes": 3,
      "publication_date": 20161208
    },
    {
      "title": "COMFORTABLE!",
      "text": "I love these sunglasses! They are all one color which is great as I don't have to move my head around to get the shade I need. They effectively block out the sun but are not too dark. They don't fog up, unless I'm wearing a mask, and they're comfortable to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Slaton",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "I bought 2 pair (over time) and I really want to love these",
      "text": "I bought a pair and loved them — within 4 months the teeny tiny screw popped out and it's in the ether somewhere. I bought a second pair hoping for more durability, but they feel very... I don't know, loose? Not on my face, they fit perfectly, they just feel like they're not super sturdy. They come with a little screwdriver, so I'm going to make sure I routinely check them. If anyone knows where I can get another super tiny screw lmk and I'll fix the first pair.",
      "rating": 3.0,
      "verified": true,
      "author": "Erick",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "It is perfect!",
      "text": "Great glasses. I love it. Was sad when the first one I ordered never got to me, but a replacement was sent to me and I recieved that. Thank you so much for sending the replacement and doing so in a timely manner. I decided to try the glasses out after reading the reviews, because I was having headaches, and photosensitivity due to sun light and this glasses has helped a lot. I have used it the last 3 days since I got it and all I can say is, I am glad I bought it\"",
      "rating": 5.0,
      "verified": true,
      "author": "plangnan",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great quality, style and function.",
      "text": "I'm very happy with my Wayfarer polarized sunglasses. I wore this style several years ago and it's an added bonus that they're back in style! What I really appreciate about them is the way they reduce glare. Here in western WA we can go for long periods without sun so when it appears we need something that blocks the uv rays and glare that our eyes are not used to.. As soon as I put them on it's like my whole body relaxes and I no longer have to squint! Also, I was very happy to learn that you use a portion of my money to assist those who cannot afford glasses - it's a total win-win!",
      "rating": 5.0,
      "verified": true,
      "author": "Gearhead Larry",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Wonderful, dark sunglasses.",
      "text": "These are quite dark for sunny days but no definition is sacrificed. I see as well, or better, with these than with my lighter shaded sunglasses. They are also very, very comfortable. Nothing to snag on the hair. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "JERi",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Poor build quality, lasted only two months.",
      "text": "Was not overly happy with the build quality of these sunglasses. The coating on the frames started to chip and peel after only a month, on arrival the legs were not attached to the frames very well, and kept coming off so I had to glue them in, not a big deal but pretty annoying. After about two months of having them the legs broke off of the frames completely (The plastic is very thin where they connect). Would not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "bwasson",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Nice dark lenses",
      "text": "I love these sun glasses. I'm on my third pair. The lenses are very dark. They come with a small screwdriver so you can adjust the tension on the frame. These glasses used to come with a soft and hard case as well as a microfiber cloth. My most recent pair didnt come with those things but that wouldn't deter me from buying them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Great glasses at a great price.",
      "text": "Bought these for my husband for his birthday. He didn’t own a decent pair of sunglasses and I knew he needed to protect his eyes. They fit great and look amazing on him. Plus he’s finally protecting his eyes from harmful UV rays. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth D",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "You get what you pay for",
      "text": "They look lovely, not to big or small. The quality is nothing to brag about, but they are very attractive looking.",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn Demeter",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "I really like how they look",
      "text": "I really like how they look, but the only problem I had with these are the way they fit. It feels like the bottom part of the sunglasses are digging into my cheeks and that's never happened with sunglasses before. Maybe bc I'm asian and I don't have that ridge on my nose, but they are too close (the bottom part) to my face. Overall, I really like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Sujung18",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Poor Quality:  Flimsy and light weight.  Not worth $30",
      "text": "I am pretty disappointed in the quality of these sunglasses given the price ($30). The sunglasses are flimsy and very light in weight. Which makes it feel like they are going to fall off constantly. Also, they don’t feel very durable. I’m already worried they’re going to break in the next few weeks/months. They feel more like $5 or $10 sunglasses. Not $30 dollar sunglasses. I bought a pair of $10 sunglasses from an airport store that are better quality than these sunglasses. I’ll be returning these sunglasses and just sticking with the $10 ones instead.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Cheaply Made",
      "text": "I was hoping for the $30 I paid I would get some halfway decent glasses, but these feel flimsy and every time I clean them I'm worried they'll break. I can get better quality glasses than these for $10 at Walmart. Update 9/13: Received an email from the company today and they did issue a full refund based on their satisfaction policy.",
      "rating": 2.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "decent, but LARGE",
      "text": "Decent, but LARGER than the classic wayfarers. these are 54 mm in width, but the length from top of frame to bottom is a little larger than expected. ok. for the price, comes with cloth and case. but do not fit my face. i gave away because i look like im trying to hide behind them.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Parrott",
      "helpful_votes": 2,
      "publication_date": 20161003
    },
    {
      "title": "sturdy sunglasses",
      "text": "I use these glasses for driving---really good. They seem sturdy. However they are too big and keep slipping down my nose. I don't think I can use them for anything other than driving as they fall off my head when I bend over. Is there a way of tightening them up?",
      "rating": 4.0,
      "verified": true,
      "author": "JACKIE WILLIAMS",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Quality fit and finish",
      "text": "Are you kidding me for the price I will buy a pair of these every year. I just got them so I cant attest for long term durability but the build quality feels light but sturdy. I have zero complaints so far especially for the price range and the unique donation they do with each purchase. Love them",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Was good, for a very short time.",
      "text": "After about 4 months of wearing them the inside of the lens started to \"bubble\". Now when I put them on it drives me crazy. When I'm not wearing them they are kept in a hard case. Still now sure why the lens are doing what they do. It continues to get worse. I'm about to toss them.",
      "rating": 2.0,
      "verified": true,
      "author": "Reanna McCurry",
      "helpful_votes": 4,
      "publication_date": 20170113
    },
    {
      "title": "Cheap quality",
      "text": "The wood ones have terrible hinges. It almost immediately started to break. I like the other plastic ones they seem to be a little more durable then these wood frames. Probably not worth the buy even if they are cheap",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Great value",
      "text": "When I first tried my glasses on I was immediately impressed with the clarity of lenses. I can actually see better with these on due to the nice contrast. The funny part was I realized the lenses still had a protective film over them that I needed to peel off 😱 the clarity just got better! Nice carry case and small screwdriver included. Great pair of glasses for a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Ann",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "So good.",
      "text": "I've actually never been a sunglasses type guy. I wanted something sleek and simple with quality lenses. This product turned me into a sunglasses guy.",
      "rating": 5.0,
      "verified": true,
      "author": "anessa santiago",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Dark, polarized sunglasses at a great price!",
      "text": "This is my second pair of sunglasses from Eye Love. I left my first pair on a ski trip recently. As soon as I got home, I ordered a replacement pair. I am light sensitive and wear contacts and these polarized lenses are nice and dark, so there’s no need to squint when outside. Excellent sunglasses at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan R.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "The plastic has held up great, hasn't loosened or gotten crooked yet",
      "text": "Had these for about 6 months. The plastic has held up great, hasn't loosened or gotten crooked yet. However, the tint is peeling away from the glasses making them clear and not sunglasses in the corners. I could have purchased a few from eBay for this price if I knew they were going to peel.",
      "rating": 3.0,
      "verified": true,
      "author": "Carter Smith ",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Dependable",
      "text": "FAST shipping! Arrived well intact. Beautiful, comfortable sun glasses. Can't wait to wear them on my sunny trip! Used these in Israel and worked well in all the bright sun light!",
      "rating": 5.0,
      "verified": true,
      "author": "Charlene Kapchinski",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Great glasses and classy looking. It is not durable as it looks. Hope you can fix it.",
      "text": "Nice pair of glasses. The hinge screw came off within no time. I really like the glasses and had to pay at the glass repair place to put a new screw. I wish they could include extra screws to take care of it when a screw falls off. It came with a screwdriver but no screws! I would give five stars if not for that. I still have them and love to wear them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Love them",
      "text": "My favorite sunglasses, they fit well, wear well. I have the Amber and grey depending on weather. I lost my grey and quickly reordered another pair.",
      "rating": 4.0,
      "verified": true,
      "author": "Forever a \"Yankee\"",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "usually don't like things to be too feminine",
      "text": "These were a gift for my wife. She's a sporty type, usually don't like things to be too feminine. She needs incredibly dark glasses due to a neurological issue and these do the trick! They're pretty sturdy, too. I wouldn't go so far as claiming they are toddler proof but they've taken a tumble or two and have done well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimmah Girl",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Reat for elinimating glare",
      "text": "Glasses are well built, and are great at eliminating glare - the main reason I bought them. The only reason I didn't give them 5 stars is that they are a little darker than they seem to be in the picture. They are very nicely packaged and come with a case.",
      "rating": 4.0,
      "verified": true,
      "author": "William J. Giambatista",
      "helpful_votes": 2,
      "publication_date": 20170306
    },
    {
      "title": "Good price, work well",
      "text": "They were a good price and they work well. I wish the lens was just a little darker because my blue eyes at extra sensitive to light. Overall they are good and seem durable.",
      "rating": 4.0,
      "verified": true,
      "author": "LibraryBee",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Very good and reasonably priced.",
      "text": "Fit is comfortable and vision is clear. Definitely a step up from others purchased at this price. Hopefully, the lens will be scratch resistant which will make them 5 STAR!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Nice glasses. Have held up fine. Get compliments",
      "text": "I like to have a lot of sunglasses. So, it's nice to have to spend a lot of money to get a nice pair or two. Plus the styles look good. Folks say they look nice, and wonder what are they and where I got them.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Hopson",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Better than expected!",
      "text": "Thought these would be flimsy & light weight. They are solid NICE sunglasses. I wear them at night to survive the insane LED headlight blindness.",
      "rating": 5.0,
      "verified": true,
      "author": "L Ross",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Dark sunglasses lightweight.",
      "text": "I bought this to help with light shows at concerts, I have epilepsy so I’m limited to what concerts I can go to. Strobe lights are my biggest worry, these helped a lot-but I’m still in search for a darker tint to help with strobes. They were so bright I still had to close my eyes. These glasses work well with the bright lights and I will continue to use them at concerts.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia V Christov",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Protects from Glare",
      "text": "Nice fit. My eyes are sensitive to bright light after cataract surgery. The glasses are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane D",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Well made and tinting is soothing to the eyes.",
      "text": "I absolutely love these glasses. What an unexpected surprise to put them on and find how soothing to the eyes they are and so light weight yet made well. You cant find a better deal. They have a free 30 day warranty and for a small fee offer a lifetime warranty. Thats a classy company!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Rouser",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "I've had $5 shades that looked better",
      "text": "These are packaged beautifully, but in my opinion they look really cheap. Also they sent the wrong color. Going back.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Frawley",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "No sun glare",
      "text": "I had had glaucoma for many years,and I have some vision damage from scar tissue.Your glasses are great! Wearing them I don’t get that glare from the sun ,and I see so much better when I’m outside.",
      "rating": 5.0,
      "verified": true,
      "author": "roberta mccullough",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Declining quality",
      "text": "I've bought these sunglasses three times over the last few years. In the past they were decent quality and lasted for a while but most recently the pair I got was quite bad. One of the screws popped out within a week and a screw from an old broken pair did not work to replace it. I forgot to return them, unfortunately so I'm now stuck with two broke pairs.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Great sunglasses",
      "text": "I sadly lost these three days after receiving them, after taking them off to take some photos. They did work quite well, though I tend to prefer amber. Yes, I'd buy these again, but still getting over the lost cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Anton Stayduhar",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Buy them !",
      "text": "These sunglasses came so well packaged, plus with an awesome little sunglasses screwdriver key chain ! The best polarized sunglasses I have had !",
      "rating": 5.0,
      "verified": true,
      "author": "Brendan",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Will continue to buy these sunglasses until they decide to stop making them",
      "text": "I love these sunglasses. I am currently on my third pair (because I have a habit of leaving them places while on business trips!) These are my favorite glasses. I first got them after I had lasik surgery and they worked amazing for the sensitivity that i had. I also love them because I have a big head, and they don’t dig into the side of my head like other glasses do!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah Wachner",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Did not recieve the correct sunglasses",
      "text": "Did not get the matte glasses that I ordered. I received the glossy ones which I did not like. Also at the time the matte were more expensive and the glossy were in sale and now I look the glossy has gone up to the matte price. Anyways, it would have been nice to get what I paid for.",
      "rating": 3.0,
      "verified": true,
      "author": "tammy burnette",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Not for small heads",
      "text": "These look great, but they are way too large for my head. I do have a small head, but I was disappointed that they didn't work on me at all. Will be giving them to a friend. I love the company, just bummed that they don't work on my small head!",
      "rating": 3.0,
      "verified": true,
      "author": "EditingCat",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Cheap!",
      "text": "These came damaged.. There was a nick or ding in the frame. The glasses themselves feel extremely cheap especially for the price. The frames are thin and WAY too big. I couldn't keep them on my face. They are being returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Very well-made.",
      "text": "My favorite sunglasses ever. Very sturdy. This is the second time I bought them only because someone sat on the first pair And broke them.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Sanchez",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Weak hinges, but good lenses.",
      "text": "The hinges wore out quickly, and became flimsy and opened easily. I keep my sunglasses on my shirt when not wearing them, and these would fall off because the hinges weren't strong enough to hold on to the shirt. I did like the lenses, they were evenly polarized. I leaned over after a couple months of wearing these glasses every day, and they fell off my shirt and got run over, unlucky.",
      "rating": 3.0,
      "verified": true,
      "author": "Mitchell Molchan",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Even the case is very nice. I hope my mind isn't changed by some ...",
      "text": "Just got them so this might be premature, but right out of the box with a few hrs of viewing, they seem top-notch. Even the case is very nice. I hope my mind isn't changed by some unexpected problem, because considering the quality and price, you can't beat the package!",
      "rating": 5.0,
      "verified": true,
      "author": "David Rosenthal",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Great product for the price!",
      "text": "Very light and durable, perfect fit for a man, it is a little big for a female. Would definitely purchase these glasses again.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Look as great as the pictures!",
      "text": "Love them. They are sturdy and come with a bag & cloth. The company also donates glasses to those in need when you purchase one. I live where the sun is always shining and sunglasses are a must, and these work great for clarity and darkness.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Kelly",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "The eyes have it",
      "text": "Glasses arrived quickly and are good quality. The lenses are solid, not that flimsy material that some sunglasses have. The packaging is excessive, although very stylish, seems like they could use less cardboard. The case, and sleeve are all good quality, would recommend this company. High quality product, socially responsible, buy a pair, you will look cool and feel good",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Wood",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Decent glasses decent cost",
      "text": "Decent sun glasses with UV protection that usually costs much more money.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Saved from the fiery ball of death",
      "text": "I really enjoy these sunglasses. I have to drive straight into the fiery ball of death both on my way to and from work. I have tried sunglasses in the past but NONE do as well of a job as these. There are super comfy and look super cute! I am crushed to report the side of glasses lost a screw causing the side to fall off. Yet they still work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Perfect fit",
      "text": "Lightweight and perfect fit this is the second pair and I do have to admit it's not as comfortable as the 1st pair But it is for a good cause",
      "rating": 5.0,
      "verified": true,
      "author": "dee",
      "helpful_votes": 3,
      "publication_date": 20161111
    },
    {
      "title": "Very happy customer",
      "text": "Bought these for my somewhat picky 14 yr old son. He loves the style and I'm pleased they're polarized. They fit him perfectly. A portion of the sale goes to charitable works. Very nice zipper case and accessories came with it, all neatly packaged and well protected. I wanted nice quality frames and polarized lenses without spending $$$. These are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "SB Mama",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "Arrived out of shape / unbalanced",
      "text": "I know these were inexpensive, I like having a backup pair in the car just in case. These are a thin plastic and arrived out of shape and sit very crooked on my face. I am sending them back one day after getting them. Wouldn't even try to make them work!!",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Dalton",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Great protection, comfort, value, and style.",
      "text": "I’m susceptible to headaches, and the sun makes them worse. But I enjoy being outside. I’ve already noticed a reduction in headaches since I started using these. I never liked wearing sunglasses, but these are so lightweight that they’re comfortable. Great product and value. They look good too!",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Arnold",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Disappointed",
      "text": "I liked the glasses so much when they arrived. However, they were just way to big and wide frame kept them from staying on my head. I thought they would fit after reading the reviews, especially the lady that bought them for her daughter. I am sorry that they don’t fit me at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Great glasses at a great price...",
      "text": "Great sunglasses at a very reasonable price. The frames are a bit on the light side; I somewhat question their long-term durability. However, they are very comfortable to wear, and optically seem excellent. The styling is very up-to-date, and you can buy two pair - I did - for the price of one of the brand name version. I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Don From Kansas",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Just ok",
      "text": "These glasses are stylish and my eyes feel protected from the sun. But....they are too big!! They fall off my head constantly. Had to go with another, better brand.",
      "rating": 2.0,
      "verified": true,
      "author": "AG",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Cool lens",
      "text": "Look and feel great. Price was right on for these sun glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Artist",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Cracked easily",
      "text": "Wood cracked the first month with normal use. I think the screw was too tight/split it.",
      "rating": 1.0,
      "verified": true,
      "author": "elle21",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "When you get up in the morning and the light ...",
      "text": "When you get up in the morning and the light is hurt your head The first thing you do when you get up out of bed Is hit that streets a-runnin' and try to beat the masses And go get yourself some cheap sunglasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr.EasyCakes",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Great glasses but not durable.",
      "text": "Love the glasses but the hinge on the right temple broke today. I bought them less than nine months ago and wore them maybe twenty times. Always kept in the case when not in use. I know that they are not Serengeti but should be more durable than that.",
      "rating": 1.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20170701
    }
  ],
  "product_meta": {
    "title": "Eye Love Polarized Sunglasses for Men and Women - Glare-Free - 100 Percent Uv Blocking",
    "rating": 4,
    "feature_bullets": [
      "WHILE OTHER SUNGLASSES have no polarization, minimal UV protection, or simply just break after a few uses, Eye Love Polarized Sunglasses have 100% UV protection, polarized, glare free lenses, and are made with TR-90 material. This means BETTER EYE PROTECTION, LESS UNWANTED GLARE, and sunglasses that actually LAST. Awesome frame",
      "ELIMINATES GLARE THAT MAKES IT DIFFICULT TO SEE → Polarized lenses that block 100% UVA and UVB rays provide superior eye protection. They block the harmful sun's rays from damaging your eyes, which can cause cataracts, macular degeneration, cancer, and wrinkles. These sunglasses are great for driving, time at the beach, sports, and any other adventure with this polarized lens",
      "100% UV PROTECTION! Our lenses use Premium technology to block 100 percent of both UVA and UVB rays that can harm your eyes. So, protect one of your best features with our high-quality",
      "Lens width: 58-14-150 millimeters",
      "GLARE ELIMINATING, POLARIZED LENSES THAT BLOCK 100% UVA AND UVB RAYS FOR SUPERIOR EYE PROTECTION - Eliminate glare that makes it difficult to see. Blocks the harmful sun's rays from damaging your eyes, which can cause cataracts, macular degeneration, cancer, and wrinkles.",
      "LIGHTWEIGHT FOR MAXIMUM COMFORT - Lightweight plastic frame front with unique stainless-steel, double-spring hinges that are sturdy and designed for maximum comfort.",
      "BONUSES FOR YOU → EYE HEALTH E-BOOK, SOFT MICROFIBER CASE, AND SCREWDRIVER - Easy storage with a soft case just in case you need to store them someplace small. This microfiber case material allows for easy cleaning as needed, and the screwdriver allows you to tighten any loose screws. DID WE MENTION THE BOX DOUBLES AS A HARD CASE? So don’t throw it away!!",
      "WE BELIEVE THAT EVERYONE DESERVES GREAT VISION → But, 700 million people are blind due to lack of glasses. That’s why, for every product you purchase, we give an eye exam, glasses, and sunglasses to someone in need. This is on top of our 100% satisfaction guarantee.",
      "ICONIC, RECOGNIZABLE STYLE → You want to be noticed with a classic look and impeccable taste. That’s why we created this pair of shades, so that you’ll always look your best."
    ],
    "categories": [
      "Accessories",
      "Sunglasses",
      "Women",
      "Clothing, Shoes & Jewelry",
      "Sunglasses & Eyewear Accessories"
    ],
    "price": 29.97,
    "specifications": {}
  }
}