{
  "website_summaries": [
    {
      "verdict": "A smaller everyday hammer with a pleasing feel and a low cost. Some owners wish they owned more than one.",
      "pros": [
        "Easy-grip handle is comfortable and feels great in the hand",
        "Bright color is highly visible",
        "Small and portable for workers on the go"
      ],
      "cons": [
        "Some owners question its \"dead blow\" characteristics",
        "It's more for an everyday tool box than it is for automotive purposes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "NOT a dead blow. Subpar quality. Buyer beware.",
      "text": "Not a dead blow hammer as the title and description says. Just a coated ball peen hammer. No bearings inside of it to constitute the name. The handle is not solid as the rubber grip actually shifts around whatever is used as its core. The exterior metal is quite soft and gouges easily. A Harbor Freight hammer damaged it. May be worth the $10 to some but if you are wanting a dead blow or even a decent hammer, I'd look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian B",
      "helpful_votes": 10,
      "publication_date": 20170402
    },
    {
      "title": "This product should be much harder!",
      "text": "I don't like the fact that after a year of use not continuously it started looking as it does, what is this made of? Bubble gum?",
      "rating": 1.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 5,
      "publication_date": 20190511
    },
    {
      "title": "NO CIGAR!",
      "text": "I have the Armstrong hammer and this Chinese hammer does not meet that standard. This hammer has a light head and so the 32 oz is distributed in a manner that does not maximize the impact. The Armstrong hammer, made by Trusty-Cook, is perfectly balanced with a bigger more substantial head. The Chinese hammer has less dead blow action ( shape of shot chamber, weight of shot, size of shot, etc,) and is inferior to the Armstrong in delivering maximum shock to the striking surface. This hammers are for automotive/ industrial applications not for driving nails.",
      "rating": 3.0,
      "verified": true,
      "author": "William Nelson",
      "helpful_votes": 3,
      "publication_date": 20170110
    },
    {
      "title": "Not tough enough",
      "text": "I originally gave this a good review, but yesterday I actually used it slightly hard, popping a brake rotor off. No big task for a serious tool. The hammer face marred like it was made of soft clay. Never had a hammer do that.",
      "rating": 1.0,
      "verified": true,
      "author": "Art Lange",
      "helpful_votes": 6,
      "publication_date": 20170810
    },
    {
      "title": "Not quite what I expected",
      "text": "Not 100% what I was looking for but useful mean the same the head of the hammer is not quite as hard as I expected anime eyes of dead blow means there is some kind of element within the hammer that shifts to create an additional Force this does not have that it is a ball-peen hammer with a softer metallic face not quite as soft as bronze but when you use it you can notice obvious damage to the Head still very useful not a bad purchase for the money",
      "rating": 2.0,
      "verified": true,
      "author": "Richard s cross",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Metal face deadblow.",
      "text": "This is a great purchase and supplier. I have bought two other dead blow hammers and neither has the metal surface that this has. When I bought the other hammers, several purchasers complained that the had busted the face of those hammers. Since we want to drive stakes for plants and some of these are metal, we will enjoy the use of this hammer without those worries.",
      "rating": 5.0,
      "verified": true,
      "author": "Tad",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "You get what you pay for",
      "text": "I wanted a hammer like this for some limited but heavy duty. It does the job. Are there better quality hammers like this out there?....absolutely. But for something I need may 2-3 times a year, it will likely out live me and perform well doing. Satisfied with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill in VA",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Softer than expected",
      "text": "Is that supposed to be four on the other one I bought softer material than I expected dead blow to me means that there is some kind of media within the hammer that allows for an additional Force when striking this does not have that this is a standard ball peen that is not case-hardened",
      "rating": 2.0,
      "verified": true,
      "author": "Richard s cross",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Nice hammer but face is soft",
      "text": "I bought this because my Snap-On hammer I had broke and after 4 months if waiting for warranty to still not come through I needed a hammer. At first glance it looks almost like a older Snap-On hammer but the face is definitely softer but for the price I would buy it again",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Morinville",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Not a deadblow!",
      "text": "This is a decent hammer, but it is not a deadblow hammer. Also as other reviewers noted, the handle is fairly small in diameter.",
      "rating": 3.0,
      "verified": true,
      "author": "J Bruning",
      "helpful_votes": 2,
      "publication_date": 20180520
    },
    {
      "title": "Foolish to not buy a few!!!",
      "text": "I've gotten more use out of this than everything except my tiniest​ Sears ball Peen and my heavy Snap-On dead-blow!",
      "rating": 4.0,
      "verified": true,
      "author": "Nicholas",
      "helpful_votes": 3,
      "publication_date": 20170723
    },
    {
      "title": "Cheap hammer.",
      "text": "Using it in a professional shop for a couple of months and it is just OK. The head is softer than any other steel hammer I have ever owned. ? The head has started to mushroom with light to medium professional shop use in just a couple of months. I now use it when I want a \"softer\" hammer. The \"dead blow\" action is far less than my other dead blow hammers. It's another cheap \"looks like the real thing\" product. Just my opinion.",
      "rating": 2.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Good cheap hammer",
      "text": "The only person not happy with this hammer is my snap on guy. Solid hammer for the price. Only slight negative is that there is minimal dead blow function if any. But for my needs it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick S.",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Automotive industry",
      "text": "I use this to shock drum brakes loose. Only hit between studs and never on the hub. Great hammer and nice grip. Works great for shocking rusted part. PB blaster and this hammer are a good combo. Really nice with a puller also.",
      "rating": 5.0,
      "verified": true,
      "author": "Camaro 1995",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Not a deadblow, but is made from the finest cheese grade steel!",
      "text": "To start with, this is NOT a deadblow hammer. There is not any shot in the head that I can tell. Also, the face of the hammer is supper soft. After just one use hitting a punch, it looks like a waffle head framing hammer. Don't waste your money on this pile of poo. Just buy a regular ball peen hammer.",
      "rating": 1.0,
      "verified": true,
      "author": "Shanon",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Not a dead blow in what is called a dead ...",
      "text": "Not a dead blow in what is called a dead blow. It is a ball pein that is covered with urethane coating. Have used on several brake services to hit a slap driver to remove retaining screws. Worth the money especially for a everyday mechanic's hammer.",
      "rating": 5.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 2,
      "publication_date": 20170330
    },
    {
      "title": "Decent for the Mon’ Hon’",
      "text": "This hammer works great. I don’t think it’s shot filled, but it doesn’t seem to bounce either. I’ve used it to pound in a few pins and bushings so far and other than the face getting a bit dented it’s holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mackluth",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "You get what you pay for!",
      "text": "You get what you pay for! It is not really a dead blow hammer. The face is soft chrome and after using several times the chrome has flake off and the face of the hammer has dented and is damaged. It is cheap, it works but not a true dead blow hammer.",
      "rating": 3.0,
      "verified": true,
      "author": "Mattel",
      "helpful_votes": 2,
      "publication_date": 20170912
    },
    {
      "title": "Get what you pay for",
      "text": "So far this Hammer is working pretty good, but not sure how long it'll last. The head warped after just a couple uses, but you get what pay for I guess.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Not what it seems",
      "text": "As others said, not a deadblow. Rubber hammer is bright, not very solid. Not an actual 1 pound hammer, much heavier. Will be repurposed to some other use.",
      "rating": 1.0,
      "verified": true,
      "author": "TimmyMcG",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Alot of Bang for the buck!",
      "text": "So far so good. My $80 Snapon fell apart. I'm not claiming that this hammer is better, but I can buy 6 of them for the price of one snapon. Feels good in the hand powerful strike. Pretty solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Tolkupois",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Nope!",
      "text": "Handle is not ergonomic, very hard to hold. Handle is small. Not a dead blow. I would not recommend. One small job, this is result. (Pics)",
      "rating": 2.0,
      "verified": true,
      "author": "curtis perry",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Must have tool",
      "text": "Working in a boat shop requires many tools. This hammer gets the job done, feels more solid than my wooden handled hammers, doesn't absorb water or chemicals that break down materials, bright orange sets mine apart, purchasing more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Read",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Not a dead blow as advertized and bery soft steel",
      "text": "Severely deformed after one use. Not a dead blow and very soft steel. Not even worth the low price. Better hammers at Walmart. Useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Jayson Fitzgerald",
      "helpful_votes": 3,
      "publication_date": 20190411
    },
    {
      "title": "nice tool",
      "text": "I keep it in my jeep its a great size for repairs on the road! Solid design and well balanced",
      "rating": 5.0,
      "verified": true,
      "author": "zengoose10",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "NOT DEAD BLOW HAMMER",
      "text": "I should have read the reviews not the description. For the money there are many options. It was a great price on a dead blow hammer. But turns out it's not a dead blow so now I feel I overpaid!!! Save your money there are better choices.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Great hammer with a great grip",
      "text": "The hammer has a soft silicone like handle that makes it so easy to hold with control so you can get accurate hard strikes with consistency which is all from the grip you get with this hammer",
      "rating": 5.0,
      "verified": true,
      "author": "George Balan",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Nice not much of a dead blow",
      "text": "Good hammer but no needs in it, so more of a mallet. With steel caps it will last a while",
      "rating": 3.0,
      "verified": true,
      "author": "T3 Painting",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Happy with this hammer",
      "text": "Very useful utility hammer. I grab this as often as any of my other hammers that were much more expensive. Wish they had a few larger sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil B",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Tough hammer",
      "text": "It’s not a dead blow but I’ve had one for 2 years now working individual maintenance. It’s a good hammer if you need to beat on something real hard definitely gets the job done. Cracked the handle but nothing some heat shrink couldn’t fix lol. Buying another one today.",
      "rating": 3.0,
      "verified": true,
      "author": "Jordan Balowski",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Pointed head",
      "text": "The head of the hammer is not flat, it is slightly pointed. I have never seen a hammer like this. If I would have known this, I would not have bought it.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Not a dead blow hammer",
      "text": "Ordered this because I wanted a dead blow ball peen hammer. This is just a plastic handled ball peen hammer. I didn't realize this until after the return window. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "katox1",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Heavy duty",
      "text": "Nice Pall Pein Hammer. Good quality and has a good weight behind it to move the most stubborn things that need moving",
      "rating": 5.0,
      "verified": true,
      "author": "Pepper ",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Not very durable!",
      "text": "Face has a cheap metal cover. Easily damaged, even when striking soft metals. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew O. Dennis",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "It's a hammer, it hammers.",
      "text": "It works just like the ones you pay double for, off the truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Lynn",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Great!",
      "text": "Ordered for my bro in law. He’s a mechanic & it worked out great for him!",
      "rating": 5.0,
      "verified": true,
      "author": "Bri Ochoa",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Is not dead blow.",
      "text": "Simply put....it is not a dead blow. There is no cavity with shot in it. The description is untrue.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark J. Melesky",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Great hammer for the money",
      "text": "I use this hammer to install pin wiper seals. So far excellent durable face and easy to swing all day if needed. The color is perfect to keep from getting misplaced out in the field.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Feels like an old friend.",
      "text": "Bought this to replace a 25 year old blue point hammer that finally fell apart on me. Other than the color difference it hefts, feels and works exactly the same.",
      "rating": 5.0,
      "verified": true,
      "author": "stuurm2",
      "helpful_votes": 3,
      "publication_date": 20160402
    },
    {
      "title": "Good hammer for the price",
      "text": "So far so good. Used it a bunch and has lasted well. For the price can’t beat it",
      "rating": 5.0,
      "verified": true,
      "author": "BugTewl",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Cheap made",
      "text": "This is not a dead blow at all. There is no extra weight in the head and the metal chips and dents very easily",
      "rating": 3.0,
      "verified": true,
      "author": "Drew Martin",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Not a true dead blow hammer",
      "text": "Not a true dead blow hammer. There is no moving pellets inside",
      "rating": 1.0,
      "verified": true,
      "author": "andrewx12",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Only thing that can beat it for the same price ...",
      "text": "Only thing that can beat it for the same price is this hammer with a lifetime warranty.....it's equivalent to my Mac dead blow in size and weight but the Mac is guaranteed for life but it is also $90...so under 15 is well worth it",
      "rating": 5.0,
      "verified": true,
      "author": "ryan fetting",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "Great workmanship.",
      "text": "Good handling. Great balance. An essential part or my tool box.",
      "rating": 5.0,
      "verified": true,
      "author": "Dimas",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "The bright color well show up in the grass a lot better than my old dark red hammer",
      "text": "I well be using this hammer this week for the first time. I'll be camping this week and well be driving 18\" stakes in the ground to hold my tent and dining fly in place. I use a 1 pound dead blow hammer now and expect the 2 pound hammer to work just as well as my old hammer. The bright color well show up in the grass a lot better than my old dark red hammer. This is a great hammer and the price is even better. Thank you for asking my opinion, have a great day. JT Timmons Logansport,IN",
      "rating": 5.0,
      "verified": true,
      "author": "John E. Timmons",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Great look and works great",
      "text": "Feels good quality and I have used it several times already and it has worked as I needed. The finish has held up so far.",
      "rating": 5.0,
      "verified": true,
      "author": "wesley eitel",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Does the job",
      "text": "Use for setting heavy duty anchors in the floor for batteries cabinets. Well worth the money. Very durable",
      "rating": 5.0,
      "verified": true,
      "author": "SMACKattack",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Good hammer",
      "text": "Not a bad hammer, works just like it should. Not sure if it will hold up with everyday use but, seems like a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Free willy",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Great shop tool",
      "text": "Like the 1 lb. version of this hammer. Great Choice for assembling or dis assembly of small engine components.",
      "rating": 4.0,
      "verified": true,
      "author": "David L.",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Good hammer",
      "text": "So far this hammer is performing well it is being used in an industrial injection molding shop ,its my main go to hammer",
      "rating": 4.0,
      "verified": true,
      "author": "ddl",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Don't expect much.",
      "text": "Hammer feels decent and hits pretty hard. But at the end of the day it's just a cheap China made hammer so don't expect it to be the end all be all of hammers. I used it for the first time yesterday to persuade a rotor off of a hub and the face already started to deform. I don't see this hammer lasting more than a month.",
      "rating": 2.0,
      "verified": true,
      "author": "john green",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Good product",
      "text": "Better than I expected, I thought I was going to get a hammer made of all plastic, but the orange is like a rubberized feel. feels sturdy, not a fan of the chrome look though.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Very nice",
      "text": "Did not use much yet but looks like it'll do the job.",
      "rating": 3.0,
      "verified": true,
      "author": "Ramir Quiambao",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Great value!!",
      "text": "It's the same quality as the ones that sell for twice the price. It hammers, it peens, it don't bounce.",
      "rating": 5.0,
      "verified": true,
      "author": "Gayle LS",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "striking surfaces are softer than brass hammers.",
      "text": "heads are very soft,i wanted a dead blow ball peen hammer not a brass type hammer.tow uses and the striking face is deformed.I thought being a ball peen hammer the striking surfaces would be harder.It will be a tool box queen when i get better ones.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Great hammer, can't beat the price! Wish they had more assorted weights!",
      "text": "This hammer is great for what its designed to do. I wish they came in assorted weights. Competes with my co-workers Snap-On brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Cowie",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "Very Pleased",
      "text": "Bought this for my husband and he is very pleased with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla Baker",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "First-rate Utility Hammer",
      "text": "First-rate (N.B.) - utility - hammer. An added benefit would be to have the hammer’s weight - 2lb - embossed on the orange head.",
      "rating": 4.0,
      "verified": true,
      "author": "Majoch",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Ok but not of great material",
      "text": "Used this for a month now, hammer head is scarred pretty bad. But for the money I recon it’s pretty good",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Ward ",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "High quality low price.",
      "text": "As good as a hammer costing 4 times as much. I'm on",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Campanella",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Good price, good quality.",
      "text": "Good quality for the price. I bought it to use stamping serial numbers into cast iron at work. Does a good job without the bounce a wooden handle has. One of my coworkers is even borrowing it now.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Cheap",
      "text": "Not a dead blow, this product is illegal as there are no markings of anything on it. No place of manufacturing, weight or durability.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexander N Chesna",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Great little hammer for the price snap on get a ...",
      "text": "Great little hammer for the price snap on get a over 75 bucks for the same thing I'd buy it again for this price",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel  Edward",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Two Stars",
      "text": "Cheap price. It will do the job but handle is too skinny.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian S. Harmon",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "too small",
      "text": "This hammer is more like a 16 oz size.I might send it back but for the price Ill probally just keep it",
      "rating": 4.0,
      "verified": true,
      "author": "v",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "Four Stars",
      "text": "good for the price. this type of hammer getting difficult to find.",
      "rating": 4.0,
      "verified": true,
      "author": "house",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Great tool",
      "text": "I got this for my husband for his job. It works perfect! He said for a smaller hammer it does the job just right. It's not too bulky and it's not too heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "SPol",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Great for the",
      "text": "Decent overall automotive and light industrial hammer. Resembles a snap on brand type. Great for the money",
      "rating": 4.0,
      "verified": true,
      "author": "Rooster",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Five Stars",
      "text": "Very good deal works great cheapest I've been able to find one",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel  Edward",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "I'm not sure how they consider this a dead blow ...",
      "text": "I'm not sure how they consider this a dead blow. It has no media in the head. It's just a plastic handled ball pien. The price is decent.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy Chrastil",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "but looks just like the Snap On hammer its replacing",
      "text": "Wasn't quite finished as it should have been, but looks just like the Snap On hammer its replacing. Can't lose for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Regular Guy",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Would not buy again",
      "text": "No a true dead blow hammer More like just a hammer There no beads in the middle to absorb shock",
      "rating": 1.0,
      "verified": true,
      "author": "Jay grier",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "For the price works great. Will probably be ordering more in the future",
      "text": "For the price works great. Will probably be ordering more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "High quality DB hammer, durable and bright, have used it several times now and I am very satisfied.",
      "text": "Great Product, have used it several times for tent stakes, high quality and high visibility.",
      "rating": 5.0,
      "verified": true,
      "author": "California Consumer",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "Five Stars",
      "text": "Exactly what I needed to go in my Jeep trail tool bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Easley",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Not a dead blow and very soft steel.",
      "text": "After one use the hammer was severely deformed. Also hammer is not a dead blow. Wish I had read the reveiws before buying. Not even worth the $12.",
      "rating": 1.0,
      "verified": true,
      "author": "Jayson Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Dead Blow Hammer",
      "text": "Excellent deal for the money ! Paid $60 for Dead Blow Hammer just like it. Surprised at how good the quality is especially for the price paid. Once you have used a good Dead Blow Hammer like this you realize what a difference it makes. Just as good as a $100 Dead Blow Hammer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Soft",
      "text": "Head of hater is a little soft for a dead blow",
      "rating": 4.0,
      "verified": true,
      "author": "Diesel mechanic ",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Snapon version over $100 give this a shot probably won't last very long in pro environment",
      "text": "Very cheap striking face and very soft steel but one hell of a hammer for the price but it probably won't last very long",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Schmidtman",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Great product",
      "text": "Just perfect for the job. Good quality and fast shipping!",
      "rating": 5.0,
      "verified": true,
      "author": "benjamin",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "great product.",
      "text": "Recently purchaced this hammer to replace a snap on dead blow that finally went south; can't tell the difference. great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "Great value on a nice hammer",
      "text": "Great value on a nice hammer, it is heavier than 1lb but it's nice to have the weight in a small package.",
      "rating": 5.0,
      "verified": true,
      "author": "srcarr",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Could have soft grip handle...",
      "text": "Not as good as the snap on but at 1/10th the price you cant beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Oliver Wade",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "good 2 go",
      "text": "Strong does the job. Wish they had a 3 lb",
      "rating": 5.0,
      "verified": true,
      "author": "Old school",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "recommend for mechanic",
      "text": "Not a dead blow it is a ball pein. It is a urethane covered hammer that works great for automotive work. I bought both 1 and this 2 pound versions, and they have done me great. Recommend for mechanic. And for you techs that buy off the trucks, just wanted to say the \"ON\" truck guy thought they where \"M-c\" truck brand lol.",
      "rating": 5.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "Five Stars",
      "text": "These hammers are great would recommend them to anyone In manufacturing maintenance",
      "rating": 5.0,
      "verified": true,
      "author": "jonathon blum",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "Nice handle but head seems soft",
      "text": "So I bought this instead of spending 8 times the money for snap on, I can say it has similar looks but That’s about it, within a couple hits on a ball Joint and a punch I notice that the chrome had all ready dented ( but no cracks in finish) so I’m not sure what’s going on but it hasn’t gone further then the surface, still like it over my wood handle ball pein. Oh and there is no shot inside to make it a dead blow effect. Otherwise it’s still a decent hammer and always my first choice out of all the others",
      "rating": 4.0,
      "verified": true,
      "author": "chooster5000",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Not a deadblow.",
      "text": "It's a cheap hammer. Seems like it will work ok, but it is not a dead blow. I'd rate it higher if it weren't falsely advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert V Jessmon III",
      "helpful_votes": 4,
      "publication_date": 20160630
    },
    {
      "title": "Not Dead Blow",
      "text": "This is not a dead blow hammer. That being said, it is a decent ball peen hammer for $10.",
      "rating": 1.0,
      "verified": true,
      "author": "Pbaff",
      "helpful_votes": 3,
      "publication_date": 20160930
    },
    {
      "title": "Larger than expected, which says I should read the ...",
      "text": "Larger than expected, which says I should read the product description more closely. Works as advertised. Would have preferred a wooden handle but the plastic one is beefy and quite adequate.",
      "rating": 5.0,
      "verified": true,
      "author": "John Waidner",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "but still a good hammer for the price",
      "text": "I don't think it has the lead shot inside. but still a good hammer for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert L.",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "One Star",
      "text": "This hammer isn't a deadblow, just a regular ballpein hammer. Ideals refuses to address the false labeling of it.",
      "rating": 1.0,
      "verified": true,
      "author": "LHK1",
      "helpful_votes": 4,
      "publication_date": 20160814
    },
    {
      "title": "Two Stars",
      "text": "The hammer works fine, but it's not truly a dead blow.",
      "rating": 2.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "Not the best but has it's uses",
      "text": "Metal on hammer is super soft dents very easy. Shiny covering on metal came off in first few hits with hammer",
      "rating": 3.0,
      "verified": true,
      "author": "Nicholas Bulloc",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Not a dead blow but a solid head hammer.",
      "text": "Mine is not a dead blow. If it has any shot in it I cant tell, it feels like a solid head hammer and behaves in that manner. It won't last long, the steel is extremely soft and is showing excessive wear for the use it has seen.",
      "rating": 1.0,
      "verified": true,
      "author": "wvhillbillie",
      "helpful_votes": 2,
      "publication_date": 20170318
    },
    {
      "title": "Great price",
      "text": "Great price and it works like a dead blow should!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff W. Johnson",
      "helpful_votes": 0,
      "publication_date": 20160225
    },
    {
      "title": "Five Stars",
      "text": "Works as good as the snap on that stays home. And this one in the jeep tool bag",
      "rating": 5.0,
      "verified": true,
      "author": "Marco",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Four Stars",
      "text": "Works good. I hope it lasts. Seems well made for price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "Really nice for beating on stuff!",
      "text": "It's fits right line with my matco hammers I wished I would seen before 10x this price for a tool truck hammer. I have every in the shop using it this week just to test it out. No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Newtonresto",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "NOT A DEAD BLOW HAMMER!!!!!!",
      "text": "THIS IS NOT, NOT A DEAD BLOW HAMMER. It's an OK normal ball pein hammer though the chrome plating is weird and the ball end is oddly shaped: it would not do a nice job for decorative peining, say.",
      "rating": 2.0,
      "verified": true,
      "author": "Wackezoid",
      "helpful_votes": 0,
      "publication_date": 20161220
    }
  ],
  "product_meta": {
    "title": "XtremepowerUS 1-Pound Dead Blow Hammer Dual Head Ball Peen Blow Striking Flat Pein 16oz, Orange",
    "description": "Size:1lb\n\nDead Blow Ball Peen Hammer is an optimal machinist hammer. It combines the effortless positive strike from a dead blow hammer with hardened steel domes for shaping and forging metal. The steel faces are used for striking, shaping, flattening and expanding metal. Show-filled dead blow action reduces rebound while providing maximum striking force, saving your arm and wrist from strain and capable of giving the force you need in tight spot. The premium polyurethane construction is not only durable but also resistant to a wide variety of oils and solvents. Textured handle provides a non-slip grip\n\nFeatures:\n\n * Polished Steel Hammer Face and Peen - Provide for a smooth striking surface ideal for striking hammering and straigtening metals and striking punches and chisels\n * Shot Filled Bead Blow - Enhances rebound reduction and providing unequaled striking force. The feature reduces fatigue allowing you to use this hammer all day\n * Industrial Construction - Welded steel shanked handle is fixed to canister head and throughout the handle providing unmatched strength. The flared end and textured polymer overmold grip ensures the hammer stays in your hand\n * Non-marring, Non-sparking - Unicast poly molded body prevents hammer from wearing away between the head and handle and material prevents sparks upon impact\n * Resistant Material - Hammer may look soft, but it can take a lot. It's also resistant to water, oil, grease, and many other chemicals that would easily degrade other hammers\n\nSpecifications:\n\n * Color: Orange\n * Material: Polyurethane\n * Dual Faces: Steel\n * Flat Face Diameter: 1-1/4\"\n * Ball Pein Face Diameter: 1\"\n * Length: 12-3/4\"\n * Head Weight: 16oz/1lb\n * Tear Resistant: Yes\n * Water, Oil and Grease Resistant: Yes\n * Shock Absorbent: Yes\n\nPackage Contents:\n\n * Ball Peen Hammer",
    "rating": 4.3,
    "feature_bullets": [
      "Polished Steel Hammer Face and Peen - Provide for a smooth striking surface ideal for striking hammering and straigtening metals and striking punches and chisels",
      "Industrial Construction - Welded steel shanked handle is fixed to canister head and throughout the handle providing unmatched strength. The flared end and textured polymer overmold grip ensures the hammer stays in your hand.",
      "Industrial Construction - Welded steel shanked handle is fixed to canister head and throughout the handle providing unmatched strength. The flared end and textured polymer overmold grip ensures the hammer stays in your hand.",
      "Shot Filled Bead Blow - Enhances rebound reduction and providing unequaled striking force. The feature reduces fatigue allowing you to use this hammer all day.",
      "Industrial Construction - Welded steel shanked handle is fixed to canister head and throughout the handle providing unmatched strength. The flared end and textured polymer overmold grip ensures the hammer stays in your hand."
    ],
    "specifications": {
      "Manufacturer": "XtremepowerUS",
      "Part Number": "15145-XP",
      "Item Weight": "1 pounds",
      "Package Dimensions": "13.31 x 5.35 x 1.42 inches",
      "Item model number": "15145-XP",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1lb",
      "Color": "Orange",
      "Material": "Steel, Polyurethane",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0184RUYH4",
      "Customer Reviews": "4.3 out of 5 stars317 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#39,228 in Tools & Home Improvement",
      "Date First Available": "November 17, 2015"
    },
    "categories": [
      "Dead-Blow Hammers",
      "Hand Tools",
      "Hammers",
      "Tools & Home Improvement",
      "Power & Hand Tools"
    ],
    "price": 13.95
  }
}