{
  "website_summaries": [
    {
      "verdict": "Surpasses the competitors in almost every way – affordable price, versatile use, and long-lasting comfort. The best value available.",
      "pros": [
        "This mask offers numerous nice features for the price, including a soft side, contoured fit, and beaded fill",
        "Can be used warm or cold",
        "available in 8 colors"
      ],
      "cons": [
        "The strap may fit too tightly on some users – it would be much better if it were adjustable",
        "Caution must be taken not to overheat it when microwaved"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "30 Seconds to Boom!",
      "text": "I had to return for a refund. I put it in the microwave for 30 seconds. At the 26 second mark, it exploded. Cheap cellophane type film over the beads,",
      "rating": 1.0,
      "verified": true,
      "author": "musclegirl",
      "helpful_votes": 31,
      "publication_date": 20180402
    },
    {
      "title": "very painful sinuses and the bones all around the sinuses",
      "text": "I have a cod/flu \"thing\" with very, very painful sinuses and the bones all around the sinuses. The package was delivered directly to my apartment door, which was wonderful; I opened it; put the mask in the microwave for about 45 seconds and then over my eyes. And Ahhhhhhhhhhhhh; it was a complete relief from pain. I relaxed - more so then in the last five days. Am I cured - No but perhaps now my system will show its gratitude and throw the Bugs out. Thank you to the designer, manufacturer, supplier and everyone who had any part in bringing this product to me. Thanks Amazon and thanks to the delivery people.",
      "rating": 5.0,
      "verified": true,
      "author": "Thought full",
      "helpful_votes": 28,
      "publication_date": 20171205
    },
    {
      "title": "good alternative",
      "text": "A warm, damp compress was recommended by my optometrist for dry eyes. This is much easier to quickly heat in the microwave. 30 seconds is all that it takes in our microwave. While it doesn't seem very warm, it is plenty, as it would be easy to injure your eyelids and skin if it is too hot.",
      "rating": 5.0,
      "verified": true,
      "author": "scccnana",
      "helpful_votes": 31,
      "publication_date": 20170417
    },
    {
      "title": "I ordered a second one",
      "text": "My eye doctor recommended something similar - wanted to charge me over $30 for the one they carry but, fortunately, they were out of stock. Came home and ordered the pink one. I like it - it heats up in about 30 seconds, holds warmth for quite a long while, and if i want to i can use it around the back of my neck instead of over my eyes - so versatile! Since it can be used for heat OR cold, I am keeping my pink one for heat, and ordered a blue one to keep in the freezer.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Schmidt",
      "helpful_votes": 24,
      "publication_date": 20170502
    },
    {
      "title": "Feels great and works great!",
      "text": "I've used this twice and I love the way it feels. I'm using it for dry eye syndrome so I do hot compresses twice a day. My only complaint is that this came in a thin plastic bag with no tags, just a small label identifying what it was on the outside of the bag.. The instructions for use were on a tag sewn to the eye mask instead of on a paper insert with the mask. At first I wondered whether this was a return but it appears new. I've used 2 other masks, one with lavender and one without and this one is the one I like best.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Hudson",
      "helpful_votes": 15,
      "publication_date": 20171003
    },
    {
      "title": "Doesn't fit or work as well as I wanted",
      "text": "I bought this mask to try to lessen my under eye circles. Unfortunately, it doesn't fit really well; there are large gaps between my nose and mid-cheekbone, so it doesn't lay on the same areas I need it most. Secondly, the strap is too loose, even when adjusted, so it sags and slips, making it quite uncomfortable. Lastly, I haven't noticed a difference in my eye circles, likely because of everything I mentioned above. It also doesn't stay cold for more than fifteen minutes. Overall, this just didn't work for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Chasing Phalanx",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Good product",
      "text": "Great product, stays cold for a long time. I don’t understand some of these bad reviews about it breaking... If you put it in the freezer for the recommended time it’s perfect and flexible and if u leave it in overnight yes it will be harder and more frozen so just don’t bend it really hard or fast, anything would crack if u did that. If ur gentle with it it’s fine and works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 3,
      "publication_date": 20181015
    },
    {
      "title": "DO NOT BUY! TERRIBLE PRODUCT",
      "text": "Terrible product. This is what happened when I tried to heat it for 30 secs. It wasn’t even hot! And it busted and all the beads flew out. Very disappointed with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Elisha",
      "helpful_votes": 7,
      "publication_date": 20181130
    },
    {
      "title": "They Freeze Solid",
      "text": "I didn't get a chance to try these out until after the return window closed, otherwise I would've returned them. The fabric on the backside is soft, microfiber plush feeling. The Velcro strap seems sturdy. The problem is that there is liquid inside the pouch outside the beads. So when I froze this, instead of being cold and bendable (from the beads), the liquid around the beads froze solid, and it was like straping a lunchbox ice pack to my forehead. Disappointed because I was really excited for these to replace an old one I had.",
      "rating": 2.0,
      "verified": true,
      "author": "Tyler S.",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Cooling relief",
      "text": "I bought this item because I was having migraines and also dry and itchy eyes from allergies. I like that I can just pop this in my freezer and take it out when I need some relief. It is well-made and feels really good on my skin. My only complaint is that the fleece side doesn't always get cold enough to bring me the relief that I need, whereas the plastic side can be too cold or uncomfortable. I would definitely recommend for migraine-sufferers!",
      "rating": 4.0,
      "verified": true,
      "author": "Chelsea Shumaker",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Fell apart after three uses.",
      "text": "This is my third time using it. I noticed the gel beads had spilled all over the bed while I was laying down with the mask on. The plastic separated from the seam, so now the bed is wet in spots and I had to clean it all up. Not the greatest experience to have in the middle of a headache. Thankfully I have another one from a different brand that is much higher quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Kawaii-ai",
      "helpful_votes": 2,
      "publication_date": 20190809
    },
    {
      "title": "When they’re good, they’re very good...",
      "text": "The good ones work really well, so well that despite one out of my first order being bad, I ordered 4 more. I got another bad one. By bad I mean that some of the beads inside have burst and the whole thing freezes into a solid bar. It loses flexibility, the whole point of a migraine mask. The ones that are undamaged are great, very comfortable and effective. I will be ordering again, trying to get a full set of good ones!",
      "rating": 4.0,
      "verified": true,
      "author": "Samm",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "It might burst if you roll over on it...",
      "text": "Migraine sufferers- this will stay cold and is probably ok if you only put it over your eyes but as most migraine sufferers know, if you are in the middle of an episode and the pain is brutal, the jackhammer may be hitting the base of your skull. You may inadvertently reach out and grab the cold mask to place on the jackhammer site. Apparently this item is not sturdy enough to withstand being laid on. I did and woke up in a puddle of gelatin beads and some had burst leaving a sticky substance on my pillow, shoulder, and in my hair. In my migraine I was picking up piles of slimy beads and threw away the whole thing.",
      "rating": 2.0,
      "verified": true,
      "author": "Gypsy Lane",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Love this mask! Great for mild headaches at a good price.",
      "text": "Actually, I love this mask for its versatility, the cool gel and the adjustable band. I have small facial features; therefore, I would recommend that this product be made in varied sizes to fit different shaped faces. This mask is a bit too big for my face; and the strap, though adjustable, is loose for my head. The gel is awesome! It works wonders for a sinus headache. The opposite side is soft and comfy enough for sleep if you don't mind the added weight from the gel. Check the measurements of the mask against the measurements of your face prior to ordering. One size may fit all; but one size may not be comfortable for all.",
      "rating": 4.0,
      "verified": true,
      "author": "Linee7B",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Just what I wanted.",
      "text": "Just right for napping. You can use it warm, which I do since I have dry eye and heat packs are recommended by y ophthalmologist, or cold if you keep it in the freezer.",
      "rating": 5.0,
      "verified": true,
      "author": "Sagefemme",
      "helpful_votes": 3,
      "publication_date": 20170503
    },
    {
      "title": "Eh",
      "text": "Feels great, very soft material... and yet makes me feel like I am going blind after 2 minutes with it on. My vision get's blurry after I take it off. Also I can't keep in on long in my sleep, it comes of in less than an hour. :/ Yet I keep using it for my dark circles.",
      "rating": 3.0,
      "verified": true,
      "author": "ElectricZepp",
      "helpful_votes": 3,
      "publication_date": 20171102
    },
    {
      "title": "Delivers Significant Dry Eye Therapy",
      "text": "Very effectively relieves my dry eye problem. It’s generous size seems to be much more effective than other smaller brands. I use it twice nightly, once when I turn out the light and go to sleep and then again later in the wee hours before getting up in the morning. Upon taking it off at the end of these sessions my eyes actually brim with natural tears. For convenience I bought a small inexpensive microwave just for the bedroom. At 700 watts it takes one minute to heat the eye cover to a safe adequate temperature. If I can ever find the time in the middle of the day I’ll add a third session.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl W. Shepherd",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Works great!",
      "text": "It's exactly as pictured and described. On the front you have small gel feeling balls and on the back you have really soft fabric. You put it in the freezer a hour or 2 and then strap it on. Its straps really do hold the mask as tight as you want and secure. I liked how the mask still forms to your face even when it first comes from the freezer. I bought the mask due my eyes feeling really itchy & burning from allergies. This mask really soothed the discomfort and I was comfortable enough to fall asleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Perfictionist",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "It feels like heaven on sore eyes, and for only a couple dollars.",
      "text": "I suffer from dry eyes. If you don’t have it you may not know that dry eyes means the fluid in your eyes is sticky, itchy and they burn. I heat this up and it’s feels so good on sore eyes. It opens up your tear ducts, which releases the fluid. I get more relief from this than drops for dry eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Not working for my purposes, but well made",
      "text": "I bought this to try and battle some of my puffy eye issues due to seasonal allergies. Unfortunately the soft side doesn't get cold enough to help me and the plastic side is too cold. It works okay if I take it out of the fridge and wait 30 minutes and then I can put the plastic side against my eyes but it's just not working as well as I had hoped for the purpose that I bought it for. However it does seem to be well made.",
      "rating": 3.0,
      "verified": true,
      "author": "Tess ",
      "helpful_votes": 2,
      "publication_date": 20180529
    },
    {
      "title": "Life saver during pregnancy fatigue!!!",
      "text": "I needed something to help me take naps while pregnant and thought this would be perfect, I was right! Completely dark while wearing, I've frozen it and used the cooling effects! I have not yet needed to try it warmed. Adjustable Velcro elastic head band (i wear a pony high tail with mine) and very soft fuzzy inside material. Definitely got my money worth! I would buy again! Helps me fall asleep and stay asleep with no light interruption and keeps me cool and relaxes me like the cold side of a pillow in this summer heat!:)",
      "rating": 5.0,
      "verified": true,
      "author": "Diffy",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great buy!",
      "text": "Love this mask! Opposite the side where you can see the beads, there's a very soft, plush side that goes against your skin. In previous experience with other masks, this was always either too thick and blocked the cold or was too thin and uncomfortable to wear- this one is just right! It lets me wear the mask without constantly having to adjust it for being too cold. I have a wider face and the sizing is perfect and the elastic band is comfortable. I get frequent migraines so I got it in black just to see if that would help eliminate light filtering through and it does. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica S",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Excellent Sleep Aid!",
      "text": "This eyemask is great! I found it very useful for anytime sleeping because I like a cool pillow (or these) on my head when I sleep. They are filled with little beads that freeze but don't explode. So, putting this on my forehead or over my eyes blocked out the light and felt cool & refreshing. The only downside to them is they don't stay cold long enough - but, hey what are you going to do? Everything has limitations!",
      "rating": 5.0,
      "verified": true,
      "author": "MrStacey",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Very Heavy?!!",
      "text": "Received this yesterday, and was really excited to try! I put in freezer til bedtime. I like a 'good' mask to keep out the sunlight. Bonus, that it could be cold or hot. Very disappointed because this eye mask is very heavy, and did not keep the 'light' out! That could be because I ordered the pink one, dunno?! Doesn't matter because, like I said, it is very heavy and cumbersome. I could ' barely' lift my head off the pillow?! Might not be bad if I lay down and just put on eyes without strapping it around my head, since I already have it. I wouldn't purchase again.",
      "rating": 3.0,
      "verified": true,
      "author": "MichiGirl64",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "yuck! the gell balls inside the mask became a disgusting goo",
      "text": "I bought this mask 10 months ago. I was very happy with it. I put it in the freezer would use it every once in a while for headaches and puffy eyes. Now tho, I've noticed that the gel balls inside the mask are basically reduced to a disgusting goo. I don't think that's normal? I have never microwaved this mask, just put it in the freezer. It looks a little disgusting now.",
      "rating": 2.0,
      "verified": true,
      "author": "Madonna Fiammetta",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Didn’t reduce eye puffiness.",
      "text": "I bought for some added heat on my eyes to reduce puffiness in the morning. It was awfully tight. I fell asleep with it on, thinking that would be okay... DONT DO THIS. I woke up in the middle of the night panicked because my vision was so blurry - I thought I’d never see straight again. Eventually I did but... still had all the puffiness and added anxiety.",
      "rating": 2.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "pay attention to the directions on the head band.",
      "text": "I put mine into the microwave for too long and was fearful that I had destroyed them, but they are good as new. My fault. The directions are clear and sewn in, so they don't get lost. they are comfortable and work well for my dry eye condition. I recently moved from a muggy climate to a high altitude, dry climate and my dry eyes need attention. These are justright for helpimg my eyes to adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "GeeCee",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Loved until one day...",
      "text": "I loved this mask and used it EVERY NIGHT. It was comfortable and when I took it out of the freezer it helped my headaches and sinuses, and it helped me fall asleep. One day I noticed some of the beads falling out, but I continued to use it(how could I not?). The hole in the stiching kept getting worse and now beads are in my hair and all over my clothes and the bed when i wake up. I had only used this for a few months and it broke. So sad 👎🏻",
      "rating": 2.0,
      "verified": true,
      "author": "Megan Behrendt",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Can't live without it!",
      "text": "I suffer from migraines and sinus issues and always have one of these strapped to my head. I like the black as it doesn't show dirt. Can't live without them. Also a nice prop for the ladies with hot flashes. Store in freezer flat, let solidify and strap it on your noggen. And Ariel's customer service is OUTSTANDING. 💞",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Perfect",
      "text": "This eye mask is just what I was looking for. I put it in the fridge to cool overnight. When I need it, it stays cool for about twenty or thirty minutes. The pressure is enough to be comfortable, and the draw string is adjustable. The soft inside is a nice touch. Great product, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Feels  real nice  Cold",
      "text": "I like how soft it feels And the color only thing is I bought this because I have a cornea transplant on my right eye about a week ago .. and I thought maybe the cold would be good but I believe my eye is still to sensitive and it feels very harsh on my operated eye But I’ll say I’m keeping it for when my swelling goes down ! Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Rosanna Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Love it!!!",
      "text": "Love this I love that I can freeze or warm it up I also love the strap its adjustable and if I have a headache in the back of my head I just flip it around and it hold on without slipping off witch is very useful for me as i have two small kids and i cant always just lay down when i get a crippling headache",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby silver moon",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "I wanted to LOVE this product SO MUCH! :(",
      "text": "It absorbs freezer/refrigerator odors very quickly! Even from across the room, you can smell it - for hours! When frozen, it feels too painful to apply directly to my face.... but even with a slight (i.e.: paper towel) \"buffer\" it doesn't seem to work. I DID find that the best way to use this was to WARM IT, in the microwave - but it didn't hold the heat very long. I actually threw it away, two days ago. I wanted to LOVE this product SO MUCH! :(",
      "rating": 1.0,
      "verified": true,
      "author": "Why not?",
      "helpful_votes": 9,
      "publication_date": 20171103
    },
    {
      "title": "Happy with this purchase",
      "text": "Great product for sleep and headache relief. The squishy orbs contour the face really well and the seemless band is strechy and wide enough to feel snug but not too compressive. It's offers large coverage. Is thick for long lasting cooling. When cooling in a fridge or frezzer, I'd reccomend keeping it in a ziplock bag to avoid fabric odor obsorbsion.",
      "rating": 5.0,
      "verified": true,
      "author": "R Garcia",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Yes, you can freeze it, but let it thaw a little before putting it on your face.",
      "text": "I use this primarily for chilling my eyes because I work on a PC all day. I freeze it and take it out to thaw a little before putting on. I don't crush it while its frozen because DUH, that will destroy the jelly beads or whatever it is in there. If you let it thaw a bit before, not fully thawed, you can work with it enough. It serves my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "MLionheart",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "decent",
      "text": "simple to use. i store it in the freezer so it is ready when i’ve got a migraine. i just wish it didn’t freeze so completely solid. with the balls inside, i would have thought it would be more flexible to mould to the eye/face area than it is. i have to force it quite a bit into a less stiff shape or wait for it to thaw a little. a different material for freezing might have made it more flexible but this is good enough for now, especially for the cost.",
      "rating": 3.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Hot or cold pack",
      "text": "This eye mask is nice because you can use it as a cold pack or hot pack. Stick it in the fridge for a while and place over your eyes to help with puffiness or tired eyes, or use to bring down swelling. Heat for short time in microwave to use for muscle aches, cramps, or soreness. The only gripe I had was it's a little too big for my face. Otherwise it's a great item to have in the home!",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Great for migraine relief!",
      "text": "I've had migraines for years and have had many people recommend a mask like this to help alleviate the severity of them but this is the first one I've tried. I'm so happy with how well it works for me. I've used it multiple times at the onset of a headache & gotten great relief from the pain. I've also used it to prevent a headache from evolving into a full blown migraine a few times. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "cynthia shields",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Go for freezer. Don't bother with microwave.",
      "text": "I've only had this mask for a day, but so far so good. The only complaint I have would be blurry vision after I take it off. I haven't put it in the microwave as per other reviewer's warnings, but this works list fine after being left in the freezer for a couple hours. If I need it for heat, I think I'll put it in a waterproof baggie and boil it.",
      "rating": 4.0,
      "verified": true,
      "author": "Xtina w",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Get it!",
      "text": "As soon as this arrived (one day) I popped it in the fridge for awhile and then put it on my eyes. Aaaahhh....so soothing! After a long day with allergies, my eyes literally ache. I had bought other eye masks in the past, but the plastic was hard and pocked me. This eye mask has enough gel balls to really get into my eye sockets (is that a thing?) and cool them. The plastic cover is flexible and the fabric side is really soft. Now I'm going to buy a second one the keep in the fridge at work!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Better than nothing",
      "text": "I like the idea of a hot/cold pad like this but the practice is another thing altogether. I find that if I leave the pad in the freezer it gets frost-bitten or freezes into an awkward shape. I haven't tried heating it because there's so much liquid in it that that makes me nervous. However, the gel masks keep their coldness longer and get colder than fabric rice pads I've used so I do still use this product.",
      "rating": 3.0,
      "verified": true,
      "author": "Lynn Thompson",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Heat/Colds Lasts a While, but Heavy on the Face",
      "text": "I like that it has an adjustable strap, and the hot/cold function is really good. The only complaint I have is that it's heavier than I would like on my face, and because of this I have to wear it very tightly when I sleep so it doesn't fall off. I prefer a lighter mask, but if you like the slightly heavier feeling it's a great mask for you!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "It’s like water- no give when frozen. Useless!",
      "text": "Once upon a time... ice-gels in the freezer were still flexible when I got them out. That’s just not the case anymore. This is like a bag of water I stuck using the freezer, NO give at all until it’s warm! As a migraine sufferer I need molded ice on my head and this doesn’t due it.",
      "rating": 2.0,
      "verified": true,
      "author": "Monique",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Perfect & Relaxing",
      "text": "I love how the item has the suede padding between the gel to your face so the cold or hot is gradually is felt instead of immediate shock in temp. Also can be left in the freezer without worry of it exploding.",
      "rating": 5.0,
      "verified": true,
      "author": "Liv",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Great for headaches and hangovers",
      "text": "I get the occasional migraine, and the more than occasional hangover! I keep this in the fridge for general use, and only freeze it for a little bit when I really need it (I wouldn't store it in the freezer). Works well.",
      "rating": 4.0,
      "verified": true,
      "author": "prodiver22",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Helpful",
      "text": "It's really helpful in night. I keep it in the fridge most of the day and take it out in night before I go to sleep. It help a lot to keep your eyes relax. You can also put it on your forhea if you have hedac, it helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Shafaat",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great eye mask",
      "text": "I need to sleep with an eye mask on because I am very light-sensitive. I have had a variety of different types of masks, but all of them were made of some fabric. The fabric was absorbing too much of my moisturizer. This mask is perfect. I use the gel side, every night.",
      "rating": 5.0,
      "verified": true,
      "author": "Bunny Lee",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "No good",
      "text": "I ordered two masks one for my boyfriend and the other for myself. Straight out of the package The Velcro on the elastic is already coming up on his. And the mask dosnt have enough curve for your nose it’s pretty straight across so it was uncomfortable and I had to take it off. I would recommend spending a few more dollars and getting a different one.",
      "rating": 3.0,
      "verified": true,
      "author": "nicole corin",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Helps these tired, dry eyes",
      "text": "This is a great little product. I suffer from tired, dry eyes and it helps to warm it up a little and just relax my eyes for a while. Good quality. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Pattye Heuer",
      "helpful_votes": 2,
      "publication_date": 20180117
    },
    {
      "title": "I LOVE LOVE LOVE THESE",
      "text": "I HAVE BOUGHT MANY SO I CAN ALWAYS HAVE A COLD ONE TO REPLACE THE ONE I AM USEING AS IT DEFROST . I USE THEM ON MY HEAD AND MY NECK BECAUSE I SUFFER WITH MIGRAINES ... I LOVE LOVE LOVE THESE ... THEY ARE NICE A FULL , NOT FLAT AND SKIMPY ON THE FILLER ... FOR ME THEY ARE A TRUE LIFE SAVER ...",
      "rating": 5.0,
      "verified": true,
      "author": "REGINA GUIDRY",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Really comfortable. Not great quality. Already has a hole.",
      "text": "I loved this mask. Comfortable. Freezable. Super cushioned. The problem? It expanded really big. It already got a hole in it. It leaked crap on my sheets that left an oily looking stain. Not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Blair Westmoreland",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Work as expected",
      "text": "It is easy to use for both cold and warm pad purposes. For heating pad usage, I microwave it for 20 seconds and it works great,",
      "rating": 5.0,
      "verified": true,
      "author": "Kimmie",
      "helpful_votes": 2,
      "publication_date": 20171128
    },
    {
      "title": "When I close my eyes I'm at a the beach",
      "text": "All I have to say is that on a hot summer day I pull this out of the freezer, throw it on my face, close my eyes and I'm at the beach. The fantasy ends when the mask gets hot and melts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Queen",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Dis not like",
      "text": "Freezes too hard to be able to fit your face when you go to use it.. I have another ice pack for headaches and it has a gel inside that freezes but is still able to move while frozen to fit your face.. this one freezes hard as a rock.",
      "rating": 1.0,
      "verified": true,
      "author": "calli adams",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Works wonderfully",
      "text": "This is on of the best eye masks I have ever bought. It does not have any type of plastic smell that a lot of gel masks I have previously bought have had. The head strap is comfortable and the mask stays warm for a long time when used warm. This has really helped with sinus problems, headaches, and relaxation.",
      "rating": 5.0,
      "verified": true,
      "author": "bookperson12345",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Broke the first day I got it",
      "text": "I purchased the white eye mask for swollen eyes and as soon as I opened it and tried to wear it the velcro began to peel off. I just stapled it back on because I didn't feel like buying a new one. The product comes as described and it's a pretty good deal.",
      "rating": 3.0,
      "verified": true,
      "author": "Abby Zolner",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Kind of heavy",
      "text": "It could just be me but this was kind of tight on my eyes and a little heavy. I only use it for a few minutes at a time as like a stress reliever on my breaks at work. Every time I take it off my eyes have to readjust. I couldn't imagine using it overnight. I don't think that kind of pressure would be good on my eyes. Also the velcro vs my hair situation... not fun.",
      "rating": 3.0,
      "verified": true,
      "author": "Rae",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Great price!!",
      "text": "Love this Mask! Love that it stays cold much longer than I expected! Can’t wait to try it warm. Ordering a second to have on hand, or for when my 5yr old wants one as soon as I bring it out... fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Lopez",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Size matters",
      "text": "What were the designers thinking? There is nothing unusual about the size of my head. In fact, when I buy a one size fits all hat I have to tighten the cord a couple of notches in order for it to fit. But the elastic bands are so short that even at their largest possible opening the eye mask is so tight that it gave me a headache. What good is a five star eye mask if it doesn’t fit properly? The bands need to be 2 inches longer.",
      "rating": 1.0,
      "verified": true,
      "author": "Elrey",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Overall pretty good",
      "text": "Stays cool for a decent amount of time - once it cools off a bit you kinda need to switch from the soft side to the gel side. The soft side is really pleasant feeling. Other reviews said you could sleep in it - I don’t see how. It’s not too heavy, but I’d think it’d be too heavy to sleep. Maybe for others. Only complaint is that there’s a bit of condensation that drips off as you use it. Slightly annoying but not that big of a deal.",
      "rating": 4.0,
      "verified": true,
      "author": "alynneadams",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "not quite what i expected but not bad.",
      "text": "Unlike similar gel eye masks I've purchased, for some reason this one froze nearly completely solid. Had to let it thaw and squish it around for a few minutes before it was flexible enough to use. Kind of annoying when you have a headache, but the plus side is that it seems to get and stay colder than the others I've used. The lining is very soft and the strap is plenty long for my largeish head.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenna M.",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Eyes to Rest",
      "text": "I bought this mask for the price and the fact that I suffer from allergies from time to time. It changes colors when it gets cold and it's very gentle to the face. It works wonders to tiring eyes, specially for me that work with mobile and PC devices 90% of the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael Rivera",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Stays hot",
      "text": "Used this for awhile keeps hot for a good amount of time ..nice as an edit I wish I had read all the reviews before purchase because it recently blew up in the microwave. With no instructions about heating it its a wonder it didn't happen sooner.",
      "rating": 2.0,
      "verified": true,
      "author": "Emery H.",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "I love this thing",
      "text": "I love this thing! I used to use a chin strap ice pack I got for oral surgery aftercare to help with my migraines but this is so much better. Also helps me get to sleep if the TV is on. The only complaint I have is that my eye discharge will get kinda built up if I leave the eye mask on for too long. Otherwise I love it ♡",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Skiba",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Very soothing",
      "text": "This is great for me, I had cancer at 29 and a hysterectomy was part of my treatment. Surgical menopause is a pain. Even in the winter I tend to run super hot at night and this mask is a great relief as I'm trying to fall asleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Comfy",
      "text": "So far so good, they have not BLOWn up on me yet, but have kept warm up time under 30 seconds, probably need to be 30 seconds though. Very comfy and easy to adjust, works great with my sinus headaches.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Wouldn't recommend",
      "text": "It burst after a couple uses..didnt have longer than a week",
      "rating": 3.0,
      "verified": true,
      "author": "Wayne Kelly",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Hard, uncomfortable painful to wear.",
      "text": "Horrible uncomfortable and unwearable. When frozen, it’s not malleable, so it is just hard and painful against your eyes and head. Unfortunately , I tried it out after the return window closed. Wasted my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Love for migraines!",
      "text": "I have about 3-4 of these in my freezer in ziplock bags at all times for migraines. I love putting one on and going to sleep at night whenever i have a headache.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Really wanted to like this!",
      "text": "Really wanted to like this!! Used this for the first time to help with a headache while meds kicked in, felt great and was helping, until I realized all the liquid on the inside (not the small beads themselves) were leaking out all over me! Looks like the seam around the outside wasn’t fully stitched! Would’ve loved it otherwise!",
      "rating": 1.0,
      "verified": true,
      "author": "Lacey B.",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Does not stay cold long",
      "text": "The cloth side does not get cold enough, but using the plastic side if very uncomfortable.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "love this mask",
      "text": "love this mask! both one at another store in town but could not find them again when I wanted another one. also bought one for my granddaughter!",
      "rating": 5.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 3,
      "publication_date": 20170302
    },
    {
      "title": "Hot or Cold Use",
      "text": "I originally purchased for ice after my surgery. It worked well and enjoyed it. When I heated it there was no problem. But one night I must have heated it too much and it blew up and busted on me. Well it was probably my fault.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia Jensen",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "although it didn't explode after just 15 seconds in the microwave like the really hot one",
      "text": "This mask works well. Doesn't seem to hold the same level of heat that I've experienced in others... although it didn't explode after just 15 seconds in the microwave like the really hot one, either. Still, it holds a comfortable, noticeable heating for 20+ minutes with a 30 second nuking.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Wilson",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Great mask for dry eyes",
      "text": "My eye Dr recommended a heated mask too help with my dry eyes. Within a week, the lubricating glands around my lids started working again.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Eye Wear",
      "text": "Have an infection in my eyes and heated this 23 seconds and put on eyes for 10 min. Have helped with the burning. Nice product if not overheated.",
      "rating": 5.0,
      "verified": true,
      "author": "MuffyMay",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Worked great for a short while",
      "text": "I bought this product about eight months ago. It fit my head well and helped ease away chronic migraines. However, after only a few months of irregular use (maybe 2-3 times a month for 8 months) the stitching came apart between the fabric and plastic covering causing the gel beads to call out. Proceed with purchase cautiously, knowing the price is good but that it may not be the best quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Samuel B.",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Very well made product. The velvet side is very ...",
      "text": "Very well made product. The velvet side is very soft. The bead filling is well packed. I received the product exactly as pictured.",
      "rating": 5.0,
      "verified": true,
      "author": "Mochi",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Great product for the price.",
      "text": "Good little ice pad for face. Help treating face soreness and eyes fatigue. I'm not sure about sleeping with it since the gel bubble doesn't stay cool for too long. It would just end up haven't an eye shield on the face and getting warm from your body heat. Only down side is it didn't come with a storage bag/sleeve or something. I use a mid size zip log bag to keep it clean and odder free in my fridge.",
      "rating": 5.0,
      "verified": true,
      "author": "April E.",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "this seems like a good idea out of the box",
      "text": "this seems like a good idea out of the box, but once frozen the beads don't move around well.. the beanbag style masks mold better to your face, although they don't hold the cold for as long.. it's a conundrum!",
      "rating": 3.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "One of my favorite gifts!",
      "text": "I purchased this eye mask for myself a long time ago... I have since purchased numerous more to go in gift bags and they are always a hit. A great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "KDS",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "a little on the heavy side",
      "text": "this is perfect for what I need. I will say that the mask is a little heavy with all the little balls inside it. I like the weight though. The soft side is very very cozy and I can't wait to try it out once it's out of the freezer!",
      "rating": 4.0,
      "verified": true,
      "author": "Cas Crim",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Stays hot/cold",
      "text": "I had some issues with my eyes that require heat once a week. I'm in love with this eye mask because the heat stays for a good 20 minutes or longer depending on how long you heat them up.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Great way to relieve headache pain!",
      "text": "I like that it is easy to use. The coldness lasts longer then other similar products. I purchased it in black in order to block out light. It’s very effective. I’ Considering purchasing another one for a spare.",
      "rating": 5.0,
      "verified": true,
      "author": "David Gluck",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Works beautifully when the stye in my eye acts up",
      "text": "Just as expected. Works beautifully when the stye in my eye acts up, or when I'm over heated, or watched a super sad movie. (Marley & Me... anyone?)",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie Soukup",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Not bad",
      "text": "It’s a pretty good eye mask to take short naps but I wouldn’t recommend going to bed with this because it can easily crush the beads. It also sometimes hurts my nose when I put it on, it would have been nice to add some cushion or make it softer around the edges. Overall it’s satisfactory.",
      "rating": 3.0,
      "verified": true,
      "author": "yane ",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "This mask is wonderful! It cools quickly",
      "text": "This mask is wonderful! It cools quickly, and the beads are great for fitting the shape of my face. The strap is also comfortable to wear to keep the mask on. I get frequent headaches, and I have recommended this mask to many others for quick and comfortable relief!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Stertz",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "A good mask",
      "text": "Probably one of the most comfortable frozen eye masks I have tried. Works great and is nice and soft, no pokey parts. I’ve never used it warmed up.",
      "rating": 5.0,
      "verified": true,
      "author": "AlexanderCrow",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Five Stars",
      "text": "Best eye mask I’ve owned so far buying some for my daughters",
      "rating": 5.0,
      "verified": true,
      "author": "emmy jones",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "If you get migraines I recommend this!!",
      "text": "I suffer from migraines. In my case an ice pack generally brings me some relief until my medication kicks in. The problem I normally have is that regular ice packs slide off of my head and dont conform to my eyes. This product stays in place (even if you fall asleep), can conform to your face, AND stays cold for a pretty good length of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah C. Strobel",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Great for migraine sufferers",
      "text": "Works great for those long days. I love that you can hear them up or use it as a cold pack. I get migraines and I will apply this to the top of my forehead or wear it backwards on my neck under my hairline. It's amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo.DeAngelo",
      "helpful_votes": 2,
      "publication_date": 20170725
    },
    {
      "title": "Still hopeful.",
      "text": "Froze solid so in the middle of a unbearable migraine I was left waiting for the mask to thaw out. Storing it in the refrigerator instead of the freezer with the hope's of relief with the next migraine. *fingers crossed*",
      "rating": 2.0,
      "verified": true,
      "author": "M. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Quality eye masks are hard to find :/",
      "text": "Only stays cold for a few minutes even fresh out of the freezer. The plastic side gets extremely sticky during the night. Every little bead was popped within two days.",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 6,
      "publication_date": 20160418
    },
    {
      "title": "put this bad boy on",
      "text": "This helps so much after wearing contacts all day. I just pop it in the fridge for an hour or so, and then when it's ready, put on some Sufjan Stevens, put this bad boy on, and relax for twenty or so minutes. It works wonders. Being able to choose which side to put against your eyes is really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie Harbeck",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "A must have item",
      "text": "I love this eye mask. Very generous amount of beads, very comfy when applied. Out of all the ones I’ve used this one is the best. Great quality item that always lives in my fridge between uses. Good for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "large and effective",
      "text": "This gel eye mask is very well made, it is large and stays frozen for some time. It arrived more quickly than I anticipated, even with prime.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa H.",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Cool and comfortable",
      "text": "I bought mine because I’m a day sleeper and it’s very comfortable especially on hot days . I like the gel cause it stays cool for awhile and The adjustable strap is really helpful feature.",
      "rating": 4.0,
      "verified": true,
      "author": "Sc",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "GREAT",
      "text": "I love this product. Purchased 3 of them but due to my fault I over heated one and it exploded. They are so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet M. Brown",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Perfect for Migraine Sufferers",
      "text": "Freeze and place the material side on your eyes..........or wrap in a paper towel & place on your forehead......it helps! Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Frozen eyes",
      "text": "Doesn’t go over the eyes well. It just sits straight across your face. It was so cold and frozen I couldn’t handle it for too long. Also the mask sweats soooooo much. Very annoying mask",
      "rating": 1.0,
      "verified": true,
      "author": "Flowers",
      "helpful_votes": 0,
      "publication_date": 20190403
    }
  ],
  "product_meta": {
    "title": "Ariel EDGE Plush Hot/Cold Eye Mask (Pastel Blue) 8 Colors Available",
    "description": "Color:Pastel BlueLay back and relax with the Ariel EDGE Plush Hot/Cold Eye Mask. Plush side providing ultimate comfort to use directly on the skin for ultimate relaxation. Elastic strap attached to hold mask snuggly into place for hassle-free use. Choose from a variety of colors to personalize your \"me time\". THE INSTRUCTION OF EYESMASK TO USE HEAT:Mircowave for 30 seconds, add additional 5 second intervals until desired temperature is reached . TO USE COLD:Freeze for at least 2 hours.The Pack Should only applied to the relief area for the doctor recommended time of 20 minutes. CAUTION: Packs can be cleaned with a mild soap or detergent. Do not swallow beads. Do not use on infants. Heating Packs beyond the time stated above is not recommended.",
    "rating": 4.4,
    "feature_bullets": [
      "Polyester/PVC",
      "COMFORTABLE ★ Soft Plush Aqua Bead Gel Therapy Eye Mask. Adjustable elastic strap with hook & loop closure.",
      "MULTI-FUNCTIONAL ★ Store in refrigerator or freezer for cool use.",
      "FAST ★ Heat in microwave for hot use.",
      "EASY TO CLEAN ★ Reusable and easily cleaned with mild soap and water.",
      "SOFT ★ Plush side allows for comfortable direct-skin use."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "8.5 x 4.37 x 0.75 inches; 7 Ounces",
      "Item model number": "WHF-PE15PB",
      "Date First Available": "November 17, 2015",
      "Manufacturer": "Ariel Premium Supply, Inc.",
      "ASIN": "B0184JMKJW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "Sleeping Masks",
      "Health & Household",
      "Health, Household & Baby Care",
      "Sleep & Snoring"
    ],
    "price": 7.8
  }
}