{
  "website_summaries": [
    {
      "verdict": "It'll cost you quite a bit, but this is a filter that experienced photographers can rely on for their work.",
      "pros": [
        "Different versions available to fit lens threads ranging from 39 mm to 105 mm",
        "Delivers the perfect color-neutral performance you would expect out of a high-end polarizing filter",
        "Features an extremely high quality of glass in the filter, which means it won't have imperfections that could ruin your images"
      ],
      "cons": [
        "One of the most expensive polarizing filters around, so it's not really made for beginners"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Clarity at it's best",
      "text": "Just got around to using this filter on my Nikkor 70-200 V3 paired with my Nikon D4s. Absolutely stunning quality from this CPL. No soft spots unlike my Tiffen. We as well use this filter on our Otis 55mm on RED. This filter is kicka$$ for the price. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Siritho",
      "helpful_votes": 7,
      "publication_date": 20181120
    },
    {
      "title": "As good as much more expensive filters",
      "text": "I recently scratched my UV filter while on vacation and I purchased a 77mm UV X1 and 77mm CPL on a recommendation from a friend. I was impressed with the build quality, clarity of the glass that I am in the process of replacing all my filters with Breakthrough Filters. The nubbins along the filter allow ease of grip even when your hands are wet. Clarity of the glass is superb, with no distortion or flaring. The CPL doesn't vignette along the edges even on the 95mm, and the price isn't bad either.",
      "rating": 5.0,
      "verified": true,
      "author": "glowworm6",
      "helpful_votes": 2,
      "publication_date": 20180621
    },
    {
      "title": "Great product with nice clear, sharp lens.",
      "text": "I have purchased and use several ND filters by Breakthrough Photography. This purchase was like all the others - easy to buy, quick shipping and great packaging. The filter is very clear glass and I could tell immediately the difference in just the blue sky with and without the filter. With the filter the darkening or lightening of the sky was really nice and I am sure I will be equally satisfied when I use it for water photos. I'm an advanced amateur and spend a lot of time with photography so I want my filters to do the job without adding haze, other colors other then what I see. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "MCullen",
      "helpful_votes": 2,
      "publication_date": 20180417
    },
    {
      "title": "Sharp & color neutral",
      "text": "I have been waiting for this filter and have not fully put it through its paces as I would like to have by now, but for what I have shot with this filter I believe that they first of all transmit more light. I have this on a 600 mm 6.3 lens (this usually makes it much harder to get a shot unless you are in bright direct sunlight) and I'm still getting the shot and wow the colors pop and most importantly the colors are accurate. Can't wait to try their ND filters",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 3,
      "publication_date": 20180121
    },
    {
      "title": "Didn't find much difference.",
      "text": "I'm not a novice in photography. May be this is the reason I didn't see quite difference many of the reviewers have seen. Also had to return once due to fitting issue. I can buy this on the fact that it has an awesome 25 years of support offered. This is already a hooking point and I can recommend such product to anyone because you do not have to worry at all. This also suggests how the manufacturer stands behind its product. This is not the case with cheaper lens filters.",
      "rating": 5.0,
      "verified": true,
      "author": "Puru",
      "helpful_votes": 2,
      "publication_date": 20180820
    },
    {
      "title": "Vignette in photos",
      "text": "Look at the photos people post. You will see what I’m saying from others without me having to prove it. I looked at many brands and went with this one. I have taken 5 photos so far and it’s very obvious vignetting in the corners of the photo while at the 28mm section of my Canon 24-70mm 1:2.8 L USM II 82mm lens. I haven’t zoomed in for anything yet but at 28mm it is very obvious.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon Dietrich",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "The Excellence that I've come to expect from Breakthrough.",
      "text": "Be it an ND or Polarizing filter, I have been using Breakthrough filters on my Fujifilm GFX 50s medium format lenses as well as my Olympus 4/3 lenses. They are sturdy, fit perfectly, and enhance all my lenses. Breakthrough's professionalism is appreciated and I recommend them without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Allan Pierce",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Wonderful product - solidly built and engineered!",
      "text": "I purchased this a replacement for a broken polarizer. Immediately after ordering the product, I was courteously informed by the vendor about the shipping details of my purchase - talk about fantastic customer service. The product arrived on time in beautiful packaging and the polarizer itself has a solid feel to it. The grip feature is excellent. Combine this with a 25 year warranty I am sure this won't be my last purchase from Breakthrough Photography. Very happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Guido Brandt",
      "helpful_votes": 2,
      "publication_date": 20171214
    },
    {
      "title": "Quality Quality Quality I can't give you the scientific, ...",
      "text": "Quality Quality Quality I can't give you the scientific, colorcast, etc breakdown on this polarizer. But this stays on my Sony 16-35 2.8 GM unless I'm shooting at night. I have also found it easier to take off this filter due to the deep ridges around the frame. In the past, I've had problems with filters not getting stuck but just harder to remove due to how no existent the metal was. I plan on getting the ND filters after using this a lil more.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Wa",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "High quality but some hood compatiblity issue...",
      "text": "Construction is very solid but I'm having a hood compatiblity issue similar to what's mentioned in a few reviews already. On a Nikon 16-80mm 72mm lens, it is very difficult to attach/remove the stock HB-75 hood with the CPL filter on. It takes lots of wriggle/push/pull/if not minor brute force but is doable once you get the hang of it. Another option is to attach/detach the CPL filter with the hood on. Not very efficient as the hood limts finger movements and can be challenging if the filter is very tight...",
      "rating": 4.0,
      "verified": true,
      "author": "LY",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "The best filters available",
      "text": "I've been using Breakthrough Photography filters since the original Kickstarter days. I have upgraded from the best Hoya, B+W and Nikon filters to the X4 filters on most of my lenses. If you are going to put something in front of a multi-thousand dollar lens, it ought to be the best and I've found these X4 and the companion CPL and ND filters to be the best indeed. In addition to the optical quality, I appreciate the thin profile and ribbed edge for easy installation/removal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 2,
      "publication_date": 20171017
    },
    {
      "title": "Best Circular Polarizer I've Used",
      "text": "Excellent glass! Excellent build quality! Color neutral. Couldn't ask for a better circular polarizer. Be sure to buy a large enough polarizer to fit your largest diameter lens then purchase additional adaptor rings for your smaller diameter lenses. This will save you money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Beautifully engineered filter",
      "text": "Another beautifully made filter I am using on my Nikon 200-500mm lens. Easy to mount on and off and really nice to handle and adjust the amount of polarizing you want to see. Great product and exceptional service.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Tyler",
      "helpful_votes": 2,
      "publication_date": 20180811
    },
    {
      "title": "and all of them have been great quality, outstanding performers",
      "text": "This is my third filter from Breakthrough Photography, and all of them have been great quality, outstanding performers. The filter arrived in the usual high quality packaging and was received on time and in great condition. The physical characteristics of the filter were high quality. The filter threaded onto the lens with ease. The CPL rotation function performed with just the right amount of tension. The filter was used on one outing so far, and the polarizing effect was perfect. Not too much, no dark sectors. The clouds and sky popped quite nicely on a very humid day in New York's Catskills. I'm looking forward to putting the filter to good use in the future. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve A.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Top quality gives you top results",
      "text": "These people make the best filters around. Expensive???? What is the best worth to you? I've looked for cheap filters before and ended up spending more trying to find the right one. Buy their filters and you are done. It's a good investment.",
      "rating": 5.0,
      "verified": true,
      "author": "SP",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Great filters - try them!",
      "text": "I have a five or six filters from Breakthrough Photography. They are consistently high-quality in construction and do what they are supposed to do. The polarizers are have relatively high light transmissions, which is good. They are easy to remove from lenses due to their uniquely-designed rims (no more cursing at stuck filters and struggling with filter wrenches...)",
      "rating": 5.0,
      "verified": true,
      "author": "Scott B",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "25 years warranty is BS.  Breakthrough Photography doesn't stand behind their product",
      "text": "The filter itself is not bad for the money you pay, but their warranty is BS, good luck using it if something happens to the filter. Breakthrough Photography doesn't stand behind their product at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Viktor Bogun",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "It's the Little Things the Speak the Loudest",
      "text": "It's the simple things but I love this filter. Great performance and good price. The weather seal is important to me and the little denture work on the ring makes for a sure grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Engineer Steve",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "This is a great filter. I have it on my Canon 70-200 ...",
      "text": "This is a great filter. I have it on my Canon 70-200 2.8 ISL and it makes a huge difference. It is a bit of a pain to adjust when the lens hood is attached, but that's a lens hood \"issue\" that I'll find a workaround for soon. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Filter looks and works great but at $159 with no scratch resistant and you ...",
      "text": "Filter looks and works great but at $159 with no scratch resistant and you cant use it with most lens hoods. Your only option is the use it with without the lens hood and risk scratching it which happened to me in the field and now the filter is useless.",
      "rating": 3.0,
      "verified": true,
      "author": "Nick T.",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Best CPL out there",
      "text": "I have used Zeiss, Nikon, B+W and Hoya CPL filters and have found Breakthrough filters to be superior in everyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Best Circular Polarizer",
      "text": "Very color neutral and sharp CPL for improving color saturation, reducing water and glass reflections.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Great filter",
      "text": "Great and rugged filter. I'm a professional photographer and this one is as good as it gets. Like the ease of taking it on and off a lens in the field.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodan",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Default filter for your bag.",
      "text": "Expertly made filter like all the others by Breakthrough Photography. Easy to use and maintains colour integrity, no colour shift like other filters, and superb for the price with excellent packaging.",
      "rating": 5.0,
      "verified": true,
      "author": "Aussie Viewer",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "I would buy again",
      "text": "This is a great Polarizing filter A plus is that the case is thin and works on my wide angle lens with out removing uv filter",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Sparks",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Best Filters For Your Photography",
      "text": "When it comes to lens filters, whether it's an NF filter, circular polarizer, or long exposure 10-stop filter - Breakthrough glass is as good as it gets. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Glen T.",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Super nice quality",
      "text": "This is the nicest filter I have ever handled. It feels so smooth and precise. Very, very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Squatty",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "this is a fantastic polarizing filter",
      "text": "To put it simply, this is a fantastic polarizing filter. The design is fantastic from the perfect threads for mounting to your lens to the knobby grips around the ring which makes it easy to use. I got a neutral density I haven’t had a chance to use yet. I will comment on it later.",
      "rating": 5.0,
      "verified": true,
      "author": "James A. Cole",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Best Polarizer Filter",
      "text": "Very happy with this filter, it's sturdy, easy to use. Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Excellent Quality!",
      "text": "Excellent quality! After doing a ton of research on Circular Polarizing and ND filters, I decided to go with Breakthrough Photography Filters - seems to be highly recommended from everything I've researched. I have owned other brands and the quality of BP's filters is 2nd to none - could not be happier with my choice! Great filters - Great Company - even the packaging is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Anderson",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "you won't find better...",
      "text": "some pro photographers prefer hoya hd3, but i'm going with the schott glass and knobby brass ring. no brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "BlueChef1",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "I have a new favorite!",
      "text": "Works great on my Canon EOS 5D Mark II with Canon 16-35mm f4.0 L Lens. After testing multiple very high quality alternatives, this is the absolute best circular polarizer I have found. I plan on testing other filter types from this company. I am also impressed with the communications from the company.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Cobb",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Best polarizer filter ever owned",
      "text": "I've used Polarizer Filters since the 1960s. This one is the best I've ever owned. Only 1 stop exposure reduction. Optically very flat. Color neutral. Great product. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Weasner",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Good enough",
      "text": "Not sure why i spent so much on this, but it works",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Top dollar for used equipment",
      "text": "Case it came in was already opened. Seals were broken. When i turn the filter it feels sloppy and worn and the ring shows signs of wear. Payed top dollar for a used filter",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Hilliker",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "I would recommend this filter to any photographer that needs a polarizing ...",
      "text": ". I would recommend this filter to any photographer that needs a polarizing filter. Thank you for producing one of the finest polarizing filters in market. I have owned 4 but lost 2 in the Sonoma county fires and this my first replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Great Quality and perfect imaging",
      "text": "Love this CPL. Best one I have ever used and highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "LOVE THESE FILTERS",
      "text": "They are very durable, color neutral, and provide excellent picture quality. Some of the best filters on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael G.",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "and super clear, no cast to be seen in images",
      "text": "as soon as you hold it, you know you bought a quality product. Very well made, and super clear, no cast to be seen in images. Highly recommend this product and company. ND filter is next on my list, and it will definitely be from Breakthrough Photography !",
      "rating": 5.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Excellent filter!",
      "text": "A beautiful, durable and sharp filter! The best CPL I've ever owned! very happy with this purchase 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Davit Kurtanidze",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Great filter!",
      "text": "Great filter, and obvious attention to detail; the \"knurled\" sides make this easy to put on and take off...a seemingly minor detail, but makes a HUGE difference in the field!",
      "rating": 5.0,
      "verified": true,
      "author": "bluefutzy",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Five Stars",
      "text": "Best filter period, better than B+W and my Zeiss filters",
      "rating": 5.0,
      "verified": true,
      "author": "J.S",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Best filters on the market today",
      "text": "Spactular filter. From small company that prides themselves on quality and customer service. The third product I’ve purchased from Breakthrough. Products are registered and guaranteed. All my future filters will be Breakthrough products. I have become a real loyalist.",
      "rating": 5.0,
      "verified": true,
      "author": "mickey",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Love",
      "text": "Absolutely amazing. No colour cast, great quality and easy to use. Will be buying more Breakthrough Photography filters in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris R",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Not if you want to use a lens hood",
      "text": "It seems like a great filter, but, it will not work with the lens hoods on my Zeiss and Sony lenses. If you put the filter on you can’t remove the hood. It’s impossible to put the filter on once you put the hood on... The little grippy bits are just too large. I’ll give it a 4 because I think it probably does it’s job well if you don’t need the hood.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Faoro",
      "helpful_votes": 5,
      "publication_date": 20180223
    },
    {
      "title": "Quality",
      "text": "I love the quality and commitment to the buyer having a great experience. I plan on replacing my filters with this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "JTodd",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Great filter, highly recommend",
      "text": "Great product, love the traction dots on the ring, makes adjusting a breeze. Arrived on time and in very sturdy packaging. Quality of the glass appears outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "MtnDave",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Really nice build on this filter",
      "text": "Really nice build on this filter. I've only taken a few shots with it but they definitely were improved by the filter. Can't wait to use it more!",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Wilt",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Great Polarising Filter.",
      "text": "It’s an excellent Polarising filter and I personally feel it’s better than the B+W Kaesman PF.",
      "rating": 5.0,
      "verified": true,
      "author": "Sudhir Kochhar",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Very well made and pleased so far",
      "text": "Appreciate an American company and read reviews . Decided to buy the CPL filter. Very well made and pleased so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Phelanlucky",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Well made product",
      "text": "Great product. Expensive, but the 25 YEAR support sold me.",
      "rating": 5.0,
      "verified": true,
      "author": "brandt",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Amazing but you can't use together with the hoods lenses",
      "text": "Amazing product, good quality, build, material. I've done about 500 pictures of landscape and portrait with it, and it was astonishing. But, I give 4 stars because I can't use the hoods lens together, becase the border have a little bit protusion that don't allow you to put the hood lens. I know that some photographers that use CPL filters in general they don't use the hoods lens together, but I like to use it together, for me it's more pratical and help with some ghosts of sun too. My lens is: Canon 16-35 F4 L IS USM.",
      "rating": 4.0,
      "verified": true,
      "author": "Rodrigo Negrisoli",
      "helpful_votes": 2,
      "publication_date": 20171107
    },
    {
      "title": "Excellent CP filter",
      "text": "This makes 4 filters I've purchased from Breakthrough Photography and all are excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "IT IS A GREAT PRODUCT, PEOPLE AT BREAKTHROUGH PHOTOGRAPHY REALLY KNOWS WHAT ...",
      "text": "IT IS A GREAT PRODUCT, PEOPLE AT BREAKTHROUGH PHOTOGRAPHY REALLY KNOWS WHAT THEIR DOING.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "I received the filter in excellent condition on the day it was expected",
      "text": "I received an email from the seller when the filter was shipped, along with a tracking number. I received the filter in excellent condition on the day it was expected. The filter attached to my camera lens smoothly and rotated through it's range just as smoothly. I bought this to use on vacation in the Caribbean later this winter, but checking it while pointed at my computer screen, it showed a good range. More information after vacation if justified.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "I like the fact that I am supporting and American company ...",
      "text": "The more neutral glass in this filter, the notches on the outer ring and the 25 year warranty were the reasons I selected this product over B&H. If you want quality this is the product to buy. I like the fact that I am supporting and American company also. Great product. You won't be disappointed. If you are on the fence I can certainly testify that this product has performed excellent. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance and Cheryl Christiansen",
      "helpful_votes": 2,
      "publication_date": 20180202
    },
    {
      "title": "True colour rendition, sharpness, resolution, saturation, lifetime build quality",
      "text": "Seriously, these are the best polarising filters on the market. Their biggest asset lies in the true colour rendition, i.e. there isn't a greenish colour cast which most other polarising filters produce when used on a digital camera sensor, which means less post-production editing to remove the cast. Image sharpness and resolution are maintained with no perceivable loss of contrast. Colour saturation is enhanced, as expected. Build quality and usability: 10/10, this will last a lifetime",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Mecham",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Best CPL I have ever own",
      "text": "I heard about this product from The Nature Photography Show and figured I will give a try. The quality of the filter is amazing the fit and finish is exemplary. The sharpness and the amount of polarization it does is second to known. The only thing I wish was better is the plastic case the filter is stored that is the only part that seems cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hernandez",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Bad QC => Scratched Up",
      "text": "Scratches on the face (lettering side). Looks like someone took an awl and scratched back and forth. Yes, this was a sealed product. Maybe try some QC next time? I'm beginning to understand why Fakespot gives this product an \"F\".",
      "rating": 1.0,
      "verified": true,
      "author": "approach",
      "helpful_votes": 3,
      "publication_date": 20180124
    },
    {
      "title": "i admit that the 2 ND 6 and 10 stops they work great, now this polarizer after some shots i did ...",
      "text": "This is my 3 filter from this company ,i admit that the 2 ND 6 and 10 stops they work great ,now this polarizer after some shots i did and own at least 50 different high end filters ,the results dont look that good compare with my Lee pola filter .Now to explain the reason i bought it just because i need a pola filter for a trip while the Lee needs the adapter to carry and adds extra to the back pack",
      "rating": 1.0,
      "verified": true,
      "author": "Yiannis",
      "helpful_votes": 3,
      "publication_date": 20171028
    },
    {
      "title": "Why would you cut corners now.",
      "text": "When you have spend $4K on the camera body and $1.2K or more on the lens, why would you cut corners on a UV filter glass that is the first element light passes through for you picture. I have no way of measuring any difference in this filter from others any more than I can with a lens. I can however see the difference in the quality of the bezel used and it is quality from start to finish. The proof for us is always in the picture and for me, it's picture perfect...",
      "rating": 5.0,
      "verified": true,
      "author": "LowJack",
      "helpful_votes": 0,
      "publication_date": 20190427
    }
  ],
  "product_meta": {
    "title": "X4 CPL 58mm Circular Polarizer Filter - Schott B270 - MRC16 - Nano Coating - Weather Sealed - 25 Year Support by Breakthrough Photography",
    "description": "Material Type:CPL| Size:58mmThe X4 CPL features SCHOTT Superwhite B270 optical glass, which is an ultra clear crown glass. It is produced by melting high purity raw materials and then made using the continuous draw process. The result is excellent transmission in the ultraviolet, visible, and infrared spectrums, and a high surface quality that accepts our state-of-the-art MRC and nanotec coatings exceptionally well.",
    "rating": 4.7,
    "feature_bullets": [
      "WORLDS MOST COLOR NEUTRAL POLARIZER, GUARANTEED: A perfectly flat transmission curve would yield a perfectly color neutral result, and while there is no such thing as a perfectly neutral CPL filter (contrary to what other filter makers may claim) the X4 CPL is the most color neutral any CPL filter, guaranteed.",
      "WORLDS MOST ADVANCED POLARIZER: All commercially available CPL filters exhibit a yellow cast due to a gradual transmission increase starting around 600nm and then spiking at 650nm onward into IR. With our X4 CPL film we achieved a gradual transmission decrease from 600nm onward, and instead of spiking uncontrollably near 650nm and far into infrared, the X4 CPL sees very controlled transmission into IR, without the curve spike. Result: Warm and lively images without the apparent colorcast.",
      "X4 CPL (CIRCULAR POLARIZER) FILTER: The X4 CPL features SCHOTT Superwhite B270 optical glass, which is an ultra clear crown glass. It is produced by melting high purity raw materials and then made using the continuous draw process. The result is excellent transmission in the ultraviolet, visible, and infrared spectrums, and a high surface quality that accepts our state-of-the-art MRC and nanotec coatings exceptionally well.",
      "FITMENT: This CPL filter is compatible with all 58mm camera lenses. Your lens thread size will be printed underneath your lens cap or written somewhere on the lens barrel. Make sure you order the correct size otherwise it will not fit your lens.",
      "25 YEARS SUPPORT: We stand behind every CPL filter we make with our 25 Year Ironclad Guarantee. Every X4 CPL filter has a unique serial number laser engraved onto the interior frame. When you activate your 25 Year Ironclad Guarantee, we assign this serial number to you, so any future discussions on this unique filter are tracked, issues recorded and all that stuff which goes into future product design."
    ],
    "specifications": {
      "Package Dimensions": "3.98 x 3.98 x 0.94 inches",
      "Item Weight": "4 ounces",
      "ASIN": "B0186G8A5G",
      "Item model number": "4335030044",
      "Customer Reviews": "4.7 out of 5 stars153 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#63 in Camera Lens Polarizing Filters",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 6, 2017",
      "Manufacturer": "Breakthrough Photography"
    },
    "categories": [
      "Filters & Accessories",
      "Accessories",
      "Electronics",
      "Camera & Photo",
      "Polarizing Filters"
    ],
    "price": 129.0
  }
}