{
  "website_summaries": [
    {
      "verdict": "Whether you are interested in its simple touchscreen interface or the WiFi range of this device, these two selling points combine for an all-around excellent device.",
      "pros": [
        "Simple smartphone-like design is easy to set up and use",
        "Up to 10,000 feet of bonus coverage",
        "3 dual-band antennas",
        "Designed for 4K streaming and online gaming",
        "4 gigabit Ethernet ports"
      ],
      "cons": [
        "The ease of a lighting-fast, touchscreen-based Wi-Fi extender comes with a decent initial investment"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Frequent disconnects, not worth the trouble for what it costs.",
      "text": "A year in, this remains one of the most frustrating repeaters I've ever used. Frequently disconnects and reconnects from the wireless network at random intervals - sometimes once a week, sometimes several times in an afternoon. As I'm writing this review, it already disconnected twice. Once it begins it doesn't stop until the device is completely powered off and restarted. I'd expect this from some cheapo bargain repeater, but this is an overpriced $90 jape. Don't waste your money again, and steer clear of TP-Link in the future, they seem dead set on ignoring the problem now that they have their newer products out.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 34,
      "publication_date": 20180101
    },
    {
      "title": "Won’t stay connected",
      "text": "This product is great when working, I have to reboot the dam thing 3 to 4 Times a week. Other than that the coverage is great",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff Englar",
      "helpful_votes": 31,
      "publication_date": 20171029
    },
    {
      "title": "VERY PROBLEMATIC - DO NOT BUY",
      "text": "This is the most frustrating piece of computer equipment I have ever owned. From the beginning, it looses connection and has to be reset about 4 or 5 times a week. I've installed all of the updates and they help for a short time, then it reverts back to being \"glitchy\" at best. I cannot recommend this product at all. VERY DISAPPOINTED. I wish I could return it, but at this point I've had it too long to do so.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael C.",
      "helpful_votes": 34,
      "publication_date": 20171116
    },
    {
      "title": "WARNING TO ALL DON'T BUY THIS UNIT TILL THEY UPDATE AND FIX THE BUGS.....",
      "text": "Here is the Good...... This is one of the easiest and most awesome looking extenders we have ever had..... Now the bad this unit worked like a charm for about 5 days then it had a mind of it's own... Very sad... It would constantly reset itself right in the middle of working... I hope they read this and fix the bugs on this unit.... I would buy again if they could show it works like it says it should... So for now WARNING TO ALL DON'T BUY THIS UNIT TILL THEY UPDATE AND FIX THE BUGS.....",
      "rating": 1.0,
      "verified": true,
      "author": "TYGoodysTradingPost",
      "helpful_votes": 12,
      "publication_date": 20181228
    },
    {
      "title": "Has a fatal flaw",
      "text": "This repeater is very sensitive and puts out a good signal. It is also very fast. The problem: You can not change the channel, it repeats the channel of the router. Unless you get pretty far away, this creates a channel conflict, with two different devices in the same network broadcasting on the same channel. If they could fix this, it would be 5 stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce P. Markowitz",
      "helpful_votes": 5,
      "publication_date": 20200420
    },
    {
      "title": "Flawless!",
      "text": "I cannot tell you how easy this is to set up or how much the speed and strength my network has increased. My only gripe (and it is very small) is that there is no setting on the clock for daylight savings time so I had to set it to Eastern time instead of Central to display the correct time. I have At&t Uverse and use this for my wireless router instead of my gateway. It makes my entire house and internet run flawlessly. No more slowing of my network due to high traffic and with the directional boost to each device nothing gets bogged down or has to stop and buffer while streaming anything at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 6,
      "publication_date": 20160905
    },
    {
      "title": "Incredible range and continues to work strong",
      "text": "I have Fioptics running to my house and then use Samsung coax tv/ WiFi device to split every thing. Needless to say the house was built in 1820 an has brick walls 6” solid thick! The single WiFi device only worked downstairs about 900sq.ft... the house is over 7,800sq.ft. With the addition of one of these devices we were able to get complete coverage on 2.4Ghz. Also the screen made setup so easy! Would definitely recommend .",
      "rating": 5.0,
      "verified": true,
      "author": "C. Fox",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Decent Extender",
      "text": "All in all this is an intuitive and easy WiFi extender. My only major issue with it is that the extended and main WiFi networks must have the same password. That’s a nice feature for a simple setup, but it really limits your advanced options to create a fully seperate zone. I ended up returning the extended since I couldn’t use it for my intended application and bought a different brand since that’s a standard feature of most other manufacturers.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Maybe they don't work, that is why they were cheap.",
      "text": "Dead on Arrival, would not connect to wifi to be extended, even when my phone had full signal strength and 65db SNR. I thought I was getting a Deal for $60 for this, but it was a joke. In contrast the RE305 hasn't treated me badly at all, it just doesn't have removable antennas or the simplicity (assuming it worked) of a touch screen.",
      "rating": 1.0,
      "verified": true,
      "author": "JDD & M3 Kindle",
      "helpful_votes": 3,
      "publication_date": 20180620
    },
    {
      "title": "FINALLY MY WIFI ISSUES ARE RESOLVED!!",
      "text": "I moved my router to the middle of my 3 level house thinking I could get a good spread, but that never happened. I had a horrible signal both upstairs and downstairs to the point you could barely do anything. Got this extender and literally within 5 minutes it was up and running (literally the easiest set up I have ever done!) and my singnal was super strong!!! I put it upstairs and will buy another one for downstairs. I love this extender!",
      "rating": 5.0,
      "verified": true,
      "author": "H. Russo",
      "helpful_votes": 7,
      "publication_date": 20160520
    },
    {
      "title": "Great product. Worked immediately. Touch screen display very user friendly. Setup and run in 3 minutes.",
      "text": "We were having problems getting consistent wifi signal at the other end of the home. Netflix used to keep buffering! Turned this unit on, linked it to my home wifi router and it showed me 5 bars on the signal strength immediately. We can watch our netflix without any problems. Our son can do his gaming without any hiccups. The touch screen display makes configuring this a breeze. Even a novice could set it up. Best value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Incense",
      "helpful_votes": 4,
      "publication_date": 20170117
    },
    {
      "title": "It keeps dropping my connection and my wiife's connect, ruining our quatlity of life.",
      "text": "I like it, except for the stupid app used to manage it and the other TP link router, but this one keeps dropping my PC. Then it refuses to reconnect, unless I power cycle the stupid router. There doesn't really seem to be anything much in the way of controls, not like the netgear routers I replaced with this. Easy installation is worthless unless the thing stays connected to you PC when you want to use it.",
      "rating": 1.0,
      "verified": true,
      "author": "James R Purdon",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Geat Signal",
      "text": "I had a previous TP Link Extender plug in model. But When I changed to Sling TV (Yes I cut the cord!) that extender was not able to keep up with the streaming. I installed this model and my reception went from fair to EXCELLENT. I now get a great sling experence throught my home, out of this system. I highly reccomend this model.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip LaLiberte",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Set the antenna in a different position until the signal is excellent.",
      "text": "I was looking for a good WiFi extender had bad experience with a couple of extenders in the pass. Finally found one worth for your bucks easy to set up let you know how many devices are connected and most important the signal is at 100% at all times I bought this for my outdoor security cameras which are a few feet’s away from my house cameras WiFi Heath reads excellent not to mention indoor signal. I really recommend this unit. After all it looks cool and meets all expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Quique",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "The touch screen interface makes this so easy to setup and connect to your existing wireless network",
      "text": "Using this to connect to our existing router and then moving it to the further areas of our house has now allowed enhanced connectivity in all rooms. Wish I had done this a year ago rather than just fighting with slow internet connections. The touch screen interface makes this so easy to setup and connect to your existing wireless network.",
      "rating": 5.0,
      "verified": true,
      "author": "jimh1008",
      "helpful_votes": 3,
      "publication_date": 20170121
    },
    {
      "title": "Absolutely works!",
      "text": "Moved from an Almond range extender to this, MUCH better! The touchscreen is great, set up took one minute and the range is excellent. Does exactly what it is supposed to do. There are four LAN ports in the back and I have my VOIP phone service connected, works perfectly. Being connected to this extender or my actual WiFi router seems to be the same speed, the ping time on speed tests are 3-5 milliseconds slower but I can't tell the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Wojo66",
      "helpful_votes": 2,
      "publication_date": 20180211
    },
    {
      "title": "TP-LINK AC1900 Wireless Touch Screen Wi-Fi...",
      "text": "This is just what my network needed! Talk about plug and play! I located it in the man cave which is 60' from my WiFi router, I get 2 out of three bars on the WiFi icon. Plugged my PC directly to the Ethernet plug in the back, I'm getting 28.42 MBPS, just a little less than my PC inside, which is hard wired too. Sooo much better than the Extender I've been using for the last three years.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Smith",
      "helpful_votes": 3,
      "publication_date": 20160531
    },
    {
      "title": "JUNK. extends the network...barely, but the data transferred is BAD.Z",
      "text": "JUNK. Just garbage. 10,000 sf. This thing can go 5\". Did nothing to help my network. TP-Link stuff is China garbage. Sending it back as soon as I finish this review of this garbage. Extend the network, but slows it waaaaay down. Very bad product. China propaganda garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 2,
      "publication_date": 20180720
    },
    {
      "title": "It's the easiest thing to configure and set up",
      "text": "I was up and running in 2 minutes. It's the easiest thing to configure and set up and I didn't have to log in to a browser. House filled-in all the annoying deadspots. My house 2 floors and has a lot of walls. The main wifi is in the office because the cable modem is there which is located at one end of the house. Dead spots are in the middle upstairs and on the opposite end of the house. No more! I'd buy this product again. Way to go TP-Link! Looks cool too with the touch screen and blue light",
      "rating": 5.0,
      "verified": true,
      "author": "Shabalabadingdong",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "This device set up easily and intuitively by use of its display and has ...",
      "text": "Works as advertised. Simple to set up. I purchased the LED display because I did not want to have to deal with the technical hassles of logging into an admin site, or cellular phone app, or otherwise dickering around with WPS or some other method to hook the extender up to my WiFi. I've been there before. This device set up easily and intuitively by use of its display and has worked flawlessly since then. The signal you receive will be somewhat less than that it receives (maybe 25-30% less), but it i steady, consistent, and more bandwidth than I need in the areas that I needed the extender for. Excellent product, would buy again, and would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161030
    },
    {
      "title": "It works!!!",
      "text": "Very nice....Took 10 minutes total to set up. Download and upload speeds tripled in former dead zones.. I was a tad apprehensive about some of the reviews on this item. But it works...Our main WiFi router is an Asus.. It does exactly what we needed it to do.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Gean",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "Garbage",
      "text": "Did not work for me. Kept going out. My original network was more consistent than the extended. TP-Link customer service was absolutely worthless.",
      "rating": 1.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "When it works, it's great...",
      "text": "...too bad that it frequently *isn't* working. I have to reboot it at least 3-4 times per week, sometimes 3-4 times per day. I'm a network security guy and I use this in my office. It's a relatively short distance from my main device (less than 40 feet). Seriously considering getting another unit. Way too much frustration.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian Zaleski, DC, MS",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Extends the range very well- especially 2.4Ghz range",
      "text": "Extends the range very well- especially 2.4Ghz range and the price is right. Very quick and easy to set up, 5 minutes and done. Minor issues: It does not look as if you can do any mesh type handoff with teh same SSID It does not look as if you can change the operating channels It does work well and would recommend to anyone needing to extend their wireless",
      "rating": 5.0,
      "verified": true,
      "author": "Wang",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "I have tried everything",
      "text": "This item not only works but it works fantastic. I have had a dead zone in my house for years and have tried many extenders. this one was super simple to install, never had to go to an app or use my computer and guess what? NO MORE DEAD ZONE....I get full bars throughout the house now. FULLY RECOMMEND THIS PRODUCT",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Doesn't work! Total GARBAGE!",
      "text": "Does NOT boost the wifi signal and interferes with your regular computer and opening links. I couldn't even get my computer guru to make it work correctly and he worked on it for over an hour! Total garbage! I do NOT recommend getting this piece of mechanical excrement!",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Sims",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Drops signal",
      "text": "Well I have had this for 2 days and I do LOVE the range and hits the whole house excellent BUT it drops signal all the time and I have to reboot it 3 times a day. So I'm gonna give it a day or 2 more then return it bummer it works so well when it wants too",
      "rating": 1.0,
      "verified": true,
      "author": "phillip",
      "helpful_votes": 2,
      "publication_date": 20180208
    },
    {
      "title": "returning this however...",
      "text": "rather attractive and runs very well when it runs - if you are stuck with it seems if you keep it busy like a continuous ping loop to the gateway and turn off the screen saver it becomes much more stable - leads one to believe it's power saving mode it enters is very buggy - tplink has had a long time to fix this and hasn't done so - no thanks going back",
      "rating": 1.0,
      "verified": true,
      "author": "Reelthing",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Incredibly easy setup!",
      "text": "I am never using a web page to manage a router again! It is SO much better to do it right on the device, itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Devonaire",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "I was very happy with the looks",
      "text": "I was very happy with the looks, quality, shipping and purchase! I tried other major brand names. They were inferior in ease of use and performance. Clearly the winner of Wi-Fi Range Extenders.",
      "rating": 5.0,
      "verified": true,
      "author": "Niteflyer",
      "helpful_votes": 3,
      "publication_date": 20170430
    },
    {
      "title": "HOLY incredible WiFi Batman !!",
      "text": "more than did the job extended the wifi to the garage, ran Cat5E to a computer getting 350+ on Speetest so far no buffer that i can see, super easy to set up, very happy with it should have done this YEARS ago instead of the network over the electric outlets i had",
      "rating": 5.0,
      "verified": true,
      "author": "AMX 1969",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Signal problems",
      "text": "Didn't work that well for me. It would take my lower speed wifi and turned it into 5g. However it's like trying to drink a 5 gallon bucket with a straw. I also mounted it by my sliding glass door, and could get a great signal 25 to 30 feet away.",
      "rating": 2.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Doesn’t work",
      "text": "We have no idea what this thing was doing. It made the signal worse in our house. My techy son was always trying to get it to work and as soon as it worked, it stopped working again. We sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Christy L",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Very effective range & speed booster",
      "text": "I’m now able to achieve 103 mbs download in my third floor office. Without this repeater 20 to 35 mbs was typical. Other dead spots in the house now have better signal and speed also. I found changing the SSID to something other than the routers to be best to prevent some conflicts.",
      "rating": 5.0,
      "verified": true,
      "author": "George E. Schultz",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Plastic Disaster",
      "text": "Oh my.....and wow. I've worked in IT now for about 25 years now installing all sorts of hardware and I have to say this is the best piece of C#ap I've ever tired to install. Would not stay connected to the WiFi or it would lock it up. Oh yes I updated the firmware and reboot it and cuddle it.. it's junk and you should spend your money on something else...",
      "rating": 1.0,
      "verified": true,
      "author": "donald R Armstrong",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Aesthetically pleasing but possibly needs a firmware fix",
      "text": "While aesthetically pleasing, I found that it was falling off my network. I took steps that should have helped to prevent this issue. I assigned a static IP outside of the range of my automatically assigned DHCP IPs from my router. I ensured that this was operating on a separate channel from the main router. When it was connected it was very good but I don't want to have to constantly reboot. It has considerably less options in the interface than a TP-Link Router. Simplicity is fine, if the extender consistently functions well. Maybe they will fix this issue with a firmware update but for now, I was not impressed.",
      "rating": 3.0,
      "verified": true,
      "author": "Mhersh",
      "helpful_votes": 2,
      "publication_date": 20160627
    },
    {
      "title": "very disappointed with this product",
      "text": "very disappointed with this product. I had some $50 tp link wall sockets which were mostly reaching the dead spots of our apartment. However i thought this could offer total painless full coverage. However sadly for over double the price it is worse. the range is much the same which is a disappointment, and once every other day or so it will disconnect and display \"connection failed please verify your connection\" which i can find no solution too. I hope there is a software update or somethign to salvage this otherwise it is a total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom210",
      "helpful_votes": 3,
      "publication_date": 20160924
    },
    {
      "title": "Super easy to set up and just works.",
      "text": "I plugged it in, joined my WiFi, and it just worked. There was no difficult settings to navigate our confusing terminology. It looks really nice, too. My whole house has full strength 5ghz signal, which is what I was going for.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Borchardt",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Worked Great and the touch screen is a nice \"touch\".",
      "text": "worked great! easy setup and easy to us. The touch screen is a great \"touch\" just could not be easier to set up and use. Extended the range thru the house a good 40 feet with a full signal. Again, the screen made it very easy to find the best location to install the device. I'm very happy with it and it did not break the bank.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Lacefield",
      "helpful_votes": 2,
      "publication_date": 20160506
    },
    {
      "title": "Don't Waste ur time or money",
      "text": "Don't waste your money.yeah it's is to set up But Router disconnects daily which get super annoyed and defeats the purpose of a router.....over priced for the hassel it causes",
      "rating": 1.0,
      "verified": true,
      "author": "Crazy Aunt",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "BACK AWAY...Lost connection to the internet 3 times in 12 hours.",
      "text": "Sure, setting up as a WIFI extender took 2 minutes...Its the following 10,000 minutes that really later. Lost connection to the internet 3 times in the first 12 hours of ownership. Should have paid more attention to the negative reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan Conover",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Output Power Optimization",
      "text": "I would totally love this repeater if at least it comes with the option to regulate the output power so the coverage area could be regulated. Now that is not possible and it creates a little bit more interference than my previous repeater causing some holes where the wifi signal is not stable due this, even this it is a very good repeater with very good features that could be improved with a basic firmware update adding couple of small feature like this coverage area control",
      "rating": 4.0,
      "verified": true,
      "author": "Neftali Osorio",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "This a good product that I have no hesitation in recommending",
      "text": "This item does its job very well supporting 5 Wi-Fi devices in my house. The Wi-Fi signal to my most distant piece of equipment has gone from the low 20% range to 100%. I don't have problems with drop outs or having to buffer every few minutes. I would have given this 5 stars but I feel the instructions could be clearer. I did have to engage with the TP-Link tech support but they were able to give me the information I needed. This a good product that I have no hesitation in recommending.",
      "rating": 4.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Great product",
      "text": "Very well built, be sure to upgrade the firmware right after the setup. Excellent quality, bench tested and exceeded all of my expectations. This is my second purchase for another purpose. Manufacturer- please resolve the device time issue- shows it wrong no matter what on display.",
      "rating": 5.0,
      "verified": true,
      "author": "J.S.",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Excellent product",
      "text": "Extremely easy setup with the touchscreen. My Android devices smoothly connected. I had a bit of trouble with my Windows 8.1 computer. The extender appeared in my network list, but wouldn't connect as there was no password prompt. Even though the password was the same as the router, my pc didn't recognize it. The solution was to go into Control Panel and add the externder as a new network. Coverage is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon.",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Garbage, it doesn’t stay connected.",
      "text": "It disconnected itself every day. Only worked fine for a week. Now my return window just expired. DO NOT BUY THIS PIECE OF GARBAGE.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "It works perfectly",
      "text": "This is easy to set up and solves the problem of extending your wireless. Once in a while I have to reboot but that's not too inconvenient. It's by far the best solution I found. The unit is pretty fair size but if covers a lot of territory.",
      "rating": 5.0,
      "verified": true,
      "author": "Capt GH",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "works great for the ps4",
      "text": "We live in a tri level home and my grandson is on the lower level trying to play on his ps4 and with this wifi boost he can play like he is next to the Xfinity router. This extender was very easy to setup. I would recommend this wifi booster to anyone having trouble getting a strong signal.",
      "rating": 5.0,
      "verified": true,
      "author": "karen evans",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "HIGHLY RECOMMEND THIS",
      "text": "If your at all nervous, confused, or wary of buying a range extender BUY THIS ONE! The touch screen is the best part it is SO EASY to set up and wow I have internet now where I did not have it before.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Prime Lover",
      "helpful_votes": 2,
      "publication_date": 20161203
    },
    {
      "title": "Works ok",
      "text": "Works great. Once in awhile it loses signal not sure if it or my wifi router. Will find out when new router gets here",
      "rating": 5.0,
      "verified": true,
      "author": "rich herman",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Awesome !!",
      "text": "The best rage extender I have ever owned. Works well with the TP-Link AC3150 Wireless Wi-Fi MU-MIMO Router. I have a garage almost 100 feet away from my house and can use this to run wifi devices as well as hard wire a few. Works like I am plugged into the main router. VERY easy setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward R Kabo",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "well worth the money & so easy to set up",
      "text": "This WiFi extender is awesome & so easy to setup. I got one for each end of my house where my WiFi was weak. I got such good results thst I put one in @ my moms who had terrible WiFi on the other end of her house & I got the same great results!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Dwyer",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Often Needs To Be Rebooted",
      "text": "Have to reboot this extender daily. I finally had enough and bought a different brand and all is good now.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen B.",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "So far so good!",
      "text": "Seems to be a pretty good product! So far it has been working just as it is supposed to! Good product!",
      "rating": 5.0,
      "verified": true,
      "author": "Raquel",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "disconnects often :-(",
      "text": "I wanted to love this, it is a great device, but frequent disconnects make it too annoying. Both wireless and devices wired to the TP-link would stop communication. Required power reset, same as other customers have described. Such a shame. It is going back to Amazon. I found a $30 dual band router that i installed wired in a second location and it is rock solid and also has a cool front panel display like the TP-link.",
      "rating": 2.0,
      "verified": true,
      "author": "cat man too",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "It was easy to setup",
      "text": "This solved connection issues that no wall plugin unit ever did. It was easy to setup. And it worked from the very moment it was configured. At the current price I paid, it was a steal. And finally good signal strength throughout the home!",
      "rating": 5.0,
      "verified": true,
      "author": "gdjsky01",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Works after firmware upgrade",
      "text": "I was having problems with this device initially. After a week I called tech support. the first gentleman I talked to didn't know what he was talking about and couldn't help me luckily we got cut off. I called back, the second guy I talked to figured out what was wrong, sent me a firmware upgrade and the device is working fantastic now.",
      "rating": 4.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Works great. Setup was super easy and connected to my ...",
      "text": "Arrived a day ahead of estimated delivery date from 3rd party vendor DigJungle. Works great. Setup was super easy and connected to my tp link rounter almost instantly. Using the 5g wireless I'm getting 120 mbps download and 26 mbps upload times. Coverage is excellent with no dead spots inside the house and over 100 ft. outside. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth R Morris",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Not as good as we hoped for",
      "text": "It does connect, and when it’s working it’s good, but every single day since we connected this extender we have issues with the signal in our house. It disconnects from host all the time and leaves us without or with a spotty signal all the time.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs. Silvano",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Won't update firmware",
      "text": "Unit loses host signal every two days and requires a reboot. Tech support was unable to assist with necessary firmware update.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric Vanderwyk",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Did not work.",
      "text": "Did not work for my use with verizion fios - not strong enough.",
      "rating": 1.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "**updated** Easy setup, bad delivery ...returning for refund",
      "text": "Set up in 5 minutes - seamlessly integrated into my home network. Great product if you need to expand your wireless network or if you need a wired connection in a separate room. ******Update***** Like many of the reviews that are coming in recently, mine now drops offline at least once a day - a real pain since this is the hub for my home office. Disappointed because if not for this problem it's a 5-star product.",
      "rating": 2.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Great WiFi extender",
      "text": "This won't be much of a review because the TP-Link WiFi range extender does all that it claims. I needed to connect to my home WiFi from across a large yard and the extender allows me to do that. Once set up, it automatically connects to my WiFi when turned on. Great device.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Installed 2 of these routers and work great strong signal and jus bought another",
      "text": "Installed 2 of these routers and work great strong signal and just bought another for another project.",
      "rating": 5.0,
      "verified": true,
      "author": "JalZ28",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Exceptional range ease of use",
      "text": "A little difficult to get set up but once it is working that is exactly what it does...... WORK! Amazing product then I wish I found long ago. We are sharing a wifi signal in 2 houses on 2 separate streets with this monster. I recommend it for anybody and everybody looking to reach out ( WAY OUT) with their WiFi signal.",
      "rating": 4.0,
      "verified": true,
      "author": "Kirk Snodderly",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Very easy setup, did work!",
      "text": "Very easy to setup/install. My Modem and router are one the 1st floor. The extender is on the same floor, but in the kitchen. It definitely helped in getting faster speeds in the basement and on the 2nd floor. But not as strong as I was hoping.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew ",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Junk after a week",
      "text": "Workwd for 1 week. Then webt to crap. Wish i read the reviews",
      "rating": 1.0,
      "verified": true,
      "author": "David and danette",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Easy!",
      "text": "This was such a piece of cake to setup - done in two minutes! Wish all routers and extenders had touch screens! It's working great so far (3 weeks). Will edit this review if anything changes.",
      "rating": 5.0,
      "verified": true,
      "author": "desoto",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "I'm no geek",
      "text": "It would take someone much smarter than me to set this up.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "TP-Links works great",
      "text": "Installed so easy no technical support needed. Paired great with the TP-Link router we just installed.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Mackert",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Worked great for about a week",
      "text": "Worked great for about a week. Switches on and off where you have to reset or reboot once a week. Loses connection constantly. Reviews being left seem fake and encouraged by free product review. The router constantly loses signal. Won't keep connection for more than a day sometimes a hour. For the price you would expect better but this will leave you disappointed!",
      "rating": 4.0,
      "verified": true,
      "author": "Tony Fellows",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "So so",
      "text": "For a whole house wifi extender I had to place this awfully close to the area in which I am serving with it for a string signal.",
      "rating": 3.0,
      "verified": true,
      "author": "Scotty",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Bummer",
      "text": "Kept loosing single very sad about this , had high hopes",
      "rating": 2.0,
      "verified": true,
      "author": "Alex s. Harris",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Excellent for extending your signal",
      "text": "With other extenders, I had to deal with dropped signals. Even when the router is rebooted, the extender reconnects on its own.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Fields",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Really thought this would be a better unit Pros good booster sigle and 4 Hardwire gigbit ...",
      "text": "This Unit did boost my WIFI , however goes down a lot and due to that u have to reboot the Unit... Really thought this would be a better unit Pros good booster sigle and 4 Hardwire gigbit Lan ports a Plus . Cons : Makes you reboot unit, goes down alot :(",
      "rating": 2.0,
      "verified": true,
      "author": "Liquide",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Nice Looking Functional Unit",
      "text": "A very nice looking unit and very good price. I was surprised at the wi-fi strength which is weaker than I expected (based on the signal strength indicator on our devices), but it does the job. The in-built setup capability (no need to access via web browser) is very useful.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Van Breugel",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Check reviews before purchase",
      "text": "Whenever it’s connected it works good but always have to reboot keep dropping signal even though it’s about 25 feet away",
      "rating": 4.0,
      "verified": true,
      "author": "anthony stewart",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "works great",
      "text": "this has a much stronger signal than the small one easy to add",
      "rating": 5.0,
      "verified": true,
      "author": "Truckdude1",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Best one I have purchased so far.",
      "text": "Very easy to initiate. It took all of 2-3 minutes. Great coverage. Fast. Best one I have in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron R. Tuttle",
      "helpful_votes": 3,
      "publication_date": 20160713
    },
    {
      "title": "OK item but not for me.",
      "text": "This was a nice device only it didn't work for me. I think it might have something to do with my having a heating duct running the length of my home and the signals couldn't get past it. I had to return it because it wouldn't extend anything for me. Others will probably have more luck with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "perfect!",
      "text": "Beautiful extender with great signal, strong enough to cover a 2 floor house. Really easy to setup",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson L Cabrera",
      "helpful_votes": 2,
      "publication_date": 20160808
    },
    {
      "title": "Great 2.4 for home automation",
      "text": "Works perfect with matching router speeds are better than expected it has great signal both bands best 2.4 I have found my IOT devices have never been happier",
      "rating": 5.0,
      "verified": true,
      "author": "big james",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Horrible range",
      "text": "Horrible range. Speed is ok but not a great range extender.",
      "rating": 1.0,
      "verified": true,
      "author": "Jef A. Osborne",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "This works well as  WiFi extender",
      "text": "Using this as an extender only and it has performed in an excellent manner. I tried several other extenders and this is the only one that did what it said it would do. Looks nice and not unreasonably priced. I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Thompson",
      "helpful_votes": 2,
      "publication_date": 20160523
    },
    {
      "title": "Awesome",
      "text": "This is really great wifi extender. Easy to use thanks to the big display. My wifi become more strong and more fast. I think this is my best wifi repeater.",
      "rating": 5.0,
      "verified": true,
      "author": "YUSUF NASS",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Does extend the WiFi signal steady, very good",
      "text": "Programming instructions are very clear, I had to seek another way. Went to you tube and there was a good easy way to install your product. But extender work’s very good.",
      "rating": 4.0,
      "verified": true,
      "author": "Jose A. Vazquez D.",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Does the job perfectly and great value",
      "text": "Great works well I was scepticle using extender like this but it works brilliantly out the back of our yard",
      "rating": 5.0,
      "verified": true,
      "author": "davefeltham",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "We like it",
      "text": "We tried a lot of wireless stuff to get range from inside our house to an outside garage about 50 feet away and this did it. Its a metal building so it was tough for the Wi-Fi to go through but tis unit worked for us.",
      "rating": 5.0,
      "verified": true,
      "author": "David B",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Horrible Repeater",
      "text": "It does not work well, it keeps dropping my internet connection and it just doesn't do the job. I got it because I thought it would be better than the router (Touch P5) working as repeater but now I regret so much from buying it. It almost seems it is broken. I thought they would release a new firmware to correct it, but it never happened. Right now it is a paper weight for me because I can not even turn it on otherwise it will mess up with my internet. I had a TL-WA850RE and it worked so perfectly. but this RE590T is horrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Philipe C.",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Super easy setup.",
      "text": "I had a problem figuring placement. After figuring out optimum location, found this works well. Setup is a breeze with the touchscreen.",
      "rating": 5.0,
      "verified": true,
      "author": "DJeep",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Easy to setup",
      "text": "Works very well. Had to reboot a fews time so far for some reason. Good speed",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Campbell",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "awesome",
      "text": "this thing is so great... no more delays in the streaming signal EVER",
      "rating": 5.0,
      "verified": true,
      "author": "steven",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Doesn't extend to my finished basement.",
      "text": "This isnt working for me. I bought it hoping it with help me to get the internet all throughout my house. It doesnt help at all for my house. My plan is to return it. Its a good product just doesn't work for my 🏡.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Works well.",
      "text": "Easy setup with the touch screen interface. Excellent range. Looks spiffy too. Only issue is I can't get it set to daylight savings time. Not a big deal as I don't need it as a clock.",
      "rating": 5.0,
      "verified": true,
      "author": "Zaphod Beeblebrox",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Power line adapters with WiFi work much better for about the same price",
      "text": "Connection to modem is approximately 50 ft across open kitchen, living room, & dining room drops at least a couple of times per day.",
      "rating": 2.0,
      "verified": true,
      "author": "wifiworksusa",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Not worth it",
      "text": "I have a brand new modem and router and the extender keeps losing connection, resetting and dropping signal. Not worth the money. The cheaper tp links work better and are more reliable.",
      "rating": 1.0,
      "verified": true,
      "author": "Louise",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "EZ",
      "text": "EZ to install, looks great and 5G works great and never drops. .",
      "rating": 5.0,
      "verified": true,
      "author": "JRD",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Wasted several hours trying to connect",
      "text": "Wouldn’t connect with my network. Support telling me I had a different product. absolutely no help. Returned the item.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex Banasik",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "WiFi range extender",
      "text": "Extends the range of the downstairs network well. Because of the touchscreen aspect of the device, to me, set up is easier as opposed to the devices that require an app to be installed. Overall a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter D. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Its awful",
      "text": "You have to reset it every for it to work every time you turn around it losing connection.",
      "rating": 1.0,
      "verified": true,
      "author": "Serenityinwv",
      "helpful_votes": 0,
      "publication_date": 20190303
    }
  ],
  "product_meta": {
    "title": "TP-Link AC1900 Desktop Wi-Fi Range Extender w/ Touchscreen Interface (RE590T)",
    "description": "Adjust your Wi-Fi settings using the intuitive touchscreen of the RE590T Dual Band Wi-Fi Range Extender. Easy-to-understand icons help you find every setting you need. Improve and extend your Wi-Fi network with high-performance Wi-Fi speeds up to 1900Mbps. For devices that need reliable connections, such as smart TVs, game consoles, and streaming players, connect them to one of the four Gigabit Ethernet ports. You can even access your settings when you're away from your RE590T using the TP-LINK Tether App on your smartphone or tablet. Plus, experience stronger connections with beamforming technology, which finds and boosts Wi-Fi to every device. Frequency Range: 2.4GHz & 5GHz(11ac); Interface Available: 4 x 10/100/1000Mbps Ethernet Ports(RJ45); System Requirement: Microsoft Windows 98SE NT 2000 XP Vista or Windows 7 8 8.1 10 Mac OS NetWare UNIX or Linux.; Wireless Standards: IEEE 802.11a/ac IEEE 802.11b/g/n",
    "rating": 3.8,
    "feature_bullets": [
      "Set up and adjust your Wi-Fi settings using the intuitive touchscreen",
      "Expand and improve your Wi-Fi range up to 10,000 square feet with High-Powered 700mW amplifiers",
      "Simultaneous gaming and 4K HD streaming with dual band speeds up to 1900Mbps",
      "Provides fast, reliable connections to multiple users with 1GHz dual-core processor",
      "Connects smart TVs and game consoles directly to Wi-Fi using Gigabit Ethernet ports",
      "Find the best spot to set up with the Smart Signal Indicator",
      "Works with any wireless router or access point",
      "Industry-leading 2-year warranty and 24/7 technical support"
    ],
    "specifications": {
      "Standing screen display size": "4.3 Inches",
      "Wireless Type": "802.11a/g/n",
      "Brand": "TP-Link",
      "Item model number": "RE590T",
      "Operating System": "Microsoft Windows 98SE, NT, 2000, XP, Vista or Windows 7, 8, 8.1,10, Mac OS, NetWare, UNIX or Linux",
      "Item Weight": "2.97 pounds",
      "Product Dimensions": "6.2 x 11.2 x 2.1 inches",
      "Item Dimensions  LxWxH": "6.2 x 11.2 x 2.1 inches",
      "Color": "Black",
      "Voltage": "5 Volts",
      "Manufacturer": "TP-LINK USA",
      "ASIN": "B018017S8W",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 16, 2016",
      "Customer Reviews": "3.8 out of 5 stars538 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#218 in Repeaters"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Repeaters",
      "Networking Products"
    ],
    "price": 58.99
  }
}