{
  "website_summaries": [
    {
      "verdict": "Nice price point for a full year of multivitamins that give your dog support in its health in numerous ways.",
      "pros": [
        "If your dogs won't eat these tablets like treats, they're of a consistency that's easy to crumble over the dog's food",
        "Includes many different vitamins and minerals that work for dogs of any age",
        "Manufactured in the United States for safety"
      ],
      "cons": [
        "Some dogs don't like the smell and taste",
        "Formula seems to have changed recently, altering taste"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not buy this, it will result in an expensive vet visit",
      "text": "DO NOT use this product, it's horrible and made my dog sick. I used as instructed and within 30 days of use my dog was becoming increasingly itchy and losing patches of hair. I had to take her to the vet, he said immediately stop giving her the pills that they had caused a rare skin condition. She had to have a steroid shot and is just now growing her hair back. He advised that he's had other clients come in after buying this as well. So not only did I pay for this my get visit cost 70 dollars. I contacted the seller to try and get a refund and never received a response.",
      "rating": 1.0,
      "verified": true,
      "author": "Magoo",
      "helpful_votes": 40,
      "publication_date": 20181129
    },
    {
      "title": "Great Ingredients - Highly Recommend",
      "text": "I compared a lot of vitamins when I was trying to choose some for my dog, and these seemed like the best based on the limited ingredients (my dog has food-related skin allergies). The other vitamins had so many ingredients! I also compared the amounts of individual vitamins/nutrients, and these seemed like a great choice (at a reasonable price, too). We haven't had any problems with these vitamins, and our dog loves to eat them. They stink, but she goes crazy for them!",
      "rating": 5.0,
      "verified": true,
      "author": "D.S.",
      "helpful_votes": 13,
      "publication_date": 20171204
    },
    {
      "title": "Very disappointed!",
      "text": "The container is different than last time and the product must be different as the dogs spit it out. Very disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170809
    },
    {
      "title": "Dogs Won't Eat Them!",
      "text": "Can't get my dogs to eat them! No way no how! Even ground them up, sprinkle on their food and they threw up their food. Might be good doggy vitamins but dogs don't like them AT ALL!",
      "rating": 1.0,
      "verified": true,
      "author": "Skyhook",
      "helpful_votes": 9,
      "publication_date": 20170127
    },
    {
      "title": "My dog loves these",
      "text": "My dog takes these with a bit of peanut butter, he eat it without but it makes it like a treat and he's got an excellent sense of smell so I try to keep him hooked on peanut butter so he doesn't grow tired of the pill flavor. He's extremely picky and refuses all other medications and gets violently ill from flea,tick and heartworm meds so its great to find something healthy that he likes",
      "rating": 5.0,
      "verified": true,
      "author": "Abigail",
      "helpful_votes": 3,
      "publication_date": 20180718
    },
    {
      "title": "Good value.",
      "text": "A lot of people say their dogs don't like the taste of these. I started my puppy on these as soon as I could and he doesn't seem to love them but he has no problem eating them. I just let him eat them out of my hand and he does it just fine. I think it might take some getting used to for some pups but i'm sure if you keep trying they will get used to them. This is also a very large container of vitamins. We break them in half for him so i'm sure this bottle will last us a while! Seems pricey off the bat, but you do get a lot for your money.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinny",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "Pet MD Vitamins",
      "text": "Switched to them years ago when other vitamins from another company had been rated unsafe. Give whole ones to the 2 German Shepherds and 1/4 to the Yorkie. Just mix it in with their food and got some very healthy dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Brown",
      "helpful_votes": 6,
      "publication_date": 20170831
    },
    {
      "title": "pitbull can eat",
      "text": "I bought these since my dog can't eat any dry food out there. (Tons of allergies ) So I'm making his own dry & wet food. These supplements put me at ease that my dog is getting his daily vitamins and minerals. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Georgina Rubalcava",
      "helpful_votes": 19,
      "publication_date": 20160202
    },
    {
      "title": "The vitamins came all broken up.",
      "text": "My dogs love these but the majority of them are broken.",
      "rating": 1.0,
      "verified": true,
      "author": "Candace Carter",
      "helpful_votes": 10,
      "publication_date": 20170929
    },
    {
      "title": "May need a smear of peanut butter",
      "text": "We have a very sweet/loving 8 year old hound-type rescue dog that we've had for a number of years. She is not experiencing any particular symptom, just seems to be slowing down a bit. We thought it time to add a vitamin supplement. When we first got them, she would eat her new \"treat\". Did not love it, but would eat it. However, within a few weeks she turned her nose up at it. Now i just smear a small amount of peanut butter on the top before giving the tablet to her, and she eats them fine. Tablet size is good (not too small; not too large), and I believe they are a good value.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Willie",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Unbelievable results",
      "text": "I started giving these to my 13 year old Corgi about 10 days ago and every evening he has a burst of energy and bounces around like a puppy for a bit. I have not changed anything else so I am amazed that a vitamin can do this. He wasn't an invalid before but he really has perked up. I can't notice a difference in my 6 years old Corgi, but I will say she actually eats these like treats and she won't eat anything else without sticking it down her throat...very finicky so they must taste okay.",
      "rating": 5.0,
      "verified": true,
      "author": "E.O. Stair",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "MY DOGS WOULDN'T EAT",
      "text": "We have two dogs one a black lab that will eat anything. They will not touch these! I tasted them-awful!!",
      "rating": 1.0,
      "verified": true,
      "author": "flyguy",
      "helpful_votes": 9,
      "publication_date": 20171101
    },
    {
      "title": "I'm not completely sold on these just yet. We ...",
      "text": "I'm not completely sold on these just yet. We have four dogs. I replaced another brand due to the product more than doubling in price in a few months time. I was hoping this one would work just as well and it might, if we can eventually get the dogs to eat it. Two of them will take them with no issue, but the other two spit them out no matter how much I try or what kind of treats I use to conceal it. These are dogs that are not normally picky but this has been challenging to say the least!",
      "rating": 3.0,
      "verified": true,
      "author": "Magi",
      "helpful_votes": 23,
      "publication_date": 20160216
    },
    {
      "title": "Good, but could be tastier.",
      "text": "These are great, but I also have nothing else to compare them too 😂 I started using these to insure my dogs are getting everything they need out of their food, but I do have to grind them up with a mortar and pestal to get them to eat them. If they could be made tastier, or maybe in powder form it would be slightly more convenient!",
      "rating": 4.0,
      "verified": true,
      "author": "Maddison",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "My little Yorkie loves them!",
      "text": "I can’t tell you how good they are...but I get the A Okay from my little one every morning when he sits up waiting anxiously for his “vitamin”! He also got a good review from his doc just this week regarding his muscle tone, beautiful coat and great teeth!",
      "rating": 5.0,
      "verified": true,
      "author": "NLK ",
      "helpful_votes": 5,
      "publication_date": 20180417
    },
    {
      "title": "Helping!",
      "text": "I got these hoping it would help my lab with whatever nutrients he is lacking that makes him want to eat our other dog's poo. He's been on it a few weeks now. It has slowed him down but he has not totally stopped. Maybe that is just labs I don't know but it's needs to stop. Hopefully it will eventually.",
      "rating": 4.0,
      "verified": true,
      "author": "Lowej",
      "helpful_votes": 3,
      "publication_date": 20180321
    },
    {
      "title": "... must say that it seems to be a much better bargain than what I have used previously",
      "text": "This is my first time purchasing this product and I must say that it seems to be a much better bargain than what I have used previously. The former product that I used was much larger and you had to give two of them to a larger dog. Many of those tablets came broken in the container. This product is quite small and it only takes one per day for a large dog. None of the tablets appear broken and my dog will gobble it down immediately. I am glad that I found this product.",
      "rating": 5.0,
      "verified": true,
      "author": "DBHGADAWG",
      "helpful_votes": 6,
      "publication_date": 20160620
    },
    {
      "title": "My Little Guys Look Very Healthy!",
      "text": "My little guys wont eat these out of the tub, BUT, they're easy to crush. I have two 11lbs Chorkies so i crush two pills and mix them with half of a slice of sandwich cheese. I place the halve slice of cheese on the powdered pills and use my thumb to gently mash the cheese into it. After a very short time of turning the cheese and mashing, i can take it and shape it into a block that I can break or cut in half. They love their vitamines and they both look beautiful and healthy!",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Dog hates them.",
      "text": "I don't know how well these tabs work as vitamins for my dog and probably will never know because he hates the taste of them, spitting them out at every turn. Disguising them doesn't help and he is willing to give up the promise of any treats not to eat them. He has taken other vitamins in the past and medications without problems such as this. I am afraid I will have to dump them and try another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Allan Levy",
      "helpful_votes": 5,
      "publication_date": 20160930
    },
    {
      "title": "Good",
      "text": "Got it becs the reviews and description swears it’s good for my dog. He hates the taste, but I follow with a treat he loves so it’s our routine. He tries to swallow it so fast, it’s so funny. I’ve had yucky vitamins, medication, shots of alcohol that I can’t stand to swallow, so I get it. He’s such a trooper. Not sure if your pooch will take it like a champ or not, and this is a big bottle, so get a money-back guarantee or try to sample first if possible.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaymie-Lyn Denison",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "These were recommended by my vet",
      "text": "These were recommended by my vet, and I've been giving these to my dogs for almost a year now. They eat them readily, whether I mix them in their food, or if I hand it to them like a snack. I rescued a dog that was extremely malnourished, and she's coming along nicely, I believe in part due to the vitamins. It's a nice big container, so it lasts a good while. I will definitely continue using the Pet MD vitamins.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonya S.",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "This is a excellent product with a complete inventory of essential vitamins and minerals.",
      "text": "I have used Pet MD canine vitamin tabs for several years. As a result, my golden retriever dogs have thrived and their coats look shiny. Since dogs can be fickle as to what they eat and how much they eat, without this vitamin/mineral tab , the status of their health can become precarious.",
      "rating": 5.0,
      "verified": true,
      "author": "TREEMAN",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "My dog loves these!!",
      "text": "I was slightly skeptical about purchasing these vitamins to replace a more expensive brand I used in the past, due to a couple of the reviews. But I'm happy to say that our dog loves these! I put 3 items down for him in the morning (a milk bone, a multi vitamin, and a glucosamine tablet), he always picked the milk bone first - but to my surprise, he now grabs the multi vitamin first!! Very happy with my purchase - he loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "Bobs Mom",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Good product just not for my old doggie",
      "text": "They upset my dogs stomach that her poops are more runny and she poops more often. Not sure they are worth getting up in the night once to let her out to poop.",
      "rating": 3.0,
      "verified": true,
      "author": "Christina C.",
      "helpful_votes": 4,
      "publication_date": 20170519
    },
    {
      "title": "good product / fair price",
      "text": "I have been using these for quite sometime now.. I have several senior dogs and they all need vitamins. These vitamins compare to the ones I was getting from the pet store in ingredients but are much fairer price wise. Sense I have so many dogs needing them, I use a lot if them. I will continue to buy them as long as they are available.",
      "rating": 5.0,
      "verified": true,
      "author": "Annicat",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Helped my dog’s skin and allergies",
      "text": "My vet recommend many of the vitamins in this vitamin in lieu expensive prescription foods. He has bad allergies that cause his skin to break out in rashes. Since taking this multivitamin his outbreaks have been far less severe. I highly recommend this for anyone who has dogs with skin issues!",
      "rating": 5.0,
      "verified": true,
      "author": "GKW",
      "helpful_votes": 3,
      "publication_date": 20180620
    },
    {
      "title": "Great vitamins",
      "text": "I have 5 dogs and I agree these tablets are economically feasible. I only have one dog that'll eat them without hiding the pill in the food, however they breakup easily and the other dogs then eat the vitamin without any problems. I only feed my dogs raw meat and they need a good vitamin. I will be buying these vitamins until my dogs go to doggy heaven.",
      "rating": 5.0,
      "verified": true,
      "author": "harriet ann bly",
      "helpful_votes": 2,
      "publication_date": 20170809
    },
    {
      "title": "Skin is healing",
      "text": "I was looking for good vitamin regimen to help correct a canine skin disorder that was supposed to be a deficit of Vitamin E I think. Ang yway when I researched the vitamins this one had what I needed so I got this one and the puppies skin is actually getting better. he had these little dry skin areas that would or could turn into a growth or something like scoriasis might look. Anyway he is responding to that end and seems to be quite healthy of late.....",
      "rating": 5.0,
      "verified": true,
      "author": "Okie 58",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Great price for quantity and quality",
      "text": "Wish I had found these years ago! The price of the big name brand I used to get went up again, so I thought I would try these. They look and smell exactly like the big named brand co ones and my dog eats them no problem. My dog is medium sized and loves most foods so I knew odd were he would not reject these. The price for the quantity given is so good I will definitely be reordering these from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Angelo",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "A good everyday \"insurance\" plan for your pet.",
      "text": "We were using PetTabs but apparently that product is no longer manufactured. This one seemed closest. We are on our second jar for our dog. As with all vitamins, it is about health insurance, and not something immediately noticeable. This one seems to have a good and broad range of vitamins and minerals in its contents.",
      "rating": 5.0,
      "verified": true,
      "author": "MrLiberty",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "Great Pet Vitamin",
      "text": "I was looking for a pet vitamin comparable to what I would buy at the veterinarian's office without sacrificing the health of my pet, yet slightly easier on my pocketbook. This vitamin was the answer. My 14 year old Golden Retriever he has more energy for his age. My Old English sheepdog, though she is 8 years old, the same for her. I have a great experience with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "William Highfill",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Cures dry noses 🐶",
      "text": "My large mixed shepherd always had a dry nose, for some reason after giving him one tablet a day he has a normal wet nose! My medium sized mixed shepherd about 50 lbs gets half a tablet because the whole tablet upsets her stomach. My large shepherd is 6 years old I wish I started him taking this sooner now he isn't constantly licking a dry nose that his vet said is common in some dogs. 🐶",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great Replacement for Pet Tabs",
      "text": "I bought this as a replacement for Pet Tabs. Some of my dogs were a little reluctant at first, but they now look forward to getting their \"snack\" every day. The tablets are slightly harder than Pet Tabs so are a little more difficult to break in half. Overall we're all very happy with the switch to these.",
      "rating": 4.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 4,
      "publication_date": 20170402
    },
    {
      "title": "My dogs like them, and they are my canine one a day",
      "text": "We have three dogs, different breeds, different sizes and ages. We cut the scored tablet in half for the smallest. The tablet is added to their morning feed and is eaten quickly. They know the difference by the flavor and always eat it. I presume it is a good supplement for protecting their joints. Their coats are healthy and the are happy and active.",
      "rating": 5.0,
      "verified": true,
      "author": "Alma L. Annab",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "The dogs like the taste as well as the others",
      "text": "We had been using Pet Tabs Plus AF, but the price went through the roof for some reason. I found these and after reading the labels they are the same at a portion of the cost. The dogs like the taste as well as the others. Will be buying more when these run out.",
      "rating": 5.0,
      "verified": true,
      "author": "jonathan",
      "helpful_votes": 3,
      "publication_date": 20170630
    },
    {
      "title": "The dogs don't seem to like these quite as well as Pet Tabs",
      "text": "The dogs don't seem to like these quite as well as Pet Tabs, but they still take them easily and they are much less expensive.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Steiner",
      "helpful_votes": 3,
      "publication_date": 20171127
    },
    {
      "title": "My two Lakeland Terriers enjoy their vitamin tablets",
      "text": "My two Lakeland Terriers enjoy their vitamin tablets, but to be 100% honest in this evaluation, their original tablet which according to labels had the same content was something they loved more (like candy) which was Pet-Tabs that are no longer available. I would suggest evaluating the Flavor of this older brand to make the dogs as enthusiastic.",
      "rating": 4.0,
      "verified": true,
      "author": "James G. Montagnino",
      "helpful_votes": 3,
      "publication_date": 20170218
    },
    {
      "title": "Great quality and quantity!",
      "text": "I really like that this is a huge tub of vitamins for both of my puppers to take! Things get expensive for dogs but this quantity for a cheap price is great. I give 2 to my Great Dane and 1 to my shar pei. They love the flavor and think of them like treats. This will last quite awhile, at least 3 months for both of them which is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Skyla",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "It's working!!",
      "text": "One of my dogs has been scratching a lot and we couldn't figure out why. No fleas. We bathed her is special (and expensive) shampoo, get her an allergy shot, have her Benadryl for weeks. Nothing helped. I started her on these (both dogs) and after a week we started seeing a difference. She rarely scratches now.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Martinez",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Pug approved",
      "text": "So far so good.Its been 2 weeks. My pug gets 2 homemade meals a day. I use a cup to smash half a tab for each meal. She gobbles her food up, and hasn't vomited. She has a past of puking several times a week, when eating store kibble. So, I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jgseykg",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "My 15 year old Alaskan Husky will eat this if ...",
      "text": "My 15 year old Alaskan Husky will eat this if I chop the tablet up into small bits and mix it in with his regular canned food.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan Williams",
      "helpful_votes": 3,
      "publication_date": 20170926
    },
    {
      "title": "Not happy",
      "text": "BOTH my dogs got booger eyes while on these tabs. It took about 3 days to clear. I had a hard time believing it was the tabs so I gave it to them again and the eye boogers came back the next day. Needless to say these tabs are going to be donated to the shelter! Stick with Pet Tabs!!",
      "rating": 1.0,
      "verified": true,
      "author": "Yvonne Wolfe",
      "helpful_votes": 4,
      "publication_date": 20180826
    },
    {
      "title": "good ingredients but my dogs hate the taste",
      "text": "The problem I have with these is getting my dogs to eat them, they absolutely hate them and I find myself forcing them into my dog's mouths. Even pill pockets won't work. Wish my dogs found them tastier, as I like the idea of giving them a vitamin supplement.",
      "rating": 3.0,
      "verified": true,
      "author": "Eve S.",
      "helpful_votes": 4,
      "publication_date": 20160906
    },
    {
      "title": "Pup doesn't like the smell and I have to hide in something ...",
      "text": "Pup doesn't like the smell and I have to hide in something tasty. He could also just be taking advantage of the opportunity to get an extra treat. Sometimes I wonder who has who trained.",
      "rating": 4.0,
      "verified": true,
      "author": "AZSA",
      "helpful_votes": 4,
      "publication_date": 20171223
    },
    {
      "title": "Good results",
      "text": "I have to crush them up and add it to her food but in 1 week she went from a dull, dingy rescue pup to an OMG so shiny and happy pup!",
      "rating": 4.0,
      "verified": true,
      "author": "Brandy",
      "helpful_votes": 4,
      "publication_date": 20170828
    },
    {
      "title": "We now know they're getting everything...",
      "text": "One Corgi thinks these are treats and gobbles them right up! Another thinks it's a trick but agrees to fall for it sometimes; otherwise it gets administered like any other pill - either crushed into the food or placed at the back of the tongue. We purchased these because we make our own dog food and wanted to ensure that the pups were getting all necessary nutrients. I will buy again when these run out.",
      "rating": 4.0,
      "verified": true,
      "author": "TheSeekerOf",
      "helpful_votes": 2,
      "publication_date": 20160815
    },
    {
      "title": "I recommend feeding them to your fur babies before giving them ...",
      "text": "Pets are indifferent towards them. I recommend feeding them to your fur babies before giving them a meal. They take them reluctantly even when they're hungry.",
      "rating": 4.0,
      "verified": true,
      "author": "Erem",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "... Medicare tabs about 1 year ago and have been pretty satisfied with them",
      "text": "I'm switched to Pet Medicare tabs about 1 year ago and have been pretty satisfied with them. I have 6 small dogs, doxies, poms and chihuahuas, three if which had no problem taking them. Although, they probably will eat anything. The other two have decided they didn't want to miss out on anything and now take them just as well as the others. As for my pomagranite, it takes her a little longer to chew, so it crushes it up and put it in her food.",
      "rating": 4.0,
      "verified": true,
      "author": "Brenda Clark",
      "helpful_votes": 3,
      "publication_date": 20161217
    },
    {
      "title": "I feel better about my furbabies getting their vitamins and minerals since ...",
      "text": "I feel better about my furbabies getting their vitamins and minerals since I've started them on Pet MD. I put one in their food and do not have any problems with them eating them. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "MaryB",
      "helpful_votes": 4,
      "publication_date": 20170405
    },
    {
      "title": "made it thicker and my picky dog now takes it happily. Great product",
      "text": "Didn’t care for it the 1st time I bought it but they improved it, made it thicker and my picky dog now takes it happily. Great product ,Great price, forget pet tabs they’re crazy on their price. Buy this one instead",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180303
    },
    {
      "title": "Happy customer",
      "text": "So far, I'm happy with the product. I love the 365 count, which many don't have. The quality is nice, the feel is smooth and round and there is no unpleasant odor. Quantity says 1 per day, which I wasn't used with my other brand for 50 pound dogs. I'm going with it... Both of my dogs love it and I had no trouble transitioning from the old brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Lopez",
      "helpful_votes": 4,
      "publication_date": 20161011
    },
    {
      "title": "Crumbly tablets in this bottle.",
      "text": "We are on our third bottle of Pet MD, but this bottle is not of the same cutting quality as the first two. The tablets crumble when you cut in half. Not sure if the bottle was subjected to an extreme temperature or what, but it does make for more waste as we need to cut 2 tablets daily.",
      "rating": 2.0,
      "verified": true,
      "author": "Charles Carter",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Good so far",
      "text": "I have been using regular Pet Tabs Plus for years. It seems to be available no longer - or, at least, very difficult to obtain - so I decided to try these tabs. The dogs like them but it is too soon to say whether they will be as good for them as the others were. (I have no reason to think they will not be, which is why I have given them four stars.)",
      "rating": 4.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 2,
      "publication_date": 20170107
    },
    {
      "title": "Pet-Tab Alternative",
      "text": "Can't beat the price when comparing to Pet-Tabs. My pup seems to like them slightly better too. It's no bacon, but she eats them right away. Ingredients are almost identical.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Tre",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "One a day keeps the Vet Away. My English ...",
      "text": "One a day keeps the Vet Away. My English Setter lived for 16 1/2 years taking one Vitamin and Mineral Tablet a day all his life. This bottle get you through a whole year. Cheap insurance I say...",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Mitchell",
      "helpful_votes": 2,
      "publication_date": 20180429
    },
    {
      "title": "My dogs love them - been using them for years",
      "text": "My dogs eat them just like - don't have to crush them. I cook my own dog food so I add some supplements to their food and this one of them I use. Been using it for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydie",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Right from the Bottle",
      "text": "I never thought my dogs would go gaga over vitamins. But they do.My female is very picky. I have to grind up her other pills and add them to her food. These she eats right out of my hand!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaina Gallagher",
      "helpful_votes": 2,
      "publication_date": 20180216
    },
    {
      "title": "Refused by my 2 Shih tzus :(",
      "text": "Neither of my dogs will eat these. I'll try crushing them and adding it to their food, but it sure would be a lot easier if they found these to be palatable.",
      "rating": 2.0,
      "verified": true,
      "author": "Cleaningoutmyclosets",
      "helpful_votes": 4,
      "publication_date": 20180117
    },
    {
      "title": "Disappointing purchase",
      "text": "I have to feed this vitamin to my dog as medicine because he will not accept it as a chew... It must smell or taste bad to him. I've never had the problem of getting him to chew his vitamin as if it were a treat.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara D. Van Cleve",
      "helpful_votes": 6,
      "publication_date": 20160625
    },
    {
      "title": "Great Product / Value",
      "text": "This was my 2nd time purchasing this product. I crush it up and mix it with her food and have never had an issue with her consuming it. People always comment how great her coat is - I will continue to use and would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Hink",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Loves His Multi-V",
      "text": "My German Shepherd Dog loves his multivitamin every morning. He is in position and ready for it as soon as the cabinet door opens. Great product and excellent service. Arrived ahead of schedule.",
      "rating": 5.0,
      "verified": true,
      "author": "Engineer",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Two Stars",
      "text": "Two of my dogs developed itching after taking these, and it stopped after I discontinued using them.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve Shifflett",
      "helpful_votes": 3,
      "publication_date": 20180329
    },
    {
      "title": "Great Value.. good tasting <as per 3 shelties>",
      "text": "Good boost of nutrition for my dogs.. they love the taste and push each other out of the way to get their daily \"Treat\".. . at a price I can afford.. PS.. my neighbors picky beagle doesn't like the taste, so that part is up to your dogs.. mine are Shelties..",
      "rating": 5.0,
      "verified": true,
      "author": "wolfriend",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Great product - five year's experience",
      "text": "My rescue pup is very happy with these vitamins after taking for five years. There is never any hesitation on flavor. The price is right for a year's supply. I package the vitamins along with fish oil when this pup is boarded overnight for several days.",
      "rating": 5.0,
      "verified": true,
      "author": "Dumela",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Great vitamins and dogs all love them!",
      "text": "Been using these for a while now with all my adults and puppies. They all like the taste and gobble them right up. Good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Hall",
      "helpful_votes": 2,
      "publication_date": 20190220
    },
    {
      "title": "They love them, think they are treats",
      "text": "Bought these for our 13 year old cocker spaniel and 8 year old mixed breed. They love them, think they are treats. I had been buying another brand prior to this and they became too expensive. Very pleased with the purchase and both dogs seem to be doing very well on these. I also like the fact that they are made in the USA. That was a contributing factor to my purchasng them.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 2,
      "publication_date": 20160910
    },
    {
      "title": "Dog hates the taste",
      "text": "My dog hates the taste of these and he loves most everything",
      "rating": 1.0,
      "verified": true,
      "author": "Buddy's Dad",
      "helpful_votes": 5,
      "publication_date": 20160725
    },
    {
      "title": "my 4 Dogs love the taste and take it every day",
      "text": "my 4 Dogs love the taste and take it every day. I give 1 full one to each of the big dogs and cut one in half for the 2 small dogs",
      "rating": 4.0,
      "verified": true,
      "author": "Rain",
      "helpful_votes": 3,
      "publication_date": 20170505
    },
    {
      "title": "Not as chewable as they claim",
      "text": "These are hard vitamin pills and not chewable as they claim it is. I have to use a mortar and pestle to grind the pills into powder because my dog won't chew it. It won't even soften if the whole pill gets wet.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170322
    },
    {
      "title": "DOG SAY YUKE!!!",
      "text": "DOGS DONT LIKE THE TASTE!!! SO THEY WON'T EAT THEM..",
      "rating": 2.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 4,
      "publication_date": 20171106
    },
    {
      "title": "A good multi vitamin for dogs of all ages",
      "text": "Like that these vitamins have lots of things that my pups need to be healthy. I have 2 golden retrievers aged 11 years and 17 months. These vitamins are appropriate for both dogs, despite the age variation. Give extra gloucosamine, turmeric and fish oil and probiotics for elder dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary E Kuebler",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Dogs Won't Touch Them",
      "text": "My dogs usually do not refuse to eat but they refuse to eat these. I have to disguise them so they will take them. Even if I break them up in their soft food they will not even eat the food. I thought they would be soft and they are hard. Our dogs are shih tzus.",
      "rating": 1.0,
      "verified": true,
      "author": "Ladibug",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Like the multivitamin and mineral for daily health benefits",
      "text": "I’m using it as a daily multivitamin and mineral supplement. In any dry dog food kibble , it is heated to 500 degrees killing many of the nutritional value the package claims . So I add this to help offset that . My dogs love them and their eyes are bright , nose is cold wet , great energy levels . Very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Ocean",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Not sure",
      "text": "Sometimes makes my dogs sick. I started cutting them in half",
      "rating": 3.0,
      "verified": true,
      "author": "Sidecar50",
      "helpful_votes": 2,
      "publication_date": 20180727
    },
    {
      "title": "Great vitamins and all our dogs love them",
      "text": "We have 5 dogs and they all love these vitamins. I have been buying them for about 2 years for now, and they helped our 2 doxies successfully recover after back surgeries. Very recommend this product as a daily supplement to your furry buddies :)",
      "rating": 5.0,
      "verified": true,
      "author": "Tatty",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Quality product,  reasonable price & prompt delivery!",
      "text": "This is 2nd purchase! My dog is 13 human years & has been taking vitamins since he was a puppy. I switched brands last year. After researching best option, I'm glad I found this!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Zito",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Been using this for over a year.",
      "text": "I've been giving this to my Amstaff for over a year now. I'd say it's aided his overall health substantially. He's on a raw diet & I've noticed an overall improvement in his energy levels & daily activities.",
      "rating": 5.0,
      "verified": true,
      "author": "Emosh",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Excellent so far",
      "text": "dog loves the flavor, looks forward to his daily pills. It's only been a week or so, can't comment on result. If ingredients are what label claims, I expect to see changes in the next blood workup in 6 months. time will tell, fingers crossed",
      "rating": 5.0,
      "verified": true,
      "author": "Review",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "As good as others -- and better than most -- with a decent price!",
      "text": "Lower cost than others but with just as much or more packed into them. Even my finicky dog is taking his every morning -- some others we had to \"trick\" him into taking.",
      "rating": 5.0,
      "verified": true,
      "author": "pdlmh",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Dog Added nutritional addition",
      "text": "Great multi vitamin, a pill a day keeps the vet away. This is an excellent buy and surprisingly used by vets pets. Highly recommend. The specialist ortho uses this for product for her dog... must be good!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline L.",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Dog loves them",
      "text": "I can't speak for the content, but for some reason, the dog loves these. She waits for me to throw it in her bowl in the morning before she eats, so I have no problem getting her to take them.",
      "rating": 5.0,
      "verified": true,
      "author": "BlueButtafly",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Dog vitamins",
      "text": "I'm not real sure how to write a review about dog vitamins? Well they don't seem to mind the taste, I just throw a tab a piece in with their food and they always eat it. I can't really speak to how they are doing on them but I don't notice any ill effects. I suppose they are doing what they say they are for.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent D.",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "My dogs take no problem. Great value",
      "text": "Great value for my 6 dogs. It last me 4 months. Good to have in your emergency food package. I bought 2 for mine",
      "rating": 5.0,
      "verified": true,
      "author": "Highsheri",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great product find in Amazon for dogs",
      "text": "Great product for dog daily vitamin intake. Great product to purchase when you have multiple dogs. Great price, for quantity. Recommend product for daily vitamins for dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Conklin",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "One Star",
      "text": "My dogs would touch it. I gave them to a friend",
      "rating": 1.0,
      "verified": true,
      "author": "Sherribugg",
      "helpful_votes": 4,
      "publication_date": 20171117
    },
    {
      "title": "it doesn't smell very good. My dog eats it",
      "text": "it doesn't smell very good. My dog eats it, but it is not something she loves. in order for her to eat I have to have it mixed with her wet food.",
      "rating": 4.0,
      "verified": true,
      "author": "Mas NY",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Same as more expensive brand.",
      "text": "Both dogs seem to love them. They have the same vitamin/mineral content as the brand I was previously buying, but at a much lower cost. They are harder, so I crumble it for my Chiweeni (who is missing some teeth). I've been using these for about a week and haven't found any tablets that were broken. So far, so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Tia Deb",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "My dogs like them!",
      "text": "My dogs like them so I guess they taste good. My dogs haven’t told me how they are for pain! ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Lane & Fran Lobaugh",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Our 5 huskies approve 5 waggling tails/5 waggling tails",
      "text": "We have 5 huskies ranging 6yrs to 2yrs old. And I got to tell you these are awesome, helps the bottle lasts at least a month and we feel better about what their getting. Price quality and quantity tickle us purple. If your looking look no farther.",
      "rating": 5.0,
      "verified": true,
      "author": "5 Huskies and their Hoomans servants",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Good vitamins",
      "text": "I've been feeding my dog these multivitamins for a year and a half now, and she's not dead yet. I hope they are doing good, but how should I know? She doesn't talk to me.",
      "rating": 5.0,
      "verified": true,
      "author": "BubbaHoTep",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "We've seen improvement with the health of our dogs while using these vitamins.",
      "text": "We make our own dog food and we've noticed an improvement with their coats and energy levels since incorporating these vitamins.",
      "rating": 5.0,
      "verified": true,
      "author": "Jameson",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Great deal",
      "text": "This was the first vitamin I tried for my Min-Pin. He not only takes them well, but they are a great value for the money. Very satisfied with the ingredients in this item also",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "GREAT PRODUCT THAT LASTS A LONG TIME",
      "text": "MY DOG LOVES THESE GREAT QUALITY VITAMINS. THE SHIPPING WAS FAST AND THE PRICE WAS REASONABLE.",
      "rating": 5.0,
      "verified": true,
      "author": "Rae",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "My lab loves them!",
      "text": "I have a 5 yr old chocolate lab and she loves these vitamins. You get a years worth in one bottle so it’s a great deal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Amaral",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "My 2 dogs think this is some kind of treat ...",
      "text": "My 2 dogs think this is some kind of treat since the size is so small, so they inhale it in a second. My 11 years old golden had a warts that was accidently got cut during grooming. The wound wont heal for a month, so i give him this, and its gone within 3 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "This supplement really works",
      "text": "My dogs get a tablet twice a day. The formula is identical to the far more expensive PetTabs Plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. Post",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "The dogs love it!",
      "text": "The dogs love it and they seem to be doing well on it. No stomach issues at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Coolada85",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Multi vitamins",
      "text": "I just received this product two days ago, so I can't really rate it until my dog has been on the vitamins a few weeks. I'm sure they are going to be good, but will have to wait and see!",
      "rating": 1.0,
      "verified": true,
      "author": "Granny",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Not good for all dogs",
      "text": "I have 2 dogs 1 dog was fine but other dog started having itchy skin all over so I had to stop feeding.",
      "rating": 3.0,
      "verified": true,
      "author": "maimai",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "PET MD Tabs will keep your dog healthy",
      "text": "These Pet MD tabs for dogs are great! I buy a bottle every year and my dog loves the flavor of them, he chows them right down. H3 provided me with excellent service and I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "RZII",
      "helpful_votes": 0,
      "publication_date": 20181107
    }
  ],
  "product_meta": {
    "title": "Pet MD - Canine Tabs Plus 365 Count - Advanced Multivitamins for Dogs - Natural Daily Vitamin and Mineral Nutritional Supplement - Liver Flavored Chewable Tablets",
    "rating": 4.5,
    "feature_bullets": [
      "NATURAL ADVANCED FORMULA VITAMIN AND MINERAL SUPPLEMENT PROMOTES HEALTH AND ENERGY in young active puppies, working, or senior dogs.",
      "365 DELICIOUS DAILY USE TABLETS can be given as a chewable treat or crumbled into food. Dogs love eating these delicious liver flavored treats.",
      "HIGH QUALITY SOURCE OF PROTEIN promotes skin and coat to help your dog stay healthy and look great.",
      "CERTIFIED SAFE by Independent Lab. Microbiological tested for EColi, Salmonella, Staphlococcus Aureus, Coliforms, Yeast, Mold & More.",
      "MADE RIGHT HERE IN THE USA in Federally Regulated Manufacturing Facilities in Small Batches for Quality and Freshness."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "5.6 x 3.6 x 3.4 inches; 1.55 Pounds",
      "Date First Available": "November 15, 2015",
      "Manufacturer": "Pet MD",
      "ASIN": "B0180A1JQ0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Supplements & Vitamins",
      "Dogs",
      "Health Supplies",
      "Pet Supplies",
      "Multivitamins"
    ],
    "price": 34.95
  }
}