{
  "website_summaries": [
    {
      "verdict": "A sturdy fishing line that doesn't stretch or fray and holds up well over time.",
      "pros": [
        "Six color choices",
        "Durable line that holds knots easily and won't stretch",
        "Reasonably priced",
        "Line stays together and won't fray over time",
        "Low memory",
        "Small diameter"
      ],
      "cons": [
        "Some have said that the line's color fades quickly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I would buy this line again.",
      "text": "Recently went to Kiritimati (Christmas) Island for some flats fishing. Also did a day of blue water fishing offshore for some pelagics with a heavy spin outfit. Put the line to the test on some yellow fin tuna and wahoo and went undefeated on the day. Nice castability and no break offs. I tied a short length of flourocarbon in case a giant Trevally took me into the coral but never became an issue. I was able to put enough pressure on the fish early and kept them out of the sharp stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 37,
      "publication_date": 20190414
    },
    {
      "title": "This is absolutely the best braid on the market!",
      "text": "I cannot break this line while fishing. It it the strongest braid available! And it is half the thickness of regular braid. I replace it often because I fish around a lot of rocks, but it has never failed....not once! I use the 30 lb test in yellow. The fish don't seem to mind the yellow, but it helps me see the line as I cast. I love it - I have ordered numerous 547 yards spools and will continue to do so.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ-54",
      "helpful_votes": 38,
      "publication_date": 20180920
    },
    {
      "title": "Awsome !!!!",
      "text": "I’m a avid fisherman that fishes for many species mainly bass on arrival I loved the color of the line witch is important to me I’ve have now flipped the line a few weeks on spincast and baitcasters and the product is working great and performing perfect no grays in line no tangles great product I will definitely continue to use just wish they had some shirts for me I’d definitely promote and wear it on my fishing tourneys",
      "rating": 5.0,
      "verified": true,
      "author": "derek m coleman",
      "helpful_votes": 32,
      "publication_date": 20190530
    },
    {
      "title": "Strong and pretty",
      "text": "I usually use braid with a mono leader and have struggled to find braid I like. This is now my braid of choice. Great value and pretty cool colors. I love the blue I ordered! This braid is super strong but not a giant diameter making it easier to tie together with mono. Will be switching my reels to Onyx braid now.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline McManus",
      "helpful_votes": 30,
      "publication_date": 20190702
    },
    {
      "title": "Don’t overpay for braid!",
      "text": "All I can say is wow.... about 2 years ago I switched to running primarily braid on all my setups. I do a lot of small river and Creek fishing. I picked up the high vis yellow in 15lb. I primarily used power pro and was tired of spending $15 on a 150 yard spool. This stuff is half the price and it works just as good. I wish I had gotten on this train sooner! As an added bonus you can clearly tell the Piscifun braid is way brighter than the power pro. I love this when drifting lures in the river and detecting light bites! Do yourself a favor and save some money with this stuff !",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Davis",
      "helpful_votes": 41,
      "publication_date": 20180130
    },
    {
      "title": "Amazing braid! I have tried so called high end ...",
      "text": "Amazing braid! I have tried so called high end braid and this braid truly delivers what you want for your money and time spent on the water. Out preforms anything I have tried. I steelhead and salmon fish most of the year in Western Washington rivers and saltwater beaches in the Puget Sound. This line has not failed in anyway and I would recommend anyone that wants more out of their fishing experience to buy this product. Absolutely outstanding!! Thank you for producing excellent products! Fish on !! Customer for life",
      "rating": 5.0,
      "verified": true,
      "author": "L C",
      "helpful_votes": 35,
      "publication_date": 20180225
    },
    {
      "title": "Used by RaisedRightFishin'",
      "text": "This is a great all around line that I have used for bass fishing. I purchased this Onyx line and you can see it, along with other Piscifun products, in action on the video connected to this review. I recommend this line to anyone who enjoys using braided line and wants to get a quality product that matches higher end material without breaking the bank. I have pulled my lures and fish through the thickest areas I could find with this line without any problems at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Kohl Dusenbery",
      "helpful_votes": 33,
      "publication_date": 20180617
    },
    {
      "title": "Superman Hair Strands",
      "text": "This line is awesome. I’m not a seasoned angler but my Mom is and she ganked it from me after her bird nest with her mono. Now I gotta buy a replacement! All good though. Best thing I like about it is the low (really non) memory. Oh yah, sharpen your cutter/knife cuz this stuff is tough. It’s like it was made from Superman hair strands. Lastly I love the color. It’s low vis so the fish are non the wiser. Loved this string and I’m glad I got it. Like I said, I’m gonna buy more!",
      "rating": 5.0,
      "verified": true,
      "author": "Braddock",
      "helpful_votes": 32,
      "publication_date": 20180303
    },
    {
      "title": "great fishing line,simply , excellence in fishing lines",
      "text": "great fishing line...very strong , no memory stuff,simply , excellence in fishing lines, very strong, i put 300 yds of Piscifun braided 30 pds in my fishing reel and after 30 mins of fight with a 120 pds Tarpon , the line resist perfectly . i love that fishing line. i recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "ED TüKER",
      "helpful_votes": 49,
      "publication_date": 20160415
    },
    {
      "title": "So many possible uses",
      "text": "I got this to use in restringing wind chimes whose string fell apart after several years. This is strong, flexible, was easy to use. It had the additional benefit of being a great deep blue color which matched the repainting I did on the wooden parts of the windchimes. Love this and will definitely order again when I need a different color or weight.",
      "rating": 5.0,
      "verified": true,
      "author": "MsGlo",
      "helpful_votes": 16,
      "publication_date": 20180906
    },
    {
      "title": "Horrendous wind knots.",
      "text": "I originally gave this line 3 stars. After using it for the third time today, I realize that was far too generous. This line is garbage. Cast distance is just so-so, knot strength is good, but the incessant wind knots are just disabling. Every third cast you get a monster wind knot no matter the cast technique, weather conditions, lure weight, doesn’t matter. I spend more time untangling wind knots than fishing. I finally threw this line out and re-spooled with fireline. I took a chance on this line, but definitely do not reccomend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Johnathon Martin",
      "helpful_votes": 13,
      "publication_date": 20181211
    },
    {
      "title": "Dye ruined rod aesthetics and clothes.",
      "text": "Line bled on and permanently stained my brand new rods reel seat. Was white, now blue. Hands stained after after several hours and multiple washes later. Pants permanently stained. Definitely won't be buying anything piscifun again.",
      "rating": 1.0,
      "verified": true,
      "author": "Clay Wilder",
      "helpful_votes": 18,
      "publication_date": 20180515
    },
    {
      "title": "It may work for you, and it may not.",
      "text": "Seems to be a strong durable product however with every outing I am disliking it more and more. It floats similar to flu line which I tend to like, and I bought the hi-vis yellow which is amazing to see where your line is at. It gives good feedback when jigging I can feel everything. But it ties itself in knots around my spool while my power-pro spooled identical rig is going strong. I’d say keep looking if you are hoping to save a few bucks try to find a Suffix,Powerpro,or spiderwire on sale. Tight lines!",
      "rating": 3.0,
      "verified": true,
      "author": "nondog",
      "helpful_votes": 5,
      "publication_date": 20190328
    },
    {
      "title": "Dissapointed",
      "text": "I don’t know if I got a bad batch I bought 40lb 547 yards. I have to say it’s awful. After spoiling a conventional reel as tight as possible it feels as if it was a cushion on the spool which is bad because when the line tightens it digs in. Also when I went to adjust my drag line would snap at 14lbs this is supposed to have a 40lb rating. I never had this happen to me. I can’t recommend this for conventional reels. Maybe for spinning reels.",
      "rating": 1.0,
      "verified": true,
      "author": "Tkp666",
      "helpful_votes": 4,
      "publication_date": 20190609
    },
    {
      "title": "backspin on a baitcaster led to disaster",
      "text": "after a minor backspin on a baitcaster, I quickly found myself in a bad scenario with this braid. not only did this quickly become the worst birds nest I've seen and tried to work through, it became evident there is just GLOBS of black dye used to make this product, and it comes off very easily! about 10 minutes into trying to undo the birds nest, my hands were black. the nest ended up being bad enough that all the line had to be cut out. it has do to with the shape of the braid, like a cross section. it's not near round. and those sharp cross section 'edges' can cut into other sections. not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "Tommy Bananas",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Line must have been old",
      "text": "I tried using it this weekend to do some calico bass fishing. The braided line must have been old cause Every time I tried to tie a knot the line would break. The time it didn’t break I hooked up a fish and the line broke. With 10lb braided line it should not break just trying to tie a knot and definitely shouldn’t break in a 2-3lb bass.",
      "rating": 1.0,
      "verified": true,
      "author": "JASON COLLINS",
      "helpful_votes": 4,
      "publication_date": 20190310
    },
    {
      "title": "Excellent value.",
      "text": "I very much dislike spooling lots of money's worth of line on my reels so I usually go cheap, but cheap braid can mean stiff, slippery lines and unreliable knots. This Piscifun Onyx Braid strikes a very comfortable balance between bargain and quality. I spooled it on three different rigs running three very different weights of bait and they all cast extremely well -- even head on into a 10 mph wind -- and they all held their leader knots tightly even after a full day of soaking baits. This will be my go-to braid until something better comes along.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Reilley",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Better than Spiderwire Braided?",
      "text": "It appears to be better than Spiderwire braided line in both fray resistance and color hold. The black line virtually disappears and when I have bottom rigs sitting I can't see where my line is going in the water. Unlike Spiderwire, this doesn't leave dye on my fingers when I'm tying knots and break resistance is also great. I had to pull my line out of a tree and it broke the branch before it broke the line. I'm getting this going forward.",
      "rating": 5.0,
      "verified": true,
      "author": "B.T.S.Top Contributor: Gardening",
      "helpful_votes": 3,
      "publication_date": 20190103
    },
    {
      "title": "Not Recommended Product",
      "text": "I have tried couple low price line and non will hold the label Lb test number. I have purchased a 50lb test line, with 10 tests didn’t hold more than 28lb, if you apply 18-20 consistent weight for 60 sec then release and apply weight again it won’t hold more than 22 lb for the second test. the line not smooth and has higher diameter than what labeled. Still 3 star considering the price",
      "rating": 3.0,
      "verified": true,
      "author": "Mike S",
      "helpful_votes": 2,
      "publication_date": 20200115
    },
    {
      "title": "It’s strong",
      "text": "I wanted a strong line and that’s what this is, a strong line. But, I don’t care for it at all. I’ve used braided line over the years and this is not to my liking at all. I’m having issues casting it distances and it makes a loud noise that I don’t care for, just obnoxious. I’ll keep it on my reel for a little yet to see what happens and hopefully it wears down and works properly. Other than that, I don’t think I’ll ever buy this line again.",
      "rating": 3.0,
      "verified": true,
      "author": "Sagerods",
      "helpful_votes": 2,
      "publication_date": 20190626
    },
    {
      "title": "Not what I was expecting",
      "text": "I absolutely love piscifun reels,that being said my flame 2000 reel performs better with 6lb kastking pro (even 10lb to be honest ) than this ,it also seems to be alot more noisy as well I dont know if this is just my experience but had higher expectations for this but if budget is your concern I do think this is a bit cheaper and all in all it does catch fish",
      "rating": 3.0,
      "verified": true,
      "author": "Apex_bankfishing",
      "helpful_votes": 2,
      "publication_date": 20200204
    },
    {
      "title": "Not too pleased",
      "text": "Line seemed to be less powerful than stated. It was also said to hold its color well but the color was staining my thumb every time I would cast. Had a few snags and when I pulled on it the line popped instantly. Compared to other brands it seemed to be much thicker for a 30lb braid. I am returning what’s left of the spool and tossing the rest. I will be using my regular brand. This company makes an awesome reel but I really didn’t have a good experience with the line or the rod. The rod will be a different review.",
      "rating": 2.0,
      "verified": true,
      "author": "tiff123",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Depends on the type of fishing you do.",
      "text": "Seems tough enough and a good line for the money. My only problem with the line so far is that it's sticky. I have 10lb test on a Lews spinning reel and primarily use plastic grubs and swim baits. This morning I was using a 3/8oz jig head with a 3\" grub. After I cast, I let the bail open till the bait sinks to the bottom. I had to pull the line off the spool by hand because it seemed to stick to itself. I never had to do this with other brands. I guess it all depends on the type of fishing you do, but if you're a soft plastic fisherman, you know what to expect.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Gunks up any part it rubs consistently.",
      "text": "Started spooling up a reel, felt some odd resistance after about halfway into it. Found a black deposit on the reel where the line slides across some parts. The line I ordered is black, so I guess it’s the dye that is coming off. In order to remove, I had to scrape it off. After finishing off the spool, it happened again. The gunk buildup decreases cast and messes with the drag on retrieve. I removed this line, cleaned my reel, and replaced with a better quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Bo",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Bleeds die Don't buy!",
      "text": "Green bleeds on everything, hands, reel eyes. And when I unload it when we get home from vacation I fully expect the reel spools to be green. Also faded out after one use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190604
    },
    {
      "title": "Happily Surprised... 50lb",
      "text": "Near perfect line for me. Bought the 50lb for near shore ocean bottom fishing. Can tell it is well constructed just by handling it. The only thing i could say negative is that is is just a bit \"rougher\" than Power Pro. This is not an issue for me as I wont really be doing any casting. Still not a big issue. Really pleasantly surprised overall as I was quite sceptical as this was the first time trying something other than Power Pro, Tufline (which sucks) or Suffix 832(great for casting). ...\"Would not consider this some cheap china line you get what you pay for pay for\" it is actually pretty great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Bentley",
      "helpful_votes": 2,
      "publication_date": 20181203
    },
    {
      "title": "Not 25lb line like stated",
      "text": "I have bought 2 of these spools and spooled 2 reels, I've had issues with both lines just snapping for no reason. I went to set the hook in my local lake and line just snapped. It's a urban lake in az most fish are around 5-8 lbs the line bought was 25lb. I'll never buy this product again. If the company reaches out and supply's me with heavier line and works accordingly I'll edit review. As of now this 25lb line is about 4 lbs line in my eyes.",
      "rating": 1.0,
      "verified": true,
      "author": "heather odai",
      "helpful_votes": 3,
      "publication_date": 20190722
    },
    {
      "title": "I'm not a fisherman.",
      "text": "But I do repair clocks. I recently acquired a Herschede grandfather clock, which needed repairs to the chime drive train, specifically the strings which connect the chime levers to the bell hammers were broken or missing. The braided Dacron Onyx 100lb test fishline was a perfect fit (0.55mm), and the only fishline I could find in black. It's high resistance to abrasion is welcome as there is some as the hammers move to strike the bells. I bought 150 yards, so if any real fishermen are out there, there's 148 left ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Zechman",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Not as advertised",
      "text": "Upon arrival this braid felt as thick as my 20 pound spider wire. I checked it and indeed both braids were eight thousandths of an inch. The kastking should have measured three thousands of an inch which would be the advertised.08 mm. This line also feels like a saw in my fingers. It is not smooth at all. I will not be using this line.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric R. Whitlow",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Good line!",
      "text": "I don't have years of experience with braid but I can say I have been catching channel cats all summer on this line. I like the hi vis yellow so that I can see it in the dark. The yellow eventually comes off and the line turns white. I would buy again. And to compare the 12lb to 30lb spiderwire....this brand doesn't fray as much through my sinker as the spiderwire does. I constantly have to cut 5ft off my spiderwire to keep it fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "dixon",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Waste of money and time.",
      "text": "I bought the 6lb yellow for my light rings and I'm not happy with it at all. Leaves a yellow residue on the real affecting the casting. Doesn't cast smooth at all nor far. No matter the weight of the lure it's not gonna cast far unless I stop and clean the residue off and still doesn't cast good at all. Wasted my money, now I'm stripping off 3 rigs and putting some good line on them. I will say its strong.",
      "rating": 2.0,
      "verified": true,
      "author": "RDAIV",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "This line is garbage!",
      "text": "I tried this braid even after reading some of the bad reviews. Dumb move! Bought the 10 pound in black and as you can see in the pic it trashed my pants and my gloves. I have never had braid do this in all the years that I have fished. On top of that in one trip it knotted up 4 times and had to be cut. Do not be like me! Spend 5 more bucks and get the good line. You've been warned!",
      "rating": 1.0,
      "verified": true,
      "author": "Maggie McGaugh",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Can't even knot it.",
      "text": "This is the most brittle line I have ever used. It broke four times just getting it on the reel. I'm not going to waste a hook on this garbage. Forget the fish, this stuff would rip on the weight of the worm.",
      "rating": 1.0,
      "verified": true,
      "author": "Radical Warren",
      "helpful_votes": 3,
      "publication_date": 20190226
    },
    {
      "title": "Weak line",
      "text": "Bought the 40 lb test in blue (Onyx package). The line would not hold a knot that i have been using on other braid without problems and snaps at only 12 pounds of drag. Ended up switching to a different knot. I lost several expensive lures and a huge striper at the ccc because of this. Tested it with a scale when I got back and low and bedhold it snaps well below the knot at only 12 lbs.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 5,
      "publication_date": 20180622
    },
    {
      "title": "Piscifun improved braided line (Blue) 15 lbs/20 lbs",
      "text": "I’m pleased with the two Piscifun Torrent bait casting reels and thought the braided line was a great deal as well. However, lining my spool I was disappointed to see the blue ink all over my fingers. Not to mention the 15 lbs and 20lbs test line I purchased broke twice while spooling. I’m concerned about losing fish do to the inferior tensile strength of these lines.",
      "rating": 1.0,
      "verified": true,
      "author": "Jad Jacob",
      "helpful_votes": 4,
      "publication_date": 20180727
    },
    {
      "title": "Nothing good about this line.",
      "text": "This line is horrible. The dye comes off on your fingers and hands. It casts horribly and reels even worse. The sticky dye is all over the inside of my reel. I'll have to detail and clean every reel I put it on.",
      "rating": 1.0,
      "verified": true,
      "author": "Dispatch Allstar",
      "helpful_votes": 4,
      "publication_date": 20180629
    },
    {
      "title": "Pretty good, surprisingly",
      "text": "I have used a lot of different lines and lately I’ve been on this “bargain line” kick trying to find great cheap line. There is some BAD line on amazon, and to be truthful I don’t really like piscifun products, but this line is pretty good. Strong, slick, thin diameter (but not so thin that it’s questionable), and fairly quiet through the guides. I use casting reels 99% of the time so I can’t really speak to spinning. It does have a little bit of a sharp or “square” feel to it, but that doesn’t really bother me. Over all, good braid.",
      "rating": 4.0,
      "verified": true,
      "author": "kenneth vogt",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "65lb yellow 500yds",
      "text": "Hooked an eight foot shark last night, fought it for 20min and the line held up wonderfully. 30 min later my buddy is fighting another eight footer. I'm severely impressed with this line the yellow is easy to see in low light, it hasn't faded yet and the line is very smooth. I'll be spooling the rest of my rods and so will the other guys from last night.",
      "rating": 5.0,
      "verified": true,
      "author": "Elliott M.",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Decent but color doesn't match pictures",
      "text": "The green in the picture is much darker than the actual line. The line itself is closer to a lime green. I went ahead and spooled it up just to give it a try and found that it is much more visible in inshore waters than my dark green braid lines. I've still caught fish on it though so maybe the color isn't as visible when it is underwater. The line itself is decent. I have two identical rod/reel combos and one has power pro and one with this, both same lb line and have found I cannot cast this line as far as the power pro using identical lures. It isn't significantly shorter but I do notice a difference.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason M.",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Spooling reel (challenge)",
      "text": "I like this line but getting it on your reel is a challenge in its self. The line doesn't come off the spool clock wise with lable up and so hard to even get the line off the spool keeps getting caught on spool and flipping over what a pain in the butt. Us fishermen like to spool our reels with little effort and you failed on this.",
      "rating": 2.0,
      "verified": true,
      "author": "todd emerick",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "One of the times where value, promise and quality meet",
      "text": "Fished with many good braids through decades, was skeptical about this brand, got it, took it down to Sebastian inlet here in FL, landed some snook and bull reds, WOW, what a pleasant surprise, knot ease and strength, abrasion resistance and ease with which it flies off the reel is outstanding, if you need a braid give it a try with Piscifun Onyx, excellent braid at excellent price, thank you Piscifun folks !!!",
      "rating": 5.0,
      "verified": true,
      "author": "PAUL",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Used for RV blind string",
      "text": "I actually purchased this to re-string the blinds in my RV which has chafed and broken. This was much cheaper than the specialty blind cord. It is much thinner but it hasn't been a problem. It has been holding up well the the blinds chafing on it and is a little smoother than the blind cord it replaced. So far I have restrung 3 of the large living room blinds about a month ago and had no issues. I recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Hunter",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Glad I went and made some cast before I went fishing!!!",
      "text": "I bought some of this line. After reading the reviews and thought I was getting some decent line, but I didn't. I have not seen any braided line cut so easy with a little pocket knife. So took it the the little school down the street put a 1oz weight on it and started casting, 10 cast in and snap. That's not good. I was thinking about getting 1 of Piscifun's spinning reel for my kayak, but I don't know now that I have used their braided line.",
      "rating": 1.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Bad Braid.",
      "text": "Bought a spool for my shimano. Started to spool the reel and noticed bumps ( almost like small windknots) in my line. Bumps made the line not sit right. Threw line out. Contacted PISIFUN and instead of offering to replace the bad line, they wanted to upsale me to LUNKERS line at a 30% discount. Crappy CS IMHO. Just buy better line like suffix 832 and call it a day.",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron Higgs",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great line",
      "text": "I have been using Onyx for just over a year. Only draw back is its hard to find locally under 15lb test. So when I saw it here, in the 10lb 300yd box, I jumped on it. (reel holds 300yds) Use mono for leaders, like any braided, and this stuff competes with other brands at 3X the price. Cast great. I fish big trout, (15-20lbs) steelhead, and salmon. Mostly from a boat, but shoreline too. 10lb with 8lb leader for trout/steelhead and 15-20lb with 15lb leader for salmon. Hope this helps",
      "rating": 5.0,
      "verified": true,
      "author": "Moobear",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Doesn't cast well at all",
      "text": "I like their lunker stuff, it's worked good for the money but I tossed this on one of my spinners and it really had alot of resistance casting. I just got the reel so unwanted to see which one it was causing the issue. Got some suffix superline and it casts like a dream sp the problem was the line. I'll buy the piscifun linker but not this stuff again",
      "rating": 3.0,
      "verified": true,
      "author": "casey",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Very Impressive line at great value!",
      "text": "I am very impressed with this line! It looks great, and feels great! It is especially easy to tie knots with. It's really thin, has zero memory and zero stretch so sensitivity is very high. I ordered the 12lb at 300yrds and had enough to completely fill two reels that each had over 200yrds capacity and still had plenty of line left on the spool. I got a snag when fishing at night and easily put over 12lbs of force when trying to pull it free. The line wouldn't snap so I ended up having cut it. So it's very strong as well. Overall, it is an excellent line for an excellent price!",
      "rating": 5.0,
      "verified": true,
      "author": "K.P.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "No good",
      "text": "I received this line on the 28th of June, it's now July 3rd, the line is white 50lb test I am running that as my mainline 2 0z no roll weights a bead a swivel and 30 lb mono leader with an 8/0 circle hook. So far every time I get a good size fish my mainline breaks when I get closer to the bank. This line is trash the next time it breaks (which I doubt will be long) im replacing it all.",
      "rating": 1.0,
      "verified": true,
      "author": "dj",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "not up to 80 ibs",
      "text": "got this for catfishing and i always test my lines , well says 80 lbs and i can break it at 34 lbs so think its not good line , I even bought 40 lbs while back and break it at 28 lbs sofar all have not been correct , best i get is the white line u get at a hardware store it goes way pass my scale ,. dont get for lbs .",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "the braid is good but seems to be a little rough and not ...",
      "text": "Hi Cathy, my name is Nic from California. You and I conversed through e-mail about a year ago when I purchased a reel that didn't quite work out for me. Perhaps you remember? Anyway, the braid is good but seems to be a little rough and not as tightly wound as some other braids out there I use and like. The 20lb braid you sent me a while back is great and I would have purchased that but Amazon was out of it at the time and I needed it quick so I went with the 25lb. Hope all is well with you and the company.",
      "rating": 3.0,
      "verified": true,
      "author": "Nic",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Plastic burs on the spool.",
      "text": "The line itself is great. However, the plastic spool has burs from where the plastic was molded. If you know braided line, you know that you dont want any fray/damage to the line. The burs had to be filed off before i spooled my reel. Not a major deal but im glad I noticed it prior.",
      "rating": 3.0,
      "verified": true,
      "author": "Franco",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "12lb held its own during the battle.",
      "text": "So far nice line especially for the price, I have put it on my wife's set up and mine. We catch a lot of bass, my wife just landed a 7lb large mouth and it got in the weeds locked up had to go get it, we freed it and the fight was on again, she landed it gave me her rod to get the fish and I happen to check her drag WELL it was way to tight set for 40lb and she was using 12lb and the line held up, I would have figured that tight definitely would have broke.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "6lb test is thicker then 10lb spectra",
      "text": "The colors are great but the line is very thick so I can’t put on as much line on the spool. In the photo the yellow line is 5lb spectra, the green moss line is 10lb spectra the orange line is 6lb. After fishing with it for a few weeks I replaced all the line with power pro spectra for smoother casting.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Wu",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Very good for the price.",
      "text": "I have only used it a short time but I am very satisfied with it so far. It casts well and does not seem to have a memory. I use a fluorocarbon leader and the knot is easy to tie and strong with no slippage like on some braids. Time will tell but so far I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "well made, will dye your fingers though",
      "text": "haven't had a problem with this yet, caught several bass on it. super light, minimal backlash, note that it will dye your fingers",
      "rating": 5.0,
      "verified": true,
      "author": "Greystoke",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "incorrectly marked line test lb",
      "text": "I bought this for a down rigger line to replace stainless cable due to vibration noise.. the outside package said 125lb but the line spool said 40lb test. so I returned it. didn't want to take the chance of it not being 125lb test line and lose my down rigger weight.",
      "rating": 1.0,
      "verified": true,
      "author": "blaze2200",
      "helpful_votes": 3,
      "publication_date": 20170814
    },
    {
      "title": "If you are using it to cast I suggest you get the 30 not to 50",
      "text": "I bought the 50 lb test I should have got the 30 the 50 is too big and it absorbs a lot of water and gets heavy which makes casting a little more difficult",
      "rating": 1.0,
      "verified": true,
      "author": "Steve T",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Great value",
      "text": "No complaints. Used 40 lbs. for catfish. I you have never used braid, you must tie the correct knot. It’s a Palomar knot.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike W.",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Not a true one piece line, they tied on second half of line",
      "text": "Beware! Not a true one piece line. About half way through the spool, the manufacture tied the other half of the line in a surgeons knot onto the first half of the line. So the line is not really a true one piece line. First time seeing something like this. Won’t buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Best Cheap Braid, I bought so far",
      "text": "Since COVID fishing gear has gone up in price and all of my favorite brands made no exceptions. This line has lasted longer than the my previous PowerPro line. Also this braid seems to cast out just a bit further as well, I assume there is weight difference. All in all, give the brand a shot, its cheap and does well.",
      "rating": 5.0,
      "verified": true,
      "author": "Willie J.",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Grate line..... but color won’t hold",
      "text": "I really was hopeful about the line had grate reviews and was a really good price. The line is grate and dose the job. My only complaint is the dye in the line. The photo of my real with the line is only after one, two day fishing trip and look how faded it is. Very disappointed from a company that boast about their quality in dyes for the lines.",
      "rating": 3.0,
      "verified": true,
      "author": "Mace ",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Dyed my fingers.",
      "text": "Pulled it out of the box and immediately the blue dye stained my fingers. Haven’t had other brands do this, so I’ll prob be sending it back. Line itself felt similar, looked similar, but the dye rubbing off is a let down.",
      "rating": 2.0,
      "verified": true,
      "author": "Josh W.",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Good but not great! Definitely worth the money",
      "text": "These are good, they fray a bit but nothing bad. Ive bought many of these and still use it. I can see the whit line with no issues and have caught many fish on multiple occasions on the same roll. Worth the money so cant go wrong",
      "rating": 5.0,
      "verified": true,
      "author": "EssenceOfArtistry",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "I'll never go back",
      "text": "Love braided line. Doesn't tangle, bird nest, or have kinks from bobbers. My only complaint is that the white braided gets brownish because you know.. it's white line. I'll have to see if I can clean it to make it look good again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Excellent price, very smooth casting and strong",
      "text": "Really like this line. Got the 25 lb green braided and can’t be any happier. Was concerned in regards it’s thickness but is thinner than my 10 lbs mono. Super smooth casting and very strong, was able to pull fish out of heavy algae and cover. And it’s way cheaper that the braided lines at the store. Absolutely recommended",
      "rating": 5.0,
      "verified": true,
      "author": "justin fair",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Decent value",
      "text": "The only issue I have is that the diameter is thicker than most other lines of the same labeled pound test. Durability is good as I’ve used this brand for a few years. It is softer than many other lines. I’ve used both the 4 and 8 strand.",
      "rating": 3.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Use instead of Fluro",
      "text": "I switched to the 10lb braid after seeing several top anglers use it on their Crappie rigs instead of Flurocarbon. This braid is super smooth and casts like a dream. I paired it with a Piscifun Flame 2000 spinning reel. Two great products at super prices!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert D.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "I have this braid and ordered more of their braided line and am happy with both",
      "text": "I haven't gotten to fish it yet but I've played with it enough to know that this is a braid that is going to do the job. Pascifun is quickly becoming a brand that I will take more seriously and use a lot more often. I have this braid and ordered more of their braided line and am happy with both. It has held up to the home made tests that I have put it through. The fly reel I purchased from them is very nice as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "\"Eh\" quality for rpice.",
      "text": "Well, I guess I'm stuck with these, The dye came off easily, all I did was pull it a little bit, put some pressure on it and the dyle come off on my hand, and fingers. Probably shouldn't have gone with black dye.",
      "rating": 2.0,
      "verified": true,
      "author": "UE",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Great price, line, and customer service!",
      "text": "The line is good, the price is great. Its a bit noisy through the guides but I love the sound of briad. The customer service is phenomenal! I received the wrong braid and figured I would get no response from the company due to the low cost of the product. Almost instantly they replaced the line with the correct product. Don't hesitate to order if your on the fence because the price if something goes wrong, the company will fix it in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "100lb test is the way to go!",
      "text": "Freaking awesome braid. I bought the 100lb test for bluecats and flatheads. accidentally cast my bait and float into a tree, I ended up taking down the entire limb. Great line for sure!!",
      "rating": 5.0,
      "verified": true,
      "author": "Erika & Jackson",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "8lb blue",
      "text": "Got this for my ultra lite rigs, seems smooth enough and limber BUT, my fingers are all blue where the die has came off on me just spooling two reels. Will have to see how it fishes I expect it will be fine but they need to fix the color bleeding...",
      "rating": 3.0,
      "verified": true,
      "author": "Walt",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Super Line",
      "text": "I ordered this line just to try, I've never used braided line before. I have to admit I'm not a big fan of colored line but this exceeded what I thought it was going to be. My order was delivered on time and there were no complications at all. I can't wait to put it to more testing. As of now I will definitely be ordering this again maybe in a stronger lb. test.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Sticky",
      "text": "This line is weird, sticky, gummy and bleeds yellow. I did not cast the line because it sticks to itself. Even when wet the line was not smooth. Paying out line with live bate was awful. Not worth using.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharkee",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Make sure you spool it right!!",
      "text": "Its pretty tough line, it kinda knotted at one part and i was able to rip it in half with my hands. Maybe because i didnt spool it properly on my spinning reel. But it looks so cool and i think ill get used to it.",
      "rating": 4.0,
      "verified": true,
      "author": "Noor Q.",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Bought it for flipping in heavy cover 65#",
      "text": "I wanted a heavy braid to flip into heavy cover for bass in Florida. I use this line in 65lb with a 50lb floro leader. The knot strength has been great so far, no problems at all. I also cast it a bit with a 10\" worm and the line cast very well. It is on my Shimano Calcutta, which I also use inshore fishing in the Indian River. I will update how the line holds up in my mixed salt and freshwater use.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Yanchula",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Good line for bait caster reels",
      "text": "I have loaded this line on all my bait cast reels . Great line for the money ! Will buy again !",
      "rating": 5.0,
      "verified": true,
      "author": "S. Brown",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Otherwise so far so good.",
      "text": "The reason I gave it 3 is because the color comes off. When i was loading the reel I use a wet towel to hold the line tight, the color came off on the wet towel. And when I used it this weekend I found the line color came off on my hands. I have black stained hands. Otherwise so far so good.",
      "rating": 3.0,
      "verified": true,
      "author": "RJC8760",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Geat line for deep sea trolling",
      "text": "Great line, at a good price. Held up to a 35 minute fight with a 10 lb plus Black Fin Tuna and so many Barracuda I lost count..That's right I didn't even need a steel leader to boat those toothy things. I would suggest that you offer some knot info on package though. I used a double uni knot that I learned on you tube. Only lost one fish at The Virgin Islands...guess it was a shark.",
      "rating": 4.0,
      "verified": true,
      "author": "Randall R.",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Works good so far",
      "text": "Works good so far, similar to power pro, has little white segments between color changes, filled up a penn 50 with it, have only caught a 40lbs wahoo on it, but it worked....I'll buy again, so cheap!",
      "rating": 4.0,
      "verified": true,
      "author": "Fullabull",
      "helpful_votes": 4,
      "publication_date": 20160727
    },
    {
      "title": "Not much better.",
      "text": "Where do I start. This line is so thin I could fish it on my ultralight rig. I’m blown away at the strength and thinness of this line. I have purchased many different brands for many prices and so far this has been the best for the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "WB",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "great line",
      "text": "just used this line in salt water for several days,,,it was worth every penny,,,put on PENN SPINNING REEL 8000,,,CASTS EXCELLENT, held up to everything,,,,,,fishing, Cape Cod Canal . many, many, rocks, no issues at all. you won't be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "flatten tar spot in the line",
      "text": "I was not happy with this spool. while putting line on the reel ,found a black tar spot on the line. It was a flat spot,so I cut off and though what was on the spool and started over. Sh?t happens I don't have to like it.",
      "rating": 1.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Good so far.",
      "text": "Works good so far. I only give 4 stars as the way they spoil it is very confusing. They send a large spool and it’s not full. Seems to have the yardage we ordered though.",
      "rating": 4.0,
      "verified": true,
      "author": "PC",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "One word- garbage",
      "text": "In a word, garbage. the line just snapped for no reason during casts! Seriously, you’d be better off using dental floss. This line is just, well, garbage. Tried to save some money now will have to spend even more to re- string my reels. Take my advice, spend the extra $5 and get quality.",
      "rating": 1.0,
      "verified": true,
      "author": "SMM 84",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Best braid I’ve used",
      "text": "I’ve really only used spider wire and power pro for braided line but this is the best casting line I’ve ever used time will see how well it last. I liked it so much I respooled all our poles with it looks like I’ll need to order more so I have some just in case I need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Pure garbage",
      "text": "This is literally the worst braided fishing line I have ever used in my life. I thought kastking line was bad this is way worse! it ruined 3 spools of line on 3 different reels.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Not good braid even for the price.",
      "text": "Worst braid I’ve ever used, it breaks down really easily, especially in cold weather. This braid also tangles which is something I’ve never experienced with braided line. It’s also coated with some sort of tar like substance that will get all over your reel and hands. It will catch fish tho, the only positive is it floats much better than others I’ve used. The cons far outweigh the pros.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Kiewel",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Great braided fishing line",
      "text": "I’m very happy with the quality of this line it cost about half the price of the line I have been buying for years. Good quality braided line already bought more to line some other reels with.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Hutchison",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "making knots with Piscifun",
      "text": "I have purchased this product several times to use on several of the rod& reels that I fish with. I am very please with how it performs. I have also let several of my friends use my set up to try this product with good results. Now they have switch over and are very happy. Keep up the good work.",
      "rating": 5.0,
      "verified": true,
      "author": "Len p.",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "If you like tangles, this is for you",
      "text": "Was excited to spool this up - got a rats nest after two casts - no biggie, cut it off - got two more over the next few casts. Not going to waste my time on this - ripped it off and put in the garbage",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Peterson",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great line",
      "text": "Love it! After switching to braided, I caught two bluefish in as many days! The second on my first cast! A 36\" blue! Tasty!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 6,
      "publication_date": 20160826
    },
    {
      "title": "New line to try",
      "text": "I first tried Piscifum braided line about a year ago. I had never heard of the line before, but now it is my favorite. The line has a small diameter, casts a long way with no wind knots, wide variety of colors, and cost effective. So far I have only used this line for fresh water fishing, but I now have confidence in this line, and I will also be using this line for salt water.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Coupe",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Good and Strong",
      "text": "Strong, hard to cut with scissors or nail clippers. I pulled up a skate (sting ray) with no problem,. My friend had 30lbs mono and they'd snap the line every time. I feel a little friction when I throw as it comes off my spin reel. Doesn't throw as far as mono.",
      "rating": 4.0,
      "verified": true,
      "author": "Hovva",
      "helpful_votes": 2,
      "publication_date": 20170605
    },
    {
      "title": "Awesome braid",
      "text": "Unspooled 20lb. power pro with 20lb. Of this stuff and was shocked at how much stronger this stuff was. Got snagged a few times bass fishing and literally pulled a big fallen tree limb to me and yanked another off the tree. Casts farther, reels smoother, and is stronger. Can't speak on fading but time will tell and also haven't noticed any memory at all and no wind knots. I will definitely be switching all my reels to this.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "We'll See",
      "text": "Hard to give a rating when I have not used this product yet. I will be using it in a few days so maybe I can do an upated review. So far the line feels very good.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheldon Boyd",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Maybe I got one from the bad batch.",
      "text": "Strong until it gets wet. It just rots. I've lost a lot of fish simply from line breakage. It's probably just bad luck, or a quality control issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Andre Reynolds",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Line looks good",
      "text": "Line looks good supposed to be as good as power pro, but the line was made in 03/08/2017 and I received it today 03/06/19. Bought this from Amazon because of the great price and there such a great group of people to buy from.",
      "rating": 2.0,
      "verified": true,
      "author": "DondiG",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Great line but I was sent the wrong color.",
      "text": "Seems to be great quality. Ordered 40lb in white but got multi color line in a box for white line. Not worth exchanging IMO. only reason for 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn Ebersole",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Nice stuff.",
      "text": "Great product. Definitely going to give braided line a try over monofilament. Who knows, this may solve my curled up line issue I seem to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Just1dude",
      "helpful_votes": 0,
      "publication_date": 20200325
    }
  ],
  "product_meta": {
    "title": "Piscifun Onyx Braided Fishing Line 6lb-150lb Superline Abrasion Resistant Braided Lines Super Strong High Performance PE Fishing Lines",
    "rating": 4.4,
    "feature_bullets": [
      "Superior Abrasion Resistance and Durable - Powered by new epoxy coatings technology and keep the braided lines far away from being damaged",
      "Strong Knot Strength - Unmatched strength fiber material / 4 Strands fishing line holds up tight allow you to easily tie a more solid knot; high abrasion resistance to avoid fish coming off",
      "Faster Cutting Water - Unparalleled smoothness and consistent roundness / backlashes free; to help the bait faster to reach the target water layer to catch the fish",
      "Highly Sensitivity and Minimal Stretch - Minimal stretch create the braided fishing line with highly sensitivity and extremely low memory / Small diameter to test LB ratio",
      "Precision Braiding and Fiber - 6lb-50lb is made with 4 high strength strands while the higher tensile strength of 65lb-150lb has 8 powerful strands for even more power / a smaller profile resulting in better casting and knot strength"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 29, 2015",
      "Manufacturer": "Piscifun",
      "ASIN": "B010LSTBWI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Fishing",
      "Fishing Line",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Hunting & Fishing",
      "Braided Line"
    ],
    "price": 10.99
  }
}