{
  "website_summaries": [
    {
      "verdict": "Hands down the best jig set Kreg has to offer. If you have small or large woodworking projects that require pocket-hole drilling, no other system will do.",
      "pros": [
        "Kreg's most comprehensive kit with ample tools, bits, and accessories for almost any project",
        "Woodworkers love the auto-adjust Automaxx clamp that offers tool-free operation",
        "Comes with 3 downloadable project plans to get those who are new to pocket-hole drilled projects started"
      ],
      "cons": [
        "It's a bit pricey – otherwise there are few complaints about this complete jig system"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Plastic!  But sturdy",
      "text": "Great engineering on this product. I've used it a few times and works great once you get the 5 minute crash course on how to set it up. My only complaint is the same complaint I have with all Kreg products. You're paying a fairly premium price for a tool that is made out of plastic. Of course it's dense plastic that may stand the test of time but for $160+ for something this small you'd think they could make it out of metal.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Anderson",
      "helpful_votes": 17,
      "publication_date": 20170331
    },
    {
      "title": "clamp didn't work at all.",
      "text": "The K5 is a great idea but the design has a few big problems. The ratcheting clamp is the biggest problem since the one I got didn't work right out of the box. It didn't hold at all and the ratchet track is very poorly made. It is just a stamped thin metal strip and if it did work I don't think to would last long. If Kreg would just make the clamp more durable I think it could be a great jig but for now I went back to the trusty K4.",
      "rating": 1.0,
      "verified": true,
      "author": "lily08",
      "helpful_votes": 8,
      "publication_date": 20180211
    },
    {
      "title": "First time user and glad I bought this kit!",
      "text": "I have never used a pocket hole jig before today. This kit is pricey but worth the money. It only took about 10 minutes to set everything up for a quick trial run. The instructions were clear and easy to follow. The materials are very high quality and the whole machine just has a good feel to it. I took a couple of scraps of 1x6, put them in the jig where they were securely held and within a few minutes had my holes in place. Selecting the proper screw was a breeze with the included chart/instructions. I can see myself looking for reasons to use pocket holes now just to use this tool. It's great! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl STop Contributor: Woodworking",
      "helpful_votes": 7,
      "publication_date": 20170314
    },
    {
      "title": "System works great. The instructions for the pocket hole clamp say ...",
      "text": "System works great. The instructions for the pocket hole clamp say to only allow 2 clicks when setting the clamp pressure (you'll understand what I mean when you read the instructions). Make sure you abide by that. If you go more than that, the clamp will pop loose. Staying with the 2 click setting, the clamp works great. Dust collection is very good too. Oh yeah, I accidentally moved the depth setting while using the pocket hole jig on my project and didn't notice until a couple of screws came thru the work surface. I must have done it when I was removing the vacuum hose. Be care of that.",
      "rating": 5.0,
      "verified": true,
      "author": "Accutech solutions",
      "helpful_votes": 3,
      "publication_date": 20180517
    },
    {
      "title": "I have been building my own furniture for more than ...",
      "text": "I have been building my own furniture for more than 20 years and have used all of the different methods of joinery. This is my first time using this kind and l am very impressed with the ease of use. My reason for only 4 stars is the plastic construction and would surely pay more for a more rugged material.",
      "rating": 4.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 9,
      "publication_date": 20160905
    },
    {
      "title": "Great product.",
      "text": "I had this on my Christmas wish list and my wife purchased it. It is one of the best presents I received. I have made 2 shop cabinets, free plans and material list are on Kreg's website. Setup was easy and fast. There are a lot of videos on line and the list of projects is almost endless. I highly recommend the automax clamps and the 90 degree clamp. They make building cabinets fool proof.",
      "rating": 5.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 2,
      "publication_date": 20190109
    },
    {
      "title": "Excellent and worth every penny",
      "text": "The K5MS is AWESOME. I am so glad I spent the extra money to get the K5. It is easy to set up, easy to use, and produces excellent pocket holes. I also bought the right-angle clamp and strongly recommend getting this if you are making right-angle joints. I mounted my jig to a 1ftx2ft piece of mdf board to provide a solid but mobile base. So far I have used it to build 5 new kitchen cabinets and face frames. I will never go back to building cabinets with glue and clamps.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "Easier to use and clean up after use",
      "text": "I've used a Kreg Jr. jig for many years, and am a big fan of pocket joinery. Finally upgraded to the K5, very happy to have done so. If ease of cleanup using the dust collection tube was the only benefit, it would be worth the investment. But the ease of use when making repetitive joints in a construction project is a remarkable time saver. I'm 6'3\" (~2m) tall, so drilling down from the top with the K5 is much easier on my back than clamping the board flat to a workbench and drilling from the side with the Jr.",
      "rating": 5.0,
      "verified": true,
      "author": "DennyMo",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Read directions to do it properly. After you do it once it becomes 2nd nature and is easy to use.",
      "text": "Love the K5 JIG. So long as you follow the instructions and dial in the Clamp pressure It works great ( thought I had busted it when I made the mistake of not adjusting it properly.) The vacuum port works GREAT! It's easy to adjust and use. It comes with a mobile base so you can go to the workpiece. Very satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jlwaters11",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "great",
      "text": "love this tool!! bought it to make my kitchen cabinets easier to build. and since then have made several different cabinets, remodeled my brothers kitchen, and am going to do the rest of my family's remodeling",
      "rating": 5.0,
      "verified": true,
      "author": "billlamson",
      "helpful_votes": 2,
      "publication_date": 20190327
    },
    {
      "title": "1st Time User - Works great!",
      "text": "This is my first time using a Kreg before. I read the instructions and watched a quick intro video. I was able to set it up and use it with no issues. I was a bit worried about having to set the depth collar and which screw to use, but the instructions and video made it super simple. I have been wanting to purchase this for several years. I do not know why I waited so long. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Grateful_Dad2",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Very good jig. Makes Strong joints",
      "text": "Love the jig. It works great. Makes strong joints. Easy to use. I substituted regular drywall screws for some projects. They worked fine. I bought a Kreg 4 unit at Lowes but returned it to buy this one. I am glad I made that decision. The quick clamp on this jig holds the wood very well. I mounted this unit to a 1\" x 12\" x 24\" piece of pine. Great jig to add to your wood working tools",
      "rating": 5.0,
      "verified": true,
      "author": "NY redneck",
      "helpful_votes": 2,
      "publication_date": 20180322
    },
    {
      "title": "Should have gotten the kit with the right angle clamp.",
      "text": "I love this tool and my biggest regret is not getting a bigger package when I purchased it. Would be five stars if would have had the right angle clamp included because it is a pain to finish a joint without a right angle clamp.",
      "rating": 4.0,
      "verified": true,
      "author": "Stupid People are Annoying",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Almost",
      "text": "Sure does have a lot of advantages of the old-style K3 jig. I like the big chunky handle and the slide mechanism to hold the piece and l the jig well drilling is much better. Only thing I would’ve given it five stars if the smart people over at Kreg would have been able to fit the vacuum adapter to the festtool vac. It takes away that I had to put a plumbing adapter and some duct tape on a brand new $150 plus drilling jig.",
      "rating": 3.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "Easy to set up and fun to use.",
      "text": "I just finished a 27 inch by 40 inch work bench in just one afternoon. Installed two tool drawers. Great product and easy to set up and use. Love the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron G",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Good for repetitive drilling",
      "text": "Works great on smaller thicknesses. I also bought the HD set so I can do 2\"x4\" and 4\"x4\" which I believe should be made out of thicker plastic. The clamping system should be heartier.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry  Hellman",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "but am glad I went with the k5",
      "text": "I originally was looking at just getting a pocket hole jr to start my endeavor into woodworking, but am glad I went with the k5, my only regret is that didn't take it a step further and get the bundle that included the right angle clamp as well. I do have a complaint about the vacuum port, it is pretty thin plastic and keeps popping off. I fear that over time the small clips that hold it in place will break and it will no longer stay in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamey R.",
      "helpful_votes": 2,
      "publication_date": 20170514
    },
    {
      "title": "Great overall",
      "text": "A bit disappointed once opened the box. A small piece of locker knob was somehow hit and damaged. But it does not affect the functionality. The clamp was kind of jammed_ the tiny metal knob head turns but i could close/lock the clamp in place. It remains open. Will find the way out with some tweak i am sure. Overall the product is great_ solid and nicely built.",
      "rating": 5.0,
      "verified": true,
      "author": "Chinlak y",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Not worth it",
      "text": "Very cheaply made product...the “vise” never holds well, the clamp is useless and the holes could have been drilled with a cheap pocket jig...save your money.",
      "rating": 2.0,
      "verified": true,
      "author": "Big Al",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Works for what I need or needed it for. ...",
      "text": "Works for what I need or needed it for. I would not use it to replace all of the basic woodworking joints. I used it in a couple of 3/4 inch plywood projects. It takes a bit of learning and sometimes a bit of thinking outside of the guidelines.",
      "rating": 4.0,
      "verified": true,
      "author": "Cal",
      "helpful_votes": 2,
      "publication_date": 20170724
    },
    {
      "title": "Great buy!",
      "text": "Love this thing. Even if you are a novice with woodworking, recommend highly to purchase this as part as the must have shop equipment. One word, it is flimsy, so be careful using it. I always feel like I am going to break the lever and I already made a small indentation when my drill went a little too deep - other than that, it is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Tate O'Brien",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Awesome tool",
      "text": "I bought this for myself and I love it! Kreg tools are well-made and probably one of the handiest tools I own. They also have some nice, free project ideas. Highly recommend Kreg tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerri Lewis",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Quick and easy set up for the right situation",
      "text": "Once set up, the K5 does a reliably consistent and convenient means of joining various wood projects. The joints are not as strong nor attractive as mortise and tenons, but a quick and easy method for the right situation. Be aware that when joining boards, the boards may shift during screwing so be sure to secure them with clamps.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel G Dadourian, M.D.",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Excellent product, easy to use and the end result ...",
      "text": "Excellent product, easy to use and the end result of construction is just top notch. My only suggestion is that unless you know you will be working with various thicknesses of lumber often, you can probably forego this package and just buy the kit without the assortment of screws. You can buy the screws you need from Lowes or Home Depot just as easily and only get what you need. Overall very satisfied as I use mine about 4-5 days per week.",
      "rating": 5.0,
      "verified": true,
      "author": "Randi",
      "helpful_votes": 2,
      "publication_date": 20170930
    },
    {
      "title": "Plastic vise broke.",
      "text": "This new plastic vise that they advertise to be “faster and stronger”. It’s just plastic!!! The first time you go to clamp something down with any force it breaks. Highly disappointed with the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Horner",
      "helpful_votes": 2,
      "publication_date": 20180301
    },
    {
      "title": "Comprehensive kit for starting out",
      "text": "Kit contains everything you need to start using pocket screws. I recommend this kit if you're starting from zero. Otherwise, if you already have Kreg components, it's overkill. You'd be better off acquiring additional components separately. If you're a first timer, kit is incredibly easy to use and instructions are simple and clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyberjoe",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "great product",
      "text": "This has opened a whole new world of projects for me. Now I can tackle projects that I couldn't do before. The jig works flawlessly and I can't think of anything negative about it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth92",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Perfect for projects where traditional joints are not feasible.",
      "text": "As advertised. Arrived quickly. Really nice set. GREAT starter system. I made a base to secure the jig and side boxes. Simple, strong and effective. I have used it for several projects that would have been difficult without the pocket hole jig.",
      "rating": 5.0,
      "verified": true,
      "author": "SeedyUU",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "great jig",
      "text": "This works great for pocket hole drilling and is easier to use than the K4 that I have used in the past. The new workpiece clamping system is much easier to adjust and works better with the lever on the same side of the workpiece that you are working on.",
      "rating": 5.0,
      "verified": true,
      "author": "Darren Kimura",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "great product. Made all the difference in building my ...",
      "text": "DOPE on a rope. Really plastic feeling because its all plastic, EXCEPT for the parts that matter, that are hardened steel and aluminum... great product. Made all the difference in building my bathroom shelving unit. LOOKS PRO when you are done.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Turner",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Fast and easy",
      "text": "This will up your game in your woodworking projects. Versatile and easy to use. Fast and strong joinery technique.",
      "rating": 5.0,
      "verified": true,
      "author": "Festive Media",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Great Quality Tool",
      "text": "My husband has been getting into wood working lately and asked for one. I think this tool is essential for a professional look. It allows you to hide the screws! He built my daughter a bed using it and we love it.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsKN",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Must Have",
      "text": "If you are into woodworking, or just beginning, you MUST get this. Hiding the fasteners makes your project look a 100x cleaner. The screw kit is great for keeping everything in one place.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Works great. Dust collection is very good and this kit ...",
      "text": "Works great. Dust collection is very good and this kit seens to be doing what i need it to do. No problems yet. Was a little pricey but i am happy with this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Brendan",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Pocket hole joints perfect for furniture building.",
      "text": "Really great tool. Had project that the pocket hole joints were the best solution. Work amazingly well very happy and am planning more projects using this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Frye",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Great buy!",
      "text": "This thing is awesome. Super convenient and quick. Pocket holes hold very well. I do some basic woodworking, building some benches and cabinets and boxes for jump ups/weight lifting. Should be able to venture further into finer woodworking with this!",
      "rating": 5.0,
      "verified": true,
      "author": "Dewman",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Must have",
      "text": "First time user, what a great time saver. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul F",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Better product",
      "text": "This is a nicer one than my husband got at Lowe’s",
      "rating": 5.0,
      "verified": true,
      "author": "Why",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Easily assists in joining wood!",
      "text": "A simple product to attach pieces of wood together. Worth the purchase and remember when first setting up the product to raise the drill in section. You'll drill the plastic structure below the drill in openings if unaware it needs to be initially raised on first use.",
      "rating": 5.0,
      "verified": true,
      "author": "AndrewBuyReview",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Don't wait! Pull the trigger.",
      "text": "This is a very handy tool for any small shop or garage. I have used my friends Porter Cable production pocket cutter but couldn't justify the price for my needs. The K5 has not disappointed. It's very simple to use and can easily be mounted anywhere. I would recommend this to any trim carpenter and DIYer. Definitely a plus if you have a dust collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Guitarpenter",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Highly recommend.",
      "text": "When used properly this is a great product. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bilbo Baggins",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Amazing upgrade from the Kreg Mini/K3",
      "text": "This is a game changer if you use pocket holes on a regular basis. Great tool that is very well made. I suggest making a wood base so the jig can be secured and easily moved around.",
      "rating": 5.0,
      "verified": true,
      "author": "MJW",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Pocket holes in all the things.",
      "text": "Huge improvement over the clamp-on version. Night and day difference. Super easy to use. Never read the instructions but I’m sure the quick depth setup blocks are cool too.",
      "rating": 5.0,
      "verified": true,
      "author": "Epicurus",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Quality, quick and accurate",
      "text": "Quick and accurate purchase. Kreg does it right with quality. Simply makes work easier.",
      "rating": 5.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great tool for DIYer's",
      "text": "Love Love Love....made outdoor patio set, side table, dining table, bookcase, coffee table. K5 is better than K4. Locking handle in front makes it easier to use.",
      "rating": 5.0,
      "verified": true,
      "author": "AbstrAct",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Works quite well.",
      "text": "Well designed. Works as advertised. Makes for tight joints. It's an easy joinery system.",
      "rating": 4.0,
      "verified": true,
      "author": "Ray Martin",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Excellent jig!",
      "text": "Excellent design which makes it simple to turn out perfect joints. Just finished using the jig with the left and right extensions to drill multiple holes in 5 ft. long shelves for installation in a large hutch. The Kreg jig made small work of the job and was a pleasure to use.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "great tool.",
      "text": "I bought this for my shop at work then bought one for y home use. youtube shows how good it is and I am building a table for a friend that calls for this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "bigronbo",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Good price",
      "text": "I use this product to build custom cabinets easy set up, easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Like the \"candle\"box title for the porch pirates",
      "text": "Received promptly as promised. Like the \"candle\"box title for the porch pirates. All kinds of play pretties to use in future building of my bookcases to be made. Haven't had time yet to use it . So glad to have it. I've been wanting one for over a year. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "EXCELLENT PRODUCT",
      "text": "IT WORKS GREAT I CAN USE THIS FOR ALL OF MY WOOD WORKING PROJECTS NO COMPLAINTS HERE",
      "rating": 5.0,
      "verified": true,
      "author": "TAMMY",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great tool Easy strong joints",
      "text": "A great starter kit! I've added a couple more vice-grips to complete it. Should have bought this a long time ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Halstead",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Great product",
      "text": "I have not used this item yet, but I have friends that have the same thing and have seen them use it and they all say they love it! I have even see. It used in university furniture making classes and the professors love it. I can’t wait to use mine. It came delivered on time and did not have any damage. It was packaged well.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Hibbs (NOLA)",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Perfect for a first timer",
      "text": "Built a small garden table with scrap wood one afternoon when I got a whim to do it.. was my first project with this after watching videos and I'm addicted.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazoned",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Fantastic product Wish I'd bought it sooner Rock solid joints ...",
      "text": "Fantastic product Wish I'd bought it sooner Rock solid joints without gluing, (however, I suggest a touch of glue at the edges of large panel glue-ups to hold the ends together",
      "rating": 5.0,
      "verified": true,
      "author": "jojo",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "This is my absolute favorite way to join two pieces of wood and have ...",
      "text": "This is my absolute favorite way to join two pieces of wood and have it look wonderful and seamless. Only thing is not sure how to join two mitered pieces of wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "I LIKE it !!!",
      "text": "Great system. I’ve put together stuff now that I used different methods for and it’s saved me a TON of time.",
      "rating": 5.0,
      "verified": true,
      "author": "John M. Klein",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Very versatile pocket hole jig",
      "text": "Excellent pocket hole jig and this setup is very versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "el conejo",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Five Stars",
      "text": "Really just started using this. I find it works well, small learning curve.",
      "rating": 5.0,
      "verified": true,
      "author": "George M. Cockerham",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Love how fast I can set up from one size ...",
      "text": "This is an upgrade for me from a much smaller pocket hole jig. Love how fast I can set up from one size to another and the vacuum attachment is amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Five Stars",
      "text": "I love my k5. Well made tool. Quick and easy to use. Makes a strong joint",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Works well, except you have to mike minor allowances ...",
      "text": "Works well, except you have to mike minor allowances for workpiece sizes. a \"3/4 inch\" piece of plywood is only 27/32\".",
      "rating": 4.0,
      "verified": true,
      "author": "JDC",
      "helpful_votes": 2,
      "publication_date": 20170313
    },
    {
      "title": "Five Stars",
      "text": "Great kit that works really well for knocking out numerous pocket holes quickly!",
      "rating": 5.0,
      "verified": true,
      "author": "MR429",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Good",
      "text": "It is easy to use does a great job I would buy it again and recommen. It to others",
      "rating": 5.0,
      "verified": true,
      "author": "John D ",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Awesome Tool!",
      "text": "I love this - one of the coolest tools I have used in a long time. I have used it to build a few farm tables so far - but the projects are limitless with this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Charley S",
      "helpful_votes": 2,
      "publication_date": 20160810
    },
    {
      "title": "Great tool. So glad I bought it",
      "text": "Other than the plastic hinge that broke on the case that holds the screws, this product is awesome. I am still figuring a few things out, but it is making projects easier.",
      "rating": 4.0,
      "verified": true,
      "author": "Journey Girl",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Setup is easy. Super strong joints",
      "text": "Like Building 20’ kitchen countertop using 5/4 hard maple Edge screwed. 20’ of banded wall shelves",
      "rating": 5.0,
      "verified": true,
      "author": "Brewster",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "These are game changers!",
      "text": "These are very nice and easy to use. Initially it took me a second, but once you’ve got it down projects go together quickly and look very professional. If I would have know. How nice these are, I would have bought them years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Shae Matthews",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Wonderful kit.",
      "text": "Love this. It work wonderful. Keep looking for more projects to do because of it!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni D",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Precision drilled pocket hole and tightness of joints are amazing.",
      "text": "The pocket screw jig and accessories are simple to use and they make joining cabinet components almost foolproof. I really love the precision drilling of the pocket holes and the tightness of the joints. I highly recommend this system.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Five Stars",
      "text": "This is a fantastic tool. All woodworking shops should have this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "excellent tool for an advanced or beginner wood worker",
      "text": "easy to use and comes with all of the accessories",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Perfect pocket holes",
      "text": "Works great. I've used the k5 and the k4 and the k5 is definitely worth the extra money.",
      "rating": 5.0,
      "verified": true,
      "author": "brandon",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "works for me",
      "text": "love it...have been using biscuit joiner this has given me greater success.",
      "rating": 5.0,
      "verified": true,
      "author": "Don russell",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Does exactly what it says it does",
      "text": "Been thinking about getting one of these for years. Finally got it and built a widow bar for my son. Worked perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Another great product from Kreg!",
      "text": "Another great product from Kreg! Looking forward to many hours of \"fun\" lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Schmidt",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "My husband and I love this system",
      "text": "My husband and I love this system. We just finished making a bags/corn hole game set of two tables with no visible screws. The system is awesome and easy to set up and use. The online videos also help.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri P",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Quick, easy, and fun to use",
      "text": "First time using pocket holes for projects and holy smokes, I love this jig. If you're not using the vacuum attachment, you're missing out. All-in-all, I am very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Delomba",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Clamp is JUNK",
      "text": "The wood clamp slips and will not secure the wood for drilling, complete junk. Go with the K4 NOT the k5",
      "rating": 1.0,
      "verified": true,
      "author": "Ken H.",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Five Stars",
      "text": "i wish i had bought it sooner. really makes solid construction with more simplicity.",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrie Orr",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Highly recommend",
      "text": "Great kit! Highly recommend. So easy to build things with this.",
      "rating": 5.0,
      "verified": true,
      "author": "gamer",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "It’s so simple to use and comes out perfect every time",
      "text": "I don’t know how I ever made diy projects before without this tool. It’s so simple to use and comes out perfect every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Pocket hole jig",
      "text": "The Kreg 5 jig is exactly that I ordered came just like the picture I have only used it a few times but works great",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce G.",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "I love the K5!",
      "text": "Worked great on the legs of the farmhouse desk I made.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah A. Frei",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "... this on a couple of projects but was very satisfied. I found it easier than the other Kreg ...",
      "text": "I have only used this on a couple of projects but was very satisfied.I found it easier than the other Kreg Jigs that i have used on other projects. Easier to set up",
      "rating": 5.0,
      "verified": true,
      "author": "Don Hinton",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Great product... easy to use!",
      "text": "Love this tool! As a beginner DYI'er, I gave it a shot and it was super easy to use. Now I'm making pocket holes for lots of projects! I would definitely recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "JWilson",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Great Time Saver",
      "text": "One of the best woodworking tools I've purchased in many years. Can't imagine how much work it has saved me!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Allen",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Clamp",
      "text": "Love the jig, but the clamp broke after 1 use on 3/4” wood. Not worth buying the set. Lots of reviews online automaxx not working.",
      "rating": 2.0,
      "verified": true,
      "author": "Hannah J.",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Awesome jig. A bit expensive but 100% worth it",
      "text": "Awesome jig. A bit expensive but 100% worth it. I use it quite often.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Marshall",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "This was such a great deal that I went with the K5",
      "text": "I had been reviewing this product, and couldn't decide between the K4 and the k5. This was such a great deal that I went with the K5. It is awesome! It works so much faster and easier than the biscuit joiner I had been using. Don't have to wait for glue to dry, things sitting around with clamp. You just measure the depth, screw..it's all right there on an easy to use chart. Hold very tight. I highly recommend this. I'm even going to get another one for my dad for Christmas. Just watching for another good sale.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie B",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "great jig",
      "text": "Works great but it does take some practice getting used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "sle",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Great product. Must have in your workshop if you ...",
      "text": "Great product. Must have in your workshop if you are doing woodwork",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin B.",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Unbelievable tool",
      "text": "So easy to use. I made the strongest cabinets I've ever seen and they look so professional. Nails would have never have held this well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "If it's defective kreg will take care of you.",
      "text": "First one I ordered was missing markings on drill guide. But I emailed kreg and they shipped me a new one in two days. Other then that it works great!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Excellent tool. Make sure you connect a vacuum hose",
      "text": "Excellent tool. Make sure you connect a vacuum hose. It works much better",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Kreg Jig K5",
      "text": "This works great fun to use. You can build thing so quick. I mounted mine to a work mate with the wood top (old one) made a real nice table saw output table so quick the strength is unbeatable. like 900 pounds of shear strength. Don't drop your special drill as I did the tip will break off for the pilot hole. The drill motor and drill hit the floor and put a stop to the job. I got two new drills the next day form Amazon. The local sellers were out of stock and the price was too high anyway. Love that Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark U.",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Great Starter Kit!",
      "text": "Have not used this yet, but I have used other before. They are great for just about everything. I have not made anything that this could not be used to make a stronger joint. Very easy to use! I must for DIYs and professionals.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Byron",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Excellent system that speeds up projects and is fun to ...",
      "text": "Everything i expected and more! Excellent system that speeds up projects and is fun to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "Awesome tool",
      "text": "Awesome system!! I've only used for a small project but can't wait to make this a go to tool is my shop!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexa S.",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "And I love it when things fall into place",
      "text": "It's not as much as the K5 giving me problems as much as me learning how to use them. I'm a nubee. And I love it when things fall into place. I will rerate it again later.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160727
    }
  ],
  "product_meta": {
    "title": "Kreg Jig K5 Master System with Pocket Hole Screw Kit (5-Sizes)",
    "description": "The Kreg Jig K5 Master System makes building wood projects easy by combining the most advanced Kreg Jig available with several great accessories. Those include a Portable Base, Wood Project Clamp with Automaxx, and step-by-step project plans. This special product bundle combines the Kreg Jig K5 Master System PLUS a Pocket-Hole Screw Project Kit that's filled with 675 Kreg Screws in five popular sizes, so you'll have a great supply of screws on hand for your first pocket-hole project.\n\nKreg Jig K5 Master System\n\nThe Kreg Jig K5 Master System combines the Kreg Jig K5 with premium accessories to make it even easier to get started building with Kreg Joinery. Accessories include a 3\" Wood Project Clamp with Automaxx auto-adjust technology, a Portable Base for building on the go, and downloadable plans for six great projects.\n\nThe clamp features auto-adjust technology that simplifies project construction by allowing you to clamp workpieces of varying thicknesses without ever having to adjust the clamp. That makes it the perfect companion to the ratcheting, tool-free workpiece clamp on the Kreg Jig K5. Adding the Portable Base gives you yet another use for your Kreg Jig K5 - simplified setup for portable building and making repairs. Plus, the Kreg K5 Master System includes step-by-step downloadable plans for six great home projects so that you can get started building.\n\nAdvanced Features:\n\nThe Kreg Jig K5 incorporates the best Kreg Jig features of previous pocket hole jigs, with innovative upgrades. That starts with a clamping mechanism that you can quickly adjust, without tools or adjusting nuts, to match your workpiece thickness. Just slide the clamp into place, “click” the large front-mounted clamp handle, and your jig is set to hold your workpiece tight every time.\n\nBundle Includes:\n\n * Kreg Jig K5 Master System\n * Kreg Pocket-Hole Screw Kit in 5 Sizes",
    "rating": 4.8,
    "feature_bullets": [
      "CLAMP: Ratcheting clamp mechanism and front-mounted handle",
      "STORAGE: Storage wings",
      "DUST: Swiveling dust collection port",
      "ADJUSTABLE: Adjustable work piece stop mounts",
      "BUNDLE INCLUDES: Pocket Hole Screw Kit (5-Sizes)"
    ],
    "specifications": {
      "Manufacturer": "Kreg",
      "Part Number": "K5MSSK03",
      "Item Weight": "12.12 pounds",
      "Product Dimensions": "12.3 x 11.9 x 8 inches",
      "Is Discontinued By Manufacturer": "No",
      "Style": "K5 Master System with Screw kit",
      "Material": "Plastic",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0192AQKPC",
      "Customer Reviews": "4.8 out of 5 stars288 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#33,378 in Tools & Home Improvement",
      "Date First Available": "December 7, 2015"
    },
    "categories": [
      "Power & Hand Tools",
      "Tools & Home Improvement",
      "Jig Accessories",
      "Power Tool Parts & Accessories"
    ],
    "price": 189.0
  }
}