{
  "website_summaries": [
    {
      "verdict": "Gorgeous woodwork plaque offers a sturdy background for this attractive and functional opener.",
      "pros": [
        "Can be screwed into the wall or magnetizes strongly to the refrigerator",
        "Bottle caps stick to the base after coming off the bottle",
        "Nice looking",
        "Good quality construction",
        "Opener works well"
      ],
      "cons": [
        "The opener is sometimes loosely screwed into the wood and needs to be tightened"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Strong, sturdy, and super convenient!",
      "text": "Great bottle opener- sticks right to the side of our garage fridge. Collects about 8 caps before we need to remove them. So convenient to grab a beer and pop it open even when my hands are full. This is much more well made, sturdy (strong magnets), and good looking than other openers!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Jones",
      "helpful_votes": 16,
      "publication_date": 20190325
    },
    {
      "title": "Works great, looks great, and fun too!",
      "text": "I bought this because we're always looking for a bottle opener. I wasn't sure the magnets would really hold tight while we opened our beer, but this ABSOLUTELY holds to our refrigerator AND the hidden magnet at the bottom of the wood has no problem at all grabbing the caps before they fall on the ground. So, now we always have a handy bottle opener, were not on our hands and knees looking for lost caps, AND the wood is really nice looking and slim, so it's not some big gaudy looking block stuck to your fridge. This is TOTALLY worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "JJandT",
      "helpful_votes": 23,
      "publication_date": 20170717
    },
    {
      "title": "Dad loves it!",
      "text": "This was part of my dad’s Xmas present. He absolutely loves. He’s told me several times how much he likes it. I think his favorite part is that is collects the caps. I looked at before wrapping and it was very nice quality. I’m sure this will withstand many years in the pool/game room.",
      "rating": 5.0,
      "verified": true,
      "author": "N",
      "helpful_votes": 16,
      "publication_date": 20190115
    },
    {
      "title": "Highly recommended high quality opener that we use almost every day.",
      "text": "Hi quality opener. We use it almost everyday. I bought it to cover the hole left in the wall when the telephone landline was removed. It took a while to get it to stay solidly in place because the opener and the hole are roughly the same size but after adding some Gorilla Glue it has remained in place for almost a year. We also tried using the included magnets to stick it to the side of our refrigerator and it worked great there too, although it did move around just a bit. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20191014
    },
    {
      "title": "I'm impressed",
      "text": "I'm impressed with the strength of the magnets. I expected to install this to a wall with screws, but the magnets are powerful enough to hold tight to the refrigerator door. It catches the caps without fail. Not only practical, but fun to show off as well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Barnett",
      "helpful_votes": 12,
      "publication_date": 20170909
    },
    {
      "title": "Looks great!  Works great!",
      "text": "So cool! Love how the cap is \"caught\" by the magnet! The wood was very nice and looked much more expensive than the cost. This was purchased for the refrigerator in the garage, but it is now on the side of the refrigerator in the kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Harmon",
      "helpful_votes": 8,
      "publication_date": 20180821
    },
    {
      "title": "Horrible product",
      "text": "It the worst broke first time using it had to fix it myself I do not recommend this product to anyone not worth your time or money do not buy this product waste of your money",
      "rating": 1.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 7,
      "publication_date": 20180531
    },
    {
      "title": "I thought the wood was going to be uniform and look like the picture",
      "text": "Fits securely on my refrigerator and catches bottle tops. I feel the quality control is lacking. I thought the wood was going to be uniform and look like the picture. Judging by pictures on here some people got good ones and some got one with sever discoloration. My wife says it doesn't bother her so I will keep it but I am unsatisfied with the discoloration. Maybe I am asking too much and being too picky but I believe the item should look like the picture.",
      "rating": 3.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 2,
      "publication_date": 20180511
    },
    {
      "title": "Five stars!",
      "text": "I have had one of these in my home for the last 15 years. When I move the new owner tends to want to keep it so I just buy another. It's well made. It's inexpensive. Mounted to a sturdy wall, it will remove the caps from your bottles of beverage. Needless to say it does what it is meant to do with ease. Great for parties as bottle openers always seem to disappear when there are lots of people drinking beer! I am really happy with the quality of my new bottle opener. Good delivery also.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Norton",
      "helpful_votes": 2,
      "publication_date": 20200622
    },
    {
      "title": "It does it job nothing to complain about so far",
      "text": "Idk how sturdy it’ll be but it’s definietly does it’s job. As a gift is boring but we bought it for ourselves because our friends had one but wooden and it looked cool",
      "rating": 5.0,
      "verified": true,
      "author": "joehoa",
      "helpful_votes": 2,
      "publication_date": 20200218
    },
    {
      "title": "Finished not finished",
      "text": "This bottle opener had great reviews so I decided to buy it. When I received the product it was poorly made. The wood is broken and it was not sanded down correctly nor was the finish on the wood done well. If I rub in fingers down the side of it it's pretty prickly. I'm sure I could get a splinter from it. I tried to ask for a new one instead of this one and the company was no help.",
      "rating": 1.0,
      "verified": true,
      "author": "JESCRUZ",
      "helpful_votes": 32,
      "publication_date": 20160802
    },
    {
      "title": "Great product, but it came scratched",
      "text": "I bought this for my husband and he absolutely loves it. It takes bottle caps off easily and catches each one with the strong magnet. The only downside is that the wood came already scratched in some places. I figured since it would get scratched anyways we would keep it. We were just disappointed that it didn't come in pristine condition.",
      "rating": 4.0,
      "verified": true,
      "author": "David and Megan Ash",
      "helpful_votes": 7,
      "publication_date": 20160425
    },
    {
      "title": "Two Stars",
      "text": "Magnet too weak. Pulls from surface every time it’s used to open a bottle.",
      "rating": 2.0,
      "verified": true,
      "author": "KidVictorious",
      "helpful_votes": 4,
      "publication_date": 20180424
    },
    {
      "title": "Excellent gift",
      "text": "I thought this was gonna be small, but it's actually a good size. I purchased this to give to my nephew as a thank you for hosting a family reunion dinner. I knew my nephew was going on to love it in his garage as he used to organize some beer parties with his friends there. Needless to say it was a huge hit. He and his friends loved this bottle opener. It is fantastic quality and hangs very well on the wall and it takes off caps with ease!",
      "rating": 5.0,
      "verified": true,
      "author": "Antony Gardner",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Yep.  Perfect.",
      "text": "If you’re looking for a solid, basic and good looking bottle opener this is for you. It’s not super big so it won’t hold a lot of bottle caps but I mean if you’re getting to a point where you have 6+ caps on there in one sitting you probably won’t care. 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Boyce",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "glad I bought it",
      "text": "I bought this Magnetic Bottle Opener for my husband and it's by far the best quality of the all the other ones I bought the previous year. It doesn't take up a lot of real estate wherever you put it and the woodwork is very well done. The magnet catches the cap 100% of the time and even the angle you have to tip the bottle into the opener is nice that you don't have to worry about spilling(which was an occasional issue we had one of the others). This year, the holiday kind of crept up on me but fortunately, the shipping was super quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Stainless steel model not so good",
      "text": "Just does not catch bottle caps every time. Mine drops caps after 3 or 4 have adhered.",
      "rating": 3.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "STRONG magnets",
      "text": "Grips to any metal extremely strong. Have it on my 'garage beverage fridge' and has not moved after many, many, many uses. The finish and wood are great. Looks first class.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul GD",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Will not open Bohemia beer bottles",
      "text": "Doesn’t work on all caps. Sticks to refrigerator door ok, but caps don’t stick. Hit or miss",
      "rating": 3.0,
      "verified": true,
      "author": "saspinner",
      "helpful_votes": 3,
      "publication_date": 20180813
    },
    {
      "title": "Great gift and works perfectly",
      "text": "Love this. We use it on the garage fridge and the magnet is super strong. The caps never fall, but stick right to the front as well. You won’t ever misplace your bottle opener :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Buy it! You won’t regret this purchase 🙌🏼",
      "text": "We have a drink refrigerator in our garage and this is awesome for entertaining & opening bottles! I thought about a wall attached one but this is so much easier since it has a super strong magnets and attaches directly to the fridge. Even my husband just told me he loves this purchase! We will order another for our kitchen as well as for gifts! I hardly ever leave reviews but this item deserves a stellar one! You truly will like this product a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "Nene23",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Buy this is cool",
      "text": "Love love love this!!!! Purchased as a gift but I had to try it! Easy to use and it sticks to the fridge. All the caps stick to the bottom. I will purchase again for myself!!",
      "rating": 5.0,
      "verified": true,
      "author": "Drama",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "For Fridge only; no wall mount!",
      "text": "Does not come with any type of wall mount, if you want it on your wall, you have to drill holes clear through it as there are no holes either. It is designed to stick onto the fridge. Before you buy, make sure you want it on your fridge! A lot of hassle to put it anywhere else.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20171018
    },
    {
      "title": "Quite Nice, Actually",
      "text": "Was not expecting a great deal, but quality is better than expected and actually is quite good. Sticks to refrigerator solidly with Magnets. Opens bottles without pulling off. Caps fall and are grabbed by magnet at bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Patrick O Neill",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Guys love it, and so do wives!!! Haha",
      "text": "This is an awesome beer bottle opener!! I bought this for my fiancé for Father's Day since he has been using a cheapy hand held one. I was also sick of seeing bottle caps lying all over the place. So needless to say this was a heaven sent lol for me,him and his buddies. It comes with screws to mount it if you choose however it has a super strong magnet on the back so strong it takes some arm strength to wiggle it off, so we just attached it to the fridge. And the magnet to catch the bottle caps can hold so many. Disclaimer: I did not receive this at a discounted price, I purchased on my own.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "Functional and fun",
      "text": "This is a super strong magnet. I was amazed at how well it sticks to the fridge. It’s also a fun parlor trick for guests to show them how the caps get caught on the magnet as soon as you open the beer bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "RainierRandy",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Man Fridge",
      "text": "My husband loves this for his man fridge in the garage. Magnet works great and doesn't slip when opening bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Cheap quality",
      "text": "Bought this as a gift and I’m going to return it. It looks cheap, the wood is chipped, there’s glue on the back, and there aren’t any holes for mounting",
      "rating": 2.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 2,
      "publication_date": 20180923
    },
    {
      "title": "powerful magnet",
      "text": "I have this at the lake house on the side of the refridgerator. It grabs the bottle top fast and is always visible without people looking through the drawers for a bottle opener.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue cova",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "The best present",
      "text": "I got this beer opener from one of my friends for my birthday and at first I didn't think I would use it because I had a regular beer opener.But now I see how much better it is than my old one! Firstly, it's much easier to open beer with my new beer opener.Secondly, it can stick to any metal surface as it has a magnet on it, which is very convenient, and thirdly, it's extremely stylish!",
      "rating": 5.0,
      "verified": true,
      "author": "Samir",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great bottle opener",
      "text": "Adheres to the fridge very well and holds SO MANY bottle caps. I’ve counted up to 25 at one point.",
      "rating": 5.0,
      "verified": true,
      "author": "Rexana",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Broken!",
      "text": "Looked great except for the broken wood on the top and how dirty it was like it was used. Sent it back for replacement.. what is up with their quality control? Hoping I get a better one next time around.. fingers crossed.",
      "rating": 2.0,
      "verified": true,
      "author": "Lola",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Just what we wanted",
      "text": "So far so good, just recently mounted it so we have not fully tested how many caps it can actually hold at once but it works exactly as we hoped. Based on the magnet strength I do not think we will have problems with it but I will update my review if we discover any down the road. So far we are very pleased and giving this 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "KMC",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Easy and quick",
      "text": "The beer opener is so great because it's easy to find a surface to put in on. I usually put it on the fridge as it's the mos t convenient place: you take cold beer from the fridge, and immediately open it with this beer opener. And it also looks extremely stylish! Perfect for the interior in my house. I'm glad I bought it! Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Damian ",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Its good for opening bottles also",
      "text": "At first I was skeptical about the strength of the magnet that was claimed in the description. But to my surprise it is very strong. My husband fixed it on our fridge to see if it slips or something. and then it was too hard for him to get it out of there. Its good for opening bottles also.",
      "rating": 5.0,
      "verified": true,
      "author": "Vibs",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "It's also a cool party trick for some intoxicated folks",
      "text": "It works very well and as described. It'll catch all your beer caps so you don't have to. It's also a cool party trick for some intoxicated folks. Only downside is it shows how many beers you've drank by the caps left on it!",
      "rating": 5.0,
      "verified": true,
      "author": "Veenks",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Exactly what I was looking for",
      "text": "The opener looks fantastic in person - the photo doesn't do it justice. The magnets are plenty strong to hold it firmly on the fridge and to catch many bottlecaps. One feature I particularly like is that there are rubber pads placed on the back the opener which prevent it from sliding around during use and also prevent scratching of the fridge. Finally, the price is a lot less than many of the other openers listed on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumer",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Excellent Product, this is my second purchase (for the ...",
      "text": "Excellent Product, this is my second purchase (for the beach house), I will start giving these as presents, works perfectly in the refrigerator's door, no need for tools or installation, opening bottles is a hands -off experience.",
      "rating": 5.0,
      "verified": true,
      "author": "aimbuy",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Awesome!",
      "text": "This is perfect for outdoor bar. Cool that the caps stay in place and surprises people. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Strong magnet!",
      "text": "We stuck this thing on a frig and the bottle caps cling to it no problem. No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "B.W.",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Love it.",
      "text": "This is the second opener we have purchased. Got the first one for our son-in-law for the boathouse. He loved it so much we got him the second one for his BBQ area. They work great and hold several days worth of caps. Guests are always fascinated with them.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "this is awesome! and you don't have to worry about it ...",
      "text": "this is awesome! and you don't have to worry about it coming off the frig at all because the magnet is crazy strong, it took two hand for me to get it off frig and it really does catch the lids, quickly too. This would be a great gift idea for that beer drinker in your life. i can think of a couple people in my lift who love this as a gift. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "KIM ARCHAMBEAULT",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Neat gift",
      "text": "I have not seen how many it total beer bottle caps it can catch. But it does catch them",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Cool but hard to open bottles",
      "text": "I find it's difficult to actually open the bottle. I have to really shove the bottle top up there and it usually takes me 2-3 tries. Love the magnet that catches the caps. And it sticks to the fridge super strong. Not sure I could get it off if I tried.",
      "rating": 4.0,
      "verified": true,
      "author": "C. M. Borgia",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Another game I like to play is to see how many bottle caps ...",
      "text": "This thing has up'd my BAC permanently! I can't come home from a day at the Salt Mine without cracking open at least 6 cold ones becuase its a blast to use this thing. I turn my nose up at the peasants who drink out of beer cans because they can't use this opener. Bottles only at this club! Another game I like to play is to see how many bottle caps I can keep on the magnet before they all fall off and scatter on the floor. Great fun. 5/5.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Solid!",
      "text": "This is solid yet slim strong magnets to attach to grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher L Johnson",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Handsome and functional.",
      "text": "Very strong magnet keeps openervin place and catches bottle caps. Nice product, husband loves it. The design of the stripes is also pleasuring.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Great Opener",
      "text": "Love this opener. It sticks on any metal surface or can be mounted on wood surface. Catches the bottle caps with a magnet behind the wood under the opener (really cool).",
      "rating": 5.0,
      "verified": true,
      "author": "jdb",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Fantastic!",
      "text": "I loved it so much I bought another! Looks nice, seems sturdy, and works as promised (which is super cool btw). Makes a great gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Crazy busy Mom of 6",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "AWESOME PRODUCT, but picture inaccurate",
      "text": "I got this as a gift but the wood I received is much much lighter than the one in the listing. Also, half the item doesn't look like it is as finished as the other side because it is pretty rough. Still, an awesome product!",
      "rating": 4.0,
      "verified": true,
      "author": "yS",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Great excuse to open a beer !!!!",
      "text": "Not sure what’s not to like !!! Placed it on the mini fridge outside at the bar and of course had to test it.......super strong and caught the cap like a super hero lol !!!! Will be buying these as gifts for sure !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey DiMario",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Great solution for the beer fridge!",
      "text": "Neat design and works just as advertised. It even has a magnet on it for mounting which I didn't realize when I purchased it. Just stuck it to the side of the fridge and popped the top. Cap stuck to the bottom just like it was supposed to.",
      "rating": 5.0,
      "verified": true,
      "author": "JFedders",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Really nice and simple",
      "text": "The best part is the magnetic cap catch. I think our record is 6.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidster",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Love it!",
      "text": "Amazing! Strong magnet, catches tops. Bought another as a gift",
      "rating": 5.0,
      "verified": true,
      "author": "TPBMM",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "I love it! Great magnet 🧲",
      "text": "Easy to install and we used it every day. My husband loved this gift",
      "rating": 5.0,
      "verified": true,
      "author": "María Laura Ameijeiras",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "So cool",
      "text": "This bottle opener is so cool! The magnet is super strong and really does catch all the bottle caps. I get so many compliments on my bottle opener.",
      "rating": 5.0,
      "verified": true,
      "author": "Katharine McQueen",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Beautifully made and appears to be a durable",
      "text": "Purchased as a gift. Beautifully made and appears to be a durable, quality piece.",
      "rating": 5.0,
      "verified": true,
      "author": "amyenergy",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Receiver of this gift was amazed.  He loved it.",
      "text": "I liked the product as well. Good rubber above the magnet in the back to hug the refrigerator without fear of scratching the frig. The bottle top snap to the lower magnets. Fun and good conversation piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Zawzer",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Amazing product!",
      "text": "Actually as pictured...very strong magnet. Our patio door is metal and this works perfectly and also captures a bunch of caps.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindi",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Awesome magnetic opener",
      "text": "This thing is sweet. Amazingly strong magnets easily holds onto my fridge door and catches the caps at the bottom when I open a beer. Well made product highly recommended if you drink a lot of bottled beverages requiring an opener.",
      "rating": 5.0,
      "verified": true,
      "author": "bigstanklo",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "The envy of my friends!",
      "text": "This bottle opener has proven to be both stylish and functional. I mounted it to the wall, using the equipment provided, and it works like a charm. On the downside, it's caused my friends and I to drink more beers :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Kristyn P.",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "How Did I Live Without This",
      "text": "6 bottle caps stuck to it and still effective. Very strong magnet, keep your Rolex away when you're taking down a case of Pacificos. Magnet is very strong and the whole unit is extremely sturdy and feels well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Blake M",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Exactly as advertised and a great product",
      "text": "I have only managed to pop this guy off the fridge once but it has been awesome otherwise! The magnets are strong and it looks very nice! I definitely recommend this as a gift or for yourself obviously!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Sweeney",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "... the opener with one I had but it works great collecting caps and so far has held up well ...",
      "text": "I replaced the opener with one I had but it works great collecting caps and so far has held up well outside.",
      "rating": 5.0,
      "verified": true,
      "author": "aruba1018",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Nice quality but I thought it would stick to the ...",
      "text": "Nice quality but I thought it would stick to the wall because we are in Florida and have metal studs. Does really have a hook on the back, just two tiny holes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kandi S.",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Would recommend",
      "text": "Works like a charm. My husband loves it! Magnetic hold is strong enough to not get detached while opening the bottle. Good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Irina",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "One of the cooler knick knacks I've put up in ...",
      "text": "One of the cooler knick knacks I've put up in our house. The magnet is very strong, and I haven't seen a bottlecap escape it yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Bartell",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Second Purchase",
      "text": "My roommate put this up on the fridge in the kitchen and I use it all the time. It doesn't shift around when you try to open and it catches the caps 99% of the time if you clean off the magnetic portion regularly (don't let too many build up! You have to throw them away eventually!) This purchase was actually for my father for his birthday. The quality is high, the price is fair, so I thought of this to be his gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Doeboy",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "I ordered 2, one to keep and one to ...",
      "text": "I ordered 2, one to keep and one to give in a White Elephant gift exchange. When the family was over a couple weeks ago I had many complements on the ease of use, and how sharp it looked.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Leckron",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Superb",
      "text": "Just what I expected. I can attach to my toolbox and open a bottle of beer without moving it and the cap stays magnetized to the wood. I was going to make one myself but for this price it's perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Easy to use",
      "text": "I love that it is both indoor and outdoor use, so we can always take it with us when we go to a picnic. And it is much easier to use this beer opener than the regular one. I wish I bought it earlier!",
      "rating": 5.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Poor finish",
      "text": "The finish on this item was very poor. There are sanding or scratch marks on the wood which show through. A little better sanding job would have been time well spent. I mounted this item in a place not readily visible. The opener works good but is not something to show off.",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas W Robinson",
      "helpful_votes": 3,
      "publication_date": 20160527
    },
    {
      "title": "Bought this for my hubby, he loves it! ...",
      "text": "Bought this for my hubby, he loves it! Has a strong magnet so it attaches securely to the front of our small beverage fridge, and the bottlecaps stick right on the base after popping off the bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi V.",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Beautiful and functional",
      "text": "This bottle opener is as beautiful as it is functional. It sits on the door to be outside beer fridge, so it is always ready. It looks great and always catches the caps.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Wise",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "A great item for a gift and to use as well",
      "text": "A great item for a gift and to use as well. Works perfectly on my garage refridg. I am giving one as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Jat",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Perfect housewarming gift",
      "text": "The perfect house warming gift. High quality. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie C.",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "It works great and catches all caps that are popped off",
      "text": "It came with extra screws that are long for wall attachment, which is what we wanted it for. It works great and catches all caps that are popped off. We tried it in the fridge just to see how strong it is... wow! Awesome product and very versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "Mich Je",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "I'm buying more",
      "text": "Everyone loves the opener and the catch of the lid as it drops. Looks like I'm buying a few more. Strong magnet holds it firm on the fridge door.",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "I am completely satisfied with this product",
      "text": "I am completely satisfied with this product. The magnet is powerful enough to keep it attached to the fridge while opening bottles, and the caps stick to the magnet below the opener.",
      "rating": 5.0,
      "verified": true,
      "author": "Raj Patel",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Great product",
      "text": "This is great. I got one for my son when he moved out on his own because he kept threatening to take mine. It’s very nice and heavy duty. Sticks to fridge very tight never moves.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie P.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Amazing. Magnets catch caps out of the air",
      "text": "Amazing. Magnets catch caps out of the air. Great present for those hard to buy people. We love it ! If I could give 10 stars I would.",
      "rating": 5.0,
      "verified": true,
      "author": "Cbzab",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Surprised at how strong the magnets are! this is ...",
      "text": "Surprised at how strong the magnets are! this is just what I needed in my garage. I convinced the wife to get another for inside the house as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Gwg",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Five Stars",
      "text": "Son-in-law loves it - helps him keep track of how much he's drinking!",
      "rating": 5.0,
      "verified": true,
      "author": "Abbie",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Was a perfect gift for my beer connoisseur husband",
      "text": "Was a perfect gift for my beer connoisseur husband! The magnets are super strong (the back and the front both)! You have to empty it out every once in a while since it can't hold more than probably 15 or 20 caps at a time without making it too hard to use the opener part, but it looks great in our basement!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Dude gift",
      "text": "Perfect for man cave, dorm room, or bachelor pad. Super strong magnet catches bottle tops",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Fun product to use, good conversation piece.",
      "text": "Terrific addition to my cooler stand. Works as advertised. Catches those caps flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "John Daley",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Awesome gift at a great price",
      "text": "Bought this for my brother as a little house warming gift. It became the talk of the night! The magnet allowed it to be hung on the fridge stronger then some walls would hold a nail. (Which was great for his rented apartment!) Everyone wants one. Will be purchasing several more for Father's Day and birthdays.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa M. Saia",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Holds great to outside",
      "text": "I have this outside under our carport mounted to the wall. Gets everybody's attention when the bottle caps catch to the wood. The magnets hidden. I want to buy more for gifts for my buddy's. Holds great to outside. A must for your party area.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "No issues",
      "text": "Great looking product. I bought 2 bottle openers. One for kitchen and the second one for garage. This thing is of great help!",
      "rating": 5.0,
      "verified": true,
      "author": "Amos",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "But your own screws",
      "text": "Great looking product. It feel apart on first use because screws were not set tightly. I had to buy a larger size screw and really tighten them. Now it works as expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve Fondow",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Five Stars",
      "text": "Item was exactly as described - completely happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "mphumli",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Happy husband!",
      "text": "My husband loves this! Very strong magnets and looks cool too.",
      "rating": 5.0,
      "verified": true,
      "author": "Cylee",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Great gift for a beer man!",
      "text": "Very heavy!I purchased it for my dad as a Father's Day gift. Very unique!Super durable and will add a nice touch in dad's in home bar room! Fun away to open the beer.",
      "rating": 5.0,
      "verified": true,
      "author": "Doria Faris",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "A gem of a bottle opener",
      "text": "The magnet was strong enough to securely stay anchored to the door of my garage fridge. No need to use the included screwes to fix it to a wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Ybarra",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Very solid",
      "text": "My husband loves the beer bottle opener magnet. It is classy designed and feels high-quality and works great! What else can I add? Satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sira Papazoglu",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Actually what i wanted",
      "text": "I can't believe how well this works for thi price. Super strong magnet catches all the lids! Would highly recommend getting for your beer frig!",
      "rating": 5.0,
      "verified": true,
      "author": "Mitchell L.",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "I bought this for my boyfriend and he loves it ...",
      "text": "I bought this for my boyfriend and he loves it. The magents are very strong and you can put it on your fridge or attach it to the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Husband loved this Christmas present!",
      "text": "Decided to buy this after researching several different ones for my husband as a Christmas present! It was a big hit!!! The magnet is very strong, so it attaches to the frig and does not move. The bottle catcher is a conversation piece. My husband said it was the best gift. He wants to buy one for everyone in the family next Christmas. Great quality, delivered as promised. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "J. T.",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Amazing product",
      "text": "Wife bought for her parents bar area. Honestly, they love it. It works great. Surprisingly strong. I would recommend. Thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Pierce",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great Quality",
      "text": "Bought this for my husband and he loves it! He stuck it to the side of his beer fridge and the magnets hold it in place perfectly. We both love that it catches the bottle caps for you too.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Lange",
      "helpful_votes": 0,
      "publication_date": 20190107
    }
  ],
  "product_meta": {
    "title": "Bruntmor, CAPMAGS Strong Magnetic w/Zinc Alloy Beer Opener & Cap Catcher - Metal Magnetic (Merbau Wood)",
    "rating": 4.8,
    "feature_bullets": [
      "A UNIQUE GIFT - This winter surprise your family and friends with this wall mounted bottle opener, it’s a fantastic gift for any special event. It’s the kind of gift you should give on any special occasion.",
      "FOR INDOOR & OUTDOOR USE - The Bruntmor is a rustproof magnetic stick-on bottle opener perfect for outdoor or indoor use. Mount it in your man cave, patio, kitchen, or bar. Its attractive wood and metal design complement any setting.",
      "READY FOR QUICK USE – With sturdy magnetic mounting on a fridge or any metal surface. Fix it with screws to any wall. The magnets are so powerful that it doesn't slides, fall or move from the mounting surface when you apply force. You don't know you need a magnetic wall mount bottle opener until you have one!",
      "NO MESS & DURABLE – No more concerns about collecting the caps from the floor. It is a user-friendly design with AUTO CAPS COLLECTION with a magnetic cap catcher. Locks up to 50 beer caps! No spilling when using this bottle opener, even when using one hand. Just pop off the top and enjoy!",
      "FINE FINISH - STAINLESS STEEL finishing improves the looks of any setting. The smooth design supplements style to a kitchen fridge, man cave, patio, restaurant, or bar. It's a must-have for any party zone."
    ],
    "specifications": {
      "Product Dimensions": "8 x 1 x 3.2 inches",
      "Item Weight": "14.4 ounces",
      "Manufacturer": "Bruntmor",
      "ASIN": "B0191YVYHS",
      "Item model number": "BRBORW",
      "Customer Reviews": "4.8 out of 5 stars569 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#17,987 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 7, 2015"
    },
    "categories": [
      "Bottle Openers",
      "Corkscrews & Openers",
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Kitchen & Dining",
      "Bar & Wine Tools"
    ],
    "price": 20.95
  }
}