{
  "website_summaries": [
    {
      "verdict": "A super-sticky lint roller that picks up pet hair easily and completely.",
      "pros": [
        "This combo pack includes 1 lint roller and 2 refills for a total of 180 sheets",
        "Each sheet is extra sticky and picks up pet hair with a single pass",
        "Includes an ergonomic handle for easy rolling"
      ],
      "cons": [
        "The sheets are so sticky they can sometimes stick to each other"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Gets the job done... Better, Faster, with less sheets.",
      "text": "Fact: Extra sticky... Finally a product that my dog hair can stick to more... than my clothes! I've tried other brands but what I like about this one is that is actually does the job, and does it better. With these lint rollers it takes less sheets than other brands. I have an Australian Shepherd, so anyone who knows about this dog breed... well, they know that shedding is second nature to them. I love this product and will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven G.",
      "helpful_votes": 21,
      "publication_date": 20180119
    },
    {
      "title": "works well if you can keep the roller on the handle",
      "text": "These \"lint\" rollers are much better at picking up cat hair than the typical lint roller. I have two cats, so these rollers get a LOT of use. The only problem with it is that the roller keeps falling off the handle. I see other people have made this comment. I think it's a design flaw that the manufacturer needs to address",
      "rating": 4.0,
      "verified": true,
      "author": "NVML",
      "helpful_votes": 20,
      "publication_date": 20180119
    },
    {
      "title": "unless you like using multiple sheets to remove all the cat hair ...",
      "text": "Don't even bother buying anything you see in the stores, unless you like using multiple sheets to remove all the cat hair on a small section of couch or chair. These bad boys do the trick. Hell, I even had a hard time getting the outer vinyl cover off because the tape is so strong. I've tried them all folks, this is the real deal. If you have dog or cat hair on your upholstery, don't waste your money buying something else, these are worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom in KY",
      "helpful_votes": 13,
      "publication_date": 20180429
    },
    {
      "title": "STICKY but...",
      "text": "These sheets are VERY sticky and every time I use a new roll I pull off at least one sheet with the wrapping, which is annoying. They are great at pulling up mass amounts of hair at a time but lack the ability to pick up straggler hairs regardless of if its a new sheet or not. These 1-2 hairs here and there may not be a big deal for most people but I like to wear black and own a gsd/husky mix who only sheds snow white hair... not cute. In my opinion, the regular Evercare Extra Sticky's work better at pulling up every last hair and I tend to use less sheets.",
      "rating": 4.0,
      "verified": true,
      "author": "Jillian R.",
      "helpful_votes": 8,
      "publication_date": 20190227
    },
    {
      "title": "The product worked great in terms of stickiness and ability to remove hair",
      "text": "The product worked great in terms of stickiness and ability to remove hair. However, as many people have mentioned, when using the roller the sticky roll detaches from handle quite easily which can be slightly frustrating when trying to remove large amounts of hair quickly. But overall the product worked great so 4 stars from me.",
      "rating": 4.0,
      "verified": true,
      "author": "Max McKendry",
      "helpful_votes": 8,
      "publication_date": 20180129
    },
    {
      "title": "Not the same item pictured.",
      "text": "I’m not sure if this is supposed to be better than the item that is pictured or worse than the item that is pictured but it is not the same size or label as the item that I purchased.",
      "rating": 3.0,
      "verified": true,
      "author": "Breezy B",
      "helpful_votes": 6,
      "publication_date": 20171129
    },
    {
      "title": "the producut is actually too sticky. I could not ...",
      "text": "the producut is actually too sticky. I could not get the label off without tearing into 2 unused sheets. Also each time I attempt to change the used sheet I again end up pulling a couple of unused along with the used sheet. I ended up wasting the product by having to toss unused product. The roll does not stay on the handle.",
      "rating": 2.0,
      "verified": true,
      "author": "Darcy",
      "helpful_votes": 6,
      "publication_date": 20170105
    },
    {
      "title": "I've had lint rollers before and they were much better than these",
      "text": "Don't know if the rollers are old or what the problem is, but not one sheet has torn off completely. They split and you have to peal it off in pieces. Not very sticky. Have to peel off a layer all the time. I've had lint rollers before and they were much better than these. I waited to write a review thinking maybe one of the rolls would be good, but they are all the same. Will never buy from this company again.",
      "rating": 1.0,
      "verified": true,
      "author": "Dianne",
      "helpful_votes": 7,
      "publication_date": 20180105
    },
    {
      "title": "Not as pictured",
      "text": "I did not receive the green lint roller as pictured. Instead I received a cheap black handle with rollers that immediately fall off the handle. Item does not work.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20170917
    },
    {
      "title": "It takes the hair and lint you don’t want on you OFF.",
      "text": "First off extremely sticky. I have a German shepherd and a new chihuahua that we got on Xmas.. and the Dog hair to put it nicely is “difficult” to deal with. Saw this on amazon, bought it cause the regular s*** from Walmart just doesn’t Work. I’m barley on roll two cause it’s a three pack and I love it. I have to wear a uniform to work that is all black, so I cant have any hair on me. these animals Are inside dogs so I use it pretty often. 6 star",
      "rating": 5.0,
      "verified": true,
      "author": "Izaiah",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Waste of money",
      "text": "I was really looking forward to a super lint remover for my white Pomeranian that really sheds. That was NOT this product!!! Now I have 3 rolls of this stuff that is worth nothing. The tape is flimsy. It hardly picks up anything, certainly not the abundant long hairs of a Pomeranian, nor the small fuzzies. I feel like there should be a warranty I could return this crap for. What a rip off! Also, when the tape sticks to itself, good luck peeling that off.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Ford",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Simple and effective",
      "text": "You would think that sticky rollers should all be great. Well, they're not! I have a white dog who sheds constantly (and I like to wear black clothing). Most rollers aren't sticky enough or they're insanely difficult to peel off ONE sheet at a time without tearing, etc. These are excellent. They pick up all the lint and hair and they're very easy to peel. Love them",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "A Must-Have for animal hair!",
      "text": "We use these and order them quite often. Our vacation rental has an occasional pet visitor and these handy little rollers are my go-to for reducing the hair on the sheets, comforters, blankets, pillows, and couch. Way better performer than another popular brand name. This material is like masking tape in consistency with easier tear off than the other brand made from white plastic-type material.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Madsen",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Not nice...",
      "text": "I use these for \"rollling\" my cat to get loose hair, especially all spring and summer. The 3 pack is a good idea but lately I find 2 of the 3 rolls do not have a clear cut (top AND bottom on the roll) to peel off the used one. Are these factory rejects? Frankly, I'm \"up-to-here\" with this and will consider another brand to use.",
      "rating": 3.0,
      "verified": true,
      "author": "Annie A.",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Exactly what you hope a lint roller will do!",
      "text": "With a cat and a constantly shedding German Shepherd, I've used my share of lint rollers. GS are the absolute worst for shedding! With most lint rollers I had to hand pick remaining hairs off whatever I was lint rolling. These are efficient, faster, and I don't have to hand pick dog or cat hair....in other words, they do what one expects from a lint roller!",
      "rating": 5.0,
      "verified": true,
      "author": "Lyric",
      "helpful_votes": 2,
      "publication_date": 20171128
    },
    {
      "title": "Why I paid money is not",
      "text": "All the things I ordered were open. and the rips .were not good",
      "rating": 1.0,
      "verified": true,
      "author": "bordah kadhim ❤❤❤❤",
      "helpful_votes": 4,
      "publication_date": 20190818
    },
    {
      "title": "Technical difficulties, lol.",
      "text": "Maybe it was just mine, but the the roller didn't roll. I had to pull off the roller and put it on the handle to get it to roll. The sticky part is wonderfully sticky, but when it doesn't roll like it is supposed to, it can be awkward to handle. God bless.",
      "rating": 3.0,
      "verified": true,
      "author": "alm",
      "helpful_votes": 2,
      "publication_date": 20171213
    },
    {
      "title": "BUY THIS! Great lint roller!",
      "text": "I never thought I'd say there was any difference in lint rollers, BUT THERE IS! This lint roller is amazing. It's super sticky and the sheets come off easily and cleanly. I have no problem with rolls coming off the handle at all. I have dogs and friends have used it and immediately ordered for themselves! BUY THIS!",
      "rating": 5.0,
      "verified": true,
      "author": "WA Mum",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Dont fit average handle",
      "text": "These are not jumbo or large. So they don't fit 2 different sizes of handles I have (one by the same brand). Can't figure out what size i have. My plan with this many rolls was to have one in each room but now I have 1 handle that fits with a bunch of rolls",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171110
    },
    {
      "title": "Tedious and frustratingly ineffective on wool coats.",
      "text": "Lets be real - this works fine removing pet hair on many items of clothing, but forget it if you think this will easily clean a wool coat. It took me at least 10 sheets to get most (but not even all!) of the cat hair off my P-Coat.",
      "rating": 3.0,
      "verified": true,
      "author": "jp nyc",
      "helpful_votes": 2,
      "publication_date": 20180214
    },
    {
      "title": "Great for use on more than just clothes",
      "text": "You can't go wrong with Every are Pet Hair Extra Sticky Lint Rollers. It removes pet hair from my clothes extremely well but doesn't harm delicate sweaters or blouses. I use them in my car and even to remove pet hair from the pillows on my couch.",
      "rating": 5.0,
      "verified": true,
      "author": "Melaniedawn",
      "helpful_votes": 3,
      "publication_date": 20170327
    },
    {
      "title": "Fast Service & Good Value for the Money!",
      "text": "Good value for the money and considering you cannot find this in a lot of stores right now.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Mayhugh",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Heavy Duty Lint Roller",
      "text": "wow this is a very heavy duty lint roller thought it was going to rip something. i got this to clean my rugs so far so good I’d definitely buy this if you have a pet and also if you have carpets/rugs that you can’t vacuum",
      "rating": 5.0,
      "verified": true,
      "author": "Lena Kwon",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "refills wrong",
      "text": "these are great lint rollers for removing the dog hair that follows me everywhere. HOWEVER, the refills that came with these were the wrong freaking size for the roller! they are too small and so wont go on the roller stick. wtf am I supposed to do with a sticky roll that wont fit on the roller wand thing? too much hassle to return, so just making do but very annoying.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "What a great product! I have a long haired cat who ...",
      "text": "What a great product! I have a long haired cat who specializes in shedding and his fur weaves into fabric. This is the only product that I know of that gets it all off!!! Great product, great price and rapid receipt. Couldn't be happier",
      "rating": 5.0,
      "verified": true,
      "author": "Denise R. Holliday",
      "helpful_votes": 2,
      "publication_date": 20170824
    },
    {
      "title": "The only lint roller I will buy from now on, it's excellent!",
      "text": "I have finally found a lint roller that works as it should! These are super sticky and great for pet hair and anything else. It's easy to tear sheets off and they don't rip a whole bunch off with them. I have a short haired dog that sheds an unbelievable amount, and have yet to find a brush that works on her. So I use one of these to lint roll my dog lol, they pick up a lot of hair but don't pull or hurt her, in fact she enjoys it and rolls over so I can get her belly too!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Works wonders!",
      "text": "At first it doesn't sound like a bargain because there are only 60 sheets per roll; however, each sheet lasts much longer than regular lint roller sheets. They are extra sticky and pick up dog hair like you wouldn't believe. I will definitely buy this product again and I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Kindred Moore",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Total waste of money",
      "text": "The rolls don't roll! The rolls are so tight on the handle that they don't spin freely and you have to press very hard for it to roll, and if you manage to get it spinning, it will spin off the handle! Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160921
    },
    {
      "title": "Work Very Well!  These aee the best I have found and. Will coninue Buyy",
      "text": "We have 4 Cavalier King Charles spaniel and an American Pitbull Terrier not to mention 3 cats. Black is a hard color to wear so we always have these sticky tape the is extremely good! One of bes and I am always buying leaving in living room and bedrooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Paperin",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Comes off the roller",
      "text": "This works well for picking up hair but the sticky rolls constantly come off of the roller. It’s super annoying to have to stop and push it back onto the roller. won’t buy this brand again.",
      "rating": 2.0,
      "verified": true,
      "author": "Robsey",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Lint roller that doesn't roll",
      "text": "Terrible. Roll does not even roll. It's so tight that it doesn't move or it rolls off the handle. Not functional. Do not recommend buying at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Ruby Waves",
      "helpful_votes": 7,
      "publication_date": 20170209
    },
    {
      "title": "Heavy duty roller! Great product for stubborn pet hair",
      "text": "This is the stickiest roller I’ve ever used (and with 3 dogs and a cat... I’ve bought my fair share of them!). Sometimes it is so sticky that it doesn’t glide as easy as others but I think that is a great problem to have!!! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Hoover",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Would be as good as Honey Do if there weren’t mechanical issues",
      "text": "Very sticky but hard to roll because the cardboard hits the plastic and just shreds the cardboard which then gets cardboard debris back on the article of clothing you are trying to roll clean. Basically mechanical issues. If they fix that then it would be an excellent pet hair remover. Maybe even better then Honey Do.",
      "rating": 3.0,
      "verified": true,
      "author": "Little Rock, AR",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "JUNK - absolute junk",
      "text": "The plastic handle quickly became chewed away by the rotation of the tape to the point where the tape roll would not stay on the handle. So now I got rolls of tape and no way to use them. I noticed no difference in the pick-up quality from the regular lint rollers I buy at China-mart. Zero stars - not worth the time to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Private",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Roll can't \"stick\"",
      "text": "I am extremely disappointed with this purchase. I have used the evercare rollers in the past, and they worked great. The sheets are sticky and effective for collecting pet hair. However, something has been changed. I can't even use two strokes with the new roller without the entire roll of sticky sheets falling off. It's absolutely infuriating and worthless. I have tried all three rolls that came with the bundle and none of them will stay on the roller. I will have to purchase a new brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190429
    },
    {
      "title": "The best",
      "text": "The best lint sheets ever, unfortunately they don’t stay on the roller well, but still the superior brand due to the stickiness. It’s this kind is masking take and all the other brands are scotch tape, they don’t compare.",
      "rating": 5.0,
      "verified": true,
      "author": "Scruffpuppi",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "I’m buying the “giant” one next time",
      "text": "Great product, but I’m used to the larger size. (The blue handled Evercare Home Giant Extreme stick) These green ones are a little smaller than I like, but they have the same stickiness. You just don’t get as much per roll because the circumference is about 1/2 the size of the “giant” one.",
      "rating": 5.0,
      "verified": true,
      "author": "Coleman203",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Don't waste your",
      "text": "If this roller is extra sticky I am the Queen of the May. Have a soft haired grey cat. I use 6 or more sheets to lift hair from khaki cotton couch. Truly misrepresented. Don't waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20170731
    },
    {
      "title": "Ok",
      "text": "These work very well for short dog hair- however, the sheets are really hard to separate and about 1/2 the time you either rip it in half or you peel multiple sheets at once.",
      "rating": 4.0,
      "verified": true,
      "author": "GirlieGirl",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Great for cat hair!",
      "text": "These are great for cat hair on clothes. One of the only ones that work. Heavy duty and strong. Sometimes it takes a few seconds to peal to the next one but nothing you really notice.",
      "rating": 5.0,
      "verified": true,
      "author": "CJonline",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Too sticky????",
      "text": "I'm not sure if it is the design or that the paper is so sticky but it is extremely difficult to get the papers peeled off from one another. Ten plus sheets are wasted trying to get the used ones off. On first use the roller broke.",
      "rating": 2.0,
      "verified": true,
      "author": "Harper",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Refills do not stay on roller",
      "text": "This is the worse idea ever. The refills do not stay on the roller. I bought an extra pack of refills also and they do not stay on. So frustrating when using as the roll flys off the roller. I just want to throw them away.",
      "rating": 1.0,
      "verified": true,
      "author": "Alaska Mary",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great for controlling  pet hair!",
      "text": "Works well! These are lifesavers for us, as our cat sheds quite a bit. I use them all around the house. One trick to keep hardwood floors hair-free is to swiffer with a microfiber cloth, then remove all hair with one sheet of this pet roller.",
      "rating": 5.0,
      "verified": true,
      "author": "Retired teacher",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "It tape..",
      "text": "My only issue is that the roller keeps coming out of the tape roll when I use it.",
      "rating": 2.0,
      "verified": true,
      "author": "HtownRN",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "These are out favorite rollers.",
      "text": "They are very sticky, they get all the cat hair off of our clothes, couch, car seats, etc. They're a little more difficult to peel because of how sticky they are, but to me, that's a plus. I hate the plastic-y lint rollers (HATE them), these just feel like paper.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Potter",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "I should buy stock in this company",
      "text": "These are the best link rollers ever. I have two large dogs with long hair, and it is hard to keep things hair free, but these keep me looking good, and no one at the office sees hair on my clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie J. Browne",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Don't Bother",
      "text": "I like the single roll of this product but this particular product with the refills is not made very well. The roller doesn't lock into place so I would roll a couple of times and the roller would roll right off the base and fall on the floor. Had to keep pushing it back down every couple of rolls. It was very inconvenient and would not bother buying this product again.",
      "rating": 1.0,
      "verified": true,
      "author": "Lynne Kawaminami",
      "helpful_votes": 2,
      "publication_date": 20190823
    },
    {
      "title": "This seemed like a good price for these and they work just ...",
      "text": "I buy tons of these lint brushes because I have a dog and can't stand pet hair. This seemed like a good price for these and they work just as well as any others.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Majaski",
      "helpful_votes": 4,
      "publication_date": 20160621
    },
    {
      "title": "Good product.",
      "text": "Received on-time and packaged well. Gifted for a second time and loved for a second time. If you have pets, you need this!",
      "rating": 5.0,
      "verified": true,
      "author": "Globes6",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Super sticky!",
      "text": "Having had several pets over the years, I've tried a few brands of lint rollers. These are the best. Super sticky, rolls smoothly, sheets tear off easily. What more is there to say? Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "I’ve tried them.",
      "text": "Like the other lint rollers I've purchased. These are too difficult to peel! And also they don’t turn very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "comes off the handle",
      "text": "It works to remove hair, but rolling it makes the tape come off the end of the roller as it moves and you are constantly having to push the roll or tape back onto the handle.",
      "rating": 2.0,
      "verified": true,
      "author": "jaye",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Not a great design but super sticky",
      "text": "The paper is super sticky but not for long. That’s to be expected as you pick up more stuff but it feels like it happens quickly. However the biggest deal is that the rolls don’t click into place at all so as you roll it, the roll falls out, which is annoying.",
      "rating": 2.0,
      "verified": true,
      "author": "Haley",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Best bang for your buck",
      "text": "If you have a pet this is the brand you need don’t try for the other more expensive let rollers they do nothing this is the lint roller that will pick up all the dog hair",
      "rating": 5.0,
      "verified": true,
      "author": "DD Gray",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Roller doesn’t roll",
      "text": "Tape is pretty great at removing lint and hair, BUT it doesn’t roll. Major design issues with the roller.",
      "rating": 2.0,
      "verified": true,
      "author": "Jordan R. Harker",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Disappointed",
      "text": "I was honestly shocked and disappointed. The sticky roll did not have a good sticky contact. It was very thin and no area where it has the ridge area that you would tear a section off.",
      "rating": 2.0,
      "verified": true,
      "author": "Crissy",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "The best hair roller I’ve ever used",
      "text": "This product works so well getting cat hair off of clothes and furniture. This is by far the best hair roller I’ve ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Aric",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Terrifically great",
      "text": "These are terrifically sticky and GREAT for removing dog hairs, fleece pills, and other bits of stuff and fluff. I have found them to be a whole lot better than any others.",
      "rating": 5.0,
      "verified": true,
      "author": "Road Trip Traveller",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "they work just fine.",
      "text": "They don't seem to be any more \"sticky\" than the ones that are just regular lint rollers. I really thought they'd have maximum stickiness. Don't get me wrong...they work just fine.",
      "rating": 3.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 2,
      "publication_date": 20170208
    },
    {
      "title": "Excellent lint rollers",
      "text": "Evercare are the best lint rollers I’ve ever used. Never buy the plastic sheet lint rollers!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Alexander",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Tape is great. Handle not so much",
      "text": "Handle kind of holds to roll of tape on. It slides off. It's cheap and does the job though.",
      "rating": 4.0,
      "verified": true,
      "author": "rlamb",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "They love it and and it works well",
      "text": "I use these on my 2 Chihauhas at home to help get dog hair off my top bed cover and I also run it across their body to remove excess loose hair. They love it and and it works well. Super sticky.",
      "rating": 4.0,
      "verified": true,
      "author": "The Fire Nurse",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Not good enough for pets that shed.",
      "text": "Total waste. I bought them for cat fur removal but used them so often I ran out of all 180 sheets within a month",
      "rating": 2.0,
      "verified": true,
      "author": "aggy p",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "The best for cat hair!",
      "text": "This is the only brand I buy. The name says it all. It is extreme stick and I have a black cat so that is why I need this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Thompson",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "First roll is great second roll not so much!",
      "text": "I bought this product to get all the dog hair off my clothes and couch for when I don’t have a lot of time to clean up. It does a great job picking up the dog hair but once you go to change the empty roller the new roll does not stay on. That is the only downfall but other than that it works well!",
      "rating": 4.0,
      "verified": true,
      "author": "Jacob Forsythe",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "I wish there was even more in a roll.",
      "text": "These are great and full. They're the most full ones I found. The stick is the best I've found but I still have to go through a few sheets to get the desired effect of removing pet hair off their beds.",
      "rating": 4.0,
      "verified": true,
      "author": "jay",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Sticky Indeed",
      "text": "My cat loves the long ledge in the living room along the windows. He sheds terribly, so I use the lint roller to get the hair off of my curtains. Always running out. Not this time.",
      "rating": 5.0,
      "verified": true,
      "author": "Unicorn",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Love Them",
      "text": "Oh My Gosh - do these lint rollers WORK! With 2 cats I always have cat hair on me - these rollers take it off with one swipe! If you have pets or what not - these are the lint rollers to get!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Works OK, but not as well as some.",
      "text": "This product is average and not a good value for the money. I have tried worse, and I have used better. It works OK but doesn't get as much hair per sheet as some others do, so I use up a roll faster than should be necessary.",
      "rating": 3.0,
      "verified": true,
      "author": "Marti R",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "This product would be great if it rolled smoothly",
      "text": "This product would be great if it rolled smoothly. Usually I'm using a lint roller on my clothes but instead of rolling smoothly to get pet fur off, the roller gets stuck. I either have to hold my clothing taught or use it on rougher material. I does not work good on cotton sweaters, blouses or t-shirts.",
      "rating": 2.0,
      "verified": true,
      "author": "Ahayden",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "do they work?",
      "text": "absolutely the best roller i have ever used. Even works in my jeep which has the type of material that hair is almost impossible to get up even with a vacuum. highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa C.",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "One of the best!",
      "text": "I have two cats and work for the government, so I can't show up covered in cat hair. This product will remove all your pet hair and is easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "KATANAsan",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "won't roll",
      "text": "The sticking is very good but you have to forcefully move the roll on the shaft.",
      "rating": 3.0,
      "verified": true,
      "author": "catlady",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Works, but Flaws",
      "text": "Works very well, but I go through a roll very quickly, as I have two short hair cats. I also find it very annoying that the roll constantly flies off the handle while I am using it. Will keep looking for a better solution.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Simms",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Furry black slacks are NO MORE!",
      "text": "These lint rollers are sent from heaven! We have cats and dogs with fine hair and these rollers get the hair off everything! Even the black carpet back of my car. A+++++++",
      "rating": 5.0,
      "verified": true,
      "author": "HannahSmith",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Extra sticky = Extra good!",
      "text": "When they say \"extra sticky\"- they mean it! These rollers are great. We have 5 black cats that are affectionate so cat hair on clothes can be an issue and this is the solution.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Altman",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Awful design",
      "text": "Ok, honestly, I'm not trying to be rude here but this is easily the worst lint ROLLER I've ever used. It doesn't roll. And when it does, the whole damn tube comes off the handle. It's difficult to use when you are CONSTANTLY having to shove the roll back on. The sheets are sticky and pick up well, but they tear off into pieces when you try to tear them off. Honestly, it wasn't worth the money, so save yours.",
      "rating": 1.0,
      "verified": true,
      "author": "Melanie M.",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Waste of money",
      "text": "Broke after the 2nd roll, won't hold a roll on it anymore, just comes flying off when rolling it, which makes it completely useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "The best lint removers",
      "text": "These are the best. Extra sticky so the pick up lots of lint as well as the hair from clothes. Great to use for dusting lamp shades as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Best roller for dog hair",
      "text": "My favorite roller for dog hair, comfortable grip, good stick tape and the roller doesn’t pull apart from the handle like several other brands I’ve tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie H",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Works great for pet hair!",
      "text": "Worked as expected. Works very well for pet hair, very satisfied with the lint rollers over standard (non-extra-sticky) lint rollers.",
      "rating": 5.0,
      "verified": true,
      "author": "David R. Chase",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Dont waste your money",
      "text": "I hate this this thing. It does not roll well. It picks up hair ok but nothing like what I had expected for a product that is clearly made for pet hair. Get yourself some duct tape.",
      "rating": 1.0,
      "verified": true,
      "author": "monique",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Extra Sticky",
      "text": "As described. It is more 'stick than anticipated, so it picked up more items than expected. With certain materials and fabrics, it may pick up some of the fabric material and not just the Lint or hair. That's how sticky it is. Keep that in mind. But it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170616
    },
    {
      "title": "Have had many sticky rollers",
      "text": "I bought this one for the ergonomic handle. The roller continually falls off the open end so it is not the least ergonomic handle I have.",
      "rating": 3.0,
      "verified": true,
      "author": "Family Music Box",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Best I have found",
      "text": "I have had dogs all my life and this is the best lint rollers i have ever found for dog hair. I quit trying to find the best. Think this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "ozwoman",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Best lint roller",
      "text": "I have been using these lint rollers for a few years. Recently the local store where I had been buying them discontinued them. The waregreat for picking up cat hair on furniture and clothing.",
      "rating": 5.0,
      "verified": true,
      "author": "SAM",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "Worth the buy!",
      "text": "Works better than any store bought lint rollers I’ve ever purchased, and let me tell you I have tried them all! None of them except these get all the fuzz and more! I also haven’t had any issues with the replacement rolls falling off the handle either!",
      "rating": 5.0,
      "verified": true,
      "author": "d.sbf",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Iffy",
      "text": "The product itself is great! But mine came cracked at the bottom, would not order again simply because people have been receiving worse than me and mine was damaged",
      "rating": 3.0,
      "verified": true,
      "author": "Tyffanie",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "... gets stuck often and will pull off the roller easily. Does a moderate job getting pet hair and ...",
      "text": "Roll gets stuck often and will pull off the roller easily. Does a moderate job getting pet hair and lint off clothing and furniture.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Takes a little coaxing to get it a rolling...",
      "text": "The roller does not roll easily along fabric. Takes a little tugging and coaxing but otherwise works just fine. Seems like an easy thing to fix in the design. Hint, hint. Great price.",
      "rating": 3.0,
      "verified": true,
      "author": "Work In Progress",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Great, especially on fleece",
      "text": "These really are extra sticky - I wear a LOT of fleece and have pets....so needless to say I'm furry too! These are the best and I will buy more!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Roller Won't Roll",
      "text": "The sheets are sticky, but the roller won't roll. The tape doesn't stay on the holder very well either. I peel the sheets off and use them alone. I much prefer Scotch-Brite rollers.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Richards",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Great product",
      "text": "Works better than most lint rollers. We have 2 dogs and 2 cats. Everything has hair on it, but these help with the battle!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather N",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Don't buy this. . Waste of money",
      "text": "Save your money. ..this is no better.. maybe not as good, as the Scotch brand you can buy anywhere. The tape spool comes off of the handle everytime I use it. Junk. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Peters",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "Excellent product",
      "text": "Our dog is a heavy shedder. This has worked the best so far at getting all the dog hair off without having to repeatedly change tape.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimbo",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Used to be a good product; now the rollers will not stay on ...",
      "text": "Used to be a good product; now the rollers will not stay on the handle. The roll inside diameter is too large for the handle. I will not buy more of these.",
      "rating": 2.0,
      "verified": true,
      "author": "Texas88Fan",
      "helpful_votes": 2,
      "publication_date": 20170107
    },
    {
      "title": "WORKS GREAT",
      "text": "Works much better than the other roller with the white plastic tape and black handle; at least this roller actually gets the hair and lint off your clothing!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda R.",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "wont Work in short hair animal fur such as Boston terriers and Great Danes",
      "text": "This did not get the dog hair out of the sofa. If you have fur that has needle-like hairs that get interwoven into the fabric (short hair dogs), this will not get the fur out unfortunately",
      "rating": 1.0,
      "verified": true,
      "author": "Jlckmr",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "For the first few seconds of using it it isn’t bad.",
      "text": "I think the “super sticky” advertisement was a let down. It works but it was nothing special. You have to change out the sticky sheets often. For the first few seconds of using it it isn’t bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Jared H.",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "Excellent!",
      "text": "These are by far the best on the market; very superior to other cheaper brands. Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan B.",
      "helpful_votes": 0,
      "publication_date": 20190201
    }
  ],
  "product_meta": {
    "title": "Evercare Pet 50% More Pickup Per Sheet, Lint Roller Combo Pack, 180 Sheets (617132) (Packaging May Vary)",
    "description": "Evercare we’re not only the lint roller experts we’re the lint roller inventors Since 1956 we've been creating high quality lint rollers to help you look and feel your best We want to help you step into every aspect of your life with confidence The Evercare Pet lint roller offers 50% more pick up per sheet for a quick and effective way to remove unwanted pet hair lint and debris Use this pet roller on all your clothing upholstery and auto interiors When you need a little more pick up reach for an Evercare Pet lint roller Because we know you love your furry friends but that doesn’t mean you want to be wearing them everywhere you go So let us help you! Keep the Evercare Pet lint roller with you in your home car or office to keep you looking and feeling your best Because Evercare is all about making life easier and creating a better you!",
    "rating": 4.3,
    "feature_bullets": [
      "Remove tough debris from clothes and furniture",
      "Features ergonomic handle and reusable outer Cover",
      "Combo pack includes 1 Lint Roller and 2 refills 180 Total sheets",
      "Extra sticky tape for unmatched pickup power",
      "Quickly & effectively cleans up pet hair lint and debris from virtually anywhere",
      "NOTE: The product has undergone a packaging update. You may receive either the old packaging or new packaging but the product remains the same"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.13 x 6.63 x 9.25 inches; 9.6 Ounces",
      "Item model number": "617132",
      "Date First Available": "November 4, 2014",
      "Manufacturer": "Butler",
      "ASIN": "B019NCISTA",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Household Supplies",
      "Lint Removers",
      "Laundry",
      "Pet Supplies",
      "Health & Household"
    ],
    "price": 9.92
  }
}