{
  "website_summaries": [
    {
      "verdict": "The New Balance Vazee Pace was enjoyed by many of its testers. They were able to experience and comment about the efficient mid-sole, the comfortable upper unit, and the precise outsole rubber. But there were those who didn’t like the quality of the tread because it wore off too quickly on them, and the fit wasn’t as agreeable to others. Still, this neutral shoe became a popular choice among neutral runners.",
      "pros": [
        "The upper unit of the New Balance Vazee Pace felt like a glove, according to those who tried it",
        "The fabrics of the upper were able to allow air into the foot chamber, and runners appreciated how it kept their feet cool and dry throughout their activities",
        "According to a user, the interior fabrics were smooth and it didn’t cause any discomfort or irritation",
        "The toe box was slightly roomy, but the rest of the cover system felt snug and secure, wrote a number of testers",
        "Many runners described this model as ‘comfortable’",
        "A reviewer wrote that the shoelaces felt rich, high-tech and stretchy",
        "it didn’t unravel by themselves even after many miles of running",
        "This shoe was adequately lightweight for a lot of runners",
        "Users commented that the underfoot platform was reliable when it came to its capability to cushion the foot",
        "Based on many reviews, the outsole’s traction capability was dependable"
      ],
      "cons": [
        "The outsole’s treads wore out on a number of testers, reducing the quality of surface traction",
        "A few runners noted that it was uncomfortably narrow and restricting"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.8,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "The bulkier version of the vazee 2090",
      "text": "If you liked the vazee 2090 (like I did), unfortunately new balance killed it. It basically splintered into two shoes: The Pace and the FuelCell. The FuelCell is a performance, lightweight shoe, that usually starts to bug my arches/feet if I run in it too often, as it really doesn't have a lot of the support/cushioning needed. The Pace on the other hand is more of an everyday trainer and which lacks some of the presonsive of the fuelcell. So if you are looking for an everyday trainer similar to the 2090, this is your guy. If you are looking for performance, go for the fuelcell.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua R",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Love these sneakers!",
      "text": "I really like the runDisney line of New Balance running sneakers, but they are hard to find anywhere but eBay, and there, they are way overpriced. I saw these, and they were half the price then on eBay. The price fluctuated a lot, and when they came down to $70, I jumped On them. They look great, and are very nicely made. The one thing I can’t get over is how light they are. I’m not a runner, so I never really had running sneakers before, but they feel like they are barely on my feet. As they break in more, I’m sure they’ll get even more comfortable. They will be perfect for my upcoming trip to Disney.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Buy 2",
      "text": "Great shoes. I bought a second pair just weeks later. Why? because when you find something that really works, expect the manufacturer to change it. It never fails. I added a pair of Super Feet insoles. Wow, really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Bradley",
      "helpful_votes": 6,
      "publication_date": 20170103
    },
    {
      "title": "Great Lightweight Supportive Shoe",
      "text": "Unlike Nike Free 5.0 this shoe provides support while being lightweight. I'm dealing with plantar fasciitis, and this shoe provides a tight heal area, yet a roomy toe box in a \"D\" width. This is my current favorite shoe, so I have 2 pair. One for indoor (gym) and one for outdoor (stairs and hiking). The plantar fasciitis is gradually diminishing.",
      "rating": 5.0,
      "verified": true,
      "author": "Rezonator",
      "helpful_votes": 2,
      "publication_date": 20170208
    },
    {
      "title": "We did exchange for the larger size and the fit is great. Hubby loves them",
      "text": "I would suggest in a running shoe with NB to go up a size as these do run small in the toe area. We did exchange for the larger size and the fit is great. Hubby loves them, they are light and comfy and nice looking. I know he will be wanting more pairs of NB. With lupus your feet have swelling and so these go with the foot.. Good buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 2,
      "publication_date": 20160816
    },
    {
      "title": "Good neutral shoe that fit my foot perfectly",
      "text": "After wearing New Balance M890 (V2, V3 & V4) for many years, I could no longer find the shoes in my size through Amazon, I decided to take a chance on these shoes. I noticed that the outer sole forces you to push off your toes more that what I was used to and that caused some outer calf soreness. Aside from that, I like the shoes. Not crazy about the color but I bought them for running not fashion.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "My go-to trainer, comp to Asics DS trainer",
      "text": "Fits as expected. I wear 10.5 in Nike and ASICS and NB appears to be in line. This is a great training shoe, responsive with just the right balance of weight and cushion. The toe box is quite roomy, making it a great offering for those with a narrow heal but wide arch.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan A",
      "helpful_votes": 2,
      "publication_date": 20161221
    },
    {
      "title": "best looking NB",
      "text": "I've had 12 pairs of NB in the past and this might be the best looking of the lot. I take a wide and these are just a tad narrow. All my others are 2E and if I was to order again, I would opt for 4E. Highly recommended shoe",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Ashman",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Have loved them. Ran 2 marathons and at least 3 ...",
      "text": "No longer able to regularly afford my adidas supernova glides after 15 years of nothing but adidas supernovas/glides. I came onto Vazee after some research. Have loved them. Ran 2 marathons and at least 3 halves. I average 400 or so miles per month regularly in these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "John Mignosa",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "Other than that they look great and are comfortable and feel good to run in",
      "text": "My son wears them for cross country, he says the fit well but he can't wear too thick of a sock. Other than that they look great and are comfortable and feel good to run in.",
      "rating": 4.0,
      "verified": true,
      "author": "Karma",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "New Balance Value Pace v2",
      "text": "Excellent transaction. Arrived on time. Fit a little tight both in length and width. First time I've experienced this in a New Balance shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Private",
      "helpful_votes": 2,
      "publication_date": 20170509
    },
    {
      "title": "Rplacement for NB 890 (neutral)",
      "text": "Got these because NB 890 (neutral) are no longer available. So far, so good. I'm a Nordic-walker -- about 20-30 miles a week. We'll see how they hold up.",
      "rating": 4.0,
      "verified": true,
      "author": "Haudi",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great shoes",
      "text": "Very very light weight and gives good impact absorption for when I run around the track, would recommend for anyone that needs a good pair of running shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kielbill",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "It's like I'm not wearing a shoe at all",
      "text": "Light weight shoe that blends in with my clothes. It's like I'm not wearing a shoe at all. I've jogged a 10k with them, and regularly do shorter distance with them. Would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul M",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Vazee",
      "text": "I just got them and put them on Vazee is the only shoe that fits I love them 3pairs in 2 years it's all I wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Curly",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Good fit for wide feet",
      "text": "I have wide feet and got this shoe in my regular size, in wide, and they fit great.",
      "rating": 5.0,
      "verified": true,
      "author": "mlbd",
      "helpful_votes": 2,
      "publication_date": 20170303
    },
    {
      "title": "Good choice!",
      "text": "These shoes seem like they would fit a lot tighter tighter they do...I was thrilled to find they fit very comfortably and in a wider size. They even have remove able insoles for orthotics..they are light and non skid...I really like them ..they are also reflective for night walking or running",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel DeWig",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "Pretty awful for the price",
      "text": "Fell apart very quickly, no cushion. I use the shoes for yardwork and when I don't want to ruin my actual running shoes now.",
      "rating": 2.0,
      "verified": true,
      "author": "dinga lingdong",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Great running feel for 195 lb guy",
      "text": "Plenty of toe room and my daily runs are smooth as silk.",
      "rating": 5.0,
      "verified": true,
      "author": "Lowbrass Pete",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Run with this one.",
      "text": "Good fit. Only put about 30k so far but no problem so far. Feels good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "They look really good and fit as expected",
      "text": "I bought these sneakers for my husband and so far he loves them. They look really good and fit as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Lynch",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "Love em'.",
      "text": "Love em' ... Using them on my treadmill, and they feel better than any other shoe I've used in the past!",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky Rock APBT",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Awesome job New Balance!",
      "text": "Awesome fit. This shoe fit and performs better than expected. Perfect support and very light weight. I would buy this shoe a thousand times over!",
      "rating": 5.0,
      "verified": true,
      "author": "Lou49",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "A little narrow compared to New Balances I've owned in ...",
      "text": "A little narrow compared to New Balances I've owned in the past, making the shoe feel smaller overall, but fits similarly length-wise.",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel Haddaway",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Overall good shoe.",
      "text": "I had to order 0.5 size smaller. Normally I am 10.5 but ordered 10.0. Lengthwise the 10.0 fits perfectly but a little too tight around the middle. Overall good shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Athenatrix",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Great shoes.",
      "text": "Great shoes. Ive bought this pair before and bought these because I liked the first pair so much. I run track and cross country in these.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Good Replacement for Brooks Pure Connect 4 running shoes",
      "text": "Was looking for a replacement for Brooks Pure Connect 4 and these were recommended. Light shoe, minimal drop, nice cushioning and fit well. \"Normal\" shoe size is 10.5, ordered 11 and they fit perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Berndt",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Very narrow",
      "text": "I'm a 10.5 wide and can usually get away with an 11 but these are very narrow. I couldn't fit much more than my toes. The shoes are very nice looking though and look pretty sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Conniff",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Five Stars",
      "text": "Great fit, would love to get an exact replacement pair if still available.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Very Durable",
      "text": "Very durable. I used these when I marched World Class Drum Corps this summer, they held up through 12 hours a day of running around football fields for about 2 months, and I can still wear them comfortably.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Too narrow",
      "text": "Bought a 2E and it feels like a narrow! Had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy S",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "These shoes are great, I'm recovering from ankle surgery and these are ...",
      "text": "These shoes are great,I'm recovering from ankle surgery and these are comfortable and fit well.",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa Javaux",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "... wearing NB for over 30 years so was very disappointed on how small this shoe fit",
      "text": "I've been wearing NB for over 30 years so was very disappointed on how small this shoe fit. Normally an 11 2E or 11 4E fit well but this 11 2E is short and extremely tight. Shipping the shoes back also cost me $11 so this is the last time I order from Peltz.",
      "rating": 1.0,
      "verified": true,
      "author": "A Padko",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "Awesome",
      "text": "Pretty nice pair of running shoe which I would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Damien Coombs",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Felt great. I usually run with my Brooks Launch",
      "text": "had my first run with them today. Felt great. I usually run with my Brooks Launch, very durable and comfortable. So far, I'm a big fan of the Vazee.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "These are without a doubt some of the best running shoes I've ever owned in my life",
      "text": "These are without a doubt some of the best running shoes I've ever owned in my life. New balance knows exactly what they are doing. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Perry",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "... because I have worn New Balance for years and love the brand",
      "text": "I bought these for my husband because I have worn New Balance for years and love the brand. He likes them a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele W.",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Good support and cushion without adding a ton of weight",
      "text": "large toe box, springy feel and lightweight. Good support and cushion without adding a ton of weight. Great shoe for longer distances when racing flats are not a great option.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Liu",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "I've only worn them 1 time. I needed a ...",
      "text": "I've only worn them 1 time. I needed a pair of sneakers to run 1/2 marathon and cant find a pair that doesnt make me hips down to my toes hurt after 6 miles. I hope these will work.",
      "rating": 4.0,
      "verified": true,
      "author": "Dale Handley",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "For the price these are some damn fine shoes. I’ve already put 50 miles on em ...",
      "text": "For the price these are some damn fine shoes. I’ve already put 50 miles on em and they feel great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Lemmons",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Good running shoe",
      "text": "This wasn't my first pair of these. Good neutral shoes with a comfortably wide toe box. Cushioned enough for marathons. Durable for training. As good as it gets for me.",
      "rating": 5.0,
      "verified": true,
      "author": "An aging runner",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Five Stars",
      "text": "These are great shoes. Fit as expected and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Brew1018",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "They're even more supportive and look even better. I have the ones labeled \"green/yellow",
      "text": "I wore out 3 pairs of its predecessor and am thoroughly impressed with this update. They're even more supportive and look even better. I have the ones labeled \"green/yellow,\" but, as the picture indicates, they're really a deep navy, in addition to the blaze yellow. The first pair of last year's model that I purchased was fit to my feet by pros at Luke's Locker, so I knew that those would fit well for my walking style (I walk on my toes more than my heels, so these help me walk/jog a little more correctly). I have high arches, so I need the arch support these provide, too.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Atkinson",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "but these 2E wide shoes fit like a D",
      "text": "Had to send back, New Balance usually runs wide, but these 2E wide shoes fit like a D width",
      "rating": 2.0,
      "verified": true,
      "author": "Michael J. Fitzpatrick Sr.",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Great, lite running shoe",
      "text": "Great, lite running shoe. I was apprehensive about ordering and not trying on first, but NB sizes are right on. Great fit!",
      "rating": 5.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Four Stars",
      "text": "Not quite as good as the original Vazee Pace in either appearance or comfort. Still a quality shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Rupert Pollard",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Best show ever!",
      "text": "Best running shoe ever. Ran my first half marathon in this shoe. Will be getting another pair here soon.",
      "rating": 5.0,
      "verified": true,
      "author": "kristin",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "I was using the NYC model but found this one ro be just as comfortable. I tried them in Central Park",
      "text": "I use 10,5 vaze pace 2 running shoes. I was using the NYC model but found this one ro be just as comfortable . I tried them in Central Park . Great run with very good shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "mateowesti",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Good trainer. Immediately above the arch a bit narrow ...",
      "text": "Holding well after 100 miles. Good trainer.Immediately above the arch a bit narrow but it was amenable to careful lace arrangement.",
      "rating": 4.0,
      "verified": true,
      "author": "Gustav Siebenberger",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "great material, and you can feel the strong support ...",
      "text": "Fit as expected, great material, and you can feel the strong support of the shoe as you run.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Four Stars",
      "text": "First mainstream shoe I have liked in years. This is coming from a picky minimalist runner.",
      "rating": 4.0,
      "verified": true,
      "author": "Attorix",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Five Stars",
      "text": "The shoes fit my feet well, and are quite suitable for jogging. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Yiming Yang",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "So comfortable!",
      "text": "I love these shoes. It's been a long time since I've had a pair of shoes that were this comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Three Stars",
      "text": "Not good as a running shoes but as a fashion shoes (?)",
      "rating": 3.0,
      "verified": true,
      "author": "Kyungho Cho",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "One Star",
      "text": "NO matter how tight I made the laces my heel kept slipping with the end result being blisters.",
      "rating": 1.0,
      "verified": true,
      "author": "John P. Carr",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Great shoe",
      "text": "One of my better running shoes. Definitely as good as wave riders",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Barras",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Terrible Quality and Worse Customer Service",
      "text": "After 172 miles I've had eyelets tear out on both shoes. Terrible quality and construction and what's worse is New Balance's customer service. I've now talked to several people who \"can't do anything to help me\". Amazing that they aren't willing to help fix a situation in which their product failed. I would strongly recommend not buying these shoes unless you are willing to have them fall apart a third of the way through the useful life of the shoe.",
      "rating": 1.0,
      "verified": true,
      "author": "Craig Taylor",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Vazee Pace v2",
      "text": "With the newer New Balance offerings tending towards either too small, too narrow or both, these (after trying a few of the Vazee offerings as well as a Fresh Foam offering) seem to fit as expected. The 2e has a roomy toebox and the length was spot-on for a men's, size 9. A nice looking runner with decent cushioning and a sock-like fit. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "They are great, responsive shoes",
      "text": "This is my second pair of these. They are great, responsive shoes. I can actually tell that I'm running on a surface, not a pillow-top mattress like too many shoes these days. They give me enough response for fast runs and protection for long runs (I've gone 16 miles, feel comfortable going a marathon in them).",
      "rating": 5.0,
      "verified": true,
      "author": "Ben234",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Love these shoes",
      "text": "Love these shoes, always a fan of New Balance shoes, and I was not disappointed. I run 4 to 5 times a week and I used these right out of box and no blisters no discomfort of any kind.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20160924
    },
    {
      "title": "Narrow width construction sold as 2E",
      "text": "I couldn't even get my foot in this allegedly 2E with shoe. Incredibly narrow and poorly constructed. The fabric is thin and cheap looking. Worse, the shoes were mis-sewn so they bunched in weird places. When did New Balance turn so awful?",
      "rating": 1.0,
      "verified": true,
      "author": "Peacemeal",
      "helpful_votes": 2,
      "publication_date": 20170220
    },
    {
      "title": "they need to form to your foot but overall pretty good.",
      "text": "I have ran with them twice. they need to form to your foot but overall pretty good.",
      "rating": 4.0,
      "verified": true,
      "author": "wbowman07",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Does Not Meet Expectations",
      "text": "Having NB after using nike is quite incovinent. NB vazee pace V2 is quite hard , less flexible and tight in shape.For Road running it doesnt suit. i would never go for NB again. there is no comparison of Nike.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170309
    }
  ],
  "product_meta": {
    "title": "New Balance Vazee Pace, Men’s Sneakers",
    "description": "New Balance MPACEV2 Running Shoes Hold tight, the Vazee Pace v2 is here to enhance your ride even further. Still a go-to for both Team NB and casual runners alike, version 2 boasts an impressive podular forefoot for responsiveness. 2-tone knit mesh and textile overlays complete the design, bringing high fashion to high performance. Two-Tone Mesh Upper Mesh and synthetic uppers will encase each foot in breathable comfort. Perforates in the fabric at the forefoot increase airflow; creating a better, healthier environment for your feet to thrive in. The open design allows for natural toe splay at toe-off, keeping each and every one of your strides smooth and organic. The bootie construction features for a seamless, sock-like fit; because we recognise how rubbing and blisters can ruin your day. No-sew synthetic overlays wrap the midfoot securely, reducing in-shoe slippage for an easy, distraction-free ride. REVlite Midsole REVlite resides underfoot for durable and responsive cushioning, whilst maintaining that lightweight and aggressive, race-ready feel. 30% lighter than its competitors, REVlite will spare your joints as you strike down hard and fast onto unforgiving track surfaces, without compromising its feather weight. The midsole's bounce-back properties mean that superfluous use of muscle power is reduced; diminishing fatigue and keeping you energised for longer. Blown rubber fortifies the REVlite, upping durability to leave you with a plush and permanent shoe. Blown Rubber Outsole A blown rubber outsole completes the shoe, infusing every stride with extra cushion and flexible grip. Choose the Vazee Pace v2, for lightweight speed and supple comfort.",
    "rating": 3.9,
    "feature_bullets": [
      "Men's running shoe",
      "Composition: Synthetic textile",
      "Outer Material: Synthetic",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "Lightweight REVlite midsole, snug, second-skin like fit",
      "Collection: Autumn - Winter",
      "Collection: Autumn"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "38.1 x 17.78 x 12.7 cm; 263.08 Grams",
      "Date First Available": "2 Nov. 2015",
      "Manufacturer": "New Balance",
      "ASIN": "B06XRYRX2N",
      "Item model number": "MPACEV2 Running Shoe-M",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 134.12
  }
}