{
  "website_summaries": [
    {
      "verdict": "A quality low-fat food by a trusted brand that's often recommended by veterinarians for dogs that have difficulties digesting fat.",
      "pros": [
        "Low-fat recipe formulated for dogs with sensitive digestive systems",
        "Great for dogs with health issues like pancreatitis that can make digesting food with high-fat content difficult",
        "Contains prebiotic fiber that aids digestion and may calm diarrhea",
        "Available in kibble and canned"
      ],
      "cons": [
        "Pricey",
        "Reports of damaged cans upon arrival",
        "Most dogs like it, but some weren't tempted by the flavor"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "YAY MY DOGS LOVE IT",
      "text": "Recommended by my vet. I have a very finicky dog that needs to take a lot of medication twice a day with food or her stomach will hurt. She turns her nose up at 90 percent of everything I tried. EVERYTHING! I finally started making her chicken and rice for her meals. But then she was not getting full nutrition. ARGH! But she Woolf’s this stuff down as if it was fillet mignon and she’s now getting a much more balanced diet as well. So relieved. Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "SF Artist",
      "helpful_votes": 8,
      "publication_date": 20190613
    },
    {
      "title": "My dog likes it",
      "text": "It is a good quality dog food and my dog really likes it as it is just what she needs for her digestive condition. It is expensive but effective, I just wish it would come in smaller cans",
      "rating": 4.0,
      "verified": true,
      "author": "AndreyA",
      "helpful_votes": 5,
      "publication_date": 20190606
    },
    {
      "title": "Literally the only food my dog can eat",
      "text": "Purina Pro dog food has helped my sensitive dog tremendously. He likes the taste, and it’s all good with his GI tract. Thank you! Purchased through VetInternetCo, a prompt delivery every time!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet M. Parlato",
      "helpful_votes": 7,
      "publication_date": 20180405
    },
    {
      "title": "Good price & fast shipping",
      "text": "Our special needs dog loves this food. We had one can dented in but opened it and it looked fine inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon in Texas",
      "helpful_votes": 2,
      "publication_date": 20190906
    },
    {
      "title": "... dog on this An still after 8 months doing great",
      "text": "Dr put our dog on this An still after 8 months doing great",
      "rating": 5.0,
      "verified": true,
      "author": "P. Vaughan",
      "helpful_votes": 4,
      "publication_date": 20180209
    },
    {
      "title": "Does not look like EN from my vet",
      "text": "This does not look like the Brand En that I get from the vet. It says low fat but it looks like half fat. Will go back to my vet, it’s less expensive and looks like better dog food.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Questionable product- don’t risk it.",
      "text": "Cans came and they are super rusty. Also, my vet says that I actually should not have been able to buy these from any old vendor, and that I would actually need a prescription. Anyhow, the cans advertised in the image advertised are different than the cans I got. I assumed I was getting the “naturals” version and instead I got low fat. I’d like my 50 dollars back.",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 2,
      "publication_date": 20181116
    },
    {
      "title": "Five Stars",
      "text": "Dogs love this food can't use it as much as I want because it's too expensive",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Glauner",
      "helpful_votes": 5,
      "publication_date": 20160702
    },
    {
      "title": "Dog loves the taste.",
      "text": "Recommended by my vet. The dog loves it but then my dogs loves hot sauce and poop.",
      "rating": 5.0,
      "verified": true,
      "author": "Eve London",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Pricey",
      "text": "The product is good. The price is much higher then my Vet and Chewy.com",
      "rating": 2.0,
      "verified": true,
      "author": "K lee",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Dog ate it.",
      "text": "It asked what I thought of the flavor. I'll be honest, I didn't taste it. Needed ot in a pinch for my diabetic dog. He seemed to like it. A bit spendy though.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Bland",
      "text": "My Cavalier refuses to eat. He loves the one which is not fat free",
      "rating": 1.0,
      "verified": true,
      "author": "VMOSKWA",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "like it was purchased at a damaged good sale",
      "text": "Every can was dented a lot, like it was purchased at a damaged good sale. I was afraid to use so I tossed it out with the trash. Don’t buy from this vendor.",
      "rating": 1.0,
      "verified": true,
      "author": "Tommy Rhodes",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Price is literally half of what it is here at ...",
      "text": "Price is literally half of what it is here at Petco. My wife did not look at this now we are out $30, thanks Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Extremely dented",
      "text": "Needed to fill quickly for my dog so found this on Amazon. However, all cans were extremely dented!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Disappointed ",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Dog loves it!",
      "text": "My dog has bad colitis with bloody diarrhea. Veterinarian said these are great for my dog. It is expensive and also need a script from veterinarian before you buy it. My dog loves this food and never leaves a crumb behind. Wish it was a bit cheaper but id do anything for my fur brother.",
      "rating": 5.0,
      "verified": true,
      "author": "Dougiet27",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "Discoloration inside of can",
      "text": "Product had a rust looking coloration inside of the can... suggest purchasing from your veterinarian for the same cost..",
      "rating": 1.0,
      "verified": true,
      "author": "Christine Hoester",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "This dog food is really great for my Shih Tzu who has a sensitive stomach ...",
      "text": "This dog food is really great for my Shih Tzu who has a sensitive stomach and I have tried just about everything! I'm now feeding both my dogs this food and they love it and so do I! Last summer when we traveled with both dogs in a camper all over the country I couldn't find it anywhere with one exception but I just couldn't buy it over the counter without seeing a vet and getting a huge bill. I took some with me as a just in case food and we went through it fast..Im happy to see Amazon has it so when this happens again I can just order it..My vet is a lot cheaper!",
      "rating": 5.0,
      "verified": false,
      "author": "susan lewis",
      "helpful_votes": 4,
      "publication_date": 20161129
    },
    {
      "title": "DUH?!",
      "text": "I love my dog, but my child doesn’t eat this well!!",
      "rating": 1.0,
      "verified": false,
      "author": "Dissatisfied ",
      "helpful_votes": 0,
      "publication_date": 20200519
    }
  ],
  "product_meta": {
    "title": "Purina EN Gastroenteric Low Fat Dog Food 12 13.4 oz cans",
    "description": "Purina Pro Plan Veterinary Diets EN Gastroenteric Naturals Canned Dog Food 12/13.4 oz. Excellent palatability Directions & Dosage.",
    "rating": 4.3,
    "feature_bullets": [
      "Purina Pro Plan Veterinary Diets EN Gastroenteric Naturals Canned Dog Food 12/13.4 oz",
      "Offer dietary benefits that provide optimal nutrition while meeting your adult dog's or growing puppy's special needs",
      "Highly digestible"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "12.1 x 9 x 4 inches; 13.4 Ounces",
      "Item model number": "17599",
      "Date First Available": "December 13, 2015",
      "Manufacturer": "Purina Pro Plan",
      "ASIN": "B019B9NTJY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Wet",
      "Food",
      "Pet Supplies",
      "Canned"
    ],
    "price": ""
  }
}