{
  "website_summaries": [
    {
      "verdict": "If you need a well-made laser tag set for 2, this is a good choice by a top brand, but it's somewhat pricey.",
      "pros": [
        "Durable and accurate with long battery life",
        "Guns have a sturdy feel",
        "Handy carrying case is included"
      ],
      "cons": [
        "On the higher end of the price range for a 2-player set",
        "Blinking LED light is easy to detect during outdoor play",
        "A few malfunction issues"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easy enough to figure out even for me and a ...",
      "text": "What a blast we had playing this with my grandkids. Easy enough to figure out even for me and a three year old. Fun",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Goldsborough",
      "helpful_votes": 16,
      "publication_date": 20170102
    },
    {
      "title": "Most fun backyard laser tag since Survivor Shot",
      "text": "Really amazing toys. Good range, and the battery life has been surprising so far. The multi firing modes opens up a world of tactics that was never available for backyard laser tag before. Charging a room? Shotgun mode. Running for cover? Burst mode. Laying down cover fire for friendlies? Pistol mode. Behind and need a snipe to get the kill? Missile mode. I've put in so many hours with my 12 year old playing with these. The neighborhood kids have all asked their parents for sets to get an army together.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob BTop Contributor: Amazon Echo",
      "helpful_votes": 3,
      "publication_date": 20170118
    },
    {
      "title": "Lots of fun,  but have a problem.",
      "text": "This toy is a lot of fun and I really wanted to give it 5 stars, but I just bought the 4 gun pack for my daughter for Christmas and already two of the guns have problems. There are 4 team indicator lights (blue, red, green and white) on each gun to determine which of 4 possible teams you can be on. The green light stopped working on two of the guns after maybe playing 7 times... I called to get them replaced and Amazon sent me this two pack for free (hence why I gave 4 stars and not 3). I will write another review in the spring to see how they are holding up.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "LOVE THESE! I have 3 kids ranging from 10-16 ...",
      "text": "LOVE THESE! I have 3 kids ranging from 10-16 years of age (boys and a girl). I bought (3) 2 packs for a total of 6 guns so we could always have enough when friends are over. This is the first \"toy\" we've had in a long time that all my kids and their friends will all use to play together: boys, girls, 5 year old neighbor kid to the 16 yr old high school student - together!. Not only are guns fun but the customer service is AWESOME. I had a minor problem with one of the guns and they completely fixed the problem quickly and efficiently. Can't rave enough about the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "The pre-teens loved these",
      "text": "A birthday present for my grandson and granddaughter, ages 12 and 10. They loved these toys (1 set each so each could have a friend play as well.) Each laser tag pistol has 4 settings of color (four team differentiation) allowing for 2 teams or 4 individual players. Lots of fun in the backyard, day and night. A player aims for the target on the gun, which somewhat appeases the pacifist I am at heart.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "So far so good! Bought two pairs during a flash sale after ...",
      "text": "So far so good! Bought two pairs during a flash sale after watching them for a while and it's worth the money. Most of the other models were much more expensive and we need at least four. Really easy to use so our five year olds can play with the big kids! Switiching teams and guns is easy to figure out. They Have used them a few times and haven't had any problems and batteries are still going. I'd be a little worried about if they get wet while the kids are outside because they don't seem waterproof but, that's under our control. Really happy with them so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly I.",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "This laser tag set is a great deal, the guns itself are pretty durable and ...",
      "text": "This laser tag set is a great deal, the guns itself are pretty durable and seem sturdy and would take a beating. My son loves this and we were having a blast with it during Christmas. I had to contact customer service because one of the guns seemed like it wouldnt register a hit, I contact customer support and they were very helpful. I love a company who stands behind their product with amazing customer server, I will def be buying more of these and letting everyone know these are a great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "INCREDBLE!",
      "text": "2 years later and these are STILL going strong. The battery life is great and the options on these guns is incredible. We purchased 6 total and what a hit. When friends come over the kids head outside and get great exercise playing with these. I highly recommend them. We bought the extended warranty but haven't had to use it yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin B.",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Lots of fun to have a shootout with my boys",
      "text": "Lots of fun to have a shootout with my boys. However It is only possible to hit the gun while someone is firing at you, so everyone has to agree to not just play defense the whole time. More sensors would have made it better.",
      "rating": 4.0,
      "verified": true,
      "author": "Travis Rice",
      "helpful_votes": 2,
      "publication_date": 20170415
    },
    {
      "title": "They said it's very easy to setup as teams or individuals",
      "text": "My boys (10-11) and nephews (21 yr olds ) have been having a blast with this set. They said it's very easy to setup as teams or individuals, clear at figuring out when you've been hit, can add more sets to play with larger groups (I just order one more set), long range making it possible to use outside and in. So far it seems like a very fun toy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Voorn",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Best Laser Tag Yet!",
      "text": "These continue to kick butt! I originally purchased a large lot of these for after-school clubs and they have held up over time. They seem to be well manufactured and the seller stands behind the product. Buy the 2-pack sets to save over the 4-pack cost as they all work together regardless. Definitely recommend and would/will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20170201
    },
    {
      "title": "God Daughter gift.. yes i know.",
      "text": "She turned 5 this year (2017) and i didn't know what to purchase for my god daughter. once i recalled when i was her age, i had some laser tag game, so i figured she would love it too, considering its just another toy for the kids to play with. as soon as she opened it, which was her last gift, all the kids went nuts and had a ball with them. recommend the 4 pack because two kids playing together is fun but 4 kids playing together is explosive. Enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "Gideon13",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Great product and customer service!",
      "text": "My family and I are very happy with our new laser tags. I have a 6yr and a 10yr old. We play laser tag in either separate teams or sets of two teams. Great way to spend time with the kids when the weather is not so good to play outdoors and when its nice outside. The first set I received had a defect, I contacted the seller and they were able to resend another one. Very happy with the product and the seller. I would definitely recommend buying from this seller and would by more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Wrong brand in box!",
      "text": "Ordered a warehouse deal, received wrong brand in repackaged box. Clearly whoever repackaged at Amazon did not inspect closely. I ordered three sets of these guns and the one set that was a warehouse deal is not dynasty. They are the same as the best choice gun I bought that included a bug. Really lame as these are for a group of cousins and now they aren’t all the same. Only good thing is that they are compatible and they all work so far.",
      "rating": 2.0,
      "verified": true,
      "author": "Popebobfan",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "What a big hit during the Christmas party",
      "text": "Grandkids loved them and played with them almost none stop for a couple days. Well worth the money just for that. With 7 grandkids going crazy over them, they only lasted a couple days. Wish they had lasted longer, but felt they were a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenny Morris",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "These things are awesome! My boys and their friends absolutely love these",
      "text": "These things are awesome! My boys and their friends absolutely love these! They're a great alternative to the nerf gun battles we have since they can 'get' each other without the nerf darts flying as their faces and the darts ALL over my house and yard. My boys are currently 5 and 9. And both their friends, (and dad's), use these regularly!",
      "rating": 4.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "OMG- love these",
      "text": "I’m not sure who enjoyed these more- the kids or me?! Love the fact they don’t require separate sensors. Very fun for the whole family. They also come in very high quality boxes that can be used to safely store them, almost like a gun case. Better than 5-stars!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Shuey",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "It is cool how the gun vibrates so you know you are ...",
      "text": "I got this as an x-mas gift for my 7 year old and he loves it. His older brother and him play with it all the time. It is cool how the gun vibrates so you know you are hit. They shut the lights out in the house and go for it, lol! They have great fun with this toy!",
      "rating": 5.0,
      "verified": true,
      "author": "MommyTigerOf2Cubs",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "Laser tag fun! They blow away any other laser tag guns we have tried.",
      "text": "Absolute blast, work well night or day Battery life is excellent 2 different physical sizes so if you have younger kids get the small ones but they can use the big ones as well. I have purchased 4 little ones and 3 big ones. They have seen a lot use. I've bought 2 sets and thinking about a third.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "laser guns",
      "text": "Bought these based on a recommendation of a friend. Worked beautifully. Took 6 younger teenage boys to a park and they had so much fun. Made 2 teams of 3 and then 3 teams of 2 and rearranged the teams. Had so much fun a couple asked where I got them.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa J.",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "High quality product for laser tag fun!",
      "text": "We purchased five sets of these laser guns for my sons 10th birthday party. They were a huge hit! Guns work well, can be set to four distinct teams (red, blue, green, and white - as indicated by a light on the Barrell), have four different weapon settings, and life bars to let you know when you have been hit.",
      "rating": 5.0,
      "verified": true,
      "author": "HSNV A.",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "He is pretty discriminating with his toys and he says these are ...",
      "text": "My 8 year old grandson totally loves these. His Dad plans to get another couple packs so friends can team up. After trying other types with vests, he prefers these. He also loves the sounds they make and the change in range for different choices of shooting. He is pretty discriminating with his toys and he says these are \"Awesome!\"",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Casey",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Good looking but 1 gun didn't work - poor quality control",
      "text": "Good looking - solid feel but item defective when received. I received two laser tag guns in excellent packaging. My son was so excited to open and play on his birthday morning - the white gun would not work - did not turn on despite many attempts and confirming 4 sets of new batteries and configurations were correct. It was disappointing as this was the big birthday gift for a year old. I will say the Blue gun that worked had a good feel, sound and apparently has several multi-player modes but not too useful as a 1 player game.",
      "rating": 2.0,
      "verified": true,
      "author": "D P Atlanta",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Cool guns, great gifts",
      "text": "I bought 3 sets of these for the grand kids christmas and have only secretly checked them out. They appear to be pretty good quality and function well. One cool feature is you set each gun to one of four team colors and it knows the difference between teams. Guns on the same team cannot shoot each other by accident. I am pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Call",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Guns malfunction 2 months",
      "text": "I should have trusted the reviews. Got these guns for my kids for Christmas. They played with them on an off for a Month they liked the sounds effexts the gun overall ia cool looking. They put them down for a while picked them up again about a month later and they recently wanted ti playbwith them again and they don't work any more. They get stuck and won't work. the return window is 30 days but they start to malfunction after that so there goes your money",
      "rating": 1.0,
      "verified": true,
      "author": "Ivan Rangel",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great toys",
      "text": "The kids love these and they are compatible with other guns that look similar that we now have. I like the team functions and the different kinds of damage the different settings allow for.",
      "rating": 5.0,
      "verified": true,
      "author": "Tobin Bacon",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Fun laser Tag",
      "text": "My kids seem to enjoy the guns. They seem to work as expected. The screws for the battery department broke on 2 of the guns right away and I had to super glue it back together.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Great fun for all",
      "text": "Grandkids love them. I bought three 2 gun sets cheaper then one 4 gun set and a 2 gun set. One set had a gun that would not turn on so I got online and contacted Amazon who sent a replacement and return info very easy. This is why I shop Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "GIMPER",
      "helpful_votes": 2,
      "publication_date": 20170130
    },
    {
      "title": "Good set of laser guns",
      "text": "Good set of laser guns. Lots of options on the gun itself. You can have up to four teams and there are four different types of guns settings that you can pick from. Very cool. Only downside the on off switch feels flimsy which is what you use to reset the gun after you have been killed, but I have had no problems with the guns that I order. I would recommend highly",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. B",
      "helpful_votes": 2,
      "publication_date": 20160212
    },
    {
      "title": "He absolutely loved them! The only reason I did not give ...",
      "text": "Purchased this set for my 7 year old son for Christmas. He absolutely loved them! The only reason I did not give this toy 5 stars is because the targets are on the sides of the guns and very difficult to hit the target. You must be at a side angle, which means you are in motion or not facing the gun at your opponent. Other then that, the case is super cool and of great quality. So are the guns. Very easy for my 7 year old to change the gun settings and to reload.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Great fun with the kids!",
      "text": "I purchased 3 sets. Kids and I have been having a blast with them. 1 of the guns Out of the 6 didn’t vibrate like the rest. Couldn’t troubleshoot the issue but was able to return without any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Buyer beware!!",
      "text": "Do not purchase this! They are cheap. Second one we bought. Both came broken. Be warned.",
      "rating": 1.0,
      "verified": true,
      "author": "HJ",
      "helpful_votes": 5,
      "publication_date": 20161230
    },
    {
      "title": "Fun For the Whole Family",
      "text": "Very fun set. My 8 and 6 year love it. My 3.5 year old has fun even though she can't really aim yet. My wife and I also love playing with the kids. We initially bought the 4 pack, but we loved it so much, we decided to get 2 more. Not a complaint, but I agree with other reviewers that it can eat through the 4 AA batteries per gun. I recommend buying rechargeable batteries (and a charger). Plenty of options.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Sun",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Laser TAG-FAIL",
      "text": "I took my boys to a indoor laser center. We got home, and they wanted to go back. I said, why don't we see if we can buy a pair. I bought these after the reviews. It came in an attractive box, and it asked for 4 AA's. I put in brand new batteries. DEAD.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Not too shabby",
      "text": "Neat little toys, kids loved them until one of them broke after falling to the ground. Not the most rugged or durable toy - better suited for older kids.",
      "rating": 4.0,
      "verified": true,
      "author": "TheLion©",
      "helpful_votes": 2,
      "publication_date": 20170217
    },
    {
      "title": "My how far we have come from the 80's",
      "text": "My family bought this set and the set with the Nano Bug. The guns are amazing. When my wife first mentioned them to me I was skeptical. Having grown up with 1980's versions I wasn't expecting much truthfully. I couldn't be more pleased with them. The range is awesome, they have four different firing modes that seem to change how you play in a \"tactical\" sense, they vibrate, and light up. It honestly brings me back to my childhood, and this time the guns actually work!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason C Nardi",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Sooooooo fun!",
      "text": "Be sure to read the directions so you know what the different settings/options are. We have so much fun with these guns and the price is unbeatable!",
      "rating": 5.0,
      "verified": true,
      "author": "jlc",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Laser Tag in the house is fun",
      "text": "Received these for Christmas, have a great time running around the house tagging each other. Quality is good but power on/power off switch is already loose on one of them so hope that does not go out, for something used so much it could be better. Price is pretty high too but comes in a nice case.",
      "rating": 4.0,
      "verified": true,
      "author": "C2Computer",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "BEST toy!",
      "text": "BEST toy!!! My boys love to play Nerf guns wars- but this takes it to a new level! The guns are made well and easy for my 10, 8, 5 and even 2 year old to hold and shoot. My husband plays too and has fun. The lasers ricochet off walls though- so be careful when you hide your gun behind your body because it can still receive a damage. Batteries last long and have hours of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "LoriMatt",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "These laser guns are the best. I bought 2 sets for my 13 yr ...",
      "text": "These laser guns are the best. I bought 2 sets for my 13 yr old grandson for his birthday! My 7 yr old grandson loved them as well and purchased a set of his own using his own allowance! Lots of fun! They take 4 AA batteries for each gun. Well worth it! Hours of fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb's Granny",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Grandson loved them!",
      "text": "So far so good.. the grandson needed something to get him away from screens he and his friends play outside when they are around so it worked for what I wanted them for!",
      "rating": 5.0,
      "verified": true,
      "author": "Master of none",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Not worth $45 a piece",
      "text": "I have to say, so far so good, but it's only been a few days... I bought these back in November at 59.99 I think...and now they are 89.99...that's a little ridiculous to me. Money hungry companies taking advantage of us hard working folks for the holiday season. Happy new year 🙈🙉🙊 also, not worth $45 a piece",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Lots of fun.. rented professional kid laser party for son's ...",
      "text": "Lots of fun..rented professional kid laser party for son's 10th and got this set for home use...awesome. very sturdy, cool settings can do teams or no teams. We do 3 against 1 if little kids play an older. Or every man for himself. We bought 2 2 packs instead of the 4 b/c it priced out better. Kids love them. Work well in day outside too...are noisey so if in a neighborhood keep in mind at night neighbors will be tired of it after a few hours because kids can go all night.",
      "rating": 5.0,
      "verified": true,
      "author": "Adventure Mom",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "Great Fun for anyone",
      "text": "Definitely worth the money. Love the features from selecting between four different gun types and four different teams. Would definitely buy this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Lear",
      "helpful_votes": 2,
      "publication_date": 20161129
    },
    {
      "title": "How do I contact the seller?",
      "text": "One gun isn’t working after a few uses. It turns on but doesn’t acknowledge a hit. I need to contact the seller. Thanks",
      "rating": 2.0,
      "verified": true,
      "author": "typer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "These are so much fun! Got them for my son",
      "text": "These are so much fun! Got them for my son, but I enjoy them as well. I gave them 4 stars because one of the team mode lights on one of the guns is already not working. It's not a huge deal because there are four or so team colors to choose from.",
      "rating": 4.0,
      "verified": true,
      "author": "Sammy G.",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Ordered 2 of these (4 guns) and (2 guns)  didn't work!",
      "text": "Maybe we just had bad luck but I bought two of these sets and one gun in each set was broken. I was very disappointed. When I realized that one gun didn't work (tried new batteries , then more new batteries). I can understand one gun being defective, but when I had 2 of 4 guns arrive defective I decided to just get my money back. Please note that the guns arrived defective and we didn't even have a chance to use them.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey W.",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Very easy to use",
      "text": "Very easy to use. Makes better sense to purchase multiple packs of these for $50 rather than the four for $150. We bought seven packs of these and they all interacted well. The case they come in are pretty cool as well. Our youth group had a blast using them this last weekend.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Griffith",
      "helpful_votes": 3,
      "publication_date": 20170307
    },
    {
      "title": "Fun times",
      "text": "Birthday present for my son. He asked for another advertised brand. But those require wearing other equipment that can get broken or lost. This set is easy to use and capable of being expanded. He loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Strait",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Fun and Safe",
      "text": "This is an awesome toys. We have so much fun to play them as a family. I love the fact that I don't have to worry about my 4-year-old daughter would get hit in the eye with physical darts like the nerf guns’ darts.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Not worth the money.",
      "text": "10 & 12 year old grandsons weren't impressed. Gave it to them for Christmas and they were excited when opened. Case & guns looked cool but after a week they were done with them. Sometimes didn't respond when hit and overall pretty unexciting.",
      "rating": 2.0,
      "verified": true,
      "author": "Grandma of 9",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Lots of fun with my eight year old son!!!",
      "text": "Lots of fun to play with my son who loves laser tag. No vests come with the set. The target is on the blaster. Also teams are set through the blaster. There are also 4 settings on the blaster, pistol, shotgun, machine gun and missle launcher. Each has their own pros and cons. You have to tap the bottom of the blaster to reload as well",
      "rating": 4.0,
      "verified": true,
      "author": "timothy.p.marchant",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Great gift",
      "text": "I bought this for my two nephews and it was hours of fun for them! Great Christmas gift and keeps them occupy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Good",
      "text": "Fun guns. I like the gun type selection and health systems. I do wish there was an indicator on the gun of which gun type you currently had selected. One of my guns was defective I contacted seller and they sent me 2 free guns within a day for free. Good customer support. I fully recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert DeBone",
      "helpful_votes": 9,
      "publication_date": 20160814
    },
    {
      "title": "They work well and the kids love them. Really nice quality",
      "text": "These are absolutely a blast. They work well and the kids love them. Really nice quality. I wasn't sure about the high price tag on them but after getting them and using them they are worth it. The only flaw I could find is that the on/off switch feels cheap and feels like it may break soon. This is the reason for 4 stars instead of 5 other than that, it's a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Enjoying fun with your kids",
      "text": "My grand daughter has been playing with her tag set for months",
      "rating": 5.0,
      "verified": true,
      "author": "harry",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "So much fun!!!",
      "text": "I VERY rarely write reviews. But I was so impressed with the customer service provided, I had to say something! First, the laser guns are a blast! We have 6 people in our family and we all get into playing together! Lots of fun for the whole group! And second, we had an issue arise, and this company's customer service could not have been any better! Top notch! I would not hesitate to buy again from them! Five stars all around!",
      "rating": 5.0,
      "verified": true,
      "author": "Fabian Waldner",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "So much fun!",
      "text": "We are going to get more to add to our collection! My 8yr old is having a great time with it!! Love how it is just the gun and nothing more to wear etc.",
      "rating": 5.0,
      "verified": true,
      "author": "JPCap",
      "helpful_votes": 2,
      "publication_date": 20170218
    },
    {
      "title": "Looks cool but huh?",
      "text": "We have no idea how to use these, came with no instructions and my 15 yr old extremely tech-savy son can't figure it out. Where do you shoot? No matter where on the gun we shoot at and we've tried everywhere, we dont lose any life bars- if someone could help it would be much appreciated!",
      "rating": 3.0,
      "verified": true,
      "author": "TabWar",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "A blast",
      "text": "If your looking for battle tag by UniSoft, it's not available anymore. This is not as sophisticated, but the kids (and I) still have a lot of fun with it. If day it's the best of the lot you can find on Amazon right now.",
      "rating": 5.0,
      "verified": true,
      "author": "Riverview",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "my 9 and 6 yrs old absolutely love this. We have 6 of these now",
      "text": "my 9 and 6 yrs old absolutely love this. We have 6 of these now, none of them broke after several parties with similar age kids. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Juninou",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Kid loves it!",
      "text": "My kid and I have gotten hours and hours of enjoyment out of these laser tag guns.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "My kids have so much fun with these",
      "text": "My kids have so much fun with these. The power switch malfunctioned on one after about 5 uses. I contacted the seller and they immediately sent me 2 new ones. Great customer services. Will consider buying more for when friends come over.",
      "rating": 5.0,
      "verified": true,
      "author": "Joni Wilson",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Not just for kids.",
      "text": "Got 3 sets as gifts for my son , son in law and myself. The guns work great ! We ran around until 1:00am having battles and the range was perfect. Like the different gun sounds and how the they vibrate.had no issues at all. Big hit with the family!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170101
    },
    {
      "title": "Fun toy. Easy to play tag.",
      "text": "Liked it. Was a fun toy. Bought for one set of kids..this one is for my other nephew for his birthday.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannette A. Douget",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "This is by far my favorite one of my sons toys",
      "text": "This is by far my favorite one of my sons toys . I think I might like it more than he does .",
      "rating": 5.0,
      "verified": true,
      "author": "marisa",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "... later in the year i did find them quite sturdy..",
      "text": "as tthey are a birthday gift for later in the year i did find them quite sturdy...should be fun!",
      "rating": 5.0,
      "verified": true,
      "author": "ronniedomino",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Great laser tag guns!!",
      "text": "These guns are so much fun. Got them for each of my kids families for Christmas and they loved them! Even the parents got involved with using them. Would recommend them for anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "abbysmom72",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Great fun to be had!",
      "text": "We got these for Christmas for our boys to play with (bought 8 guns in total) and it has been so fun. We have had a blast playing it and have impromptu games as well as massive battles. The guns are comfortable to hold and aren’t heavy. They are very easy to use. Only draw back is 4 battery’s per gun. But worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "j",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "great gift",
      "text": "very nice, kids really enjoyed it, as well as the big kids in the room. lights up, sound effect are cool, and the missles sound amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "TH",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Worth it",
      "text": "Work good. Haven't tested range yet, but inside they're good. Can't figure out how to reset and keep your team color, but I haven't tried looking it up (instructions don't say). Kids like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Cleveland",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Great",
      "text": "Really good product got this for my 6 and 7 year old boys they love it range is really far everything works just like described works day or night would recommend for anyone",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "--The kids love them. They play all the time now",
      "text": "My son wanted to go play lasertag for his birthday party. After looking at how expensive playing laser tag is, I decided to buy these. Pros: --The kids love them. They play all the time now. --The cost of paying to play laser tag twice in a commercial establishment will pay for a set of these. Cons: --Price seemed a bit high to me. In my mind they are glorified toy guns, although I'm sure there is quite a bit of electronics needed internally to keep track of how many times you've been hit, number of shots left, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Mitchell",
      "helpful_votes": 5,
      "publication_date": 20170303
    },
    {
      "title": "Freaking hrs of fun for kids and adults",
      "text": "Best kids toy we have bought in a long time. Anytime my son plays with another kid they want this set Soo bad. We want to buy one more for the whole family to have one.highly recommend this set!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheya J Edson",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "These are so much fun!",
      "text": "These are so much fun! We order 2 sets and so far my kids ages 10,7 and 5 have played with them at 2 birthday parties and about every other night with all the neighbor kids. It's a huge hit! I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Recob",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Fun",
      "text": "This is my third set for my kids and their friends. When we have friends gathering, all kids play together. By themselves. Leave all adults to enjoy party.",
      "rating": 5.0,
      "verified": true,
      "author": "infiniteLoop21",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Love these so much we now have 8",
      "text": "Love these so much we now have 8.. awesome friends and family time... when your bored it perfect. When u wanna spice things up its perfect. Great way to get the kids to be off their electronic devices.",
      "rating": 5.0,
      "verified": true,
      "author": "vernon patmon",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "love love love these",
      "text": "love love love these! Everyone has fun with these adults and kids alike! We bought the little spiders with them and its a blast letting them run around the house and shooting them!",
      "rating": 5.0,
      "verified": true,
      "author": "Breean Bohlig",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Love them! My three boys have played with them ...",
      "text": "Love them! My three boys have played with them every day for a month now. Their ages are eight years old five years old and one-year-old. We have family laser tag nights and pretty much every night. Batteries are still going good and none of the guns have any issues. I would highly recommend these for boys and families!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "AWESOME PRODUCT. YOU WON'T BE DISAPPOINTED",
      "text": "This product is amazing! Super easy to function. Effective and durable. Both parents and kids love them. They do take a lot of batteries, but they seem to last a long time. We purchased 8 of these and hosted our son's 8th birthday party and everyone had a blast. Highly highly recommended if you are in the market for a good home laser tag unit. Get enough guns for friends to play!",
      "rating": 5.0,
      "verified": true,
      "author": "MemberSince",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "These are so much fun! I bought these for my husband and I ...",
      "text": "These are so much fun! I bought these for my husband and I and we plan to buy them for more of our family. I love that they have a place to go once we've finished with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Five Stars",
      "text": "My niece and nephew loved it! I'm the new favorite aunt!",
      "rating": 5.0,
      "verified": true,
      "author": "amazonaddict",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Great gift",
      "text": "We should have gotten a 4 pack for family fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Martindale",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Fun!",
      "text": "So much fun!!! I had just as much fun playing with these as my kids. They have been a big hit. Easy to use, tuns of different guns that have different kill/damage power. Can do teams if you have more than two guns.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Perfect boys gift!!!",
      "text": "I was looking to an alternative to net guns!!!! I have 3 boys and got tired of stepping on those dang bullets!!! They love these. Very fun and interactive. They can get a little loud inside but it will be perfect for outside when the weather warms up!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie G.",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Nice, work well, many options",
      "text": "Nice, work well with varying degrees of options for power, teams. Only used indoor, so cant comment on outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Worth it",
      "text": "These things rock we have had them for a year now. Used and abused we still play with them. They have been wet, dried them out and still going strong. Well worth every penny. Thing I like the most is it's all in one so no chest piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Malcolm",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Fun for the whole family.",
      "text": "Son bought these laser tags guns for him and and his son. They have a blast with them hiding behind things trying to get each other. They work great.",
      "rating": 5.0,
      "verified": true,
      "author": "sunshine162dlc",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "If you want a 6yo to lose his sh...",
      "text": "Especially if he/she has siblings. They took a little figuring out, but once we knew what we were doing the kids had a blast.",
      "rating": 5.0,
      "verified": true,
      "author": "Suenicorn",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Boys loved them",
      "text": "Great birthday gift for our 5 and 7 year olds, however only one works like its supposed to. Both do make noise, but only one tallies the shots.",
      "rating": 4.0,
      "verified": true,
      "author": "annabelle02",
      "helpful_votes": 2,
      "publication_date": 20160812
    },
    {
      "title": "Lots of bang for your buck!",
      "text": "Super fast delivery!... Great guns... We put ours on lanyards to keep them off the floor!... I'm a repeat buyer... I have 12 in all.... Seller is fast an friendly!!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "Real world problems",
      "text": "These are the bomb. Now if my kids would jistnget off the iPad and use them it would be great.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Very nice toy - not much used",
      "text": "Very good product. No issues with quality. But kids seem to loose interest. Not much used. Don't know why.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Great to get the kids Outside!",
      "text": "Super fun laser tag! The guns feel sturdy, not at all cheap or that they'd break easily. Love the options for multiple teams and players. Great way to get the kids outside and MOVING! Customer service was amazing, as well.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Mullen",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Oh what fun!!!!!",
      "text": "Oh man these are fun. We have not put these down since we opened them. I bought 2 sets so we can have a 4 way Lazer Tag battle and they are amazing. Took to the beach and had so much fun. Highly recommended for family's as mom and dad will be just addicted as the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Christina",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Nice idea. Not great quality One gun did not ...",
      "text": "Nice idea. Not great quality One gun did not work- company sent a replacement set. 3 guns worked fine for a while now we’re down to 2",
      "rating": 2.0,
      "verified": true,
      "author": "carrieosu1",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Four Stars",
      "text": "grandkids like these but wanted some kind of tag to wear to show \"hits\"",
      "rating": 4.0,
      "verified": true,
      "author": "becky",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Guns came packaged in a nice carry/storage case",
      "text": "Guns came packaged in a nice carry/storage case. They are a christmas gift but my husband and I got them out and used them to make sure they worked. These are going to be really fun for the kids. Would be a blast if you had a whole group of kids to play tag.",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Fun for the whole family",
      "text": "Bought for my 4 year and 14 year old boys. Both loved them and it keeps them from losing darts all over the house! Fun for the whole family, good quality, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Cool toy",
      "text": "A bit on the expensive side but I guess well worth it. They work great and the kids LOVE them. I might have to purchase another set in the near future because the adults enjoy them too. They do seem to kill batteries fast though. Or maybe we just use ours too much?",
      "rating": 5.0,
      "verified": true,
      "author": "Kira",
      "helpful_votes": 0,
      "publication_date": 20170112
    }
  ],
  "product_meta": {
    "title": "DYNASTY TOYS Family Games Laser Tag Set and Carrying Case - Blue/White Laser Tag Blasters for Birthday Parties and Family Events (2 Pack)",
    "description": "BATTLE PACK with model T1504. Dynasty Toys presents The Premium Multiplayer Laser Tag Experience. Capable of a laser range exceeding 120 feet, and 4 completely unique team settings, players both young and old will enjoy countless hours of Laser Tag Nirvana. Switch between the 4 separate blasters in your arsenal. Each blaster has its own strengths and weaknesses in relation to damage, range, and reload time. Tap the butt of the blaster to reload, and the built in speakers will notify you that your blaster has been reloaded. Your health is located on the side of the blaster, next to the button. Plus, your blaster is the target. Gone are the days of strapping a vest to your body. All you need to play is a group of people and this Laser Tag Set. Please Add to the end of the product description: The infrared (non-visible) lights emitted from the toys are safe for all ages and in conformance with Code of Federal Regulations 21 cfr 1040.10 The toys have been tested by a third-party laser product safety facility and have been determined to emit less than 1mW (.0496mW) power output. The toys do not exceed Class 1 Laser Product Limits. The toys emit a safe and non-visible infrared light, much like the lights used in a garage door opener or tv remote. No eye-protection needed. This product is 100% safe for all ages.",
    "rating": 4.4,
    "feature_bullets": [
      "BATTLE PACK with model T1504",
      "The blaster is the target. Meaning you don't need to wear a vest! Plus there are 4 different Teams to choose from!",
      "Both the TEAM SETTINGS and BLAST SETTINGS are interchangeable on each blaster and can be set on the go.",
      "Set Includes 2 Laser Tag Blasters (1 Blue and 1 White Blaster)",
      "This is a certified child safe class 1 laser product with less than 1mW output (.0496mW)."
    ],
    "specifications": {
      "Product Dimensions": "14.6 x 11.3 x 4.4 inches",
      "Item Weight": "1.46 pounds",
      "ASIN": "B019XE4L4O",
      "Manufacturer recommended age": "4 years and up",
      "Best Sellers Rank": "#93,735 in Toys & Games",
      "Customer Reviews": "4.4 out of 5 stars609 ratings4.4 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "4 year and up",
      "Manufacturer": "DYNASTY TOYS"
    },
    "categories": [
      "Dress Up & Pretend Play",
      "Pretend Play",
      "Toys & Games"
    ],
    "price": ""
  }
}