{
  "website_summaries": [
    {
      "verdict": "Another extra-large beer pong float offering lasting durability alongside helpful features.",
      "pros": [
        "Comes with five pong balls",
        "Crafted from extra-thick, scratch- and tear-resistant material",
        "Holds up to 28 cups as well as pong balls",
        "Can be used as a pool float"
      ],
      "cons": [
        "Customer service could be better",
        "Deflates more easily than other models"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Defective",
      "text": "Ok as brief as can be It leaked the day I got it. The company’s only response was you got a repair kit, Fix it ! For $33 I don’t think I should have to do that the first day it get it. Not made up to the quality that I expected for the cost!",
      "rating": 1.0,
      "verified": true,
      "author": "RH",
      "helpful_votes": 5,
      "publication_date": 20180123
    },
    {
      "title": "Huge Pool Party Hit!",
      "text": "Want to get the party started? Bring this out and its on like Donkey Kong! Young and Old alike enjoyed playing beer pong in the last two pool parties I hosted. Inflates easily with my air compressor (Don't attempt to do it manually!), seems to be sturdy enough construction, so far no leaks and its been used quite heavily. Not using it for the float option - just the beer pong table option. If your pool parties aren't any fun, get one of these and kick them up a notch! You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Traveler13",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Received defective",
      "text": "One of the cup holes was cut incorrectly, it was visibly too small for the cup. Jamming a cup in there didn't really work. This obviously was detrimental to the whole operation and had to be sent back. Seller only had option for refund when returning, else I would have given it another chance. I will try another brand next.",
      "rating": 1.0,
      "verified": true,
      "author": "Rusty Shackleford",
      "helpful_votes": 5,
      "publication_date": 20160802
    },
    {
      "title": "Holes too far apart",
      "text": "It works Fine and is aa advertised. The shipping was fast. The only problem is that the holes for the cups are too far apart. There is maybe an inch or more between the top of the cups when using red solo cups which makes the game much more difficult. I have played on other inflatable tables that do not have this problem and would recommend purchasing a different one.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 8,
      "publication_date": 20160912
    },
    {
      "title": "Cool product!",
      "text": "This is a cool product, I mean, you can take it to the pool, the lake, the beach... or like I did with my friend on a boring night, play it in the living room! haha Obviously if you play it on \"dry land\" it's going to be a little bit more of a pain because when the ping pong balls hit the \"table\" they bounce all over the place, so being in a body of water helps keep them close since they won't hit the ground and bounce away. Needless to say, we had a blast!! It's beer pong... you kinda know you're going to have fun ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Raquel P.",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "This float is horrible!! It doesn't hold air and hasn't since ...",
      "text": "This float is horrible!! It doesn't hold air and hasn't since the first inflation. Additionally, you cannot return it via Amazon! Worst purchase I have ever made on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "John Gessman",
      "helpful_votes": 5,
      "publication_date": 20171004
    },
    {
      "title": "Came with holes",
      "text": "Right out of the box this float came with 3 holes. Very disappointed as I did not open prior to when I needed to test it out.",
      "rating": 1.0,
      "verified": true,
      "author": "CP",
      "helpful_votes": 4,
      "publication_date": 20180316
    },
    {
      "title": "e inches apart on the table but still a very fun game to have around if you like this game ...",
      "text": "Decent Table. High quality material. Biggest complaint would be how spread out the cups are making it quite a difficult game because cups are always a coup,e inches apart on the table but still a very fun game to have around if you like this game and like swimming.",
      "rating": 4.0,
      "verified": true,
      "author": "Jumbo757&Becca",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Holes are too far apart",
      "text": "So hard to score because the whole are far apart! It would’ve been better if they just left one triangle to put all the cups together instead of separate holes. Did not enjoy",
      "rating": 1.0,
      "verified": true,
      "author": "R.S",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Got it for Cabo and left it there.",
      "text": "It worked well enough for a pool party and that is why I got it. It works. enough said",
      "rating": 5.0,
      "verified": true,
      "author": "Mister Meep",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Will buy again.",
      "text": "Very sturdy. Unfortunately didn’t get a chance to use it. Our loving shepherd dog tore a nice hole in the side while we were cleaning the pool. Will order a replacement soon.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Keplinger",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Doesnt Hold Air",
      "text": "Keeps loosing air - I have filled it 4 times and a day later its deflated enough that I need to fill it again. Very fun game, we all love it, just wish it was built better",
      "rating": 3.0,
      "verified": true,
      "author": "anthony hearn",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Great quality! Very fun",
      "text": "So much fun!! It looks exactly as pictured and works great! The material is quite thick so not too worried that it'll get punctured easily. I love that it comes with the ping pong balls and materials to patch a hole if one does happen.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen khan",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "White girl wasted float",
      "text": "Ordered this for a pool party. As expected it was a hit. Very durable in the water and acts nicely as a cup holder while you swim. Everyone couldn't wait to get in the pool and get white girl wasted playing beer pong",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "This raft wouldn't inflate all the way! Definitely not ...",
      "text": "This raft wouldn't inflate all the way! Definitely not worth the purchase as we could hardly use it to play pong.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170702
    },
    {
      "title": "Good quality and obviously a lot of fun!",
      "text": "Love my pool beer pong and it’s alwats the hit of any pool party.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy C.",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Three Stars",
      "text": "the space between the cups is not like the normal game, but is well made",
      "rating": 3.0,
      "verified": true,
      "author": "dogowner",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Sweet summertime",
      "text": "This was the staple of our summer. We never took the boat out without it, and had people flock to us to play. Sturdy and floats well. Forgot the electric pump a couple times, yet still wasn't CRAZY hard to blow up using the ole lungs. Cup holders are reinforced well and the additional side drink holders are nice when in need of a refill (which I DON'T recommend doing in lake water, BTW... Just shew). Much better quality than any others we've seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica T",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "Buy this one. It's great!",
      "text": "This is a great product. We use it often and it even comes with ping pong balls. Stays inflated, sturdy, and well worth it! The extra cup holders on the side are great. Much better than the versions you see in Target/Dicks",
      "rating": 5.0,
      "verified": true,
      "author": "Cayce C.",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Play platoon doesn’t hold air cause of ripped seams",
      "text": "Had holes in it. Couldn’t inflate while on vacation in Mexico",
      "rating": 1.0,
      "verified": true,
      "author": "karen liscom",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "good packaging, filled it up with a compressor",
      "text": "arrived on time, good packaging, filled it up with a compressor, played in the lake...just be careful of the water mixing with the beer. but the product is solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim H.",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Other than that it's great. Not good for bouncing though",
      "text": "Didn't consider the fact that the cups are spaced from each other. Other than that it's great. Not good for bouncing though. It's great quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Four Stars",
      "text": "Awesome addition to our pool. Only wish the cup holders were closer together. Great quality other than that.",
      "rating": 4.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "What a great idea, I love it",
      "text": "What a great idea, I love it! It is made of a very thick vinyl so I believe it will be worth every cent :-) Delivered quickly as promised.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Santos",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "great for pool parties.",
      "text": "It is wide enough to be a very comfortable body float as well as a beer pong table. I have had many people ask me where they can buy it too!",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "The box came banged up",
      "text": "The box came banged up and I am giving this product as a gift so that sucks. Hopefully, the raft works well. I guess we will find out in the Spring.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161208
    },
    {
      "title": "Durable water fun with no mess to clean up!",
      "text": "Brought this to a family reunion. It was a big hit!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura A.",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Cup holder deformity",
      "text": "This product came with one of the cupholders slightly deformed. This wouldn’t be an issue, but because of the deformity, it had a hole in that deformity. Disappointing for the amount of money it cost.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert Michael",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Five Stars",
      "text": "Tough - durable - very well made - super fun",
      "rating": 5.0,
      "verified": true,
      "author": "Robin West",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "One Star",
      "text": "Great idea poor quality deflated within 24 hours on first use",
      "rating": 1.0,
      "verified": true,
      "author": "Dr M.",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Four Stars",
      "text": "fun, kids wish the cups were closer like in table pong, but still fun in the pool.",
      "rating": 4.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "I felt like I was back in college",
      "text": "Bought this for a recent vacation to Mexico, and it quickly became the hit of the pool at our resort. I think over the course of a week I played 30 games of Beirut, and my kids loved using it too (though obviously not with beer in the cups). It also is a well crafted raft. I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. Sebell",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Love it",
      "text": "This is my second float- we loved the first one so much that we bought one to take on vacation!",
      "rating": 5.0,
      "verified": true,
      "author": "Ronda S. Toole",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Great gift idea!",
      "text": "Great quality! So much fun! Fast shipping and no problems with leaking!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Todd",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Five Stars",
      "text": "I look forward to playing this in our pool this summer!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle MacMillan",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Lots of fun!",
      "text": "Had a lot of fun using this product this summer in the pool!",
      "rating": 5.0,
      "verified": true,
      "author": "Benise",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Perfect for a great weekend addition in the pool.",
      "text": "Great product! Used for an entire weekend. Construction was solid. Bonus of 4’ping pong balls. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin & Becca",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "This is such a fun float/game. When my kids friends are swimming in ...",
      "text": "This is such a fun float/game. When my kids friends are swimming in our pool, they fight over it. This year we bought one for each of our four kids so there will not be any more fighting. Shipped quickly!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklyn Clawson",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Five Stars",
      "text": "Fun, good quality, bigger than what you can get in stores!",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "It is a great float! Perfect size and lots of fun",
      "text": "It is a great float! Perfect size and lots of fun! It was suppose to come with ping pong balls but didn't.",
      "rating": 4.0,
      "verified": true,
      "author": "Sholette",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Pong Balls not included.",
      "text": "Float was good. But did not come with the 5 balls that are marketed to come with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Abby Crowell",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "I inflated this with the hopes of playing beer pong ...",
      "text": "I inflated this with the hopes of playing beer pong and it holds aid for 20 minutes and deflates filling with water.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Sullivan",
      "helpful_votes": 3,
      "publication_date": 20160607
    },
    {
      "title": "One Star",
      "text": "Blue color ran and product looks awful. Not usable. Used twice. Vendor should replace ASAP.",
      "rating": 1.0,
      "verified": true,
      "author": "amlin",
      "helpful_votes": 3,
      "publication_date": 20170717
    },
    {
      "title": "Five Stars",
      "text": "Great for small parties. Too crazy to play during a large party with swimmers and splashing.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "works great as a pong table and a raft",
      "text": "works great as a pong table and a raft. seams seem strong and comes with a patch kit just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Meyer Brock",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Great product!",
      "text": "Excellent product. Works as advertised. Balls are a thicker plastic and slightly textured which adapts very well to outdoor pool pong.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Kate ",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Fun product",
      "text": "My friends enjoyed it last summer and we will again this summer! Inflated just fine and all red solo cups fit perfectly I'm the holes.",
      "rating": 5.0,
      "verified": true,
      "author": "Shmeep",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "... as to not contaminate the pool and it worked great!",
      "text": "Used water instead of beer so as to not contaminate the pool and it worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Awesome For the Pool",
      "text": "This float works great for Pool Beer Pong. We've had lots of fun playing. I've had it for several months and it's held up great.",
      "rating": 5.0,
      "verified": true,
      "author": "jad2013",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Definitely recommend this can't wait to try out some more water toys",
      "text": "Fun fun fun this game has been the biggest hit in our pool and on our lake at The Sandbar all the boats around us what everyone wants to join in the fun and play",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley B",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Great product for a good price",
      "text": "Great product for a good price. Just wanted something simple to use on the lake, this is just what we were looking for. Plus, it makes a great float for a person when not using for pong :)",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole C.",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Great on the Bay",
      "text": "We got this for my husbands birthday to take out on our boat. Works great and we had a lot of fun. Nice having extra cup holders for our drinks too!",
      "rating": 5.0,
      "verified": true,
      "author": "kelly swanson",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "I would give this zero stars if I could. ...",
      "text": "I would give this zero stars if I could. It does not hold air very long, cheaply made. DO NOT BUY THIS! It was useless at the party. Spend the extra $10 and get another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabriella",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Hole in product",
      "text": "Product came with a hole in it. Otherwise would have been exactly what I wanted",
      "rating": 2.0,
      "verified": true,
      "author": "Jimmy21",
      "helpful_votes": 2,
      "publication_date": 20170817
    },
    {
      "title": "Best thing ever",
      "text": "Amazing. All my friends and family wanted one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "christina gonsalves",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Great product",
      "text": "Seems like a great product, even came with a patch kit if it gets a hole! Cant wait to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew M.",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Great!",
      "text": "Love the raft! Its built tough and sturdy. We had a issue, I contacted the seller and within 2 days they had another one on my doorstep. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Fun floaty",
      "text": "The pong floaty worked great and was a great hit at the lake.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Clements",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Great summertime fun",
      "text": "Awesome game for the pool! Sturdy design held up all summer and easy to store for the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "This was perfect! We were the life of the party at ...",
      "text": "This was perfect! We were the life of the party at the Lake.....Played and Played!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "The package arrived very quickly and it looks like it will be great",
      "text": "This was a gift for my daughter and son in law. They are in the process of having a pool put in so it may be awhile before they actually use it. The package arrived very quickly and it looks like it will be great. Looking forward to trying . Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Perfect",
      "text": "I love all of the extra cup holders and that it has a slot to hold the balls as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Five Stars",
      "text": "Perfect size and very sturdy product. Came exactly as advertised. Will order from this company again.",
      "rating": 5.0,
      "verified": true,
      "author": "FLmom",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Cooperstown fun!!!",
      "text": "We had so much with this, highly suggest this item, hours of fun!!",
      "rating": 5.0,
      "verified": true,
      "author": "wendy",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Love it!",
      "text": "Love this raft and game! It’s a great size. Happy with purchase :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lilly Miller",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Awesome!!",
      "text": "I bought this pong float for my sister’s bachelorette party and it is awesome! Such a great float and lots of space for extra cups and even the pong balls, great idea!",
      "rating": 5.0,
      "verified": true,
      "author": "Blair Foxwell",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "We are so excited to try this. We have ...",
      "text": "We are so excited to try this. We have wanted this for some time and Santa delivered!!! Unfortunately we can't use the pool now cause there is snow but you can bet we will have a big family and friend tournament next summer. Time to ski",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Great product",
      "text": "Great product. Easy to fill. Easy to use. It’s holding up much better than the last one I bought.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "FUN!",
      "text": "high quality, lots of fun. Delivered on time and in perfect condition",
      "rating": 4.0,
      "verified": true,
      "author": "miranda",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "OBSESSED",
      "text": "This thing kicked A**. Perfect for floating and playing at our bachelorette. Definitely with the $$",
      "rating": 5.0,
      "verified": true,
      "author": "Elena Flores",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "he said that it was the best decision I've ever made",
      "text": "I purchased this to use at a family get together in November so we haven't even opened the box yet... I can tell you that when I told my son I had bought this for the pool party, he said that it was the best decision I've ever made!",
      "rating": 5.0,
      "verified": true,
      "author": "Suzy M",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Five Stars",
      "text": "Christmas gift But it looks great from the photo. Seller shipped very fast .",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Strait",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Fun",
      "text": "Thick durable rubber seems it will hold good, have yet to inflate or use tho",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "GREAT for pool and any summer parties",
      "text": "I transported this to Hawaii for a week long trip and it was such a hit! Held the cups perfectly and enough room for extra beers or drinks. GREAT for pool and any summer parties!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Good quality",
      "text": "Great quality made product. Alot of fun in the pool with friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Blankenship",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "This product =fun!",
      "text": "Great purchase to take to the lake or the pool!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Hannah",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Poor Layout",
      "text": "Dislike the layout of the cups. Cups are spaced too far apart.",
      "rating": 1.0,
      "verified": true,
      "author": "Phil Gillio",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "I love this floatie so much",
      "text": "I love this floatie so much! Its a great height for beer pong, but also I used it as a raft to hang out on and it was perfect. Double use!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "So complete waste of money",
      "text": "First time I used it found out it has a hole in a very awkward spot, making a patch not effective. So complete waste of money. It was fun for about 5 minutes after blowing it up, until all the air came right back out. It's been too long after purchase so I can't return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20160711
    },
    {
      "title": "products arrived on time.",
      "text": "We love the product to be playing in our pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl Ting",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Amazing product",
      "text": "I was very impressed with the quality of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mat Sampson",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Five Stars",
      "text": "Good quality heavy plastic. Had a blast with this item!",
      "rating": 5.0,
      "verified": true,
      "author": "Rob P",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Five Stars",
      "text": "Everyone at the party loved it and wanted to play",
      "rating": 5.0,
      "verified": true,
      "author": "alonzo akins",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "Four Stars",
      "text": "Great product! Just make sure you have a pump to blow it up-- wouldn't have worked otherwise!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Four Stars",
      "text": "Product quality just right for the money. Inflate it and start playing!",
      "rating": 4.0,
      "verified": true,
      "author": "Karen L.",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Five Stars",
      "text": "So much fun for the pool! Works great and also can be used as a raft.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "Great game!",
      "text": "We have one and bought another for a gift. Great game!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Great buy!",
      "text": "Bought it for a pool party and it worked beautifully. Just as described! When you put air into the air intake hole the air doesn't release back out due to a valve allowing the air to remain inside the float which is really convenient to have. Additionally more than enough Cup holes are provided for the game as well as for additional drinks. The cup holes had a tight fit for a regular sized sole cup. This was perfect because the cups stayed in place throughout the game. This was the highlight of the pool party great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Wip",
      "helpful_votes": 2,
      "publication_date": 20160509
    },
    {
      "title": "Wonderful idea and made with top quality",
      "text": "Wonderful idea and made with top quality, however, it is very difficult to shoot. The cups are separated far enough where every cup is an \"Island shot\".",
      "rating": 4.0,
      "verified": true,
      "author": "Nick V.",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "had so much fun. it could not be better",
      "text": "Played it in the pool all weekend. Won all five games I played. had so much fun. it could not be better. Everyone who was here wanted to know where I got it and how to order it.",
      "rating": 5.0,
      "verified": true,
      "author": "someone you dont know???",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Five Stars",
      "text": "This makes for a fun day in the sun. Larger than I thought it would be. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Drew Wenzel",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "If was comfortable to lay on the 15 minutes that it kept ...",
      "text": "Leaked at one of the seams. Comes with patch kit but patches can't stop seam leaks. If was comfortable to lay on the 15 minutes that it kept air in it though.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Helm",
      "helpful_votes": 3,
      "publication_date": 20170609
    },
    {
      "title": "Five Stars",
      "text": "Party goers loved this. The vinyl is not very thin, so it should last awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin C.",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "Five Stars",
      "text": "Highlight at all our pool parties and harder than real beer pong!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Vender",
      "helpful_votes": 0,
      "publication_date": 20170906
    }
  ],
  "product_meta": {
    "title": "Play Platoon H2PONG Inflatable Beer Pong Raft, Includes 5 Ping Pong Balls - Floating Pool Party Game Float Set",
    "rating": 4.3,
    "feature_bullets": [
      "INCLUDES 5 PONG BALLS for hours of crazy beer pong fun.",
      "EXTRA THICK PLASTIC for strength and durability. Scratch and tear resistant.",
      "HOLDS 28 CUPS: 10 cups in each end rack and 4 cups along both sides for socializing.",
      "QUICK & EASY to inflate and deflate so you can get back to partying.",
      "MULTIPLE USES: Doubles as a full size personal pool float."
    ],
    "specifications": {
      "Package Dimensions": "13.9 x 9.8 x 3.9 inches",
      "Item Weight": "4.1 pounds",
      "ASIN": "B019PC59SG",
      "Manufacturer recommended age": "4 years and up",
      "Best Sellers Rank": "#29,330 in Toys & Games",
      "Customer Reviews": "4.3 out of 5 stars158 ratings4.3 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "4 year and up",
      "Manufacturer": "Generic"
    },
    "categories": [
      "Squirt Guns",
      "Pools & Water Toys",
      "Toys & Games",
      "Sports & Outdoor Play"
    ],
    "price": 32.99
  }
}