{
  "website_summaries": [
    {
      "verdict": "Hikers who want to improve their trail game will find the KEEN Oakridge worth checking out. Its excellent grip, lightness, and overall feel didn’t go unnoticed.Despite the good points, this shoe model is also riddled with criticisms especially due to its narrow toe box. Negative points aside, the KEEN Oakridge hiking shoe has enough compelling traits that make it a viable hiking footwear option.",
      "pros": [
        "A majority of buyers praised the excellent fit of the KEEN Oakridge",
        "Scores of wearers loved this lightweight shoe",
        "A significant number of users found this KEEN hiker to be extraordinarily comfortable",
        "Some wearers said that the shoes did not require any breaking in",
        "A bunch of hikers were elated that the gear offered them excellent grip",
        "A couple of users lauded this Keen offering for its versatility",
        "It can be worn for their day-to-day activities, they mentioned",
        "A few wearers whose work and activities entailed getting on their feet for extended hours appreciated the support that the KEEN Oakridge shoe afforded them",
        "A significant number of people said the Oakridge is worth the money they spent",
        "The minority of buyers admired the affordable price of this model"
      ],
      "cons": [
        "The Oakridge's toe box felt narrower than other offerings from the brand, scores of consumers observed",
        "A few online shoppers complained about how poorly made this gear was than the other KEENs they owned",
        "Some owners shared that they needed to continually replace the insoles or use more than one to counter the stiffness",
        "Not many wearers whined about the shoes getting too hot on the feet"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.5,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is a very comfortable shoe. However",
      "text": "This is a very comfortable shoe. However, I'm giving it 3 only stars because the sole has worn out prematurely, in my opinion. Of course, my expectations may be unrealistic. I purchased these shoes in April 2017 and the soles are badly worn - way down into the softer material beneath the sole. I've worn these shoes, on average, perhaps 3x per week. In other words, they've only lasted, at most, 117 or so wearings. Is that typical for hiking shoes?",
      "rating": 3.0,
      "verified": true,
      "author": "Dallas Consumer",
      "helpful_votes": 27,
      "publication_date": 20180109
    },
    {
      "title": "Great shoes.",
      "text": "Purchased for my husband (6'4\", shoe size anywhere from 13-15, depending) who is about impossible to find great looking, comfy, durable shoes for - without obscene price tags. After picking up the taller \"hiking boot\" version of this exact shoe (which work great on our Appalachian Mountain hikes), he decided a lighter weight shoe version of it might work out for his business casual office environment. He usually wears about a 13.5 so ordered a 14 and he says it's a perfect fit, true to size, etc. Comfortable shoe, good quality, and no an obnoxious color pattern. (I think he took a sharpie to that yellow triangle on the toe cap to mute it some.)",
      "rating": 5.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 7,
      "publication_date": 20171001
    },
    {
      "title": "Solid Entry Level Hiker",
      "text": "This is a superb shoe. I have been professionaly measured by Red Wing as an 11M and that is what was purchased and it fit great. My foot is not wide. I tried Several pairs of Merrells and Salomons before going for Keen. This shoe is comfortable, roomy, cool-looking, easily broken in, and not high arched or narrow. These are used for roaming around town, gun range, light hikes, and general mayhem. Worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Outlaw31",
      "helpful_votes": 7,
      "publication_date": 20161110
    },
    {
      "title": "Happy feet",
      "text": "I am a loyal Keen wearer. In recent years I have purchased and worn several styles of Keen shoes for different uses (hiking, water sandals, everyday wear). I like the way Keens fit my somewhat wide feet. The Oakridge shoe fits well right out of the box. It is a nice lightweight shoe. I expect it to be my new every day shoe. I hope this pair holds up well over time. I have experienced shoe fatigue and breakdown with other Keen models, happening sooner than I'd expect from a quality manufacturer of footwear that costs as much as Keen products do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay K.",
      "helpful_votes": 8,
      "publication_date": 20161027
    },
    {
      "title": "Keen never fails to please my flat feet.",
      "text": "Had these anout 9 months. I haven't been able to wear them until the weather became dryer. Be advised, as stated in the description, they're a mesh top and meant for breathability not waterproof like a lot of Keens. I got them for Summer hiking. So far, so good. Like Any Keen I've bought they last pretty well and work wonders for my extremely flat and wide feet. My only wish is that they could be resoled. I feel wasteful having to throw my old ones out, especially my boots, when the upper is still fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Eli L.",
      "helpful_votes": 5,
      "publication_date": 20170809
    },
    {
      "title": "Great comfort but didn't last long",
      "text": "I loved these shoes as soon as bought them. Amazing comfort and ideal support for light hiking and especially for disc golfing. However, defective tears started forming within six months. I reached out to Keen and they were willing to credit me towards a new pair, so that was good. Also, they're not very water resistant. I know they're not a waterproof shoe, but just walking through wet grass they leaked like a pair of Chuck Taylor's",
      "rating": 3.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great for comfort.",
      "text": "This is my husband's third pair of Keen shoes. His previous style is no longer available, so tried these. He loves them and will use his old ones for yard work. There is nothing like the footbed and durability as the Keen shoes! Don't let the price deter you as they will outlast the cheaper ones and end up no more expensive. And your feet will thank you in the meantime. I wish the women's Keen shoes were available in a narrow width! Please consider this. The men's medium is slightly wider than other brands so if you are in between M and W, try the M.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie A. Duke",
      "helpful_votes": 3,
      "publication_date": 20170420
    },
    {
      "title": "Better than Merrell",
      "text": "These are great shoes! I have been wearing the Keen Newport sandals for several years and love them for the summer time use. I bought the Oakridge shoes to wear for the winter when taking dogs for walk, around town and to work on snowy days. The fit is perfect, a little big in the toe box, but nothing I noticed when wearing them. I tried on Merrell's and they were way too narrow and stiff. The Oakridge's are comfortable right out of the box. I thought about the waterproof version, but decided against it, maybe next time. It's nice to have a little color, but not too much and the Raven/Burnt Ochre is exactly that.",
      "rating": 5.0,
      "verified": true,
      "author": "Runningman",
      "helpful_votes": 8,
      "publication_date": 20161216
    },
    {
      "title": "Much better in toes area.",
      "text": "I am going to compare this shoes with \"Vasque Men's Grand Traverse Performance Hiking Shoe,Bungee Cord/Rooibos Tea,11 M\". Vasque designs with narrow toes area, even with 1/2 larger, the Vasque still hurts. I have to return it. I have one \"KEEN Men's Austin Shoe\". My personal problem with Keen Austin is the toes area is too big, too much space (personal preference). And Oakridge's toes area is better and lighter, still a little big for me but but better. I like NB's Fit, and I know it is very personal. Overall, Oakridge is very comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170412
    },
    {
      "title": "Shocked At the Lack of Durability",
      "text": "Within only 8 months of using these shoes (intermittently with others), the material inside the heels wore out completely to the core plastic molding (!?) Without wearing thick mole skin on my heels, now, this plastic molding cuts into my heels and causes blisters/cuts to form. The rest of the shoes are not worn out a bit. Unfortunately, though, the shoes are worthless to me because I can't bear the pain from the heel blisters they now cause ;( My other boot/high top Keens have never given me problems like these do.",
      "rating": 2.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Not sure what any criticisms were about....",
      "text": "the 9.5 regular fit just like a nine and a half with C width should. Keen is a US company and touts made in USA but sometimes \"imported\" is listed. Mine were made in Thailand and, evidently, their QC is excellent. No wide bodied Chinese shoe. Just wore them for a dog walk and were very comfortable. As this is the first day I cannot comment on their durability but they look as durable as my 5.11 coyote 2.0 trainers which I've had for six years and are now discontinued. Just as well as these seem even better.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Rags",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Not good quality",
      "text": "The fit was good. But we have had them for 6 months and they have completely messed up and are busting at the seams. Not a good quality shoe",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie C. Branson",
      "helpful_votes": 10,
      "publication_date": 20170901
    },
    {
      "title": "Not as good at the Waterproof version",
      "text": "I have the Keen Oakridge in a waterproof hightop version and Absolutely Love them. But they are too warm for summer so I ordered this low top non-waterproof version expecting the same great shoe. These new lowtops just aren’t as comfortable, the softness and comfort just isn’t there. My feet feel like they slide forward and cram my toes. I’ve wore them many days trying to break them in but they just don’t live up to the hightops. The waterproof shoes were made in Thailand, these non-waterproof shoes are made in Vietnam.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan g.",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Soles Last 500 miles +",
      "text": "I use these for my morning run on asphalt, gravel and grass and the soles have lasted about 500 miles +. The inner sole was replaced with Scholl 'Workman's' which are still in good shape. The 'leather?' panels on the sides of the toes broke up about 300 miles ago, but served little purpose as these shoes aren't waterproof anyway. The glue holding the black toe flap is about to go, and the heel of one shoe has worn to the putty colored cushion so I've just bought my 2nd pair. Very comfortable for my use and durable.",
      "rating": 4.0,
      "verified": true,
      "author": "C. McPherson",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Good shoe, but fit is a bit small",
      "text": "I ordered these shoes, because I own a pair of Keen boots that are similar in style. These, however, did not fit properly, and were too tight on my toes. Overall build quality seems good, but I returned them for a refund.",
      "rating": 3.0,
      "verified": true,
      "author": "jesmo5",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Keen: Go-To for comfort.",
      "text": "Keen is my \"go to\" for comfortable shoes. I'm female but buy men's for the extra width. I love the wide keen toe box and arch support. I usually have to order a half a size larger than other men's shoes and have no idea why. This particular shoe has a harder bottom than I remember.. but then they last forever so it's been a while since I ordered a new pair!",
      "rating": 4.0,
      "verified": true,
      "author": "Les",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Nice light hiking shoe.",
      "text": "The shoes fit as expected, They are comfortable and light. I am still breaking them in, but so far so good.. I plan to use these as everyday wear and for light hiking. I walk an average of 8 -10 miles a day. lI have not noticed an abnormal stress on my calves or thighs using these shoes. I am flat footed and my feet feel well after use with not hot spots.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe McMichael",
      "helpful_votes": 3,
      "publication_date": 20170606
    },
    {
      "title": "Usual good looks but has build improved?",
      "text": "I increased the size by 1/2 a size as my previous Keens seem a little short. Despite this, these shoes are certainly none too big and are noticeably narrower than expected. A pity as my feet are broad and I've been able to count on this feature. However, my one longstanding complaint is yet to be checked - will the upper break away from the sole? On most, if not all my previous Keens the glue has been very poor and despite fairly light wear, the sole has broken away from the upper. One pair was replaced because of this, I shall keep a very close eye on this.",
      "rating": 4.0,
      "verified": true,
      "author": "Kiwi",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Comfortable and great fit",
      "text": "This is the third year in a row buying these Keen's for my son for Christmas. Becoming a tradition. They wear really well, lasting throughout the year. He said they feel great. The width is comfortable and the shoe has great support. First two years he bought the Raven/Burnt Ochre, but this year the Black/Gargoyle. Both have a really nice look. These are used for work, leisure, and hiking. Nice quality and good price.",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Broke after five weeks, overall poor quality",
      "text": "The shoes fit a little snug. They have lots of errors where the two sole materials are glued together wrong and things don't line up. There are a couple gaps as well between the sole and the upper, as well as some glue spots where it looks like they were quickly done with little care. Five weeks after receiving them (and a week after the return window closed), one of the eyelets that hold the laces gave out -- the leather itself ripped and the leather portion of the inside seems paper thin. Overall poor shoe, and I'm hoping Keen's warranty is as good as some other reviews mention.",
      "rating": 2.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "I'm sticking with Keen until death do us part",
      "text": "I love KEEN. Last six pairs of boots ( all different models) and these shoes...always size 10.5. Always very comfortable. No breaking in pains. I'll probably never try a different brand again. I'm 57 years old and have bought many, many brands over the years, but I'm sticking with Keen until death do us part. These shoes felt great right out of the box. I went shopping and then went for a two mile walk and they were great. Very pleased with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Custer",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Great pickup so far!",
      "text": "Going hiking in a month and wanted more of a sneaker style for summer hiking. These don't need to be broken in, very comfortable with an extra 30lbs strapped to my back on my short, 2 mile, practice hikes so far. Will update this review after the actual hike in the Shenandoah! Got the 9.5 for $65 (July 2017). They are slightly large, but not noticible once you get hiking. It will be a good fit for thicker socks in the winter, which I'm sure is the reasoning.",
      "rating": 5.0,
      "verified": true,
      "author": "Motfot",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Good shoe for Off road, worse for icy road, Not waterproof",
      "text": "I was hoping not to give any feedback for this shoe, but compelled to write an review. This shoe I had purchased for waterproof option, but sadly this in not a waterproof shoe. Little hard while walking on road and very slippery in Icy road. You need to extra careful while walking in fresh snow and ice, no grip at all. Also the shoe is little wider than other shoe with this size. I wear 12 US(W), so ordered the same size for this, but it's extra wide need to wear thick socks for a better fit. I am completely dissatisfied with the waterproof claim, it's completely get wet when you put yourself in water.",
      "rating": 3.0,
      "verified": true,
      "author": "Bikash Kumar Rath",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Fits as expected.",
      "text": "Purchased for my husband who can be difficult to shop for - these size 14's are roomy and the ankle support is great, he reports. I've always been pleased with KEEN's and these are no exception. Price online beat out the big boxes by a significant amount too.",
      "rating": 5.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Long lasting with good support",
      "text": "After putting about 4k miles on these shoes I decided to order a new pair. I worked 11-12 hour shifts on concrete floors and these did so much for me support wise. They really saved my feet, and I've never had any shoes last that long at work. I'm genuinely excited for my new pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Ten",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Good quality shoe. Comfortable and well thought out.",
      "text": "Runs 1/2 size small IMO. I usually wear an 11 but returned those because they were too small. 11 1/2 fits nicely. My first pair of KEEN shoes. I usually bought Merrell for a shoe like this but their selection lately is underwhelming IMO. Seemed to lack sufficient insole padding on the first day of wear - didn't notice that after the first day. Very happy with the comfort since that first day.",
      "rating": 5.0,
      "verified": true,
      "author": "Groundoggy",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "very comfortable, very durable",
      "text": "Very light, very comfortable, very durable. This is my second pair of these. Unfortunately they no longer make the blue/green version, but the grey/orange looks good too. The price is also a bit lower now. My first pair are still going strong and still look great, but I have ruined the back by forcing my foot in without untying them, which has created a minor lump at the back of each shoe. I'm being nicer to the new ones by using a shoehorn when I cram them on.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Richardson",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "My last pair was also medium and they worked out great. This being said",
      "text": "I have wide feet, and was concerned that they still only came in medium. My last pair was also medium and they worked out great. This being said, I ordered an 11.5 M and was again pleased with the fit. They appear to run wide, so keep this in mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert J. Basile",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "Good everyday shoe",
      "text": "I wear this shoe everyday from city streets to back wood trails. It seems to handle both very well. Wide toe box allows comfort and light weight reduces fatigue. Only real downside for me is that they are a little warm for a southern US summer shoe. Probably provide decent water resistance though. Sizing is in line with Merrells and Vasques.",
      "rating": 4.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "okay shoes - sturdy",
      "text": "I expected these to be my favorite Keens, but was surprised to find that they have stayed stiff. I have a couple part-time jobs that require Keens (specifically) and involve a LOT of walking. I've only worn these on a couple shifts as my feet tire more than expected and sometimes the top of my foot begins to ache from the stiffness. They're definitely sturdy, but not as great as I'd hoped for a lot of walking.",
      "rating": 3.0,
      "verified": true,
      "author": "lsmpls",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Great shoe so far",
      "text": "I bought a half size larger than I normally wear in other brands of shoe. This worked well, as these shoes fit great and are quite comfortable for all day wear. They seem to be well made, but time will tell. I bought a pair of Keen Logan mid hiking boots last year and they are holding up well, but I needed something lighter for hot summers here in Arizona. These Oakridge shoes seem light and breathable. I'm going to enjoy wearing them.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Moreau",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Great fit and made well!",
      "text": "Feet got wider somewhere along the way, about 2 decades back. These fit perfect in \"their\" normal width. About my 6 pair, not all the same model, but the FIT the same!",
      "rating": 5.0,
      "verified": true,
      "author": "hankster",
      "helpful_votes": 4,
      "publication_date": 20170301
    },
    {
      "title": "Comfortable shoe; not particularly durable.",
      "text": "I have had my shoes a little over a year (the warranty period). They have been comfortable and I really liked them, but the mesh between the e leather on the sides has torn recently on both sides of both shoes, so now my sock shows through. Definitely a less than durable choice of materials. I have worn them a couple of times a week.",
      "rating": 3.0,
      "verified": true,
      "author": "M. L. Goodson",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Sturdy and comfortable shoes.",
      "text": "These were my one pair of shoes for a month-long trip through Southeast Asia with lots of walking, hiking, etc. They were very comfortable and held up amazingly well. Still look almost like new, even after wearing them pretty hard for the entire time. They have fairly wide toe boxes (which I love), so be aware of that. Extremely sturdy soles. An impressive pair of shoes and would buy another pair in a flash.",
      "rating": 5.0,
      "verified": true,
      "author": "X",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "He only wears these shoes.",
      "text": "My husband has one real foot and one prosthetic foot. So they wear differently. Both have, from historical experience lasted 3 years. He only wears these shoes. He does not change out for different wardrobes. They are comfortable and durable for his needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Itsme003135gg",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Lasted 2 months!!",
      "text": "Bought these for my husband Aug 22nd he wears them as \"tennis shoes\" and works in different boots. Today, Oct 27th he noticed a hole. Way too expensive to come apart on a seam with roughly 2 months of wear. Our first and last experience with Keen :(",
      "rating": 1.0,
      "verified": true,
      "author": "Ashleigh",
      "helpful_votes": 3,
      "publication_date": 20171027
    },
    {
      "title": "Great Shoes",
      "text": "I wear a 10.5 Wide but a pair of these in 11 regular fit great and are very comfortable. I am on my second pair now and the first pair still look really great for being 3 years old. These shoes are comfortable and durable and are great for people with wider feet.",
      "rating": 4.0,
      "verified": true,
      "author": "TK",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Keen! What did you do? I used to ...",
      "text": "Keen! What did you do? I used to be able to walk into REI and grab a pair of Keens without even trying them on. Now, they are all too short. I tried going up from a 9 to a 10.5 and still my toe was pressing against the tip of the boot.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric B. Wolf",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Just as essential as my Keen sandals",
      "text": "This is my first pair of proper Keen shoes, and they haven't disappointed. I was encouraged to buy these by my podiatrist who said they'd help with some early-morning foot stiffness I've had. He was right. Now that it's colder, I wear these just as much as my Keen sandals in the summer, which is to say all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Walter",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Huge disappointment - not waterproof at all.",
      "text": "I toiled over a shoe decision after my husbands favorite Columbia trail runners were discontinued. The ONE requirement I had was for the shoes to be waterproof and these were listed as such but are not. He’s not fording rivers in them... he’s just hiking through wet grass. Ten minutes into a morning hike in dewy grass, he is ready to change his socks. Huge disappointment.",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Keen Shoes",
      "text": "I've been wearing Keens for the last 10 plus years since my feet started giving me trouble with other shoes. They are tough, comfortable and durable and usually last me a year of constant use in a farming environment. Your mileage may vary on the looks but I'm used to them and they don't look too bad to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Vilnis Neilands",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Great shoes, but I wanted new ones",
      "text": "very comfortable right out of the box. Only thing that sours me a bit is that i bought new shoes and what I got was \"new\" shoes. What are the quotes for? For the fact that i received almost new shoes that has scuffs on the sides and dirt on the treads. Not happy about that Amazon, but the shoes are great after about a weeks worth of use.",
      "rating": 4.0,
      "verified": true,
      "author": "Harrison Jenkins",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Good solid shoe",
      "text": "I have worn Keen voyagers for many years. I decided to try something not too different. They are a comfortable shoe, with a less aggressive sole. Overall fit very similar to the voyager. I like these a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "van Oene",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Exceeded expectations.",
      "text": "Very surprised at the fit. It's almost perfect. Usually Keen Shoes are large in the heel for me but no sign of the problem with these. The shoes are well constructed and sturdy with a thick midsole. These should do well since I'm on my feet all day at work. I may go ahead and order a second pair so I can rotate them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ren",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "I highly recommend these if you are looking for lightweight comfortable shoes!",
      "text": "I had ordered 9’s (my usual size) and they were too small so I returned them for 9.5 and they fit great! These Keen Oakridge are lightweight and very comfortable. I will be buying another pair and from Amazon we’re I found the best price and the fastest delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon customer ",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "The Perfect Shoe",
      "text": "Very comfortable shoes even when walking or hiking long distances but if you plan to hike with a lot of gear consider getting a mid rise boot so you have better support. Overall, the shoe fits perfect and performs well when mother nature throws rain, snow, sleet your way.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Shah",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Sizing a puzzle.",
      "text": "Sizing seems somewhat off. Earlier I purchased a Keen 7.5 and found it too small. I returned it without a problem. This time I choose size 8.0. A little big. I'll keep it and wear it during seasons where thicker socks are used. The styling and workmanship appear top notch.",
      "rating": 3.0,
      "verified": true,
      "author": "Dave M",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Beware...",
      "text": "If you're like me and buy Keen's for their 'wide toe box' then beware because this style of Keen is quite narrow. My toes were killing me by the end of the day and I will try returning them for a 1/2 size up and see if that helps. Other than that , I like them. But unlike my Voyageur's and a few steel toes I have from Keen, these are very tight in the toes by comparison. Annoying variances.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Erickson",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Slightly disappointed",
      "text": "I love the Keen brand and all their shoes look great. This shoe seems a bit more \"plasticky\" than I thought it would. I purchased without seeing it and I don't like it as much as I thought I would. They are ok and I'll be using them for working in the yard so I'm hoping they are durable.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Marchuk",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Have only had these shoes for 2 months and they are already falling apart.",
      "text": "Have only had these shoes for 2 months and they are already falling apart. I don't even wear them everyday, maybe once or twice a week. Within the first week of wearing them the foam around the sole was pulling away from the leather at the top of the shoe, within 45 days the webbing on the sides has large holes in it. Sucks, because overall the shoes are pretty comfortable. These were my first pair of Keen brand shoes, not impressed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Nice shoe",
      "text": "This shoe feels pretty comfortable, and I have short, wide feet, so fit is always tricky. I used these to replace my new balance shoes because I kept getting a blister on one foot from walking 3-4 miles every day. These KEEN shoes don't cause any problems and seem very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Poor quality, poor customer service",
      "text": "These keens used to be my favorite, but the 2018/19 model is horribly assembled. The sizes are inconsistent and the shoes are not symmetrical. When I contacted Keen about the issue, they promptly said the picture looks fine and offered me a 20% off discount code. I highly recommend passing on this shoe and this brand as a whole. They used to be my favorite, now I avoid them like the plague.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Souza",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Fell apart in two weeks",
      "text": "I have heard so many good things about Keen shoes, I was really disappointed that the Sole started to separate from shoe after wearing them 10 times. Replacement was sent quickly, so their Customer Service is decent. So far so good on the replacements.",
      "rating": 2.0,
      "verified": true,
      "author": "ROBERT",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "I find myself frequently needing to take them off (mind you I'm at work at my desk so this really isn't problem) to cool my feet",
      "text": "This is a review of the shoe after six months of use. First, the shoes retains heat. I find myself frequently needing to take them off (mind you I'm at work at my desk so this really isn't problem) to cool my feet down. Second, what REALLY disappoints me about this show is that the \"breathable\" material on BOTH shoes on BOTH sides of my feet (where the shoes bend at the ball of the foot) have torn due to the leather straps pinching it repeatedly. I don't recommend THIS Keen shoe.",
      "rating": 2.0,
      "verified": true,
      "author": "Amorth",
      "helpful_votes": 2,
      "publication_date": 20170323
    },
    {
      "title": "Considering I am a big guy and walk 3-4 miles a day I was very pleased with them",
      "text": "The reason I have purchased Keen shoes in the past was because they were touted as being \"Made In USA\". The last pair I had lasted almost two years. Considering I am a big guy and walk 3-4 miles a day I was very pleased with them. Recently ordered a new pair and was very disappointed to see the label \"Made In Thailand\". Have had just over two months they are already falling apart. Way to much money to pay for something that isn't going to last.",
      "rating": 2.0,
      "verified": true,
      "author": "Rick  J. Croel",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Run a little small.",
      "text": "I really like these shoes. They are comfortable and give my feet and ankles good support. They do run slightly small and I would love to have the next size up (14) but I can't find them anywhere..",
      "rating": 4.0,
      "verified": true,
      "author": "Jim T",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "Good value, long lasting shoes",
      "text": "The Keen Tennis shoe style shoe is slightly different than the walking shoes or climbing shoes. It has a tighter fit and a bit more padding in the tongue and sides or so it feels. I do like them in the same way I like my other Keen shoes which are pretty much the only shoe I wear.",
      "rating": 5.0,
      "verified": true,
      "author": "NC Joel",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "keen shoes but look cheap",
      "text": "keen shoes but look cheap. I don't like the color printed on the leather. fit and are comfy. so ill wear them out and get some other when the die.",
      "rating": 3.0,
      "verified": true,
      "author": "Steven the Poncho",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "comfortable and look good",
      "text": "I wear a size 8, but when I order Keen shoes I always order size 9 and they fit perfectly. I learned to do this from reading the reviews and it works for me! These shoes are durable, comfortable and look good. They are also light and have mesh sides which are good for summer wear. I use a waterproof pair for winter.",
      "rating": 5.0,
      "verified": true,
      "author": "R. E. Reese",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "lesiure shoe only",
      "text": "Good shoe for driving, lounging around or walking short distance on smooth ground. Day hiker or trail shoe, forget it. Keen has gone way down in quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Martin Slater",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Oak ridge keen shoe",
      "text": "Like my voyagers much better. Oak ridge runs small and is hot and not well ventilated. Runs a half size smaller than indicated compared to the keen voyager.",
      "rating": 3.0,
      "verified": true,
      "author": "WRH",
      "helpful_votes": 3,
      "publication_date": 20170213
    },
    {
      "title": "QA for shipping leaves something to be desired",
      "text": "The shoe is fine. This is my 2nd pair. But on this order they came used, dirty and without insoles. How does that even happen?",
      "rating": 1.0,
      "verified": true,
      "author": "J. STOUT",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Good quality and durable",
      "text": "Typical Keens. Good quality and durable. I own three other pairs at 9.5 size and this one seems a little shorter than the others. My toes actually are up against the front of the shoe. I may have to order size 10 from now on.",
      "rating": 4.0,
      "verified": true,
      "author": "WaltB1106",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Wonderful, but seems to run large! Easy Exchange through Amazon...",
      "text": "My husband really liked these shoes; the feel of the walk and the firm foot pad supports the ankles better [and not squashy and soft like others], but they seem to run larger than usual, even with thicker socks they were to big,so we exchanged the size 13 for a size 12. Will try to give a new update later.",
      "rating": 5.0,
      "verified": true,
      "author": "SLA",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Wear out too quickly",
      "text": "My boyfriend has had these for work since end of October 2019 and they already have a hole in the side of them. Pretty disappointed as these used to hold up better?",
      "rating": 1.0,
      "verified": true,
      "author": "L. Alcombright",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Piece of plastic wearing through inside of the shoe",
      "text": "Great shoe for about 3 months. Then a piece of plastic on the inside near the back upper part started poking through. Wore a hole in shoe liner and poking my foot.",
      "rating": 3.0,
      "verified": true,
      "author": "Margaret Hershberger",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Wore them straight out of the box!",
      "text": "These were a gift for a friend and my friend loves them. She put them on and wore them straight out of the box. Keens reputation is why we keep buying them beside the fact they are very comfortable and well made!",
      "rating": 5.0,
      "verified": true,
      "author": "S A Jones",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "since I'm on my feet all day and a good pair of shoes is critical to going home and ...",
      "text": "I bought these shoes for work, since I'm on my feet all day and a good pair of shoes is critical to going home and not wanting to kill myself when getting up the next morning. This shoe doesn't need insoles to keep my feet from aching by the end of the night. Well recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "LitCritChas",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "My old pair was a size 10 and they were ...",
      "text": "My old pair was a size 10 and they were to big when broken into. So this time I ordered a 9/30 but they are to small. Guess the luck of the draw. Waiting the the size 10 again to arrive.",
      "rating": 5.0,
      "verified": true,
      "author": "naxuel santana",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "falling apart in 3 months",
      "text": "I wore theses shoes every day for work. After three months they are just falling apart. The material by the side of the foot is ripping and has holes in it. The rear of the shoe is falling apart from the inside resulting in sharp plastic pieces digging into my foot. Three months? really? First and last keen purchase ever.",
      "rating": 1.0,
      "verified": true,
      "author": "Joffrey",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Another excellent pair of Keen shoes.",
      "text": "Great shoes. These fit well and were comfortable, right out of the box. I have been a Keen customer for years. I expected an excellent pair of shoes, and I was not disappointed. I walk several miles every day on fairly even ground. These shoes did not require a break in period. I am very satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "SteveV",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Good shoe",
      "text": "Ordered these shoes for my grandson. He already had a similar pair from Keen, so this was a safe purchase. He is well pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Keen Sandstone was much better.",
      "text": "My pair of Keen Sandstone fit better and were much more comfortable than the Oakridge shoes. The soles seem to have more cushioning than Oakridge. My feet actually hurt after taking a short hike in the Oakridge shoes. The Sandstones were also \"American Built\". The Oakridge does not have the \"American Built\" label. Would not recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Great shoe",
      "text": "Keen shoes gives me the support I need the only problem is the laces. They need to be double knotted to stayed tied.",
      "rating": 5.0,
      "verified": true,
      "author": "Shortribs11",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Very confortable",
      "text": "I'm a senior & Keen shoes were recommended by my podiatrist - They are quite comfortable for hiking, tread-milling & everyday use. Very nice thick soles. I can feel the soft give underfoot with each step. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Blackburn, Ukiah CA",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Misleading information!",
      "text": "Somebody is not telling the truth! On Amazon for these shoes it says they are made in th USA!! THEY ARE NOT! THEY ARE MADE IN VIETNAM!",
      "rating": 2.0,
      "verified": true,
      "author": "Ralph",
      "helpful_votes": 2,
      "publication_date": 20170703
    },
    {
      "title": "Not the same fit as Austin model.",
      "text": "Not the same fit as the Austin model. Doesn't have the good arch support and wide toe box.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob K",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Fit was great, comfort awesome",
      "text": "Fit was great, comfort awesome. Only lasted 3 months of light duty carpentry work before coming apart. Should be better at this price",
      "rating": 2.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 2,
      "publication_date": 20171221
    },
    {
      "title": "Buy these",
      "text": "Oh yeah I have already worn them out, They are the best, fit great every time. Amazon how do you do that so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Wilson",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Good product",
      "text": "I like the look and feel of the shoes. Ok for on your feet a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Fixit Guy",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Excellent, versatile Keens",
      "text": "I have 4 different keens and the Oakridge is the most comfortable and versatile pair I own. I have used them for Hiking angels landing @ Zion, used them to walk 9 miles, used them at the gym, and everyday wear, they have been comfortable and supportive.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Atighechi",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Those shoes are made for walking!",
      "text": "This is a really nice looking men's shoe. Have been looking for a while..needed a walking shoe. He said they are very comfy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer rousseau",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Love it!",
      "text": "As expected. Since this is my 2nd Keen hiking shoes. Same quality as the last pair. They fit great and do not hurt my feet like other hiking shoes that I tried.",
      "rating": 5.0,
      "verified": true,
      "author": "BRUSKI",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Size issue.",
      "text": "I ordered a complete size larger than my normal size, and they fit great. I have an older pair that i ordered 1/2 size larger than my size and they are tight.",
      "rating": 3.0,
      "verified": true,
      "author": "Zad",
      "helpful_votes": 2,
      "publication_date": 20170129
    },
    {
      "title": "Didn't fit like my other Keen shoes",
      "text": "Didn't fit like my other Keen shoes, which I love. Shoes are hard. Feet are weird. It's a mixed bad trying to fit these things together. You get what I mean.",
      "rating": 3.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Poorly designed, low grade materials.",
      "text": "insoles have worn out and not from over use, the material simply peeled away exposing the rubber.the sides behind the toe box have torn a yr and a half of casual dog walking.",
      "rating": 2.0,
      "verified": true,
      "author": "Ant",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Great product.",
      "text": "Great product. Always excellent quality. I bit more expensive than comparable shoes, but they are extremely well made. These shoes really wear well and are extremely comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "LYNN NARLOW",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "One Star",
      "text": "Horrible, like walking barefoot.. no arch support, basically flat insole",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph M. Kohl",
      "helpful_votes": 2,
      "publication_date": 20180514
    },
    {
      "title": "A great hard working show for the workplace",
      "text": "A great hard working show for the workplace. Fits like a shoe should and well made to take on more than a backpacking shoe would normally put out. Simply love the shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Da Garzster",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Great shoes with weird little yellow triangles",
      "text": "They have little yellow triangles with ! In them on the toe and sole. Just looks out of place. Dirt will fix that. Every thing else is great with these shoes. These are my 3rd pair of keen shoes and not the last!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryant Morris",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Wears well",
      "text": "2nd time purchasing this exact shoe. Wears well and good for everyday activity. Heavy shoe, but solid with support and wears well.",
      "rating": 4.0,
      "verified": true,
      "author": "Momma Cats ",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Good shoe but",
      "text": "Keen makes a good shoe all around. This shoe however always seems to fail on the outer side. Second pair ive had that have done this in the exact same spot. Im pointing at the spot that fails with my finger in the picture. The other damage is just from use. Will buy Keen again, just not this specific model.",
      "rating": 4.0,
      "verified": true,
      "author": "Rene Rumley",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "These are quite possible the worst shoes I have EVER bought",
      "text": "These are quite possible the worst shoes I have EVER bought. They fit big and their standard width is designed for someone with really wide feet. I wear low cut socks and the sides of the shoe wore blisters all over my ankle after 2 mile walk. Stick with Merrells or a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Jm",
      "helpful_votes": 2,
      "publication_date": 20180111
    },
    {
      "title": "LOVE THESE!",
      "text": "Use these for light construction work and lots of moving and walking all day and they work great! They are the only shoes that don't need to \"break in\" first, yet still hold up to tough work. Will continue buying them!!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Goofy Feet/Great Shoes",
      "text": "Terrific shoes for my husband with goofy feet. Look great, fits as expected, wide toe box (good thing), and keeps him walking all day.",
      "rating": 5.0,
      "verified": true,
      "author": "SusanMerry",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "My favorite sandals!",
      "text": "These shoes fit great. I like getting them on sale on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Laz Man",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Size runs significantly small",
      "text": "I've worn Keens for years and have always been happy, even when ordering from the internet. This time the shoes were at least 1/2 size too small so I'm returning them.",
      "rating": 3.0,
      "verified": true,
      "author": "Lee Doran",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Shoes are perfect in size other then the medium height of the ...",
      "text": "Shoes are perfect in size other then the medium height of the shoe on my right foot. rubbed on ankle bone. Bought Keen insoles and that fixed the problem. Very nice shoe/boot.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas Fahrnkopf",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Great shoe. I have flat and wide feet and ...",
      "text": "Great shoe. I have flat and wide feet and these work great. I ordered a half size bigger than my normal size. I’m usually a 7.5 and the 8 fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Weenus Fuzzz",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "area where you thread the shoelace through to lace the shoe snapping when you tie the shoes",
      "text": "I've been a fan of keens shoes for years. The first pair I had lasted me for years. I have now bought two of this style the first one I bought my Sony for a year and this one I bought in September. They keep breaking at the area where the shoelaces were released at the shoe. I am very displeased with this style.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    }
  ],
  "product_meta": {
    "title": "KEEN Men's 1015319 Hiking Shoe",
    "description": "Hiking shoes",
    "rating": 4.1,
    "feature_bullets": [
      "Lace-up hiking shoe featuring lightweight mesh upper with leather overlays and protective toe cap",
      "Front and back pull loops",
      "Outer Material: Leather",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Heel Type: no-heel",
      "Shoe Width: D(M) mens_us"
    ],
    "specifications": {
      "Product Dimensions": "27.94 x 22.86 x 22.86 cm; 371.95 Grams",
      "Date First Available": "20 May 2016",
      "Manufacturer": "Keen Adults - US SHOES",
      "ASIN": "B07R815PD2",
      "Item model number": "1015319",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Trekking & Hiking Footwear",
      "Shoes & Bags"
    ],
    "price": 398.03
  }
}