{
  "website_summaries": [
    {
      "verdict": "The huge, metal Huawei Mate 8 has plenty of appeal and only minor drawbacks, but it's too expensive to sway fans of large-screen phones from the Nexus 6P or Samsung Galaxy Note 5.",
      "pros": [
        "Huawei's Mate 8's battery life goes on and on, it snaps good photos and has a fast, accurate fingerprint sensor and a loud speakerphone"
      ],
      "cons": [
        "This ginormous 6-inch phone is just too unwieldy for smaller hands",
        "It has a dim screen and a low resolution compared with other phones"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 7.0,
        "Camera": 7.0,
        "Battery": 9.0
      },
      "publication_date": 20160113,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Chinese version.",
      "text": "This is the Chinese version, not the international version. It's all in Chinese. I change the language but the playstore and other things like the internet are in Chinese.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20161012
    },
    {
      "title": "Love the phone!",
      "text": "Great Phone!! I love it! I give it a 4/5 due to some minor problems of resetting and lots of interference noise when I connect with aux cable to my car. Besides that, great camera, great battery life and overall smoothness with the software and hardware. The resetting problem is sometimes annoying, however, I'm not sure if is something from the manufacturer or is just some app that keeps crashing.",
      "rating": 4.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 5,
      "publication_date": 20160503
    },
    {
      "title": "Chinese",
      "text": "Really loved this phone, and it served me well. The only thing is that all the system settings are in Chinese.",
      "rating": 4.0,
      "verified": true,
      "author": "Udokamma Chibuzo",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "IMEI is not unlocked!!!",
      "text": "Very bad!!!! It's not unlocked and IMEI not compatible in US. I have to spend more money to do IMEI unlocked. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Indy001",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "I'm very happy with their product line",
      "text": "Huawei is a reputable maker. I'm very happy with their product line.",
      "rating": 4.0,
      "verified": true,
      "author": "Jian",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "I think that Huawei can do a better job in having separate slots for all both Sims ...",
      "text": "Since purchasing this phone, I've received several compliments from my friends and Co-workers alike. However, I think that Huawei can do a better job in having separate slots for all both Sims and MicroSD.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170608
    },
    {
      "title": "My sister loves it",
      "text": "I ordered this phone for my sister and she really likes it. It didn't come with a leather case like the description and other people said.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolina",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "I did not get the international version",
      "text": "Phone looks great but is for CHINA USE ONLYit will not take my sims in the US.",
      "rating": 3.0,
      "verified": true,
      "author": "Sixto V.",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Is it worth the Wait",
      "text": "This phone is great for the price range.. Plus it's 4yrs old.. But I've never waited so long 4 an item through Amazon... I never wanna go thru such a waiting process...",
      "rating": 5.0,
      "verified": true,
      "author": "Dj napkins",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "the best phone I have ever owned in my life",
      "text": "This phone is definitely, by far, the best phone I have ever owned in my life. You won't find very many cons about this phone other than, the volume control settings for both incoming and outgoing calling could be stronger, and it is only a GSM not CDMA capable network. There are not very many negatives to this phone. I would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Malory Renee Bradley",
      "helpful_votes": 16,
      "publication_date": 20160526
    },
    {
      "title": "Fantastic!",
      "text": "looks like New, works like New, even the battery is lasting 2 days!",
      "rating": 5.0,
      "verified": true,
      "author": "Humberto Nunez",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "beautiful, dual sim",
      "text": "Loud, fast, beautiful, dual sim. the only gripe is that there should be a separate sd card slot, not the sim2 tray.",
      "rating": 4.0,
      "verified": true,
      "author": "Vusi solly",
      "helpful_votes": 2,
      "publication_date": 20161107
    },
    {
      "title": "Big phone, latest  Smart  phone  features !",
      "text": "So far so good ! The device works , it is a little big but don't matter how you use it , guaranteed to last a day with any amount of usage.",
      "rating": 4.0,
      "verified": true,
      "author": "MarcP",
      "helpful_votes": 2,
      "publication_date": 20160703
    },
    {
      "title": "Beatiful but buggy",
      "text": "Found the phone to be extremely laggy. There is a slight delay when scrolling as well. Also, some of my videos would have a stuttering effect. It's a shame because the phone is really nice. I wish I could over look these flaws but they are very bad. I came from the nexus 6p and I'll have to go back. Only reason I wanted to switch was the lack of storage on my 6p. I guess I'll have to use OTG cables to store files",
      "rating": 2.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Five Stars",
      "text": "Snappy, superb picture quality, long battery life, can't go wrong with this phablet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160718
    },
    {
      "title": "Very happy with the purchase.",
      "text": "This is an awesome product and I am very happy with my purchase. It's been few weeks since I got the package. The package contains a cover and screen plastic for the phone. That was a big surprise for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Huawei has been long underestimated in the western country. ...",
      "text": "Huawei has been long underestimated in the western country. But the fact is that this phone is very fast and reliable. Battery life is also impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Yanyan Guo",
      "helpful_votes": 2,
      "publication_date": 20160805
    },
    {
      "title": "One of the best phones out there",
      "text": "Only had this for a couple days but so far it's amazing. I have an S7, iPhone 6s plus, and a nexus 6p. This is definitely my favorite phone. If I had to compare it, I'd say it's like a nexus 6p and an s7 combined. I geekbenched it at 1800 single core and 6100 multi! The multicore score is amazing for any phone. The 4GB of ram is amazing too. The phone comes with it's own screen protector and phone case too. One thing that I really like is a default app that cleans your phone of temporary files. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Jane zanelotti",
      "helpful_votes": 7,
      "publication_date": 20160506
    },
    {
      "title": "Hands down the best phone I have owned to date",
      "text": "This phone is incredible. Hands down the best phone I have owned to date.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Phone works fine as expected",
      "text": "I purchased the gold 4gb ram, 64gb from mega mobile. From the beginning mega mobile answer my questions I asked on here. The phone came fast with Amazon prime. Phone works fine as expected. I use it with T-Mobile. The stuff people complain about is no big deal. Some people got their phone wrapped in plastic around the outer box, mine did not have that and I was a little disappointed. It does not have a place where apps live. They all show on the screen, but you can place them in folders like the iphone.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyrone Gayle",
      "helpful_votes": 2,
      "publication_date": 20160805
    },
    {
      "title": "He loved it. We took it to our carrier and ...",
      "text": "I bought this phone as a present for my husband. He loved it. We took it to our carrier and got the sim card installed hassel free. easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160619
    },
    {
      "title": "Five Stars",
      "text": "It's an amazing product. Fast, cool design and a lot of useful features.... I'm loving it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "Received device with screen protector installed which was great but my device was silver not grey as I ...",
      "text": "Received device with screen protector installed which was great but my device was silver not grey as I had originally ordered. None the less great product and service. I can only give four stars due to me receiving the wrong color device.",
      "rating": 4.0,
      "verified": true,
      "author": "Yogi",
      "helpful_votes": 2,
      "publication_date": 20160410
    },
    {
      "title": "No ringtone no icon for certain app",
      "text": "Thus item did not remember my passwords after 2 hours usage. no matter what i put in, no good. I have to do reset to wipe off all data andreturn to the seller. You cannot have Facebook icon show on screen even you installed it and it only show in a window for commonly used icons. . I believe it us related to Chinese government not allowing Facebook to run in China.",
      "rating": 1.0,
      "verified": true,
      "author": "gxy",
      "helpful_votes": 2,
      "publication_date": 20160720
    },
    {
      "title": "International version from the Middle East or the UK",
      "text": "Warning! it is international version. The phone is from the Middle East or the UK.Different charger and plug, not for american users.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20161102
    },
    {
      "title": "good quality and photos",
      "text": "good quality and photos, battery could hold for whole day..... everything look perfect.. only one concern, the dual sim card can NOT using with MicroSD at same time. you need to either one SIM plus MicroSD or Dual SIM without MicroSD",
      "rating": 4.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 24,
      "publication_date": 20160621
    },
    {
      "title": "Awesome phone for half the price",
      "text": "This really is an awesome phone for the price. It has a camera and features comparable to very expensive brands yet its under $200. I find its pretty fast for the price and the touch screen is smooth and responsive. It is also surprisingly tougher than expected. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "david S.",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Five Stars",
      "text": "This phone is replacing my 2+ year old Huawei Ascend Mate2. It's very well built, and works perfectly. Follow up after 6 months. Android 7 update installed still not one issue with the phone. Battery life for medium to heavy days is still 2 days with perhaps 10-15% left. Loud speaker, clear screen, fast.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Harris",
      "helpful_votes": 3,
      "publication_date": 20160907
    },
    {
      "title": "Awesome phone!!",
      "text": "I like this Huawei Mate 8 smartphone because it has 6\" screen also it has a large size battery 4000mah. If I use it moderestly it can lasts 2 days without charging. I also like its design. Overall, this phone is awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "SongThan",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Love it! Inserted sim card and was immediately on ...",
      "text": "Love it! Inserted sim card and was immediately on the Cricket cellular network.",
      "rating": 5.0,
      "verified": true,
      "author": "mark",
      "helpful_votes": 2,
      "publication_date": 20170420
    },
    {
      "title": "Four Stars",
      "text": "Very nice phone, but after couple charges, the battery life starts to reduce.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170115
    },
    {
      "title": "Way above my expectation!",
      "text": "It is a fantastic product! It is fast, charges quickly, and I can get through a day with very heavy use about 30% charge still left in the battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnvirago",
      "helpful_votes": 2,
      "publication_date": 20160604
    },
    {
      "title": "EXcellent Battery Life",
      "text": "Excellent phone, I had the Samsung Galaxy Note 5 before this and the Huawei Mate 8 is exceptionally faster and the battery last a full 2 days. I am usually at 25% battery remaining by 10pm on the 2nd day. EXCELLENT PHONE.",
      "rating": 5.0,
      "verified": true,
      "author": "Derick Hall",
      "helpful_votes": 5,
      "publication_date": 20160731
    },
    {
      "title": "Excellent",
      "text": "Perfect phone,,, Exactly what I was looking for,,, so much better features than other cell phones lightning speed downloads",
      "rating": 5.0,
      "verified": true,
      "author": "Arnol",
      "helpful_votes": 3,
      "publication_date": 20160915
    },
    {
      "title": "Five Stars",
      "text": "Great device. Feels good, looks fantastic, get's the job done and is unique to the rest out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Monika Hartley",
      "helpful_votes": 2,
      "publication_date": 20160928
    }
  ],
  "product_meta": {
    "title": "Huawei Mate 8 NXT-L29 32GB Dual SIM Factory Unlocked GSM Smartphone - International Version, No Warranty (Grey)",
    "rating": 4.1,
    "feature_bullets": [
      "Operation System: Android 6.0",
      "HUAWEI Kirin 950, Octa-core + i5 co-processor",
      "Wi-Fi 2.4G/5G, 4000mAh Battery",
      "Main camera 16MP, F2.0, Front camera 8MP, F2.4",
      "Fingerprint Sensor, G-Sensor, Gyroscope Sensor, Compass, Ambient Light Sensor, Proximity sensor, Hall sensor, Barometer"
    ],
    "specifications": {
      "Product Dimensions": "6.19 x 3.17 x 0.31 inches",
      "Item Weight": "6.5 ounces",
      "ASIN": "B0199TFWSM",
      "Item model number": "MATE 8 DUAL SIM EUROPA",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.1 out of 5 stars310 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#67,200 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android 6.0",
      "RAM": "3072 MB",
      "Other display features": "Wireless",
      "Other camera features": "16 MP",
      "Form Factor": "Smartphone",
      "Colour": "Gray",
      "Phone Talk Time": "23 Hours",
      "Manufacturer": "Huawei",
      "Date First Available": "December 1, 2015"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": ""
  }
}