{
  "website_summaries": [
    {
      "verdict": "This durable green laser sight is affordable and comes with a remote.",
      "pros": [
        "Constructed from aerospace-grade aluminum",
        "Green laser has a day range of 100 to 300 feet and a night range of up to 1,000 feet",
        "Comes with a remote control, and a figure-8 hole mount",
        "Easy to adjust",
        "For rifles and shotguns",
        "Affordable",
        "Battery included"
      ],
      "cons": [
        "Battery contact is not great and the battery compartment itself is not waterproof",
        "Some report that either the laser or remote dies within a few weeks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good pointer for astronomy, star gazing, stars.",
      "text": "At night, you see a clear, strong green line. You can easily point out stars, satellites, etc. My photo shows the pointer aimed at Mars. I held the pointer next to my cell phone to take the photo; it's much brighter with your eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Andreas Ramos",
      "helpful_votes": 38,
      "publication_date": 20180914
    },
    {
      "title": "works well, great bargain",
      "text": "it works pretty darn well for the price. do be careful, as it's easy to go beyond the threaded points when zeroing it. then you have to remove the turn screws and put them back in. You really only get about 2 turns of adjustment to zero and be sure to follow the instructions to zero at 100 ft.",
      "rating": 4.0,
      "verified": true,
      "author": "Tek2000",
      "helpful_votes": 43,
      "publication_date": 20170417
    },
    {
      "title": "If you ever wanted to try a laser on firearm, this is the one.",
      "text": "Nicely made and works well. Intend to use up to 75 yards max and already rough zeroed using existing sighted in scope reticle matched to new laser dot. Have not been to range yet to fine tune sight-in but do not expect problem. I bought inexpensive very low mount 1 inch scope rings to mount laser on pic rail below and directly in front of existing high mounted scope. Slight \"bump\" shows at botton of sight picture but doesn't affect sighting. Almost a co-witness sight setup. For twenty bucks this is one heck of a buy. At that price will probably buy another even if I only use it for parts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 21,
      "publication_date": 20190912
    },
    {
      "title": "Remote switch didn’t work",
      "text": "While the laser works ok the remote switch did not right out of the box new. Disappointed as this was the reason o purchased this laser over other ones. Poor manufacturing is the cause because if you ground the remote switch it works. Also after 2 shots it broke. Cheap I wouldn’t recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Reliabilityman",
      "helpful_votes": 10,
      "publication_date": 20180520
    },
    {
      "title": "Not for firearms",
      "text": "Worse laser I’ve ever used, not compatible with any firearm caliber larger than a .22! Put it on my AR zeroed it in at about 50 yards fired 8 rounds and something internally failed. You could hear it jingling around inside of it. Laser went from a nice visible green laser, to a dull red laser that was only visible if it was aimed at something less than 3 inches away from it. I would not recommend this item to anyone looking for a good laser for their forearm. Received yesterday, retuning today. If I could give less stars I would.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180615
    },
    {
      "title": "Darn good laser sight for the money.",
      "text": "Well I purchased this laser to accompany a budget dpms panther oracle Ar-15, this item came with the mount necessary to do so on a standard rail system, once installed I went out on my ranch and zeroed the laser to my rifle, fired a few shots.. laser kept its accuracy pretty well, though after i had fired about 60 rounds the laser was completely off target. All in all i would say this laser is good if you need something to use for varmint hunting at night or for home security/intimidation, or perhaps for airsoft if thats your thing... the sight is well made but will not stay zeroed on 5.56 mm",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny ",
      "helpful_votes": 8,
      "publication_date": 20180521
    },
    {
      "title": "Product not new",
      "text": "Got this in the mail today, the laser work just fine And seems pretty well build and strudy.... The only problem that i didnt got new one..it has finger prints on it and it was seald with mascantape to cover it up.... I paid for new one so i expect to get new one!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Asi",
      "helpful_votes": 17,
      "publication_date": 20171103
    },
    {
      "title": "Great Product",
      "text": "I had recently lost a laser very similar to this one and it met all my expectations. It works very well. At night if you shine it up,( granted there are no aircrafts) you can see the beam very clearly. It is really cool!",
      "rating": 5.0,
      "verified": true,
      "author": "FIRE_content_YT",
      "helpful_votes": 28,
      "publication_date": 20170706
    },
    {
      "title": "Doesn't work, no help from mfg",
      "text": "Powers on bright. Within two seconds beam can hardly be seen. Note in box from the manufacturer, I think, since it says nothing about who they are. Note says please contact them first and not make a claim, leave negative feedback or return the laser....BUT they go on to say contacting them will make things much quicker. Huh? Then a thank you and no contact info. No phone, email, web page, nothing. Total crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim T.",
      "helpful_votes": 43,
      "publication_date": 20160921
    },
    {
      "title": "Well built but VERY dim!",
      "text": "This laser works, barely. It is half the brightness it could be, because the power supply strobes for some reason. It flashes rapidly, on and off, visible when you sweep the beam across a surface rapidly. It is half the brightness of my cheap $10 green laser pointer from sciplus.com. That one is far brighter. Nicely focus on this one, but the brightness is insufficient. I feel it must be defective, and is very disappointing. I bought it because I need a very bright pointer. Not for a gun, I don’t own one.",
      "rating": 1.0,
      "verified": true,
      "author": "Lek",
      "helpful_votes": 4,
      "publication_date": 20180829
    },
    {
      "title": "Stopped working within hours....Zero help from company....zero customer support....rip off",
      "text": "I mean everything can have issues and I can understand that. Mine sure did....third time I tried it. im not talking I dropped it...or mounted it on a shotgun. Third time I TURNED IT ON. Now I can understand issues...maybe just faulty unit. That happens....BUT when a company ignores your requests for help....via email....messages on there sites....everything. Thats just a rip off. Spend your money.....get a product that doesn't work....and company ignores your request'SSS for help? Dont walk away.....RUN.",
      "rating": 1.0,
      "verified": true,
      "author": "Nurse n Georgia",
      "helpful_votes": 2,
      "publication_date": 20200913
    },
    {
      "title": "Worthy of Serious Consuderation For Blowgun Users",
      "text": "This is a great laser sight at a good price for a blowgun. The sight is light weight, and easy to install, though it does require a mounting rail sized for the particular caliber of the blowgun being used. The mounting accessory that come in the box fits rifle barrels and requires adapting to barrel diameter to work. It’s easier to order the blowgun mounting accessory when ordering the laser sight. Make sure to check the wall size of the blowgun before ordering the mounting as the mounting rails are sized differently according to the caliber of the blowgun.",
      "rating": 5.0,
      "verified": true,
      "author": "WLUMINK",
      "helpful_votes": 5,
      "publication_date": 20180119
    },
    {
      "title": "Wont hold Zero. only on the 1st shot.",
      "text": "WARNING this laser will not hold zero. I used my laser boresight together with this green laser. and zeroed them together. after the 1st shot of my 223. the green laser shifted and no longer in zero, not even close where I zeroed it. It shifted more than 5 inches at 40 yards. I tried it again but the result, for the last and hoping it will work on lower recoil like 22lr. but it's the same. after 1st shot on my 22lr rifle. it shifted. so I think, this product is defective. I need to replace it. or else it's a total loss of money.",
      "rating": 1.0,
      "verified": true,
      "author": "-=ProvidencE=-",
      "helpful_votes": 3,
      "publication_date": 20190313
    },
    {
      "title": "Great For Reference Point - Optic Change Outs",
      "text": "Works great for how I use it. When switching options on my AR I first put this on, reference it against the mounted optic, and then when I put another optic on, I can check zero (at the same distance I referenced against the first optic). That way you know you aren't screwing up zero when switching between various sighting systems. The light is bright enough to see in daylight out to about 50 feet or so, and goes a LONG way at night.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Ormandy",
      "helpful_votes": 2,
      "publication_date": 20200812
    },
    {
      "title": "Can't take the recoil of a AR10.",
      "text": "Seemed like a great laser at first but I was immediately disappointed my first trip to the range. I had it mounted to my AR10 and it shut off (broke) after the fifth shot. I can look inside the laser and see a small red light but that's it. Complete waste of $30 and I'm outside the 30 day window. Very disappointed! UPDATE 06/10/2020 The seller has reached out to me and has offered a refund. I didn't contact them. They contacted me and that's excellent customer service in my opinion!",
      "rating": 3.0,
      "verified": true,
      "author": "Jeremy Brown",
      "helpful_votes": 3,
      "publication_date": 20200606
    },
    {
      "title": "Clamp does not fit",
      "text": "The clamp supplied with this laser does not fit the body of the laser; it's too loose and no amount of tightening will help when the clamp grips the rail and is tightened completely. The laser body is not retained. I had to add a bushing made of two wraps of electrical tape to get it to stay. Since this is for a shotgun accuracy isn't all that important, but COME ON! This is unacceptably sloppy engineering and production. I haven't even evaluated the laser yet but after seeing this my hopes aren't all that high. Give this one a miss if you're using it for anything requiring accuracy; at 20 bucks it's suitable for Airsoft, but not for firearms.",
      "rating": 1.0,
      "verified": true,
      "author": "Animal Doctor",
      "helpful_votes": 2,
      "publication_date": 20181212
    },
    {
      "title": "Bright, solid, fair price..",
      "text": "The mount for the picatiny rail is a bit large in the diameter... Just barely clamps as the clamp bottoms out on the light body... I had to wrap the light with 0.005 brass shim stock to get a good tight fit... I coated the shim stock with no-corrode electrical paste to stop any corrosion between the 2 metals... I like it... I used a picatinny rail, rifle barrel mount, to mount to the 0.750 section of the bbl.. just ahead of the forearm.. I can turn on the light with my thumb to the button.. It's mounted 90 deg. to the left side of the bbl.. The beam is 1.6\" off set.. not enough to worry about..",
      "rating": 5.0,
      "verified": true,
      "author": "DAVEWASHINGTON",
      "helpful_votes": 2,
      "publication_date": 20190824
    },
    {
      "title": "Very nice for the cost. Good short range carbine acquisition.",
      "text": "Put this on both a 30-30 Marlin 336 and a 9mm AR15, and both stayed accurate after several magazines. I was able to fire accurately 'from the hip' without using sights at all, using the very visible green dot. This was bright Arizona sun, around 1pm, so it was fighting hard to be visible, but still worked very well out to 50 yards. Any farther than that in this light and I would need to use a scope to see the dot. In any other brightness setting, it should do just fine. a few hundred rounds through it now, and zero not changed much at all, maybe one or two clicks. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Ian W.",
      "helpful_votes": 2,
      "publication_date": 20190823
    },
    {
      "title": "Great Product",
      "text": "I have to say this is one of the brightest lasers I have seen, Very easy to mount with numerous options and everything is in the box, I have installed (3) so far and intend on installing a couple more soon. 22 cal,.556cal,.308cal and so far they have all held up well to recoil and have been very easy to sight in and have held zero ! At this price point what more do you want ? Don't hesitate on this item, grab them while you still can !",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 2,
      "publication_date": 20201006
    },
    {
      "title": "Toy for Kids",
      "text": "I don't really understand where are those good 5 star reviews are coming from, but my laser hold it just for about 10 shots. Either you guys are shooting a sling shots, either you use it on your kids toy guns, but in that case this little piece of crap should be marked \"NOT A REAL MAN TOY\". I got lucky to fire less than a dozen of 12 GA rifled slugs with my Duke 111 and that little green dot is gone for gooood! And I'm giving 1 star just because the previous 2 laser sights hold it between 2 and 3 shots, otherwise would be 0 stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Polar Tiger",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Perfect for astronomy!",
      "text": "You cannot buy a better laser pointer and kit. The quality of construction is outstanding--rugged, easy to hold, with milled mounting brackets readily adapted to fit on a telescope. The remote control is elegant and highly functional. We used this every single night we were open for operation at East Africa's first dedicated astronomical observatory. The teachers and students together were able to find objects in the night sky rapidly, or use the laser to guide the telescope during our alignment efforts. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Kai Staats",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Wow! Amazing especially for the price",
      "text": "To get a decent green laser even as a pointer for $25 is great, but this is REALLY great. I wish the mounting system was a little more versatile. The Laser to scope mount (some are calling it the “figure 8 mount” didn’t fit my scope so that was disappointing, however, I was able to mount it on the rail near muzzle and it tightened up really well. I am SO impressed with the dial in feature!!! I was able to dial the laser right in with my scope!!! Up and down/left and right.... Perfect!!!!! I will update after I send a few rounds but, I am blown away by this product for $25!!!! I have already started telling friends!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Erric Bonesmith ",
      "helpful_votes": 2,
      "publication_date": 20200928
    },
    {
      "title": "Can handle 300blackout recoil just fine",
      "text": "The tape switch is kinda junk but laser has stood up to supersonic 300blk just fine. Put a single wrap of electrical tape around it before you slide it into the mount or it will slide a bit. Mounted on the bottom of my rifle it is pretty accurate and is nice to have. I zeroed my optic at 100, and this laser was zeroed at 25yards. It works well out to 50. The knobs can get bumped but there are ways to fix that. Holds zero better than expected",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Incredibly bright laser",
      "text": "I read a positive review on a firearm enthusiast site and decided to give it a try. I'm very impressed by the brightness of this laser, the sturdy construction, and the ease of adjusting the elevation and windage. The knobs click as you make very slight adjustments with very good feel and I'd guess one click is about 1 MOA. Was able to dial it in quickly. On a slightly cloudy day I'm able to see the dot on the target at 100yds. You can see the dot in bright sun at 50yds+.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "These are NOT all the Same",
      "text": "I had bought a nearly identical laser sight a few days ago and was disappointed with it and returned it. While this one appears to be the same, it isn't. The mount is metal instead of plastic and much sturdier. I was surprised that the adjustment knobs are not covered with a cap, but they were easy to adjust with simple finger pressure instead of using an Allen Wrench. More to follow when I can take it to the range and see if she holds zero.",
      "rating": 4.0,
      "verified": true,
      "author": "James T. Davenport",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Turrets are not protected from accidentally turning.",
      "text": "I bought four of these to put on four air rifles, and labeled each one with what rifle they go on in case I do a quick detach. The one thing I dislike about them is that the windage and elevation turrets have no protective caps or a means to lock them down. When putting the gun away in a soft case I need to be extra careful that I don’t accidentally turn a turret while zipping the case shut and the turrets rubbing on the inner fabric of the gun case. That’s why only 3 stars",
      "rating": 3.0,
      "verified": true,
      "author": "BigRagu",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Light flickers and cuts off",
      "text": "Laser is bright, mounts decently. The remote button is trash. Button feels cheap, doesn't have any feedback or click when you press it that I like. Very soft pad for the button. Hard to explain, its just not good. Now, heres where it gets worse. Found when the barrel is lowered the light shuts off. Also flickers when firing. Something inside is loose and its just not getting a good contact. If you dont move it around or shake it, light stays solid. If incant get a return or refund, it'll be a cat toy... when it works.",
      "rating": 2.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "This thing is awesome",
      "text": "I'm using this as a laser finder guide for my telescope. It's very bright and seems to go forever into the sky. The green beam is very easy to see in the sky even before full darkness to help locating stars. The adjustment knobs make it very easy to align with the main telescope. Just point the scope at a star, turn on the laser and dial it to point at the star that you see in the main scope. It couldn't be easier. I 3D printed an adapter to go from the picanny rail mount that comes with the laser to the guidescope mount on the telescope and it works very well. I could not be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Oak Lea",
      "helpful_votes": 0,
      "publication_date": 20201031
    },
    {
      "title": "Great laser",
      "text": "A high-quality gun laser for $20? And green besides? Hard to believe. But when I saw the review of this laser at Pew Pew Tactical, I knew it would be worth a try. The value is off the charts: What I got far exceeds what I paid. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Don N.",
      "helpful_votes": 2,
      "publication_date": 20190411
    },
    {
      "title": "A handy addition to my AR15",
      "text": "I wanted a laser that was was small enough to fit my rifle in front of the hand grip, to be used for snap shooting out to 25-40 yards, especially in low light. This fits the bill perfectly I suppose that in self-defense situations this bright green light on a bad guy's chest will be sufficient to end any threat. It fits comfortably and sturdily on the picatinny rail under my barrel. Since the on-off switch is directly in front of my off hand grip I will not use the remote switch -- I can operate the switch with a knuckle while holding vertical grip.",
      "rating": 5.0,
      "verified": true,
      "author": "D. D. LeDu",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Laser dies after 3 mins but Battery is still charged",
      "text": "Still may send it back. The laser dies after 5 mins. Strange battery is still full. Turn it off fir 5 mins and it works for a few mins then goes dim again. At first I thought it was the battery but it’s something internal with the laser. It’s bright fir about 2 mins then 3-4 noticeably dimmer then by 5 barely can see it. The mount is sturdy but big and bulky. I can’t complain about the mount as it will stay attached...no problem. The laser is either defective or has some kind of strange power management issue. Look around but it is beefy and is durable.",
      "rating": 3.0,
      "verified": true,
      "author": "breeze90265",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Get one of these",
      "text": "I recommend the click push button to activate it vs. the momentary switch. In a situation you won't need it long enough to worry about making sure the thing doesn't remain on. I recommend you get a high quality high capacity batter before going into combat with it. Maybe a 2 pack and keeping the second in your plate carrier. It is easy to sight in. I had mine pointed at a target with my fixed sights and used the adjustments to put the dot exactly over top of my front fixed sight. Love. I would DEFINITELY buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Great unit, especially for the price",
      "text": "Attached to a 9mm carbine. It’s a bit larger than I would like, but it does the job. 100+ shots so far, and it’s holding zero. The remote switch is working so far, though I’m having difficulty finding a real good placement for that switch. Anyway, it’s a good unit - and for the price, it’s great. I will say it amuses me to see folks complaining that they mounted the device on a shotgun, and it won’t hold zero. If you need a laser for a shotgun, understand that you’ll need to spend a bit more than $28 to handle the recoil.",
      "rating": 5.0,
      "verified": true,
      "author": "gk",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Not bad",
      "text": "This is not a bad product. Seems sturdy enough. The laser is amazing. The bracket however leaves a little to be desired. It doesn't completely flush on my picatinny rail. It took a lot to tighten it so that it wouldn't move. The horizontal and lateral adjustments for site are nice. The pressure switch doesn't click on or off. You must keep it depressed for the light to sustain. Everything does seem well-made though for the money. After I sighted it in,it did allow me to hit my target.",
      "rating": 3.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Suitable, but not great, for star pointing",
      "text": "Yes, the beam is visible at night...no, it's not a light saber. The beam serves the purpose, but it's not \"in your face obvious\" as some more expensive/higher quality units might be. If you're looking to use this as a host for small star parties, or to guide friends and neighbors around the sky, file it under \"Ok for the price.\" If you're presenting to a larger crowd, or in a position (park ranger, tour guide, etc) where you'd be using it regularly for large groups, you can probably do better.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Boulton",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Take a gamble...",
      "text": "If you are buying this from Amazon it is worth the gamble, but the one I received looked used and the pressure pad barely worked. The laser was bright and if the pressure pad worked I may have been willing to keep it a while longer but I am just not a big fan of buying something new and opening it up and it looking used. The laser looks solid and if the package and pressure pad was a little better and it didn't look used this would be perfect, but in the condition I received it in I would not put it on my AR or even attempt to use it at the range.",
      "rating": 3.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Good Quality Unit,  Powerful Durable Beam.",
      "text": "works great. good range, you can see the beam even in daylight (indoors light or under foggy outside), have not used included battery so I can't help you with that. I'm not but it included it all n a nice little box,that in itself is sturdy and useful for anything (i know i know, but seriously its a good box). The unit is tough as nails, It has fallen several times with no problems, no lens changes etc. Quite frankly ive used the scope but not with a weapon, so i cant review the clamps etc.",
      "rating": 5.0,
      "verified": true,
      "author": "FrankTheDude",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Does Not Work For Deterring Birds",
      "text": "Product was shipped quickly, everything accurate in package, sturdy product, bright beam visible during daylight... but I read that lasers can scare away nuisance birds so I bought this one... it does not. The dang Grackles have started amassing in our trees, screaming their love cries of misery, clacking and creaking like the unlocked barn door in a horror film. Their call is not the lark of spring but the nails-on-chalkboard of insomnia. I lasered the crud outta one male and all he did was turn his head away to continue his joyful cries of despair. Anyone have any non-shooting suggestions on how to get rid of grackles and not the other birds?",
      "rating": 4.0,
      "verified": true,
      "author": "valgal",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "A lot good, some not so good",
      "text": "This flashlight shaped laser is very durable and mounts solidly to any picatinny rail. The green beam is very bright and viewable at 50 yards in daylight. However the velcro supplied to mount the remote activation pad is worthless. The glue remains on the backing plastic and then does not stick onto the pad or stock. Had to buy quality velcro from the hardware store to the on/off sensor. Lately the mount on the picitinny rail loosens up necsesitating re-adjustment.",
      "rating": 2.0,
      "verified": true,
      "author": "Harv",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Awesome for Astronomy Outreach",
      "text": "If you're buying this for the purposes of astronomy outreach, this is a fantastic pointer at a great value. It's got a nice heavy build, so if you happen to drop this and even step on it, it's good to go. It's also perfectly bright! Any time I'm showing people at a star party where the telescope's pointed, they all know exactly where they're looking in the sky. The beam is solid enough and reaches for days. I can't speak to this as a rifle or pistol laser, but for astronomy, it's great!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerod",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Good and Bad",
      "text": "Nice green laser works well with the on off button. Read reviews laser switch is a problem as it stops working after a couple of rounds. Also I email the seller about the velcro thats stuck to the rapper that is impossible to remove without all the glue, no reply. I will be returning for a higher quality laser. What good is it if it fails when you really need it to work.",
      "rating": 1.0,
      "verified": true,
      "author": "MB ",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great value",
      "text": "I just received the sight and what a value! I'm amazed by the price. I will be using it as a rough pointer/finder on a 14\" astronomical telescope. Competing products sold by telescope or astro accessory manufacturers cost 3 to 6 times as much, are much bulkier and do not have the features or sophistication of this device. I wasn't searching for a gun sight and don't know whether there are better values in that market, but I would be surprised if you can do better for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Morris",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Bright and holds true! Ruger 10/22",
      "text": "Placed on my Ruger 10/22. It took 10 or so rounds to get it sighted in at 40 yards. Sent 430 rounds down range in one day. Still grouping within an inch at 40 yards. Really bright. Built well. Packaged well. This is the second Pinty laser I've purchased. This one is way better. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "No Regrets",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "almost great. Updated to 1 star",
      "text": "It's a good laser, works well in the house. The only thing was I ordered a different brand laser a few week back and for a couple dollar more you can get a better one. This didn't come with a rechargeable battery, just regular ones. The pressure switch only has one mode. Updated: Zero star!! Finally I took it out shooting. 2 shoots and it stopped working. Took the battery cover off and all of the inside fell out. Very disappointing. Will return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom55st",
      "helpful_votes": 0,
      "publication_date": 20190417
    }
  ],
  "product_meta": {
    "title": "Pinty Hunting Rifle Green Laser Sight Dot Scope Adjustable with Mounts",
    "rating": 4.4,
    "feature_bullets": [
      "DURABILITY, made of aerospace grade aluminum, our laser sight features 532 nm wavelength, works well in any weather conditions",
      "POWERFUL GREEN LASER, highly visible green laser in any environments with improved accuracy, reaches up to 100 to 300 ft. during the day and up to 1000 ft. at night",
      "CONVENIENCE & COMPATIBILITY, comes with a remote control to easily switch laser on and off; complementary 1\" barrel clamp mount and figure 8 mount to make this laser compatible with any 20mm width weaver rail base",
      "UPGRADED OPTICS contribute to a super sharp and bright green laser sight, providing unparalleled clarity for the naked eye",
      "PERFECT for novice shooters as well as professionals, our laser scope is a must-have for anyone with a shotgun and can be used regardless of plinking or shooting competitively"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "6.4 x 5.3 x 2 inches; 10.41 Ounces",
      "Item model number": "Pinty GLS",
      "Date First Available": "December 23, 2015",
      "Manufacturer": "Pinty",
      "ASIN": "B019Q05CNY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Airsoft & Paintball",
      "Gun Scopes",
      "Sports & Fitness",
      "Airsoft",
      "Sights & Optics"
    ],
    "price": 24.99
  }
}