{
  "website_summaries": [
    {
      "verdict": "Outperforms its competitors in power and comfort. The best backpack blower available today.",
      "pros": [
        "Provides exceptional power that works for residential and commercial applications",
        "Harness sports lumbar support and padded shoulder straps for optimal comfort"
      ],
      "cons": [
        "It's pricey, and the warranty is only good for 1 year"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easy to start and easy to use",
      "text": "Very powerful and very quiet. If you clean leaves on paved surface, you do it at minimum power level. This means you can use this blower early in the morning and late at night as well (if you need to). Totally different from the noisy 2-cycle blower available in the market. Easy to start and easy to use. I give a full five-start rating to this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kazuya Terakado",
      "helpful_votes": 6,
      "publication_date": 20171017
    },
    {
      "title": "Engine failure after second use.",
      "text": "Blower came on time. Bought the Makita oil for the blower and started using the first day for about 1 hr and all was fine. Next day worked for maybe 30 minutes and had lose of power and eventually died. Would start but only idol speed. Looks like I got a melon. Im sure the Makita blowers are fine and this was a defect in the motor as the oil was black and had metal in it. Returning for full refund and will buy a Styhl at a local dealer so if anything comes up back it goes. Hopefully the refund will go through with no issues as I only had the blower less than a week.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180517
    },
    {
      "title": "Absolutely the best leaf blower I have ever owned",
      "text": "You can't beat this leaf blower none of the leaf blowers that require oil gas mix work as effectively or quietly as this one does! All I have to do at the end of the season is empty the gas out and at the start of a new season might change the oil. My air filter still looks new. Update after 18 months. Still runs like new. I use a premum oil and am presently looking for a magnetic dip stick to help preserve the life of this workhorse!",
      "rating": 5.0,
      "verified": true,
      "author": "JF",
      "helpful_votes": 8,
      "publication_date": 20170208
    },
    {
      "title": "Best backpack blower I've used.",
      "text": "After reviewing the machine, it was immediately put to use on a 2 acre yard. The machine had great power, was easy to use and start. The weight was not noticeable to me. For any backpack blower, I'll recommend heading protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 5,
      "publication_date": 20171127
    },
    {
      "title": "Done a great job! He has a bad back but this ...",
      "text": "My husband uses the leaf blower a lot since we live on top of a mountain among thousands of trees. This helps him out sooooo much. And he used it to clear all the leaves off the Monastery cemetery where our son is buried. Done a great job! He has a bad back but this helps him from hurting his back so much. Raking done a lot of harm to his back. We LOVE it!",
      "rating": 5.0,
      "verified": true,
      "author": "Joan Sorg",
      "helpful_votes": 2,
      "publication_date": 20180117
    },
    {
      "title": "They have a rock solid bullet proof answer for all bad gas lol",
      "text": "Bought a few months ago, used about 10 times....Now 0 power bogs down on throttle. So much for changing Oil a whopping two times in ten hrs and using fresh gas. Don not understand how these companies keep releasing poorly made products.. Also almost 0 dealers repair these,, Makita comes out with a Flawed new design that is seriously a Mess and than No one can fix them.Found one dealer and it has now been in shop 4 months while that dealer waits for part.. Unrel..My days of buying anything Makita EVER again are over",
      "rating": 1.0,
      "verified": true,
      "author": "mercs",
      "helpful_votes": 2,
      "publication_date": 20180727
    },
    {
      "title": "etc around easily. The harness would be better with a strap/clasp ...",
      "text": "It's a little harder to start than advertised, but when it fires up it pushes a lot of air, leaves, etc around easily. The harness would be better with a strap/clasp across the front as the torque tends to pull the left shoulder strap off the shoulder. Due to it's high output, I only use the short tube and nozzle. With the extension on, it's difficult to hold down and long sessions of clearing leaves get tiring. It does use the oil, so keep an eye on that if it's used regularly.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken F",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Awesomeness!!",
      "text": "Awesome power...not as heavy as I thought it would be. Great machine!!",
      "rating": 5.0,
      "verified": true,
      "author": "jackpineman",
      "helpful_votes": 4,
      "publication_date": 20161203
    },
    {
      "title": "A Powerful Backpack Blower",
      "text": "Excellent blowing power; easily controlled; use of no-mix fuel a definite plus; heavier than expected; side straps exceedingly difficult to adjust; in dire need of hip belt that *CANNOT* be found/ordered, despite user manual stating that this belt is an order option.",
      "rating": 4.0,
      "verified": true,
      "author": "Nate93",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Best blowers to buy",
      "text": "Great blower my husband loves it and I gave it to him for Christmas this year 2017 and he used it right away he loves it works like it says and it meets Everything it says it does",
      "rating": 5.0,
      "verified": true,
      "author": "Tuttirock",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Backpack Blower",
      "text": "Simply the Best of Breed. This newly designed unit is consistently besting the other brands in this category.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "I liked it's power",
      "text": "I liked it's power, however, as it is in the shop to repair a broken cam shaft for the second time, it appears to be a piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard M King",
      "helpful_votes": 2,
      "publication_date": 20180112
    },
    {
      "title": "Love it. So much easier than raking",
      "text": "Love it. So much easier than raking. Much less time consuming. Not too heavy and I'm a small 5ft. 50something year old. Definitely recommend it. Hardest part was pull starting it.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen Kennedy Gallagher",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "A little heavy",
      "text": "Love my Makita backpack blower but it is a little heavy. If I have it on full blast it will push me sideways, puts a strain on the hip.",
      "rating": 5.0,
      "verified": true,
      "author": "angelajtu",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Wonderful!",
      "text": "This is heavy. It is absolutely fantastic! I can't say enough about how well it works and how cool it is to not have to fiddle with mixing gas and oil.",
      "rating": 5.0,
      "verified": true,
      "author": "DNe",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Didn't like the two handed approach",
      "text": "Too heavy for comfort. Didn't like the two handed approach.",
      "rating": 1.0,
      "verified": true,
      "author": "Bernard O. Kelly",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "If you need heavy duty performance, this is your machine.",
      "text": "Easy to assemble. Easy to start. Very powerful. Perhaps a little heavy.",
      "rating": 4.0,
      "verified": true,
      "author": "stephen colestock",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Love the size and how quite it is",
      "text": "Love the size and how quite it is. Quality made and powerful backpack. The throttle and on/off button are too close to each other. Easy to cut the blower off (accidently) while using the throttle.",
      "rating": 4.0,
      "verified": true,
      "author": "Fil Bondurant",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Makita is the best backpack blower on the market",
      "text": "If Honda were to make a backpack blower....this would be it....This Makita backpack blower runs and starts like a Honda. Powerful & quiet. Handle is well balanced. Quality plastic & controls. Easy to pull and starts by the second pull. Comfortable. Gets the job done extremely fast because of its high volume 670 CFM. Hip throttle is comfortable and convenient. And of course, we can't forget that its four stroke. Runs cleaner then the 2 strokes and it is less maintenance.",
      "rating": 5.0,
      "verified": true,
      "author": "umm",
      "helpful_votes": 13,
      "publication_date": 20160921
    },
    {
      "title": "Powerful and Easy to Use",
      "text": "Much more powerful than hand held blowers. Controls are all within easy reach when it is on your back. Overall am very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Enviromently friendly but too heavy to work with for an ...",
      "text": "Enviromently friendly but too heavy to work with for an extended period. CFM didn't seem to be increased compared to smaller models.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Amtrak",
      "text": "I know Makita is a good name other than that I have not tried it yet",
      "rating": 5.0,
      "verified": true,
      "author": "Amtrak",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "I used this twice and already it wont start up ...",
      "text": "I used this twice and already it wont start up. It even backfires.. The only Makita authorized repair shop is 40 miles away. Don't get this.",
      "rating": 1.0,
      "verified": true,
      "author": "Marcia",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Would not recomend",
      "text": "Not only is this blower very heavy and cumbersome Its shocking! I was in a cloud of snow and within seconds could barely function as I was being electrocuted, yes ELECTROCUTED. I did call Hitachi customer service but no response. All the power not worth the pain, I want my husky back.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "also a little disappointed that the made in",
      "text": "Powerful but a little heavy...also a little disappointed that the made in China",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 5,
      "publication_date": 20160426
    }
  ],
  "product_meta": {
    "title": "Makita EB7650WH 75.6 cc MM4 4-Stroke Engine Hip Throttle Backpack Blower",
    "description": "Makita's 75.6 cc MM4 Hip Throttle Backpack Blower (EB7650WH) combines a cleaner-burning 4-stroke engine with quieter operation and the convenience of no fuel mixing.",
    "rating": 3.9,
    "feature_bullets": [
      "Powerful fuel efficient 75.6 cc (3.8 HP) MM4 commercial duty engine",
      "Mechanical automatic engine decompression for quick and easy starts",
      "Hip throttle with cruise control and convenient on/off switch",
      "Shoulder straps engineered with multiple adjustments for improved fit",
      "Large capacity muffler ensures quieter operation (76 dBA)"
    ],
    "specifications": {
      "Product Dimensions": "16.7 x 22.3 x 24.7 inches",
      "Item Weight": "33.5 pounds",
      "Manufacturer": "Makita",
      "ASIN": "B019FHNRSK",
      "Item model number": "EB7650WH",
      "Customer Reviews": "3.9 out of 5 stars33 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#283,983 in Patio, Lawn & Garden"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Leaf Blowers & Vacuums",
      "Outdoor Power Tools",
      "Garden & Outdoor"
    ],
    "price": 639.99
  }
}