{
  "website_summaries": [
    {
      "verdict": "The New Balance 85 was considered an excellent walking shoe because of how comfortable it was when used for long on-foot travels. People generally liked its style, lightweight nature, and perfect fit. There were even claims that it helped relieve foot and back pains. However, its construction could be improved by lengthening the tongue for full instep coverage to prevent irritation. The fit and sizing were also points of displeasure, along with the eyelets that soon tore off, and the outsole that easily wore out and had insufficient traction. Though many raved about the footwear’s style and comfort, the durability and construction issues left several consumers with no choice but to return it.",
      "pros": [
        "The majority claimed that the New Balance 85 was an extremely comfortable shoe for long walks",
        "The style and colorways of the trainer delighted many consumers",
        "The shoe fit perfectly, according to numerous owners",
        "Plenty of users liked its lightweight nature",
        "It did not need breaking in, as stated by several testers",
        "A handful of wearers said that it provided a stable platform for walking",
        "Some individuals claimed that using it relieved their foot and back issues",
        "The product was deemed reasonably priced by a few buyers",
        "Its ability to accommodate custom orthotics was also appreciated"
      ],
      "cons": [
        "Numerous people complained that the tongue was short and constantly moved out of place, which caused the laces to irritate the instep",
        "The New Balance 85 was perceived to be smaller and narrower than expected",
        "A good number of commenters mentioned that it did not provide any arch support",
        "The insole was too thin and felt uncomfortable, which caused a good number of users to return the product",
        "The laces were also not long enough to be tied properly, remarked several reviewers",
        "There were also structural issues such as the webbed eyelets that quickly tore off, the ill-fitting insole that caused discomfort, and the mesh that developed a hole in just a few months of regular use",
        "A handful of individuals wished there were more color options to choose from",
        "Some consumers had issues with the outsole as it wore out quickly and lacked traction",
        "A few testers did not like the rocker-like design of the sole unit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.4,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "I am so disappointed in this shoe",
      "text": "I am so disappointed in this shoe. Having worn NB shoes for YEARS it has become my go-to shoe for guaranteed comfort and style. This one is super cute (gray/lime) but drops the ball in comfort. The description touts a memory foam sole. Beware this is a very thin piece of foam that smashes completely down to a rock hard foot bed upon standing. The shoe has no arch support either. This shoe isn't made of breathable material either. I can't imagine using this as a walking shoe which is what it is classified as. Pass this one up!",
      "rating": 1.0,
      "verified": true,
      "author": "jeannemeece",
      "helpful_votes": 23,
      "publication_date": 20161026
    },
    {
      "title": "Not durable, not for fitness walking",
      "text": "I've only had these a month and the tread on the bottom is already completely worn down in a few spots. I walk about 20-25 miles a week so I buy new shoes frequently and there's no way these will last my normal 4 months. Other than that they're fine, the rest of the shoe is holding up well, just not the sole which is what matters.",
      "rating": 1.0,
      "verified": true,
      "author": "mo_shun",
      "helpful_votes": 4,
      "publication_date": 20170727
    },
    {
      "title": "These are pretty comfy shoes",
      "text": "These are pretty comfy shoes. And I like that they look like mesh but are thicker. Shoes with mesh on them I seem to wear out so fast the mesh seems to shred? I do have wide feet and have a hard time finding shoes. This is a little tight on my \"bad foot\" but fits well besides.",
      "rating": 4.0,
      "verified": true,
      "author": "kathryn",
      "helpful_votes": 4,
      "publication_date": 20161024
    },
    {
      "title": "New Balance",
      "text": "I have given some wear with these sneaker. I normally wear Nike becasue they are comfortable but decided to give these a try. They have a memory foam inside. They are comfortable to wear for walking and standing long periods of time. I have back problems so these worked for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Theresa Bell-Lias",
      "helpful_votes": 3,
      "publication_date": 20171219
    },
    {
      "title": "Different from my other NB shoes",
      "text": "I love New Balance shoes. I have four other pairs. The new ones are pretty different from all my others though. They are very, very light in weight, and they are large. I bought a 6.5D as usual, but these shoes fit my friend whose feet are a 7.5. They are comfortable and don't slip off when tied tightly, but they are big, and their lightness makes me question their longevity.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Wilson",
      "helpful_votes": 2,
      "publication_date": 20170619
    },
    {
      "title": "Not wide but comfortable.",
      "text": "These shoes are adorable! They are very comfortable but do run a bit snug. They are not as wide as I had expected from New Balance. They came very quickly although the box was damaged (assuming from shipping) but the shoes have zero flaws. These are a steal at this price and I personally recommend them and have already sent the link to my friends and family.",
      "rating": 4.0,
      "verified": true,
      "author": "JWilson",
      "helpful_votes": 5,
      "publication_date": 20170102
    },
    {
      "title": "Not impressed",
      "text": "Not my favorite shoes. I think in the future, I will stick with Fila. I normally wear a 7.5B in Filas. I read that these ran small so I ordered a 7.5 C/D, thinking that they might run narrow. They were still tight. It took 2 weeks to break them in. I work 12 hour shifts so it was the most miserable 2 weeks ever. I'm not impressed with the memory foam either. The foam feels cheap and isn't nearly as comfortable as my Fila memory foam.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Could be better",
      "text": "These shoes are a little light on arch support and cushioning. Also, the inside of the shoe is covered in a satiny material which can make it a little slippery. As my shoelaces loosen throughout the day, I noticed my foot slipping around inside the shoe and it wasn't very comfortable. It wasn't a fit issue, but the satiny material. They are nice looking, though. I will probably wear them more for leisure than for activity.",
      "rating": 3.0,
      "verified": true,
      "author": "Nuh-uh",
      "helpful_votes": 3,
      "publication_date": 20170413
    },
    {
      "title": "Good for the price",
      "text": "All good, but... i just bought acics gel lite 3 and the acics feels a lot better quality. So nb needs to improve size fit. Quality is ok and are confortable enough. Note:Should have ordered half size smaller.",
      "rating": 4.0,
      "verified": true,
      "author": "Senior Verdad",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "New shoes",
      "text": "I like these shoes they have memory foam too. Also like the color it's different...",
      "rating": 5.0,
      "verified": true,
      "author": "jan",
      "helpful_votes": 3,
      "publication_date": 20170401
    },
    {
      "title": "I am happy with my order",
      "text": "I am happy with my order. I usually buy various New Balance Women walking sneakers because they are comfortable for a long walking. I know my size, use same size and it fits on my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "C. M. Alvarez Orrbon",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Love these",
      "text": "Very comfortable, this is my 3rd pair , so glad my husband turned me on to this brand!",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Three Stars",
      "text": "Nice sneakers but not for me my arches hurts after 15 minutes of walking had to return them",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara C Osterhout",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "And they are super comfortable. I do have high arches and they ...",
      "text": "I bought these for my nightly walk/jog. And they are super comfortable. I do have high arches and they are a little tight in that aspect, but everything else fits great.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachael Scace",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Not comfortable and sweaty",
      "text": "I have worn New Balance in the past. These were not comfortable. Too sweaty and he sides of my feet hurt. I wore on my carpet for a few minutes and had to return.",
      "rating": 2.0,
      "verified": true,
      "author": "Robyn_R",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "light weight and comfortable",
      "text": "So light weight and comfortable. I wear a 9 / 9.5 in regular shoes but always wear a 10 in running shoes. I have high arches and a neutral gait. This is my first pair of New Balance and I am considering buy them again in other colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn Peterson",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Very comfortable",
      "text": "New Balance 85v1 Walking Shoe is extremely comfortable and well constructed for walking. Chose 4 stars because they are a bit snug across the arch of my foot, as well as the laces being too short. I prefer to lace up to the top for stability for walking on terrain.",
      "rating": 4.0,
      "verified": true,
      "author": "Q LO'",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Great shoe",
      "text": "Great shoe. Fits great and is light and cool. Couldn't get the shoe from usual shoe source, but Amazon had them - very nice!",
      "rating": 5.0,
      "verified": true,
      "author": "palisades dweller",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "These are winners.",
      "text": "Extremely comfortable and light-weight walking shoe. Looks great with street wear as well as exercise clothing. Very supportive.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria Schwartz",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Three Stars",
      "text": "Top inside of shoe presses down painfully on my foot. I'll be returning.",
      "rating": 3.0,
      "verified": true,
      "author": "anne kelly",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Good shoes",
      "text": "Good walking shoe. 1/2 my shoes are New Balance. Love this show. Yes, I'll be ordering more in my future.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda9130",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Great quality shoe - great fit.",
      "text": "Bought for my sister who is on her feet 9 hours a day. She loves them and says they are the most comfortable shoes she has worn.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Cat Designs",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Runs Large",
      "text": "Nice looking shoe. I ordered an 8 which is the size I wear in running and cross training shoes. This shoe fit me somewhat large. I need to wear them with thick socks.",
      "rating": 4.0,
      "verified": true,
      "author": "RAS",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "I do not like the net on the toe of the shoe",
      "text": "I do not like the net on the toe of the shoe. I buy these all the time and , for me, the netting does not Stand up to my wear and tear. I wear my athletic shoes daily. I have them on now and they are leather.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia Lester",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Five Stars",
      "text": "Great product for a perfect price. Super comfy and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy Hires",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Shoe Lace Holder Loop Came Unstitched in 2 Months",
      "text": "I have bought this exact brand before and have had at least a year out of them with everyday wear. The new I pair I bought here lasted 2 months before one of the shoe lace holder loops got ripped at the seams.",
      "rating": 1.0,
      "verified": true,
      "author": "bert j frederich",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Five Stars",
      "text": "I love new balance shoes! I'm a walker and the shoes are great!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Gildner",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "I would not buy these again!",
      "text": "I wore these after it rained and the sidewalks were still wet. Slid everywhere in them! Very slick bottoms! I do not like them. They are comfortable is the only thing positive I can say about them right now...",
      "rating": 2.0,
      "verified": true,
      "author": "Lu Ann",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Five Stars",
      "text": "very comfortable it was for my friend and she is delighted",
      "rating": 5.0,
      "verified": true,
      "author": "AKELA",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "dissatisfied",
      "text": "Not the quality I was expecting from such a reputable company. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Tara Fanning",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Great shoe!",
      "text": "Comfortable and attractive shoe. Sturdy and doesn't look like an 'ortho' shoe!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Tounge Slides",
      "text": "The only issue I have with this show is it does not have a way to keep the tounge in place and it slides around. Shoe looks good and is of good quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "very nice design, but very tight and not comfortable at ...",
      "text": "very nice design,but very tight and not comfortable at all:(",
      "rating": 1.0,
      "verified": true,
      "author": "Viktoria",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "too narrow",
      "text": "it was narrow and wasn't comfortable to wear. returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "M. BARE",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "A good buy if they fit you.",
      "text": "Sent them back, seam on top was too tight for my foot.",
      "rating": 3.0,
      "verified": true,
      "author": "Grammie Gee",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Excellent Shoes for the Money!",
      "text": "My wife loves these shoes for her fast morning walk every morning. She indicated that they felt great and the memory support foam works well. Good value for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "bcoop",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Quality NB as always.",
      "text": "Great shoes, love the color, light weight. I would like the tongue to be a bit wider to keep it from slipping left or right a bit. But that is a personal preference.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy M. Delk",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "I need a refund. Shoe did not fit.",
      "text": "I did not get my refund. I returned this shoe!",
      "rating": 2.0,
      "verified": true,
      "author": "Cynthia M Howell",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Soooo comfortable!",
      "text": "I love these shoes. They are so comfortable I can wear them all day and on any surface (walking the dog in the park, we go from black top to grass to mulched paths).",
      "rating": 5.0,
      "verified": true,
      "author": "EL",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Comfortable",
      "text": "Arrived sooner than expected, fit well, but is cut a little lower at the ankle than expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Bonni",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "New Balance Women's 85v1 Walking Shoe",
      "text": "Pretty good fit and a pretty good price. Great combination.",
      "rating": 4.0,
      "verified": true,
      "author": "Stig Schmatta",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Fit fine the other new balance pair was disappointing",
      "text": "Fit fine the other new balance pair was disappointing.They were the same size however bigger than the old pair even both are the same size and width!",
      "rating": 4.0,
      "verified": true,
      "author": "Pam Klein",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "One Star",
      "text": "Super cute I ordered wide but they still don't fit and were way too tight!",
      "rating": 1.0,
      "verified": true,
      "author": "Teresa M Jones",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "too narrow",
      "text": "these shoes are more narrow than other new balance shoes. i found that they did not have enough cushion. returned product.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Not a sore foot to be found!",
      "text": "This shoe runs a big small. I usually wear a 7.5 and I ordered an 8. My orthotics fit great. I wear these everywhere, they're so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca P.",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "I love about it",
      "text": "I love about it, it was low cut in the back where it wasn't rubbing the back of my ankle.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia Smith",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Two Stars",
      "text": "the shoe is not wide enough..or maybe I just need to stretch them out more.",
      "rating": 2.0,
      "verified": true,
      "author": "lane anderson",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Love these shoes",
      "text": "Love these shoes! I feel like I'm walking on a cloud. Super comfy! Super cute! I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 3,
      "publication_date": 20160906
    },
    {
      "title": "My dog absolutely love this. Unlike some other brands where they mention ...",
      "text": "My dog absolutely love this. Unlike some other brands where they mention the sticks to be of a certain size which they actually aren't -these bully sticks are all equal size and true to the size mentioned. It says it's USDA organic and FDA approved. As far as I know pet foods are not regulated or approved by any govt agency.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161207
    }
  ],
  "product_meta": {
    "title": "New Balance Women's 85v1 Walking Shoe",
    "description": "New Balance is dedicated to helping athletes achieve their goals. It's been their mission for more than a century to focus on research and development. It's why they don't design products to fit an image. They design them to fit. New Balance is driven to make the finest shoes for the same reason athletes lace them up: to achieve the very best.",
    "rating": 3.9,
    "feature_bullets": [
      "Imeva hr midsole",
      "No-sew material application",
      "Outer Material: Synthetic",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Heel Type: no-heel",
      "Shoe Width: Medium womens_us",
      "Nb ultra-soft comfort insert"
    ],
    "specifications": {
      "Product Dimensions": "12.7 x 12.7 x 1.78 cm; 208.65 Grams",
      "Date First Available": "14 July 2016",
      "Manufacturer": "New Balance",
      "ASIN": "B01LZ1RR8V",
      "Item model number": "WA85V1 Athletic Walking Shoe-W",
      "Department": "Women’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Women's Shoes",
      "Shoes & Bags"
    ],
    "price": 56.68
  }
}