{
  "website_summaries": [
    {
      "verdict": "If you need a compression shirt for cold weather, you won't find a better option.",
      "pros": [
        "A versatile option at a valuable price",
        "Provides features similar to costlier styles, including comfortable compression"
      ],
      "cons": [
        "Doesn't provide much warmth in cold conditions, but it's comfortable to layer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Comfortable to wear all day under dress shirt",
      "text": "Fits tight as a compression shirt should. Comfortable to wear all day under dress shirt. Can't comment on long term durability, but looks and feels nice so far. Four stars only because I feel it is a little pricey for what it is, an undershirt. Update 5-31-15. This shirt really has performed well. I updated to 5 stars as it has been used heavily for wearing under work clothes. It's been through several washes and is still tight and fits nicely with no irritation. Update 3-13-16. I like this shirt so much I have bought 4 more because I wear them so much. Still holding up extremely well and isn't discoloring or getting loose.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Dunham",
      "helpful_votes": 32,
      "publication_date": 20150405
    },
    {
      "title": "A little more, but worth it",
      "text": "Yes, Under Armour is more than the other brands on this site, but it is worth it. My husband likes to wear these under his work shirts for a little compression and to keep his shirts looking neat. We are in Texas and this is \"heat gear\" it truly keeps him cooler on those 100+ days. They are well made with durable stitching and they come out of the wash just like new. Great to wear as just a t-shirt or as an undershirt. The v-neck is nice because it is not visible under a business casual polo shirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie N. Bean",
      "helpful_votes": 7,
      "publication_date": 20180607
    },
    {
      "title": "Quality shirt",
      "text": "My husband is six foot three and weighs about 300 lb not fat, huge bones, he's into lifting. He absolutely loves this shirt. They fit as expected the first one I bought was a 3X, he lost weight and went down to a 2X and they fit him like a glove not too tight. He loved his so much I ordered myself one to wear under shirts that I don't want hugging my body. I'm 5 foot 2 weigh 145 , I ordered a medium it does the job, my clingy shirts no longer cling, just fall nicely around my hips ! I will keep buying these as my husband wears them out !",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Griffiths",
      "helpful_votes": 4,
      "publication_date": 20181207
    },
    {
      "title": "Helps with loose skin issues!",
      "text": "So having lost over 120 pounds I have some loose skin issues and after watching some youtube video on people with the same problem I tried out one of these. Its worked great for this lets me work out without bouncing all over but not as constricting as shape wear. I personally get them one size smaller then I normally wear. I own 5 of these now in the last year and I am sure I will get more as I continue to lose weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy B",
      "helpful_votes": 3,
      "publication_date": 20180727
    },
    {
      "title": "The best undershirt every made!",
      "text": "I wear these every single day. I wore the crew neck version which is now discountinued in white for the last 10-12 years every single day. I love these. The compression is just right and these help protect nice shirts from pit stains and also helps the shirts drape nicely instead of bunching up. Keep in mind that these will eventually wear out. I usually replace mine every 2 years as they lose their vibrant white color over time.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Beard",
      "helpful_votes": 2,
      "publication_date": 20171116
    },
    {
      "title": "shredded and falling apart during 1 use",
      "text": "I have bought at least 10 of these over the years. This particular item, turned a funky grayish color while wearing it then it started to shred and fall apart. I asked for help from Under Armour and Amazon. no one helped. I will post photos of it. It is complete garbage and I've been a loyal Under Armour buyer since day 1. Terribly disappointed in both Amazon Prime and Under Armour. Will not buy again",
      "rating": 1.0,
      "verified": true,
      "author": "Body by Raven",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Very disappointed in quality",
      "text": "I have owned many UA shirts and have been impressed with the quality and fit of all of them... until now. I don't know if someone was having an off-day when they made this one or what, but there were threads sticking out in multiple places. On top of that, the fit was not great. It just seems to be an overall compression fit instead of targeting specific areas. Also the softness could have been better. I think part of the problem is that the seams that run in front of the shoulders are too abrasive. This has me thinking twice about buying any more UA shirts... especially at the prices they charge.",
      "rating": 2.0,
      "verified": true,
      "author": "sbarne3",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Holes within the 1st 2 weeks.",
      "text": "Live the compression and the v neck. Love that its breathable. I wear them under a uniform at work and a tactical vest and then uniform go over the top. I usually dont buy underarmour because of the price but did this time. I had my starter ones for 3 years and the hems and fabric are still holding. These got holes within the first 2 weeks in non stress points. I'm very disappointed they didnt even last a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi H.",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Great shirt, get this one",
      "text": "This is by far the best one I have bought. I have tried the $60 shirt the $10 and many in between. What makes this one different is they way they wrap the sides and the quality of the shirt but in particular the shirt collar. It sits low enough for dress shirts without a tie and it lays flat and doesn’t curl. I have been wearing it for about two months now and it is going strong. I just ordered another white one and a black one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "V Neck Compression shirt",
      "text": "I wanted a v-neck compression shirt, and those are hard to find. This is Nice and stretchy. Breathable and well-cut. I got a large which is about right. If I wanted more of a compression fit, I bet a medium would fit, but would probably be a little snug in the waist (34”) for a middle aged set of love handles. Not the least expensive option, but it’s a quality product, so no regrets there.",
      "rating": 5.0,
      "verified": true,
      "author": "fwill",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Perfect for what it's for",
      "text": "I wear a L/XL t-shirt and ordered the L. Perfect size as a compressions shirt for working out. Not too tight to cut off circulation but tight enough for compression. and as an undershirt. Moisture wicky and doesn't stink. I'm a fit-ish 6'1\", 215lbs, 36\" waist and the L works well for me",
      "rating": 5.0,
      "verified": true,
      "author": "Awesome73",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Don't expect the type of compression you get from a Spanx for Men Undershirt",
      "text": "I really can't complain too much about this purchase when I re read the description of the undershirt. I am not buff, but moderately overweight, and was hoping this might \"corral\" my junk. Well...I guess I was expecting the compression of a Spanx garment, which BTW will run you about 72 bucks. This is probably a great shirt if you are already in shape and wanting to accentuate your hard earned muscles. It is certainly comfortable and moisture wicking. It is well constructed. However, If you are looking for a shirt to smooth your bulges like I am, spend the extra money for a high compression Spanx for Men V-neck. You will not regret it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 14,
      "publication_date": 20140228
    },
    {
      "title": "Son wears as undershirt under dress shirts",
      "text": "My son wears these as an undershirt and likes the tighter fit than a normal undershirt, to be smooth under other shirts. He says they are lightweight and cooler to wear. The sizing seems to be correct to fit snugly as shown in the picture. He is wearing a 2X, and is 6'4\" about 250lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Thompson",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Tight with short sleeves",
      "text": "I expected compression, but this thing is super compression. It is tighter than all my compression shirts of the same size. I think part of that though is due to the thick (quality) material. The sleeves are shorter than I would like, so they ride up into my pits.",
      "rating": 4.0,
      "verified": true,
      "author": "Christian Sanich",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Great shirt!",
      "text": "I need to wear compression shirts because of a medical problem. I've tried a lot of different ones, but THIS specific type (Under Armour Heat Gear compression) has been the best for me. They're comfortable, a nice fabric and well made. There's just enough compression. I like the \"Tactical\" ones even better! Under Armour is very proud of their logo and splashes it on the front and back of their shirts in a contrasting color. This will show through if you wear a light colored shirt. The \"Tactical\" versions take care of this by making the logo the same color as the shirt. Now I can wear a white dress shirt to church without advertising my underwear manufacturer! ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Anchorman",
      "helpful_votes": 2,
      "publication_date": 20140213
    },
    {
      "title": "Super Small Compression Shirt",
      "text": "Okay, so this is a super compression shirt. Don’t get misled by the picture which makes it look like something you could wear out. This may be good as a base layer or if you work out at a gym where men wear super compression clothes.",
      "rating": 3.0,
      "verified": true,
      "author": "Shai Albrecht",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "I like it. I am unable to compare to other ...",
      "text": "I like it. I am unable to compare to other products as this is my first compression shirt. I am 6' and 250lb...fat(ish). I ordered a large. At first glance I thought I ordered the wrong size. It look small and narrow for my frame. Well, it fits well. I put it on and it got well. Wore it to my work out class. It felt great. I plan on wearing compression shirts as my under shirts. My only discomfort is the price. I'm going to buy a different brand at academy sports this weekend for $13 to compare.",
      "rating": 5.0,
      "verified": true,
      "author": "ajaikarran",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "The compression shirt has holes along the sides of the ...",
      "text": "The compression shirt has holes along the sides of the shirt after just a few weeks. The UA heatgear V-neck shirt I've been wearing for at least 5 years? No holes. What happened?",
      "rating": 1.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Good Looking Shirt for both the Gym and Around Town",
      "text": "Great looking v-neck, fitted compression shirt. This shirt will show off your love handles because of it's compression so watch for those. I'm a 46-inch chest and the XXX-large fits perfectly. The material is silky soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan S. Higgins",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Surprisingly effective",
      "text": "I got this just to HELP with keeping cool while running around organizing conferences. However, I was very surprised at how effective this is at wicking. Ever step out into cold air when you are slightly on the sweaty side? Take that cold feeling on your skin and that's what this shirt does... While running around a recent conference, I noted that while wearing a normal polo shirt, I literally felt chilled when I moved quickly---the air working to take the moisture away. Very nice. The only suggestion to others I woudl have would be pertaining to fit. The arms/armpits can be tight, so order either your normal t-shirt size or one higher. It will NOT be baggy either way.",
      "rating": 4.0,
      "verified": true,
      "author": "A Normal Guy",
      "helpful_votes": 0,
      "publication_date": 20131125
    },
    {
      "title": "Great As An Undershirt",
      "text": "I use these as undershirts. They wick away perspiration in the summer and make a great base layer in the cooler months. They compress snuggly but not too tight...highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great undershirt for law enforcement",
      "text": "I work in law enforcement and have used these shirts for over 10 years as an alternative to a standard t shirt. I like the compression fit. It doesn't bunch up under your vest during your shift causing irritation. Plus since they wick the sweat away they do so much better in the summer time. Nothings more irritating than having to wear a sweat drinched shirt under your vest for 8 plus hours. These are a must for police officers.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim and Sarah Davis",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Nice material",
      "text": "Love the product feel and quality. Be warned it runs extremely small. I bought XL and I am not a big guy at all and I feel like a sausage. Buying 3XL today",
      "rating": 5.0,
      "verified": true,
      "author": "Raoul Watson",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "the white colored versions fit better than the black ones",
      "text": "I purchased a few of these compression v-neck shirts and this is what I found - Firstly, the white colored versions fit better than the black ones. I had go one size down on the black colored shirts. Secondly, I suspect some of the white colored shirts I received were counterfeit. After only one wash 3 out of 4 white shirts turned YELLOW. I used no bleach just detergent and hot water with like colors and they turned a very nasty looking yellow making the shirts unwearable. Amazon has replaced them them with no question but still, it was kind of a surprise to have it happen.",
      "rating": 3.0,
      "verified": true,
      "author": "MIGUEL A CRESPO",
      "helpful_votes": 11,
      "publication_date": 20170521
    },
    {
      "title": "HORRIBLE SEETHRU SHIRT",
      "text": "I expected a compression shirt that wasn't almost onion skin. But it was thin enough that it's totally see-thru. The picture does not represent this shirt being solid white.",
      "rating": 2.0,
      "verified": true,
      "author": "Dominic",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "this is a compression shirt",
      "text": "Fits skin tight, it's a compression shirt. I sized up and it's still very tight and very short in length as well. I found it to be uncomfortable. Not for me.",
      "rating": 3.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Great shirt",
      "text": "The tag is annoying, it should be made easier to remove. Other than this it's a great shirt, I love the cut and flexibility. Cotton t-shirts always bog me down. No visible logo on this white one while wearing as an undershirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Best one yet!",
      "text": "I bought a compression shirt like this from Spanx and it was 3x more expensive. This one is just as comfortable and of the same quality but at a far more reasonable price. Easy to take on and off. I would advise that you buy one size smaller than your normal size. I'm a XL and I bought a L and it's a perfect glove like fit. After 15 minutes you forget it's on and it feels like a second skin. If you're self conscious about any problem areas this shirt will get you thru the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Muhammad Malik",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Same material, much smaller sizing than they used to be",
      "text": "I have several 3XL Tactical HeatGear shirts from some years ago, and I quite like them. But the current version is not sized the same. This 3XL was more than just compression wear; it was tighter than tight. And while I do hit the gym several times a week, I'm just not really a skintight shirt kind of guy, so this shirt's going back.",
      "rating": 3.0,
      "verified": true,
      "author": "Sidhean",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Keeps you WARM, almost hot. Not cheap, but worth it.",
      "text": "I don't know how they do it, but this thing is like almost active heat, but really it's keeping my own body heat in. I almost have to take my sweatshirt off, doing nothing but sitting, gets hot in here! If you work in the cold and don't want to have to have too many layers, this item is equal to like 3 tshirts I think.",
      "rating": 5.0,
      "verified": true,
      "author": "Home Deep Peaux",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Better than Spanx for men",
      "text": "These t-shirts are not as heavy or thick as Spanx For Men but offer the same control at half the price! They are cooler and the moisture wicking is effective. They recommend buying your actual t-shirt size, but I went down a size and it was snug, but fit, and offered plenty of control in my n mid-section.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "No Pressure on, or Riding Up Neck",
      "text": "Really like these for when I'm wearing a uniform at work. They do not prevent the heat and sweat under my vest, but allows for quick dispersion of heat and moisture when the opportunity presents itself. I went with one size larger than my standard shirt size due to the amount of compression on my first shirt order which was my actual normal torso shirt size. I like the V-Neck over the standard neck so it does not pressure my neck, ride up, or curl.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Zimmerman",
      "helpful_votes": 0,
      "publication_date": 20141102
    },
    {
      "title": "Best fit and comfort!",
      "text": "Bought one of these shirts and i must say i love it! Pros: - keeps me cool - fits tight but not too tight - bottom does not roll up Cons - i wish the collar was a bit wider because when i want to wear it under some other shirts/sweaters it is really tight around the neck so it is noticeable underneat (might get some tanks like this to resolve that)",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "very nice",
      "text": "This is how a compression shirt is supposed to fit, & it's got the soft/silky feel. Thickness is just right (not too thin, & not too thick).",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Nowviock",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "It gives me better support",
      "text": "i love compression shirts. I feel much better and energized when wearing one. I have no proof that it provides better back support but personally I feel much better when standing for long periods during the day. Therefore, I would recommend one. Hint - try to buy a size one step down from your regular shirt size. It will feel very snug. That is how it should feel. If you are older or have upper mobility issues it can be a challenge. But it will make a difference if you give it a try. Just my two cents.",
      "rating": 5.0,
      "verified": true,
      "author": "Dwayne S. Daughtry",
      "helpful_votes": 0,
      "publication_date": 20131102
    },
    {
      "title": "I'm loyal to this verison",
      "text": "Thicker than the older versions. This one will hold up well and even works really well under a dress shirt as a standard Tshirt. Also for those recovering from any type of head, neck or torso cancer treatments and now suffer from Lymphedema of the neck, this is the best compression shirt option for you because of the Vneck option.",
      "rating": 5.0,
      "verified": true,
      "author": "Daran L.",
      "helpful_votes": 0,
      "publication_date": 20160807
    },
    {
      "title": "nice, if your not too tall.",
      "text": "not as long and not as slippery as i hoped. I wear skinny shirts and wanted a tshirt that would let the shirt slide against it. I have some Adidas tech ones that are better material and length (but they have a little collar that shows...) BTW, im 6'3\", 190, 41L 16.5\"x35\". I wish this shirt had a couple more inches to the bottom for better tucking.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "The quality has changed.",
      "text": "I've been buying these for a few years now and recently I've noticed a change in the material. My older shirts say \"Made in El Salvador\" these shirts are perfect and well worth the money IMO. However, the newer shirts I've been receiving say \"Made in Mexico\" and the material is clearly different. The newer material is a downgrade and I fear they will not last as long as my older shirts. The fit is also slightly different. I am not a fan of the new shirts, they certainly are not worth $25... They need to lower the price, I cannot justify paying $25 for a lesser quality material.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris P",
      "helpful_votes": 14,
      "publication_date": 20170903
    },
    {
      "title": "Smaller it will be too tight",
      "text": "Order the same size you would wear in a normal shirt. If you order Smaller it will be too tight",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Best undershirt ever",
      "text": "Best undershirt ever. I have tried other v-neck undershirts sold around here and they are either too tight in the chest and arms or too loose in the waist. This is perfect for v-shaped guys or any slightly athletic man and the sizing is exactly like any of the UA compression shirts in case you are not sure of yours. I only wish they had these in gray or skin tones so I can wear them under my white shirts.",
      "rating": 5.0,
      "verified": true,
      "author": "Rashid",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Thunder vest for males.",
      "text": "This is like a thunder vest for your dog, put it on to feel safe when your excercising, wearing a suit, going to a haunted house or when you overeat and your button up shirt is just too tight to wear to the office the next day.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Melton",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Great!!!",
      "text": "I love these shirts. Highly recommend them. I feel support the hole day.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Musci",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "I like it.",
      "text": "I like it but it fits a little small. Go up one size than you are used to even if you want it to be tight.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Hendricks",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "I love the snug fit",
      "text": "I love the snug fit. keeps everything in place. I wear one 4x per week under dress shirt & tie. One knock... impossible to keep it bright white. it will develop a darker shade resulting form normal use, sweat, water quality, whatever.",
      "rating": 4.0,
      "verified": true,
      "author": "ces",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "The shirt is nice and exactly what my husband wanted for material",
      "text": "The shirt is nice and exactly what my husband wanted for material. However, it is much tighter than expected. He has many UA shirts similar in the same size that fit better. Unfortunately, had to return.",
      "rating": 3.0,
      "verified": true,
      "author": "Katrina L Ferree",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "I love these, they fit perfect and I love them ...",
      "text": "I love these, they fit perfect and I love them under dress shirts. They keep me cool, I hate wearing bulky items, these are great. Don't hesitate to purchase them. I have also washed them several times and they hold their shape very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "great product",
      "text": "As a high school and college football official, and as a softball umpire, I wear these shirts all the time. They're great for wicking away sweat and helping to keep my uniform looking crisp and professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Ferry",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "I love them and want to buy more",
      "text": "Under amour rock. I wear L normally and ordered this XL. And snug on me body, man! I love them and want to buy more. Under amour please more colors like brown, red, blue. Thanks amazon",
      "rating": 5.0,
      "verified": true,
      "author": "PapyChloe",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "These Under Armour compression shirts are amazing. I work outside in the direct sun and ...",
      "text": "These Under Armour compression shirts are amazing. I work outside in the direct sun and I sweat a lot. These shirts keep most of the sweat off of my clothes and actually cool me down in the process. WOW. I'm hooked.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Ricca",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Love these shirts",
      "text": "Love these shirts! Not as much compression as the originals, but it has held up well. Order a size smaller if you want more compression. I normally wear a large but ordered a small.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent P.",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Way too small!",
      "text": "It was so small, my friend couldn’t even put it on! While all his other athletic and regular T-shirts are a size S and fit perfectly.",
      "rating": 2.0,
      "verified": true,
      "author": "futuristic",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Fitted and tight so looks good if your muscular",
      "text": "Runs small obviously so go a size larger than normal. Fitted and tight so looks good if your muscular. Really hugs the midsection too so better be lean with no gut.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon G.",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Great quality nice cut but a bit tighter than I expected so possible consider a size up?",
      "text": "Great quality, nice cut but I am normally a medium and this was a bit tight some might need to consider a size bigger if you are like me still downsizing the gut (:",
      "rating": 5.0,
      "verified": true,
      "author": "Michael MacMillan",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Great! Runs a bit small",
      "text": "runs a bit small, had to get one size up. fits great, feels great, and works amazing. no high neck line makes me able to maneuver and work out easier without feeling stifled",
      "rating": 4.0,
      "verified": true,
      "author": "Whathedealeo",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Men's Tactical HeatGear® Compression V-Neck T-Shirt",
      "text": "This is my second purchase of these Under Armour compression t-shirts and I must say the quality and price has been maintained since my last purchase. I wear these under my work attire and living in a humid country these keep me dry and cool all day long. Granted they may be a little tight under the arm, which can be uncomfortable at times, but once you wear them and break them in they fit just right all day long.",
      "rating": 5.0,
      "verified": true,
      "author": "Ish Singh",
      "helpful_votes": 0,
      "publication_date": 20130413
    },
    {
      "title": "Feel Like an Athlete All Day",
      "text": "The best undershirts for work! Removes sweat and is perfect for wearing under dress shirts and polos. No logos and an appropriate v-neck make these the perfect option for wearing under clothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Sebastion",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "nice t a good thing to have but not for every day",
      "text": "Nice keeps you cool and long enugh to tuck into your pants im a large in hanes and was a large in this as well so i dont know about this running big thing that other people are saying it does feel diffirent compared to the cotton it takes getting use to i guess a big pluss is that it keeps you cool and you dont sweat as much",
      "rating": 5.0,
      "verified": true,
      "author": "Jacobsreviews",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "COMPRESSION fit",
      "text": "I've used this shirt at the gym, under my regular clothes at work, as well as a layer for cold days, and I have come away impressed each time. Its great at the gym for wicking (is that even a word?) away sweat and keeping you dry, keeps you warm when used as an under layer, and feels very comfortable in the process. I've washed it more than a dozen times and it seems to be holding up perfectly- i use a warm/cold wash cycle and then hang dry it. Its a compression fit so don't expect it to NOT be tight, I'm 5'10, around 180 lbs athletic build, and the L size is a good compression fit on me.",
      "rating": 5.0,
      "verified": true,
      "author": "BoxBabaX",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "... but somehow it works fairly well considering it's so easy to use (putting on",
      "text": "Not my most effective compression T-Shirt but somehow it works fairly well considering it's so easy to use (putting on, taking off). The ease of wearing this shirt can lead you to believe it won't work, but somehow it does in spite of its flexibility. I recommend this T-Shirt for those who just want to smooth out the bumps as you forget you're wearing it.",
      "rating": 4.0,
      "verified": true,
      "author": "A.I.T.",
      "helpful_votes": 0,
      "publication_date": 20140723
    },
    {
      "title": "Tiny sleeves",
      "text": "The shirt was smaller than I expected it to be. My husband is a medium, and that's what we ordered, but it was too small. Mostly in the sleeves, they were too short and made it look like he was wearing a tank top. Keep that in mind when ordering sizes.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Parsons",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Make sure of the size. Coz it’s very tight",
      "text": "As a person who wears small (even from under armor) ,this one for me is extremely stretch and tight.",
      "rating": 2.0,
      "verified": true,
      "author": "Ara",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Fits great",
      "text": "Perfection!!!! This shirt looks and feels great! Perfect keeping those muscles warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronn",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Great for all seasons... but not summer.",
      "text": "Very tight compression but it traps heat inside in the summer.... Would use for winter or fall.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Hanks",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "The quality of the shirtnis great as usaual",
      "text": "The quality of the shirtnis great as usaual, I thought it would fit in a XL but it did not. One of the negatives of ordering without being able to try on or see tue item.",
      "rating": 2.0,
      "verified": true,
      "author": "T.D.",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Yes, compression shirt..",
      "text": "I read some reviews on buying a bigger size. I disagree! These are compression shirts not loose fitting causal shirts. I ordered a medium. 5'9 on a good day, roughly 160lbs. It fits like a compression shirt. From having other compression shirts it feels right to me. Maybe some people have out grown their size?",
      "rating": 5.0,
      "verified": true,
      "author": "BPM",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "Good undershirt",
      "text": "I use this under my bullet proof vest at work. It stays very cool and it isn't noticeable. I usually wear Medium shirts and the medium in this fits me well. I'm about 5'10 145lb. The biggest issue I have with this shirt is the left arm pit area. The shirt is pretty tight in that area and the seem can irritate it until you get used to it/break the shirt in",
      "rating": 4.0,
      "verified": true,
      "author": "Alexander Foster",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Great for golf",
      "text": "This is one of my go-to under shirts for playing golf. Most golf shirts keep getting caught up on cotton t-shirts, but these allow the golf shirts to move freely.",
      "rating": 4.0,
      "verified": true,
      "author": "C George",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Great for wearing under things that you can't wash often.",
      "text": "I wear this shirt under a very heavy costume. Although it does not keep me any cooler at all, it is very effective at protecting the costume from body odor. I can wear it for several hours in a lot of heat and sweat profusely and have no smell at the end of the day.",
      "rating": 5.0,
      "verified": true,
      "author": "P. MCCLORY",
      "helpful_votes": 0,
      "publication_date": 20150829
    },
    {
      "title": "3 out of the 4 shirts I purchased are excellent....",
      "text": "All of these are excellent, but the first one I received was a bit different from the rest and has since developed a twist a after only wearing it less than 10 times from normal wear and laundering (you must adhere to the laundering instructions for best performance). Otherwise, that one shirt notwithstanding, these are as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "dean horsley",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Great Product",
      "text": "Great Product!! I have used them for several years now.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Sanders",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Really works",
      "text": "It’s made of a thermally conductive material. It really does feel cool on the skin. $25 is pricey for a t-shirt though. I bought one size larger so I wouldn’t be boa constricted, and I’m happy that it form fitted without the squeeze.",
      "rating": 4.0,
      "verified": true,
      "author": "}=)",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Husband loves these.",
      "text": "Perfect for wearing under white dress shirts. Helps my husband not sweat so much or stain his dress shirts. They are compression and he is pretty muscular, so he has to get an XL instead of his regular size, Large. Even the XL is pretty tight, but he likes it that way. These also don't have the black logo, so he doesn't have to worry about it showing through.",
      "rating": 5.0,
      "verified": true,
      "author": "E. DeJesus",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "Hot hot hot",
      "text": "No, not that kind of hot. Like the \"oh my god let me get home with the quickness so I can take this off because I'm burning alive\" hot. Save up to buy two of these and then get a Spanx instead.",
      "rating": 2.0,
      "verified": true,
      "author": "Christina Lozano",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Stay Cool",
      "text": "Been wearing Under Armour Heat Gear for years. Works great under polyester or cotton fabrics.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great, comfort, but watch the sizing.",
      "text": "Very comfortable. I am 6'3\" and normally wear a 2XLT, so I ordered 2XL. Next time I will get the XL for for support.",
      "rating": 4.0,
      "verified": true,
      "author": "Curt-ish",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Wicked short",
      "text": "I'm 6'2\" so wanted this in a tall, but they don't make it. I have a compression heat gear crew neck that's not a tall so I thought I'd be fine. This shirt was at least an inch shorter than my crew neck shirt so way too short for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "I absolutely love this v-neck shirt to wear under a hoodie when ...",
      "text": "I should start by saying that I am NOT an Under Armour fan because I think it's overpriced. That being said, I absolutely love this v-neck shirt to wear under a hoodie when I workout. Liked it so much that I bought a couple more",
      "rating": 5.0,
      "verified": true,
      "author": "Wagger",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Sized for children",
      "text": "Way too small was going to return for a refund but they fit my 16 year old , 5foot 8 and 164 lbs ... So they didn't go to waste ...but grossly mis marketed . .. will not buy from that vendor again",
      "rating": 3.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "runs small",
      "text": "had to return. Tight is good, but not if it cuts of circulation!",
      "rating": 4.0,
      "verified": true,
      "author": "Merrily H.",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "The Best!",
      "text": "These shirts are the best! I wear them as undershirts! I actually threw out all of my old undershirts and now wear these, exclusively!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "The perfect undershirt.",
      "text": "Great undershirts! They allow for better climate control, specially when wearing suits in warm or cold environments. The V neck works well as it is not as obvious that there is an undershirt. The tight fit allows for the fabric above to move easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel Q.",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "a disappointment",
      "text": "The product is not the same quality as ordered before. And it was covered with a fragrance....not new.",
      "rating": 1.0,
      "verified": true,
      "author": "TRUTHFUL",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Not What I Hoped",
      "text": "Not as great as expected. The first problem was with the seams on the inside. After wearing it inside out I was more comfortable. I have not found it to cool me compared to my normal under garments.",
      "rating": 3.0,
      "verified": true,
      "author": "R. L. Russell",
      "helpful_votes": 3,
      "publication_date": 20150115
    },
    {
      "title": "Meh.",
      "text": "Doesn't really do much in the way of holding things in.",
      "rating": 3.0,
      "verified": true,
      "author": "Jaime",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Wear these under scrubs at work",
      "text": "I'm 6'2, 185lb, 42 chest, 34 waist with athletic build. Large fits as expected and I can even keep it tucked in my pants. If you have a belly you might want to go up a size for comfort. Comfortable material and a great option for under scrubs at work. They get washed on hot and dried on hot with my scrubs, and I don't notice any wear or loss in elasticity. I've been doing this 3x's a week for over a year now.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun T",
      "helpful_votes": 0,
      "publication_date": 20151018
    },
    {
      "title": "Have worn these for 10+ years under my bullet proof ...",
      "text": "Have worn these for 10+ years under my bullet proof vest as a cop. They run small so order larger than you think.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Extremely small size",
      "text": "This T-shirt runs EXTREMELY SMALL. It looks like a youth size. My wife usually wears a women’s small and was unable to fit this men’s size large shirt! Will return ASAP.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Five Stars",
      "text": "Far exceeded my expectations. I have washed it several time and still feels new.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken McArthur",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Great fit",
      "text": "This was a gift and the recipient loves them. Very comfortable to wear and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Douponce",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "This shirts are definitely tight under shirts! I bought ...",
      "text": "This shirts are definitely tight under shirts! I bought two to wear underneath my dress shirts for work and they work perfectly. I tend to sweat a lot and these keep my pits and back almost completely dry!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner J",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Ok, but...",
      "text": "It's great and works well, fits as expected but the folded fabric area on the v-neck rubs my chest (sternum) wrong and irritates it, much worse worn under my vest. Stick with the round neck.",
      "rating": 3.0,
      "verified": true,
      "author": "Rb",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Works for my son but pricey",
      "text": "Bought this for my son whose chest is a little large. It did the trick, and he did not feel like he was wearing a control garment. The other compression shirts I got him were too tight and he could barely get them on, this one is really just like a t shirt with a little extra support.",
      "rating": 4.0,
      "verified": true,
      "author": "Bismillah",
      "helpful_votes": 0,
      "publication_date": 20140517
    },
    {
      "title": "It's a tight fit, like it should be, but over priced",
      "text": "It is small but it's supposed to be small. Fit as I expected a compression shirt should. Just think it was overpriced, even for under armour.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Berding",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Great Fit and Under Armour Quality",
      "text": "My last Under Amour shirt is from the early 2000s, just bought a few more. Great fit, a medium keeps my belly in check (34inch waist with a small spare tire). Wicking abilities are great when running or working out. Also keeps you cool as an undershirt. Love",
      "rating": 5.0,
      "verified": true,
      "author": "T. Tyler",
      "helpful_votes": 0,
      "publication_date": 20140517
    },
    {
      "title": "DON't Order up a size!!!!  Compression means tight",
      "text": "I am all about reviews so I read them all and most people say go up a size....then I read some people say just the opposite. I ordered my size and its perfect. Tight yes but thats the whole point of a compression shirt. I will be ordering some more.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott S.",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Was a waste of money and research for me since it does ...",
      "text": "Bought this for my husband as a gift because he likes compression shirts under his regular cotton T's when the weather is cooler. This material was so much flimsier than previous ones he purchased. And he never wears it. Was a waste of money and research for me since it does not compress at all.",
      "rating": 2.0,
      "verified": true,
      "author": "SIC",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "Hides the Dad Bod!",
      "text": "It really changes the way I look. Still have the dad bod, you just can’t tell... lol!",
      "rating": 5.0,
      "verified": true,
      "author": "jeff cristler",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Use it as an undershirt for polo shirts and other ...",
      "text": "Use it as an undershirt for polo shirts and other slim fitting short sleeve shirts. It is not bulky and doesn't fade or fray. It is performance gear and needs to be laundered as such, use cold water and do not run in the dryer.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "The v-neck is my favorite compression shirt",
      "text": "I own quite a few brands/models of compression shirts and this is my favorite so far. Very comfortable, good compression, clean/simple stitching (unlike other UA compression shirts that have extra 'vents'), and the v-neck makes it much less conspicuous under a dress shirt or polo.",
      "rating": 5.0,
      "verified": true,
      "author": "pseudosavant",
      "helpful_votes": 0,
      "publication_date": 20150829
    },
    {
      "title": "Overall a nice compression shirt",
      "text": "Overall a nice compression shirt. I wish the v were deeper, and that it came in more than two colors. Also, the tear off tag leaves a bit of material behind no matter what, so get that under control.",
      "rating": 4.0,
      "verified": true,
      "author": "Spootypuff",
      "helpful_votes": 0,
      "publication_date": 20160609
    }
  ],
  "product_meta": {
    "title": "Under Armour Men's HeatGear Tactical V-Neck Compression Short Sleeve T-Shirt",
    "description": "Lightweight, field-tested HeatGear® fabric delivers soft, but sturdy next-to-skin comfort. 4-way stretch construction moves better in every direction. Material wicks sweat & dries really fast. Anti-odor technology prevents the growth of odor-causing microbes. Ergonomic seam placement reduces irritation & chafing.",
    "rating": 4.5,
    "feature_bullets": [
      "100% Polyester",
      "Imported",
      "Machine Wash",
      "Lightweight, field-tested HeatGear fabric delivers soft, but sturdy next-to-skin comfort",
      "4-way stretch construction moves better in every direction",
      "Material wicks sweat & dries really fast",
      "Anti-odor technology prevents the growth of odor-causing microbes",
      "Ergonomic seam placement reduces irritation & chafing"
    ],
    "categories": [
      "Men",
      "Compression Tops",
      "Compression",
      "Sports & Outdoors",
      "Clothing, Shoes & Jewelry",
      "Sports & Fitness",
      "Clothing"
    ],
    "price": 24.99,
    "specifications": {}
  }
}