{
  "website_summaries": [
    {
      "verdict": "Metal ID plate attaches to collar for easy identification. Collar will retain its good looks over time, even with rough treatment.",
      "pros": [
        "Dog owners appreciate having four color choices, which provides a sense of style",
        "Different sizes of collar available to fit different breeds",
        "Quality of engraving is good – easy to read from a distance"
      ],
      "cons": [
        "Collar may be a little stiff when it first arrives",
        "Some owners report their dogs were able to slip out of it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Couple minor issue, but worth the price.",
      "text": "The collar looks great. It was a bit stiff when it came in, and scratched quickly when my dog ached his neck. Additionally, it did take considerably longer to receive than what was projected... However, I did order it right before Christmas, so that could have been the problem. Despite these things I would definitely recommend this collar. As far as the scratching and stiffness, I broke it in by flexing it, and put a couple layers of shoe polish on it and it looks fantastic. If you have a general idea how to take care of leather, none of the issues are a deal breaker, and for $30, its totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Reynolds",
      "helpful_votes": 3,
      "publication_date": 20170108
    },
    {
      "title": "Don't Waste Your Money",
      "text": "I finally received the collar and the leather has already stretched out. It is showing wear after a short time on a dog who is not very active. I do not recommend this collar and would not purchase again. Edit: We've had to cut the end of it off and put in an additional hole to make it fit. The end keeps curling up and looks really cheap. It's also going to have to have a new hole added. Its stretching even more. Teddy does not use a leash so that's not why it has stretched. This is probably the worst purchase I've ever made on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Dog Mama",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Strong and lightweight",
      "text": "I love this collar! It’s lightweight, yet durable. My Golden has a German Shepherd best friend, and the German Shepherd’s favorite game to play is “Let’s pull Scout around the yard.” This collar stood up to many, many backyard play dates and has stretched out only just a little bit over the past two years. Great job!",
      "rating": 5.0,
      "verified": true,
      "author": "R.Hill",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Defective design",
      "text": "The rivet holding the D ring comes out. This has happened 3 times on a 65# german shepherd dog that is inside 90% of the time! ABSOULETLY No excessive use. Would NOT recommend this collar. When I purchased it was to have a lifetime guarantee, it does not. Don't waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "Bonnie B",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Pretty good, but I'd spend more to get better.",
      "text": "Label is nice. Leather seems sturdy, but the finish is not high quality. For an in-between size dog, these things are LONG and my dog managed to chew up the end. I had to trim it back. There is no retaining loop for the excess leather. The surface finish on the leather appears dry and cracked despite having very little wear. It still seems supple and sturdy, but finish looks like junk.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Looks good on my 135lb German Shepherd",
      "text": "Looks good on my 135lb German Shepherd. I bought the largest size for him and I think it would have been better if it was slightly thicker. But, for the most part, it is good quality letter and the name plate is clear and easy to read. It should last a long time and was delivered in a timely manner. Ordering the personalized engraving was easy. I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "AZRN",
      "helpful_votes": 3,
      "publication_date": 20160215
    },
    {
      "title": "Great collar",
      "text": "I have been looking for this exact collar style for awhile. I seriously wasn't sure the quality would be that great or take would take forever to ship. Let me tell you the collars are great! I had them with in days! Also my final fear was size, I've never collared my youngest dog. One collar was to small but the seller is great and is going to fix it for minimal cost. Your getting more than you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Shaffer",
      "helpful_votes": 3,
      "publication_date": 20160221
    },
    {
      "title": "Turns my White Dog RED!",
      "text": "Cheap junk. Turns my white shepherd RED. Tried everything to resolve but had a leather guy tell me that this is very dangerous due to the type of red dye they are using. I'm very unimpressed. Nice idea but terrible quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Blucasmobile",
      "helpful_votes": 4,
      "publication_date": 20160610
    },
    {
      "title": "Worth the money!!!",
      "text": "I absolutely love this collar. It fit as expected and the engraving was very nicely done. I finally found a collar my pitbull doesn't want to chew off of himself. The collar is made very well and is strong enough to handle my 75lb pitbull on his dog runner. The collar also shipped pretty quickly and was receiving in very good packaging without any damages.",
      "rating": 5.0,
      "verified": true,
      "author": "Purple186",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "Great collar, very durable!",
      "text": "My dog has worn this close to a year and a half now, and it still durable. My other dog loves to wrestle with my female (who wears the collar) by grabbing her collar and pulling her around, and the collar is still good to go. These are full grown German Shepherds. The ID tag is still on the collar and you can still read it perfectly. Im glad i bought this collar!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Great sturdy leather collar",
      "text": "Great sturdy leather collar! My dog is a large lovable pitbulls who loves to roll around on his back in the grass and driveway and the name plate has scratched a little. To be expected though if rolling around concrete and grass and outdoor elements. While my yellow lab does not roll around his name plate is pristine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber K",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Not the greatest...",
      "text": "The leather isn't the best quality. My dog has only been wearing it for probably 2 months and it already seems like its breaking down. The size of this collar also runs a bit small. I have a chocolate lab, and he's not big by any means, he's super slender and the large collar didn't fit, I had to make an additional hole at the end to get it to fit properly.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Best",
      "text": "I have had Springer Spaniels all my adult life and have done saddle work. This is top quality leather and excellent craftsmanship.",
      "rating": 5.0,
      "verified": true,
      "author": "MK MCMILLION",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Masterfully Crafted Collars",
      "text": "This is a beautiful collar custom made for your furry friend. When I am in the market to replace his collar in 5 years or more, I will be repurchasing from this vendor!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris D",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "these are awesome I love them and I bought two both the ...",
      "text": "these are awesome I love them and I bought two both the red and black for my Blue merle and black tri australian shepherds. The sizes were perfect they dont stretch and when wet they dry nicely. Except the color does start to stain things when wet, but not badly. They look so good almost like they're wearing bling.",
      "rating": 5.0,
      "verified": true,
      "author": "Btos Family",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Hot around the collar!",
      "text": "I wrote a review, but it somehow was removed! Do not buy this collar, it is junk, I have never seen one look this bad. I have purchased leather collars for over 40 years, and I never had this poor quality. Top Paw leather collars are the brand I always put on my babies, soft and long lasting.",
      "rating": 1.0,
      "verified": true,
      "author": "What's up with that?",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Very Pleased!",
      "text": "Very thick, durable collar. Looks fantastic on my dog and is very sturdy. As expected from dyed leather, use caution when your dog gets wet, as the coloring will bleed on to your pets neck.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina Bockstedt",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "It's good but could be slightly better...",
      "text": "It's a great collar. Good leather but not tanned as well as some good saddle leather. If it was made out of better tanned saddle leather and the edges rounded just slightly, this would be the perfect collar. The name tag is *great* though and makes it still worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Yonaton",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Great collar",
      "text": "Well made with nice leather. Name plate attached with heavy duty rivets. Should last long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff G.",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Distinctive, Great Quality",
      "text": "So glad we bought this. High quality, attractive, many at dog park remarked on our dogs stylin' collar. Looks exactly like the picture, if our dog gets lost nobody can miss his name and our number. Very Happy!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Ward",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Look good and practical",
      "text": "My dog is so happy to have a new collar. or so it seems. after his bath he stands and waits till his collar is on. and it looks good too. it seems to be balanced so that his name and phone number are easily seen on top at the back of his head.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry L. Ferko",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Nice Dog Collar",
      "text": "Bought this for my dog 3-4 years ago and it has been a great collar. It still looks new and has worn very well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Harper",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "The collars look and feel great genuine leather I just wish that the name tag ...",
      "text": "The collars look and feel great genuine leather I just wish that the name tag was engraved instead of printed. They have already warn off their names.",
      "rating": 3.0,
      "verified": true,
      "author": "Juliette G",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Great product and service!",
      "text": "The collar is great, I get compliments on it all the time! Beautiful quality for a custom leather collar for the price. But, the real 5 star earner is the customer service. I emailed the seller because I was moving and didn't realize I cut the purchase to close and I should have sent it to the new address. Usually, you would have to go through Amazon to change the shipping address, but instead she just sent the collar out a few days early so I would get it in time! So sweet!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 9,
      "publication_date": 20160501
    },
    {
      "title": "Nice look on my adorable rescue!",
      "text": "This collar is great! My sweet rescue mixed breed boy loves his new collar! The sizing chart was perfect. He is 40 lbs right now but I expect he will continue to grow a bit more. That scared me a little bit but he still has room to grow but it isn't so big that there is a lot of leather to tuck around.",
      "rating": 5.0,
      "verified": true,
      "author": "Dottie",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Great collar",
      "text": "This collar looks beautiful. We got a large black leather collar for our 35-40 pound border collie mix, and its perfect for him. We did have some problems with delays in receiving it, buti believe that was USPS's fault, not the seller's since it shipped on time.",
      "rating": 5.0,
      "verified": true,
      "author": "lauren",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Nice looking, ordered for my standard poodle",
      "text": "Nice looking, ordered for my standard poodle. It ran a bit small and one of the screws holding the D ring in place has already fell out and it's only a few months old.",
      "rating": 3.0,
      "verified": true,
      "author": "Kasey S.",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "gsp",
      "text": "Love this collar! Takes away the clanking of a dangle tag, and the leather look is really nice. Looks fantastic on my GSP!",
      "rating": 5.0,
      "verified": true,
      "author": "ShakaBrah",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Great quality!",
      "text": "After shopping around, I went ahead with this collar. I'm very pleased with the quality and wear so far. I have a 110 pound German Shepherd/Golden Retriever but the extra large was waaaay too large! Nice leather and engraved plate. Exactly like the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean R",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "This is amazing quality & style",
      "text": "This is amazing quality & style. Exceptionally nice for a dog collar. Maybe the nicest I have ever seen & our pets deserve it. Shipped on time. Would highly recommend to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "R Damron",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Best collar ever",
      "text": "Best collar ever! Not only does it look good, but it is durable and withstands the wrestling and rough housing of two puppies. Would definitely recommend and would definitely use them again.",
      "rating": 5.0,
      "verified": true,
      "author": "wendy v",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "LOVE this collar",
      "text": "LOVE this collar!! It's is made well, attractive, and just all around great product. Seller is also wonderful. I had to contact the seller, because my fur baby's neck measurement fell between the large and x-large fitting. The seller answered my questions in a timely manner and custom sized the collar to ensure it was a perfect fit... I would recommend this dog collar and seller to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Ball",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Beautiful collar",
      "text": "I have received many compliments about this collar. The quality is great. The ID tag was slightly bent in the middle but it still looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Anglikana",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Holding up great on both of my dogs who are notoriously hard ...",
      "text": "Holding up great on both of my dogs who are notoriously hard on collars and dangling tags. Writing is still very legible.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Love it",
      "text": "I love it. I got a medium red for my 38 lbs-dog, and it looks great. I only wish that I could squeeze in a 3rd line but I guess there's no space.",
      "rating": 5.0,
      "verified": true,
      "author": "Suyong Min",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "I love this collar",
      "text": "I love this collar, the craftsmanship is outstanding. It's made so well, the engraved nameplate is fantastic; the lettering is perfect. A must for anyone looking for a great looking collar for their dog; a must buy.!!",
      "rating": 4.0,
      "verified": true,
      "author": "charlene walter",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "We've had this for a few months and it holds ...",
      "text": "We've had this for a few months and it holds up well to my 90lb mutt. Will definitely order another one when we get another dog",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Beautiful collar, one less tag to attach.",
      "text": "Looks great. Just the right width. Color goes with coat. Seems sturdy. Chillin in the sun with her fancy collar.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Frank in USA",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Would have been 5 stars except there was a problem ...",
      "text": "Would have been 5 stars except there was a problem with the engraving (no fault of my own) and I had to pay $5.00 extra for them to fix it.",
      "rating": 4.0,
      "verified": true,
      "author": "marcamom",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "very satisfied",
      "text": "Great product. Just as described. Got this for my new Pitbull. Looks great on him and had plenty of a tale for adjustment. The engraving is beautifully",
      "rating": 5.0,
      "verified": true,
      "author": "kitty rn",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Beware of bleed",
      "text": "Really nice collar. Looks gorgeous and is very sturdy. I got it in the red stain. Just beware of bleeding. Mine bled off red for months whenever my dog got wet. Kind of looked like I’d slit her throat....",
      "rating": 4.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "good quality.",
      "text": "Its been on my dog for 3 months now and the (red) leather has hardly shown any wear. The ID tag is fastened well and the words are inscribed deeply and clearly.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Needs help",
      "text": "I wanted a collar. I was disappointed with the tags Too small looks cheap. I like the leather. I would not recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "Jackie A. Smith",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Five Stars",
      "text": "I love this...our Golden Retriever looks prettier wearing this collar...",
      "rating": 5.0,
      "verified": true,
      "author": "DocBB",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Five Stars",
      "text": "Excellent craftsmanship!! Looks perfect on our hundred 149 lb German Shepherd!! Job well done to the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina U.",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Five Stars",
      "text": "Very nice leather collar for your dog! It gives a classy look and the fit is accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "P. J. Mullins",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Exceptional",
      "text": "Best collar I have ever bought, lasts forever, no more shaking tag, no color bleed on my white dogs fur.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Schindler",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "Very good quality! Well made!",
      "text": "Well made very good quality! So glad I ordered this one! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruirui",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Collar looks nice, except for the fact that I have a ...",
      "text": "Collar looks nice, except for the fact that I have a white dog and after we went out in the rain it actually stained his neck red from the dye",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle K.",
      "helpful_votes": 0,
      "publication_date": 20170321
    },
    {
      "title": "I love this well made collar",
      "text": "I love this well made collar. They got the name and numbers on it and sent it to me promptly",
      "rating": 5.0,
      "verified": true,
      "author": "Meredith S. Whaley",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "Five Stars",
      "text": "Love the collar exactly what I needed for my basset Mattie.",
      "rating": 5.0,
      "verified": true,
      "author": "Aldo",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "LOVE It",
      "text": "Just arrived yesterday and it looks great. We are very pleased with it and we hope it wears well. Custom work is very nice touch and a quality job.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "Quality  product",
      "text": "Quality leather with quality metal parts. These seem pretty indestructible and look great on my dogs. The price point is about as good as it gets with lout buying something cheap from china. I recommend these collars. They also have enough holes to fit my dog's necks just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Doesn’t stay on",
      "text": "Dog slips it constantly, it’s cool looking but that’s about it",
      "rating": 1.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Great product.",
      "text": "Charlie has gotten so many compliments on his collar. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria A-G",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Other than that a super collar. I highly",
      "text": "I had requested The name Molly on it but got Lily instead. There was confusion as my other dog is Lily. I don't think the company was aware of the changes. Other than that a super collar. I highly recommend",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Beautiful but not for heavy use",
      "text": "I loved this collar when we first got it. However, it did not last. We got it in January and it broke before the end of April. I think it's just not the right fit for our large, energetic pit bull.",
      "rating": 3.0,
      "verified": true,
      "author": "ashley k",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Great Looking Collar!!!",
      "text": "Gorgeous, high quality collar. Everyone, even the vet compliments it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Very nice and durable collar",
      "text": "Very nice and durable collar. I would have given 5 stars but the Red Dye does come off on my dogs white hair but it does wash out thankfully.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Good Quality.  Just needs a design tweak.",
      "text": "Great quality. Just needs another leather loop to hold extra collar material. Ended using a small plastic tie rap. to hold extra leather to base leather collar.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Pleasants",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "Five Stars",
      "text": "the dogs look great in them and Magnus was great to with.Nice thick leather",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Lickei",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "nice leather. Only downside is that the lettering is ...",
      "text": "Well made, nice leather. Only downside is that the lettering is huge. I would have preferred a cleaner looking name plate with smaller type.",
      "rating": 4.0,
      "verified": true,
      "author": "Dianna T.",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Nice looking collars",
      "text": "Bought two. Had them for a few months still look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Quality is pretty good, the leather seems to be holding up ...",
      "text": "Quality is pretty good, the leather seems to be holding up well I have used later treater on it and the helps bring the color back after awhile.",
      "rating": 4.0,
      "verified": true,
      "author": "J. PDX",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Well made.",
      "text": "Bought this collar because our dog kept scratching off his name tags on the other one. Well made and the etching is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "gary lee young",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Great buy!",
      "text": "Got a large for my husky and it looks beautiful. Would buy again if I needed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "Love it! Very nicely made and looks very sharp ...",
      "text": "Love it! Very nicely made and looks very sharp on my dog. He's the talk of the town! Great communication from vendor as well.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Sutton",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "Great quality",
      "text": "We always get compliments on this collar. It is great quality and the more worn it gets, the better it looks.",
      "rating": 5.0,
      "verified": true,
      "author": "Paige G.",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Love it. Item exactly as described on the website",
      "text": "Ordered this for our new yellow lab puppy. Left a message to the seller about the engraving, and got a prompt, reassuring reply the same day. dispatched the next business day and received on time before our outing with puppy. Love it. Item exactly as described on the website. Color matches our puppy's coat very well. Our puppy looks smart wearing it.",
      "rating": 5.0,
      "verified": true,
      "author": "esotericmc",
      "helpful_votes": 6,
      "publication_date": 20151001
    },
    {
      "title": "Five Stars",
      "text": "Beautiful high quality collar. This collar gets compliments at the dog park",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Five Stars",
      "text": "This collar is great quality! Name plate is a perfect size and nicely done",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Five Stars",
      "text": "My dog looks so good in this collar. Very nice",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "Great Collar and Service",
      "text": "Contacted seller asking about larger size for Saint Bernard. Seller promptly agreed and the collar looks/feels great and is made very well. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ty Pryor",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "great buy",
      "text": "Everyone loves these on my two dogs, both registered breeds.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald E. Bird",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "great brass! Coller is a real show stopper",
      "text": "May seem tight and stiff at first, will soon loosen up. Sadle soap will take any die off. started on second hole now on second to last. Will stretch a bit, great brass! Coller is a real show stopper",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Awesome collar",
      "text": "This collar is great. All leather and looks good on my dog. Seems very durable. The name is put on by laser, it is nit engraved....just fyi.",
      "rating": 4.0,
      "verified": true,
      "author": "SAB",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Five Stars",
      "text": "Great collar, I expect to buy another once my puppy outgrows this one.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Bolland",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Love it! Great quality and has lasted several months ...",
      "text": "Love it! Great quality and has lasted several months without wear or tear. Great size for my 15lb mini poodle!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "plus easily cut the excess with scissors",
      "text": "Jack Russell chewed the extra length...electrical tape helped...plus easily cut the excess with scissors.",
      "rating": 5.0,
      "verified": true,
      "author": "katherine l windon",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Nice collar. I wish large had been an inch ...",
      "text": "Nice collar. I wish large had been an inch or two longer but love the quality and the price!",
      "rating": 5.0,
      "verified": true,
      "author": "james f womack",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "No Jingles - Looks Amazing!",
      "text": "I have a 70pound Red Pitbull mix and the colors compliment his coat wonderfully as well as looks classy and 'expensive'. Would highly recommend for owners who hate the tag jingles and want something sleek and nice looking for their dog!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 4,
      "publication_date": 20160602
    },
    {
      "title": "I love this collar",
      "text": "I love this collar. It is exactly as advertised and was delivered quickly. Everyone who sees it comments on how nice it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Clark Hart",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "Bought one for my pup an them after my mother ...",
      "text": "Bought one for my pup an them after my mother seeing it asked me to get one for hers. She loves them",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Five Stars",
      "text": "It is very well made. The writing is very legible.",
      "rating": 5.0,
      "verified": true,
      "author": "Jolene BeanLijewski",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "Quality product!",
      "text": "Great product. Quality leather and professional looking brass plate. Very nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Adams",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Excellent product",
      "text": "Is just excellent, more than my expectations, great quality. I am really happy about the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Margarita Herrera Llanes",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Great product and awesome customer service",
      "text": "Great product and awesome customer service. I ordered a collar that was too big for my dog. They apologized for any inconvenience and remade me a new one at no extra cost. Highly recommend this product, they are good people.",
      "rating": 5.0,
      "verified": true,
      "author": "Preet",
      "helpful_votes": 3,
      "publication_date": 20160327
    },
    {
      "title": "It looks great on him too",
      "text": "Recently got a rescue dog that was on the run for awhile before I got him. This is very well made and now if he would happen to get away from me it has his name and my phone number on it. It looks great on him too!",
      "rating": 5.0,
      "verified": true,
      "author": "Corkey",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "Loved it",
      "text": "It is such a nice collar, it fitted just barely on my dog, but it is perfect. If you have a medium-sized dog the medium collar fits fine, but a bigger one might be require if you expect your dog to grow more.",
      "rating": 5.0,
      "verified": true,
      "author": "Iris Cantu",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "I have been looking for a collar like this one for awhile",
      "text": "I have been looking for a collar like this one for awhile. I would have liked a little bolder font on the name plate and the size is a little bigger than expected from the sizing chart, but otherwise it is a good quality collar and it looks great on my lab",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Durable and beautiful.",
      "text": "Very beautiful. It did stretch but what leather doesn't? We liked it so much when we realized we'd have to order a second one we didn't hesitate to order this one again. It's held up surprisingly well over the last year or so we've had it. Only ordering a new one because we accidentally put the wrong number.",
      "rating": 5.0,
      "verified": true,
      "author": "Kori Stouffer",
      "helpful_votes": 0,
      "publication_date": 20180422
    }
  ],
  "product_meta": {
    "title": "Magnus Leather Dog Collar 1\" Leather with ID Plate Ships in 1-Day",
    "description": "Magnus Leather Produces some of the best dog collars on the Market today, created with our premium 9-10 oz. leather to withstand everything your dog's life can throw at it. -These collars are made to last and the custom name and information plate ensures that if you lose your \"mans best friend\" then someone will give you that peace of mind phone call. -This 1' collar gives you the ultimate in versatility. Its strong enough for any breed while remaining small enough to accessorize your pet. -The design is one solid piece of leather to avoid creating weak points in a design that won't fray over time, the easy to use brass collar ring is placed by the brass buckle to serve as a keeper and provide convenient access for when you wish to take your dog for a walk. -This collar comes in stylish BLACK , DARK BROWN , TAN , or PREMIUM RED. -Measuring your dog's neck size WILL ALWAYS GIVE YOU THE BEST FIT! -If you can't measure your dogs neck or need the collar as a gift, we have a quick reference chart in the picture sections. -After you order please leave the name or logo you wish to be engraved on the plate in the checkout notes. BE SURE TO DOUBLE CHECK SPELLING TO INSURE ACCURACY!",
    "rating": 4.1,
    "feature_bullets": [
      "100% leather",
      "Brass hardware Guaranteed for life",
      "Brass Dee-Ring for quick leash hook up",
      "Name and Number on plate for quick recognition",
      "BEST QUALITY ON AMAZON"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 18, 2016",
      "Manufacturer": "Magnus Leather",
      "ASIN": "B01ASB99D4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Pet Supplies",
      "Basic Collars",
      "Collars, Harnesses & Leashes",
      "Collars"
    ],
    "price": ""
  }
}