{
  "website_summaries": [
    {
      "verdict": "A good option for a mid-size salt lamp with unique character. An appealing appearance and mood-enhancing light make this salt lamp a good buy.",
      "pros": [
        "The natural salt and handmade design means that designs can vary greatly, giving you an original piece"
      ],
      "cons": [
        "Depending on the size and shape of the salt, the light may be more concentrated in one area"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "LOVE LOVE LOVE!!",
      "text": "This is amazing. I was very skeptical at first about this lamp. It seemed impossible that a block of salt can have so many positive effects on so many different aspects of a persons mental and physical wellbeing. I am here to say I am a believer. I suffer from seasonal depression and I'm a night shift worker. This lamp works miricals. I've felt more energized and more well rested. My mood is much more happy and my body feels much better. Also this is a beautiful lamp. The pictures don't do it justice and it fits perfectly on my bedside table. I live the dimmer feature so I can decide how much light it emits.",
      "rating": 5.0,
      "verified": true,
      "author": "THRIFTY SHOPPER 91",
      "helpful_votes": 64,
      "publication_date": 20161230
    },
    {
      "title": "I had my doubts, but this is amazing!",
      "text": "I love this! It has made such a difference in my life. It really does stabilize energy. Being around my light makes me feel so much comfort and peace. If I could afford a \"house size\" rock, it would be in my home right now. I am going to order two smaller ones, for my bedroom and for my office.",
      "rating": 5.0,
      "verified": true,
      "author": "anne",
      "helpful_votes": 12,
      "publication_date": 20161102
    },
    {
      "title": "Good buy on this Himalayan Salt Lamp",
      "text": "I am looking forward to using this Himalayan Salt Lamp in our home. It came with no problems with packing and shipping. I read many reviews before ordering this. Cost was a consideration and I feel that this is a good buy. I will update this review if needed after I have used it for awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Marti",
      "helpful_votes": 7,
      "publication_date": 20180302
    },
    {
      "title": "Looks Great. Real Salt. Heavy.",
      "text": "Lol I cant do this review about longevity, BUT it is real salt. Got them in the mail today, couldn't believe how heavy they were set them on the counter till I was ready to place them... My husband came home and he says, \"What are those? big rocks made of salt?\" Before I had a chance to respond... YUP he licked them... He exclaims, \"Yup! Thats Salt Alright! Very Salty!\" I laughted and explained to him they are lamps... he thought they were really cool.. so as long as the husband loves them and they look nice and are real salt lamps thats what matters.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Jess",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Soft soothing light... serene.",
      "text": "Beautiful, peaceful glow. This lamp has a dimmer toggle and at its lowest setting, it gives off a very soothing glow. When you turn it up, it gets rather bright. The salt is beautiful, heavy, large chunk of rosy pink salt... and when you turn it on, it has this soft amber light... I’m really enjoying it. Wish I’d bought one a long time ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Hubbard",
      "helpful_votes": 7,
      "publication_date": 20171015
    },
    {
      "title": "Both large and comparable in size but very poor craftsmanship. The wooden base on both of the ...",
      "text": "Both large and comparable in size but very poor craftsmanship. The wooden base on both of the lamps are not centered making it very easy to fall over and one has a chunk of salt missing from where they screwed the base too close to the edge. Overall not very happy with this product and probably won’t buy from again",
      "rating": 2.0,
      "verified": true,
      "author": "sam",
      "helpful_votes": 4,
      "publication_date": 20171128
    },
    {
      "title": "Not sure it is the real deal",
      "text": "Very pretty, but I am not sure it is real. I read that the salt sweats, but mine hasn't. Also, I feel no different with or without using it. Very nice night light though.",
      "rating": 3.0,
      "verified": true,
      "author": "mom2adopted",
      "helpful_votes": 3,
      "publication_date": 20180113
    },
    {
      "title": "Not usable",
      "text": "When I opened the package everything looked ok until I took the wrapping off the lamp. It was broken in half with bits and pieces in the wrapping. I rewrapped it and sent it back. I was very disappointed because it looked like it would be a perfect addition to a guest room. I think I'll look for one in a local store so I don't have to worry about it being broken in shipment.",
      "rating": 1.0,
      "verified": true,
      "author": "Ride2Up",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Just what I wanted.",
      "text": "Perfect. Nice cut to the salt - looks really nice, and having a dimmer switch makes it that much more versatile. I don't know about the science behind the negative ion stuff, however the lamp has a very soothing and calming effect. We love it, it's been on 24X7 since it arrived - no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 3,
      "publication_date": 20180419
    },
    {
      "title": "It was tall but thin and the carving was poor quality. I had purchased another lamp at a ...",
      "text": "This lamp did not meet my expectations. There was a big piece chipped out of the salt crystal where it was attached to the base. It was tall but thin and the carving was poor quality. I had purchased another lamp at a local store for half the price and twice the quality. Disappointed in this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "EB",
      "helpful_votes": 4,
      "publication_date": 20170327
    },
    {
      "title": "Cute and affordable",
      "text": "I love these!! They could have been packaged better, because a piece of the wood base and some of the salt broke off during shipping. Other than that, they give off a really nice adjustable glow. One lamp is thicker than the other, so it’s more orange than the other. Not a big deal really. For the price, I’m happy with them and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "TeeB",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "A great gift and real salt",
      "text": "I love Himalayan Salt Lamps. I had one that I bought a few years ago that I absolutely love. This one I got as a gift. My parents love it. My mom really wanted one but I didn’t want to spend the high price for one at the store. I scored this one for less than $20.00. The only downside, the light is a bit dim, but it’s a salt lamp so that doesn’t matter at all. I highly recommend this product. Especially as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Pretty but came with broken light bulb",
      "text": "Mine came with a broken bulb. I decided to keep it because I love the shape and the look of the salt lamp. I bought fairy string lights, I rolled it and stuck it inside the lamp and it’s so beautiful at night. With the string lights, I’m able to use the glow feature so it looks like fire inside the lamp.",
      "rating": 4.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Bulb Came Shattered",
      "text": "Lamp looks nice but bulb came shattered and because it was a Christmas gift for someone we wanted to be able to take it home with them my husband is currently working to get the remaining bottom portion of the bulb out. Because the bulb was shattered we also cannot see what it looked like for purposes of replacement and will have to guess as the booklet that comes with does not specify. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "but seems like family allergies are at a minimal",
      "text": "We leave it on all the time, but dim it at night. It just gives a warmth to it. Whether it works or not.....don't really know.....but seems like family allergies are at a minimal. Might be the rains.....",
      "rating": 5.0,
      "verified": true,
      "author": "D. Haynes",
      "helpful_votes": 2,
      "publication_date": 20170308
    },
    {
      "title": "This thing rocks.",
      "text": "What a rock ! Works perfectly, nice dimmer. Surprised at the size of it. However, Amazon just threw the lamp in a shipping box, no packaging to prevent damage, it's a good thing it's a durable item.",
      "rating": 5.0,
      "verified": true,
      "author": "Original 2 Cups of Joe",
      "helpful_votes": 2,
      "publication_date": 20180426
    },
    {
      "title": "Very pleasant, soothing & calming lighting",
      "text": "Provides a very pleasant, soothing & calming lighting to the room. Not sure about air quality yet; it hasn't had enough time to throughly take effect but I do notice some form of change for the better.",
      "rating": 5.0,
      "verified": true,
      "author": "NRR0710",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Nice Salt Lamp",
      "text": "This is a nice salt lamp. I keep it on at night when I get home from work. I like the dimming feature- it's perfect for when I'm going to sleep. The one con is that mine arrived with a chunk out of the wooden base. It still works, but it would be nice if the base was intact.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "I bought this to give as a present and it ended up being late and damaged so I do not feel comfortable giving it as a gift",
      "text": "After arriving late product is also chipped. I bought this to give as a present and it ended up being late and damaged so I am not comfortable giving it as a gift. I've decided to use the lamp myself and must admit that since I've turned it so the chip is not easily seen it is lovely and it could be my imagination but the room I'm using it in \"feels\" better somehow.",
      "rating": 4.0,
      "verified": true,
      "author": "Tracee",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "5*****",
      "text": "Good product! 5***** Customer Service!!! Product came with a broken light switch. Emailed Low_Baller, they busted their butt to get me a new one. Will recommend and purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "HNTNBTCH",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "Salt Lamps for the Win!",
      "text": "Excellent price for 2 salt lamps. I already had one in my room, and now I'm able to add one in my son's room and my niece's room. Perfect for a night light!",
      "rating": 5.0,
      "verified": true,
      "author": "Karabella Taylor",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "It was delivered super fast, everything worked fine from the start",
      "text": "Much more than I expected! It was delivered super fast, everything worked fine from the start, and it's bigger and better looking than I could have hoped for. Not going to say for sure that it is a magic lamp but I will say that since using it in the bedroom, my husbands allergies seem much better. He doesn't wake up stuffy and he doesn't snore at all anymore. I will be buying more!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki Brock",
      "helpful_votes": 2,
      "publication_date": 20180421
    },
    {
      "title": "Bulb came completely shattered- I had to clean up a ...",
      "text": "Bulb came completely shattered- I had to clean up a bunch of glass before I wrapped it as a gift. Packaging was not good- there was a bunch of loose salt in the package and obvious scratches all over the wooden base.",
      "rating": 2.0,
      "verified": true,
      "author": "vernofguam",
      "helpful_votes": 2,
      "publication_date": 20170505
    },
    {
      "title": "Pretty but there appears to be a short in the cord.  Rather disappointed.",
      "text": "Having some issues with the power on this. It turns on, but after a few minutes just shuts off. If I move the cord, it will turn back on. Thinking there is a short somewhere but I'm not really qualified to mess with it. May have to take it somewhere to be fixed.",
      "rating": 3.0,
      "verified": true,
      "author": "db2haacker",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "saying it tastes just like salt.",
      "text": "gift for my wife, light bulb still comes on after 4 months, kids keep licking it, saying it tastes just like salt.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy Tyson",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Lack of quality with base, lamp and cut salt shape.",
      "text": "This is, unfortunately,the lowest quality salt lamp I've ever purchased. It will serve it's purpose but I'll be finding a nicer one for our living room. The bases we're slightly damaged prior to packaging and shipping. The lamps were well padded in generic brown boxes. The lamp holder is a flimsy metal that feels like it will quickly break after a couple light bulbs are replaced. The salt shape is a coarsely cut pyramid, not the nice oval shapes of all the others we've purchased from Amazon. I will stick with familiar brands from now on for quality workmanship.",
      "rating": 1.0,
      "verified": true,
      "author": "SunflowerStateKCMama",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Best salt lamp",
      "text": "I bought this salt lamp for my husband and he loves it. We use it everyday, i love that it has a dimmer switch and i love that this lamp goid for yoyr health.",
      "rating": 5.0,
      "verified": true,
      "author": "megan p",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "I just starting using it yesterday, and it makes ...",
      "text": "I just starting using it yesterday, and it makes the atmosphere very calm. At first I didn't know if this one was the recall that someone told me but after researching it realize it wasn't that is why I start to use it, and I will every day!!",
      "rating": 5.0,
      "verified": true,
      "author": "margaret perdomo",
      "helpful_votes": 3,
      "publication_date": 20170130
    },
    {
      "title": "Perfectly beautiful",
      "text": "I purchased one of these lamps a month ago for myself....I love it so much I decided to buy them for Christmas presents for friends and family members. All of them (7) arrived well packed in a timely manner.....just returned home and everyone loved their gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "I already have one and I like the soft glow in my bedroom",
      "text": "Bought for my Dad-he loves it. I already have one and I like the soft glow in my bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Susie Slack",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Beautiful",
      "text": "It's a beautiful lamp. I don't know about the supposed health benefits. It all sounds plausible, but I live in the desert southwest and I think the air is too dry here for it to work as they sat it should. I like it anyway!",
      "rating": 5.0,
      "verified": true,
      "author": "Nevada Ron",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Beautiful!",
      "text": "I have several Himalayan salt lamps. And while I love all of them, the two I ordered from Inviting homes definitely surpassed the others in quality packaging and ease of use after removing from the box. I'm very pleased. The lamps are beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Mirth",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "The salt lamp has great clarity and is perfect size",
      "text": "Product was as advertised. The salt lamp has great clarity and is perfect size. Dimmer works great. Product delivered as expected and in good condition. Just what we wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "ND of FL",
      "helpful_votes": 2,
      "publication_date": 20170118
    },
    {
      "title": "Amazing lamp!",
      "text": "This lamp is incredibly beautiful! The cord is long enough to reach my plug from night stand. It has a dimmer switch so you can adjust the amount of light that you want. I ABSOLUTELY LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Janette B.",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Great Price!",
      "text": "I bought these salt lamps to add to my collection in my home. I now have a total of 28. I wait for the price to be $10 a piece or less. I have an open concept home & and place them through out the kitchen, LV/DR, & foyer. They work by square footage, so I keep adding & grouping them together. Really keeps the air clean & helps my sinus condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna B.",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Looks great",
      "text": "I bought this for my wife and she swears it works, she keeps it plugged in on the end table by our couch and said she cant leave it on when she try's to nap because it keeps her up with energy it gives off.",
      "rating": 5.0,
      "verified": true,
      "author": "Streetglide",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "This started leaking salt water. I’m not sure how ...",
      "text": "This started leaking salt water. I’m not sure how but every where I put it it would leak salt water. It made me nervous to have liquid around the electric so I had to throw it out.",
      "rating": 1.0,
      "verified": true,
      "author": "Cori Rose",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Breathe better sleep better",
      "text": "This lamp has helped my sinus and allergies. I am not taking any meds as the lamp opens and moisturizes the sinus cavity. No side effects. I turn it on in the morning for about an hour and then in the evening for a couple hours. Breathe better sleep better.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Great Buy, Good Price",
      "text": "Love this Himalayan Salt lamp, it was larger than expected and arrived in perfect condition. I leave it on 24/7 and there is a noticeable difference in the air quality in a large bedroom. I like the dimmer switch so I can turn it down to sleep. I will be buying more for other rooms in my home.",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Salty",
      "text": "I bought this for my daughter because she was on a TV show that she was watching and she just had to have one. It is superheavy high-quality and has the cutest glow in her room.",
      "rating": 5.0,
      "verified": true,
      "author": "Kira",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Very nice",
      "text": "This was bigger than i though. I love it the brightness is also adjustable. shipping time great too.",
      "rating": 5.0,
      "verified": true,
      "author": "Om girl",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Not sure if it does that but I love it anyway",
      "text": "Arrived on time and looks lovely. I bought this for the possible benefits to purify the air. Not sure if it does that but I love it anyway. This is a light I can leave on at night at it doesn't disturb my sleep. I'm so used to it now and the glow it gives off is soothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kmelz",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Didn't work from the start!",
      "text": "We were very excited to receive this. My son has had a hard time falling asleep ever since he turned five. Opened the box and everything looked great. Plugged it in, didn't work. Tried different outlets and still didn't work. Returned already.",
      "rating": 1.0,
      "verified": true,
      "author": "Trickybutterfly",
      "helpful_votes": 3,
      "publication_date": 20170124
    },
    {
      "title": "Very nice!",
      "text": "Got these for a gift for my niece and nephew and they absolutely love them. They love the fact that they can dim or make them brighter.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Shaffer",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Lamp arrived with broken resistor",
      "text": "Lamp arrived on time and looks great, but the resistor was broken in half and not repairable. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Zoe Colton",
      "helpful_votes": 11,
      "publication_date": 20170102
    },
    {
      "title": "Bummer...",
      "text": "So, this thing was beautiful. Loved having it on in the evenings within view, but it one day just stopped working. Thought it was a burnt out light bulb but even with a brand new bulb it didn’t work. Now I just have a rock.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam K.",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Love it",
      "text": "Such a cute and positive lamp. Love the light it gives and the fact it has a dimmer. It creates a lovely, calming atmosphere. Have gifted one to a friend too!",
      "rating": 5.0,
      "verified": true,
      "author": "Anouschka",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "A beautiful salt lamp",
      "text": "A beautiful salt lamp! The quality is exceptional and the price is reasonable. I purchased three lamps this year as gifts and each one is unique and beautiful. They are the perfect size and the dimmer switch is a wonderful feature. They were packaged securely and areived in perfect condition. Now I need to buy for for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Absolutely love my new salt lamp",
      "text": "Absolutely love my new salt lamp! Bulb that it came with was in pieces when I opened the package which was really irritating. Other than that I'm please with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Donnie",
      "helpful_votes": 3,
      "publication_date": 20170114
    },
    {
      "title": "... it sent as a gift she said she really liked it saw there was a recall on some of ...",
      "text": "Had it sent as a gift she said she really liked it saw there was a recall on some of the salt lamps hope this was not one of them. I have gotten a couple of the salt lamps also and like them a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita King",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "The lamp arrived fast and in great condition. There was no damage to the salt ...",
      "text": "The lamp arrived fast and in great condition. There was no damage to the salt lamp. The cord and light bulb was not broken. It looks gorgeous turned on. Excited to get benefits from it.",
      "rating": 4.0,
      "verified": true,
      "author": "ShopCrazy",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "It has a beautiful warm glow which will surely liven up the cold ...",
      "text": "It has a beautiful warm glow which will surely liven up the cold days. I wish there was a warning that informed me ahead of time that the lamp produces water",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20161105
    },
    {
      "title": "I love my salt lamp",
      "text": "I love my salt lamp. It sits next to my bed. The dimmer switch is the best. It allows me to go from a lamp that lights the bedroom to a soft nightlight. I am not sure if my sleep has improved but since using two months ago I am waking up less throughout the night and feeling more rested in the morning.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Krebs",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Worked for 2 hours",
      "text": "When it arrived, the bulb was broken. Had to order replacements. When the replacement bulb was installed, it worked for two hours and the cord/plug/socket now does not work, even with a new bulb. NOT WORTH THE TROUBLE!",
      "rating": 1.0,
      "verified": true,
      "author": "Scott F",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Perfect gift!",
      "text": "This was a gift, she loves it! It is exactly what she wanted. As the gift giver, I thought it was beautiful. It arrived quickly and was packaged very weak.",
      "rating": 5.0,
      "verified": true,
      "author": "Debi S.",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "Beautiful",
      "text": "Love the lamp. Beautiful soft glow. My cats and I love sitting on the couch near it..... Lol. I purchased it to help calm my little scared kitty. We all love it. Will be getting more as gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "becky k",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Pretty and worth it",
      "text": "I impulse bought this and I love it! The lamp is so pretty and gives off such a nice glow. The packaging was great! Easy to use and looks sooo nice. It's an actual salt rock as well. Overall it's an amazing product!! Also it's really heavy. Probably one of my favorite purchases in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalia",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great night light",
      "text": "We use this as a night light/calming lamp for our daughter. So far it really helps with her moods. Great deal",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Great buy",
      "text": "Bout these to gift and was dry satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Treyrenea",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Electrical didn't work",
      "text": "I bought one of these for myself and loved it. I purchased one as a gift for my sister and the electrical doesn't work. She even tried replacing the bulb. It's not worth the hassle and cost for her to return it. Failed gift :(",
      "rating": 2.0,
      "verified": true,
      "author": "auntielisa2",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "bulb seems to be easily replaceable. light level is adjustable",
      "text": "Works well, bulb seems to be easily replaceable. light level is adjustable. The light bulb was not wrapped, but was still in tact when i received it.",
      "rating": 4.0,
      "verified": true,
      "author": "breealzebub",
      "helpful_votes": 2,
      "publication_date": 20170104
    },
    {
      "title": "Great color and size!",
      "text": "Great color, size and effective. I love having this in my home, it not only sets a nice ambiance, but I feel that it is working well. I am very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "4rvwofproduct",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Love it!!!!!",
      "text": "I love this salt lamp. It is a very good size for the price and I love the adjustable switch that lets you control the brightness.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Barnard",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "Not what’s pictured",
      "text": "My lamp came and doesn’t have the warm pink/orange/yellow light. The salt crystals are almost white and when the light is turned on it’s a bright white shining light, even on the lowest dimmer setting.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "love it!",
      "text": "Have not turned it off since I got it, love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "beautiful piece",
      "text": "These arrived on time they are a really beautiful piece I love the wood accent at the bottom. They work great",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Calming light and well made",
      "text": "Would buy another. Love this one. Have used it 24/7 for over two months now and it's going strong. Doesn't heat up like I thought it would. That's a good thing! Easy to assemble bulb in unit. Came well packed when shipped.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Raymond",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Not so great.",
      "text": "It was really nice at first, but it ended up falling apart after less than a month. The wires just came undone from the piece that holds the light, and we were stuck with just a hollow salt crystal.",
      "rating": 3.0,
      "verified": true,
      "author": "ShieldMaidenMama",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "This would have received 5 stars but I haven't even ...",
      "text": "This would have received 5 stars but I haven't even been able to use it yet. The light bulb inside was broken when I got it. Once I get a new bulb, I will update this.",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal La Grand",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Lasted almost 2 years",
      "text": "This was a great lamp for almost 2 years, until the bulb blew. I bought new bulbs and replaced it, yet it no longer works at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Jillian S.",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Perfect gift",
      "text": "bought this as a gift and it was exactly what I expected. It is a Himalayan salt lamp and was perfect for a gift. It includes the light bulb and the base with cord, nothing extra is needed. Just unpack it, plug it in, and enjoy. Each one is unique but all are similar in style and size.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie & Doug",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Well made",
      "text": "Its comes wrapped really well and super heavy duty. Has a switch so you can have it as bright as you want. Set one of these up in all my kids rooms. They love them. The base was a little small, might have been better if it was a little thicker.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Gregerson",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Love it!",
      "text": "I love how I can dim this product or make it bright. I leave it on all the time and adjust it to however I'm feeling. It can really illuminate a room and is nice to fall asleep to.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Pink Cloud",
      "text": "It makes the bedroom feel peaceful, I sleep better with it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Calle",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Warm amber glow",
      "text": "I can't tell you if I sleep better or have less dust in my house, as it claims, but the soft amber light that radiates through the textured salt block is soothing and gives a soft glow. I turn it up bright at night & soften the light to sleep. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "pcurtis",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "LOVELY GLOW",
      "text": "This product works, or rather lights, as designed. Whatever else it does is, I think, a matter of opinion or imagination. Which is to say whether or not it makes air any cleaner or ionizes the zone it is in is speculative.",
      "rating": 5.0,
      "verified": true,
      "author": "Pleiadian7",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "As Advertised . . .",
      "text": "It's a beautiful addition to our bedroom; the warm light is lovely, and I'm assuming that the negative ions are doing their job.",
      "rating": 4.0,
      "verified": true,
      "author": "Normi ",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Works as a lamp",
      "text": "The lamp is as advertised and works fine as a lamp. I wrestled whether to give it 4 or 5 stars because I haven't noticed any sleep or health benefits.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Perfect salt rock lamp!",
      "text": "I've now bought 3 of these -- for myself and as gifts. They look just like the much more expensive salt rocks!",
      "rating": 5.0,
      "verified": true,
      "author": "Hachi88",
      "helpful_votes": 2,
      "publication_date": 20170111
    },
    {
      "title": "Lovely",
      "text": "So beautiful! And a warm healing light, and energy to my Massage room!!! I highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary O'Neill",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Great buy",
      "text": "Great product perfect size just like description received right on time will buy again give stars. Fantastic price for size",
      "rating": 5.0,
      "verified": true,
      "author": "kv",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Has to replace",
      "text": "The wiring was stripped and ripped out of the bulb socket. It's surprising I wasn't electrocuted when I plugged it in.",
      "rating": 1.0,
      "verified": true,
      "author": "Cat Govis",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Delivery sucks",
      "text": "It came broken and I had to return it. I did not like the quality either bought one from a Home Depot instead",
      "rating": 3.0,
      "verified": true,
      "author": "Kat Smith",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "I think it works.",
      "text": "Slept well the first few weeks I had it, really seemed to relax me.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Southard",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "great shape and color with no problems so far",
      "text": "so far so good, i have had it about 1 month no problems. great shape and color to the salt, wife loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Duke",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Five Stars",
      "text": "Looks super cool, I don't know about the esoteric healing properties all that much.",
      "rating": 5.0,
      "verified": true,
      "author": "jetpackjones",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Beautiful long lasting disinfectes takes away anxiety an bad juju",
      "text": "Love these I've bought multiple given few to my mom an sister's helps clean air get rid of bacteria calms your anxiety filters air, I can't get enough Himalayan salt lamps highly recommend the packages were perfect nothing broke",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey Arnold",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Love this!",
      "text": "Gives a beautiful \"fireplace like\" glow to the room. Gave one to all in my family..haven't heard how they like it. Be sure and get the dimmer switch...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Beautiful lamp",
      "text": "It was a little chipped up when I took it out of the box, but the lamp is still beautiful. My daughter loves the dimming feature. Would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Marguerite",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Love it!",
      "text": "Nice warm light! Not bright enough to be an actual lamp, but creates a lovely glow.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Nice salt lamp",
      "text": "It is pretty nice...base is a little wobbly compared to other ones we have owned over the years. It will work for now.",
      "rating": 3.0,
      "verified": true,
      "author": "Reagan",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Fine, but dirty.",
      "text": "A salt lamp, as you'd expect but mine was dirty and had black marks on the salt. I have to position it a certain way so most of the \"dirt\" is in the back. I have a couple other salt lamps from a different company that were much cleaner looking.",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "It’s beautiful!",
      "text": "I love that you can adjust the brightness! It’s beautiful in my living room and makes my home feel peaceful",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Beautiful lamp",
      "text": "I really like the atmosphere it gives the room. Very soothing. It has a dimmer so can make it quite low for sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "GG",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "SUPER lamp! I love this design and love that ...",
      "text": "SUPER lamp! I love this design and love that it has a dimable bulb. Gave to our son as a gift for his new house.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristal Renders",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Surprised",
      "text": "I bought this for my office thinking they were small. I was very surprised when I received the package and realized they were big. I am very happy with the product and price. I gave one to my daughter for her room. Looks perfect in room and office.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Heard it's a great product. But the instant I ordered it's on ...",
      "text": "Just got arrived quickly. Heard it's a great product. But the instant I ordered it's on sale for ten dollars less not fair. 😀",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "I absolutely love this lamp",
      "text": "I absolutely love this lamp! Great quality and such a warm glow. I just now purchased 2 more because I want them in different areas of my home!",
      "rating": 5.0,
      "verified": true,
      "author": "Just me ",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "Love love love",
      "text": "Love love love! It makes me so happy to have this pleasant soft light and the natural salt rock. It is calming and reminds me to enjoy life's simple pleasures. :)",
      "rating": 5.0,
      "verified": true,
      "author": "music",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Rusted Screws",
      "text": "Really was looking forward to giving this as a gift. Glad I opened it before just gift wrapping it up tho. The screws on the bottom were so rusted that one was broken with the screw stuck in the rock. Just hate when products give me a project instead of quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20181216
    }
  ],
  "product_meta": {
    "title": "INVITING HOMES 6-7 lbs, 6 to 8 inch Himalayan Natural Salt Lamp On Wooden Base with Bulb and Cord - Pack of 2",
    "description": "Size:Pack Of 2\n\n There is difference between living in a house and feeling “at home”. Let INVITING HOMES define your living space. When you return from a long day at work or an extended trip, there is nothing like settling into the comfort of your own home. Transform your living space into your personal haven where you can also happily welcome guests. Your home is an extension of you, and INVITING HOMES has just the right interior décor options to fit your personality. Create a comfortable space that is warm, inviting, and distinctive with INVITING HOMES. \n\n INVITING HOMES presents its Himalayan Salt Lamp collection: ambient, aesthetically pleasing, hand-carved, and with no two lamps alike, you can transform any room into a truly unique space. Himalayan Salt Lamps emit a warm, ember-like glow that makes them perfect as night-lights, mood makers, or centerpieces for conversation.\n\nDISCLAIMER: INVITING HOMES and its subsidiaries will not be held responsible for any claims for injuries, damages, or losses resulting or connected with the use of the Himalayan Salt Lamp. Our company and its subsidiaries will not be held responsible for any and all liability related to mishandling, improper use, or unintended applications of the Himalayan Salt Lamp. Information provided by INVITING HOMES is for educational purposes only and is not intended to prevent, diagnose, or treat any medical condition or disease. Not for human consumption.",
    "rating": 4.5,
    "feature_bullets": [
      "Available Sizes: 6-7 lbs",
      "Quantity: 2 INVITING HOMES 6-7 lbs Salt Lamps / Roughly 6-8\" Tall",
      "NATURAL LIGHTING: Create a tranquil atmosphere with the gentle glow of Himalayan Salt Lamps.",
      "HAND-CRAFTED: Each and every Himalayan Salt Lamp is unique and represents custom artisanship",
      "CUSTOMER FIRST: Your Salt Lamp comes with the INVITING HOMES Brand Guarantee and a No Hassle 90-Day Money Back Guarantee if the product does not meet your expectations. Customer service is our priority."
    ],
    "specifications": {
      "Brand": "INVITING HOMES",
      "Manufacturer": "INVITING HOMES",
      "Item Weight": "11.33 pounds",
      "Package Dimensions": "9.6 x 8.4 x 6.6 inches",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Orange",
      "Material": "Salt",
      "Light Direction": "Uplight",
      "Power Source": "Corded Electric",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Wattage": "15 watts",
      "ASIN": "B07KRQWYVL",
      "Customer Reviews": "4.5 out of 5 stars721 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#3,150 in Tools & Home Improvement",
      "Date First Available": "November 21, 2018"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Salt Lamps",
      "Novelty Lighting"
    ],
    "price": 16.99
  }
}