{
  "website_summaries": [
    {
      "verdict": "The Reebok Royal Nylon’s classic look is palatable to many purchasers. They just love how easy it is on the eyes and how it effortlessly matches their outfits.Aside from style, the comfort that this shoe brings also don’t go unnoticed. There were even mentions of how this pair makes long workouts bearable. At less than $90 a pair, the Royal Nylon is easily a must-have for many.",
      "pros": [
        "A lot of reviewers loved how neat and pretty this shoe looks",
        "The Reebok Royal Nylon is a true classic, from its silhouette to its largely monochromatic colorway",
        "Some reviewers shared that this pair of sneakers is also great for running and walking",
        "A large percentage of those who bought a pair of Reebok Royal Nylon shoes gave it a high overall satisfaction score",
        "Many of those who left reviews expressed enthusiasm in recommending this model to friends",
        "Several reviewers are so excited to share about the comfort that this pair of shoes brings",
        "Many absolutely loved the fact that this pair of sneakers is very affordable",
        "Some reviewers enthusiastically expressed interest in buying a pair of Royal Nylon shoes again"
      ],
      "cons": [
        "There were reviewers who mentioned that the Reebok Royal Nylon is narrower than expected",
        "At least one reviewer talked about how badly put together the product that reached them is",
        "A reviewer thought that the tongue of the Royal Nylon is too short"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.9,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Small toe box",
      "text": "It's a solid shoe. I read the reviews and got a wide width, but the toe box was still somewhat narrow. Just loosen the laces and you're ok... But the laces are surprisingly small for a size 13 shoe. I'll get another set of laces for these shoes, but I shouldn't have to. Still the classic look that I loved for decades, but they could do a little more.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave C.",
      "helpful_votes": 3,
      "publication_date": 20180922
    },
    {
      "title": "Shoes with Support",
      "text": "Got these as replacement work shoes and I’m happy with my purchase so far. The shoes fit as expected and give support where needed. After about two month of wear and breaking them in I still have to say I’m happy with my purchase. No signs of wear and tear and again the support is still going strong. Grab a pair of your on your feet all day. You’ll love them.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin D. RogersTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "They seem small at first but it works fine",
      "text": "Be aware that they may feel tight as you wear them at first, almost as if they were half a size smaller. After 2 or 3 days of use, you will notice that they start to be more comfortable. A week later they expanded a bit as I walked around and it worked fine. They are lightweight and you can spend the whole day with them. It got the one in black, looks neat!",
      "rating": 5.0,
      "verified": true,
      "author": "ferd rodris",
      "helpful_votes": 7,
      "publication_date": 20171008
    },
    {
      "title": "Comfortable and Consistent",
      "text": "My husband has been ordering the same sneakers for several years. They fit well, are very comfortable and not a bad price. He wears them to work and just about everywhere except Church and times when he wears sandals. They wear well, we replace them about once a year. Probably owing to his foot and not the sneakers themselves they tend to rip in the right toe when they are pretty well worn out anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "definitely seconds, but a good deal",
      "text": "these are definitely seconds, but they're a great deal anyway. the shoelaces are way too short. and the toes are coming unglued, but they can be reglued.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Reebok's a Winner",
      "text": "These Reebok Men's Royal Nylon Classic Sneaker Fashion are for my husband & he swears by them. Fit perfect, comfy, good support & light weight. Probably guessing, this is his 4th or 5th pair over quite a long period of time. He is not rough on shoes, so they last him several years.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharron",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Looks great unfortunately after about 1-2 months of every other day ...",
      "text": "Looks great unfortunately after about 1-2 months of every other day wear the sole where the toe is has a hole in it and I'm quite upset. However this hasn't happened to the other shoes purchased in different colors so I'll chalk it up to a random bad shoe",
      "rating": 3.0,
      "verified": true,
      "author": "Parris",
      "helpful_votes": 3,
      "publication_date": 20170610
    },
    {
      "title": "Basic Sneakers",
      "text": "Glad you can still get a basic sneaker without all the bells and whistles, or looking like an electric light show. Simple, comfortable, and inexpensive.",
      "rating": 5.0,
      "verified": true,
      "author": "tom williams",
      "helpful_votes": 2,
      "publication_date": 20170621
    },
    {
      "title": "My favorite shoe.",
      "text": "I use these shoes as my everyday shoes because they are very comfortable. I have been wearing the Reebok Classic shoe for years and will as long as they are available.",
      "rating": 5.0,
      "verified": true,
      "author": "Clyde Parks",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great shoes",
      "text": "Work at Target and these work great for all of the walking I do each day (6-10+ miles per day). Keep my feet comfortable. Bought two pair that I alternate daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott K. Speece",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great Wear Everyday Shoe",
      "text": "I love these shoes, they look good with everything. Fit wonderfully! Great support! Shipped super fast and everything was as it should be as far as logistics and customer service are concerned! 5 Stars all day in my book!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "William A. Taylor",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Reebok skimps on material",
      "text": "I have bought Reebok canvass Classics for years. On this purchase, I found they shortened the laces by a number of inches. Expanding the shoe to fit my foot used up most of the laces leaving only a little material to tie the knot. I will buy longer shoe laces for these shoes. In the future, I will look for another shoe company. It's a shame I have to leave a good supplier and they will lose a customer over a few inches of shoelace.",
      "rating": 2.0,
      "verified": true,
      "author": "Dickson H Spencer",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Still the Same for me",
      "text": "I have bought a number of these sneakers in a few different colors over the years. Always the same fit and a quality shoe for the price. I hope they make these forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Gratzman",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Classic Reebok Shoes",
      "text": "I like the Classic Reebok shoes because the fit my foot perfectly and they move with my foot. I find most athletic shoes in their modern configuration to stiff (in the soles) to move with the foot. Best athletic shoe I have found to date.",
      "rating": 5.0,
      "verified": true,
      "author": "John J.",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Very nice shoes and true to size",
      "text": "I bought the shoes at 30.67. They fit fine and are true to size. Very nice and comfortable for walking. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "lufucius",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "shoe looks good and fits fine",
      "text": "shoe looks good and fits fine.....but once again what it looks like online can be deceiving.....the nylon material this shoe is made of is hard, cheap, and less breathable than some of the more expensive ones you might find and the reebok outlet store which has a more pliable mesh nylon webbing.....when the cheaper nylon shoes get older.....they crinkle up more and bend the shoe out of shape...",
      "rating": 3.0,
      "verified": true,
      "author": "Mickey L Cartrette",
      "helpful_votes": 2,
      "publication_date": 20180219
    },
    {
      "title": "Multiple purchase of this same shoe.",
      "text": "Husband wears only these and swears by their comfort. On his feet a lot. Over the years I can't imagine how many pair he has owned!",
      "rating": 5.0,
      "verified": true,
      "author": "Starrbyrd",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "The shrinking shoe.",
      "text": "It would seem that every year in an effort to save material and therefore money a little material is shaved off the shoe. When I retired from the Navy in 1978, I wore a size 9 1/2, I still can wear that work shoe, but now need a size 12 W that is tight.",
      "rating": 4.0,
      "verified": true,
      "author": "Harry",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Fits true to size",
      "text": "Very nice shoe wouldn’t say they’re super comfortable but they are comfortable and very attractive looking very satisfied with this buy definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Wolsky",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Men’s Reebok lightweight comfort",
      "text": "I have been buying this tennis shoe for my husband for years now. His favorite and we just order 2 more pairs for 2 relatives that requested them. Also my husband buys his in quantity also. Several at a time. He’s afraid they will quit making them.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty L. Stern",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Reboks Rock",
      "text": "I love these Classic Reboks and can't find them in any local stores. Thanks Amazon for keeping my most comfortable sneaker in stock!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Miner",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "too narrow",
      "text": "I had to return them as they were too tight and narrow. I don't have wide feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Lav",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Reeboks \"size-chart\" was not accurate for me.",
      "text": "I'm male, my foot measures 11.25 (11-1/4) Inches from heel to toe. So according to Reeboks Size-Chart, I'm around a 10.5m. I ordered the recommended size and they were tight in the toe-box with little to no wiggle room at all. My advice is to maybe order true to your size or go half a size up.",
      "rating": 3.0,
      "verified": true,
      "author": "JDManny",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "These are Great!",
      "text": "I've worn these for years because they're the most comfortable tennies I've ever had -- and they last pretty good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Chase",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "now they just sit around next garbage can.",
      "text": "First to small ordered size he needed..returned and ordered half size larger still didnt fit ..now they just sit around next garbage can..he wore these for twenty years..for 4 years couldnt find them. found them on line here there not the same as they use to be.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda H.",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "really like these",
      "text": "one of the shoes that let my feet breath. been wearing them since i discovered them.",
      "rating": 5.0,
      "verified": true,
      "author": "bozzi1200",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "As pictures. Good quality",
      "text": "Fit as expected. Looks like pictures. Cost way less than in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "nichole egan",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Buying this shoe for years",
      "text": "I used to buy this shoe at Dunham's ($20) for years . Now I get it through Amazon. Still the same comfortable shoe all these years.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin P. Korte",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Good Shoes",
      "text": "Have been wearing the type shoe for years. these are great also.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack L. Henderson",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Old reliable.",
      "text": "I have worn this shoe for 20 years. Always fits right. I keep a backup pair in the closet at all times. Even have worn them working with my so roofing. Never slip. White soles only.",
      "rating": 5.0,
      "verified": true,
      "author": "tnwalker",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Miss sized",
      "text": "The sneaker was as expected in terms of quality, price and shipping. However, I've have always ordered a size 12 in this style and manufacturer. This time it seem the shoe was not cut the same as in the past and is too short in length. I wonder if the shoe was mismarked, miss sized, or just not up to their usual spec. William Levin",
      "rating": 4.0,
      "verified": true,
      "author": "William L.",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "great price and very comfortable",
      "text": "Reebok classic has always been my favorite shoes absolutely love them",
      "rating": 5.0,
      "verified": true,
      "author": "Latorie",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Comfort",
      "text": "They were a little tight at first. They expanded quickly and are very comfortable now.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph ortiz",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Exactly as described",
      "text": "I have been wearing these for many years. I just retired from retail and they served me well for 40 hours a week on concrete. Best shoe value out there.",
      "rating": 5.0,
      "verified": true,
      "author": "BEDUBYA",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Love the classic nylon",
      "text": "I like these shoes. They fit as expected (medium width). I have a wide foot so i wore thick socks with the shoes to help stretch them out a bit. I received several compliments on these babies!!! Classic Reebok are my favorite so I'll definitely purchase more in the near future.",
      "rating": 4.0,
      "verified": true,
      "author": "Britany S Smith",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Very Comfortable shoe",
      "text": "I've been buying these since their inception, because they always fit perfectly from day one.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark V",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Alright",
      "text": "I did not like them. They fit very large and loose. I was expecting shoes to feel like I worn them for awhile. Will not buy these again.",
      "rating": 1.0,
      "verified": true,
      "author": "idk",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Slights small",
      "text": "They run smaller than other Reebok classics. A little disappointed about the sizing",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Fava",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Excellent",
      "text": "These are my favorite shoes to wear at all times. Fit is great. Very comfortable. Looks old school. Inexpensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph DR",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Great set of shoes!",
      "text": "I was looking for a pair of sneakers that would be easy to slip into without much effort and these fit the bill perfectly. I was happily surprised by the sole's cushioning, it absorbs weight very well. They are a good walking shoe and are very comfortable. Seems like they will hold up well and they also look great!",
      "rating": 5.0,
      "verified": true,
      "author": "Quintin",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "great shoes, great price",
      "text": "Very comfortable shoes that look nice and at a good price",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Bringing Reebok back",
      "text": "I was unsure about these at first when I received them, but now I like them. A bit old school but it goes with most casual outfits.",
      "rating": 5.0,
      "verified": true,
      "author": "Leigh",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Plus the nylon breathes better than an all-leather product",
      "text": "In the very hot climate where I live, white shoes make a lot of sense. Plus the nylon breathes better than an all-leather product. I have been buying this shoe for over 25 years, and if I can find them at a good price, expect to continue to wear them.",
      "rating": 5.0,
      "verified": true,
      "author": "lawyer",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Great Deal!!!!!",
      "text": "Bought as a gift for my grandson. He absolutely loves them and was so excited. I compared these shoes at other stores. Even if the shoes were on sale, the price I got through Amazon was about 10% less then the sale prices were at other stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Leroy D.",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Order a half size up",
      "text": "I really like the sneakers, but my only drawback is they're about a half size too small. All my Reeboks are a size 6 in boys, which is a 38 in European size. This pair is 37.5. I won't be able to wear them with regular socks, just footies.",
      "rating": 4.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "That. They. Were. The. Perfect.",
      "text": "I. Order. This. For. My. Sister. And. She. Love. Them",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Roberson",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "only the best",
      "text": "I only buy one pair of shoe and this is it. Its the best shoe in the world and Ill never wear anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Flamingo Inc.",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "wrong shoes in Box.",
      "text": "The only thing they got right was the Box. Ordered black size 12 and that is what it said on the box. Inside was a white pair of size 11.",
      "rating": 1.0,
      "verified": true,
      "author": "J. McFarling",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Great Shoes",
      "text": "My husband loves these shoes. Fit is perfect. They are light weight and comfortable for all day wear.",
      "rating": 5.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "love these but they do seem to run small lately",
      "text": "love these but they do seem to run small lately, went up a 1/2 size and still tight, but will deal with that.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "As expected",
      "text": "Have worn this shoe for 20+ years. My feet could not tell a difference in the shoe I received.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas Mitchell",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Good quality, Item as described",
      "text": "Was scared to order these but the item was as described! love these shoes had the black and white ones back in highschool and decides to get the all black! would recommend to anyone! i wear 10.5 and in some shoes 11 but i bought 10.5 and they fit perfect! will def order more",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "GREAT FIX AND GREAT PRICE...",
      "text": "ONLY TENNIS SHOES MY HUSBAND WILL WEAR, BEST FIT, AND GREAT PRICE...",
      "rating": 5.0,
      "verified": true,
      "author": "Janis Cole",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "A bit small",
      "text": "Love the look of the shoe and it's very comfortable, the shoe size is a bit small compared to The Vans I wear. They are also narrow in the toe box. I would suggest going up 1/2 size when you order them.",
      "rating": 3.0,
      "verified": true,
      "author": "Wyatt Wayne Washington",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "product quality change from years ago",
      "text": "I bought many pair of this model shoe when I was in the military and haven't found them in stores for years. The arch support and overall comfort are Not what it used to be. I am actually disappointed in these shoes.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Reebok and Amazon are #1 in my extensive book!",
      "text": "All I buy is Reebok; great arch support, comfortable, great styles and thanks to Amazon an outstanding price! Thank you Amazon and Reebok for the support of my feet and my wallet",
      "rating": 5.0,
      "verified": true,
      "author": "David Taylor",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "these felt like they were made of cheaper material and were an ...",
      "text": "Did not fit, I wore Reebok’s for over 20 years, these felt like they were made of cheaper material and were an odd shape and ran bigger than normal.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Allen",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Not quite a good fit",
      "text": "I used to buy these all the time as they were so comfortable. This one is just a little tight around the lower eyelet area forward to the toes. I am now trying to stretch it out a little with shoe trees",
      "rating": 3.0,
      "verified": true,
      "author": "Mike M.",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "my reeboks",
      "text": "perfect walking sneaker - probably my 40th pair - they have been making this sneaker for over 25 years",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Super fast delivery",
      "text": "Ordered mens sneakers and womens slippers...good quality and super fast delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Mez",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Good quality fit a little small",
      "text": "It seems like it’s better quality then from the store but mine fit a little small though...",
      "rating": 3.0,
      "verified": true,
      "author": "Oyam",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Great Shoes very comfy",
      "text": "The shoe looks exactly like it does online. When you first put on the shoes they might fit a little tight but no worries cause after like the next day wearing them my shoes fits perfect. I`m definitely will be buying Reeboks again from amazon",
      "rating": 5.0,
      "verified": true,
      "author": "raymond",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Great shoes.",
      "text": "These take the place of navy ones that I couldn't find in my size. Those had a sturdier heel but these are almost the same and are super comfortable. Plus I like that they are all black; the other ones had white trim which showed the dirt",
      "rating": 4.0,
      "verified": true,
      "author": "T. Lee",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "Sneakers that doe not clash with a dress  shirt and tie",
      "text": "Because it is black, this casual shoe does not look so casual, and the really breathable nylon keeps my feet dry",
      "rating": 5.0,
      "verified": true,
      "author": "Casual Cyclist",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Clouds",
      "text": "10s usually fit me a bit snug but I buy my sneakers a half size down so they form to my feet after some wear. Even with this strategy these felt like clouds on my feet from the start- the suede is a bit prone to stain but if you're buying white kicks then you should know how to rock them",
      "rating": 5.0,
      "verified": true,
      "author": "Julian",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Great for Shipt Shopping!",
      "text": "They look great, and my feet don't kill me after shopping all day long!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Iannuzzi",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Knockoff or cheap degraded version sold for more than Reebok outlet price.",
      "text": "Doesn't fit like the real deal. Shortcuts made to original stitching and pattern. Some coloring of insole and tounge are wrong. I've been wearing this shoe casually for 20+ years, this pair of shoes actually FELT off when I tried them on. I bought online to save some time, the Reebok Outlet wouldn't be caught dead selling these.",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin Lewis",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "The All Black look is bit too \"food industry\" but ...",
      "text": "The All Black look is bit too \"food industry\" but i got them to wear while walking around Europe and Vans and chuck taylors dont cut it for long distances. At the same price or less, I am also confident these will last longer than both of those shoes, by a wide margin. Paired with an all black outfit, i still feel these are somewhat hip and the price is unbeatable.",
      "rating": 4.0,
      "verified": true,
      "author": "Skow",
      "helpful_votes": 2,
      "publication_date": 20160928
    },
    {
      "title": "Great sneaker!",
      "text": "Loved the classic style of the sneaker. Very comfortable and great fit. Third pair of Reebok's I buy on Amazon. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Venegas",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Fits but is a little tight for wide foot",
      "text": "It fit fine for me just tighter thanI expected. Maybe go a half size up.",
      "rating": 5.0,
      "verified": true,
      "author": "Mojo Jojo",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Very comfortable walking shoes",
      "text": "It is a high quality walking shoes and it fits very comfortably.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey Lee",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Five Stars",
      "text": "Fit great (as expected) only wore them a few times but nice quality sneakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Stamped Graphix",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Great shoes and customer service.",
      "text": "The shoes are awesome, and furthermore the customer service was spectacular. They made sure everything was just as I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Hummel",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Size",
      "text": "Fits to small and short around ankle. I know my size in men's/women and odd that it fit to small.",
      "rating": 3.0,
      "verified": true,
      "author": "Bertha",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": ",look and feel perfect.",
      "text": "The fit and finish of these shoes are great. They are exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Brenner",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "A great basic shoe",
      "text": "My husband and son love these shoes, but only the ones with black soles which seem to be increasingly hard to find.",
      "rating": 5.0,
      "verified": true,
      "author": "srg",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Ol'Skool Reeboks",
      "text": "These are like antique shoes at a very good price. Thank you",
      "rating": 4.0,
      "verified": true,
      "author": "Jane Cleveland",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "The only thing I didn't like was the back of the sneaker digs into the ...",
      "text": "The only thing I didn't like was the back of the sneaker digs into the back of my foot. Other than that this is a good shoe nd I would buy them again.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Reebok Classics are an affordable go to shoe for many ...",
      "text": "Reebok Classics are an affordable go to shoe for many needs. I can work and dance in these. If you keep em clean and rotate out with other shoes, they will remain fashionable for a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "But he loved it the first time he saw it",
      "text": "My nephew needed to order a half size up in this sneaker. But he loved it the first time he saw it.",
      "rating": 5.0,
      "verified": true,
      "author": "DanielJ",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "They are light weight and flexsable comfortable in my feet.",
      "text": "I am buying this shoes last many years. I just can't wear any kind of shoes so now I am stuck to them. But now Reebok make the quality of sole thin and lighter other then this they are the same.",
      "rating": 4.0,
      "verified": true,
      "author": "Manju Agarwal",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Get a 1/2 # bigger .",
      "text": "Those look exactly like the picture but size is smaller like 1/2 #",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "The left shoe fits fine. The right shoe is very look and slips ...",
      "text": "The left shoe fits fine. The right shoe is very look and slips up and down on my foot as I walk. The shoes are well made and the color is right. The fits is not acceptable.",
      "rating": 2.0,
      "verified": true,
      "author": "Martha Hyer",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "They better not stop making these, or I'll have to go barefoot.",
      "text": "Reebok classics are the best. Comfortable. Good looking. And the kids think they're stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron DeVoo",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Reebok rules!",
      "text": "Awesome shoes, my favorites!!!! To be honest Reebok classic y very comfortable, and those in particular are awesome, it's been 1 year since I purchased a pair and is still looking like new.",
      "rating": 5.0,
      "verified": true,
      "author": "Andres",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Best sneaker value",
      "text": "These are a classic. They never fail to satisfy. Great fit and awesome comfort. I've been wearing these Reebok classic for decades.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Five Stars",
      "text": "I got these and they are super comfortable was glad I made this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "CFigwood",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Good shoe for good price",
      "text": "Nice shoe for the price they have lasted 2 months now and still going strong I'm on my feet all day 10-12 hour at work and no complaints",
      "rating": 5.0,
      "verified": true,
      "author": "Jerad Arrick ",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "nice shoe",
      "text": "comfortable takes a bit to stretch them out. nice shoe",
      "rating": 4.0,
      "verified": true,
      "author": "richard myers",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "It is a great shoe.",
      "text": "I have worn this style of Reebok for years, only in white. The black one is the same. It is a great shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin P. Korte",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great shoes for the price.",
      "text": "Well made shoes, I reallly like how the fit and feel.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Classics will never die",
      "text": "Thank you for providing these hard to find, comfy, classic kicks.",
      "rating": 5.0,
      "verified": true,
      "author": "Roque Baron",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Hello 90's",
      "text": "Awesome. Took me back to the 90's. Great product and well worth $43",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah ",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "No more online purchase of shoes.",
      "text": "Felt small even though size 11 versus 10 1/2 of similar Reeboks I have. Also, tongues were missing one of the 2 rows of stitching to attach them.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "True to size",
      "text": "True to size. Great I can get this classic at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Cali girl",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "My Favorite Shoe",
      "text": "Im 46 years old and I wore the exact same show 30 years ago. They are as great now as they were then. Best foot hugging and supportive shoe I have ever worn",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Egan",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Yes!",
      "text": "Hubby's favorite go to shoe, love that we can order by Prime when needed!!",
      "rating": 5.0,
      "verified": true,
      "author": "LVMamaw",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Maybe go a half size bigger",
      "text": "Most comfortable shoes I've ever owned. They run a bit small however they loosen up as they break in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Comfortable",
      "text": "While my wife hated the color my husband loved them. On behalf of him he gives them 5 stars",
      "rating": 5.0,
      "verified": true,
      "author": "Jeep NC",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Love em",
      "text": "I love these. This is my 16 th pair of these. Great for work or play.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrianna",
      "helpful_votes": 0,
      "publication_date": 20170514
    }
  ],
  "product_meta": {
    "title": "Reebok Men's Royal Nylon Walking Shoe",
    "description": "Reebok",
    "rating": 4.6,
    "feature_bullets": [
      "Reebook Shoes",
      "Imported",
      "Outer Material: Leather",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Heel Type: Flat",
      "Shoe Width: Medium"
    ],
    "specifications": {
      "Date First Available": "27 Aug. 2020",
      "Manufacturer": "Reebok Footwear",
      "ASIN": "B08GVB6WHR",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 92.26
  }
}