{
  "website_summaries": [
    {
      "verdict": "Like a sweater for your feet, the Cardy boot wraps your tootsies in a thick, crocheted wool-blend upper, while pampering your soles with Uggpure sheep fleece lining. A cute way to add extra warmth to your winter wardrobe, and perfect with everything from jeans to casual skirts with leggings.",
      "pros": [
        "The versatile, slouchy style can be worn in three ways: button it all the way up with the three oversized wooden buttons, cuff it all the way down, or let it slouch somewhere in the middle",
        "Available in six colors, including port and peacock"
      ],
      "cons": [
        "Unlike most Ugg boots, the sheepskin lining is only on the soles, not up the shaft",
        "These are wider than other Uggs, so if you have narrow feet, go down a size"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Replica Pair?",
      "text": "The pair we received seemed like replica UGGs. The material between the left and right pair did not match. There were no QR codes in the box or on the shoes. I was under the impression that this was supposed to be with every pair",
      "rating": 1.0,
      "verified": true,
      "author": "Roberto A Rivera",
      "helpful_votes": 105,
      "publication_date": 20171229
    },
    {
      "title": "Perfection",
      "text": "I was gonna buy these from the UGG website but I had a coupon for Amazon so I said why not? These boots are gorgeous, gorgeous, gorgeous and look rich. They look so much better than the regular UGGS and I love that they can be worn two different ways. They’re soft and warm without making your feet hot. I wear them with thin socks. When it comes to sizing, I wear a 9 in all boots and all dress shoes and stuck to my size. I did not size down like others suggested. Thankfully they fit perfect! Like a glove.",
      "rating": 5.0,
      "verified": true,
      "author": "NickyC",
      "helpful_votes": 15,
      "publication_date": 20181107
    },
    {
      "title": "They're great with jeans",
      "text": "I have had these boots for 3 years now and I can wash them and they still look brand new! They're great with jeans, leggings, or around the house in pjs. Even after 3 years, the tread is still good, lining is still warm and fluffy, and there are no picks or tears in the sweater knot on the outside of the boot. These are a bit expensive, but worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Taylor",
      "helpful_votes": 19,
      "publication_date": 20180101
    },
    {
      "title": "Don’t go DOWN a size!!",
      "text": "Love the boots..ordered size 9 & size 7 arrived. Reordered size 9 as my size is 9 1/2 & they Suggested to go down a size, so I ordered size 9. Got the 9’s for Christmas, too small. Ordered size 10, they fit fine.",
      "rating": 3.0,
      "verified": true,
      "author": "sunny side up",
      "helpful_votes": 18,
      "publication_date": 20180125
    },
    {
      "title": "The Perfect Boot!",
      "text": "True to size! I'm a true size 7, and while I read other reviews about the fit, I decided to stick with my normal size, and I'm glad I did. Not only are these boots super cute, but they're really comfy. I am thinking of ordering a second pair just for sh#}% and giggles, because I love them so much! They absolutely live up to other reviews made about not seeping water in. I stepped in a pile of snow last week, and thank God my feet didn't get wet!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Munafo",
      "helpful_votes": 32,
      "publication_date": 20170120
    },
    {
      "title": "A lot of the reviews said the shoes run big so I ordered a size 8 instead of a 9 and they fit perfect. I Love",
      "text": "The reviews were very helpful. A lot of the reviews said the shoes run big so I ordered a size 8 instead of a 9 and they fit perfect. I Love them",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 36,
      "publication_date": 20160910
    },
    {
      "title": "THESE ARE FAKE!!! Knock-offs! Junk",
      "text": "THESE ARE FAKE!!! I’ve only worn them a few times since purchasing them 3 months ago. From the beginning I thought they felt weird. Much different than the 3 other pairs of Uggs I’ve purchased at the mall. After inspecting them tonight I realized there is no registered trademark on the heel tag, the soles are different than advertised here and definitely do not match the Ugg site. No wonder the knot fabric is constantly shedding. So basically you’re paying full price for a FAKE PRODUCT!!",
      "rating": 1.0,
      "verified": true,
      "author": "Megan Mays",
      "helpful_votes": 5,
      "publication_date": 20200226
    },
    {
      "title": "I DON'T EVEN KNOW WHERE TO START.....",
      "text": "Not described item. My daughter worked hard and saved her money to buy these. She has always wanted Grey cardy uggs and was so excited when these arrived, but was disappointed when she opened the box. These are PURPLE, have brown buttons and look worn. She hates purple, but my biggest issue with them is they are obviously worn. Returning immediately. Will always purchase Uggs directly from the store from now on.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20191220
    },
    {
      "title": "wanted to love",
      "text": "I love how these look and how the fur feels on the bottoms of your feet. However they were too large. I downsized and felt that my toes would eventually wear holes in the tops of the shoe bc of the smaller size and the knit material. Then only on my right foot my heel would continuously slip out of the boot when I walked. I tried to wear these a few times and the knit got baggy within just those few wears. I didnt feel that they would hold up over the long haul.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Riva",
      "helpful_votes": 3,
      "publication_date": 20190107
    },
    {
      "title": "Go down a size",
      "text": "I love this cardi uggs! I have been wanting them for awhile and I tried a size 9 which I normally am and it was a little big. My heel would come up and I read reviews that they do stretch over time so I got a size 8. It was snug at first especially since I have a wide foot but super comfortable and they ended up stretching so I am super happy that I went down a size. I would recommend weather treating them and wouldn’t advise to wear in snow or rain.",
      "rating": 5.0,
      "verified": true,
      "author": "AB ",
      "helpful_votes": 2,
      "publication_date": 20190429
    },
    {
      "title": "Fit my personal needs exactly as hoped",
      "text": "I wanted something that not only kept my feet warm in the house but would also cover my ankles without wearing socks. On a whim googled UGGs to see what they had. I had never seen this Cardy style before and thought they might fit the bill. I love them. They fit perfectly (ordered my regular size) and are very cozy. Being also able to wear them outside is a real plus. I live in San Diego and am between the inside and outside throughout the winter. I did have some difficulty getting them on the first couple of times while slipping my heel from the knit area over the leather edge. However after that they slipped on easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane F. Reeder",
      "helpful_votes": 2,
      "publication_date": 20180111
    },
    {
      "title": "Uggs: worth the investment!",
      "text": "I love these boots, they can be worn to dress up or go casual. Great for cold weather and very comfortable for all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20190125
    },
    {
      "title": "Cute, Comfy, and AUTHENTIC!",
      "text": "For me the fit realllllly depends on the person. Some people say to size down, mine fit perfect in my regular size. I ordered a 9, as all my other shoes are. These are extremely amazingly comfortable. Note: you should NOT wear socks with these boots! The wools natural properties is natural moister wicking and molds to the shape of your feet. The insoles are replaceable for those with very sweaty feet whom feel the need to replace after a bit of time. (Please wash your feet before wearing! That prevents foot oder). I have bought these before and they are so cute! You can also unfold the top and wear them like long boots. Definitely authentic UGG brand boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Joheidi",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "So so comfortable",
      "text": "These are the only Uggs I think are actually cute - and I do love them now that I’ve been wearing them. So so comfortable and versatile - wear them up or roll the sweater down for more of the bootie look. My feet stayed toasty warm at a November Bama game - and so comfortable for all that walking to and from the stadium. The fit is a little large - but that turned out to be fine when I wear a thicker pair of socks with them. Took me a while to become an UGG fan - but these boots did it. The price is certainly worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Aaaarg Matey!",
      "text": "I am true size 7, and I have to wear two pairs of socks with these or my heel lifts out. Plus, I don't like how the fabric next to the buttons sticks out wether they are up or down, makes you look like a pirate. They are comfortable, but those two things are kind of a downer for $160 boot. I threw away the box like an idiot, otherwise I would have returned them for smaller size or something else. At least I can make them work.",
      "rating": 5.0,
      "verified": true,
      "author": "Danele S.",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Warm and comfy!",
      "text": "This is my second pair of these boots. The tag on the back of the heal on these doesn't have \"Australia\" stitched under the UGGS logo like my other pair does and also on the bottom of the boot so it makes me wonder if these are really authentic or if they just changed the logo on the boots all together. They definitely fit a little more snug than my other size 7 that I have but that's expected due to my other pair being broken in. I recommend buying your true size.",
      "rating": 5.0,
      "verified": true,
      "author": "kmc",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Strictly a fair sunny weather boot",
      "text": "I live in So Florida and bought these boots to go to Boston. Thank goodness the weather in Boston was awesome in mid-November because they really can only be worn in cold/sunny weather. Don't get me wrong, the info inside the boot box was clear that they aren't to be worn in rain, slush, snow or ice. Other than that, I really like them and the fact that they can be worn folded over or up high. They're easy to get on and off. I guess the only thing is they're really flat with no arch support. But hey, the look great!",
      "rating": 5.0,
      "verified": true,
      "author": "MEC929",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Very warm and durable under ugly weather conditions",
      "text": "I bought these a little over 3 years ago and I’ve been wearing them everyday in the New York winter, which means lots of cold, rain and snow. They are indestructible. Very very warm as well! The only issue is that I noticed a little late that they ran big. I’m normally a 9.5 ordered a 9 and I think I could have gone with an 8. I guess they stretch out a little after you wear them a couple of times",
      "rating": 5.0,
      "verified": true,
      "author": "Antigoni T",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Absolutely love these boots!",
      "text": "I absolutely love these boots! They are great! Super comfy and great quality! They are the most comfortable shoes I own! I wish I could get them in brown also, but they don’t carry them in my size currently. :/ These are a must buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Nice slipper boot",
      "text": "I can see why some would say to order this boot in one size smaller. As it is not the traditional leather the fit seems looser than normal. If you want to wear these with socks, order your regular size. Without socks they do feel floppy on your foot, Cute design and color. Not for outside wear, you don’t want them to get wet.",
      "rating": 4.0,
      "verified": true,
      "author": "JDeck",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Not real uggs",
      "text": "Got these today and these are not real uggs . These have a different feel than the real uggs if that make sense. They also smell different than real uggs. Bummed I bought these.",
      "rating": 1.0,
      "verified": true,
      "author": "LynnBee",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Like them but was skeptical if they are real UGGs",
      "text": "I like the shoes, but I ordered 2 pr because the first pair, one of the shoes was so big that I questioned if they were real. This is my first pair of UGGs and I finally checked how to tell real from fake. The big thing is the QR code in the left shoe and one pair I got had the tag and one did not. The pair with the one shoe that was way to big was the one that was missing the QR code. Fake? Maybe and for the price I didn't want to chance it.",
      "rating": 3.0,
      "verified": true,
      "author": "kreed",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "I love them! I normally wear a size 9",
      "text": "I was so hesitant to pay $150 for a pair of boots. However, I love them! I normally wear a size 9, but I followed the advice of other reviewers and ordered a size 8. While they're slightly short in the toe I can see how they would stretch out if they were any bigger. They are very comfortable and are perfect for lazy weekends. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne K. McGuinness",
      "helpful_votes": 3,
      "publication_date": 20170208
    },
    {
      "title": "Omg these are fantastic!",
      "text": "I really love the comfy ness of the boot itself. They aside order true to size and I normally wear an 8. But depending on the shoe it can differ. I should have ordered a 7 because I have almost an extra inch in these. But it just leaves room for a thick socks. The cushion when I put my foot in was exceptionally comfortable, I also felt the were wider than said. I have a wide foot and they felt stretched out to me already. I would recommend this buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jami Lynn",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Watch out for seam across ankle.",
      "text": "Nice looking, soles are great. but the seam that falls across the front of ankle rubs on ankle and puts pressure on ankle almost cutting into it. I have had to wet and stretch it out by stuffing tennis balls in boot. It does help, but wearing to pair of sox is still needed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Not genuine uggs!",
      "text": "The boots that I received were not genuine uggs! The tag inside said CQ on it and they started wearing off after a few weeks of use. I’m returning and buying off the ugh website.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachelle Levine",
      "helpful_votes": 5,
      "publication_date": 20171218
    },
    {
      "title": "Worth it",
      "text": "I love these! They are slightly big but not enough to slip off or be uncomfortable. They will be perfect with my thick Winter socks. They are made very well. I plan on only using these for in the house so they will last forever.",
      "rating": 5.0,
      "verified": true,
      "author": "valerie",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Product was perfect, shipping was not",
      "text": "Product was as described. Fit well and looks great. My girlfriend loves them. I knocked two stars because the shipping box had a hole in the side where a MOUSE chewed through and of course it was lined up with the logo of the inside box, thereby ruining the surprise. Like I said, product was fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Snekul_xfire11",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Awesome pair of casual boots!",
      "text": "These boots are great! I can easily fit my orthotic insert in, and the sweater like knit top adapts to keep my feet comfortable and warm! My second pair of UGG boots- they are made out of superior materials compared with less expensive similar boots- and you will want to care for them and wear them for years. Wish they came in more colors!",
      "rating": 4.0,
      "verified": true,
      "author": "K.H.",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Love love",
      "text": "Absolutely love these boots. They fit perfectly!! I usually wear and 8 & 1/2 but after reading reviews on the fit, I went with an 8. Glad I did because I think a 9 would have been too big. These fit great and so comfortable. Love love!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Reigle",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Love!",
      "text": "So cute and so comfy! I wear these all the time! I have had them for 2 months now...they have gotten a lot of use and they are holding up great! I ordered a half size smaller than my usual size based on reviews. They fit but I think I could have gone with my size and they would have fit even better.",
      "rating": 5.0,
      "verified": true,
      "author": "Dani",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Not happy with product",
      "text": "When the boot is folded downward. You are unable to see the label in the back of the boot. Why pay for the label and you can’t see it! I have only worn these once. I will comment on if the boots will actually hold themselves up when I wear them upward.",
      "rating": 2.0,
      "verified": true,
      "author": "Toy-Toy",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Perfect boots for leggings and tights...",
      "text": "I LOVED these boots as soon as I tried them on. I'm a size 8 and they fit perfectly. They are sherpa lined in the sole as most UGG's are and are soft, warm and cozy. They are extremely stylish and can be used short or up to the knee by simply pulling them up or back down. No buttonening and unbottoning. They are very \"soft\" fitting. They are tight around the leg though so they are not meant for stuffing jean's down the boots...but more for wearing leggings or tights, which is what I meant them for. I LOVE them...so happy I found them...",
      "rating": 5.0,
      "verified": true,
      "author": "J. Newbeck",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "perfect!!",
      "text": "perfect fit, genuine! I LOVE THEM!!!! ❤️💕 perfect fit ordered just my size and not any bigger or smaller!! perfect! great quality in the original packaging! cant wait to order the black ones!",
      "rating": 5.0,
      "verified": true,
      "author": "GG",
      "helpful_votes": 2,
      "publication_date": 20191022
    },
    {
      "title": "She loves em",
      "text": "She loves em!! I bought her the same size she wears in shoes and they fit, but are a lil snug, nothing uncomfortable tho. Cant tell ya if they hold up or not yet, she just opened her gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff L",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "These boots are absolutely adorable and comfortable",
      "text": "These boots are absolutely adorable and comfortable. I usually wear a size 9 in Uggs but these felt a little big, roomy and am assuming it is due to the sweater material, as there is a lot of give. Even though my toes touch the end my heel raises up when I walk. I ordered another pair in 8. If the 8 is too small I will still keep the size 9 as they are just too darn cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Teri Willhite",
      "helpful_votes": 2,
      "publication_date": 20170116
    },
    {
      "title": "Order a size larger if you have heavy & muscular calves.",
      "text": "I should have ordered a size 9 instead of an 8. This is my first UGG purchase but I do like the boots.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa Simons",
      "helpful_votes": 2,
      "publication_date": 20171102
    },
    {
      "title": "Great Boots!",
      "text": "love love love love these boots!!! so warm and cozy!! I wish directions on how to clean them came with it but you cant have everything! Definitely worth the purchase!!! Will buy again!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Customer",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "This Ugg is narrow and more like a size 7 not 8",
      "text": "I have three pair of Uggs and time to replace one of them. I wear 8M in all my Uggs. These definitel run small - short in the toe and narrow. Returned.",
      "rating": 3.0,
      "verified": true,
      "author": "Paula M. Hein",
      "helpful_votes": 2,
      "publication_date": 20171123
    },
    {
      "title": "Stretches for larger legs",
      "text": "These were purchased for someone with large ankles and legs. She can't wear the classic UGG boot. The Cardy stretches enough to accommodate her size.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161215
    },
    {
      "title": "Too clunky",
      "text": "I own a regular pair of Uggs and they are super comfortable and warm. However, they are a bit clunky, but manageable. These, however, are way too clunky. The material in the front of these boots is softer than regular Uggs so your foot moves around in there, which has caused me to trip quite a few times. Returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Casual and so comfy!",
      "text": "I love these, they’re so comfortable and warm and very casual so grocery shopping and dog walking these are great. Uggs are very expensive so I probably wouldn’t spend the money again on such a casual boot but I’m overall happy with my purchase and I know they’ll last a very very long time",
      "rating": 5.0,
      "verified": true,
      "author": "Afwfe85 ",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great Product!",
      "text": "I bought these to go on a trip to the mountains. They were perfect! Very comfortable and they looked great with everything I wore.",
      "rating": 5.0,
      "verified": true,
      "author": "J L S",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Not for me",
      "text": "Fit weird and clunky. Were not comfortable at all. Also seemed a lot of money for a boot thats all knit.",
      "rating": 2.0,
      "verified": true,
      "author": "Melanie S",
      "helpful_votes": 2,
      "publication_date": 20180408
    },
    {
      "title": "Warm & Cute!",
      "text": "I never wear flats because I’m short. I never really liked the way these boots look on anyone. However, I live in Illinois and need a pair of boots that are stylish and functional. I love these darn things. I got so many compliments. They’re friggin adorable and keep my little feet warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Kim",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Very comfortable",
      "text": "I love how the uggs fit, easy to put on and I can wear all day, but I wear them folded down and the one thing that bugs me is the edge doesn’t lay flat against the boot, it sticks out, I hope it doesn’t get worse. I might have to put a running stitch if it does, but then I won’t be able to wear them up.",
      "rating": 4.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Love them",
      "text": "Love these. They were exactly what I expected them to be. Super comfy. I followed all the sizing recommendations that other reviewers wrote and it worked for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Haley Trottier",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Nice boot.",
      "text": "Loved the boot, but was afraid they would stretch out when i wore them up my leg. The flap on the side sticks out and looks odd when you fold them down. Also no arch support which I need for walking.",
      "rating": 5.0,
      "verified": true,
      "author": "carski1957",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Comfy and soft.",
      "text": "These boots are made for walkin and that’s just what they’ll do. Kid says they are comfy and keep her feet warm. Second pair she has owned and loves them",
      "rating": 5.0,
      "verified": true,
      "author": "oz",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "So cute and I never used to be a fan!",
      "text": "Never really liked the look of Uggs before, but wanted something light, comfy and good for tromping around in cold weather. These are so great and I think they look so cute on! So much fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "My favorite winter shoes!",
      "text": "I had to have a pair of these after my friend had told me hers have lasted her 6 years and are still in great condition. These are so comfortable and warm. They feel very strong and sturdy too. UGGs are the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Anni",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Awesome Boots!",
      "text": "Great shoes! So comfy and warm! I'd recommend getting a pair right now. The only regret you'll have is wearing the generic off brand boots and missing all that GIG has to offer. You'll never buy a generic pair again.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Another great boot from UGG!!",
      "text": "These boots are very versatile able to be worn short or high. Having different button looks for each allows for outfit customization and more style choice. Although not water proof they are resistant to walking and shopping when some snow is around. Overall a great boot and warm on those cold days!!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Felton",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Just as cute if not nicer as shown",
      "text": "I really like this style. one problem I'm not crazy of the floppy extra material after the last button on these, feel a little sloppy. I will find a way to tack it down, they fit as expected in my size, warm as expected from UGG and are and so so cute! I would like to waterproof the material.",
      "rating": 4.0,
      "verified": true,
      "author": "cj",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Great!",
      "text": "I was a little worried about purchasing these because the reviews were split. But I'm glad I got them! They are the same great quality as my old Uggs from over a decade ago. The fit is great (slightly large but no complaints about that from me) and they are lined along the bottom with warm fleece material. I love this cardy style with the buttons and sweater material. I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Steckling",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Nice boots, run large so size down!",
      "text": "I love these boots!!! They are the most comfortable uggs I own. They do run large so I had to size down. I was worried about the authenticity ordering from amazon but I called & verified + they had the hologram tag. I’m glad I ordered & saved a few bucks by ordering from amazon too!",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Beautiful but uncomfy!",
      "text": "I’m one of the few that that found these incredibly uncomfortable. These boots are beautiful, but when it comes to my feet fashion does not come before comfort!",
      "rating": 2.0,
      "verified": true,
      "author": "Jill Loock",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "So soft, cozy, and perfect!",
      "text": "I love these boots!! I was slightly worried they wouldn't fit (I wear between 8.5-9) and ordered a size 9 and they fit perf. They are the cutest and most comfortable & warmest boots ever. Sooo glad I got them!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephie B",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "heel slippage!",
      "text": "The heel slips. It feels like I'm walking out of these boots with every step. The shoe would be nice if it felt good, but it doesn't. The top of the shoe sags when not folded down and feel strange and uncomfortable. I wanted to love these so badly.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "Nice and Snuggly",
      "text": "These are fantastic! Numice as nd warm and stretchy so if your feet swell or you decide on thick socks no problem. I wouldn't recommend for rainy weather but common sense would tell you that nothing made out of fabric will be good in rainy or wet weather.",
      "rating": 5.0,
      "verified": true,
      "author": "MikkiWonders",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "STYLISH CUTE BUT EXPENSIVE",
      "text": "GREAT BOOT BUT COULD NOT JUSTIFY THE PRICE WITH THE ENTIRE BOOT BEING A KNIT!",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa M. Bacon",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Love Uggs !",
      "text": "There's are the cutest Uggs. With adorable buttons to adorn the outside when you tuck in your jeans or leggings.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Hatfield",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Little loose",
      "text": "These uggs are a little loose compared to my other pair of uggs due to the material they are made from but they are still awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Very warm and comfortable",
      "text": "These are my go to winter boots. Very warm on the inside. I wear a size 11 and they are true to their size",
      "rating": 5.0,
      "verified": true,
      "author": "rashida williams",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Runs large",
      "text": "Order a size down! I am a true 10 and ordered a 10. Even with socks on they flop off my feet, ok with thick socks. Should have exchanged them. But they are warm, cozy and stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Great Boot. This is my 2nd pair of black ...",
      "text": "Great Boot. This is my 2nd pair of black ones in addition to a gray pair I already own. Super comfy and warm! I normally order a size down since these are knitted and stretch.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Ramos",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Too big",
      "text": "I got my size and they are so big im flopping around like I'm in clown shoes. I don't like that. They also don't stay up, if i have them filled up, when i walk around.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer Jimenez",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "They are really cute and should be worn with thicker socks",
      "text": "I love the color and style. I wear a size 9 so ordered a size 9. This style seems to run a little big because the heal slips out a bit, but can be helped with thicker socks.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Reuter",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Very warm and comfortable",
      "text": "I bought them for my 78 year old mother who has Alzheimer’s. They are so comfortable and safe for her to walk in. During the winter I know she is warm when she wears these",
      "rating": 5.0,
      "verified": true,
      "author": "Tayninh Wilson",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Warm, Cozy...Love Dem Boots",
      "text": "I love love love love love love love love love love love love these boots!! I live in them most of the time. 🥰",
      "rating": 5.0,
      "verified": true,
      "author": "H. Blackwell",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Comfortable",
      "text": "These boots are so comfortable. I like that they can turn over so can be worn up to knees or on mid calf.",
      "rating": 5.0,
      "verified": true,
      "author": "Kippy Sinclair",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "LOVE IT",
      "text": "These were a gift for my daughter and she loves them! You can pull them up like leg warmers!",
      "rating": 5.0,
      "verified": true,
      "author": "LUV2READ",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Super comfortable and warm",
      "text": "I had been wanting these boots for a while, and finally decided to spend the money on myself. I am so glad that I did! They are comfortable, warm, and so versatile. I love that they can be worn short, but when it is super cold outside, you can flip them up and they keep your legs even warmer as tall boots. I didn't realize it had a rigid foot/ankle support part before I got them, but after a few times of putting them on and off, I don't even notice that anymore. I am very happy with the purchase - I just wish I had decided to buy them a long time ago!",
      "rating": 5.0,
      "verified": true,
      "author": "CS78",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Wife approved",
      "text": "Gave it as a gift to my wife, loves wearing them all the time, she loved the unique style compared to the traditional UGGs",
      "rating": 5.0,
      "verified": true,
      "author": "Lani",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Very warm, stylish boot!",
      "text": "So comfy and super warm. Very cute boot. Worth the extra money. Warmest boot I’ve ever purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel R",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Heels slip, extra socks or a footie helps.",
      "text": "These do tend to run a little large. The heel does slip but an extra pair of socks helps, otherwise very comfortable and attractive.",
      "rating": 4.0,
      "verified": true,
      "author": "A Woman from Kazoo",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Nice",
      "text": "Bought these for my mom & she loves them. I have several ugg boots that I love.",
      "rating": 5.0,
      "verified": true,
      "author": "tennille hall",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "So so comfy",
      "text": "These boots are so comfy! They’re not *as* warm as regular uggs, but they more than make up for it with the amazing sweater feel! I love then so much with leggings and a sweater.",
      "rating": 5.0,
      "verified": true,
      "author": "Esther Johnson",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "thinking about buying another pair",
      "text": "These Ugg boots are very warm, no need to wear socks. The boots do run a little bite on the large side. I usually wear a 9.5 to 10 in women shoes, but glad I brought a 9 or my foot would had been flopping in them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20161127
    },
    {
      "title": "Nice boots",
      "text": "These are my daughter's second pair. She lives them and they are more stylish than basic Uggs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer B",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Super cute!",
      "text": "Cute as heck, I put them on the instant I got them because I was so excited.",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Too small",
      "text": "Not a good fit.. too tight and runs small.. gave to my daughter.",
      "rating": 3.0,
      "verified": true,
      "author": "anushh",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "comfort",
      "text": "I like them. You can unfold the cuff and wear them up or not and the material goes up under my knee when unfolded. Super comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Svalba",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Great quality after all these years!",
      "text": "I love these boots. I had a pair about six years ago and wore them for probably two years before i had to replace them. I just got another pair after all these years and disappointing “in-between” boots and I remember why I loved them to begin with!! So comfy, warm, and go with everything!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Love Them so much",
      "text": "Such a cute relaxed look with your winter outfits! Cute without looking like you tried too hard! Love them",
      "rating": 5.0,
      "verified": true,
      "author": "Frenchlittlemama",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Horrible",
      "text": "Ordered twice! First time right boot fit completely different than left! Second time pair was thrown in box looking used with dog Hair on them! Extremely disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela Trout",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Good quality, comfortable and sooo soft!!",
      "text": "Love them! They’re exactly as advertised. They fit well and have held up well so far! They keep my feet nice and warm. They look adorable both folded or pulled up! They make a great option for a more casual outfit :)",
      "rating": 5.0,
      "verified": true,
      "author": "thislittlewhit",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Expensive, but the wife loves them!",
      "text": "I've read other reviews saying the sizes run big or small. I disagree. I needed a 9 but bought an 8 because other reviews said they run big. Not true, I had to return them and got a 9 and they fit perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Absolute favorite",
      "text": "Love these boots! My last pair of Ugg boots lasted me for nearly 6 years. So I figure it might be time to invest in some new ones. I needed comfy & versatile. Order your true size. I initially ordered an 8, I’m a 7.5. I had to send them back for a 7. Great investment piece!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Crivelli",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "So comfy",
      "text": "I love these boots and wear them all the time. They are so comfy. My size can be 7 1/2 or 8 and I got an 8. Just perfect! Love them!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joni M. Rank",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "AMAZING BOOTS",
      "text": "I am regularly a size 8 and ordered as such they do run big, I would suggest going down half a size. With that said I LOVE THESE BOOTS they are so comfortable. I want to live in them. They help with keeping warm in the cold Colorado whether!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Fit great 👍🏽",
      "text": "Fit great and was comfortable, warm, and gorgeous to wear can’t wait to wear them again 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Jada",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Great buy",
      "text": "Great boots. Wife was very happy. Quality as expected for uggs. No surprises.",
      "rating": 5.0,
      "verified": true,
      "author": "Kasey ",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Fits as expected and very comfortable. Great cold weather boot with a good tread ...",
      "text": "Fits as expected and very comfortable. Great cold weather boot with a good tread for slipless walking/shopping/errands. Not snug, so probably not a good distance walker, but a great schlubber!",
      "rating": 5.0,
      "verified": true,
      "author": "RainbowSerpent",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Is a good quality",
      "text": "Will have to return it is to big I order a 10 and is way to big so will return it for a 9 are 8 and a half",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Good quality",
      "text": "Great quality, girlfriend absolutely loved them and they fit her shoe size well.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Love these!",
      "text": "I ordered these to have a cute, flat heeled alternative to my favorite wedged ankle boots and they're perfect. After reading other reviews, I ordered down half a size and the size 9 fits my typically 9.5 feet perfectly. I wish I had ordered these earlier!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Great boot!",
      "text": "The boot is very comfortable and warm. Love how you can wear them high or low. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori DeLuca",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Fast shipping",
      "text": "😍 love it..!! Fast shipping & the best quality ever🤗😘 Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Lida",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "I love these boots",
      "text": "I love these boots and I get compliments every single time I wear them. I can’t wait to buy another pair",
      "rating": 4.0,
      "verified": true,
      "author": "Ms. Shunda K",
      "helpful_votes": 0,
      "publication_date": 20190105
    }
  ],
  "product_meta": {
    "title": "UGG Women's Classic Cardy",
    "description": "Classic knitted boots, extends from mid-calf to tall, Limit 5 pairs of this style per household. Boots feature materials that are not waterproof, Medium width. Sock lined with genuine sheepskin, wooden logo buttons UGG Australia, Style Number: 5819. Polyester binding",
    "rating": 4.7,
    "feature_bullets": [
      "Textile",
      "Imported",
      "Dyed Sheep, Fur Origin: United States/United Kingdom/Spain/Ireland/Australia",
      "Rubber sole",
      "Shaft measures approximately 15\" from arch",
      "Outsole: Treadlite by UGG. pull all the way up the calf, slouch it down a bit, or fold all the way over for a shorter style",
      "UGGpure wool insole and suede heel. 14.5 inch shaft height",
      "Nylon binding. Wood-button closures",
      "Woven heel label with UGG logo",
      "Knit upper (50% Wool, 50% Acrylic). Shaft can be cuffed."
    ],
    "categories": [
      "Boots",
      "Women",
      "Shoes",
      "Knee-High",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 149.95,
    "specifications": {}
  }
}