{
  "website_summaries": [
    {
      "verdict": "A roomy 5-person tent at a price that will fit comfortably into any budget.",
      "pros": [
        "Tall tent with room for most adults to stand",
        "Room divider and gear pouch",
        "Three mesh zippered windows",
        "Double-D door allows easy entry and exit",
        "Great value for the price",
        "Holds up well against wind and rain",
        "Roomy interior"
      ],
      "cons": [
        "Difficult to fit it back into its storage bag",
        "A little more difficult to set up than some of the others in this class"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great tent till it breaks.",
      "text": "I did love this tent, it's pretty light weight, easy to set up for TWO people, and it's a good size. However on our second use the pole for the rain fly broke in half and when it rained it had one or two small leaks, which might have not happened if the rain fly didn't break. Also the tolerances are very tight on the rain fly which probably led to the failure.",
      "rating": 1.0,
      "verified": true,
      "author": "BigTimeDave",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Leaks in rain",
      "text": "Loved this tent when we first got it. It was great in nice weather and a great price but when it was in a medium rain shower that lasted a couple hours, it leaked and luckily we were on an air mattress because there was a pretty good size puddle in our tent. The leak came from the seams around the bottom corners of the tent. We were a disappointed because other than the rain issue, we loved this tent.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeanne",
      "helpful_votes": 3,
      "publication_date": 20150725
    },
    {
      "title": "Will fit two queen air mattresses.",
      "text": "This tent is pretty easy to pop up. You can fit two air mattresses, but will have no room for anything else besides stepping out of your tent. We prefer to only use it for 3 people and a dog and we fit just fine. The door is a little annoying because it doesn't open all the way. You have that remaining strip down the middle. The window covers could be better as well since theres really nothing to tie them with. You tuck the window covers. We've have this tent for about 3 years now and we only go camping once or twice a year. It can get pretty hot inside with just 3 bodies.",
      "rating": 4.0,
      "verified": true,
      "author": "ReRe",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Great for the price.",
      "text": "This tent is quite the bargain. I can’t speak for how waterproof it is since it’s yet to weather a storm, but my boyfriend and I love that we can stand up straight in it. It does have a few flaws though. The ceiling net thing is useless because it’s too small to hook on. I understand that this tent can be divided into two rooms but the divided doors can be frustrating for getting gear in and out of the tent, plus the cut out is very high so drunk me tripped a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "This tent is a tank.",
      "text": "I was foolish, I didn't stake my tent down, and this tent blew over with my air mattress and a crate inside. The next day, not one pole broke, no rips or tears anywhere, and the only thing that happened is that one plastic clip broke on the fly. This tent is a tank, I have had it for 6 years and it's incredible how well it has held up.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Taylor",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Just right for two people",
      "text": "The Suisse Sport Yosemite 5 Person 2 Room Dome Tent 10' x 8' is just right for two people in warm weather and the price was reasonable. It proved to not leak in a strong rain storm. There are 4 windows for good air flow and the awning type rain guard allows air to flow when added. If rain guard is removed, you can see the stars at night through the mess roof. A tall person can easily stand in the tent. Set up is about 5-7 minutes. A queen size air mattress fit easily with room for duffle bags. Floor is sturdy material. Easily fit back into the carrying bag. Not too heavy for carrying and transporting.",
      "rating": 5.0,
      "verified": true,
      "author": "Richmond, Texas",
      "helpful_votes": 0,
      "publication_date": 20140620
    },
    {
      "title": "7 years, going strong",
      "text": "i have had this tent for maybe 7 years now.. i have camped countless times .mostly with my son & 2 dogs u can put up a room devider this was a great purchase we are still using it u can stand up in it..it is easy to put up..i can do it by myself..rain fly also we did break one pole piece but put ductape on it & keep using it fine..for years not.. so glad i got this tent. it's great for all weather & last well",
      "rating": 5.0,
      "verified": true,
      "author": "Auntie j",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Perfect tent",
      "text": "This tent was everything I was looking for, and at a great price! You can stand up in the tent. You can see out even when the rain fly is on. It is easy to assemble and take down. The rain fly is easy to put on even after the tent is up. The zippers work great, and line up properly. I have not used it in the rain yet, but I have no reason to believe it will have any issues. I truly found the tent I was looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Hair",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Couldn't have been happier.",
      "text": "I'm an ex-Eagle Scout, purchasing my first tent for family vacation trips. Purchased this tent after review comparable options and couldn't be happier. The product arrived in great condition, set up in seconds, and was ample room for our family of four. We had our three-year old son in a sleeping bag, our seven-month old daughter in a pack and play, tons of bags, and finally the husband and wife. The tent provides nice finishes (moderate-duty TARP floor, storage areas, light basket, and more), appears to be well manufactured, and is excellent for the price. Personally, I applied additional water-proofing and purchased some better stakes but you could probably do without. Overall, remarkably satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "STICHAM",
      "helpful_votes": 0,
      "publication_date": 20110706
    },
    {
      "title": "This Scout Parent Approved.",
      "text": "I absolutely love this tent! We had to upgrade tents now that my Webelos Scout is getting bigger and needs his own separate space. This tent fits the bill. I have a full air mattress and he has a twin. We had plenty of space in the middle for gear. We have used it in both dry weather and rain. It has held up so far without any leaks/ the floor is made of pretty sturdy material and should hold up for years since we use a tarp under the tent. The screens allow for quite a bit of ventilation when needed. It takes us about ten minutes to set the tent up and about five minutes to take down.",
      "rating": 5.0,
      "verified": true,
      "author": "Vashan",
      "helpful_votes": 0,
      "publication_date": 20141020
    },
    {
      "title": "SOAKED",
      "text": "Bought this tent to have a lil camping adventure with our children. Well we decided to break it out this evening, and lets just say we are now inside our house! There has been an on and off sprinlkle ( 3hrs or so), we had rainguard on and everything zipped accordingly. I'd felt a lil moisture before we laid down to sleep but the info stated might feel slight moisture. SLIGHT?? just as we got to sleep good I awoke to my clothes n blanket being soaked. my 2 yr old was soaked on the other side along w het clothes n blankets. Needless to say I am a bit upset! Will be returning. Ridiculous. One good attribute: Its roomy",
      "rating": 2.0,
      "verified": true,
      "author": "Tabitha",
      "helpful_votes": 0,
      "publication_date": 20131101
    },
    {
      "title": "Nice roomy tent!",
      "text": "This tent was super big, fit two air mattresses, one queen and one full (I could have fit two queens easily). It was very stable camping near the windy beach. Other peoples tents were catching wind and bending over and very unstable while this tent held up well. We did however purchase a heavy duty tarp to place underneath for added protection. It rained hard while camping and we stayed dry! Has electrical wire hole which was nice. It could fit more than 5 people if you needed to. Easy to put up and take down. Great value! No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "AK4",
      "helpful_votes": 0,
      "publication_date": 20140619
    },
    {
      "title": "Nice Tent",
      "text": "Camped in fairly cool and very windy conditions. The rain fly slapped up and down quite a bit on the tent but held on strong. Putting the tent together was easier than taking it apart because the poles tend to get caught on the way out. It was nearly impossible to get the tent back in the bag once we were done. I don't understand why tent manufacturers take into account the air that gets trapped in the tent and help us out and make the bags a few inches bigger. Overall i am pleased with the quality and look of the tent.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon321",
      "helpful_votes": 0,
      "publication_date": 20140516
    },
    {
      "title": "Great tent!",
      "text": "Great, easy to set up tent with no frills, but it's just as good as a Coleman. I also love that it has a small slit that allows an electrical cord to run through without using the main opening which is a great plus. It says that it's a 5 person tent, but let's face it - if you're a sardine, then cramming yourself to this \"tin\" could be feasibly done. I'd say that it sleeps 3 comfortably and for 2 people, it's fantastic. Overall, it's a great tent and the price was right. Love it!",
      "rating": 4.0,
      "verified": true,
      "author": "C. Labye",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "Survived mountain thundestorms!",
      "text": "This wonderful, inexpensive tent served us very well on our camping trip to the Canadian Rockies. It started in Glacier National Park in the US with some rain. The second day, in Waterton Park in Canada, we had intense rain at times and a huge thunderstorm during the night. We were cozy and dry inside. For the whole trip we founf the tent east to set up and take down and quite spacious inside for our queen size air mattress and large dog bed.You can't beat it for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130923
    },
    {
      "title": "Great Tent - Nice Center Height!",
      "text": "Used the tent for the first time in New Brighten Beach directly over the ocean in April 2012. Cold winds blew over the bluff in the evenings. The tent kept me warm and it did not sway in the winds. Perfect size for two people. I had a double height queen sized air mattress with plenty of room to move around. The high center height was the main reason I chose this tent. There is nothing worse then not being able to fully stand up in a tent. It can be assembled in less than 10 minutes. Easily fits back in the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "MeSharonna",
      "helpful_votes": 3,
      "publication_date": 20120530
    },
    {
      "title": "Good tent",
      "text": "This tent was easy to setup and take down. Would have rated a 5 but one of the poles for the rain fly was messing a section. Very comfortable to sleep in. Used in the Smokey Mountains and it rained all weekend. It did leak along the bottom of the door seam during the thunderstorm the first night. It didn't leak during the steady light rains the west of the weekend.",
      "rating": 3.0,
      "verified": true,
      "author": "RBD",
      "helpful_votes": 0,
      "publication_date": 20150905
    },
    {
      "title": "Extra bedroom",
      "text": "Excellent tent! We use it for our grandkids when they come in. We have a town house with only one guest room so we got the tent to put up in our library. The kids love it. It's their own room and they keep their stuff and toys in it. It's easy to assemble and easy to take down and small storage. We had two children's cots and when they grew out of them we got two twin blowup beds. Works wonderful!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shorthounds",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "Perfect tent for me to go camping",
      "text": "Perfect tent for me to go camping. I spend a lot of time camping by myself at the lake and this is the perfect size for me and easy to set up solo. I have a queen size air mattress that fit in in and still room for my duffle bags and coolers when im out on the lake.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyndra Hollenbeck",
      "helpful_votes": 2,
      "publication_date": 20141004
    },
    {
      "title": "Almost New!",
      "text": "I ordered a NEW tent, but when I opened the tent, there was sand and gravel inside. Also the bungy cord that holds one of the tent poles was broken. The tent stakes were also used. I did contact Excellbags.com to try to have the pole replaced, but they advised me that it was not a manufacturer defect, and to contact Amazon. Amazon does have a return option, but no replacement or repair options. Other than these minor problems, I considered the tent adequate enough and needed it within a week for my \"once a year campout\" , So this is the first time that I have not been totally elated with my purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Duarte",
      "helpful_votes": 0,
      "publication_date": 20130930
    },
    {
      "title": "Wonderful Gift",
      "text": "My son was so very pleased with this tent for his birthday. He set it up on the back porch and slept in it that night. It was nice and big and roomy. He was especially excited that he could even stand up and walk around in it. He has already taken it camping in the woods and said it worked Great. Just needed to put the zippers at the bottom next time, because it leaked a little rain at the zipper closure. Otherwise stood up nice and dry despite all the rain.",
      "rating": 5.0,
      "verified": true,
      "author": "Latesha Stephens",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Huge tent!  Love it!",
      "text": "We use this tent for backyard camping with our kids. It is spacious enough for the 4 of us to lounge around inside and tall enough to stand up in the middle. It has huge screen windows on every side as well as the skylight on top so it was never stuffy. Just nice and breezy. It was simple as can be to set up and comes in a carry case for easy storage and portability. We've never used the divider wall because we all just kind of sprawl out together watching movies on I-Pad and sharing snacks. We're suburban campers and this is perfect for us!",
      "rating": 5.0,
      "verified": true,
      "author": "J. hamaguchi",
      "helpful_votes": 0,
      "publication_date": 20110822
    },
    {
      "title": "Great Tent!!!",
      "text": "I love this tent. This is my second one!! As I keep on in storage in Reno for camping at Burning Man. It is perfect for weekend camping and is a good size, not to big and not too small. Gives excellent stand up room for dressing. The tent is the best bang for the buck in tents that I have seen in a while!!! Can easily sleep 4 with people's gear, I love the D shape doors! You can get in and out easily too.",
      "rating": 5.0,
      "verified": true,
      "author": "Dusty Lashes",
      "helpful_votes": 3,
      "publication_date": 20131212
    },
    {
      "title": "Excellent choice!",
      "text": "I did a lot of searching on-line before I made my choice. I couldn't be happier with my choice. It's roomy enough for my raised queen sized air mattress on one side, and my luggage, and a fan on the other, with room to spare. The 6 ft ceter height is great. That was one of the deciding factors for me. I wanted to be able to stand up in it. The e-port is very convenient. I got everything I was looking for, and more. For the price, you can't beat it. Most I found this size, and in this price range had a 5 ft or less center height. I highly recommend this tent.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Decuir",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "Fast to put up, solid zippers for ventilation. Like internal pouches on wall.",
      "text": "Wow - so fast to put up. Been decades since we bought a tent; things have improved. I'd also like to give Amazon a shoutout for fixing a problem with shipping. It seemed to have gotten stuck, so Amazon \"unstuck\" the order, and shipped it next day shipping on their nickel. This tent also comes with a case, room divider, and little pouches on the tent walls inside for holding your glasses or keys, etc. Plenty of ventilation, too. We used it recently in SC in nice weather. Have not tested in the rain.",
      "rating": 5.0,
      "verified": true,
      "author": "Camperling",
      "helpful_votes": 0,
      "publication_date": 20131102
    },
    {
      "title": "but seemed sturdy, plenty of ventilation",
      "text": "really large tent for the money...kinda thin, but seemed sturdy, plenty of ventilation. easy to set up. did the job i needed it to and will be able to use again if i ever camp out...even though the zipper bag is cheap, i was able to fold the tent up and put back in the bag (twice now) without too much effort. just squeeze the air out as you go and it will fit. recommend for the occasional camper...",
      "rating": 5.0,
      "verified": true,
      "author": "KU Fan",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "At first i was happy with my purchase but after a couple of uses",
      "text": "Not sure if it's worth the price. At first i was happy with my purchase but after a couple of uses, i realized how cheap and difficult the zippers are. And one of the main pole strings broke when trying to take down. You have to feed the poles through a lot of fabric which is frustrating and time consuming. Because of this, i may have pulled on the poles too hard and caused the string to break. I do like the size and the fact that it has an electric cord hole.",
      "rating": 3.0,
      "verified": true,
      "author": "min maier",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "There wasn't anything remarkably good or bad about the tent",
      "text": "I'm not sure what to write about this, it's a cheap tent that does the trick. There wasn't anything remarkably good or bad about the tent. However, I have not used it in the rain yet, that would be the only thing I could comment on. Setup was fast, within 15 minutes we had it up the first time, I assume that will go quicker the next time. The divider is basically worthless, if you need privacy between rooms, get two tents. Overall, I really like it, though.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonCustomerMN",
      "helpful_votes": 0,
      "publication_date": 20140808
    },
    {
      "title": "both my boyfriend and I love it. When I first got it I put ...",
      "text": "I really don't know what the other commenters are on about it \"leaking,\" perhaps they don't know how to camp. I have had this tent for about 3 years now, both my boyfriend and I love it. When I first got it I put Seam Seal on all the seams and sprayed the outside with silicone spray, And I still spray once a year, it's really rainy in Washington.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "What can I say...... Super great product!",
      "text": "You wont be leave how large this tent is till you see it in person! The price was insane low and the product was built like a tank. IT is about the size of my VW golf hatch back except I can stand up and have room above my head! I'm 6' 1\" and that has never happen before in a tent! I bought this tent for 35$. I would of paid 6 times that at a local store. It came fast in the mail and well packaged!",
      "rating": 5.0,
      "verified": true,
      "author": "»RïÇH¤ÃrÐ'§",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "perfect",
      "text": "easy to put up even for a girl by herself. i wouldnt say 5 people could fit comfortably but you can fit 2 queen air matresses in SNUG with no extra room. one queen air matress gives you room to move around. there is standing room in the center. i did waterproof it myself just to be sure. it did rain several times and no leaks. overall im happy with the purchase. for the price its a great bargain!!",
      "rating": 5.0,
      "verified": true,
      "author": "Meagan",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "Better than I expected",
      "text": "Better than I expected. Very well designed, good materials, smooth zippers, interior pockets, three large windows, windows in front door, vent in peak, screens everywhere, rainfly makes eves over windows and door. Very GOOD Value.",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph Pratt",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "Best tent ever",
      "text": "I am 5'3. This tent is taller than me. I was worried about putting the rain flap on because that has been a problem in the past with my height. I shouldn't have worried. the design of this tent is excellent. I had the entire thing put up, by my tiny self, in under 15 minutes. The rain flap is put together as a firm dome which is then put over the top like a hat. Super easy. Very roomy. I really love it. Take down was also easy.",
      "rating": 5.0,
      "verified": true,
      "author": "myselfasme",
      "helpful_votes": 0,
      "publication_date": 20140413
    },
    {
      "title": "Worked well for the price",
      "text": "This worked quite well for our family of four on a car camping trip to Yosemite and Grand Canyon. The price is extremely reasonable for the quality. I think the weak point of this tent are the poles, which (like most new tent poles) have an elastic cord in the middle of them. We could tell with these that the cord was not made of high quality, durable material. May they'd tolerate another ten or so set-ups before giving out.",
      "rating": 4.0,
      "verified": true,
      "author": "CAWELCH",
      "helpful_votes": 0,
      "publication_date": 20140802
    },
    {
      "title": "Amazing spacious tent!",
      "text": "Amazing spacious tent! Seriously, this was huge! My girlfriend and I took it to YellowStone with us, it was very big just for the two of us. It's 6 feet in height too, so we pretty much could stand in there comfortably. It rained really hard one of the nights in Yellowstone, not a single drop go inside nor did the tent damage from the winds and rain. Very excellent tent, and the price was a steal.",
      "rating": 5.0,
      "verified": true,
      "author": "Raf B.",
      "helpful_votes": 0,
      "publication_date": 20140925
    },
    {
      "title": "Great tent",
      "text": "What a great buy. I bought for car camping when the wife wants to go. Fits a queen size mattress with plenty of room for two large backpacks and a mountain bike. Its well constructed and has plenty of windows for ventilation. The floor is made of a tarp material and seems to be strong enough not to need a footprint. I waterproofed it and consider it just as good as my TNF or Mountain hardwear tents now.",
      "rating": 5.0,
      "verified": true,
      "author": "j944",
      "helpful_votes": 0,
      "publication_date": 20140412
    },
    {
      "title": "Great lightweight tent",
      "text": "This is a great lightweight tent. We have used it numerous times while camping on Caribbean beaches, and all over the USA during the spring summer and fall. Im not sure how warm it would be in the winter. It's quick and easy to put up and take down. I would definitely recommend this tent for 2 people who like using a queen air mattress and likes extra room for storing gear inside the tent.",
      "rating": 5.0,
      "verified": true,
      "author": "Iwanna Travelmor",
      "helpful_votes": 0,
      "publication_date": 20150927
    },
    {
      "title": "I can stand up in it and I am 6 ...",
      "text": "I can stand up in it and I am 6 '2\" it can fit a queen air mattress too, not much room after that though.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Great for twins who want their own space.",
      "text": "Our twins are at an age where they want their own tent. Instead of investing in 2 tents, we found this one, which is perfect for them! It has a divider to make 2 rooms and each room has their own door! We sealed it with a water proof spray, and knew it was a keeper after camping in heavy rain and it stayed dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "The tent itself is great. Easy to put up",
      "text": "The tent itself is great. Easy to put up. The stakes stuck, but generally most stakes that come with the tent do, and you need to buy ones elsewhere. And the tent poles/frames... well the elastic could be better. It worked all summer, but I will need to replace them for this upcoming camping season.",
      "rating": 5.0,
      "verified": true,
      "author": "Anaquita H Rose",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "It's good looking and stows away nicely though",
      "text": "Not sure about fitting 5 people but maybe I come with a lot of baggage :) Get additional, stronger stakes. We had some water build up in the corners during heavy rain, possibly from walking in & out of the tent. The \"room divider\" is merely a flimsy piece of tent material that's loosely secured down the center. It's good looking and stows away nicely though.",
      "rating": 3.0,
      "verified": true,
      "author": "Teela",
      "helpful_votes": 0,
      "publication_date": 20140911
    },
    {
      "title": "Great tent, spacious and easy to put up",
      "text": "Got my wife this tent for Christmas and we love it. Only reason it didn't get 5 stars is because the separator that hangs in the middle has little tabs sewn on the inside and one of them was sewn into the seem and makes the front hook unusable. Not a huge issue but otherwise it's great.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben Cook",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Nice that there are two rooms",
      "text": "Can't go wrong with this tent! Roomy and well made. Nice that there are two rooms!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen H",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "There is no way 5 people can fit in this tent",
      "text": "Easy to set up and take down. The tent and the poles fit in the bag without having to roll up several times. I took my two kids camping and we had 3 single air mattresses- it was wall to wall. we barely had room for duffle bags. Loved the fact that it has a Velcro opening to allow for a plug etc. Great tent for the price, but only 5 KIDS, could fit in there without sleeping bags etc.",
      "rating": 3.0,
      "verified": true,
      "author": "BeePositive2",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Great weekend tent for the family.",
      "text": "For the price you can't beat this tent. It is durable as any Coleman. One person can put it up. It comes with all necessary items to do so. It's tall enough that I could stand up in it with bending over in the middle. Zippers worked great. Lots of vents if needed and a rain cap easily goes up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Teague",
      "helpful_votes": 2,
      "publication_date": 20120811
    },
    {
      "title": "This tent lasted two years. I got some vigorous ...",
      "text": "This tent lasted two years. I got some vigorous use out of this tent. Until one very stormy summer afternoon when th tent was springing a leak everywhere. I had to toss the tent out, but I will be repurchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "Munkey",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Fast shipping, accurate info so far!",
      "text": "Just got it today! I opened up to text it out in my living room. It is spacious. Only thg I didn't like was the cloth divider. I could make something better than that. I'm 6ft tall female, and I was able to lay in it comfortably. I will update this review when I tet the chance to feild test it.",
      "rating": 5.0,
      "verified": true,
      "author": "LeeAnne Valentine",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Sturdy and really simple to set up",
      "text": "Sturdy and really simple to set up. Perfect for a three night sequoia trip. My only complaint was that the stakes they provided were all very small and weak; if it had been a windy weekend, we might have been in trouble! I will be buying stronger stakes for future camping. All in all, very happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Laurelalice",
      "helpful_votes": 0,
      "publication_date": 20140630
    },
    {
      "title": "... hard after set and I mean poured for a good 30 min",
      "text": "Rained very hard after set and I mean poured for a good 30 min. Had a few small puddles to content with but overall a good tent. It's not a quick set up and tear down...first time using though so cannot judge fairly yet. However, i would recommend a change to design and built a quick set up type. Just a thought.",
      "rating": 3.0,
      "verified": true,
      "author": "DQ",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Height,  assembply and confort.",
      "text": "We used it in our very first camp experience. We assembled very quickly. The set has everything you need. The windows are extremely nice to have for getting fresh air. The package is so small that it can fit into many small areas. I could stand up easily, you do not need to stay bended. The top tile area is very useful esp to place glasses, water bottles, . The sides have 2 pockets , very handy .",
      "rating": 5.0,
      "verified": true,
      "author": "Aykut Yararbaþ",
      "helpful_votes": 0,
      "publication_date": 20130907
    },
    {
      "title": "Awesome tent.",
      "text": "Great tent. Very high quality. The only thing we did to \"modify\" it was spray down the outside with waterproofing spray. It probably would have been fine without it but nature decided to send a heavy storm our way. It withstood 40mph winds! It's no wonder it has so many 5 star ratings.",
      "rating": 5.0,
      "verified": true,
      "author": "That Mechanic Guy",
      "helpful_votes": 0,
      "publication_date": 20140715
    },
    {
      "title": "Average Tent",
      "text": "We experienced some high winds for about 20 minutes and the tent was practically laying on its side. I give it credit that the poles didn't break but I am not sure how durable this tent will be long term. The tent was fairly easy to set up with just to poles. The size of the windows allowed for a nice breeze. I like that you can stand up with no problem inside the tent. I didn't like that the doors weren't bigger. We blew up a queen air mattress and then had to fight to get it in the doors.",
      "rating": 3.0,
      "verified": true,
      "author": "Lib",
      "helpful_votes": 0,
      "publication_date": 20140529
    },
    {
      "title": "Nice",
      "text": "I had one similar to this a long time ago so It went together ok. There has to be a better way to thread those rods thru the openings. It is very difficult. All in all, I like it and would recommend it to anyone. Don't forget the air mattress. Ground is very hard! :)",
      "rating": 4.0,
      "verified": true,
      "author": "panamaj",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "Quality and value is there",
      "text": "Tent is high enough to stand in slightly bent over (at the middle) I am 6'2\". The bottom is a nice thicker tarp material as opposed to the thin fabric that makes up the rest of the tent. You will love the vents and netted windows placed around the tent. Have not experienced it in the rain so I cannot talk about seems and seeps. Thank you. Gr8 buy.",
      "rating": 5.0,
      "verified": true,
      "author": "teckforce ",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "I love it, it works as expected",
      "text": "I love it, it works as expected, no issues so far. It is a lot bigger than I expected, which made it challenging to put up by myself, but i did.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20160417
    },
    {
      "title": "Great value...buy it",
      "text": "The tent was much easier to set up and I thought, though I did check the reviews and everyone stated that it was pretty simple! Great value for the money! Room for a family of 4 and reasonable gear. Buy better tent stakes. You need 6 good ones. Probably one of the beat values I have bought in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "bayotanzk",
      "helpful_votes": 0,
      "publication_date": 20131007
    },
    {
      "title": "TALL and BIG tent!",
      "text": "I am 6'4\" and can stand up in this tent. It is large and easily fits our queen blow-up mattress. It is well-built and has a nice rainfly. Easy to set-up. This is for car camping only. Way too big and heavy to try to bring on an extended hike.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd B.",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Perfect for the price",
      "text": "I really like this tent for the money. It sets up easily, there is plenty of room, and I am 6'2\" and I can stand in it. Seems very durable. We buy a lot of tents to camp in Tijuana Mexico every year. They wear out quickly because the conditions are pretty harsh. We are going soon and we will see how this one holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott S",
      "helpful_votes": 0,
      "publication_date": 20140314
    },
    {
      "title": "Easy for beginner and great for tall people",
      "text": "First-time camper and was able to set it up easily! We had a huge wind storm one night and the tent did great - very sturdy and HUGE - My partner and I are very tall and we both fit super easily. Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Rovniak",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "... for one person plus my gear and was relatively easy to assemble",
      "text": "I bought this as a very occasional camper (rarely) so I wanted something that was roomy enough for one person plus my gear and was relatively easy to assemble. This tent worked well, was big enough and easy to assemble. I am using it again this weekend and am really looking forward to it.",
      "rating": 5.0,
      "verified": true,
      "author": "dean",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "Tent",
      "text": "I bought this tent because I was on a budget, and WOW! I cant believe what a good deal I got. It is cool looking, and I can have this set up before most if my other friends have theirs up. The material isnt the thickest, but I didnt have any issues with that yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Randal",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "easy and durable",
      "text": "we love our tent. we have used it several times and it always makes for an easy up and easy down. it has plenty of room for a queen size blow up mattress and still leaves room for walking around in it and storage of camping goods.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyson",
      "helpful_votes": 0,
      "publication_date": 20131018
    },
    {
      "title": "My two 13 year olds assembled this tent by themselves ...",
      "text": "My two 13 year olds assembled this tent by themselves with no difficulty. Even took it down and got it back in the bag with no trouble. Can't wait to take out this summer!",
      "rating": 5.0,
      "verified": true,
      "author": "cheryl",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "worth the money",
      "text": "After buying a more expensive tent from Sports Authority and giving it away(used only once). We went online and found this one with excellent reviews. It easy to put up only 6 stakes. The rain fly is a little difficult. We don't use the divider. But it seems to have plenty of room for our needs. Did like the online video on how to set-up.The only con I can see I wish it had more interior pockets for your personal items.",
      "rating": 5.0,
      "verified": true,
      "author": "katz",
      "helpful_votes": 5,
      "publication_date": 20110517
    },
    {
      "title": "Nice tent, but difficult to set up",
      "text": "When setting up, the tent poles must be threaded through many sets of sleeves. This process takes a long time, and is made more difficult because the pole sections constantly become separated. Once the tent is finally set up, it works fine, but the set-up process is tedious and aggravating.",
      "rating": 3.0,
      "verified": true,
      "author": "Steven W Brewer",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Great deal!",
      "text": "2 people put up this tent in less than 10 minutes in a 104 degree weather.It is that simple.Make sure to buy different stakes though. The ones that come with the tent are kinda flimsy but for the price you cant complain. It is also VERY roomy.You can actually stand up and move around in it.Great buy!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vil",
      "helpful_votes": 2,
      "publication_date": 20120510
    },
    {
      "title": "It is GREAT for the kids sleeping out in the backyard",
      "text": "This is NOT a serious camping tent. It is GREAT for the kids sleeping out in the backyard. It is simple to put up and tear down. The storage bag is perfect. In the winter, I move the living room furniture aside and have the kids camp out indoors. You cannot beat the price. If you are looking for the weatherproof, camping tent....spend more money to get a tent designed for that environment.",
      "rating": 5.0,
      "verified": true,
      "author": "4kidsin5yrsDad",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Loved it",
      "text": "I do one big camping trip up in the mountains where the weather can go from super dry heat to flash lightening storms. It Rained so hard it hailed and my tent was dry as a bone on the inside. I read other reviews and was cautious. I love my tent!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20130806
    },
    {
      "title": "Dome Tent",
      "text": "Spacious enough to stand, good for 3 people to lay comfortably. Says 5 person, but I would not try more than 3 unless you want to be crammed in the tent.",
      "rating": 3.0,
      "verified": true,
      "author": "Cody & Chelsey Craft",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Sturdy, easy to set up",
      "text": "Have used once so far. Fits my little growing family. Sturdy, easy to set up. Light weight. Look forward to using it for years to come and already have made some great family memories with it. Will put it back in action next spring :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "Decent tent",
      "text": "Overall I like the tent even though it hasn't been used yet. I set it up inside just to make sure that everything was alright and realized that the polls slide through instead of clipping in. This takes time and makes it hard for one person. If you want an easy tent to set up and take down this is not it, but for the cost it was a decent buy.",
      "rating": 4.0,
      "verified": true,
      "author": "CW",
      "helpful_votes": 0,
      "publication_date": 20140413
    },
    {
      "title": "No Zipper Flaps?",
      "text": "This tent is well and good but there is one MAJOR design flaw. It doesn't have any zipper flaps, zipper covers, whatever you want to call them. It may not seem like a big deal, something easily overlooked but even with the whole tent properly treated with flex seal it leaked like a sieve through the zippers. If you go camping in this tent and it rains, i mean really RAINS, then i hope you brought your trunks 'cause you're going swimming.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. Hudson",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "Great for the back yard camper",
      "text": "Used after a night of a wedding and was not able to drive. The girlfriend didn't really like it, but she gets cranky when she drinks so no big surprise there. Very big and spacious. Did not try the 2 room divider so not sure how that goes and it is impossible to restore it in the bag it comes with. Seriously impossible. After rolling it I placed everything in the bag then the roll on top of the bag, the handles fit around the roll perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20131021
    },
    {
      "title": "Fine for back yard camping",
      "text": "I have had this tent now for 3 years. Let me say you get what you pay for. The tent does what its supposed to until it rains this tent can not handle a down pour water will pour in all zipped up windows and the bottom of door. Their is not sufficient over hang of the rain guard. Over all spend a few dollars more and get a better tent.",
      "rating": 2.0,
      "verified": true,
      "author": "ckc",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Good starter tent",
      "text": "it survived a 7 day trip for us (and trips afterward). Prepped it ahead of time with water proofer. We did get wet one night, but i blame the storm not the tent (wind, rain, hail, etc). one pole on the rainfly broke due to user roughness. For a starter tent with comfortable room for 2 at an afforable price, its a good selection.",
      "rating": 4.0,
      "verified": true,
      "author": "Elle L",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "Great tent, but NOT two room",
      "text": "Great tent, but NOT two room. it has a fabric drape you can attach to divide the tent into two, but it would only be worth while for kids maybe. We use it with out though and we are very happy with the quality.",
      "rating": 4.0,
      "verified": true,
      "author": "J9",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "I can stand up inside!",
      "text": "I love this tent because it is tall enough for me to stand up in. My husband and I have used it for several years now and have no complains, no broken zippers or leaks or anything. I'm not sure if I would be comfortable sharing it with 2 other people, but for just the 2 of us, it woks great. We also never use it as 2 rooms, just keep it as one.",
      "rating": 5.0,
      "verified": true,
      "author": "Quira Gangi",
      "helpful_votes": 0,
      "publication_date": 20140504
    },
    {
      "title": "love camping",
      "text": "First time it was used it rained like crazy and not one leak. Can't ask for better than that. Very roomy but not overly large for packing. Couldn't get it back in it's container, but didn't try very hard, Not that important to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ceekabee",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "suitable for price",
      "text": "Although it needs a waterproof treatment, the tent is satisfactory for the average camper. It is spacious and attractive.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "this is a perfect tent for 2 + gear held up to the ...",
      "text": "this is a perfect tent for 2 + gear held up to the weather fine. I recommend getting the 8 by 10 heavy duty tarp for under it",
      "rating": 5.0,
      "verified": true,
      "author": "geo",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Very good looking tent for five",
      "text": "Looks like a great tent, and it came in a bag nicely packed. It's for a gift, so I can't give details on how it works. I think they will love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mia Grace",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Spacious and convenient",
      "text": "Easy set up and take down. It was spacious and the privacy screen inside the tent was handy. We put a tarp down first and then the tent. It kept most of the moisture out. We'll use it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Samirra",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Nice tent, great value",
      "text": "Nice tent for camping at music festivals. Roomy for its size. Excellent privacy with windows up. Rainproof in gentle rain - haven't had heavy rain yet... Not quite as nice as some far more expensive tents I've had, but great value for the price. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Gray",
      "helpful_votes": 0,
      "publication_date": 20120501
    },
    {
      "title": "Great large tent.",
      "text": "Awesome tent. you can put an mattress and have lots of room to stand and change. The tent is heavy and is a very large in the box. so you need make room for it in the trunk.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklyn",
      "helpful_votes": 0,
      "publication_date": 20150601
    },
    {
      "title": "Great Size, Fits a Queen-Sized Matress",
      "text": "Great-sized tent for campers with air matresses. It fit our queen-sized matress (not too much room to spare though). You could probably cram 5 sleeping bags in the tent, but would recommend 4 or less given the tent dimensions.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Sytsma",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Worked for my camping trip",
      "text": "I have only used once so I can't attest to durability but worked great for my trip. I definitely wouldn't consider it a two room tent though as its just a flimsy piece of dividing fabric.",
      "rating": 5.0,
      "verified": true,
      "author": "metoo",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "roomy",
      "text": "using this to hold my plants for the winter to keep the frost off. cant speak for camping but its very roomy, nice looking and seems well made. also a great price compared to other tents this size.",
      "rating": 5.0,
      "verified": true,
      "author": "cindy caine",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "this tent is awesome! Says it sleeps 5",
      "text": "this tent is awesome! Says it sleeps 5, but I've squeezed 6 people and 2 dogs! Lots of space, and ability to stand up in tent while inside. Easy assemble and disassemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "This tent leaked badly",
      "text": "I used this tent last weekend for the first time. It did not perform well in the rain. I had the \"doors\" completely zipped shut but the rain came in at the bottom of the doors through the zipper as if the doors were open and my tent got flooded. I would send this tent back for a refund but I do not have the time to do so.",
      "rating": 1.0,
      "verified": true,
      "author": "James Streeter",
      "helpful_votes": 3,
      "publication_date": 20150503
    },
    {
      "title": "Family Loved It",
      "text": "We're going to a camping trip so I got this a present for my sister in law. She loved it, my sister loved it as well as my mom. My sister is 5'10\" and she can stand straight inside..that makes me a little jealous. The 2-bedroom option is great but I think it's flimsy and will be something that they will not be using.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs DS",
      "helpful_votes": 0,
      "publication_date": 20140528
    },
    {
      "title": "Spacious tent",
      "text": "Good all around tent. Very spacious. 6ft center height makes standing and moving inside tent easy",
      "rating": 5.0,
      "verified": true,
      "author": "Enigma",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": ":)",
      "text": "Very satisfied with this product! Such a great price and an extremely large tent. Very good quality will hold up outside great and is easy to put up compared to most tents I have owned. The shipping was fast and reliable. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "kweeks",
      "helpful_votes": 0,
      "publication_date": 20120717
    },
    {
      "title": "better than my coleman",
      "text": "Much larger/taller than I was expecting, I'm not great with dimensions, so it was a pleasant surprise. Ended up sleeping in it the second night of my camping trip instead of my coleman as the screen holes are smaller and bugs couldn't get in. Very very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Osborne",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "Pretty easy st up",
      "text": "Nice little tent. I'm just a beginner so we took this put in the backyard, planning on taking it out over summer. Fit one adult and four kids just fine.set up was fairly easy does take a little room to get the poles in.",
      "rating": 3.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "It is super easy to put up",
      "text": "We've been using this for a couple of years now. It is super easy to put up. It has held up well. I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Kreuzburg",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Suisse tent",
      "text": "I used this tent for the first time this weekend. It ripped in 2 places when I put it up. It's a good size tent and I love the windows but disappointed in quality",
      "rating": 2.0,
      "verified": true,
      "author": "amybeth777",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "PLEASANTLY SUPRISED",
      "text": "I WAS SKEPTICAL DUE TO THE EXCEPTIONALY LOW PRICE FOR THE SIZE OF THE TENT. IT WAS MUCH EASIER TO ERECT THAN MY OLD TENT THOUGH LIGHTLY SMALLER I WILL CERTAINLY CONTINUE TO ENJOY USING IT. IF IT COULD BE RATED HIGHER I WOULD.",
      "rating": 5.0,
      "verified": true,
      "author": "ROGER SAWVEL",
      "helpful_votes": 0,
      "publication_date": 20140415
    },
    {
      "title": "The best tent we ever had",
      "text": "The best tent we ever had. Large and airy. Need 2 people to assemble and take down. Wish the poles would enter and exit more easily. Fits 2 people with lots of room to spare.",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory Serebrin",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "1st star for fast delivery 2nd star for durability 3rd ...",
      "text": "1st star for fast delivery 2nd star for durability 3rd star for price considering product 4th star for customer service 5th star for ease of use",
      "rating": 5.0,
      "verified": true,
      "author": "Crex",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Pleasantly surprised!",
      "text": "Love this tent. It was a gift for my grandson and he loves it too. It is easy to set up and has plenty of headroom. It has real zip windows, not a mesh top which has to be covered with a fly for privacy. The doors are tall and wide so that it is easy to get in and out. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda B. Hamilton",
      "helpful_votes": 0,
      "publication_date": 20140722
    }
  ],
  "product_meta": {
    "title": "Suisse Sport Yosemite Tent",
    "description": "Yosemite tent from Suisse Sport, 2 room dome style tent that sleeps 5 people, perfect for your next camping adventure. Removable divider splits the tent into 2 rooms. Double D door for easy entry and exit. 3 mesh zippered windows and mesh ceiling. Tent Dimensions: 10 x 6 x 8 feet (w x H x D); tent weight: 13.65 pounds.",
    "rating": 4.2,
    "feature_bullets": [
      "Yosemite tent from Suisse Sport, 2 room Dome style tent that sleeps 5 people, perfect for your next camping adventure",
      "Removable divider splits the tent into 2 rooms",
      "Double D door for easy entry and exit",
      "3 mesh zippered windows and mesh ceiling",
      "Tent dimensions: 10 x 6 x 8 feet (w x H x D); tent weight: 13.65 pounds"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "120 x 96 x 84 inches; 13.1 Pounds",
      "Item model number": "TMDB100872BG",
      "Department": "Unisex-adult",
      "Date First Available": "January 25, 2016",
      "Manufacturer": "Exxel Outdoors, Inc.",
      "ASIN": "B01ARJML64",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Camping & Hiking",
      "Tents",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Tents & Shelters"
    ],
    "price": ""
  }
}