{
  "website_summaries": [
    {
      "verdict": "This curl-defining cream helps  to create curls with sleek definition and movement, while protecting against the drying effects of the sun.",
      "pros": [
        "Helps tame frizziness",
        "Makes hair smoother",
        "Helps define curls without making them crunchy",
        "Offers sun protection"
      ],
      "cons": [
        "Some have said the new formula doesn't smell as good as their old one",
        "A higher price point"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Garners enthusiasm among consumers with coarse hair and dense curls for the way it benefits their hair; but those with finer hair may find it too heavy.",
      "pros": [
        "Formulated with plant oils and polymers that protect, moisturize, and leave curls soft and bouncy",
        "Smells great and has a creamy consistency",
        "Doesn't contain parabens, phthalates, or other potentially harmful or drying additives"
      ],
      "cons": [
        "Feels heavy on fine, thin hair",
        "The definition it gives curls doesn't last all day, especially in humid/wet weather"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "New formula doesn't work to shape curls and smells awful",
      "text": "Bought this for my wife who used the old formulation religiously for years. She says this new formula smells awful and doesn't provide any of the definition to shape curls - it makes her hair frizzy and doesn't work. So disappointed Bumble and Bumble decided to change a great product. She's looking for an alternative product for her hair now.",
      "rating": 1.0,
      "verified": true,
      "author": "OG",
      "helpful_votes": 58,
      "publication_date": 20160528
    },
    {
      "title": "Not worth the money. Save yourself.",
      "text": "I'm very disappointed that the formula for Bumble and Bumble Curl Cream has changed. I used it for at least 10 years and didn't realize the change until I paid $28 for this, opened it, and instead of the old familiar scent, I smelled something that I can only describe as \"Yuck.\" Different formula, different scent. Won't use again. Won't buy again. Feeling ripped off by this company.",
      "rating": 1.0,
      "verified": true,
      "author": "Christie Lee",
      "helpful_votes": 22,
      "publication_date": 20171224
    },
    {
      "title": "I do not like this product for my Curley hair",
      "text": "I do not like this product for my Curley hair. It's dosnt set the curl nice, weighs it down a little. I like the old product called Bumble and Bumble conscious curl creme for fine hair. I wish this product would come back. It's soo much better than the new product.",
      "rating": 1.0,
      "verified": true,
      "author": "Margarite P.",
      "helpful_votes": 17,
      "publication_date": 20180225
    },
    {
      "title": "Product does what it says; happy that I bought it",
      "text": "Not sure if I'd like this product but a friend recommended it. Well, it works great. I have naturally wavy hair and generally blow it out straight which is easy to do in the no-humidity climate I live in. But sometimes I just let my wet hair dry to damp and run this product through it and off I go. I hate messing with my hair. So now I can spend some time and wear it straight and other times just go out curly. May hair is jaw length.",
      "rating": 5.0,
      "verified": true,
      "author": "Clutter Hater",
      "helpful_votes": 9,
      "publication_date": 20180107
    },
    {
      "title": "no bueno",
      "text": "Yikes, I am going to give this product another week but the first two days using it have been awful. My hair has been frizzier than when I use no product. I'm super sad because this was an expensive product. I was trying to find something better than what I use now which in Enjoy. Oh the agony of finding good products for curly hair.",
      "rating": 1.0,
      "verified": true,
      "author": "Fabi",
      "helpful_votes": 9,
      "publication_date": 20180720
    },
    {
      "title": "It WORKS.",
      "text": "My daughter's hair was unmanageable for years (mixed race hair), we tried everything, then tried this. For the first time ever, she said she loved her hair after using this product, and it looks amazing. I read a lot of reviews saying this formula isn't as good as whatever formula they had before, but from our experience with this \"new\" formula, I can say with 100% certainty that it works wonders.",
      "rating": 5.0,
      "verified": true,
      "author": "Alpha Omega Artist",
      "helpful_votes": 5,
      "publication_date": 20181025
    },
    {
      "title": "My Fave Curl Cream",
      "text": "My hair is in between curly and wavy with a bit of volume. My friend gave me this product along with several others while cleaning out her closet and that's when I fell in love with this product, so I bought more! It makes my natural hair manageable. My hair doesn't feel weighed down and it's not greasy or sticky. On day 2 (since I don't wash my hair everyday), I can take a curling iron to it and it still continues to make my hair look and feel great!",
      "rating": 5.0,
      "verified": true,
      "author": "Felicia K",
      "helpful_votes": 5,
      "publication_date": 20190106
    },
    {
      "title": "Disappointed",
      "text": "I have naturally soft curls and this product did nothing but weigh them down and make my hair greasy. I don’t recommend it at all. The cream itself is very thick and no matter how little I’ve used, the end result has never been desirable.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20180614
    },
    {
      "title": "Not worth the cost",
      "text": "This was highly recommend and I was shocked to see the cost.. but I bought it to use to define my curls... it wasn’t any better then Ausie products I already own... the bottle is compressed and looks squished.. not satisfied for almost $30.00..will not reorder... what makes it so expensive?",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "NO NO",
      "text": "Used the product for my hair on the advice of a friend. For my friend it works, not for me. Plan to give my bottle to her. Not the product's fault - my hair just doen't like it.",
      "rating": 1.0,
      "verified": true,
      "author": "Gingerbread",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Great product. Smells fine.",
      "text": "Works for my fine hair. I really miss the old formula, but this is still better than all my other products on the shelf. The smell doesn’t bother me at all.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Bennett",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "4b and bouncy",
      "text": "This is, by far, my favorite curl definer. I have 4b natural hair and use this product on my first style after washing. It keeps my curls distinct throughout the week and I barely use any other products. It’s a bit pricey but totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina G.",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "I feel like this just gave my hair a greasy coating--I find ...",
      "text": "First off, the bottle came exploded with product everywhere. In addition, I feel like this just gave my hair a greasy coating--I find inexpensive mousse at Target works better. I would not buy this product again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Ann",
      "helpful_votes": 3,
      "publication_date": 20170814
    },
    {
      "title": "I have tried everything from a little to alot and ...",
      "text": "I have tried everything from a little to alot and my hair is always left greasy or wet looking.",
      "rating": 2.0,
      "verified": true,
      "author": "Loni",
      "helpful_votes": 3,
      "publication_date": 20171119
    },
    {
      "title": "Creme for curly hair",
      "text": "I purchased this product for myself but it didn't do anything. My hair is thin and straight with no real curl to it. I used it on my niece who has semi curly hair and it help define the curls. We used it her freshly washed her and let it air dry. Her hair was shiny, curly, but smooth.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephany Cruz",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Best product I've found for my long thick curls.",
      "text": "This is great stuff. It tames frizz and shapes my long natural curls. It is the exact right weight for my hair but everyone is different. Definitely worth a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Melina C. Brown",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Worth trying",
      "text": "Really does enhance natural waves and curls, even good for straight hair",
      "rating": 5.0,
      "verified": true,
      "author": "M. Fearon",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Awesome product",
      "text": "I love this stuff, it's great for my curly hair. I have naturally beach curls that I like to have together but hate the crusty gel finish. With this product it lasts all day.",
      "rating": 5.0,
      "verified": true,
      "author": "RedShoes",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "An Aveda hairdresser recommended this to me and I absolutely love it",
      "text": "An Aveda hairdresser recommended this to me and I absolutely love it. If you've got curly hair like me, I recommend using this along with R&B from Lush before drying your hair with a diffuser. Works absolute wonders. My hair is so much softer and my curls last even on 2 or 3 days without a wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Best leave-in conditioner for thick, curly, dry hair",
      "text": "I buy this product over and over because it is that good. I have long, thick, naturally spiral-curly hair. It reduces frizz yet keeps my hair soft-looking. Love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Redo",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Full of water - do not purchase",
      "text": "The bottle was half full of water, completely unusable and disgusting.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Scott",
      "helpful_votes": 2,
      "publication_date": 20190504
    },
    {
      "title": "best product on the market for curly hair",
      "text": "I'm a regular now. I like doing hair product rotations, and this is far better than anything I have used before.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Tested and Approved!",
      "text": "It took me years of testing products on my curly hair, and this has been my go to product for the last 10 years! I use gel and this creme. You don’t need to use a lot, so it lasts me months. Worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Ramsey",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great product, poor packaging",
      "text": "Product is great, however it came opened and 1/3 of the product spilled all over the packaging. Super bummed as it’s an expensive product and some of it went to waste.",
      "rating": 4.0,
      "verified": true,
      "author": "New customer",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Buyer beware: Received a used product!",
      "text": "The seal was open and the product was already used!",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "hands down the best product ive ever used for my curls",
      "text": "hands down the best product ive ever used for my curls. makes it easier to go days without washing to style for my 3c-4a hair. does not leave hair greasy or crunchy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170830
    },
    {
      "title": "I have wavy hair and this holds a good amount of curl for my hair without being crunchy ...",
      "text": "I have wavy hair and this holds a good amount of curl for my hair without being crunchy or weighing it down. Smells awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "petersj3",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Love this product and brand !",
      "text": "Love this product and brand ! It really works ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Kael8",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Great for after shower use - effects last 1 day",
      "text": "I use this creme to help my digital perm curls look more defined. I apply it after I shower on damp hair. It works well and my hair looks wet for a good 3 hours when it usually takes 1 hour to dry. Day after shower, my curls are flatter again and I noticed my hair seems oiler too.",
      "rating": 4.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "Styling cream for natural curls",
      "text": "I love this product, holds beautiful natural waves on my longish hair",
      "rating": 5.0,
      "verified": true,
      "author": "teacher",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Perfect for waves",
      "text": "Letting my hair dry naturally causes a little fuzziness. With your Bumble and Bumble Curl Defining Creme, it looks so soft! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy Gilbert",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "A little goes a long way to helping your hair shape up after a shampoo/blow dry.",
      "text": "I like that it takes so little to get a nice result. My hair behaves with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Robbins",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Love using this product in addition to my leave-in conditioner ...",
      "text": "Love using this product in addition to my leave-in conditioner right before I use my diffuser. Doesn't make curls crunchy unless you use an excessive amount in one area. Overall, will probably buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Chennell",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Still a good product",
      "text": "I still like this product although the formula seems to have changed from the last time I ordered.",
      "rating": 3.0,
      "verified": true,
      "author": "Skibig1",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Great product",
      "text": "In the combination with other Bumble and Bumble products I really like this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "THE BEST",
      "text": "Absolutely the best curl cream I’ve ever bought!! I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugo",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Five Stars",
      "text": "If you want bouncy curls that look lively and have body this is the product",
      "rating": 5.0,
      "verified": true,
      "author": "ALb729",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "fine and thin so the product is a big help",
      "text": "My hair is soft, fine and thin so the product is a big help.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Love the softness and hold of this product",
      "text": "The only one I've ever used that didn't make my curls crispy. Love the softness and hold of this product!",
      "rating": 5.0,
      "verified": true,
      "author": "CaveFam",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Five Stars",
      "text": "This is my favorite curl product! Leaves your hair feeling soft and not crunchy at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Good hold for bouncy curls",
      "text": "A bit sticky, left residue on hands. Good hold for bouncy curls.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "new formula is no good",
      "text": "This stuff is terrible. It made my hair 3 shades darker than usual, did nothing for my curls, yet somehow also left my hair super tangled. I used to be a devoted B&B curl creme user but now that they've reformulated the product it's not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "California Mom",
      "helpful_votes": 6,
      "publication_date": 20170206
    },
    {
      "title": "BUY THIS CURLY GIRLS",
      "text": "This is the stuff to get if you have 2a-2c hair!!! I will recommend this product forever because of the beautiful finish it gives my natural curls. I recommend drying your hair with a microfiber towel out of the shower and leave it wrapped up for 30 min-1 hr and when you bring it down, scrunch the BB into your damp hair. LOVE THIS PRODUCT!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy",
      "helpful_votes": 2,
      "publication_date": 20170316
    },
    {
      "title": "Soft and nice",
      "text": "I love the softness that this cream leaves. There is no stickiness unless you use too much and a little bit goes a long way. I have wavy, fine hair.",
      "rating": 5.0,
      "verified": true,
      "author": "BethG",
      "helpful_votes": 2,
      "publication_date": 20160430
    },
    {
      "title": "... tips hey crunchy felling but I have friends that love it so must just be",
      "text": "Just makes my hair Greasy no matter how little I put in doesn't really give me curls either more waves and I have a purm and my hair on the tips hey crunchy felling but I have friends that love it so must just be me",
      "rating": 3.0,
      "verified": true,
      "author": "bikecrazy",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Four Stars",
      "text": "This is fine, but I like the calming cream better.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "Five Stars",
      "text": "Smells great and keeps my curls curly all day :)",
      "rating": 5.0,
      "verified": true,
      "author": "Imani Bland",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Works well for coarse, curly hair",
      "text": "This product works better than anything else I've tried for my coarse, curly hair. I prefer the old formula but this new formula works well. It's a little thicker than the old so I put a little water on my hands before putting it into my hair just to thin it a little bit.",
      "rating": 5.0,
      "verified": true,
      "author": "RobieL",
      "helpful_votes": 2,
      "publication_date": 20170226
    },
    {
      "title": "hoping like others they bring the old formula back",
      "text": "****PLEASE NOTE THIS NEW PRODUCT CONTAINS NUT OIL***** So not only did the product not perform, I had to wash my hair again when I got home because of the allergic reaction. So disappointing, hoping like others they bring the old formula back.",
      "rating": 1.0,
      "verified": true,
      "author": "Finbladez",
      "helpful_votes": 22,
      "publication_date": 20160919
    },
    {
      "title": "Not good for fine curls",
      "text": "I have curly fine hair that is very thick. I was looking for a product to make my curls less tangled and frizzy but instead this project made my hair greasy. It's very thick and not good for fine hair.",
      "rating": 1.0,
      "verified": true,
      "author": "R H",
      "helpful_votes": 4,
      "publication_date": 20180108
    },
    {
      "title": "Worth the $ !!!!",
      "text": "Not all bumble and bumble products are created equal I've used a lot of their products some I like some I don't this one I absolutely love it has a great sent it doesn't have a greasy or oily feeling in your hair it defines curls but yet leaves them soft and touchable little on the expensive side but I don't mind paying a little bit more for a product that actually works!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "I loved the old product and was hopeful this would work ...",
      "text": "It simply does not do the job the old product did. If you have have course curly hair this doesn't mod the job. I loved the old product and was hopeful this would work but it just doesn't.",
      "rating": 1.0,
      "verified": true,
      "author": "stephanie phillips",
      "helpful_votes": 19,
      "publication_date": 20160731
    },
    {
      "title": "I do not like the smell of this cream at all",
      "text": "I do not like the smell of this cream at all. The other curl cream by Bumble had a much better smell and was not as thick which worked much better for my soft curly head. This cream weighs your hair down.",
      "rating": 1.0,
      "verified": true,
      "author": "Tierney Salter",
      "helpful_votes": 19,
      "publication_date": 20160527
    },
    {
      "title": "Amazing product.",
      "text": "Amazing product... works best when I wash my hair at night and put this on before I go to bed (on wet hair). It defines my curls and almost completely eliminates my frizz. I have very curly unruly hair and this is by far the best product for defining and defrizzing",
      "rating": 5.0,
      "verified": true,
      "author": "S. TROUSLOT",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "Light and Shine",
      "text": "Love Bumble and Bumble. Had not used it for years and we recently reminded of it. Glad to be back. My hair is thin but has good body and wave. B&B does not weight it down and adds shine in the process. A win-win for me. And it's not heavily scented.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "I love this product my hair is so much smoother and ...",
      "text": "I love this product my hair is so much smoother and easy to comb, I just wish it was a better price!",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 2,
      "publication_date": 20180128
    },
    {
      "title": "Great stuff",
      "text": "This is a great styling product for hair with a bit of curl. The scent is very light. It makes my thinning short hair curl right up and gives it a bit of body.",
      "rating": 4.0,
      "verified": true,
      "author": "PennyCoffee",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Use with Bumble Primer for best reslts.",
      "text": "I like this product a lot It delivers as promised.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Grossman",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "🤔🤔🤔",
      "text": "Seems to make my hair funky. Like i used way to much but didnt. By the end of the day its oily and heavy. Kinda not sure about it.",
      "rating": 4.0,
      "verified": true,
      "author": "poe",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Good product",
      "text": "Works great on curly hair. Need a VERY small amount.",
      "rating": 5.0,
      "verified": true,
      "author": "Keira Ranson",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Great hair gel cream",
      "text": "Works well on my curly and frizzy hair. Keeps the frizz down. A little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Benest",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "My curls turned to frizz",
      "text": "It did not work for for curly hair! Left behind residue and did not hold my curls in humidity! It left my hair soft and frizzy!",
      "rating": 1.0,
      "verified": true,
      "author": "Dr Deb",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Great curl definition",
      "text": "Gives great curl definition but does leave a film on your hair if you put too much in. I really like it for my beach wave hair along with a smoothing oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Wilson",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great product",
      "text": "Really nice. Separated my curls. Leaves them soft, no frizz. 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Penny Shaer",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Big disappointment",
      "text": "My hair curls less with this product than without it. My hair also feels oilier. It’s difficult to get it to come out of the bottle too.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise Klosterman",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Five Stars",
      "text": "I love this product but it is sometimes difficult to find.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyra H Rider",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "High quality product and it shows",
      "text": "I am a Caucasian female and I have incredibly thick, curly hair. For the ladies with curly hair, I think it's safe to say it is difficult to find a styling product that does not make our hair thicker/bushy, frizzy, or shapeless. This is the first product I've used that is made for curly hair. I've never used a product that made my hair look as good as this stuff. This is a high-quality brand and it shows. I won't go back to anything else, even though this costs more than other products on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 3,
      "publication_date": 20180403
    },
    {
      "title": "Five Stars",
      "text": "Greatest curly hair creme ever! I love the smell and it tames my curls perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Dye",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Good Stuff",
      "text": "I have not found the perfect curling cream as yet but I have used this for years and like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara Kess Evarts",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "good product",
      "text": "This is a very good product for my hair, which is fine and wavy/curly, depending on how short it is. This creme helps keep frizz down and helps waves/curls to do their thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jan L.",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "This is a great styling product for anyone with naturally curly hair",
      "text": "This is a great styling product for anyone with naturally curly hair. It's not to heavy but it's enough to smooth the curl and frizz without making the curl a limp. Great product and a little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "Who Dat⚜️",
      "helpful_votes": 0,
      "publication_date": 20170618
    }
  ],
  "product_meta": {
    "title": "Bumble and Bumble Curl Defining Creme for Unisex, 8.5 Ounce",
    "description": "A curl defining cream with uv inhibitors that helps to create curls with sleek definition and movement. Its protect against the drying effects of the sun.",
    "rating": 4.5,
    "feature_bullets": [
      "A curl defining cream with uv inhibitors that helps to create curls with sleek definition and movement",
      "Its protect against the drying effects of the sun",
      "It gives healthy hair"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.4 x 2 x 5.5 inches; 7.05 Ounces",
      "Item model number": "685428020252",
      "UPC": "685428020252",
      "Manufacturer": "PerfumeWorldWide, Inc.",
      "ASIN": "B01A4EET44",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Gels",
      "Hair Care",
      "Styling Products",
      "Beauty & Personal Care"
    ],
    "price": 46.19
  }
}