{
  "website_summaries": [
    {
      "verdict": "Durable, well-built canopy that looks and feels sturdier than most models.",
      "pros": [
        "Extra Velcro attachments on the canopy add strength and support",
        "Set up is fast and easy"
      ],
      "cons": [
        "Plastic pieces on the frame have been known to break"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Side panels for the win",
      "text": "Quick & easy to set up and tear down. The side panels are the best feature; otherwise, depending on the angle of the sun, the usable shade space is limited. Well constructed. The rolling wheeled bag is helpful, as it is heavy to carry over a distance. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "R B",
      "helpful_votes": 19,
      "publication_date": 20200908
    },
    {
      "title": "Nice canopy",
      "text": "This is a very nice canopy. I like that it has 2 side flaps allowing me to adjust them to where the sun is coming in but not completely enclose the canopy. Seems pretty sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Unicorn Mom",
      "helpful_votes": 10,
      "publication_date": 20200722
    },
    {
      "title": "Good for camping",
      "text": "Used this on a recent campout with some solid winds (15-20 mph) and it stood up well. You do need to guy it out, but it is heavy and solid. Be careful if you fold it with the top still on the frame. The fabric will get pinched and create weak points. Ours got a little pinched. It's not bad, but I can see that it could be a problem if we're not careful or store it with the fabric on the frame too often.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip T.",
      "helpful_votes": 10,
      "publication_date": 20190514
    },
    {
      "title": "Great Quality, sturdy, taller than average",
      "text": "I love this canopy. I can set it up by myself and with a little fuss put it away myself. Its very well built and sturdy. I had a very tall man in my booth this weekend whose head was among the metal work and he said the canopy was higher than most of the others hes had to stoop around in.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna Palmer",
      "helpful_votes": 25,
      "publication_date": 20190408
    },
    {
      "title": "Too early to tell",
      "text": "Have only used this canopy twice so don't know how sturdy it is. As for sun protection, it's adequate, but don't think it states a UV. Our last Caravan lasted 20 plus years, and we still use it in our yard as a makeshift studio when needed. The ABC levers (controls for the legs) seem flimsy to me, but we'll see. Will update at the end of our season, or before!",
      "rating": 3.0,
      "verified": true,
      "author": "Easymonet",
      "helpful_votes": 6,
      "publication_date": 20190412
    },
    {
      "title": "Big, heavy canopy",
      "text": "I’m sure this is a good product, but it didn’t work out for us. It is good quality, but just too heavy and unwieldy for every day, consumer use.",
      "rating": 3.0,
      "verified": true,
      "author": "A. McCreary",
      "helpful_votes": 9,
      "publication_date": 20181027
    },
    {
      "title": "Great shade at a bargain.",
      "text": "Seems very well assembled. I like that weight bags are included and the peak is ventilated. It stays planted and sturdy even in wind gusts. The light grey material reflects the sun's heat and stays fairly cool. The quick- release leg locks are fantastic compared to the old pull pins on other products. A great product at a very good price. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "BODIH",
      "helpful_votes": 12,
      "publication_date": 20200727
    },
    {
      "title": "Easy",
      "text": "The shipping was fast and the canopy looked to be in great condition. I happened to return it without opening and using it though, because I ended up not needing it. I wanted someone else to use it without opening it or using it. I would recommend since it was fast shipping and a no hassle return.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa DAHLSTEDT",
      "helpful_votes": 20,
      "publication_date": 20200713
    },
    {
      "title": "So far so good!",
      "text": "I got this to try and have a workout area that was covered not only from the sun but by the rain. I thought i could put it up alone. But that was not happening. Took some help from a friend to get it up and set. I don't think this is something that you can easily put up and pack away without a problem. However, it is sturdy, came with all the necessities and then some. The included weights are great and even better is the removable wall. I like that i can put it where I need it rather than having it on a specific side wall. Great product so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Q Rodson",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Easy to put up and plenty of head room",
      "text": "We have only used it once, but it was very easy to put up and looked very professional. The canvas is a nice heavier weight than most pop-up tents. And it rained in the afternoon. Kept the whole gang dry. Plus the over-6-feet guys could walk under the edge without ducking. (They were impressed.) We are pleased with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "S. L. Lewis",
      "helpful_votes": 11,
      "publication_date": 20190524
    },
    {
      "title": "Sturdy and a good value. Went up easily.",
      "text": "Went up easy and was sturdier than a previous similar canopy. Fit an finish was good and the materials seem durable. So far I am very pleased. Came with two walls, but there were no instructions as to their use. I was able to out them up, and they worked for shade, but they seemed like an afterthought and we're not well integrated.",
      "rating": 4.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Destroyed on first use",
      "text": "I was really excited to try this out because of the reviews. This product was destroyed with one gust of wind.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 5,
      "publication_date": 20180908
    },
    {
      "title": "Broke within 2 months",
      "text": "Liked it for the less than two months before it collapsed with bent frame in light rain. Relatively inexpensive canopy but the frame doesn’t seem durable. Outside of amazon return window so have to email manufacturer, no phone number to contact them.",
      "rating": 1.0,
      "verified": true,
      "author": "Joyce S.",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "product quality",
      "text": "I ordered this tent for a friend based on the product quality, structural integrity and reviews. However, the wheels on the tent bag were broke and I still have not got the bag replaced. I need a replacement asap for my friend that uses this multiple times a week for her kids soccer games. The bag is vital for her to transport it from the car to the field.",
      "rating": 1.0,
      "verified": true,
      "author": "Yvette Hernandez",
      "helpful_votes": 2,
      "publication_date": 20180914
    },
    {
      "title": "Great canopy, no stakes or rope though.",
      "text": "Super easy to put up but no stakes or rope were included as the description says. Searched through all of the packaging but they aren't there and are necessary. Event in a few days, guess I need to buy stakes and rope since I doubt they'd get them to me on time.",
      "rating": 3.0,
      "verified": true,
      "author": "SParfitt13",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Collapsed in the rain.",
      "text": "First time I used it. Started to rain. Top filled with water and it collapsed under the weight.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190628
    },
    {
      "title": "Awesome tent, but beware of the wheels",
      "text": "Easy to pop up and love the versatility of the 2 sides. Provides lots of UVA and UVB protection. Only complaint is the wheels for the bag, too flimsy for tent of this size and weight. On the first movement the wheels didn't roll smoothly and therefore the plastic wheels kind of melted on the drag. Luckily my husband is strong and carried it out to the intended site.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Good value for the money!",
      "text": "I purchased this canopy to go over an outdoor patio set so I wouldn't have to keep adjusting the umbrella! Overall, I was very pleased with the product...it's a decent weight and the included sandbags were a nice feature. The only downside that I've seen so far is a couple of small pinholes where the canopy is stitched. They aren't large enough for drips to be an issue but only time will tell if they will get bigger. Fingers crossed they don't!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Great value",
      "text": "Got this for my son's birthday. He just got a new camper and he loves this! Great quality! I like the fact that he can order the sides when he is ready",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Goes up in 30 seconds",
      "text": "The families on my son’s team loved this canopy — with a person on each corner, it went up in 30 seconds. Came down just as easily, just an extra minute to shove it back into the bag. No pinched fingers. Seemed sturdier than others we saw. We only used it for 3 weekends, so can’t speak to durability yet, but even if this only lasts a few seasons, it’s a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Corinne J. Hogseth",
      "helpful_votes": 3,
      "publication_date": 20190810
    },
    {
      "title": "way easier to set up and has a cool \"raised roof peak\" feature",
      "text": "Recently bought another cheaper canopy and no comparison. This is much heavier duty, way easier to set up and has a cool \"raised roof peak\" feature. It is quite heavy but since the bag has rollers it is easily manageable. Cost more than twice the cheaper one but a far better value.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Reagh",
      "helpful_votes": 3,
      "publication_date": 20170803
    },
    {
      "title": "Amazing, easy to set up and it is clearly ...",
      "text": "Amazing, easy to set up and it is clearly made of better material than all other canopies I see at the tailgate. Its the monster of the area. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "guelmi salgado",
      "helpful_votes": 3,
      "publication_date": 20171022
    },
    {
      "title": "Great quality",
      "text": "This tent is great quality and really durable. My only issue is the frame is quite \"stiff\" when putting the tent up which makes it difficult. I wish it was a little easier. I can not put it up by myself.",
      "rating": 4.0,
      "verified": true,
      "author": "Teri Ket",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "I would recommend",
      "text": "We use this for the pool deck. Easy to take down when we know it’s going to be really windy. We don’t want to take any chances on the canopy blowing off the pool deck. So far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "Jan M",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Sturdy!",
      "text": "Heavy and sturdy frame. Canopy is waterproof. Exactly what I wanted for our small sales booth.",
      "rating": 5.0,
      "verified": true,
      "author": "willvic1979",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Exactly what I wanted",
      "text": "I've had this up in my backyard a few months now. Its exactly what I was looking for. Easy to pop up. The included walls have been really helpful to help block the sun when hanging out under the canopy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Sturdy",
      "text": "Pretty sturdy installed in the summer not too sure how it will hold during colder months",
      "rating": 4.0,
      "verified": true,
      "author": "charleisha cox",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Performing OK So Far.",
      "text": "Only had it a couple weeks. Keeps the rain out, although the material is rather thin, and if I'm not careful, I could easily put a tear in the fabric.",
      "rating": 4.0,
      "verified": true,
      "author": "John R.",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Easy to set up",
      "text": "We used this for help keeping the sun out and it was very helpful for that. Also loks very nice and was eady to put up and take down. The sides that came with were a life saver when the sun would move.",
      "rating": 5.0,
      "verified": true,
      "author": "ladonna wiederholt",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Good quality great price",
      "text": "I’ve taken this canopy camping 3 times. It is really easy to assemble. It takes a little practice to get the canopy up alone but once you get the hang of it, it’s pretty awesome.",
      "rating": 4.0,
      "verified": true,
      "author": "Aileen Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Lasted only a year",
      "text": "This was only used at our pool. We do not have it up during severe weather or any season other than summer. It ripped today being put up.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen S Schaffel",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "ABCCANOPY Canopy Tent 10x10 Pop Up Canopy",
      "text": "Excellent canopy. Easy to erect, take down, and transport. Very effective in blocking sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "HEAVY tent",
      "text": "This tent is sturdy, but it's also VERY HEAVY. I find myself dreading having to use it.",
      "rating": 3.0,
      "verified": true,
      "author": "Karen ",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Good overall Canopy",
      "text": "I decided on the 6x6 canopy. I use it at the beach,It’s good for one or two persons.",
      "rating": 4.0,
      "verified": true,
      "author": "TeeWills",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "No stronger than most other canopies.",
      "text": "This canopy is okay. Doesn't hold up in Gust of wind.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle Christensen",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Great tent",
      "text": "Easy to set up and take down The side walls are great to block the sun and rain",
      "rating": 5.0,
      "verified": true,
      "author": "christine nuccio",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Quality product",
      "text": "Very nice canopy easy setup and seems to be well built",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Brieger",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Tie it to something",
      "text": "The wind even with the stakes carried it over our fense.",
      "rating": 3.0,
      "verified": true,
      "author": "shawn bryant",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Five Stars",
      "text": "heavier duty and went up easily. held up to wind.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171003
    }
  ],
  "product_meta": {
    "title": "ABCCANOPY Canopy Tent 8x8 Pop Up Canopy Outdoor Canopies with Sun Wall Tent Popup Beach Canopy Shade Canopy Tent with Wheeled Carry Bag Bonus 4xWeight Bags,4xRopes&4xStakes,Black",
    "rating": 4.5,
    "feature_bullets": [
      "64SQUARE FEET OF SHADE:8 feet by 8 feet with straight legs and 8'x8' coverage at the top. Commercial pop-up canopy tent provides 64 square feet of shade coverage, big enough for about 3 or 4 people with plenty of room for a table.Suitable for trade shows,business,art shows parties,picnics,camping, sports or any outdoor events.Even ideal for Industrial Industry, OSHA Regulations, Construction, Disaster Relief & More",
      "SET UP IN SECONDS:One or two person can finish it in few minutes. With no tools required. Just take the fully assembled frame with top out of the bag, pull open, place the fabrics over the frame,extend the legs and you are done. Height settings at will - 89.3 inch, 93.7 inch, 97.2 inch, three different height settings allow you to pick the height which you want. Best Thumb latch lock system easy to lock and release.",
      "COMMERCIAL CANOPY FRAME AND CANOPY MATERIAL: Full Truss Structure (1mm thick square shaped legs and super strong cross truss ) is commercial grade, bigger and stronger than the cheaper ones in the market, withstand trong wind. 500 Denier polyester canopy with silver coated PU lining, UPF 50+,black 99.98% UV. Heat sealed seam,latest technology in the industry, prevents water penetrate from seams, 100% waterproof. CPAI-84 fire retardant certificate.",
      "MULTIPLE USE OCCASIONS - Suitable for party, trade shows, outdoor sports, parties, picnics, BBQ,or any outdoor events. It can be used in commercial areas, beaches, playgrounds, yards, gardens, farms and other outdoor occasions, as well as indoor occasions such as large gymnasiums. The 3 canopy sidewalls can be installed or not according to different occasions, convenient and practical.",
      "WHAT IS INCLUDED - Commecial Pop Up Canopy Frame, Canopy Top Cover, 2 Removable Side Walls, Roller Bag,4 Weight Bags, 4 stake and ropes.The upgraded style roller bag is more rugged and durable. Accessories and replacement parts are available for life time."
    ],
    "specifications": {
      "Product Dimensions": "96 x 96 x 117 inches",
      "Item Weight": "35.4 pounds",
      "Manufacturer": "ABCCANOPY",
      "ASIN": "B086GHT7JM",
      "Customer Reviews": "4.5 out of 5 stars101 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#19,499 in Patio, Lawn & Garden"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Canopies",
      "Garden & Outdoor",
      "Patio Furniture & Accessories",
      "Canopies, Gazebos & Pergolas"
    ],
    "price": 129.95
  }
}