{
  "website_summaries": [
    {
      "verdict": "If your cat eats wet food, this is the feeder for you. It even includes cold packs to keep the food fresh.",
      "pros": [
        "Features 5 food compartments, each of which fits 11.5 oz",
        "of wet food",
        "Lid and bowl are  dishwasher safe and removable",
        "Comes with a pair of ice packs to keep food fresh",
        "Digital timer uses 3 AA batteries (not included)",
        "Batteries should last 12 months"
      ],
      "cons": [
        "Lid does not always line up with compartments",
        "Cat may be able to slide the feeder around",
        "If this becomes a problem, try attaching it to a board"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cat proof! Food Obsessive Cat Can't Break In!",
      "text": "Our cat has spent endless hours attempting to break into this feeder and it is just not happening! She would definitely give this feeder a 1 star but her owners are giving it 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn Fuller",
      "helpful_votes": 119,
      "publication_date": 20180622
    },
    {
      "title": "Good product: Not for more than 36 hr of wet food",
      "text": "Overall, this unit is great. Pros: - quiet (very subtle). - easy to setup - long battery life - works for wet and dry food - quality seems good for the price Cons - ice pack does not stay cold long - unit does not retain cold well - dim screen (nit picky) - no ac adapter - wet food: max 36 hrs even w change of ice - extra ice packs are expensive",
      "rating": 3.0,
      "verified": true,
      "author": "Eric J. Stahl",
      "helpful_votes": 104,
      "publication_date": 20180419
    },
    {
      "title": "Bowls don't align with feeder opening...",
      "text": "Anyone else have this issue? When I first set it up, the bowl was correctly aligned on the mechanism. 3 days later, the bowls are now split by the opening (see picture). My cat isn't really sure what to do with this and neither am I. Guess this is getting sent back.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 80,
      "publication_date": 20170520
    },
    {
      "title": "Disappointed unable to Program 3 & 4 setting times.",
      "text": "Box looked used when I took it out of the packing box. Opened it and looked like it was just thrown in a wrinkled bag and used already. Put batteries in and set clock. Tried to program time serrings for feeding but could only program 1 & 2. Cannot set the time for 3 & 4. It goes back to no time saved when finished. Tried everything but still can’t program 3 & 4 times. This is horrible as I am leaving for an 2 day trip tomorrow and need a cat feeder. Extremely disappointed with the product. Also doesn't look like very good quality product material being used. Again very disappointing to recieve a product like this from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Rich P.",
      "helpful_votes": 7,
      "publication_date": 20181220
    },
    {
      "title": "Your cat can break into this feeder",
      "text": "This product is easy to use and is great for a kitty that has to eat multiple small meals a day. But a determined pet can not only pry the top open, but can move the whole feeder around. Tape the bottom to the top so it can't be removed and use double sided tape to attach the feeder to the floor so the animal can't move it around.",
      "rating": 3.0,
      "verified": true,
      "author": "Annette Ritchie",
      "helpful_votes": 11,
      "publication_date": 20181211
    },
    {
      "title": "It's digital!",
      "text": "Works well for my kitten who has to eat 4x per day when we aren't home since we both work. So far, the Ice packs are okay for the hours that we are at work (about 10-11 hours). Cleaning is a breeze since you can just toss it in the upper rack of the dishwasher. The only thing negative, is that the \"Cat Mate\" in red, DOES smear. Kitten hasn't shown any ill effects to the dye.",
      "rating": 4.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 12,
      "publication_date": 20170523
    },
    {
      "title": "Bowl doesn't align",
      "text": "Doesn't work. When it rotates it skips over 3 of the bowls and ends up half way between two. I went out of town and came back to discover that 3 of the bowls were never even exposed to my cat and it awkwardly didn't line up with the bowls. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "kim o.",
      "helpful_votes": 10,
      "publication_date": 20180907
    },
    {
      "title": "My cat loves it. Very handy to have when I am gone all day",
      "text": "My diabetic cat needs to be on a strict feeding schedule and cannot have dry food out to eat at his leisure. In fact, he cannot have dry food at all. This auto feeder can store up to 4 meals for later plus a current meal. It will keep the later meals cool with the included 2 ice packs that go in the bottom of the feeder. Just remember to put them in the freezer the night before. Set up to 4 programmed feedings for later that day, fill each hidden tray with his food (can be canned or dry), place his current meal in the open tray and you're all set.",
      "rating": 5.0,
      "verified": true,
      "author": "GlennMS",
      "helpful_votes": 3,
      "publication_date": 20180903
    },
    {
      "title": "Nice design but electronics are trash!",
      "text": "This item was purchased to feed our cats while we were on vacation. It worked fine during our first trip and were pleased with it. When returned the batteries were removed and stored it in a closet. Four weeks later we were leaving again and took out the feeder to program the feeding times. In was able to set the current time but not the feeding times. After many attempts the display was blank and the feeding times could not be entered. Overall design is great but electronics are garbage. Looks like it is one and done with this piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Harry Schneider",
      "helpful_votes": 5,
      "publication_date": 20190720
    },
    {
      "title": "Buyer beware: NOT ELIGIBLE FOR RETURN",
      "text": "Buyer beware: NOT ELIGIBLE FOR RETURN!! Does not meet my expectations, so imagine my dismay when I try to return it a few days after receiving it only to be denied! It is not written anywhere in the product description that this item is not eligible to be returned!",
      "rating": 1.0,
      "verified": true,
      "author": "A. drake",
      "helpful_votes": 4,
      "publication_date": 20191217
    },
    {
      "title": "Works really great",
      "text": "Works really well, our cat didn't go hungry a weekend trip. I read in a review to freeze the food before you put it in the feeder and it worked out great. For 15 years I would feed our cat at 4AM when I would get up for work but, I'm retired now and like to sleep later. I use it for her morning feeding now.",
      "rating": 5.0,
      "verified": true,
      "author": "Dozier",
      "helpful_votes": 10,
      "publication_date": 20170430
    },
    {
      "title": "What I was looking for",
      "text": "This feeder is easy to set up, easy to use, and easy to clean. It took maybe a few weeks but my cat stopped bugging me for food and now knows that this thing is what feeds her. I haven't gone out of town and used it but it seems reliable. I would probably put fresh batteries in there before I left just in case, but seems to work well and I've had it about 4 months now.",
      "rating": 4.0,
      "verified": true,
      "author": "Sis10",
      "helpful_votes": 2,
      "publication_date": 20200725
    },
    {
      "title": "One of the digital timers did not work",
      "text": "As soon as I received package, I started to program it, but one of the timers was defective so I didn't get to test it. I went ahead and returned it. I'm sticking with a more simpler, manual timer automatic pet feeder.",
      "rating": 1.0,
      "verified": true,
      "author": "Divans",
      "helpful_votes": 4,
      "publication_date": 20190614
    },
    {
      "title": "I can finally sleep in!!",
      "text": "My cat used to wake me up by constant meowing around 5 o'clock in the morning EVERY SINGLE DAY! She's also on wet food only, so I've been struggling to find a way to stop her waking me up. Then I gave this automatic feeder a try, and that's a game changer. At first she tried to scratch the machine to get more food, but the machine hung in there. She now knows her food comes from the machine, who will not give in at all regardless the insensitivity of her meows or her claws. And I can finally sleep in during weekends without worrying her getting starving. I cannot be more satisfying.",
      "rating": 5.0,
      "verified": true,
      "author": "Si",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Works well!",
      "text": "My cat is on a diet and needs to be fed two meals per day-- unfortunately, sometimes its hard to be home within the hour she's planned to eat in the evening. This is a wonderful device and easy to program. My cat was spooked by it for the first two meals, but after that she got used to it. Each slot is numbered 0-4, but unfortunately you cannot see these numbers unless the top is off, so you won't know which slot its currently on unless its completely open. This is my only complaint, but I think this would be easily solved by labeling the inside with each slot's respective number--that way I'll know when I need to refill.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181226
    },
    {
      "title": "Saved my life and my dog's life!",
      "text": "My dog has insulinoma, which is a malignant cancer of the pancreas that causes low blood sugar. She needs to eat every 4 hours or so in order to help control her blood sugar. I am a vet student that is gone 12+ hours a day and can't be home to feed her all the time. This Cat Mate C500 has been a godsend! It is effective, reliable, and easy to use. I wish it had a way to record my voice because it's pretty quiet and my dog doesn't always notice when food comes out, but other than that it is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "xemmradio",
      "helpful_votes": 2,
      "publication_date": 20190503
    },
    {
      "title": "Not suitable for small cat",
      "text": "Ordered this for my small cat for when Im gone for the day and could set up her meals. The product came, looked sturdy and seemed like it would be great for a larger cat. When description said “cat or small dog”, I didn't realize it would be so big. My cat uses a saucer. This feeder sits approximately 3 to 4 inches high. She’d never be able to reach over to eat the food. Disappointed as it’s a great idea. Will be returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Buyer",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Horrible product",
      "text": "I received this yesterday and setup a test feed with 2 settings per instructions, it worked great. When I wanted to add two additional settings it either didn't recognize the 3rd setting or placed them in order of am to pm. I cleared everything out per instruction booklet and started over, same thing. I can get my settings in but once I hit the adj/set button they revert to am settings at 1 & 2 and pm settings at 3 &4. For God's sake, this is a cat feeder and should not be this complicated to set. It's a good concept but it's going back. I'll try another my second choice and hopefully it will be a better one.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great, but quit after 10 months",
      "text": "The Cat Mate worked very well, but when the batteries got low, it stopped working. We of course changed the batteries (tried removing and putting in new ones several times), it would not allow us to program it. The display came on, but no amount of holding and pushing the programming buttons caused anything to happen. I had unfortunately not registered the product, so was not able to take advantage of the 3-year warranty.",
      "rating": 4.0,
      "verified": true,
      "author": "Connie McNeill",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "My cat sit by the machine most all day",
      "text": "My cat has IBS, and I find feeing him every two hours a small amount seems to help. This thing is great and my cat sits by it for hours a day awaiting his food. Its a bit of a pain to set up the times, just alot of button pushing, but once set it works as well as any digital clock. I always add food thats been chilled in the refrigerator overnight along with the ice packs .",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Schmidt",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Works great but not for long term wet food more than 1 day",
      "text": "I wanted to be able to give my older (14yr) cat wet food while I was away for 3-4 days. This really isn't a solution for wet food for 1 wet meal per day because it gets old and moldy after 1.5 days because the ice pack doesn't stay cold (understandably). I didn't think about this logistic before I bought it, but the machine is still useful for one day of wet food and the rest dry food or special treats if you're setting it once daily. I use a bigger automatic feeder for wet food for up to 5 programmable meals a day.",
      "rating": 4.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "It's great!",
      "text": "I had bought a different feeder that didn't work at all. My poor doggo went hungry till we got home. So I decided to try this Cat Mate C500 and it works perfectly. Also since my furbaby only has 9 teeth left after extractions he needs to eat soft canned food. This has the ability to keep the soft food fresh with the ice packs that are placed in the meal feeder. The feeder is easy to set up and can be set in the \"OFF\" mode, without having to remove the batteries, to turn it off until the next time I need to use it. This feeder is great and I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "BWH",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Perfect for my needs. Finally found a reliable pet feeder.",
      "text": "This is the most reliable pet feeder I have ever used. I previously have used the bowls with a wind-up timer and it was horrible, more than half the time they failed to open. I've been using two of these feeders daily for more than 8 months and have only had a problem once: when the cats tried to break into them and misaligned the bowls. I'm regularly away from home for work for 8-12 hours a day and my cats need to be fed about every 3-4 hours, or else they eat too fast and puke. They ice packs keep canned food fresh and the timer is easy to set and very reliable. Extremely happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "SMF",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "An actual life saver",
      "text": "My pitbull needs to take heart medication 3 times a day, which means a dose during the afternoon when I can't be there. With very little effort I trained her to check the Cat Mate for her \"treats\" and now leave it next to her bed during the day. It took a few days but she knows to check it and gets her 2nd pill on time every day. Very easy to assemble and program with clear instructions. Sturdy enough to resist my dog aggressively sniffing & checking it for the treats she can smell in the closed off portions. If it holds up it's more than worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Mythical Wagyu",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "would not dispense feeding correctly",
      "text": "I liked the idea of leaving food for the kitties when away, but the reality was it did not work the three days we tried before our trip. I purchased 2 of the cat mates and set them both up the same way and one of them did provide a scheduled meal for one cat for 4/5 meals, but the other one would not do a scheduled meal within that three day trial. Either it was half way or not a meal at all. Despite the efforts to calibrate the feeding carousel, it would not work. So on my experience, this product could not be trusted to be there for my kitties. Thumbs down.",
      "rating": 1.0,
      "verified": true,
      "author": "sandy",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "It works!",
      "text": "My cats haven't figured out how to open it, and I've had it for about 6 months now. Sometimes the containers get misaligned with the opening for some reason, but we just adjust the clock again and it goes back to normal. This has happened like twice since we go them. They never failed us, the cats always get their food on time and no more cat crying for food at 5am, yay!",
      "rating": 4.0,
      "verified": true,
      "author": "Cyn",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Just as described",
      "text": "Easy to set up. Works exactly as described. You pop the top off, put the ice packs in, line up the zero on the tray with zero on the base. Program the times you want the opening to move (I found this pretty obvious with the few buttons available) and there you go. The opening moves over the next \"dish\" at the appointed time revealing the food. Cats figured this out with no training.",
      "rating": 5.0,
      "verified": true,
      "author": "Blue Gal",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Perfect for a diabetic cat",
      "text": "This makes the task of feeding a brittle diabetic cat much, much easier. I wash the removable rotating tray and add five portions every morning and, for the most part, relax the rest of the day. My cat shouldn’t be eating dry food (yes, I had an automated dispenser for dry food when she was young) so this has been a godsend. It is reliable, easy to clean, and is well made. Only one recommendation: Order another set of freezer containers so that one can be in use and the second ready for replacement the next morning.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Awesome product",
      "text": "Awesome product to feed my cats their medicated wet food. We were worried about not being able to ever go away for even a night because our cats are now on medicated wet food. This product allows us to have piece of mind when we leave for a short amount of time. It also allows us to leave for a longer time and not have to have somebody come twice a day to feed the cats. It was super easy to program and also easy to clean. I would recommend buying extra ice packs so that you can replace used ones with already frozen ones. I would recommend to anybody!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen and John Philipson",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Works wonderful I had purchased a different kind a few years ...",
      "text": "Works wonderful I had purchased a different kind a few years ago but it was very difficult to program plus the cat was able to open the trays ahead of time. This one so easy to program and cat can’t cheat. One thing I wish it did was make a noise to let the cat know food was ready. Maybe a ding or something similar.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Graves",
      "helpful_votes": 2,
      "publication_date": 20180802
    },
    {
      "title": "Your cat can smell the food",
      "text": "My cat can smell the food in the tray and it drives him crazy. Still necessary if we're not going to be home for his dinner time, but I try not to have to use it. This applies if your cat is 1) a crazed food addict 2) absolutely must eat on time without delay 3) wants you to feed him all the time 4) is unrelenting until food is presented. This may be better for a cat that's a normal eater and not one that turns into a monster until you give him what he wants.",
      "rating": 4.0,
      "verified": true,
      "author": "doylecat",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Great idea for few days of feedings",
      "text": "This machine definitely saved me a few weekend trips leaving the kitties home alone or with limited supervision. You are able to assign feedings based on time during the day. My cats eat both dry food and canned food. This machine is for the wet canned food. It has freezer ice packs to keep food cool for a few days.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Very Loud, Very Effective",
      "text": "This thing is SO LOUD. My other cat has a microchip feeding bowl (the SureFeeder) and this thing is easily 10x louder. Luckily my cats are only 1 year old so they're still curious about everything and adapt to changes and respond to training really well. However for older cats or skiddish cats, this bowl would likely freak them out. My Stella has learned to love the sound it makes and runs over to the bowl so fast! But she was hesitant the first time it made a noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Our Cats are Happy so We're Happy with this Feeder",
      "text": "No complaints so far. Feeder has worked flawlessly. We got tired of our little guys waking us up in the middle of the night crying for food. I'm a light sleeper so it was a real problem. As you know, cats want what they want when they want it so once the begging starts, it won't end until they win. This little food robot has taken care of that issue. Now everyone's happy. Glad we bought the CatMate.",
      "rating": 5.0,
      "verified": true,
      "author": "DLev",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Perfect solution for our kitty with IBD.",
      "text": "Our Maine Coon kitty has inflammatory bowel disease. Part of his treatment plan is to eat small portions multiple times a day. Both my husband and I work full time, so we needed a solution during the day when we weren't home to feed him. This feeder is simple in all the right ways. Easy to use, easy to clean. I set it up to feed him every 2 hours and don't have to worry about him being hungry while we're at work. I might buy another one to use during the night, maybe then I won't have a meowing 5am alarm clock every day!",
      "rating": 5.0,
      "verified": true,
      "author": "beelee23",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Ease and reliability",
      "text": "I am just beginning to use this product I’ve been looking for a while for something that was not over $60 just to feed my cat? The greatest thing about it is it has enough for five days and ice tray which can be used to keep the food fresh and we used over and over. It’s clean and simple let’s see if it opens and she eats it the water is easier to maintain CAT scan actual a lot longer without food and water but it’s a great project",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Thurlow",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Quiet almost too quiet. Cats gave up trying to break into them",
      "text": "We bought 2 of these to avoid the 1-2 am bothers and feeding while we are at work. The only problem is they are so quiet we have to buy an alarm clock to insure one pet doesn't clean out both feeders. Now shopping for a quieter alarm clock but, that is different. Big worry was a cat breaking into the wheel. It appears there were 3 strong attempts judging by morning locations of the feeders. Now, though they do tend to sleep in the room with the feeders.",
      "rating": 5.0,
      "verified": true,
      "author": "HospitalWorker",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Did not work properly",
      "text": "I went away on vacation for three days, and set this up for 2 feedings a day for my cat. Good thing I also left dry food out. This machine worked perfectly when I tested it, but failed when I went away. It only worked for the first day and a half. Unfortunately, I had to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "SophiaV",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "My cat likes it",
      "text": "My cat likes it a lot. And despite being pretty food motivated he has not ever broken it open. The cooling packs are a nice touch. The way it works is you can set times that you want it to rotate to a new food slot. So if you just enter one feeding time, say 11 AM it will rotate every day at 11 AM. You can enter multiple feeding times, say 5 AM if your cat wakes you up, and 11 AM for when you are at work. The bowls could be bigger to prevent whisker irritation but overall is a good solution for occasional short vacations or supplemental for pet sitters.",
      "rating": 5.0,
      "verified": true,
      "author": "B Wright",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Easy setup.",
      "text": "Works very well. we had to leave the cat alone for 3 days. in addition to freezing the food everything was still cool. Easy setup.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Dorsey",
      "helpful_votes": 4,
      "publication_date": 20180324
    },
    {
      "title": "Digital setting ability is nice. A bit noisy when my cat would lick ...",
      "text": "Worked for just shy of a month. When it began malfunctioning, it would spin and spin for over a minute and stop on a compartment with no food in it. Digital setting ability is nice. A bit noisy when my cat would lick the side of the compartment. Ice packs were nice and big. Not buying again but buying same manufacturer with different model. Hope that one works.",
      "rating": 2.0,
      "verified": true,
      "author": "clorice",
      "helpful_votes": 8,
      "publication_date": 20170603
    },
    {
      "title": "like having a baby sitter",
      "text": "have had this for a few months. works like a charm. our cat had to get use to it. he moved it around...pawed at it etc and we had to get creative on keeping it still/in one place, as he could move it...now he ignores it until it goes off with a timer sound. has given us some flexibility with feeding. ice packs are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "It's awesome!  Though I wish it had a quiet ding for the cat to alert them",
      "text": "My cat LOVES wet food. I LOVED the ice pack feature! They only stay cold up to 8 hourish so I would use this mainly at night so my cat wouldn't wake me up. I probably would've just been fine with the 3 compartment one since I just leave a small amount of dry food out to nibble when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly H.",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Easy to open",
      "text": "This feeder is wonderful, does everything advertised. I've rated this low because cats have no problem figuring out how to open this so I have to buy a different more secure one.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathon L. Erickson",
      "helpful_votes": 3,
      "publication_date": 20200502
    },
    {
      "title": "Mixed review",
      "text": "Cat Mate is better for a well-behaved kitty. I have a young cat who smelled the food in the other compartments, trying to drag the Cat Mat around the kitchen! He tried to scratch the device to open the closed lids. The other cat, who is a picky and slow eater, didn't even care that there was food there... The device is easy to operate and clean, which are pluses.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam A.",
      "helpful_votes": 4,
      "publication_date": 20181112
    },
    {
      "title": "Just what we needed to help our cat eat when we are away.",
      "text": "Holds and delivers up to 5 feedings. Makes us able to leave the house for extended periods of time without our cat either starving or gorging herself. Put her on a diet of smaller portions more frequently and it is helping her lose weight and be more energetic. Easy to program and load. Cat thought it was weird at first, but now she hears the motor turning the trays (not loud) and runs to eat. No more cat in the face upon waking! Purchsed a swcond one and did creative scheduling and was able to have an extended weekend without her starving. Yay! Runs o. 3 AA batteries. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd M.",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Three out of Three did not work",
      "text": "These feeders seemed easy enough to set up and manage. I followed the directions, exactly. Time was set. Meal times set and it was ready to go. At the first meal setting I heard the motor click, but not one of them rotated. It activated on time. But, that's it. I reset everything and tried again. Same behavior. The motor would click but the dish never rotated. I had ordered 3 and all 3 were defective.",
      "rating": 1.0,
      "verified": true,
      "author": "Solitary Dancer",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Can't set feeder for longer than 24 hours",
      "text": "I don't usually leave my cat for more than a day without company, but when I do, I like being able to leave him food. This feeder can only be set for one 24-hour period, a fact that is not indicated anywhere in the product manual or marketing material. I don't want to have to reset my cat's feeder every day, that defeats the whole point of having an automated feeder. This was definitely not worth $50. I could have gotten a two-slot feeder for half the price. I'll be returning this.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Review #2 UPDATE",
      "text": "I bought this back in April as a solution to Being able to sleep in as I needed . My cats constantly wake me up to early to eat . This feeder is the best!! I'm still sleeping! NO cats on my pillow or on top of the bed staring or crying scratching the blankets or rattling things in the bedrooom . It has really changed my life. I know that sounds dramatic but really my husband gets the extra sleep he needs on the weekends. We start our mornings on our schedule. I still give 5 stars. !",
      "rating": 5.0,
      "verified": true,
      "author": "LW",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Perfect for cats that wake you up for food",
      "text": "Our cat learned to wake us up to get fed, but this thing saved our lives. We set it up to dispense at 7am and 6pm and within a week the cat learned that the robot was doing the feeding and stopped bothering us entirely. Despite all of his efforts, the cat has not been able to open it, either. I keep a spare couple of ice packs in the freezer so that when I replace the food, I also replace the ice packs.",
      "rating": 5.0,
      "verified": true,
      "author": "Zeke",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Worth Every Penny!",
      "text": "Love it! It works great! Very easy to set the clock and the feeding times! The only one that I found that runs on AA batteries! I have had it now for 5 months and it is still going strong on the same batteries! I love everything about it! Best product I have ever bought! My cat's love it too! when they hear the motor, they both come running!",
      "rating": 5.0,
      "verified": true,
      "author": "h",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Great product for just 1 🐈 as only feeds/opens for 1 feeding.",
      "text": "Love, love, love this product. I don't have to worry about someone feeding my kitty when I get detained at.work. Only draw back is I feed kitty moist food in it and use the ice packs but they are only good for 12 hours. Wished they could last a little longer.",
      "rating": 5.0,
      "verified": true,
      "author": "grace myers",
      "helpful_votes": 2,
      "publication_date": 20200330
    },
    {
      "title": "This feeder is a life saver!",
      "text": "This is my second feeder of this same model (now I have one for each cat). They are great for setting the feeder so I can sleep late or have to be away from home during their feeding time. This is the *only* pet feeder I found that was battery operated *and* had ice packs for keeping wet food chilled so it won’t spoil. I have a very irregular work schedule so I can’t always be home to feed the cat at the same time each day. This has really been a life saver!",
      "rating": 5.0,
      "verified": true,
      "author": "Birdie",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Works great, I have no complaints!",
      "text": "This was very simple to set up and easy to clean, the ice packs are a great touch, they really keep the food fresh for evening feeding. I bought this so my pet sitter would only have to come see my cat once a day as opposed to twice a day (Because my cat is toothless and can only eat wet food.) whilst I was away and it worked great. Since getting back from vacation I still use it for evenings I’ll be out late or mornings I want to sleep in, it keeps my cat on her schedule which is important to me. Over all a great product, I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Easy to use, good construction",
      "text": "The product is simple to use and easy to clean. I wish that it made more sound when changing trays. The cold trays are too small for multiple days, but that may not be an issue for most people. I don't want to use it with wet food for more than a 40 hour trip, but it's perfect for delaying the need for the cat sitter. We have two cats, so I don't know if they are sharing or not; it's not a perfect solution for multiple pets.",
      "rating": 5.0,
      "verified": true,
      "author": "Tacomaguy",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Serves its purpose.",
      "text": "Exactly as described. The adjust/set button was a little finicky but got it to work eventually. I like that the food tray can be readjusted if it becomes misaligned. I wish the feeder either came with an extra set of ice packs or had extra available. I’ve checked everywhere and couldn’t find them anywhere except in the UK where they’re out of stock. Makes a small humming/whirring noise when the tray is moving but not as loud as other feeders I’ve seen. Cheaper than similar products I could find.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180722
    },
    {
      "title": "Brilliant!",
      "text": "So easy to use and clean. If the bowls don't align you can press the adjust button and the up arrow at the same time. That will align the bowls for you. Goes into the dishwasher. Finally a good wet food feeder. Although it would work for dry food too. I wasn't sure if my cat would use it at first, but she likes it too. It's very quiet, but she can hear it, and she knows it's meal time.",
      "rating": 5.0,
      "verified": true,
      "author": "yoga_mama",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "This is a great feeder. Gives me comfort knowing my cat will ...",
      "text": "This is a great feeder. Gives me comfort knowing my cat will be fed if I can't make it home in time. The first couple of days it kind of bothered the cat, but I use it every day now and he is fine. He makes less of a mess when he eats from it than when he had regular bowls too! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Music Maven",
      "helpful_votes": 3,
      "publication_date": 20180324
    },
    {
      "title": "Easy to use and program! Well made!",
      "text": "Awesome product. Easy to use and program. We have a 17 year old chihuahua who does best on 4 small meals a day. Tips: if feeding canned: you can refrigerate or even freeze the food tray with the portions until you’re ready to leave or set it up for the day. By the time the meal is served, the portion will have defrosted and be fresh. The unit comes with two ice packs. We love this system and our little guy is so happy to have his tiny meals on a schedule.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari JoTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Great for up to 4 Timed Meals",
      "text": "The other reviews were very helpful. We have a 2 slot timer from Cat Mate that we have used for years but wanted one that would hold more meals. The C500 is easy to set up and holds 4 timed meals. We just put our cat's first meal before we were leaving in the extra uncovered slot (slot 0) to get her used to eating out of a different feeder. There is a small noise when the feeder rotates to the next slot but it did not seem to bother our cat.",
      "rating": 5.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Good for hard food/kibble, not ideal for wet foods.",
      "text": "Overall, it’s a nice auto feeder. Pretty easy to set the time and intervals of feeding. Gently push the lid sides on the tabs to open and clean. The dish that holds the food comes right out and can be hand washed. The only thing I felt was a bit dishonest is the time it says it will keep food cold. At regular room temps, it only stayed cold for about 3 hours. I wouldn’t rely on this being the only means to give your pet fresh wet food while you’re away as it’s not sealed and will get warm fast so the food will spoil.",
      "rating": 4.0,
      "verified": true,
      "author": "Douglas Dlutz",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Flimsy, will not keep a food obsessed pet out.",
      "text": "First of all, this thing is flimsy. If your pet has any sort of food obsession, breaking into it is a matter of when, not if. My 8 pound cat got the lid off and practically ripped it in half the first night. On top of that, it failed to rotate twice in the first 48 hours. I'm angry that I paid so much for this hunk of junk, but it could be that my cat is just a gremlin and broke it.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarina",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Absolutely Pissed at this product DO NOT BUY",
      "text": "This product is terrible. They make you think it's a 4 feeder machine. This machine is only set for ONE DAY. You cannot use it for multiple days. It only allows you to set times for 24 hours. WHO FEEDS THEIR CAT 4 TIMES A DAY?!?! Now I cant return the product and I'm stuck with this trash. My cat eats 5am and 5pm everyday. So it looks like you could use this to be gone for a weekend right? Wrong! Unless you feed your cat 4 times a day and dont plan on leaving for longer than 24 hours DO NOT BUY THIS!",
      "rating": 1.0,
      "verified": true,
      "author": "Cole Grau",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "I mostly am happy with the product",
      "text": "I've been using this product for about 3 months. I really like it. I use one for my cat and one for my dog. But only for a small animals. 2 improvements : 1) an alert when it needs to be refilled, and 2) an easier way to reset the timer. 1) it's a pain to remember when to refill the feeders, and the animals may skip a feeding. 2) I'm probably technology lame, but resetting the feeding time takes me about 5 minutes, every time.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan B.",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Best for dry food and very easy to program",
      "text": "My cat is a free feeder of dry food. We bought this to feed him wet food once a day while on vacation; however, I found out that opened wet food shouldn’t be left out for more than 20 minutes. My bad. 😐 The ice pack keeps a daily serving from spoiling, but not more than that. It works perfectly for feeding dry food up to 5 servings. It’s very easy to program. You will need to provide your own batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Colorado USA",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Perfect for time away",
      "text": "This pet feeder has worked great for days when I can't be here or her late night feeding. She is a \"grazer\" so likes to eat multiple meals through out the day. And when I can't be here all day, I can still have fresh, wet food available for her during the day. I actually use it for her late night feeding then have the timer set for shortly after midnight so she isn't eating all night and is hungry in the morning. The timer is great so one can use it for multiple uses and for what works for you and your pet.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Nelson",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Good for travel",
      "text": "I’ve used the automatic feeder several times when I was traveling for a few days. It’s easy to set up and use. I feed my cat twice a day so it’s good for a 3 day trip. I freeze the two servings of the canned food ahead of time and serve one cold serving the first meal with the two frozen meals for the next two meals on ice packs. I put them on top of dry food since my kitty likes both. The last servings are just dry food as I don’t want to risk food poisoning. She used it right away so it worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Estar ",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Failed after less than 6 months",
      "text": "This feeder stopped working after less than 6 months. The feeder was only set to two times - 8am, 8pm. According to the manual, it should rotate every day at 8am ad 8pm. However, I went out of town for 2 days and the feeder only turned once. This feeder is unfortunately unreliable.",
      "rating": 1.0,
      "verified": true,
      "author": "Randi",
      "helpful_votes": 2,
      "publication_date": 20190102
    },
    {
      "title": "Great buy for the kitty!!",
      "text": "Wow this little guy is a winner for Cj the cat, which is the best Lil buddy anyone could have. My car knows when he is getting feed without having to get out of bed to feed him. He darts to the bowl as soon as it starts it’s turn. Comes with a ice pack to keep the food cool all night. Highly recommend this if you want your kitty feed on a schedule.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay J.",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Awesome",
      "text": "Awesome, easy to use when we are gone from the house for a couple of days. If I need to feed the cat once a day for 5 days I freeze the last 3 days worth of food in the tray. Having the food cold and using the ice packs seems to work really well.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Prevents early morning cat screams",
      "text": "My large flame point cat is an early riser, so this is the solution to his breakfast woes. It keeps good time and performs as advertised. Cleaning the rotating tray is a bit of a nuisance as food bits get stuck in the corners. If you have it apart at one of the scheduled times, the motor will run for a long time and definitely end up out of alignment. Fortunately the realignment process is easy and well described in the manual.",
      "rating": 5.0,
      "verified": true,
      "author": "D. English",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "This thing is great",
      "text": "My cat loves this thing, first he jumped about 3 feet high when the motor comes on (it is noisy, and I am not sure how reliable yet) but he got used to it in no time and loves it. If you want to feed your cat small amounts throughout the night, this thing is excellent. Programming is a snap too. The cooling pads work for wet food, but for dry food it condenses water underneath which makes it soggy, I put small (don't let them stick out) pieces of paper towel under the dry food and that keeps it dry. Overall, great product, great price, I could not be happier with it.",
      "rating": 5.0,
      "verified": true,
      "author": "GrayCroMagnon1963",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "It's great!",
      "text": "We really like the Catmate. We had problems with one of our cats being anxious about food and feeding 5 times a day has really helped curb anxiety about getting food. We have had the Catmate for about 4 months and have had no problems with how it operates. We are feeding the cats less to help them lose weight and feeding 5 times a day with the same amount as 2 times a day helps them eat less but get fed at 5 intervals instead of 2 so instead of gorging twice a day and then being hungry until the next feeding, they are eating less but at more intervals and seem more satisfied. It works for us!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas A. Jones",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Works well, but not great for cats sensitive to plastic.",
      "text": "Works really well; user friendly; easy to clean. It's a great solution for my cat who needs to eat small meals several times a day. The problem: the plastic is irritating to her mouth and chin. My vet says this is a common problem and that cats should eat from a metal dish if possible.",
      "rating": 3.0,
      "verified": true,
      "author": "Lindberg",
      "helpful_votes": 5,
      "publication_date": 20180616
    },
    {
      "title": "So far, so good!",
      "text": "This was pretty easy to set up even for a tech idiot like me. So far it works well. The ice packs provided probably work well for about half to three quarters of a day so I ended up buying an extra pack so I can freeze one set while the other is being used. Super easy to clean, I just put the tray in the dishwasher. So far it's doing great!",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great simple feeder",
      "text": "I really like how simple it was to program. The motor is really quiet. it doesn't scare my cat. It took her about 2 weeks for her to get used to it but now i don't get woken up at the crack of dawn for food and its amazing!",
      "rating": 4.0,
      "verified": true,
      "author": "S.Val",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Robot parents",
      "text": "Works great for programming one meal at a time but more that one and it won't line up with the top when it rotates. The ice packs work great for the wet food we feed our cat. These work great if you don't want to buy the replacement ice packs:",
      "rating": 4.0,
      "verified": true,
      "author": "JGiraffe",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Works well for my cat, battery life is excellent so far!",
      "text": "I bought this product for my cat to ensure timely feedings daily. I've had it for nearly two months, and so far, it works great! I haven't had any trouble with battery life so far, and the clock has stayed accurate. The only reason I took off a star is that I use the feeder daily, and it's ideal to use both ice packs. It's SO hard to find replacement ice packs so that I can use both regularly--right now I just use one at a time, and it seems to work ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Game changer",
      "text": "It is surprisingly difficult to find a good wet food feeder, and this one is fantastic. I work long and sometimes unexpected hours, so I love knowing I can set this up in the morning and the kitties are good for the rest of the day. And, most importantly, I don’t have to sacrifice their health by putting them on dry food. I recommend getting a second set of ice packs so you always have a pair ready to go in the AM.",
      "rating": 5.0,
      "verified": true,
      "author": "Calli",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Durable, quiet and reliable",
      "text": "We only use this feeder occasionally for our 5 lb Yorkie when we have to leave the house for more than a couple of hours. It works great! Easy set up. Very durable (she has tried plenty of times to break into it, so we place feeder inside a box lid so she can't flip feeder upside down). The feeder remains quiet until the time for a food slot to turn and open, so no annoying ticking sound. Keeps her entertained periodically with a treat when it opens, to help pass the time. Easy to clean. We just pop the batteries out when not in use for ultra-long battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Awesome product!",
      "text": "I just love these! I have difficult hours for work and this allows need to keep my cat's happy while I am away. The ice packs keep it pretty cold throughout the day I've never left it longer than 10 hours so I'm not sure how much longer they would last but they always seem cold to the touch when I take them out to refreeze them",
      "rating": 5.0,
      "verified": true,
      "author": "angela",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Pointless product.",
      "text": "Waste of time. Yes it will feed 5 portions of cat food. They don't tell you all in 24hrs or that the first is exposed from the start. Returning both units.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Collins",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Worked great!",
      "text": "I went away for a few days and did not want to just leave out bowls of food, so I thought I would give this a try. I set it up before we left, so the cat could get used to it. He did within an hour. When we came back from the trip, the compartments were all emptied, and the cat was well fed and happy. So glad I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Irish711",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Amazing",
      "text": "Our cat used to wake us up all throughout the night for food. From 1am-5am. We’ve been using this for about 6 months and it’s saved us. We have it set to feed 3 times overnight with wet food. The ice packs work overnight and are still cool in the afternoon. This works and it is amazing how the cat now looks to the feeder instead of us for food. She doesn’t meow or whine at the feeder. When the time gets close she knows and waits for the feeder to rotate.",
      "rating": 5.0,
      "verified": true,
      "author": "Florecita23",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Cat Mate C500",
      "text": "Just received this week, so my cat is still adjusting to this product. Easy to set up and seems to be working as promised. Extra ice packs and extra feeding trays specifically for this unit are not available thru Amazon and are very expensive thru the manufacturer due to shipping costs added to the price. Hopefully those items will be featured on Amazon sometime soon.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Almost TOO cold!",
      "text": "I used just one of the cold packs overnight (8-9 hrs), and the pack was still very cold and the wet food was still so cold that my cat wouldn't eat it. Then I used a can of wet food that had been in the fridge all day for overnight (8 - 9 hrs--no cold pack)...not AS cold but still cold. Kept trying...found that if refrigerated wet food has about 12 hrs out of the fridge before the cats eat, it is merely cool. Apparently this feeder is extremely insulated. I read that cats like their food to be more like their own body temp.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Exactly as described, good buy",
      "text": "Exactly as advertised, works like a charm. Instructions seem complicated at first but when you get the gist of it, the product itself is incredibly easy to use. My cat had no terrible adjusting to it and I feel much better leaving it alone for a couple of days knowing it will get regular feedings.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Thompson",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "I use it for my Labrador",
      "text": "Yes it says cats and small dogs, but I use this for my 90 pound Labrador. Each section holds a cup of dry food. This allows me to know my teenaged son isn’t giving him too much food when I’m at work. For longer work trips I have 2 set up to alternate feedings so that my dog walkers can stagger their arrival times. Works well. Easy to wash. Easy to set timers.",
      "rating": 5.0,
      "verified": true,
      "author": "S313",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Very Good",
      "text": "My cat scratched this feeder and dragged it around somehow when I left her alone with it for a couple of days for the first time. But she couldn't crack it open. Now she learned how it works, she's being patient and stopped damaging it. Feeder is easy to clean and it saves the setting while I change the batteries. Can't thank this thing enough for my quiet morning! No idea how I lived before without it",
      "rating": 5.0,
      "verified": true,
      "author": "Nadia",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Sleep in - let this awesome feeder feed your cat instead",
      "text": "My cat has no teeth. Which means I can’t leave dry food out for him. He demands food at 4:30am every morning and well, I want to snooze for longer than that. This cat feeder was recommended to me and it has changed the game! It’s easy to use, reliable and keeps my cat fed at the times he needs instead of when I can make myself available. I just love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Dempsey",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Only worked one time",
      "text": "The first time we used the feeder, it worked fine. When we tried to use it a second time, about two months later, the system refused to allow a PM feeding before an AM feeding. The display would flash and then reorder the feedings with AM first. This was a problem since our cat's first feeding needed to be in the evening. We had to load up her dry food bowl so she had enough to eat while we were gone.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Williams",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "works very well and stays chilled overnight",
      "text": "this is a lifesaver. my elder cat requires multiple short small feedings due to IBS, including overnight. now we can leave the house for a few hours and know she won't miss a meal. also enable us to get a better night's sleep as she requires snacks in the wee hrs of the morning.",
      "rating": 5.0,
      "verified": true,
      "author": "chakeetah",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "We can leave the house and my wife doesn’t worry about the cats",
      "text": "It works as described in the details. You have to take it apart to clean, but that’s really pretty easy and so no big deal. The best part of this is that we can leave the house for the weekend and my wife doesn’t worry about the cats. We purchased two, one for each cat.",
      "rating": 4.0,
      "verified": true,
      "author": "fkey541",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Doesnt works even when directions followed and tested.",
      "text": "Just got back from being gone for two days to find out the brand new feeder with brand new batteries didnt work. I tested it before we left and it turned but when we got back it hadn't turned again the entire time and the programming shows a different time with no meals programmed. Extremely unimpressed with this crap product. thanks for starving my cat.",
      "rating": 1.0,
      "verified": true,
      "author": "Michele M.",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Works but didn’t find very useful",
      "text": "It works but food only stays cold for a day so not sure it’s useful unless you really need to feed at a very specific time within 24 hours, like if your cat is waking you up in the middle of the night to be fe. Maybe then it would be useful? It works though!",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Not for the food-obsessed cats",
      "text": "Not for the food-obsessed cats. My cat figured out how to break into the feeder right away by pushing the tray and rotating the dish to get his food. It’s also light enough that he can flip it around and get food out that way. If we go away for multiple days, he eats all of his food on day one and is left hungry for the remaining days. Will need to get something better designed which he cannot break into.",
      "rating": 1.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Works great!",
      "text": "I refrigerate the soft food before putting it in and it works like a charm. Perfect for weekend getaways with really only 4 meals since the 5th is uncovered to start with.",
      "rating": 5.0,
      "verified": true,
      "author": "Morriah M.",
      "helpful_votes": 2,
      "publication_date": 20191015
    },
    {
      "title": "Good quality",
      "text": "Easy to use, easy to clean. I would love it more if it had separate daily dishes because then I don't have to clean the whole thing for short days/trips. It does keep the food cool due to the ice. I really have no complaints just a wish for single dishes. :)",
      "rating": 4.0,
      "verified": true,
      "author": "K433Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Feeder enables weight loss, thru scheduled meal times.",
      "text": "The Cat Mate Feeder is great. It's very easy to set the time for either 12 hours or 24 hours, for 4 timed food slots per day, and 1 open slot. In conjunction with your Vet, follow Recommended Daily Allowance for age and food. Then, measure Daily Amount across the number the feedings for that day. At the end of the day, RE-MEASURE THE REMAINING FOOD TO DETERMINE IF THE CAT IS EATING AT THE MAXIMUM OF THE RECOMMENDED DAILY AMOUNT, OR LESS THAN MAX TO TELL IF CAT IS EATING LESS THAN DAILY AMOUNT FOR FUTURE WEIGHT LOSS.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "A wonderful addition to our modern lifestyle",
      "text": "Our two cats eat half servings of dry kibble twice each morning and evening, and they are now well habituated to using these feeders. Cats who are whisker sensitive would have troubles with the size of the opening, though. The feeders work well with rechargeable batteries, and the weight of the cold packs (we don't feed wet food) keeps them stable.",
      "rating": 5.0,
      "verified": true,
      "author": "LSM",
      "helpful_votes": 0,
      "publication_date": 20200103
    }
  ],
  "product_meta": {
    "title": "Cat Mate C500 Automatic Pet Feeder with Digital Timer for Cats and Small Dogs",
    "description": "The Cat Mate C500 Automatic Pet Feeder with Digital Timer will serve up to five meals, one initial feed and four further timed feeds while you are away - during the day, evening or over the weekend. Suitable for feeding both wet and dry foods, the included ice packs and close fitting lid help keep food fresh. Just program the easy to use digital timer to the required meals. Once set, all programmed feed times are visible on the LCD display. The Cat Mate C500 requires 3 x AA batteries (not supplied) which will give approximately 12 months operation. The five large food compartments each hold 11. 5 ounces of wet food - one meal enough for two cats or a small dog. Maintenance is simple, both the lid and bowl are dishwasher safe. The Cat Mate C500 is designed to be tamper resistant to pets, the feeder can also be attached to a board (not supplied) to prevent it from being overturned or moved. The Cat Mate C500 Automatic Pet Feeder with Digital Timer comes with a three year manufacturer's .\n\nFROM THE MANUFACTURER\nThe Cat Mate C500 will serve up to 5 meals, one initial feed and four times feeds when you are away - during the day, evening or over the weekend. Suitable for feeding both wet and dry foods, the twin ice packs and close fitting lid help keep food fresh. Just program the easy to use digital timer to the required meal times. Once set, all programmed feeds are visible on the LCD display.",
    "rating": 4.4,
    "feature_bullets": [
      "Material-Plastic. Five food compartments will serve up to five meals, one initial feed and four further timed feeds while you are away. Each holds 11. 5 ounces wet food.",
      "removable, easy-to-clean cover and bowl (also dishwasher-safe)",
      "battery status indicator. Two cooling ice packs and one close-fitting cover keep the feed fresh",
      "uses 3 x AA batteries (not included)",
      "3 year"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "12.2 x 11.89 x 3.7 inches; 14.82 Ounces",
      "Item model number": "C500",
      "Batteries": "3 AA batteries required.",
      "Date First Available": "January 19, 2017",
      "Manufacturer": "Ani Mate",
      "ASIN": "B01AUYLVU8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Automatic Feeders",
      "Pet Supplies",
      "Feeding & Watering Supplies",
      "Cats"
    ],
    "price": 49.95
  }
}