{
  "website_summaries": [
    {
      "verdict": "A natural formula that emulates a more natural carnivore diet for your dog that’s packed with meaty protein blends like lamb, venison, and salmon.",
      "pros": [
        "Deboned lamb is the first ingredient, high levels of omega fatty acids and glucosamine for joint, skin, and coat health",
        "Several recipes available",
        "Cooked in the USA"
      ],
      "cons": [
        "The most expensive dog food available from Merrick"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good stuff BUT.......",
      "text": "My dog loves it BUT I'll be switching to another brand. I found out Purina bought them. Don't trust Purina to keep their hands off the ingredients used by Merrick. I'll go with a smaller company that uses only US sourced ingredients. Tired of the monopolies created by these giant companies swallowing up the smaller competition.",
      "rating": 4.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 53,
      "publication_date": 20170128
    },
    {
      "title": "... on this dog food knowing that my pups would love the freeze dried meat bits in it",
      "text": "I spent extra money on this dog food knowing that my pups would love the freeze dried meat bits in it. Well, there was not a single meat bit in the bag (I shook it, stirred it.. searching). Very annoyed that I wasted money on this more expensive food. I normally buy the Merrick limited ingredient food for my dogs, but bought this Backcountry for them to try. If they loved it, I was going to slowly transition them to this food. WILL NOT BUY AGAIN",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa S.",
      "helpful_votes": 13,
      "publication_date": 20170303
    },
    {
      "title": "Where did the freeze dried raw pieces go?",
      "text": "I have been feeding my dog's this for a while. They seem to love it. The last bag that I got, I opened today and there were zero freeze dried raw pieces. Unfortunately, my older dog is a little picky. He refuses to eat the food unless it has the good bits in it I guess. So, that was a wasted $65. Big bummer.",
      "rating": 1.0,
      "verified": true,
      "author": "Dominique",
      "helpful_votes": 7,
      "publication_date": 20170309
    },
    {
      "title": "WARNING, this is a PURINA product!",
      "text": "Used to be great, but the company have sold out to / been bought by PURINA, so who knows what kind of poison they will start putting in the mix. A sad day, indeed...",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Twain",
      "helpful_votes": 5,
      "publication_date": 20180616
    },
    {
      "title": "Topper , no longer needed !",
      "text": "My rescue has food allergies .I've tried several limited ingredient , grain free type feed , Blue Basic , Wellness , etc . Have had to add wet food , or she wouldn't eat it .She loves this food ! Of course she eats the meat chunks first , but she also eats the kibble w/out any topper .Being a veteran myself , the Heroes Banquet is an added plus ! Made in USA is also important to me .",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 5,
      "publication_date": 20170808
    },
    {
      "title": "They're selling counterfeits",
      "text": "They are sellingh a counterfeit product. I recently had noticed the freeze dried pieces were darker brown, bigger and more cubed. At first i thought it was just a change of recipe, but have recently bought one from pet co. The freeze dried pieces are still the same they always used to be.",
      "rating": 1.0,
      "verified": true,
      "author": "Edwin",
      "helpful_votes": 2,
      "publication_date": 20200116
    },
    {
      "title": "Great food, bad bad bad delivery service",
      "text": "My dog loves the food, it's a bit pricey. But the delivery of this food even by reoccurring delivery was always delayed, never on time, and never when I needed it. 22lbs for a German Sheppard was just shy of a months worth. I canceled my subscription and will now go the old fashion route of in store purchasing.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20190312
    },
    {
      "title": "Hand-working dogs deserve this food!",
      "text": "We went through no less than 4 other premium foods. Some were decent ...but we weren't totally satisfied until we tried Merrick's Hero's Banquet. Awesome food with plenty of power for my hard working pudelpointer. We just returned from 7 days of hard quail hunting in Southern AZ and this food provided ample nutrition to keep my dog enthusiastically going day after day. She loves the taste, availability is great (Thank you Amazon Prime), and the price is reasonable given the quality. Hands-down this is certainly a 5 star product!!",
      "rating": 5.0,
      "verified": true,
      "author": "C. H.",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Quality dog food if they can get the shipping address correct",
      "text": "Great dog food and my dogs love it. Costs as much as it does in store. When I subscribed the first bag came to the correct address then the next bag went to the wrong address. I kept trying to changed it. After you cancel the subscription they keep trying to send it and it’s to the wrong address again. Very frustrating!",
      "rating": 5.0,
      "verified": true,
      "author": "Lilli",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Great Food! Dogs Love it.",
      "text": "My Beagle/Coonhound mixes have been on Merrick Backcountry food for almost 4 years now (5 years old). They love this food and they love the freeze dried bits in there. It is a bit of a game between them of who can get to the bowls first and pick them out of the bowls first. Although are dogs are still relatively young for hounds, this seems filling enough that they do not beg, scarf down their food and are maintaining a proper weight. No fat beagles here! We always get so many compliments on how shiny their coats are. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyne",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "This is a great item and I received the product very quickly",
      "text": "This is a great item and I received the product very quickly! Will definitely be ordering this product again as my dog has a potato and chicken allergy and this food does not contain either ingredient. She is a pitbull mix and she really has skin issues, but this food helps to keep her problems under control. I am not sure how much she likes it just yet, because I have slowly been integrating it into her diet, but we will soon mix it with the merrick wet food as well.",
      "rating": 5.0,
      "verified": true,
      "author": "ILOVEAMAZON",
      "helpful_votes": 2,
      "publication_date": 20170122
    },
    {
      "title": "I'm making a switch",
      "text": "I have fed this product to my dogs for years now. I always bought it at my local pet store. For the last several months I've been ordering it on-line and it's not as good. The \"raw\" material is dark brown, unlike the previous light brown color. The actual pellets are darker, no shine or luster, lots of \"bubbles\"; it looks over-cooked./burnt. My dog still eats it, but he simply loves food. I'm going back to purchasing from my local store or changing brands altogether.",
      "rating": 3.0,
      "verified": true,
      "author": "pazw",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Check your bags before opening",
      "text": "while I like the dog foo I was not too happy to discover a huge hole poorly taped over in the process of filling up the air tight container. Had I known that it was there I would have returned the bag. Next time I'll just go get it at the pet store.",
      "rating": 3.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Not as good as it used to be",
      "text": "Years ago, my dogs absolutely loved this dog food, eating every kibble immediately. Since the price for this item has more than doubled, the ingredients must have greatly changed because my dogs barely even touch this food when I pour it into their bowls. Sadly, I was left with having to shop for another brand name of dog food.",
      "rating": 2.0,
      "verified": true,
      "author": "Brent Johnson",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Best food my dogs have eaten!",
      "text": "I have struggled with finding a healthy food for my dogs. This has real freeze dried meat in it! My little dog will steal all the meat chunks out if the big dog's bowl (she's brave he's a gentleman that's the only reason he puts up with it) then eat the kibble. I bought a 22 pound bag at the pet store and the absolutely love it. It is A LOT less expensive on Amazon and getting the reoccurring delivery is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen M Sagel",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "My dog loves to eat the freeze dried meat pieces.",
      "text": "My dog loves to eat the freeze dried meat pieces. I have to add additional Merrick freeze pieces into the food when only the kible is gone to get her to finish her 1 cup of food. I alternate between the different Merrick flavored dog food every month as well to keep her eating the kibble.",
      "rating": 5.0,
      "verified": true,
      "author": "IAM Hall",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Happy Akita",
      "text": "My dog loves this food.I have a 78 pound Akita & she gopt so much more energy after eating this for a few days. Shes only 3 years old & she started acting young again after moping around. I was feeding her this other grain free food from the store ..(Rachel Ray ) She barely even ate it until she had too & she moped around. This food seems to be doing her good. I am happy that she is happy",
      "rating": 5.0,
      "verified": true,
      "author": "lilybell77",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Finally, better stools!",
      "text": "This food is helping our 10 month old German Shepherd male have better stool. That says a lot about our dog’s health. He loves it, too! Just wish it came in large kibble. His older sister German Shepherd wants to steal it, but she doesn’t digest grain free well, so we can’t let her have it. One star off because it only comes in small kibble & the last bag had a hole in the back. That may have happened at Amazon’s warehouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Large freeze dried pieces and not enough in bag",
      "text": "My dogs liked the taste of the food ok. The freeze dried food was much larger than the kibble and normally that is okay. However, I have an 18 year old chihuahua with one tooth. She tried to eat a piece of the freeze dried immediately and got it stuck in her throat. I had to take every piece of the freeze dried out of the bag. It was at least two inches long at the largest pieces and about 3/4\" wide. Good and bad, there weren't that many freeze dried pieces. I was disappointed because my dogs love the freeze dried food and I can crumble it enough for the older dog to enjoy. I won't purchase it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Starlia",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "My welsh terrier just didn't like it",
      "text": "She would pick out the chicken pieces and eat it but really had to be hungry to eat the dog food. Perhaps because it was game flavored. Maybe if I tried a beef or chicken.",
      "rating": 2.0,
      "verified": true,
      "author": "Christie Summervill",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Best Dog Food Brand",
      "text": "I love the Merrick dog food collections. I have had lots of friends switch over to this brand because their dogs love it and will actually eat. I can even switch from their different flavors and \"collections\" and my dog doesn't get sick like you would having to ease them into a new type/brand of food.",
      "rating": 5.0,
      "verified": true,
      "author": "CSpare",
      "helpful_votes": 3,
      "publication_date": 20160807
    },
    {
      "title": "Fur babies love it",
      "text": "The only food we feed our fur babies. I am a travel nurse and when we first started 3 years ago they started having tummy issues. Since switching to Merrick no more issues. They love the freeze dried bits and rush to be the first one to get to them when we refill their bowl.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenda Short",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Wrong item received?!",
      "text": "I ordered original recipe because it didn't have chicken meal but I received the new version WITH. CHICKEN MEAL. My dog has poultry sensitivities which is why I needed the original. Glad it's only the 4lb bag. I already opened it, so I can't return it.",
      "rating": 1.0,
      "verified": true,
      "author": "L.",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Everyone's low reviews are hilarious",
      "text": "My dog loves this food, I've tried to give her Canidae Raw Coated but she turned her nose at it. I cant help but laugh at all the 1-3 star reviews about the raw coated pieces. Its basically a healthy lucky charms, so what if they dont get a BUNCH? The food is still good....",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Not much raw ingredients",
      "text": "I expected much more of the freeze dried raw ingredients. This brand had hardly any. Not a good product for the money. Won't buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Karen M Lockridge",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Good dog food and product.",
      "text": "Dog loves it! Nice that the smaller kibble is easy for my dog to eat and the freeze dried meat makes it satisfying for my dog to eat. Good quality and I love that the bag has a Velcro style clasp to seal the bag. Other bags either don't have a way to close it or the Ziploc style gets full of crud and doesn't seal. Overall a very good dog food and product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean M",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Product Changed :(",
      "text": "We normally love this dog food, But this bag all of the freeze dried pieces are the same size as the kibble - in the past 2 years we have been buying the chunks of raw meat are big and exciting for our dog, almost like a treat for her, but now they are so tiny and blend in. Hope this isn’t a change for all bags :(",
      "rating": 1.0,
      "verified": true,
      "author": "A. C. Schwantes",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Good food",
      "text": "My one and a half year old lab mix enjoys this food. He tends to pick the beef bits out first and comes back later on to finish the brown kibble. There aren't a lot of the beef pieces included in the bag. I'm sure my dog wishes they were all beef pieces.",
      "rating": 4.0,
      "verified": true,
      "author": "RYAN C",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Your dog will love you more of you choose merrick hero’s banquet.... I promise",
      "text": "Product seems like a winner when grouped with amazon prime which is simply amazing I love what merrick is doing going the extra mile for these dogs . Everyone should buy for that reason alone ..... and the taste",
      "rating": 5.0,
      "verified": true,
      "author": "scott",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Too pricey. Not as highly rated as some cheaper brands.",
      "text": "Dog enjoys it. My pocketbook doesn’t. There are higher rated dog foods for half of the cost. Shop around, read up on the amazon wag dog food.",
      "rating": 4.0,
      "verified": true,
      "author": "Thrashertoo",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Merrick quality for my big puppy.",
      "text": "My English Bulldog loves Merrick foods. Merrick is the only brand food my dog has eaten since she was three months old and two years, eight months now. Veterinarian says she is maintaining her perfect weight which is sometimes hard to do with English Bulldogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "The freeze dried pieces are great. I could feed them as treats if I ...",
      "text": "My dog loves this food! I alternate between this and their other beef recipe. The freeze dried pieces are great. I could feed them as treats if I wanted to. Also, the seal on the bag is actually very good compared to other bagged dog foods I've seen. Locks completely air tight and keeps food extremely fresh (as fresh as dry food can be I suppose :P)",
      "rating": 5.0,
      "verified": true,
      "author": "Julianne Dome",
      "helpful_votes": 2,
      "publication_date": 20160119
    },
    {
      "title": "We used Merrick wet canned food and our dog loved it. So we decided to try the dry ...",
      "text": "We used Merrick wet canned food and our dog loved it. So we decided to try the dry food. Our dog had problems with other dry food in terms of getting diarrhea from them, but this food seems to suit him well and he is very excited to eat it. We highly recommend it, especially that is made in U.S.A. and not in China.",
      "rating": 5.0,
      "verified": true,
      "author": "Euro style lady",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "It both dogs love this food",
      "text": "I have a picky eater! It both dogs love this food! Especially the freeze dry pieces! I have subscribed for this to be delivered every month! So nice not having to lug a heavy / big bag of dog food around a store. Just gets delivered to my front door! Just alittle expensive!",
      "rating": 5.0,
      "verified": true,
      "author": "jaime hesse",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "price is a little high",
      "text": "my dog loves the stuff---so we will continue to buy it but if we can find a lower cost --we will go with that--unsure of the flavor lol",
      "rating": 5.0,
      "verified": true,
      "author": "Edie",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Love",
      "text": "This is the only food we will feed our 90lb german Shepherd! He has a very sensitive stomach and has had bad reactions to other foods like taste of the wild and blue buffalo.... merrick makes his coat super soft and keeps him at a healthy weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "LOVE THIS!",
      "text": "My dogs LOVE THIS! I have two German Shepherds that weigh over 85lbs and eat a lot. They need a high quality food and we found it!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Cuka",
      "helpful_votes": 2,
      "publication_date": 20170919
    },
    {
      "title": "Great dry food",
      "text": "All 8 of my dogs like merricks. I have bought most of the flavors and all seem to like. I also like the package seal. Easy to open and close.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah C. Brannon",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "not only does he enjoy it but it has relieved his \"hot spots\" and ...",
      "text": "I have a Cairn Terrier (named Toto of course) and have been through multiple brands of food from cheap to expensive holistic types and nothing compares to Merrick Backcountry. I wish I had found this food sooner as Toto is 14 now, not only does he enjoy it but it has relieved his \"hot spots\" and helped him have regular bowel movements with ease. As for \"flavors\" we have tried them all and this is what he likes the best, he even picks out the freeze dried meat pieces at first then goes back later for the rest, lol. All in all excellent product and priced just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Santilli",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "My little dogs love this",
      "text": "Or, I should say my two little dogs love this. They love the little freeze dried raw chunks and were fighting over them, so I usually get out a couple of chunks and give them separately. I have a 5 pound Havanese and a 10 pound Maltipoo",
      "rating": 5.0,
      "verified": true,
      "author": "Kathlyn M.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Great quality kibble with treats inside",
      "text": "My dog devours it and her stool is great (sorry for the tmi but that's what us dog mommas wanna know when looking for food). She loves little freeze dried pieces, picks them out before eating the kibble :)",
      "rating": 5.0,
      "verified": true,
      "author": "Shanegka",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Our dogs love the taste, but",
      "text": "Bear broke out in dandruff. Not sure if it was the food, so weaned him off and trying again. A little pricey though.",
      "rating": 4.0,
      "verified": true,
      "author": "FrequentAmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Only dog food I use, trust, and love",
      "text": "This food is great. My dogs love the extra love Merrick puts in every bag of kibble. Every piece is coated with freeze dried raw protein and is evenly distributed kibble to raw pieces",
      "rating": 5.0,
      "verified": true,
      "author": "FreeDrinks",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Dogs love it.",
      "text": "We switched from blue buffalo. For only a couple dollars more this food is higher in protien. Our one dog has no poop issues the other one had some softer than normal stool to begin with but its seemed to even out now. and they both gobble down food... previously our one dog would just graze but now he eats his his breakfast and dinner.",
      "rating": 5.0,
      "verified": true,
      "author": "Destinee Z",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "The best!",
      "text": "My dogs absolutely love this food! I buy the one with the crunchies and it’s easier to get it off Amazon because it comes right to my door 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Your pet deserves it",
      "text": "Best brand of dog food hands down. I constantly have people saying how glossy my dogs coat is. Another perk, this food has never had any recalls and killed animals",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A. Daoust",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "No freeze dried beef in the whole package, just kibble.",
      "text": "This is advertised as freeze dried beef and kibble. There was no freeze dried beef in the whole bag. I have bought several of these bags but won't get this again.",
      "rating": 1.0,
      "verified": true,
      "author": "William C. Krueger",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Great food for man's best friend",
      "text": "Great quality, fair price, dog loves it (admittedly, he loves all food, but still), really firmed up the dog's stools when we switched him over after adopting him. Yellow lab/red healer mix, 48 lbs, eats 3 cups a day and vet says he's very healthy. Eventually may switch him over to full raw, but in the meantime it's nice there is freeze dried raw in this food.",
      "rating": 5.0,
      "verified": true,
      "author": "DinglehopperConvert",
      "helpful_votes": 2,
      "publication_date": 20151218
    },
    {
      "title": "Biscuit loves it",
      "text": "This food has absolutely changed my dog's life. He has more energy hes more playful he just has way more life to him. I couldnt ask for a better Company. Thank you for everything you've done for my Dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Watson Fredell",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Good food",
      "text": "My dogs love this healthy food. I wish it were organic, but other than that, it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Reggae Dancer",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "... food i buy for my dogs and cats they love love love it",
      "text": "This is the only food i buy for my dogs and cats they love love love it. I have a very finicky eater and she just adores this food only downside is expensive to buy for my cats and dogs.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronnette Williams",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Gain Free",
      "text": "Great for your dogs, gain free and expensive but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "William J. Hathaway",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Not the best",
      "text": "Used this food for a long time until it now has changed into a crumbly mess with very few freeze dried pieces. Switched to WAG brand and couldn’t be happier!",
      "rating": 2.0,
      "verified": true,
      "author": "CjThompson",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Is it legit?",
      "text": "Our dog has barely ate any of this. It even smells and looks different from our normal store buy. I'm am concerned. Photo: left side is store bought. Smaller pieces. Right side bigger. Different smell.",
      "rating": 1.0,
      "verified": true,
      "author": "Lesli",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "I bought this to switch my dog from Taste of ...",
      "text": "I bought this to switch my dog from Taste of the Wild when she started having health issues (do your own research on that) and she absolutely loves it and appears to be much healthier now than before.",
      "rating": 5.0,
      "verified": true,
      "author": "Yesitsmedoug",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "The best of the best!!",
      "text": "Great dog food worth every penny spent. One of the few dog foods available that doesn’t use cheap corn oil as an emulsion ingredient. Recommend this to anyone that is trying to do a good diet trial for allergies this food has saved my dog literally.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew T",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "A Good High End Dog Food",
      "text": "Our dogs loved this food. The cost will keep me from ordering this more often.Towards the end of the bag our smaller dog started eating only the freeze dried pieces of meat.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin C. Howden",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Good dog food",
      "text": "My dog seemed to like this food. 3 stars only because we switched to a different brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "She likes it...",
      "text": "My dog liked this brand right away, I felt better knowing she was getting wholesome food and that she ate it without being picky like she sometimes does!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 3,
      "publication_date": 20161227
    },
    {
      "title": "♡♡♡♡",
      "text": "My dogs LOVE the free dried pellets. Also doesnt hurt that they're made locally, too! ♡",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Kucharski",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Yummy",
      "text": "My dog loved it so much she gained 7 lbs! Lol! It's really good quality dogfood. Came super fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Moonchild",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "My Dog loves this stuff",
      "text": "My dog really likes this food, and I think it is much healthier than a lot of the alternatives. He's a big dog, but this food is good since it fills him without making him overweight.",
      "rating": 5.0,
      "verified": true,
      "author": "D. C.",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Best food for large dogs",
      "text": "My Half German Shepard, half Husky LOVES this. He has colitis, and this helped him so much, to firm up his stool and now on a normal schedule. He always eats it all, best food for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Tank",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "NOT Raw Infused!!",
      "text": "Opened the bag and poured it in the dog container. NOT 1 piece of the Freeze Dried RAW!! ALL Kibble!!",
      "rating": 1.0,
      "verified": true,
      "author": "ColonelKris",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Excellent Quality Food",
      "text": "Dog loves it. Super high quality ingredients Made in the USA in Texas. It is worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "nom de guerre deep south",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Dogs Love It",
      "text": "Our dogs absolutely love the Backcountry Game Bird recipe. They pick out the raw meat first, but love the dry food too. Pricey but they eat it and it's a quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin C. Howden",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Not impressed",
      "text": "Not only were there only THREE freeze dried pieces in the entire 4lb bag, I had to moisten the food to get my pup to eat it! Defeats the purpose of “dry food.” Won’t be buying again.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole Palazzo",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "happy pup",
      "text": "Our 2.5 year old German Shepherd loves this stuff. She loves most of the Merrick's grain free food, and we have to be careful that she doesnt just pick out the raw bits, but her favorites are this one, the salmon, and the lamb.",
      "rating": 5.0,
      "verified": true,
      "author": "DGB ",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Excellent.",
      "text": "Extremely high quality dog food for the dog owner who cares what her dog eats and knows Purina, Iams, Alpo, Kibbles n Bits.... and all other grocery store and heavily marketed brands are SO BAD for your dog!",
      "rating": 5.0,
      "verified": true,
      "author": "Kerwin389 ",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Dogs love this food",
      "text": "Dogs love this food, only problem is the first one to the bowl picks out the freeze dried bits. Bad for the next ones, but they all still eat the kibble afterwards too.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Bittner",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Blend w your regular food at first",
      "text": "We blended it w the regular food she was eating for the first month. Improved her coat n she doesn’t have anymore hot spots since we switched!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Quality food for picky eaters",
      "text": "Our dogs are incredibly picky, so it's a miracle that they took to this food right away. We had to switch their food from a recalled brand, so we were very relieved to find this. We have it delivered once a month for our two Jack Russells.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Pricey but worth it",
      "text": "My two GSD's love the Game Bird better than the chicken!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Copeland",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "... to pick out the raw food first but still like the kibble part",
      "text": "My dogs tend to pick out the raw food first but still like the kibble part. Love the limited ingredients since my dogs have allergies to several things.",
      "rating": 5.0,
      "verified": true,
      "author": "Racer",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Backcountry is great dog food",
      "text": "Our dog loves Merrick Backcountry. Great ingredients with plenty of protein for larger active breeds.",
      "rating": 5.0,
      "verified": true,
      "author": "Katy",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Rosie LOVES this food.",
      "text": "My dog LOVES this food. It's super pricey so what I do is break up two cubes and mix it in with her regular food. What a treat!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Five Stars",
      "text": "My little one loves this flavor and I always get her this brand",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "My dogs love this food",
      "text": "My dogs love this food! I like that the bag can be sealed because it has a ziplock. Good, healthy food.",
      "rating": 5.0,
      "verified": true,
      "author": "Advance46147",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "My dogs like this dog food",
      "text": "My dogs like this dog food. Only wish I could try the beef variety, but they both have a tendency towards Pancreatitis and ended up with a problem the 1 time we did try it.",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie L.",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Came opened and messed up my kitchen.",
      "text": "Opened up box and there’s a huge hole in the bag, dog food everywhere in my kitchen. I do not know how much is missing but the price of this dog food 20 percent is a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon W",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Healthier dogs after switching to Merrick!",
      "text": "My Morkie and Puggle both eat this without any stomach upset. Score!",
      "rating": 5.0,
      "verified": true,
      "author": "Super shopper",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "My dogs look great; can't wait to eat their meals",
      "text": "Very high quality kibble! My dogs look great; can't wait to eat their meals! Very satisfied dogs & owners!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Taste, nutrition",
      "text": "My Little Dachshunds love Merrick!! The flavor of wild game bird, small kibble size! It gives them energy, vital nutrients and shiny coats !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Win for picky eaters",
      "text": "My 2 huskies love the crap out of this dog food. Dehydrated pieces of meat are always what are eaten first.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 2,
      "publication_date": 20160526
    },
    {
      "title": "Satisifed Dog",
      "text": "Dog was very happy. Food is not trash. You get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Richtofen",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "5 Stars",
      "text": "My pup loves this food. Especially the chunks of freeze dried meat! High quality at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul & Christie",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "An OK buy",
      "text": "My dog doesn't like this one as much, she likes the freeze dried chunks but prefers the lil plates overall.",
      "rating": 3.0,
      "verified": true,
      "author": "Shy Girl",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Dog loves it",
      "text": "My dog loves this food! I have tried other flavors and he won’t eat them.",
      "rating": 5.0,
      "verified": true,
      "author": "MommaMaz",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "We love Merricks",
      "text": "We love Merricks. Best dog food we've bought. It's all we buy. Our dog use to throw up multiple times a week, almost daily. This changed that.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Renae Creech",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Great dog food!",
      "text": "Great dog food. The only kind that doesn’t make my bulldog break out in sores and itchiness. Both our dogs love it especially the little treats in it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kgpancheri",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "German Shepherd approved",
      "text": "My dogs love this food, they are healthy, active and have beautiful teeth and coats so I can't complain :)",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Excellent value for great dog food.",
      "text": "My dogs love it. They dig for the nuggets so I seperate them.",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "I have been feeding Merrick for years had my dogs ...",
      "text": "I have been feeding Merrick for years had my dogs on Merrick buffalo no grain, they seemed to be tired of it. So I bought this and they are loving it.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Burton",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "He like to eat all the freeze dry meat first",
      "text": "My dog is a finiky eater and he lives it. He like to eat all the freeze dry meat first",
      "rating": 5.0,
      "verified": true,
      "author": "cathy baldino",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Five Stars",
      "text": "Dogs love the food, I love the quality, and we give back. Win/Win/Win!",
      "rating": 5.0,
      "verified": true,
      "author": "x21ironsides",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "My dog loves these raw infused.",
      "text": "My dog loves these raw infused. He is no fan of the regular Merrick dry food.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Nadrowski",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Good",
      "text": "My dog likes this food. She especially likes the raw chunks.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "This food has been great for my two small dogs",
      "text": "Bag arrived just as expected. This food has been great for my two small dogs, they love it and have maintained a healthy weight. One of my dogs is a picky eater but he never hesitates to eat this food. On the expensive side but it is worth it and made near the area I live,",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Four Stars",
      "text": "Great food when it’s in stock. The dogs love it",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah Rahm",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "No freeze-dried raw pieces included in the bag.  What's up?",
      "text": "We never had this happen before, but this particular bag was all kibble and no freeze-dried raw pieces. None! What's up?",
      "rating": 2.0,
      "verified": true,
      "author": "DogZeus",
      "helpful_votes": 0,
      "publication_date": 20180221
    }
  ],
  "product_meta": {
    "title": "Merrick Backcountry Grain Free Raw Infused Dry Dog Food",
    "description": "Style:Original Recipe| Flavor Name:Big Game| Size:22 LBMerrick Backcountry is an all-natural, grain free ancestral canine diet packed with protein that dogs crave. Merrick Backcountry Raw Infused kibble recipes deliver a perfect combination of protein-rich, grain free kibble plus real, whole pieces of raw, freeze-dried meat, poultry or fish. They provide your active dog the nutritional benefits of a raw diet they would have discovered in the wild, now in a safe and convenient recipe that's easy to serve.",
    "rating": 4.6,
    "feature_bullets": [
      "#1 Ingredient Is Real Deboned Lamb",
      "Freeze-Dried Real Raw Meat Pieces To Lock In Fresh Taste",
      "Grain-Free Nutrition With No Gluten Ingredients For Easier Digestibility",
      "Recipe Is Rich With Omega Fatty Acids For Healthy Skin And Coat And Contains Leading Levels Of Glucosamine And Chondroitin For Healthy Hips And Joints",
      "Cooked In The Usa."
    ],
    "specifications": {
      "Product Dimensions": "4 x 15.75 x 27.5 inches; 22 Pounds",
      "Item model number": "37026",
      "Date First Available": "January 14, 2016",
      "Manufacturer": "Merrick Pet Care",
      "ASIN": "B01ALL3MHU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Dry",
      "Pet Supplies",
      "Food"
    ],
    "price": 79.97
  }
}