{
  "website_summaries": [
    {
      "verdict": "Orthopedic pet beds like the eLuxury provide support and warmth for older or convalescing dogs, but healthy pets appreciate them, too. We like having a choice of covers, and the inclusion of a waterproof layer in case of accidents.",
      "pros": [
        "Accommodates all breeds of dogs, small to large",
        "Four layer design provides gel foam comfort for pets, protective cover for high density foam interior",
        "Choice of several stylish covers"
      ],
      "cons": [
        "Gel foam layer does not breathe well, could retain heat",
        "Bottom of bed is not slip-proof, can slide on wooden floors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "this product is the best I've ever tried",
      "text": "This is my first review ever. I think this company knows how to deal with customers :) First of all, in terms of quality, this product is the best I've ever tried. I got exactly the quality product as they advertised. Secondly, its price is pretty reasonable compared with other companys’ products. I was not that happy with previous pet beds which costed almost same or more because of their quality. Thirdly, I was impressed by their handwrited thank you letter. Most importantly, my dog loves it. They deserve 6 stars! Just minor feedback, I wish they had a single-colored lineup too, not a big deal though.",
      "rating": 5.0,
      "verified": true,
      "author": "YJ, Jeong",
      "helpful_votes": 58,
      "publication_date": 20160406
    },
    {
      "title": "Cat waits for dog to vacate her new bed, then naps on it.  Must be good!",
      "text": "Best bed ever! I had to replace my dog's memory foam bed (very expensive!) because, even though it would spring back to normal shape when not in use, it would nearly bottom out when she was lying on it. So, her arthritic hips were actually very poorly cushioned. This bed is a great alternative, with a top layer of very cushioning latex, and a bottom layer of dense foam that supports without bottoming out. Additionally, the cover fabric is beautiful, so I won't have to hide this away when company comes.",
      "rating": 5.0,
      "verified": true,
      "author": "Scout",
      "helpful_votes": 58,
      "publication_date": 20160508
    },
    {
      "title": "Fur-Friend LOVED New Bed",
      "text": "Our dog loved it as soon as it came out of the box! He normally roams around at night, which is the worst! Hearing his toe nails click around the house at 3 am drives me crazy! We got this bed, and he did not move an inch last night! I even tested it out before letting him lay on it, it is comfortable enough for me.",
      "rating": 5.0,
      "verified": true,
      "author": "tori",
      "helpful_votes": 33,
      "publication_date": 20160824
    },
    {
      "title": "Not Made in USA, and poor quality",
      "text": "That's right, it is advertised as \"Made in USA\" but it is made in China. Also, the foam (the one piece that does not say \"Made in China\" on it) in mine seems to have been compressed so long that even after an entire day left open to the air, it is still this discolored lumpy creased mess (see photo). I spent more money for this because I hate junk. Looks like I got junk anyway. This, I will return. What a waste of my time!",
      "rating": 1.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 28,
      "publication_date": 20170908
    },
    {
      "title": "Excellent quality dog bed",
      "text": "Purchased the large size bed for my two boxers. So far it is fantastic! The cover seems high quality and durable, the mattress is supportive and comfortable for my two senior dogs. The true test will be if it holds up over time and the cover holds up to washings. So far I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen S.",
      "helpful_votes": 24,
      "publication_date": 20170102
    },
    {
      "title": "Good quality",
      "text": "This bed is great quality & stylish. I took it out of the package and my boxer immediately jumped onto it. He loves it. He doesn't sink to the floor with this bed as he does with others that I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "DJean",
      "helpful_votes": 24,
      "publication_date": 20160609
    },
    {
      "title": "Do yourself a favor and buy from a different company, maybe one that is reputable and doesn't send out returns to it's customers",
      "text": "Do yourself a favor and buy from a different company, maybe one that is reputable and doesn't send out returns to it's customers!!!! Appears I was sent a bed that someone else had returned. Box was too small and bed was busting out of it at the seams, shape of mattress was deformed and the 2 layers of foam were separating on all sides along with a small chunk of foam missing from the top layer and every edge of the foam was brownish in color.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 6,
      "publication_date": 20180713
    },
    {
      "title": "BUYER BEWARE - DEFECTIVE PRODUCT",
      "text": "This dog bed arrived squished in a box that was way too small and bursting open. The foam mattress was folded inside a dirty, yellowed plastic bag that was vacuum-sealed and then folded again in an attempt to fit it in the box. When I tried to open up the mattress, it was weirdly warped and stuck in a folded position, with the ends completely flattened like a pancake. It has obviously been sitting on some forgotten shelf in a dusty warehouse for an extended period. It is unusable and unexceptable. Returning immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "mariposa927",
      "helpful_votes": 3,
      "publication_date": 20180331
    },
    {
      "title": "NEVER ORDER THE FIBER FILL ONE!",
      "text": "It comes in two pieces which are supposed to fit side by size but there is NO WAY that a human can get them inside. I am elderly disabled and live alone and I have to throw this way. I am so disgusted. And I certainly couldn't send it back. Once I opened the fluffy things, the quadrupled in size so now I'm stuck. And these inserts would sit side by side eventually allowing a GAP down the center. WORTHLESS. The cover is nice.",
      "rating": 1.0,
      "verified": true,
      "author": "Grandma",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Worth the price!!!",
      "text": "This is my second purchase of this dog bed. The first was purchased in 2016 and my 85 pound Labrador has slept on it nightly. There are no signs of wear, no breakdowns in the structure of the foam. The cover is rugged and withstands scratching and fluffing that dogs often do. The waterproof liner protects the foam from vomit or worse and the outer cover comes off easily and washes up perfectly. The zipper is rugged and metal. I can’t say enough good about this bed, I’m looking forward to seeing how it holds up with two Airedale terriers using it. I’ve paid more for orthopedic beds that the foam broke down after less than 6 months.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Sells",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Great cover material",
      "text": "Overall I like the large bed for $65. It’s cotton filled and not memory foam as all the reviews are about memory foam beds. The reviews are misleading and my reason for 3 stars. The only reason I did not return it for the memory foam was because it was double the price and yet it comes with the same great cover material included in the cotton filled one. Also the large bed comes with two individual Cotten stuffed pieces which cause the bed to sag in the middle. Not the most efficient. Like other beds it should include one piece/box stitched and not two separate filling pieces.",
      "rating": 3.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "The things we do for our pets...",
      "text": "I love this bed for my pup. I bought this one specifically because my dog had spine surgery and needs to rebuild muscle in his hind legs. The purpose of the bed (not only for comfort) was for therapy. 1. It's thick so he has to try and lift his legs higher to get onto the bed and 2. the memory foam encourages core muscles when they're trying to balance. it's also sooo comfortable that I lay with my dog in it sometimes. 5 stars. I also really like that handwritten note in my package. It was a very personal touch for such an un-personal way of purchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "Marissa",
      "helpful_votes": 3,
      "publication_date": 20170202
    },
    {
      "title": "No water resistance at all.",
      "text": "So my dog has loved this bed since September of 2016, and we've taken excellent care of it and nothing's ever been spilled on it. For the first time ever my dog had a small accident and I took off the covers to wash them and realize that the foam was soaked. No instructions on how to clean the foam. I really hate being lied to telling something is waterproof or water resistance when it's not.",
      "rating": 2.0,
      "verified": true,
      "author": "Single Tech Geek Mom",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Ths is an awesome bed. It's well made",
      "text": "Ths is an awesome bed. It's well made. I have a 15 year old lab mutt who has arthritis and he loves this bed and is not as stiff in the mornings when getting up. I will be purchasing another for my battle too. High quality product. The top cover is loose enough that you don't have to fight to put it on or off. The zips are all secure and run smoothly. The water-proof liner is sturdy and zippered like the top cover. Firm yet soft Great support. I purchased the large and there's enough space for a 72lb lab mix and a 50lb beagle/basset/bulldog to cuddle.",
      "rating": 5.0,
      "verified": true,
      "author": "Cayce L Smith",
      "helpful_votes": 5,
      "publication_date": 20160903
    },
    {
      "title": "The orthopedic foam is the best part and my Labrador and Weinareiner are in heaven ...",
      "text": "I ordered 2 large beds in the lovely designer blue print. The quality exceeded my highest expectation and the fabric is so durable. I've washed it numerous times and it looks the same as the first day I received the beds. The orthopedic foam is the best part and my Labrador and Weinareiner are in heaven when they are on them! I really wanted to support this company because it's American made and I can really tell they take pride in their products. There was also a HAND WRITTEN note card with my name on it enclosed, expressing gratitude for purchasing their beds!!! Wow, who does that anymore, such a nice touch :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20161204
    },
    {
      "title": "Top quality & attractive dog bed!",
      "text": "This is a fabulous quality foam dog bed... I ordered the large and it's super for my Rough Collie! The quality of the manufacturing & the fabric adds to this comfy pet bed. I gave it a try myself and the cooling gel is really cool! Will be great in the summer... I may have to this type of gel for my own mattress the next time I buy a new mattress. I was looking at locally made dog beds, but they were over $250 for this same type of size and fabric strength. Looks great in my bedroom too!",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "Best dog bed I have ever purchased.",
      "text": "I looked around for months at different dog beds. It came down to this one and the big barker. I decided to go for this one since my dog is only 70 pounds. I must say I am impressed by this bed! It did take our dog a few weeks to warm up to it but she generally doesn't like beds. Now she's on it all the time and I think it has helped her feel better with her arthritis. This was definitely worth the money! It is firm but still has some give to it. It seems like it is a very well made bed. I will be ordering a 2nd soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Hipmountainmama",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "No longer foam mattress",
      "text": "We’ve purchased 4 of these medium sized beds in the past and they were all foam mattresses. Just ordered a replacement and it was the typical stuffing mattress. So disappointed. Would not recommend based on their new changes.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda S.",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "He has since joined his best friend Sophie chasing squirrels in his spirit form",
      "text": "Our old doggie was a Katrina rescue, this orthopedic bed helped him get \"comfy\" when he lay down (couldn't make it up on the couch anymore). He has since joined his best friend Sophie chasing squirrels in his spirit form...",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 3,
      "publication_date": 20180130
    },
    {
      "title": "Wonderful dog bed for a senior pooch",
      "text": "Our Holly dog is a fourteen year old arthritic Labrador retriever who had stopped sleeping on her squishy L.L. Bean dog bed. When I read how firm this dog bed is I decided to give it a try. It works! She immediately lay down on it and has been enjoying it now for a couple of months. I think that she needed the firmness to push off of whenever she stands back up. The dog bed is well constructed and attractive too. Furthermore, the company sends a nice thank you card for your purchase. I am very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "The Shermans",
      "helpful_votes": 2,
      "publication_date": 20170209
    },
    {
      "title": "very disappointed!",
      "text": "I purchased 4 of these dog beds less than 6 months ago. Within a couple months the zippers broke and the covers tore and the foam flattens out to the ground when my dogs lay on them. A replacement cover is more than half the cost of the bed and its not worth it at all! I had high hopes for these beds and spent over $400 on them for my dogs, it was an absolute waste of money!! I would not recommend this product at all!",
      "rating": 1.0,
      "verified": true,
      "author": "teyanna dohermann",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "November 7, 2016",
      "text": "I just went to order another dog bed as I have to cart this one from room to room. I wanted another one for my office so Mollie could come and stay with me while I worked during the day. I can't believe that I have had this bed so long and it still looks brand new. The cover is a dream to take off to wash and there is no struggle getting it back on as it keeps its shape. I absolutely cannot say enough good things about this bed. All my dogs and even the cats sleep on it. Thank you so much for such a high quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gayle Varnell",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Nice bed for older dogs",
      "text": "Wonderful bed for my 13 year old German Shepherd. She was never one who liked laying on dog beds, I guess they made her too warm, but she loves this one. It makes her comfortable, less stiff when she gets up and I guess the best endorsement is she won't share it. She even moves it when she wants to lay down somewhere else and takes it with her. It is stain resistant and the cover is easily removable should you wish to wash it. Great purchase and at such a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "LadyGar",
      "helpful_votes": 2,
      "publication_date": 20170202
    },
    {
      "title": "Love it",
      "text": "Very happy with this. My 43 lb dog fits perfectly on it. We leave this in the garage for her to lay on because she has always been reluctant to come in side when there are still things lurking outside. She maintains her watch post from here for hours. Its worn well, but it is not puppy proof as my daughters new dog proved recently. Silly critter chewed a hole in the side, but its still going strong. Will replace with another one once the furry idiots finally overwhelm it.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Gullo",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "The Bentley of Dog Beds",
      "text": "I've lost count of how many dogs beds I have purchased, cleaned and thrown away in the past thirty years. This bed has it all. Thick body contour foam, a zipper cover to keep the foam clean and the best part is...the top second zippered cover that has a zipper that zips on 3/4 of the bed. I don't have to wrestle the bed into a one sided zipper that discourages me from cleaning the cover. I can buy other cover to fit the bed. So worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "rexy donner",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "I am very angry about this quality of this purchase and the price I paid for it.",
      "text": "This is the third bed I’ve ordered of this brand. The first large one looked just like the small bed on the left in the photo. The new large one we just received is the one on the right. It is not memory foam; it is some kind of cheap, fluffy crap which cost a lot of money, and the cover does not even begin to fit properly. I was very happy with the first two, but I could not be more disappointed with this one. I have a sweet, aging German Shepherd who has problems with her hips, and this bed isn’t going to help ONE TINY BIT. Excuse my language, but it just sucks. Michelle Benton",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Disappointed",
      "text": "Pretty disappointed in the quality. I was expecting something that looked like the pictures and the other reviews. Instead I got a bed without the memory foam, no waterproof inner liner, and the bag of fluff does not fill the bed. When I called they said they’ve recently changed the bed so it doesn’t have the cover anymore and it is obviously not memory foam. They offered to start a return. Don’t rely on pics of memory foam with an inner liner because that’s not what you get.",
      "rating": 1.0,
      "verified": true,
      "author": "AMLAW",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Fur Attractor & Slides",
      "text": "I am sad to say that I am not impressed! The fabric of the cover attracts dog hair. With in five minutes of having this bed it was covered in hair. Never had an issue with this owning other beds. Another issue is that it slides out on my dogs. For $72 they should make the bottom nonslip. The actual mattress is very nice and wrapped in a water proof covering. I just dislike the cover!",
      "rating": 3.0,
      "verified": true,
      "author": "TLS",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Great buy",
      "text": "I bought these for our two French Bulldogs pens. I ordered several covers so I can alternate one while I wash the other. At first they were really puffy but they settled down now and the dogs love their beds. And if there’s an accident while the dogs are in their pens, no worries. Just wash the covers and wipe down the waterproof cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen L.",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Cute patterns, lack luster product though",
      "text": "I have bought orthopedic dog beds now for many years, however, this is the first time for this brand. The cover is cute and well built and will last for long time. The memory foam however is very stiff and not very giving and unlike any others I have bought before. This one costs a little less than my previous ones but the quality of the foam seems to be much different. I personally will think twice before buying these again.",
      "rating": 4.0,
      "verified": true,
      "author": "Ducky",
      "helpful_votes": 2,
      "publication_date": 20170312
    },
    {
      "title": "Old dog on a cloud now",
      "text": "The cockapoo this bed is for is 13 years old, and she's feeling her age. She can't jump up one the human bed anymore and doesn't want to sleep out on the couch when everyone is in bed, but she doesn't like sleeping on the old flat beds stacked on top of each other. The bed rolled out very nicely and that night she slept on the bed and didn't want to get up from it. It's her favorite bed now. And the company is so nice, they are a company I will definitely buy from again. Although the bed looks very well made so I don't know how soon I'll have to purchase a new one.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Our dog loves this bed",
      "text": "Our spaniel loves this bed. It is well made and has stood up to the wear and tear of a dog racing around, scratching and licking the bed. We've had this bed over a year and it is still going strong. Our dog recently broke his leg and this bed has been a life saver for providing extra support whilst he recovers. We've now bought a second one for another room. If you want to pamper your fur baby with some creature comforts this product is recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean08",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Happy with product and merchant",
      "text": "Very, very good quality. My dog hesitated initially—I think she was afraid she'd be in trouble for laying on it (she's not allowed on our furniture). This rivals MY bed in terms of comfort, LOL. Very satisfied with my purchase and the dog is happy, too. My purchased size was out of stock initially, but the wait was not unreasonable. Furthermore, the merchant responded to my email query quickly and graciously. I appreciate that and would not hesitate to order from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott D.",
      "helpful_votes": 3,
      "publication_date": 20160912
    },
    {
      "title": "Fantastic dog bed",
      "text": "This dog bed is fantastic. We got the biggest size available and it fits our Great Pyrenees with room to spare. She never was big into using beds but she loves this one and uses it all the time. It must be because of the cooling. The cover comes off for easy cleaning too. This was completely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Gatsbygirl",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Easy to take on and off to clean.",
      "text": "I bought two of these orthopedic dog beds for my German Shepherds and they love them. I wash them once a month and I follow the cleaning instructions. The covers are holding up well and they are easy to take off and on. I haven't had any wetting on the beds so I can't comment on it but unlike others beds I've had the inner liner is tearing and the memory foam spilling out.",
      "rating": 5.0,
      "verified": true,
      "author": "Judge Dredd",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Great bed",
      "text": "Bought the memory foam bed for my dogs almost 3.5 years ago and it is just now showing signs of wear. The dogs like to paw at their beds which tears cheaper covers. This one has held up very well. Easy to remove and wash. I only wish the company offered replacement covers.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon G.",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Nice!",
      "text": "I put a medium in my large dog crate and my dog loves it! I'm eventually going to purchase the large bed for doggie to use in the house now that I know the quality of this item. The medium is a little short for my 85 lb. dog, but is ok for the crate. Ditto to all the nice remarks about this bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Drew2",
      "helpful_votes": 4,
      "publication_date": 20160615
    },
    {
      "title": "Spacious and comfortable",
      "text": "This is a excellent high quality product! I bought the Large size for my 75lb Labrador. The dog has lots of space to spread out, as the bed is not only long but also wide. My daughter laid on it and said it’s more comfortable than her own human bed.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Okay",
      "text": "I bought this bed based on all the positive reviews. The bed is firm. I thought it had a cooling effect? Meaning it would not absorb heat. I'm not sure about that. The bed slides easily on wood floors. That spooks my dog. Probably not ideal for aging dogs with joint issues then. Our last bed had tiny rubber dots on the bottom which made it non-skid. I really wish this had it. The fabric is really going to have hair stick to it which I don't care for either. I guess I should have shopped for the dog bed in person vs online",
      "rating": 3.0,
      "verified": true,
      "author": "Review lady",
      "helpful_votes": 24,
      "publication_date": 20160609
    },
    {
      "title": "I just don't know....",
      "text": "I have a love hate relationship with this thing. For the most part, my dog wants nothing to do with it. Every now & then she'll spemd a few nights on it. Right now it's propped up against my wall because it takes up so much space. It mostly just hurts my feelings when I see it there and remember how much I paid :/.",
      "rating": 3.0,
      "verified": true,
      "author": "cworld1823",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "A 5 🌟 Product.",
      "text": "The bed is thick and supportive. I sat on it and I'm 245lbs, it didn't sink or collapse. The cover is very well made and ridiculously easy to put on and remove. The zipper goes around 3 sides of the cushion, like a suitcase zipper. There is a fabric handle on the edge, making relication very convenient. I'm using it on a chaise lounge chair as a replacement cushion because my cat destroyed the original.",
      "rating": 5.0,
      "verified": true,
      "author": "cooking",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Excellent and very pretty.",
      "text": "Fantastic, well-made, and made in America! I have always purchased Fosters/Smith beds and they are great too. But I would buy this one all over again. So supportive for my senior citizen dog...she's not a dog to me she is family. The cover on it is so well made and is thick enough that it should hold up well to every day use.",
      "rating": 5.0,
      "verified": true,
      "author": "Purpleotas",
      "helpful_votes": 2,
      "publication_date": 20170303
    },
    {
      "title": "Perfect Fit",
      "text": "Great material, has a nice little memory gel top. Not the softest out there and even with my discount was a little on the expensive side. Has a water resistant topper underneath the main cover which is nice so when your pet pees it doesn't ruin the gel. The material seems strong, albeit thin. All in all, great product. Check out my video for a more close up look!",
      "rating": 4.0,
      "verified": true,
      "author": "eNkrypt",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "The best dog bed!",
      "text": "What a great dog bed. My dog has arthritis and he loves his bed. The cover is so easy to remove and wash. I'm considering buying another one for my front room because I placed this one in my bedroom. This is by far the best dog bed I have ever purchased. It's a little pricey but worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "T.A.L",
      "helpful_votes": 3,
      "publication_date": 20161008
    },
    {
      "title": "High Quality Cover",
      "text": "I'm very impressed with the cover of this dog bed. The material feels sturdy and the stitching and zipper are nice. However, the bed came with two polyfill bags so it sags a little in the middle where they meet. I'd rather have one bag but maybe this keeps the filling evenly distributed. My dog doesn't seem bothered by it so neither am I. The description next to the item is correct. The customer pictures in the reviews with the memory foam and cooling cover are either from another product sold by this company or they've recently changed their filling.",
      "rating": 4.0,
      "verified": true,
      "author": "MLM",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "It feels more like a light regular foam rather than soft and flexible ...",
      "text": "The memory foam is not the quality I expected. It feels more like a light regular foam rather than soft and flexible memory foam. I use to have an expensive memory foam on my bed and that was very heavy , dense and soft. This one hardly can compare. My dog has arthritis and absolutely does not want to sleep on it. We are now using it as a big expensive step to help him get on the couch .",
      "rating": 3.0,
      "verified": true,
      "author": "Lana S",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Very nice bed!",
      "text": "Both our dogs want to sleep on this bed! We have other beds (different brand) and they are nice but the dogs seem to both want this one! It's lightweight, easy to move around and big enough for our Molly. She kind of hangs over the other beds unless she is sideways and she fits really well on this bed. I didn't care for the cover much when we first got the bed but I'm used to it now and I kind of actually like it. We cover the bed with a flannel sheet anyway for the comfort of the dogs. Definitely recommend this bed for the puppies!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra L. Middleton",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "completely satisfied. Great product",
      "text": "We thought our dog, a 115lb German Shepherd would need time to acclimate to her new bed. But, after checking it out and walking on it for a few seconds, she plopped down on it, completely satisfied. Great product. My only concern besides the above, was if it would return to shape after being shipped in a relatively small box. It didn't completely...but enough. Even though we gave it 30 hours. If she hadn't liked it as much as she does, I may have returned it. But she loves it and we're keeping it. Great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "One year old and still great!",
      "text": "Ordered 2 of these almost a year ago for our German Shepard and Husky mix. They love these beds and sleep on them all the time day and night. We wash the covers regularly and they don't seem to be wearing at all! The covers are thick and the zipper is strong. The orthopedic pad is still thick and has not lost any support! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "enlkidd",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "BEST Customer Service",
      "text": "Although FedEx lost it, the customer service people at the seller's office were beyond amazing!!! I finally got it, and Dudley loves it. He has never liked any bed I've gotten him, and now that he's 12 1/2 years old (for an Old English Sheepdog this is amazing), he got right on it and was able to get up and off it without struggling!!! BEST thing I've ever gotten him and again, the seller's customer service team were stellar!",
      "rating": 5.0,
      "verified": true,
      "author": "Claire Moyers",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "We wanted a large comfortable bed for her",
      "text": "We have a 10 year old red heeler who is begining to show signs of joint pain and struggles to stand up. We wanted a large comfortable bed for her, and this bed certainly fits the bill. The bed is very cushy but also firm enough to offer support. You will not regret getting this bed.",
      "rating": 5.0,
      "verified": true,
      "author": "BillyMcD",
      "helpful_votes": 4,
      "publication_date": 20160729
    },
    {
      "title": "Best bed ever!",
      "text": "The bed itself is wonderful. Dog loves it and I love how easy it is to clean. I also am impressed by the personal note written on the shipping container thanking me for my purchase as well as the thank you card I received in the mail from the company. Truly a pleasure to purchase from a small American company.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey K.",
      "helpful_votes": 4,
      "publication_date": 20160805
    },
    {
      "title": "Amazing dog bed!",
      "text": "I have a pretty large golden retriever (95 lbs) that is now 8 years old. Over the years I bought a number of large dog beds for her that lost their shape after a few months and didn't give her the support she needed. She has some joint issues now and support really helps her for comfort. I bought this bed two years ago and at bedtime we tell her \"it's time for bed\" and she loves it. It hasn't lost any of its support and is still in great condition. Best large dog bed you can buy and the price is comparable to beds that won't stand up over time. I highly recommend this bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Best dog bed yet",
      "text": "My dog loves her bed. It is the highest quality dog bed I have purchased but cost less than some of the other \"high end\" beds. It is super easy to clean the covering. I had to contact the seller to switch out the sizes and it was very easy and quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Lynch",
      "helpful_votes": 3,
      "publication_date": 20170211
    },
    {
      "title": "Big bed",
      "text": "Big size for my big guy. Wish it was thicker like Big Barker beds. For the price it does its job while furbaby is in living area with us. Furbaby is 115 lbs. When he gets up can see indent around his belly hip area; however, pad does fluff back up quickly. Denim cover has held up and is easy to take off and wash. Bed also came with a waterproof liner.",
      "rating": 4.0,
      "verified": true,
      "author": "Cas",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Dog Vendetta",
      "text": "Bought this bed recently when we got a new couch and knew we would be transitioning our Doberman to a non-couch lifestyle. Size large is perfect for a Doberman, but as she is bitter about being disallowed from couch life, so she mostly lays along the perimeter and places her head on the bed as though it's the biggest dog pillow in the world. In summation, the bed perfectly suited our needs. If only it came with an attitude adjustment for our overly opinionated dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddison W.",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Totally worth the price!",
      "text": "This dog bed has all the features you could want in a dog bed. I found this and purchased it just a few weeks before my almost 16 year old dog passed away. I am glad she was able to enjoy it and be more comfortable in her last days.",
      "rating": 5.0,
      "verified": true,
      "author": "hennypenny",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Ignore the bad reviews",
      "text": "I considered returning this bed without even taking out of the box, based on negative reviews. This bed is amazing. I'm sure that my seniir dog is going to love it. It doesn't smell bad, it's well constructed, and the cover is easy to put on. It's also a really nice pattern. I'm very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Faye M. Conner",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "I love that I can remove and wash the cover",
      "text": "My dog sleeps on hers every night. I love that I can remove and wash the cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 9,
      "publication_date": 20170102
    },
    {
      "title": "Great beds/liner/cover",
      "text": "These have lasted 6 years! I wash them 1-2x's a month and the only reason I needs to replace the covers is the dogs have scratched holes, digging before lying down. Great colors to match your interior and very durable. Pictured are my Pit Blends Jake & Peter.... relaxing on their beds! These, by the way, are size Medium beds and the pups are 72 to 80 pounds :-) Machine wash and line dry... Priceless!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tara Essien",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Our dog loves LOVES this bed. She's a 90lb ...",
      "text": "Our dog loves LOVES this bed. She's a 90lb Argentian Dogo, and she can spread/lay out as long as possible and not be hanging off at all. ...She's a really big girl, and this bed is still so roomy and large. Get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Meg LeDon",
      "helpful_votes": 7,
      "publication_date": 20160810
    },
    {
      "title": "Make the investment",
      "text": "Best dog bed ever. My dog recently tore her ACL and is scheduled for TPLO surgery. Consequently, she is restricted from walking. I bought two of these beds for her and she loves them. She has three other beds and she always chooses these.",
      "rating": 5.0,
      "verified": true,
      "author": "danielgloria",
      "helpful_votes": 3,
      "publication_date": 20160724
    },
    {
      "title": "This is not actually waterproof. After a while, ...",
      "text": "This is not actually waterproof. After a while, I noticed the mattress began to smell and it was because ironed (my dog is incontinent) leaked thru the liners. Had to throw away. Edit: I was contacted by the company and informed that my waterproof liner may have failed. They are replacing my bed! Very happy with the customer service I received! Here is a picture of my disabled dog and her best friend, Moxie, enjoying the bed :)",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Passed the Buddy The Test With Flying Colors.",
      "text": "We have a 140lb Goldendoodle who has rejected every bed we purchased so we were very skeptical about spending this much on yet another bed. We finally decided to take a change due to the return policy and are happy we did. the bed appears to be made very well and Buddy has slept on it every night since it arrived about 2-weeks ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo Berz",
      "helpful_votes": 2,
      "publication_date": 20170215
    },
    {
      "title": "... came with some sort of cover that looked nothing like the picture and was in the shape of a ...",
      "text": "The bed came with some sort of cover that looked nothing like the picture and was in the shape of a box, with lots of snaps, that didn’t cover the bed, at all. How frustrating to have to go to the trouble of returning!",
      "rating": 1.0,
      "verified": true,
      "author": "KWR",
      "helpful_votes": 2,
      "publication_date": 20180330
    },
    {
      "title": "Performs as advertised",
      "text": "I have only had this bed for a couple of months but so far, so good. And by now all of the other beds have been totally flattened and destroyed by my English bulldog. The cover is really pretty and still looks like new even after all of the washings it has already had. Also, easy to take the cover off and put it back on. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Well made dog bed",
      "text": "This has been great for our bigger dogs. The little ones don’t even make an impression in the memory foam but they love it too. It’s well made and has a well fitting cover. I’ve not washed the cover yet but I have wiped small spots from it and it cleans nicely. The girls give it 5 out of 5!",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Dog approved",
      "text": "This is a real nice dog bed, my German Shepherd has hip dysplasia and he can get in and out of it with little problems. Its easy to vacuum and wash with its big zipper cover. I have washed it a couple times already and its still holding up. I recommend this bed,",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Sleeps very hot, not as firm as needed",
      "text": "Sleeps very hot, not as firm as needed. My 60-lb dog is panting all night on this mattress from being very hot on summer nights, so I removed this mattress. The bed traps a lot of body heat despite an infused \"cooling\" gel. Also, it's not very firm and doesn't provide the support my dog's joints need.",
      "rating": 2.0,
      "verified": true,
      "author": "N S",
      "helpful_votes": 2,
      "publication_date": 20170804
    },
    {
      "title": "Great dog bed that offers both style and comfort",
      "text": "Our dog loves this bed! I was looking for something with more support for our 11 year old lab. The memory foam is super thick and high quality. I love the print and the fabric is tough and durable. I would highly recommend this product to others and definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "oriana van someren",
      "helpful_votes": 5,
      "publication_date": 20160531
    },
    {
      "title": "Good for heavy dogs!",
      "text": "Bought this for my 90lb lady because every bed we've tried looses cushion very quickly! Silly me used this as her crate bed and she's one who likes to scratch before she lays down so after about a month the zipper broke and she tore out some of the filling. Would definitely buy again, just would not put it in her crate!",
      "rating": 4.0,
      "verified": true,
      "author": "Issa",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Made in USA??????",
      "text": "Bought this because it is advertised as \"Made in the USA.\" Sticker on the bag containing the bed cover states \"Made in China.\" What's the deal?????????",
      "rating": 3.0,
      "verified": true,
      "author": "Educated Reviewer",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "This is the best dog bed out there",
      "text": "This is the best dog bed out there. My Corgi is 8 years old and needs the support for her hips. We purchased the bed in large and picked the color green. Green has cute dog designs on it. We have had it for a while now and have noticed an improvement in my dog's walking. She trots now. I like that the cover is machine washable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Dogs won't lay on it.",
      "text": "The bed is cute. The material is perfect. It appears to be very well made and durable. The problem is I have had it for over a month and my 2 French Bulldogs do not lay on it. It does not seem comfortable. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Diane Mc",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "55 pound dog approved bed and made in America.",
      "text": "I feel that this company really cares about their product and consumer. It's nice looking and the large size fits my German Shorthair Pointer pretty much perfect. (He is 55 lbs w/ long legs). I do put a soft sheet over the top anyway and wash it every week. My dog is happy. And I like that they are made in the USA.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Great covers - easily washable and truly waterproof.",
      "text": "These are the best washable covers I've ever used. I have gone though a ton. The water proof cover is strong, not snaggable plastic. The outsides are very good quality, thick fabric. They came in a little stiff for my elderly dogs but they use them all the time now that they have had some wear.",
      "rating": 5.0,
      "verified": true,
      "author": "MsWolf",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "My dog loves this bed!",
      "text": "I bought this to replace a bed I bought just a couple of months ago. The \"old\" bed was only 4\" thick and not nearly as firm. Our dog got on this one, laid down, gave a big sigh, and gave a look that said \"Why didn't you buy this one in the first place?\"",
      "rating": 5.0,
      "verified": true,
      "author": "Jordana",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "They are great!!",
      "text": "I have 4 large Labrador retrievers, each with special needs. I ordered two of these beds to see how they would work out. They are great!!! My lab with bad knees loves it. The others do too. The cover is water proof, and easily washable. The little one had an accident, and it didn't go through at all. It was easy to wipe off. I threw it in the washer anyway, which was also easy. I'm planning on getting two more.",
      "rating": 5.0,
      "verified": true,
      "author": "24hamlet",
      "helpful_votes": 3,
      "publication_date": 20160806
    },
    {
      "title": "Great investment",
      "text": "Wow, great bed. I want one! Love that it is water proof, makes clean up after, um, she gets sick so much easier. I can tell my pup is much more comfortable, and I am happy that she can't drag it out to the middle of the floor, it's too heavy and uncooperative... 😄",
      "rating": 5.0,
      "verified": true,
      "author": "Kahula",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "I want to support our veterans",
      "text": "The outside cover was too small for the actual bed. I kept the bed because I just happen to have a zipper, washable cover that fits it. So that’s what I’m using to insert the bed into and the bed itself is fine. It was disappointing that the cover I paid for wasn’t the right size but I do like the idea that The bed is machine washable.",
      "rating": 1.0,
      "verified": true,
      "author": "Paula Y. Rushing ",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Happy Dog! Happy Human!",
      "text": "Great bed. Dense foam doesn't go flat. Reminds me of my tempurpedic mattress. Gell foam top layer rocks. Nice cover fabric, both print and durability. Not the typical eggcrate foam nonsense you see that condenses into nothing but they claim to be memoryfoam. Happy high expectation buyer. I expect quality to exceed the price and they met that. Hard to find these days.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul H.",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Great quality bed, wondering if my dogs are allergic to foam inside.",
      "text": "Great quality bed, easy to wash with waterproof cover as well. My concern is that I think my dogs might be allergic to the foam inside. Shortly after ordering this bed they both developed severe allergies on the belly side of their bodies. Stomach, paws, chest, etc. wondering if anyone else has had a similar problem. Not sure if it's the bed but it's the only change they've had.",
      "rating": 5.0,
      "verified": true,
      "author": "AV",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Great Dog Bed",
      "text": "I love that fact that if one of my four dogs pees a n the bed it’s not a whole bed I have to cram in the washers just the cover the firmness is great to keep old bones off my a stone floor. I think I need another one in my family room",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa A. Kadolph",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "A Great Bed",
      "text": "This bed gives my 85lb. Golden Retriever excellent support. I wish now this I had bought the larger size and sometime in the future it will be purchased. This bed is worth every penny you will spend on your best friend's comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel A.",
      "helpful_votes": 2,
      "publication_date": 20160813
    },
    {
      "title": "AMAZING dog bed, not true to color.",
      "text": "I ordered the large green bed with dog silhouettes on it. The green is slightly darker, which didn’t bother me. However, the silhouettes look white in the pictures online and they are actually a light blue color. Just something to consider if you are picky about the colors. I don’t care because the rest of the bed is such good quality, and I will definitely be buying another one!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Dry and Comfortable. Dog likes it!",
      "text": "My dog stays outside during the day when it is above freezing. Her bed is on a covered porch in the shade with water bowl nearby. This bed has held up well. The cover is waterproof so it doesn't get soggy, yet it is a fabric so it isn't uncomfortably slick plastic. She likes it, I like it and it's holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Sitts",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "and it makes a great quiet corner",
      "text": "Bought this for my toddler classroom as a cushion for the children to lounge on while looking at books. I put some throw pillows and stuffed animals, and it makes a great quiet corner. It has maintained it's shape, and the cover has been washed regularly and still looks good, which is necessary for potty training accidents.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Luxurious quality",
      "text": "It's bug and cushy. The jumbo one is almost big enough for me! My 125-lb monster fits fine with room to spare. Not too mushy, but it is really memory foam. The canvas cover is very high quality and easy to remove. There is also a removable, washable inner cover on the foam pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Elbowupnose",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Great product!",
      "text": "Great product, my dogs love it! I have a dog daycare and the waterproof covering was put to the test when someone peed all over it... I am happy to say that the nice foam insert was perfectly dry!! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy K.",
      "helpful_votes": 2,
      "publication_date": 20161022
    },
    {
      "title": "My dogs love it!",
      "text": "It's a great bed but it came with a red cover instead of the green one that I ordered & I didn't feel like sending it back then waiting for the right one to come",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Dog tested and approved!!",
      "text": "Bought two to replace some older beds we had for our pups. They love these. Super soft but also supportive and the removable cotton cover is easy to wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Great dog bed!",
      "text": "We needed a nice thick big dog bed we could leave outside on our deck. This one is wonderful and the price was reasonable. Super fast shipping as well...",
      "rating": 5.0,
      "verified": true,
      "author": "Mydogsmom",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "I've had this bed for a few months now and my dog really likes it",
      "text": "I've had this bed for a few months now and my dog really likes it. I like how the material doesn't really get as much dog hair stuck on it. So far it seems very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "C Budde",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "great bed",
      "text": "my dog is a 85lb weimer. At 5 yrs old I want to see him keep doing as well as he is doing now. This is one bed he is not laying on the floor. And I got him the medium size and he is very happy with it. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "twitch",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "A wise investment",
      "text": "Awesome!!! Love this bed! My 80 lb Labrador Retriever can sprawl out on this and not sink to the hard floor underneath. We bought this because our dog was flattening her old mattress (the best that Target had to offer) and I once WE went to bed, she would go climb onto the couch, which we didn’t like. This solved the problem- now she also sleeps through the night on her new bed! This is a wise investment. It’s well worth our dog’s comfort for her aging joints and it keeps her off the couch which makes us happy. Good luck!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Daly",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Love it!!!!!",
      "text": "This dog bed is beautifully constructed!!! My husband and I have gone through many, many dog beds and this one is the final stop. If we ever need to buy another dog bed, this is the one to buy!! We definitely recommend this dog bed to any dog lovers!",
      "rating": 5.0,
      "verified": true,
      "author": "Sass",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Not the same product",
      "text": "I had bought this bed previously, but the only thing the same this time was the cover. The actual bed was just cheap batting this time. Not at all comfortable for my 12 year old dog",
      "rating": 2.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "GREAT dog bed",
      "text": "Dogs love this bed and sleep on it daily since purchase. I have cleaned it and it is SUPER EASY to clean the cover and keep nice. It has held up well. THANKS for making a GREAT product. This is one of my best Amazon finds.",
      "rating": 5.0,
      "verified": true,
      "author": "Harvey J. Pike II",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "All the things I was looking for in a dog bed!",
      "text": "When the bed arrived, the cover was in a bag and my first thought was that it would be a struggle to put on. Not at all! The zipper goes around three sides, so it was a breeze. The cover is a nice sturdy material and I love that it is washable. The memory foam is dense and thick. In all honesty, I am a little jealous. This doggie bed is nicer than mine! I got the large and my Great Pyrenees is loving it! Thinking of getting another for my smaller dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "My one complaint about these beds is that the density ...",
      "text": "My one complaint about these beds is that the density is not the same across the sizes...i bought a medium and a large and after unzipping them you can clearly see that there's more \"gel\" in the smaller one.....so my 120 pound Rott mix basically sinks to the ground on the large while my pitbull snores on the medium.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170707
    }
  ],
  "product_meta": {
    "title": "eLuxurySupply Pet Bed - Deluxe Cluster Fiber Filling Pet Beds for Dog and Cats | 100% Cotton Removable Cover | Fully Washable | Small, Medium & Large Pet Beds",
    "description": "Size:Large (36\" x 45\")| Color:Bleeker StreetEBC",
    "rating": 4.4,
    "feature_bullets": [
      "SIZING - With 3 sizes available these pet beds are a perfect fit for all animals small, medium, large and even extra large. Small size measures 22\" x 27\", Medium size measures 27\" x 36\", and Large / XL size measures 36\" x 45\".",
      "REPLACEMENT COVERS - 100% Cotton Cover with Decorative Piping and Covered Zipper | Removable, Pre-Shrunk and Machine Washable | Replacement Covers Can be Purchased Using the Links in the Description Below",
      "PROTECTION - Fully Removable and Machine Washable Top Cover - Hand or machine wash in cold water, Do not bleach, Tumble dry low",
      "EASY CARE - Each bed features a plush, durable, fully removable and washable cover should your puppy or kitty get their bed too dirty. Will not shrink or fade in the wash.",
      "GUARANTEE - We Promise Your Small, Medium or Large Dog Will Absolutely Love Our Luxury Bed | 90 Night Risk-Free Money Back Guarantee | USA Veteran Owned Small Business"
    ],
    "specifications": {
      "Package Dimensions": "24.2 x 21.4 x 8 inches; 8 Pounds",
      "Date First Available": "November 11, 2019",
      "Manufacturer": "ExceptionalSheets",
      "ASIN": "B081BBQ1SF",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Pet Supplies",
      "Beds",
      "Beds & Furniture"
    ],
    "price": ""
  }
}