{
  "website_summaries": [
    {
      "verdict": "Good low-light performance and fast burst mode options in a retro-looking digital camera.",
      "pros": [
        "This mirrorless camera has 20 megapixels of resolution with a 50-megapixel high resolution mode",
        "Includes an electronic viewfinder to frame the scene",
        "Can record up to 10 fps in burst mode",
        "Cool retro look makes this camera a stylish model"
      ],
      "cons": [
        "Higher than average price",
        "Will need to pay extra for interchangeable lenses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stunning",
      "text": "A flexible pro camera. Images are stunning - especially the jpg processing is fabulous. If doing raw files start with Olympus' own Workspace software to get a quality image. Its better than Lightroom for the initial settings. Overall, it's basically as good as the M1 except for continuous auto focus. Feels solid in hand and the controls fall right where they should. The only difficulty is the flexibility in setting this up. There are so many options that you can set it up anyway your like. I especially like the 4 custom settings. Check out Rob Trek's videos on youtube and he can help you make good choices for setup",
      "rating": 5.0,
      "verified": true,
      "author": "granger",
      "helpful_votes": 2,
      "publication_date": 20190914
    },
    {
      "title": "I have 2 complaints I wish the camera shot 4k keeping inline with its contemporaries and the app on the iPhone looses connectivi",
      "text": "This camera is one sexy beast! Honestly speaking this camera may not bring the most bang for the buck, but that being said it has become my go to camera. The camera is intuitive and a pleasure to manipulate. I bought Olympus M. Zuiko Digital ED 12mm f/2.0 Lens to use for family pics and random street shooting and the tandem has really impressed me. I have 2 complaints I wish the camera shot 4k keeping inline with its contemporaries and the app on the iPhone looses connectivity to easily. However, I still rate this camera 5 stars because I just love to use it!",
      "rating": 5.0,
      "verified": true,
      "author": "SoCal local",
      "helpful_votes": 3,
      "publication_date": 20170314
    },
    {
      "title": "Beautiful images, clunky controls",
      "text": "This is a great little camera. I wish some of the knobs were a bit more ergonomically placed. Compared to the EM5 it's not as intuitive or convenient, especially the exposure compensation knob. The WiFi is also just barely functional, and only works about 30% of the time, so it's not as convenient as I had hoped. Still, the larger sensor is a nice upgrade for me and the jpeg processing is pretty sweet directly out of camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Darcy Vasudev",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Excellent camera, excellent used purchase experience",
      "text": "Bought used and still extremely happy with purchase. Camera condition is exactly as noted and of course, who could not love the Pen-F. Such a beauty.",
      "rating": 5.0,
      "verified": true,
      "author": "--LD",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great and simple camera to use!!",
      "text": "I have had many micro four thirds cameras from a Panasonic GX7, Olympus EM-1, and E-PL7 and this one is by far my favorite of the bunch. The articulating screen is nice to turn it around and protect the screen while in bag or even just to leave like that to force me to use the nice viewfinder. I also really like the ability to switch to black and white with the turn of the knob on the front of the camera. Overall this camera is just well thought out and makes it easier to switch modes without really thinking too much or fumbling through menus.",
      "rating": 5.0,
      "verified": true,
      "author": "gadgetman",
      "helpful_votes": 10,
      "publication_date": 20160926
    },
    {
      "title": "Beautiful camera!",
      "text": "Beautiful camera that helps me take amazing images. Don't let the haters of this model persuade your decision.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Ferguson",
      "helpful_votes": 5,
      "publication_date": 20170131
    },
    {
      "title": "Five Stars",
      "text": "Great camera for travel. isn't too heavy or bulky and takes great photos.",
      "rating": 5.0,
      "verified": true,
      "author": "CRD",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Perfect small camera",
      "text": "Absolutely loving this camera. Small light weight and with image quality that rivers the much larger cameras. Fantastic and classy build that is a head turner.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Breedlove",
      "helpful_votes": 2,
      "publication_date": 20161203
    },
    {
      "title": "I love this camera",
      "text": "I love this camera! Coming from the OMD EM5, the form factor of this camera is perfect for me. Compact, ultra fast focus, fantastic IQ. Long lenses aren't a problem. The 5 axis stabilization really works well. Highly recommended! [...]",
      "rating": 5.0,
      "verified": true,
      "author": "Ryffranck",
      "helpful_votes": 4,
      "publication_date": 20160425
    },
    {
      "title": "Double check the camera model.",
      "text": "Double check the camera model in the box. I recieved the Olympus E-P5 in the Pen F box. When I realized it, I was outside of my return window. Ended up paying $1000 for a $500 camera.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "First Serious Camera",
      "text": "I bought this bad boy as my first \"serious\" camera and took some unbelievable photos when paired with my 25mm Olympus lens! I have absolutely no regrets!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "the buttons as default settings are good enough for EZ use",
      "text": "this is the right one to fit my outdoor walk, the buttons as default settings are good enough for EZ use, also the size fits to my hands.",
      "rating": 5.0,
      "verified": true,
      "author": "ycon",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Fantastic 4/3 camera. Highly recommended.",
      "text": "This is a wonderful machine. Love, love love it. Looks great, works with precision.",
      "rating": 5.0,
      "verified": true,
      "author": "ArtIsImportant",
      "helpful_votes": 2,
      "publication_date": 20170201
    },
    {
      "title": "Olympus PEN-F",
      "text": "Thank you, the goods received good quality and packaging. I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Boris",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "One of the best 4/3rds body’s out there",
      "text": "If you loved old film cameras but wanted digital, this is the body to get. It lets you shoot like an old film body with excellent digital files.",
      "rating": 5.0,
      "verified": true,
      "author": "SEAN FLOEGEL",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Love the Pen F.",
      "text": "Such a small package yet it has all the best features. Love this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "TLavine",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "100% ARTSY – 0% FARTSY",
      "text": "The perfect fit for spontaneous artistic snaps and street photography + a great blend of customizable controls right at your fingertips. The layout and design are thoughtful and rock-solid. Unquestionably the best street camera I've ever used (and I'm gray enough to have used the original Pen-F if that says anything). A lot of manufactures have created cameras mimicking the body styles of this era, but with shortcomings in functionality or image quality. Not this one. This little gem is the real deal. Paired with any of the holy trinity of micro 4/3 and it sings.",
      "rating": 5.0,
      "verified": true,
      "author": "J Silvera",
      "helpful_votes": 14,
      "publication_date": 20160421
    },
    {
      "title": "Love it!!!",
      "text": "I simply love this camera! I actually sold a Canon 5D MKii for this as this format suits my needs better these days. The image quality is excellent and I love all the available features in such a small package. The custom color function feature is a tad silly, but the Monochrome settings look exactly like a Black & White image should. These look great straight out of the camera and need no correction, IMHO. Sure it's pricey but you lose nothing when it comes to complete creative control.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20160316
    },
    {
      "title": "I've always had great experiences with Olympus equipment",
      "text": "Bought this for my wife, she loves it. The wifi connection was a big deal, she can share photos instantly. Loves the design and form factor. I've always had great experiences with Olympus equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "KRB",
      "helpful_votes": 3,
      "publication_date": 20170104
    },
    {
      "title": "Olympus Pen F",
      "text": "Outstanding picture qualities . Menu functions are well laid out. Olympus kit includes an external flash. A stunner!! Movable rear viewing screen enhances video mode",
      "rating": 5.0,
      "verified": true,
      "author": "Capt. Ken Smith",
      "helpful_votes": 2,
      "publication_date": 20160728
    },
    {
      "title": "Picture Perfect!",
      "text": "Love this camera! There are so many features, plan on spending some time figuring them all out, but once you tame it, you're in for some fun times.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Fantastic camera. Very good image and image stabilyzer",
      "text": "Fantastic camera. Very good image and image stabilyzer. Check image quality on websites, comparing with OMD E-m1 and Lumix G9. Small and same image quality as others bigger and bulkier.",
      "rating": 5.0,
      "verified": true,
      "author": "Mauro G. Zeltzer",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "What a great camera.",
      "text": "What a great camera... with the 17mm f1.8 lens it's killer. The b/w filters are a great addition... Olympus has outdone themselves with this beauty. I plan on keeping this for quite sometime.",
      "rating": 5.0,
      "verified": true,
      "author": "Howie Feller",
      "helpful_votes": 5,
      "publication_date": 20160329
    },
    {
      "title": "Five Stars",
      "text": "GREAT RETRO LOOK AND FEATURES, NICE AND HEAVY, GREAT ART FILTERS, ANOTHER WINNER FROM OLYMPUS",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny D",
      "helpful_votes": 2,
      "publication_date": 20160530
    },
    {
      "title": "So far so good",
      "text": "So far so good. I just opened the box and it was very well packaged. It comes with battery, charger, USB cable, external flash, pouch for the flash, instructions, CD, camera and camera strap. I'm going to compare it to my older cannon rebel T1i. I'll update you soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Shana",
      "helpful_votes": 4,
      "publication_date": 20170114
    }
  ],
  "product_meta": {
    "title": "Olympus PEN-F (Body-Only) (Silver)",
    "description": "Color:Silver| Style:without kits| Configuration:Camera OnlyThe iconic Olympus PEN-F is ideal for street shooters, as a second camera for studio pros, and for anyone who loves vintage design and photography. It features impeccable craftsmanship, precision controls, and the ability to capture amazing street shots. PEN-F boasts all-metal construction with luxurious metal and leather-grained accents, a magnesium top cover with no visible screws, a beautifully-integrated interactive OLED electronic viewfinder, and an articulating touch-enabled LCD monitor. Advanced sensor technology combined with in-body image stabilization ensures superior resolution and razor-sharp images, even while you or your camera is moving. Best of all, fully customizable in-camera color control shoots photos with old school film quality right before your eyes.",
    "rating": 4.2,
    "feature_bullets": [
      "New 20 Megapixel Live MOS sensor with 50Megapixel High-Res Shot mode",
      "In-body 5-Axis Image Stabilization",
      "2.36 Million-Dot OLED electronic viewfinder",
      "10 frames per second high speed sequential shooting (5 frames per second with AF Tracking)",
      "Creative control dial lets you directly access 4 functions, including Monochrome, Color Profile Controls, and Art Filters"
    ],
    "specifications": {
      "Product Dimensions": "1.5 x 4.9 x 2.8 inches",
      "Item Weight": "14.4 ounces",
      "ASIN": "B01AW10GM8",
      "Item model number": "V204060SU000",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.2 out of 5 stars50 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#137,891 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 27, 2016",
      "Manufacturer": "Olympus"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}