{
  "website_summaries": [
    {
      "verdict": "A lightweight, sleek tablet for a student on the go. Good for keeping in touch with family and friends, entertainment, and games.",
      "pros": [
        "Has a 7-inch display screen and 8GB of storage space with an SD slot for memory expansion",
        "Boasts an impressive 9 hours of battery life per charge",
        "We love its lightweight and thin design for convenient mobility"
      ],
      "cons": [
        "Doesn't have a front-facing camera"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stopped working in 3 months...",
      "text": "Good tablet while it worked. I bought this for my son as a Christmas present. All he used it for was YouTube and games. It stopped working in 3 months. Luckily Samsung has a year warranty.",
      "rating": 4.0,
      "verified": true,
      "author": "William Killman",
      "helpful_votes": 162,
      "publication_date": 20170328
    },
    {
      "title": "Very user friendly tablet",
      "text": "Bought to replace my daughter's outdated tablet. Pretty easy to use she is 5 and she was able to get it up and running herself. Very user friendly, the battery can last all day while playing youtube nonstop. A fully charged battery with the tablet not being used lasted two days so I thought that was pretty neat. Perfect for using her apps and games she was very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb C.",
      "helpful_votes": 182,
      "publication_date": 20170216
    },
    {
      "title": "Works great, but incompatible with Hulu!?",
      "text": "I've had a Samsung Tab 3 for years but it's slowed down tremendously. It was time for a new tablet. I watched this one for months and finally managed to get it, a case, and tempered glass screen protector all for abour $100. Score!!! It works the same as the old one I had and serves the purposed I bought it for *my young daughter.* I am only disappointed that I can not download Hulu *this version is not compatible with your device*. This is extremely frustrating. I've got Hulu on my Samsung phones and Amazon tablets, why won't it work here!? I've been able to download quite a few other streeaming and network apps w/out issue...but no Hulu. Smh.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20180401
    },
    {
      "title": "Android 4.4",
      "text": "This only had Android 4.4 and can not be updated. Not everything can be run.",
      "rating": 3.0,
      "verified": true,
      "author": "mhubel",
      "helpful_votes": 66,
      "publication_date": 20170429
    },
    {
      "title": "Works",
      "text": "This works for what I need it for. I'm a little disappointed to discover the software is too old to support the current version of Hulu's app, but otherwise no complaints. I bought as a last minute purchase before a road trip to download videos for my son to watch in the car. Worked great for what I needed. Now we can use it around the house. My son can use it to call me throughout the day via Hangouts. Not top of the line, but worked for my needs.",
      "rating": 4.0,
      "verified": true,
      "author": "EBeautySue",
      "helpful_votes": 12,
      "publication_date": 20180425
    },
    {
      "title": "no upgrade support past 4.4.4",
      "text": "This is an old old version of android that cannot be upgraded. I don't know why this is still for sale. More apps drop support for older versions as time goes on. There does not seem to be any indication that Samsung will continue to support older devices to upgrade past v 4.4.4. I regret purchasiing, but will keep it since I got at a very low price. (~$70)",
      "rating": 1.0,
      "verified": true,
      "author": "Larry Jones",
      "helpful_votes": 18,
      "publication_date": 20171225
    },
    {
      "title": "Battery hazard on Samsung Tablet",
      "text": "WARNING. I have 2 of these tablets that are about 17 months old. Today the first one burst open under the pressure of the battery swelling inside. I had not realized that the back plastic case had been slowly expanding. When I looked at the second one I could see that it was also swelling but has not yet burst open. Catastrophic failure at 17 months? I won't be buying another Samsung product. It seems they continue to have problems with their batteries.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim M",
      "helpful_votes": 18,
      "publication_date": 20180305
    },
    {
      "title": "Love the little gadget",
      "text": "I had one stolen and had to replace it. It's fast enough, battery life is fine and just the right size for watching video on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Kentucky J.C.",
      "helpful_votes": 13,
      "publication_date": 20170508
    },
    {
      "title": "great!!!!!!!! especially for travelling",
      "text": "-bought it for kids use mostly, great product especially for airplanes travel as the size is allowed on the airlines for carry on. --lightweight, compact. -Love the fact that unlike ipad, i did not have to set up credit card to use the tablet so if gets lost in planes/travel- no worries. -love the samsung keyboard much better than ipad. dont have to keep hitting number tab to switch between alphabest and numbers. -good wifi capability. -my kids do math apps, reading apps, games, netflix, google surfing. -one can create multiple accounts for home page. I have one that's set for kids so doesn't allow any adult content in any of the above they do.",
      "rating": 5.0,
      "verified": true,
      "author": "sp",
      "helpful_votes": 3,
      "publication_date": 20171031
    },
    {
      "title": "Stream movies and read books this tablet does it all",
      "text": "This tablet is awesome! I was deciding between a kindle tablet, this or an ereader and chose this tablet. I am happy with my choice! The tablet allows me to stream movies, play games and read for several hours without needing to recharge. I can watch about 6-8 hours of media before needing to recharge it. The tablet is compatible with any micro SD card, so download all your content and bring it along with you on the go. I got a 64 gb flash drive and I should have gotten 1 bigger. That only held 11 seasons of TV.",
      "rating": 5.0,
      "verified": true,
      "author": "The Fair Critic",
      "helpful_votes": 4,
      "publication_date": 20170912
    },
    {
      "title": "Highly recommend.",
      "text": "I bought this more my mother in law as a Christmas present and she loved it. She wanted a tablet with expandable memory because her fire tablet did not allow that. She is happy with it, including the accessory kit that Amazon also offered as an add on. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20161228
    },
    {
      "title": "Pocket fun for pocket change.",
      "text": "I got this for a 5 year-old girl and she uses it mainly for watching movies and YouTube. It can be a little slow, but just for viewing the web and replying to e-mails, this it the perfect budget companion that can run a nifty group of apps. The rear cameras are what they are. Don't expect anything of the S series or Note series quality of pictures from this thing. This is a cheapo. But treat it right and it could last quite a while. I use it occasionally just to browse some websites and it does well doing that. Don't use this for anything professional.",
      "rating": 4.0,
      "verified": true,
      "author": "Gabriel V. ",
      "helpful_votes": 2,
      "publication_date": 20180321
    },
    {
      "title": "Remember that there is no firmware update for this device",
      "text": "Bought this for my 8 year old. She likes it, but I wish I had researched a little more. There's no way to upgrade this device to lollipop or marshmallow, so some apps simply won't be available for her to download and play. Oh well. Still a good deal.",
      "rating": 4.0,
      "verified": true,
      "author": "SarahG",
      "helpful_votes": 4,
      "publication_date": 20171211
    },
    {
      "title": "Replaced Amazon Fire",
      "text": "Beats the heck out of those crappy, cheap Amazon Fire tablets. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "DrewManChu",
      "helpful_votes": 9,
      "publication_date": 20171025
    },
    {
      "title": "Love these.",
      "text": "My kids have owned these for a year and a half and they still work amazingly. They are just now starting the get a bit slow and freeze sometimes so I think I'm going to wipe them and redownload everything for them. I love these tablets! We added a glass screen protector and nice rubber case and they've never cracked or anything! Plenty of storage space and if I remember correctly we added extra SD storage! Only downside is no front camera so I may upgrade them soon so they can video chat with family easier. I will always be a fan of Galaxy products.",
      "rating": 5.0,
      "verified": true,
      "author": "ffk",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "BEST PART, is using it as an EREADER, making heavy novels, a thing of the past. A great product.",
      "text": "Does not replace a PC, but for doing minimal things, like checking your email before you close it, it's great. But even if I have aged a bit, I still love reading, and that is usually what I do before bed time. Authors I enjoy, like Stephen King, simply have many words that create their books, making them heavier to hold, as I aged, and this Samsung, is a blessing for it's ebook potential, making real books, a thing of the past, and reading great literature, a very convenient adventure. Worth the price, no doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "Cestmoila",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Great Tablet For My Kid",
      "text": "We got this tablet for my son a few years ago and it honestly has been a great tablet for him through age 5 through 9. This tablet is a thick plastic and doesn't break so easy from our experience. My kid has a tendency to be clumsy and throw the thing from time to time, and it has never gotten cracked or chipped -- until now. He dropped it right on the cement face down. But still, I've been extremely pleased with the sturdiness of it. We've had it for years! Now that he is older he can't do everything he wants and it is time for an upgrade. This little Samsung definitely beats a Kindle anyday.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Happy with this purchase",
      "text": "I ordered this Samsung 7\" tablet after my Samsung 10\" stopped working after 5 years. I opted to get the smaller size this time and I'm glad I did for ease of portability and use. I've been happy with Samsung products (I also have a Samsung Galaxy S5 phone). This tablet (WiFi only) is great for my needs as an alternate device to use when the battery is low on my smart phone and needs to be recharged. I like the Samsung layout and so far it's been a reliable device for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine E. Hayes",
      "helpful_votes": 5,
      "publication_date": 20171019
    },
    {
      "title": "An ok tablet for kids.  Do not buy this for an adult the slow performance will drive you bonkers!",
      "text": "An ok tablet for kids. Do not buy this for an adult the slow performance will drive you bonkers! The wifi nic card in this is spotty and the battery is ok but easily worn down within 2 hours!",
      "rating": 3.0,
      "verified": true,
      "author": "Sarg8908",
      "helpful_votes": 3,
      "publication_date": 20180125
    },
    {
      "title": "excellent",
      "text": "excellent beast. worth the extra money over the kindle to be able to run google play stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus Twin",
      "helpful_votes": 5,
      "publication_date": 20170813
    },
    {
      "title": "Disappointing for a Samsung Tablet",
      "text": "I'm almost never disappointed in Samsung products, but I am with this one. No 5G antennae; only 2.4G. Within a year or so, already had trouble running a few apps. Playing video often resulted in issues. Build is decent. Screen quality is not there. Need to have it at just the right angle to view it. It was relatively inexpensive, but I guess I now know why. This tablet taught me a lesson that not all Samsung tablets are good, AND that cheap tablets could mean owning a product that is relatively useless.",
      "rating": 2.0,
      "verified": true,
      "author": "brs",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "This product has a well known issue with the charging ...",
      "text": "This product has a well known issue with the charging system/battery (all over the internet). Apparently with the firmware. Samsung refuses to acknowledge this. In addition, I have spent over 4 hours with multiple customer service personnel (most of whom have a hard time understanding and speaking standard English without an accent) trying to get a 4 month old tablet repaired under warranty. I purchased the unit directly though Samsung's website, but yet they currently seem to be unable to \"validate\" a receipt).",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170404
    },
    {
      "title": "Poor viewing angle",
      "text": "Poor viewing angle, grainy screen, and slow processor. You can't beat the price on this, but the quality matches the price. This is a bare bones tablet. If you tilt the screen up or down, it gets very dark or light. Operating it feels sluggish. Probably ok for kids.",
      "rating": 3.0,
      "verified": true,
      "author": "PianoBrad",
      "helpful_votes": 5,
      "publication_date": 20170804
    },
    {
      "title": "A very good purchase for us",
      "text": "We bought this so that we could play games on it and not tie up the computers. It is getting used all the time. We take it everywhere. A very good purchase for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170917
    },
    {
      "title": "Out of date OS on new device",
      "text": "Can't upgrade past KitKat (circa 2013, no longer supported by Google). We've only been using it a few days and it works for browsing and youtube and stuff like that for now. However, we cannot install various apps due to the OS being so out of date. I contacted Samsung and they confirmed there is no update. It would be nice if the product description clearly stated that the OS is no longer supported and you might not be able to install some favorite apps.",
      "rating": 2.0,
      "verified": true,
      "author": "Carrie R.",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "One was purchased over a year ago and still works great.!",
      "text": "Purchased this tablet twice now. One was purchased over a year ago and still works great.!! But we just ordered one for my son for Christmas that he just opened on Christmas day and the screen keeps blacking out, whiting out, and keeps freezing up. Not sure what the issue is but I'll be returning the item and purchasing another elsewhere, really sucks cause my son loves it.! But hopefully the next one will work.",
      "rating": 1.0,
      "verified": true,
      "author": "dustin wiley",
      "helpful_votes": 5,
      "publication_date": 20171226
    },
    {
      "title": "Mom Is Happy",
      "text": "Bought this for my Mom and she's always on it. Great cause it's not too small or not to big. Just like Goldilocks and the three bears.. Just perfect. She gets to play on her apps (which has a rather large selection to chose from ) and she's happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "liz phil",
      "helpful_votes": 2,
      "publication_date": 20171210
    },
    {
      "title": "Outdated software, beware!",
      "text": "This tablet runs on outdated software and is not compatible with many current apps. There is no way to update it. I am very confused why these are still being manufactured and sold if the software is incompatible with current apps. Very disappointed as I had bought it to replace an old outdated iPad.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle King",
      "helpful_votes": 2,
      "publication_date": 20181207
    },
    {
      "title": "It runs all of the apps that I need it ...",
      "text": "It runs all of the apps that I need it to run, but it is slow. My Samsung Galaxy S7 runs circles around it in terms of loading speeds and response (both running on the same WiFi).",
      "rating": 3.0,
      "verified": true,
      "author": "InhaleExhale",
      "helpful_votes": 4,
      "publication_date": 20171007
    },
    {
      "title": "I recommend!",
      "text": "I have this tablet for 4 months, and it's still great. I enjoy this tablet, and looks just as great as day 1.",
      "rating": 5.0,
      "verified": true,
      "author": "FiAtPortland",
      "helpful_votes": 2,
      "publication_date": 20171226
    },
    {
      "title": "Wonderful tablet and holds a lot of apps",
      "text": "Bought for my 7 year old daughter after I broke her nabi tablet trying to disable the parent login feature. She loves this samsung tablet and plays games on it everyday. She also watches kid youtube videos on it. She downloads all her favorite kid games on it. Very happy with this purchase. She really loves her tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer3",
      "helpful_votes": 2,
      "publication_date": 20171011
    },
    {
      "title": "Complete junk",
      "text": "This was a great budget pick in my head but that went out the window once I switched the tablet on. There is something off about the screen which gives me the sense of parallax or blurriness every time I look at it. There is also no 5GHz Wifi capability which seems really archaic in today's day and age. One of the tablets seem to need to be constantly manually reset as well. Buy something else!",
      "rating": 1.0,
      "verified": true,
      "author": "DD13",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Great value, just don't have high expectations",
      "text": "Good value for gaming, casual web browsing. I bought this so I wouldn't always be drainin my phone battery, for uner $100, it does it's job well. Don't buy this expecting a powerful tablet, especially when this only has 8 GB of storage. The screen sensitivity is pretty weak compared to others. I wish the fast chargers from the Galaxy phones worked for this, but it charges at the same speed no matter what.",
      "rating": 3.0,
      "verified": true,
      "author": "Consumer 2382",
      "helpful_votes": 10,
      "publication_date": 20180120
    },
    {
      "title": "Minimal storage. More of a base tablet for moderate use.",
      "text": "I bought this to replace a Verizon \"freebie' and I'm definitely satisfied wi5h my purchase. I use it mainly for Kendle, Nook Netflix, Pandora and a couple of on line games. In general it has moderate storage. The more you add the slower your navigation speed becomes but again I did not purchase it for internet browsing or social media sights. It's more of a book / radio for me and it handles these options perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Perfect for the kids",
      "text": "Got it on sale and perfect for my kids, without breaking the bank. Screen display is very good. Interface is consistent Android version. The only issue is RAM management since the kids don't think about performance. Wifi has been solid, no loss connections in the house. White version is a nice change from all the black ones out there. Wide array of cases, screen protectors, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Leland CTop Contributor: Photography",
      "helpful_votes": 2,
      "publication_date": 20171104
    },
    {
      "title": "Poor quality",
      "text": "The touch screen enlarges when you double tap, such as playing a game and then will not downsize. Also when playing a game or browsing it gets VERY hot!. I am very disappointed with my purchase . It is too bad Amazon or Samsung sells inferior tablets and they don't stand behind the product. It has not been abused by children, as I am in my early 60's and just used it to relax. I will buy local Now. I Have Heard That Amazon sells \"black market\" items And I Now Believe it. The previous Samsung tablet had major issues also.",
      "rating": 1.0,
      "verified": true,
      "author": "robin e rose",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Web browsing is too much work for this thing....",
      "text": "This tablet is so low quality that even just browsing the web is too much for it. It charges slowly too and basically needs to always be charging. Ultimately, even with rare usage the tablet only lasted about a year before it just didn't work at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Just choose kindness",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "great for 3 years old",
      "text": "I like this tablet it is durable and great for 3 year old kid. He loves it.It is good quality and not slow like some kids tablets. The storage is not a lot, its ok coz you can insert an sd Overall I recommend this tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "Fhaidar",
      "helpful_votes": 13,
      "publication_date": 20171118
    },
    {
      "title": "Piece of garbage. No support or help for device that won't turn on.",
      "text": "Super upset. This was a bday present and was given Feb 24th altho it was ordered in October. So it's been in use now only 4 months and it won't turn on. Tried all of the troubleshooting and still doesn't work. No support help or return /exchange available. Ugh. I won't ever buy Samsung again !!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "OS borked.",
      "text": "The OS borked within a month after receiving it. It looked like the screen was cracked, even though the physical screen was unharmed. Amazon Customer Service gets five stars. They were awesome. We were able to send the tablet back no problems.",
      "rating": 1.0,
      "verified": true,
      "author": "Yoko Raven",
      "helpful_votes": 3,
      "publication_date": 20171028
    },
    {
      "title": "Great tablet!",
      "text": "Been wanting a samsung tablet for a while so I decided to purchase this one since it was $70. This will be my 4 year old's Christmas present and it works great so far! I added a 32 GB micro sd card and no problems at all. Make sure to buy a cover for it. Good quality, has decent weight, speaker could be louder and have better sound quality but I think my daughter will love it! I'm debating whether I should buy one for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarahi C",
      "helpful_votes": 2,
      "publication_date": 20171206
    },
    {
      "title": "Battery died after 14 months",
      "text": "This was by far the best cheap tablet I’ve come across, but after about 14 months the battery stopped holding a charge. I can’t even use it while plugged into the wall anymore. I contacted Samsung’s customer support, but they only cover devices up to a year, so it looks like this model has an extremely short shelf life.",
      "rating": 3.0,
      "verified": true,
      "author": "KTM",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Not worth it",
      "text": "The device was recommeneded as in great shape with no damage. As we can see from the photos its cracked on the edges of the tablet. And scratched on the screen and back of it as well. It takes forever to charge. So the charger and wall unit are NO samsung OEM. Not worth it at all.",
      "rating": 2.0,
      "verified": true,
      "author": "greengirl82",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Nice tablet for an older OS",
      "text": "Never owned a Samsung before, but I seriously like this little tablet! It simply feels good in my hand, light enough that it doesn't tire my hand to hold it for long hours of gaming. The only problem with it is that it's running a VERY old version of Android, but hey, knew that when I bought it, and the games I'm using it for support 4.4, so it's all good! Definitely a good purchase",
      "rating": 5.0,
      "verified": true,
      "author": "I.R.Stamper",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great tablet! 5 year old approved!",
      "text": "I bought this for my 5 year old because he watches YouTube videos like his life depends on it. This tablet was easy to set up (less than 10 minutes). and the battery lasts quite a long time 5 hrs at least of non-stop videos. The screen looks great. I used a tempered glass screen protector for it. We also purchased a child friendly case (because our 5 year drops things like he's paid to do so LOL). Overall, it's a great little tablet. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "ReviewMama",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "This little tablet is just so durable",
      "text": "My recent purchase is a replacement for the one my gran daughter has owned for about 3 years. With a birthday coming up I thought of getting her a new one. Based on the experience with the current defaced one which has been through all the mishaps that a small child could put a tablet through I didn't hesitate to repurchase the same Samsung Galaxy E lite 7.",
      "rating": 5.0,
      "verified": true,
      "author": "Ping",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Their grandmother had to threaten to take it away from her because she and her sister were so in love with it",
      "text": "Purchased this tablet for my niece. She has not put it down since. Their grandmother had to threaten to take it away from her because she and her sister were so in love with it, and all the apps and features. I have an ipad and I loved the tablet that I purchased for my husband so much that it took me 3 months to start using my Ipad. I still rarely if ever pick up the Ipad before the galaxy tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "LaShawn Faison",
      "helpful_votes": 7,
      "publication_date": 20170201
    },
    {
      "title": "Good for casual users",
      "text": "This is a entry level tablet. Perfect for kids to play some games and maybe watch some cartoons. Battery life was descent not going to last you a whole day but easily last 4to 6 hours. Depending if you have a good unit. Picture quality was bad, low and don't expect Amoled like colors or definition. Is a cheap product. Was light weight, wasn't too fast while loading apps.",
      "rating": 3.0,
      "verified": true,
      "author": "David Cuevas",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Great tablet, love the size",
      "text": "I bought 2 of these, one for each of my kids ( they are 7 & 5). They have been using them for almost a year. It is the perfect size for kids. And I love that I can throw it in my purse. It is fast, and streams Netflix and VUDU very well.",
      "rating": 5.0,
      "verified": true,
      "author": "mama of 2",
      "helpful_votes": 13,
      "publication_date": 20170514
    },
    {
      "title": "Not a quality tablet",
      "text": "Wouldn’t turn on after only a few months of use. When it did work. It was very slow and laggy.",
      "rating": 1.0,
      "verified": true,
      "author": "DKS",
      "helpful_votes": 2,
      "publication_date": 20180309
    },
    {
      "title": "Perfect budget tablet",
      "text": "Perfect budget tablet. Runs all my apps fine. You will likely need to expand the storage if you want to save any videos or pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 4,
      "publication_date": 20170926
    },
    {
      "title": "Good for kids",
      "text": "My son enjoys watching YouTube and playing games on this tablet. He had a Samsung prior, this screen is smaller on this one but nevertheless he still likes it. Picture quality isn't the best but he rarely uses the camera. Video quality is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Copeland",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "I have recommended this tablet to others.",
      "text": "this tablet was very easy to set up and I am in love with it. The screen viewing is crisp and bright. I already knew that Samsung makes a great tablet as I bought one (kids version) 2 years ago for my granddaughter and it is still going strong. Since then my other two granddaughters have gotten Samsung tablets and love them. The battery lasts as long as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "gail pocsik",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Nice tablet!",
      "text": "This tablet works great in wi-fi. I purchased it to be able to access drop box for my ukulele music and read kindle books. If fulfills both needs and really holds a charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Bee",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Beautiful, sleek, this is a GREAT tablet",
      "text": "I have a Samsung galaxy Tab and decided to get my husband one for Christmas. I turned it on long enough to make sure it turns on and connects to WiFi (due to the reviews). It's beautiful. Packaging had bubblewrap in it to keep it secure, box was a smidgen big but that's okay. Connects to WiFi and touch is flawless.",
      "rating": 5.0,
      "verified": true,
      "author": "Hello, I'm just here to review",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Old Version of Android that cannot be upgraded",
      "text": "Nice unit for the price, my only complaint is the Android operating is an old version and will not accept the app for Echo Alexa. I tried to upgrade to a newer version of Android, and could not",
      "rating": 4.0,
      "verified": true,
      "author": "Frank S",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "only complaint is that it charges a little slower than ...",
      "text": "only complaint is that it charges a little slower than our other devices. I bought it to replace my grandaughters ipad. she likes it just as well, but at 1/4 the price. Same games, apps work, very rarely crashes.",
      "rating": 4.0,
      "verified": true,
      "author": "rebekah harvey",
      "helpful_votes": 2,
      "publication_date": 20180211
    },
    {
      "title": "Cool Tablet for Light Usage",
      "text": "I use this mainly as a wall mounted tablet to control my smart lights and view my front entrance via my Skybell HD app. Battery life is great under these conditions and under more strenuous app usage the tablet stands up well. I havent tried any games on it but everything else is super smooth.",
      "rating": 4.0,
      "verified": true,
      "author": "James Purefoy Jr",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "the pixels were terrible.",
      "text": "Purchased for the upgrade from 4.2.2. This 4.4 has trouble with certain apps (i.e JW Library). Regarding this specific app, it would only allow 3 videos (3-5 minute videos) to be downloaded from the cloud. Any more and the videos would not play. Plus, the pixels were terrible.",
      "rating": 2.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Good buy",
      "text": "Love this tablet. It stays charged for a pretty long time!",
      "rating": 5.0,
      "verified": true,
      "author": "lindsay",
      "helpful_votes": 6,
      "publication_date": 20170418
    },
    {
      "title": "Great for kids",
      "text": "Great inexpensive tablet for kids i bought this tablet on sale on amazon for 69.99 if you can get it for under 100 its worth it. over 100$ its not.but it functions very good with wifi .",
      "rating": 5.0,
      "verified": true,
      "author": "Wilton mendoza",
      "helpful_votes": 2,
      "publication_date": 20170207
    },
    {
      "title": "Five Stars",
      "text": "Bought for my grand. Only problem was we weren't able to put parental controls on the device.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronne42",
      "helpful_votes": 2,
      "publication_date": 20170826
    },
    {
      "title": "Ehhhh maybe raise your budget a bit more",
      "text": "This model seems to be on the slow side even for what I expected put of the price. The Bluetooth has to be reconnected multiple times on occasion to continue using it.",
      "rating": 3.0,
      "verified": true,
      "author": "CraftyDM",
      "helpful_votes": 2,
      "publication_date": 20170509
    },
    {
      "title": "Good tablet",
      "text": "Everyone in the house has one of these tablets. They're great for browsing the interwebs or playing games. I'd buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian M.",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Good value for good product",
      "text": "This is my second Samsung tablet. It's small which I knew but fits my needs. I'm a fan of and user of Samsung products.",
      "rating": 5.0,
      "verified": true,
      "author": "USmapleleaf",
      "helpful_votes": 5,
      "publication_date": 20170605
    },
    {
      "title": "but we tried it out and downloaded her apps already and it's perfect, very small screen but great",
      "text": "Got this for our four year old for her fifth birthday and she hasn't used it yet, her birthday isn't for a couple more weeks, but we tried it out and downloaded her apps already and it's perfect, very small screen but great quality",
      "rating": 5.0,
      "verified": true,
      "author": "eric huddleston",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "ages 4 and 9 they both love",
      "text": "Bought 2, for both of my son's, ages 4 and 9 they both love them",
      "rating": 5.0,
      "verified": true,
      "author": "brittany",
      "helpful_votes": 3,
      "publication_date": 20170513
    },
    {
      "title": "Samsung Galaxy tablet e lite t113",
      "text": "Love this tablet. Easy to use and is perfect for my needs. Only thing is no front camera so can't use Skype but I didn't read complete specifications for product. Otherwise perfect size to read my Kindle app and to use Facebook and read my emails. Superior quality product Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Refurbished/like new",
      "text": "I purchased it refurbished for my mother who likes to browse the internet and she loves it. It has held up and has had no issues for a year now. I could not be happier with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20171128
    },
    {
      "title": "Several of my family members have bought this product and all love it, so I can guarantee we will be ...",
      "text": "Bought this as a random gift for my mom and she loves it. Several of my family members have bought this product and all love it, so I can guarantee we will be buying more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Tashi Marie",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "SATISFIED and HAPPY",
      "text": "This is a great TABLET. Easy to understand and operate. I love it. It was delivered in proper time as promised.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper59",
      "helpful_votes": 4,
      "publication_date": 20170529
    },
    {
      "title": "Well worth the price.",
      "text": "I've had this since before Christmas and bought it to replace an 'aging' Asus A100. I don't have any real complaints other than I will restart it every now and then when apps start having issues (like repeatedly closing). Overall, it's a good bargain (Black Friday) tablet that should serve me well for another couple of years.",
      "rating": 4.0,
      "verified": true,
      "author": "Art101",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Best Tablet!",
      "text": "This tablet is awesome. I got one for my daughter several years ago and it’s still going! So I got this one for my mom to replace her crappy RCA cheap tablet that hardly worked and she is in love! One of the best tablets out there next to iPad and kindle.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Call",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Awesome tablet!",
      "text": "This Is in my opinion one of the best tablets out there. Its size is perfect for viewing size is perfect to carry in your purse, great speed, holds a good charge and it's SAMSUNG 😊",
      "rating": 5.0,
      "verified": true,
      "author": "angela boleman",
      "helpful_votes": 2,
      "publication_date": 20171221
    },
    {
      "title": "nice",
      "text": "very nice tablet for what it is, no problems with it, should have waited Costco has tabA-8\" for $129.00 with case, but I like the 7 \" much easier to conceal,",
      "rating": 5.0,
      "verified": true,
      "author": "james R",
      "helpful_votes": 9,
      "publication_date": 20170604
    },
    {
      "title": "Great value. Plenty of power for basic internet and ...",
      "text": "Great value. Plenty of power for basic internet and task work. Very solid feel.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Miller",
      "helpful_votes": 2,
      "publication_date": 20171203
    },
    {
      "title": "Great tablet for the price",
      "text": "Great tablet for the price. I am not sure what you get with a more expensive model. This one works fine. Also the Android system is much better than the Kindle Fire OS. The Kindle Fire I have for my kid is very akward to use and it is too easy to accidentally \"buy\" some app or book.",
      "rating": 5.0,
      "verified": true,
      "author": "Regular Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Good tablet for the price you pay",
      "text": "Better than most Android tablets that's around the same price. Only thing that's a con is the camera pixel....but good for kids. Brought 3 for my kids",
      "rating": 4.0,
      "verified": true,
      "author": "janita w.",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "33 days and completely dead.",
      "text": "It now fails to boot at all. I tried several chargers too. I hope I still have the original boxing...",
      "rating": 1.0,
      "verified": true,
      "author": "Robert C. Putnam",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Nice Tablet",
      "text": "Got this for my Granddaughter for Christmas, she's 9 & she Loves it. My Daughter did set up the paternal controls so she has limited access to what she can see. She likes watching kids on Youtube doing Toy Reviews so she's Happy 😊",
      "rating": 5.0,
      "verified": true,
      "author": "KymKC",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Samsung is all we get.",
      "text": "Would have been better had I read the description. There is no front facing camera. Otherwise, the tablet is great. Still gets 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Mother_of_Jewels",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Excellent Product",
      "text": "One of the best products from Samsung yet...really durable for the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Ogogo",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Worth the purchase!",
      "text": "After my previous tablet, this one is phenomenal. Fast response, decent graphics, good size and weight, perfect amount of storage for my personal use with the option to add a micro SD. The only thing I haven't tried yet was the sound, which again I'm not personally going to use often.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Happy with purchase",
      "text": "This tablet was purchased for my 10 year old. We connected it to our house wi-fi with no issues. My child uses it to watch you tube, play games, and type stuff for school on Microsoft word. We've had this tablet for a few months now and still works awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Phillips",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Device is limited to android 4",
      "text": "Current apps require version 5.0. This is an obsolete device. I purchased a brand new brick.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 2,
      "publication_date": 20180426
    },
    {
      "title": "Cheap but does the job!",
      "text": "I'm an iOS user but had to get an Android device to run a car app. For what it costs, this thing is pretty good. LCD resolution is dated, also kind of slow.. but then again it's only $100. It does the job and I am happy I got it. Loaded a 32gb micro SD card and it is doing great. For stuff I do in the garage this unit is perfect. The screen size is just large enough to watch DIY vids or look at service manuals, the back housing is robust where you can place on your work bench without worrying about a case, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Prime Fanatic",
      "helpful_votes": 13,
      "publication_date": 20170623
    },
    {
      "title": "Love it! I had bought 2 other tablets from ...",
      "text": "Love it! I had bought 2 other tablets from amazon and returned them because they were awful. It wouldn’t read my finger and had a hard time turning the volume up and down. I spent more money on this tablet but it was well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina Yanez",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "very happy",
      "text": "Works great. Replaces a 4 year old Samsung tablet and this one is quicker & gets a stronger signal on wifi.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Couldn't ask for more",
      "text": "Awesome device very quick also had muli screen. This allows you to use 2 apps at once. The battery life is extremely good especially on standby, it could be on for a more than a week or more. My children just love it, they can watch all of their favorite movies & shows. It can even play all of their leaning games!!",
      "rating": 5.0,
      "verified": true,
      "author": "Drum/Turok",
      "helpful_votes": 9,
      "publication_date": 20170512
    },
    {
      "title": "Overall awesome little tablets for the price",
      "text": "I bought 2 of these tablets. 1 had a hard time connecting to wifi untill i got a signal booster. Will be buying 4 more. No flash for rear camera but i guess thats normal for little tablets? I use them for business in my shops for warranty related iems. Overall awesome little tablets for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "zac sheeley",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Easy to use",
      "text": "Very easy to use - especially typing area easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Anne TenWolde",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "GREAT PRICE, GREAT PRODUCT",
      "text": "I'm a huge fan of Samsung!! My kids, 2,3,and 7, use these everyday and it keeps them off my phone LOL. I just connect them all straight to my personal hotspot and they are good to go. I'm extremely happy with the purchase and the price!",
      "rating": 5.0,
      "verified": true,
      "author": "NICOLE ALBERT",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Great tablet!!",
      "text": "Great tablet! Doesn't have a camera on the front but that doesn't bother me. Would definitely buy again and recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Slow and not worth the money or hassle!",
      "text": "Bought this is hopes my kids and husband would have a nice tablet to play games on. This thing is super slow and takes forever to download an app. Very glitchy too! Do Not waste your money. Just received it today and it’s going right back in the box to be returned. I should have known better to buy something other than Apple products.",
      "rating": 1.0,
      "verified": true,
      "author": "Ada Thompson",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Great product",
      "text": "Great product alternative to the expensive iPad. My special needs child broke it before a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Wooten",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "After I restored factory settings it seems to be working just fine! Nice and light weight",
      "text": "Originally my google play store was not working. After I restored factory settings it seems to be working just fine! Nice and light weight! I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Chalye",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Do NOT recommend",
      "text": "After just 6 months this thing is slooooooow. 2 adults using it to watch YOUTUBE occasionally some Twitch too but not much downloaded on it. Get what you pay for....one of the worst purchases I've made, this thing is TRASH",
      "rating": 1.0,
      "verified": true,
      "author": "Saucey",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Great Tablet",
      "text": "Great tablet, works the same as my phone, both has Kit Kat, only neg is I wished I would of gotten a 16 gig model. Even with a 32 gig SD card installed a lot of apps will not move to to the SD.",
      "rating": 5.0,
      "verified": true,
      "author": "James Williams",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Everything working perfect",
      "text": "Everything works good. My toddler is ever so happy (again) as this is her second tablet. The first one went swimming with her in the pool. We'll try not to drown this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Brigitte_Innira",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Great tablet!!!",
      "text": "Product is exactly as described! In good and durable condition. Shipped quickly!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200425
    }
  ],
  "product_meta": {
    "title": "Samsung Galaxy Tab E Lite 7\"; 8 GB Wifi Tablet (Black) SM-T113NYKAXAR",
    "description": "Color:BlackPlay games, browse the Internet, and help your kids learn with the Samsung Galaxy Tab A. This 7-inch tablet features a lightweight design and a long-lasting battery, making it easy to take it anywhere. It offers two cameras for taking photos and videos and a microSD card slot (3) for adding memory. It comes with a built-in radio app and access to many others through Samsung Galaxy Essentials. Camera - Video Streaming,Video Player",
    "rating": 4.2,
    "feature_bullets": [
      "Android 4.4 KitKat, 7 inches Display",
      "Tablet Processor 1.3 GHz",
      "1 GB RAM Memory",
      "0.68 pounds"
    ],
    "specifications": {
      "Standing screen display size": "7 Inches",
      "Screen Resolution": "1024 X 600",
      "Max Screen Resolution": "1024x600 Pixels",
      "Graphics Coprocessor": "1.3 GHz",
      "Card Description": "Integrated",
      "Wireless Type": "802.11abg",
      "Number of USB 2.0 Ports": "1",
      "Average Battery Life (in hours)": "8 Hours",
      "Brand": "SAMSUNG",
      "Series": "Galaxy Tab E Lite",
      "Item model number": "SM-T113NYKAXAR",
      "Hardware Platform": "Android",
      "Operating System": "Android 4.4 KitKat",
      "Item Weight": "10.9 ounces",
      "Product Dimensions": "4.58 x 0.38 x 7.61 inches",
      "Item Dimensions  LxWxH": "4.58 x 0.38 x 7.61 inches",
      "Color": "Black",
      "Rear Webcam Resolution": "2 MP",
      "Processor Brand": "Samsung",
      "Processor Count": "4",
      "Computer Memory Type": "Unknown",
      "Flash Memory Size": "8 GB",
      "Hard Drive Rotational Speed": "1 RPM",
      "Batteries": "1 Lithium Polymer batteries required.",
      "ASIN": "B01AZ8ESMC",
      "Customer Reviews": "4.2 out of 5 stars2,004 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#27,428 in Electronics",
      "Date First Available": "January 23, 2016"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Computers & Tablets",
      "Tablets"
    ],
    "price": ""
  }
}