{
  "website_summaries": [
    {
      "verdict": "If you're looking for an inexpensive option, this model offers good quality in a smaller package.",
      "pros": [
        "Allows for split screen and picture in picture modes",
        "Very good color representation for an inexpensive monitor",
        "Includes a black stabilization mode for gaming in dark scenes",
        "Simple monitor with a limited number of features"
      ],
      "cons": [
        "Smaller monitor than some other options",
        "Limited to 2560 x 1080 resolution"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beautiful Screen but Mac OS users beware!",
      "text": "I bought this screen to connect to a MacBook Pro (Retina, 13-inch, Late 2012) running MacOS 10.13.6. I couldn't get the correct resolution functioning 2560 x 1080 was just not an option in the list. I had to buy additional software (SwitchResX) and disable SIP from the system settings! This isn't a fault with LG but rather Mac doesn't want to have people using unusual monitor resolutions.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 157,
      "publication_date": 20180813
    },
    {
      "title": "Love the split screen!",
      "text": "I love this monitor. I didn't want a big screen for my desk, but wanted to have a monitor that I can easily do split screen. This one is great! Some people mentioned that the split screen doesn't work for windows 10, but it does. I downloaded the software from the product website. I was amazed how quick and easy to change several different ways of screen splits. I love it and this will allow my multi tasking jobs easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Mako",
      "helpful_votes": 34,
      "publication_date": 20170914
    },
    {
      "title": "Like New = Broken",
      "text": "I purchased this monitor in “Used - Like New” condition. It arrived with several noticeable scratches, blemishes, and marks. I was willing to live with that until I went to power the unit on. The screen does not function at all. EXTREMELY disappointed a “Like New” product arrived in completely unusable condition. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike L",
      "helpful_votes": 4,
      "publication_date": 20200320
    },
    {
      "title": "NO SPEAKERS??? REALLY?",
      "text": "As far as the monitor itself goes, it's alright. Not great. But, once I realized that it had no built in speakers, I came to the realization that...it's garbage. I guess I just assumed that in 2020, all monitors came with built in speakers. Apparently not. It would be nice if, in the product description, instead of just omitting this little fact, it said in all caps, something like, oh, I don't know: BUILT-IN SPEAKERS: NO That would be nice. You're welcome.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20200112
    },
    {
      "title": "It's ok",
      "text": "Horrible Power Cord. Who makes a 2ft triple pronged cord that will almost always need an extension cable. Sounds like a small problem but it's a huge pain for a desktop setup, especially with a standup desk. Screen is good though, bright and clear. I like the monitor but blame myself for not reearching more. I assumed you could fit 2 full screen windows split on the monitor since it's so wide. This is not the case. You get one full and another about 30%, so not much different than a normal monitor. I'll give this a week's try but most likely returning. 2 pts off for that crappy cord.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt Frederick",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Best deal for your money! Crisp and beautiful.",
      "text": "Very nice display, good for gaming. Everything is crisp and beautiful on my rx 480 gpu. Some games won't use the full screen, I think it is just an api issue, but it just centers the window. No biggie, still looks awesome. Runs Homefront at 68hz at 70fps. Its fantastic! Great if you do stuff in excel, photoshop, premier, etc where a long screen is handy! The menu options are a pleasure and a breeze to go through with one button that doubles as a power and directional choice button. Cons: it is wide, but short. It may be just an illusion because of the \"frameless\" style, but looks like the height is really small. That is all.",
      "rating": 5.0,
      "verified": true,
      "author": "jay",
      "helpful_votes": 5,
      "publication_date": 20170309
    },
    {
      "title": "I am very disappointed with this and will be requesting a full refund ...",
      "text": "This product stopped working after 7 uses. I even bought new HDMI cables to make sure everything was new. The monitor makes a loud whistling noise and goes back in \"sleep mode\". I am very disappointed with this and will be requesting a full refund from the manufacturer",
      "rating": 1.0,
      "verified": true,
      "author": "Saahil",
      "helpful_votes": 6,
      "publication_date": 20180730
    },
    {
      "title": "Basic ultrawide screen monitor",
      "text": "The unit was purchased for my grandson, he likes it a lot. This was purchased for rendering on Adobe he said it is not perfect but for the price, you can't beat it and for what it is used for it is functional. He also said that he does not game on it, so he cannot give a comment in that area, please forgive the typing errors, the typing skill has a lot to be desired of, and the old eyeballs don't help either. Take care everyone.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles  Abney",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great stand alone monitor",
      "text": "The 25 inch ultrawide monitor by lg is a great stand alone monitor. Lots of easy to learn functionality. I use it with my ps4 pro and Comcast. Because of the extended real estate on the screen I decided to go with a 2 x 1 multiviewer sold separately to display both images from PS4 and Comcast simultaneously side by side. It's basically like two 15 inch 4:3 ratio monitors. For anyone interested in my experience check out my review on the HDMI splitter and the ultrawide with PSVR.",
      "rating": 5.0,
      "verified": true,
      "author": "georgeberry",
      "helpful_votes": 4,
      "publication_date": 20171026
    },
    {
      "title": "Refurbished?",
      "text": "I purchased one of these monitors 6 months ago and loved it. I thought I would increase my productivity by ordering another one. When I received my new one it was in a refurbished box, even had missing screws. Luckily I was able to find some around the house that fit but once I plugged it in, the resolution isn't nearly as good as my first one. What a disapointment!",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 4,
      "publication_date": 20180818
    },
    {
      "title": "Misleading info",
      "text": "THIS IS NOT 75hz. Also, only a headphones jack. No speakers. Does pretty well if all you want is an ultrawide extra monitor for a laptop. I would not recommend this monitor as a gaming monitor or a daily driver. Spend a little more and get something that's 1440 or 144hz. The stand is also not super good. I'd recommend getting a super cheap one you can install onto the monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Harris",
      "helpful_votes": 2,
      "publication_date": 20200820
    },
    {
      "title": "Died after 11 months.",
      "text": "First 8 months was hardly used, moved it to my work computer and was used for 3 months on work days. Suddenly out of no where it stopped displaying, back light was still on, and would hum. Super disappointing I requested a warranty repair and I received a confirmation, but no return shipping label. Very happy I didn't buy that 75'' 4k that was on sale from LG on black Friday. I now know what kind of quality to expect from LG.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Don't buy this one.",
      "text": "This product seems totally defective. I had a repair service once but it didn't work. I was a display device engineer before. A/D board works fine but video input signal loss happened intermittently, which suggests that panel module could be fine. In this case, repair should be easy and the problem should be gone after repair but it didn't. Maybe, it looks like a systematic quality issue. It is hard to say the panel is Okay. You can find the similar feedback here. I wouldn't recommend this product. LG is a good brand but the quality control isn't that great. The price was not so bad for only 1.5 year lifetime. It is your choice.",
      "rating": 1.0,
      "verified": true,
      "author": "Solseung",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Easy to Setup, works good so far, plug awkward to deal with",
      "text": "Pros: Easy to setup. Good Display, good resolution, works well with games I have tried (and the ultra-wide has made working on bills easier) Cons I dislike that the transformer is included in the plug, really hard to place in a power strip next to other items. Would have preferred a more standard transformer with a separate power cord that is better for plugging into power strips. N/A Not enough time to test for longevity Haven't used all the features (I guess the on-screen modifying is for dual inputs? Haven't tested fully) I kept at 4 stars because for the price its tough to beat in terms of ultra-wide monitors.",
      "rating": 4.0,
      "verified": true,
      "author": "Bilgediver",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Lousy sound and multiple-input support",
      "text": "The headphones jack on the back of the screen is very laggy. It takes multiple seconds for it to start playing sound when a new track starts. Also, I have two devices connected to the monitor over HDMI. This frequently causes the monitor to become completely unresponsive (the menu does not work and the display does not turn on). I need to completely unplug one of the devices from the screen, before the screen starts showing images again.",
      "rating": 2.0,
      "verified": true,
      "author": "Stefan Krastanov",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Less than 1 year lifespan",
      "text": "Only buy this monitor if you plan on using it for a year, and then plan on dumping it into the garbage. I bought this monitor as my second screen for my laptop. It lasted just about a year when it started to automatically shutoff after 20-30 minutes of use. The screen only lights up, but does not turn back on. Don't bother calling LG for help either, they will tell you to reset it and then ship it to them (on your dollar) for \"repairs\". Save yourself the headache, and buy a Dell or HP. Not worth the reduced price.",
      "rating": 1.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 2,
      "publication_date": 20190709
    },
    {
      "title": "Using it for 3D drafting",
      "text": "Its great, I got it to help drafting in Revit (3d modeling) and having the ultra wide screen is prefect. It reducing the percentage of screen space taken up by the \"ribbon\" and control panel so the drafting views don't feel cramped. I'm debating getting a second one. When doing tasks other then revit its also really nice because its so wide its like have two monitors and can easily accommodate two app windows next to each other. My only wish is that the refresh rate was higher then 60hz.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Foss",
      "helpful_votes": 3,
      "publication_date": 20170506
    },
    {
      "title": "Recomended",
      "text": "For anyone that's thinking of this. I recommend you buy it. It's a great monitor for the price. 9nly down side is the glossy black finish, it's looks dirty after awhile. And a lot of people say that 25 inches is small for an ultrawide, but it's still a decent size, especially if your close to the monitor. Especially recommended if your starting video editing, programming, ECT. The mate screen cuts out glares, the colors are bright and vibrant,great blacks. Honestly one of my best purchases so far",
      "rating": 5.0,
      "verified": true,
      "author": "John Boehler",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Great for my smart mirror project",
      "text": "This is being used in a smart mirror project with a Raspberry Pi 3B. Unfortunately I didn't have any spare monitors sitting around so this ended up being the most expensive component but was worth it as it fits perfectly if the width or length of your mirror is 24 inches like mine (24x18). I just removed the from bottom portion of the bezel so the screen can lay flat, no need to remove the back. Nice and bright too. Awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Shadynasty",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "using this along side my work laptop -works well",
      "text": "great screen. my laptop couldn't support 4k so this is the next best thing. what i like about the ultrawide is that for an excel spreadsheet you get a lot of extra columns. when not using excel it is like have 1 and a half screens with no break in between. i don't have enough desk real estate to have multiple screens for this laptop. i have 2 other 4k screens for my desktop adjacent to this setup. highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Haz",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "for an artist AND a gamer: Nice",
      "text": "i purchased this monitor specifically for the 99% srgb colorspace because my last two monitors had been terribly skewed to a color or had bad contrast, or would just occasionally turn pink until i restarted my computer. the display is beautiful and the colors and values are accurate. i also never use speakers, so it was fine that this monitor didn't have any. and i finally feel like a real gamer now that i have that 21:9 aspect ratio. i had to download a few mods to play skyrim correctly but that's okay. i like that the stand has a flat base that i can put stuff on, too.",
      "rating": 5.0,
      "verified": true,
      "author": "jasmine",
      "helpful_votes": 2,
      "publication_date": 20180627
    },
    {
      "title": "Loved it until it died in less than a year",
      "text": "Monitor looked great, easy to mount. Worked for everything I needed, until the warranty period ended and the monitor died. The screen goes black and there’s an audible hum. I believe a capacitor on power board has gone bad and since it’s out of warranty I either have to open it and get into printed board repair, scrap the whole thing, or pay god knows how much to have it professionally repaired. Look around at other reviews and you’ll see my issue is not a stand alone incident and seems to happen often. If the monitor doesn’t die on you this is a 4-5 star product.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Great if short and wide is your thing",
      "text": "I guess this is a nice monitor, but it takes some getting used to. I think I was hoping for more height to accommodate the width. So it seems a a bit short and wide. I wanted it as a second monitor, or in hopes of spitting the screen to transfer data to a weekly report. I find myself using it as a second screen and my laptop as a primary. I really considered returning it numerous times, but it’s a good deal.",
      "rating": 4.0,
      "verified": true,
      "author": "amazonjunkie",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Great Display!",
      "text": "refurbished unit: some scratches on the base and back of the screen, but that was to be expected. screen itself is fine, with no scratches or dead pixels. I did notice that the brightness would fluctuate, almost at a heartbeat rate and rhythm. so far it hasn't bothered me. just as other reviewers have stated, the screen does look a bit narrow, but once it's in front of you, it's hard to think that you got by on a smaller screen..",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20171127
    },
    {
      "title": "Poor Reliability",
      "text": "Outstanding monitor. I love the false split screen (Where it acts like two screens for Win 10 side snap) and the picture is great. Not bad for a $160 monitor! Update: I have two of these and this morning while my son was working on the computer he called me and said the computer crashed. Turns out it was the monitor, it's now doing the same thing other reviewers have mentioned where it is \"grey\" (full black and full backlight) and even the osd is unresponsive. Guess it was too good to last.",
      "rating": 2.0,
      "verified": true,
      "author": "CowboyPilot",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Screen Split Software Fail",
      "text": "I was excited about the screen splitting software but I should have known better when the promo video spent more time showing cool dudes talking and on hover boards than how the software actually works. Judging by some of the images, I assumed you could get a full screen view in any of the splits. Nope. Win 10 has splitting built in and this is going back. The software is also odd and looks unprofessional, like a garage build, with no sign of LG electronics, probably 3rd party, \"unknown\" creator on the uninstall. Glad to have it off my machine.",
      "rating": 2.0,
      "verified": true,
      "author": "Jay Williams",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Perfect Size.",
      "text": "I love this Monitor for its size. So far it has been great and I like that it can be mounted on a VESA stand. I used to have the 29\" version of this Monitor which I find it too big as I noticed that I keep on moving my head to glance either left and right which over time can be inconvenient. The resolution is just right for its size. I wish it has a good built-in speaker installed and/or a built-in USB hub. So far so good. And Im happy.",
      "rating": 5.0,
      "verified": true,
      "author": "JOSEF",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Great color and picture! Not to mention the quality!",
      "text": "Oh, man I don't know where to start with this thing. The picture quality is fantastic! The colors are so bright and vivid! Not to mention it's widescreen so it makes game play and internet browsing a seamless experience! It looks so good sitting on my desk ready to take on any application I throw at it! I had originally ordered a Samsung CF398 curved monitor, but honestly this LG monitor is half the price and is wider. I would take this monitor any day of the year!",
      "rating": 5.0,
      "verified": true,
      "author": "Tariq Metwally",
      "helpful_votes": 2,
      "publication_date": 20170504
    },
    {
      "title": "Cheap monitor but it's OK",
      "text": "The software is hokey and while I won't send it back, if I had to do it all over again, I would have made a different choice. It's plug and play as far as viewing is concerned. Getting the features to work is a pain. Since I don't use them or need them it's not a big deal, but if they worked without issue, I would probably find a use for them. If you have the ability, buy something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Sensei",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Works with Mac OS X 10.13.6!",
      "text": "I was a little nervous this monitor wouldn't work with my 2018 13\" MacBook Pro since I read online that people were having issues displaying 2560x1080 with their MacBook without the SwitchResX software. Well, all I used was a HDMI to USB-C cable and everything worked fine. No software. No issued. Great monitor by the way!",
      "rating": 5.0,
      "verified": true,
      "author": "Seth C.",
      "helpful_votes": 11,
      "publication_date": 20180815
    },
    {
      "title": "This is a really really good deal. I wanted an ultrawide for gaming at ...",
      "text": "This is a really really good deal. I wanted an ultrawide for gaming at the cheapest price possible and this fit the bill perfectly. For under $200 you get an 25\" LG IPS display, sleek minimalist design and I was able to get it running at 75hz. 2 negatives with this monitor - No internal speakers, and you cant adjust the screen. I plan on putting this monitor on an arm that allows me to adjust it wherever I want it.",
      "rating": 5.0,
      "verified": true,
      "author": "AA",
      "helpful_votes": 2,
      "publication_date": 20170828
    },
    {
      "title": "Works great!",
      "text": "Worked Great, We needed 2 monitors that were less than 12\" tall for a receptionist desk that had a ledge. we used this in combination withwhich we shortened and achieved exactly what we were looking for. the monitor works great, other than it's difficult to access the control button when it's less than 1/2\" away from the desktop.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Mills",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Great gaming monitor, even bettee side monitor",
      "text": "I used it as a vertical side monitor for reading articles and etc, usually have discord, spotify, and a performance app to see temps and loads on my computers and it's a very crisp image. Definitely worth buying. I have seen and used it for games horizontally and it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Davon",
      "helpful_votes": 2,
      "publication_date": 20191029
    },
    {
      "title": "If you do a lot of timeline editing--this is a winner....",
      "text": "I do a lot of video and audio editing on timelines--this UltraWide IPS monitor is a dream! You can adjust the screen to any brightness and configuration you wish. I could not be happier. The colors are crisp and clean. I can see the IPS screen clearly from any angle. This size of 25 inch is a winner for me. Perfect to get the whole scope of what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Surpassed expectations.....",
      "text": "I have only had it out of the box for about an hour, but it has exceeded my expectations (especially the width). Realizing it is labeled \"Ultra Wide\" I was not completely surprised, but I didn't expect to be able to open multiple spreadsheets at once (at least not 3). Will update later, but very happy so far.",
      "rating": 5.0,
      "verified": true,
      "author": "DPAZ",
      "helpful_votes": 2,
      "publication_date": 20171017
    },
    {
      "title": "Better than expected",
      "text": "The only part of this monitor I didn't like was the oddly flimsy stand, but I replaced that with an adjustable desk mount. Picture quality, color, and brightness rival the $300 ultrawide I have at home. I haven't used it for gaming since I got it for the office, but I can't imagine it would have any issues there.",
      "rating": 5.0,
      "verified": true,
      "author": "A. King",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Split screen has serious limitations",
      "text": "We bought this display to have two NVRs displaying security footage to the same monitor, with a split screen. You cannot use split screen unless you have both devices on the same LAN, AND also install software on them. Obviously we cannot install software on our video security system. You CANNOT display two sources in split screen or PiP mode without installing software on both hosts. This seriously limits its usefulness.",
      "rating": 2.0,
      "verified": true,
      "author": "BAEH",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Stationary Mount",
      "text": "Four stars because...it does not move on its stand. It tilts but does not go up, down, or spin to be vertical. I’m a carpenter; I’ve worked out another solution so this monitor is beautiful for my needs but that just seemed restricting. I will say, though, I would buy another if I were going to get a dual vesa mount.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Very dissapointed",
      "text": "Turns off and on. The screen goes black and makes high pitch sounds. Works for 15 minutes then shuts off. This product is not useable. The LG screen is \"ok\" when it does work. Quality is not the best. I could see if I was using the monitor every day but I barely used the screen. I expected to have this monitor for years. I had this product for 1 year with minimal use and now it has become unreliable. So sad because I really love LG products. If you plan to buy, get the protection plan.",
      "rating": 2.0,
      "verified": true,
      "author": "jeanelle sarver",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "These work great for office work because the screens can be split ...",
      "text": "I have the larger version of this at home, it's why I ordered what I thought were two of the same, but unfortunately i was mistaken and ordered too small of monitors. These work great for office work because the screens can be split into two monitors without taking up the space of two monitors, but my recommendation is get the 34UM instead the 25UM was just too small.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane M. Arsenal",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Great for general office productivity",
      "text": "If I had more money I would have bought a larger one. However, this is about right after adjusting some size scaling with windows. Probably comparable to a 19-20\" normal aspect ratio in size scaling. Great for general office productivity, no problems 9 months after setting it up. For gaming, not sure, I've read many games don't support the resolution. Probably look that up if your exploring these for gaming panels.",
      "rating": 5.0,
      "verified": true,
      "author": "adam denis lafreniere",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Great for gaming and getting work done",
      "text": "I originally bought this monitor with the intent of being able to see multiple windows at once while working on report or whatnot and found that it absolutely perfect for that. The widescreen does a great job of allowing me to space out multiple windows. I also use this monitor to play BF1 on my PS4 and honestly can’t find anything to complain about. The graphics are decent for what the PS4 allows and the widescreen makes the experience even better. Easy to use controls on this monitor allow for easy adjustment to your preferred settings",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian Wierzbiak",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Does not come with \"included\" parts",
      "text": "I haven't checked the screen quality yet as it did not come with an HDMI cable as it said it did, nor did it come with the two screws needed to screw the base to the monitor, so I have not yet used it as I now have to separately order these parts. It certainly looks nice but is not usable as received.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie M. Ryan",
      "helpful_votes": 3,
      "publication_date": 20181202
    },
    {
      "title": "Widescreen - not JUST for gaming.",
      "text": "I write software as part of my \"day job\" and this monitor makes working on application layout much more reasonable as I can see an entire window's layout without the need to constantly scroll the layout editor. It also makes performing side by side code comparisons much easier to deal with.",
      "rating": 5.0,
      "verified": true,
      "author": "P.Jones",
      "helpful_votes": 3,
      "publication_date": 20170302
    },
    {
      "title": "Great Value, VERY pleased",
      "text": "Allot of other reviews go into great detail, so I'll just sum up what I think. It's allot of real estate with a great picture for a very low price. It is bear-bones, so you will need to supply your own sound, most games and software seem to scale properly to the odd ratio, and those very few that didn't, took just a google search and a few steps to correct. I'm definitely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin K Williams",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Nice panel, cheap housing",
      "text": "This is a pretty nice monitor, I upgraded from a standard 16:9 1080p 60 Hz display to this. I absolutely love it. Picture quality is great, the extra horizontal screen space is great, and if the game you're playing can support the resolution, it's very immersive. The only issue I've ever had is (using an AMD GPU, RX 570) I didn't have the option of switching the refresh rate to 75 Hz and had to create a custom resolution to do so. Another minor issue is that the housing of the actual panel itself is pretty cheap and shoddy, all cheap plastic etc. Probably the reason it's cost is so low, but the panel itself is very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kriszia Hill",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Green pixels",
      "text": "What's going on LG? Why are you selling such a great monitor with such a bad defect? Everything is fine except the green pixels/dots that keep showing up, so far, I've been unplugging and plugging the HDMI cable to temporarily stop this.. The HDMI cable doesn't seem to be the problem as far as I can tell so the monitor QA team did a bad job.",
      "rating": 3.0,
      "verified": true,
      "author": "Victor Oniagba",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Keeps turning off in hot weather outside",
      "text": "Update: It works fine inside at cooler temps but it does turn off in hot weather when working outside which is where I spend 3 months in the summer... The ultra-wide is nice. Previous: Worked great for 2-3 months and then randomly started to turn off and won't turn back on so can't use it for the rest of the day. It's a great screen otherwise",
      "rating": 3.0,
      "verified": true,
      "author": "N. Niemer",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "5 jack in the back is a nice touch. The menu is acceptable",
      "text": "I purchased this item for my new computer build. It arrived with no dead pixels that i could find, i have thrown a lot of games at this monitor and so far it is preforming as expected, the added 3.5 jack in the back is a nice touch. The menu is acceptable. I am pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Figment",
      "helpful_votes": 3,
      "publication_date": 20170415
    },
    {
      "title": "Fantastic for the price!",
      "text": "Image is crisp, clear and soooo big. It's not often I can say a peripheral actually improved my productivity, but this thing does that. It's big enough to have two windows side by side. I have not tried the dual input feature yet, but hubby wants one now that he's heard it does that. Haha.. It works without issue with my MacBook Pro, also nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Keeem",
      "helpful_votes": 2,
      "publication_date": 20170419
    },
    {
      "title": "great for WFH",
      "text": "Great for WFH, I ditched the screen on my laptop and the external monitor for this one wide monitor. I can see all i need in one space and there's plenty of room to move windows around to see what i need.",
      "rating": 5.0,
      "verified": true,
      "author": "james trent",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "AVOID",
      "text": "Sharp screen, sleek design; however, terrible longevity. The monitor started randomly going out about a year after purchase. The backlight was still powered, yet it would stop receiving signal from the computer. Changing the port or video source did not seem to improve the issue. It would benefit from a computer reboot for about a month or two until it finally went out entirely a month or so later. If you are looking for a monitor that will last - this is one user data point highlighting why this is not a good monitor.",
      "rating": 2.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "What a Bargain!!!!!!!! Great ultra wide monitor!",
      "text": "The graphics are great for gaming, isp for multi-tasking. It was easy to add a second monitor and can have several applications to use at the same time. Would buy again in heart beat!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Slone",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Very happy",
      "text": "Happy with this product. Bought this for my home office. Was very easy to mount (VEGA) on a stand I purchased from Amazon. Has made life much easier, especially while on calls and having to share screen, or while working with excels or multiple documents Menu's are simple to use. and while it looked shorter that I thought it would be, i is actually, pretty wide and helps with the split view.",
      "rating": 4.0,
      "verified": true,
      "author": "delphy johnson",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Well done",
      "text": "What can I say, the picture is perfect and exactly what I was looking for. The monitor is barebones but boast much more than the competitors for the price. In my case everything was plug and play, windows detected the exact optimal setting for this monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 2,
      "publication_date": 20171027
    },
    {
      "title": "Worked Great Initially. 14 Months later and the screen turns black.",
      "text": "I really liked this product. Now every time I am gaming the screen turns black after an hour or so. It happened last night within less than 20 mins of playtime. I even bought one recently for my younger brother. I hope he does not run into the same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Yeiky Rivera",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Fantastic monitor, would buy again if needed.",
      "text": "It is a great monitor, although some of my Steam games don't fully support the resolution 2250 x 1080, most of them do though and even if they don't I just go down a scale. On a separate note the graphics are really good and the extra wide-screen adds to the peripheral vision in all my games (which I love). I would definitely recommend this to anyone who has the interest and money to get it. Although if you really want good graphics you could get a 4k monitor, but you'd be paying for the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Cavendish",
      "helpful_votes": 2,
      "publication_date": 20170608
    },
    {
      "title": "Perfect for teleworking.",
      "text": "Size is great for teleworking. Not a big display, but useful for multiple documents. 58.5 cm x 25 cm (23 x 9.75 in). It is very bright and high contrast. Great for gaming, but turned both down to zero to use as a work monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "tpkidd3",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Beautiful picture!!",
      "text": "Great looking monitor! Buyer beware! If using with a work laptop, you may not have the administrator rights to adjust the screen resolution. Furthermore, older laptops/PC’s may not have the available screen resolution rates to give you the best image possible. No speakers, but I was aware of this- not a deal breaker, since I have a set of Bluetooth speakers I use with laptop. I use a two docking station setup (one for personal laptop, and one for work laptop), and the monitor has a control located on the bottom center that allows you to switch from one HDMI port to another. Would highly recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Good but not best",
      "text": "Not the brightest. Has a more green natural color out of the box over other monitors. The image is crisp. The unit works as advertised. In a bright room this will have issues being so bright with out setting changed",
      "rating": 5.0,
      "verified": true,
      "author": "James Mueller",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Watch out, thought this was a different model.  Pretty small for the resolution.",
      "text": "This might be a good model for casual gaming, but it’s poor for reading or web browsing, so I cant give it a great review because of it has limited usefulness.",
      "rating": 3.0,
      "verified": true,
      "author": "Jtech",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "I've had this display for a month and absolutely a ...",
      "text": "I've had this display for a month and absolutely a month and no complaints what so ever. This is my first monitor larger than a 15.6 inch laptop display so for me it's very large and accommodates it all for sure. However if you're coming from an even larger Ultra wide or a large display in general this might seem small but for me , absolute perfection. Basic use, movies, shows and productivity, no gaming however so I couldn't tell you.",
      "rating": 5.0,
      "verified": true,
      "author": "Malcom",
      "helpful_votes": 2,
      "publication_date": 20180228
    },
    {
      "title": "Love it!",
      "text": "Absolutely fantastic entry ultra wide monitor. Does not glare at all and despite limited ports (2 hdmi) it is enough to get the job done. I bought a desk clamp monitor mount to use in combination with this and with the extremely thin bezel it looks amazing. Would highly recommend for multitaskers and despite it not being a gaming monitor I've had nothing but pleasant experience gaming on it!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Great Monitor for my Kid!",
      "text": "Looks great! Wish I had a better graphics card to fully utilize the capabilities.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael G Evans JR",
      "helpful_votes": 6,
      "publication_date": 20170126
    },
    {
      "title": "Crispy clean image and awesome colors.",
      "text": "First off this monitor for is pretty solid for the money and has a nice range of functions. it's Got 2 HDMI, 3.5 mm audio out and vesa compatible. That's my que to bring up its one flaw; the vesa mount although it follows the standard, some mounts will block I/O in the back like in my case. I remedied that by cutting my mount but i'm just throwing it out there and hence the 4 stars. Viewing angle, response time and picture reproduction is worth the price I paid for it. Now that I think about it, it's kinda overkill for lowly workbench.",
      "rating": 4.0,
      "verified": true,
      "author": "T.Ace",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "I love this thing.  Horizontal I get two full regular screens side by side. Vert perfect for coding",
      "text": "I love this thing. Horizontal I get two full regular screens side by side. Vertical perfect for coding. A good desk mount is essential but if you are coding having 25 inches of screen vertically makes life so much easier",
      "rating": 5.0,
      "verified": true,
      "author": "Scottish Bob",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Great when it works / worked",
      "text": "I would love to love this product. Unfortunately, it randomly goes black, for no good reason and stays black. I have swapped out cords, tried different ports, different PCs, a Mac, a chromebook - same issue. It is unusable at this point :(",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "AWESOME! Can't go wrong with LG!",
      "text": "I'm going to keep it simple. Buy it. Enjoy it. Super awesome! Looks even better in person! I also love the option to plug 2 hdmi devices and be able to switch inputs. For example if u have a laptop and desktop, instead of pulling to hdmi cable out each time to use another device, simple select the input on it. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "yessie",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Good to go so far",
      "text": "I like that I can do a wide screen or have two windows up at a time. I'm doing a lot of work from home so that lessens my trouble when referring to other links/websites.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronda Corkhill",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Great price for great monitor. Not good base/mount options.",
      "text": "I love this. Was concerned ordering online and price. Watched some Youtube videos that convinced me and works great so far. Lack of good rotation and tilt are a con but not deal breaker. The menu could use some more options as well I dislike the power button/ui (click for menu, tilt button 'down' for off).",
      "rating": 5.0,
      "verified": true,
      "author": "Reroshaggy",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Great price. Works with Macs*",
      "text": "*This will work with a MAC. I use a Mac air 2015. Just need a lightning port HDMI converter that can handle 2560 x 1080 res. No software needed. Can't beat it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Raymond ",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Love playing Apex on this monitor",
      "text": "This monitor is super awesome. It actually does great for gaming. Played Apex last night and the game looked great. There are times where the wideness gets a bit strange looking, but overall solid monitor for the price. Have always been a fan of LG products.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane McIntire",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Great monitor",
      "text": "Fantastic monitor, Cheap ass Stand. I have no issues with this monitor, but the stands are extremely cheap. Be prepared to find a different mount, these screens do have the four mount points for a wall mount or adjustable desk stand which I would highly recommend. Also if the screen starts doing strange stuff, restart it. Be aware if you are doing a multimonitor setup you will need 4K adapters/HDMI cables to hook these to display port.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Great price, works great",
      "text": "This is not a 4k display but still looks good for what I needed it for. Easy to set up and works well with my Mac mini. My only complaint is that there is a faint line going across the screen that you can see if you focus on it, sorry no pic of that, but other than that very good monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "fooled632",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Nice widescreen monitor",
      "text": "This monitor is clear and works as a second monitor for my day trading. I like the wide screen effect when charting stocks. I never cut them off but they go to sleep when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Retirement Ready",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Arrived missing 2 screws to attach to the stand",
      "text": "Monitor itself is fine, stripped down budget ultrawide. Package was missing 2 3 cent screws to attach the monitor to the stand. This would be pretty off-putting if I wasn't going to put it on another mount.",
      "rating": 2.0,
      "verified": true,
      "author": "John E. Peck",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Perfect for small desks, light gaming, & productivity.",
      "text": "Got this for Programming so I could see everything I needed on a single display while using a 2nd 16:9 20\" monitor for reference material(videos, web pages etc...). I play a couple games on my computer but not a great deal. It works great for both instances. Some people have said that this isn't great use as a small ultrawide, but I disagree. It's worked out really well for me. Honestly I couldn't imagine the next size up, though that could be due to the fact my desk isn't very deep ask I'm fairly close to it. This monitor is comparable to a 20\" 16:9 that's stretched out horizontally.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Best Beginner Ultra-wide",
      "text": "Strongly like the wide aspect ratio. Allows for productivity and a feeling of having two monitors without the big bezel space in between. The color is good and the menu is easy to navigate, I would highly recommend to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Shayaan B",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Great monitor for work too",
      "text": "Though it is a gaming monitor, I am currently using it for work at home. Makes my life easier during troubleshooting issues. Great feature is that you can split your monitor (no not physically :)), the windows on this monitor can be split into \"N\" number of windows desired your way Vertically/Horizontally with the help of its Software \"OnScreen Control\". Love this monitor and only thing I overlooked is I thought it had a built-in speaker system, but doesnt although you can connect your head phones to it. Awesome picture modes by the way.",
      "rating": 4.0,
      "verified": true,
      "author": "Sravik",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Issa long boi",
      "text": "Worked out great for what I was aiming for. I read a lot of legal out lines and type of documents so this is what I needed. Much longer than what I was expecting but I can't complain.",
      "rating": 5.0,
      "verified": true,
      "author": "RiffRaff",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Not worth a penny more than $150 usd",
      "text": "This is NOT a gaming monitor. Its amazing in portrait mode. I use this to monitor twitch live streams and slobs in split screen in portrait mode it's handy.",
      "rating": 5.0,
      "verified": true,
      "author": "john medeiros",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Great for the price.",
      "text": "Bought these for some employees to use in a new office. They're not the best but for the price it can't be beat. Great build quality. Keep in mind this is an ULTRAwide monitor and only 25\". Therefore it's actually fairly small vertically.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew S. ",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "The monitor is a perfect size for what we needed",
      "text": "The monitor is a perfect size for what we needed. Color on the monitor is absolutly amazing. We will be buying another one of these after the first of the year. Little difficult to get my NVIDIA card to be set to the right resolution but once i did it was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Elijah Everson",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "Decent monitor, at a good price.",
      "text": "At this price point, you're not going to find too many ultrawides that are better. I actually doubt you would. The display is fine. It needs calibration if you want to do any photo/video editing. It's fine for gaming. The audio out on my copy doesn't work. Not that I'd use the speakers anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas Prettyman",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Stand is horrible",
      "text": "The screen look good but for gaming I noticed it leaves a black shadow when I move quickly, and the stand is literal trash, no grip on my desk and the wobble is soooo bad it feels like the screen is about to fall off",
      "rating": 1.0,
      "verified": true,
      "author": "Alfredo Hernandez",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Nice but small for me (Looks like a 19-20 inch monitor)",
      "text": "Mine had some dead pixels on the top of the screen, perhaps because of the shipping and LG's packaging. Box seemed pretty battered. Device is easy to setup and works swell sans the dead pixels.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob.A",
      "helpful_votes": 2,
      "publication_date": 20170910
    },
    {
      "title": "Buyer beware!!!",
      "text": "After a year of use I didnt have any problems, until it recently started to shut off and the display would just go blank, the back light would remain on. So I give this monitor 1 star considering that I use it 10-20 hours a week, sporadically!! It did not last as long as it should have! Highly disappointed!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Denis R.",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Bro i dont know what to tell you guys",
      "text": "So i got the monitor for three days now but unfortunately i cant do anything with it why? Because i opened the box and the box had no power supply no screws to make the monitor stand on its mount and now because of that i went i ordered screws and a power supply total of 25$ and i will wait three more days just so i can get them and see if the monitor actually works.. idk man im just wondering how that ended up happening.",
      "rating": 1.0,
      "verified": true,
      "author": "Ahmed AL-bdairi",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "No dead pixels yet!",
      "text": "No dead pixels yet! Unboxed it today, so that doesn't mean everything, but so far so good. Been on the computer for the past 8 hours or so and have had no complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Spencer",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Good monitor for the price",
      "text": "I had never owned a wide screen monitor. This one is not too expensive and it really pops the color. For gaming it is really nice. Good bargain, and good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Got one, Loved it, then got another one and loved it!",
      "text": "Small , but huge! Can only imagine a the bigger versions. It is exactly like having two separate monitors on a single screen. One for the shop and one for the office. Love 'em both. Ooo, might upgrade and put the two together down the road!",
      "rating": 5.0,
      "verified": true,
      "author": "SPerthou",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Works Great!",
      "text": "Screen proportion is awesome. I don't use it for gaming, but can put browser on one side and document on other and they fit perfectly. The included software let's you arrange screen in so many layouts and drag and drop just like having more than one screen. I kind of wish I had gotten a larger size, but that's on me.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Matson",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Five Stars",
      "text": "Fantastic home office monitor. Works perfectly with my MacBook Pro 2016.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew and Christina",
      "helpful_votes": 3,
      "publication_date": 20180418
    },
    {
      "title": "Worked for a few months but now screen turns black even though the light is on",
      "text": "Worked for a few months but now screen turns black even though the light is on. It seems to be an issue a lot of people have if you read the reviews. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Unique split screen.",
      "text": "After using this monitor for a couple of months I really like the split screen feature. It’s easy to use and helpful when applying instructions from a browser window to an application for example. Split screen windows can also be resized.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Angers",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "You’ll like the ultra wide dimensions",
      "text": "Great monitor. Idk a lot about monitor specs etc. but I love the ultra wide display - comfortably review two windows side by side. Seemingly nice display (I’m no expert)",
      "rating": 5.0,
      "verified": true,
      "author": "Etrade27",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Nice picture!",
      "text": "I bought this to have an extra monitor to work from home. I like it. The only problem is the doesn’t pivot.",
      "rating": 4.0,
      "verified": true,
      "author": "Yaya Luvs U",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "BAD BAD MONITOR",
      "text": "This monitor robbed my money turned black and wont even show menu bottoms now i am put warranty this is crazy been in a nice environment with AC nice studio and wow wont last. Hope Amazon can do something.",
      "rating": 1.0,
      "verified": true,
      "author": "Herman Perez",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Nice monitor",
      "text": "It's not as tall as I expected but the width is good. Good quality picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Florence Rink",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Wow",
      "text": "The colors are amazing. The print is so small it's a strain on the eyes. Changing the resolution makes it all blurry. So disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "MMC70",
      "helpful_votes": 0,
      "publication_date": 20181107
    }
  ],
  "product_meta": {
    "title": "LG Full HD IPS UltraWide Monitor",
    "description": "25 Inch 21:9 Ultra Wide IPS LED Monitor. Monitor features sRGB over 99 percent for color accuracy. Also includes Screen Split 2.0 for multi tasking and Game Mode for improved gaming. With Stand Weight:8.8 Pounds. Without stand -width- 24 inches, height- 2.19 inches, depth- 11.29 inches.\n\nInput: HDMI 2.0.",
    "rating": 4.2,
    "feature_bullets": [
      "21:9 ultra wide IPS display",
      "SRGB over 99 percent",
      "Game Mode; Black Stabilizer; Compatibility Windows 10; Set the color to 24 bit",
      "PIP mode in screen split; Response time 5ms (High); Brightness (cd/m2) 250(Typ), 200(min) cd/m2",
      "Without Stand W*H*D 24 x 2.2 x 11.3 inches; With Stand (WxHxD) 24 x 7.4 x 15.1 inches"
    ],
    "specifications": {
      "Standing screen display size": "25 Inches",
      "Max Screen Resolution": "2560 x 1080 Pixels",
      "Brand": "LG",
      "Item model number": "25UM58-P",
      "Item Weight": "8.8 pounds",
      "Product Dimensions": "24 x 7.4 x 15.1 inches",
      "Item Dimensions  LxWxH": "24 x 7.4 x 15.1 inches",
      "Color": "Black",
      "Voltage": "100240 Volts",
      "Manufacturer": "LG",
      "ASIN": "B01BV1XB2K",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 1, 2016",
      "Customer Reviews": "4.2 out of 5 stars2,035 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#2,599 in Electronics"
    },
    "categories": [
      "Monitors",
      "Computers & Accessories",
      "Electronics"
    ],
    "price": 149.99
  }
}