{
  "website_summaries": [
    {
      "verdict": "Best option on the market for new professionals and amateurs alike.",
      "pros": [
        "Full kit that has everything you need to get started, including three pads for cutting, polishing and finishing",
        "Ergonomic, lightweight design that includes vibration reduction"
      ],
      "cons": [
        "No side handle"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The results I achieved with this system were amazing. Especially considering it was my first attempt",
      "text": "First off I want to say I've never polished a car or used a DA polisher. I purchased this and decided to try it out on my black 2011 Ford Edge Sport. Started with McGuire's ultimate polish followed by Black Light. The results I achieved with this system were amazing. Especially considering it was my first attempt. There isn't a swirl to be found.",
      "rating": 5.0,
      "verified": true,
      "author": "Jk",
      "helpful_votes": 214,
      "publication_date": 20170701
    },
    {
      "title": "Dont bother with this product.",
      "text": "Dont bother with this product it is junk.not good as an orbital as the torque is to low and as a polisher forget it sorry I wasted my time and money. Went back to my real buffer. I have been painting and buffing cars for 20 years just for some perspective. I am not new.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 132,
      "publication_date": 20180827
    },
    {
      "title": "Mirror-Like Finish",
      "text": "I could not be more thrilled with my purchase of the TORQX polisher. 13 hours to 4-step polish my 2007 crew-cab black chevy Silverado 1500 that had years of neglect. Completely worth the money. The pictures speak for themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Bourne",
      "helpful_votes": 228,
      "publication_date": 20170425
    },
    {
      "title": "It works amazing even before someone who has never done anything like this",
      "text": "I have never used any type of polisher before. I watched hours and hours of chemical guys how to videos. I got this kit and used the VSS scratch and swirl remover, then used blacklight then jet seal and finished out with wet butter wax. I washed and clay bared before starting. The results left me speechless. They took my wife's 2011 Ford edge that had never been washed directly or cared for properly before and turned into show quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Lee",
      "helpful_votes": 78,
      "publication_date": 20180102
    },
    {
      "title": "Great!",
      "text": "Bought a while ago from a friend. Loved it so much I bought another one for $99.99 from Amazon and it came with hex pads and v32-38. I'm not a pro so the Torqx is excellent for beginners who have no idea what to do. It's simple and self explanatory with videos on YouTube to show you how to use it. It may not be as strong as the other Torq lines but it isn't necessary for the weekend warrior. Would strongly recommend this to any first timer polisher.",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 34,
      "publication_date": 20170219
    },
    {
      "title": "It worked but parts started flying off.",
      "text": "I hate giving this polisher a one star because it does or did work great. While polishing the side of my car the pad and backing plate came off, or more like flew off. Looking it over it looks like the threads in the nut on the polisher stripped out on to the backing plate. I never even had the backing plate off. This was my first day using the polisher as it came from box to car. I was almost done polishing too. Are there replacement parts from Torq to fix this I wonder?",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 28,
      "publication_date": 20180428
    },
    {
      "title": "Not worth the money",
      "text": "This DA sucks... I used it twice .... worked good the first time... after that it lost its power to rotate even with the lightest pressure... not happy at all... if you are looking for a decent DA look elsewhere",
      "rating": 1.0,
      "verified": true,
      "author": "save me",
      "helpful_votes": 23,
      "publication_date": 20180322
    },
    {
      "title": "Let down",
      "text": "Ordered this back in July during a lightning deal and finally pulled it out to use on my car with some free time. On the fourth 1-2 foot square section on my hood it popped and died. Was doing a decent job until then too. Totally let down, was only using the very light compound that came with it. Now I have a terrible product that isn’t even useful as a paperweight. Doubt I can get a replacement now.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 13,
      "publication_date": 20190119
    },
    {
      "title": "Outstanding DA Polisher and Polish Kit",
      "text": "I LOVE THIS POLISHER! I was new to paint correction when I purchased this and I couldn't be happier. It's incredibly easy to use, especially after viewing the Chemical Guys how-to videos. I've slowly converted all of my car care products to Chemical Guys. They are great and so is this polisher.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 12,
      "publication_date": 20170304
    },
    {
      "title": "I LOVE THIS KIT",
      "text": "I LOVE THIS KIT! It cuts down the time it takes to detail the car and makes it effortless. I've only had it for a short while, but have used it multiple times. The only somewhat negative thing I would mention is that it gets a little warm if you do more than one car, but it is not HOT or dangerous. I can't speak on washing the pads because I opted to purchase replacements instead of cleaning them. The towels are nice, soft, and effective. This is a MUST HAVE for any car enthusiast or entrepreneur.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Yoon",
      "helpful_votes": 11,
      "publication_date": 20170621
    },
    {
      "title": "It stopped working literaly a month later",
      "text": "bought it on Feb 21, 2018. not even a month and the polisher started to fail. Looks like the on/off switch or the cable are defective....waste of money. and i can't get a hold of anyone for costumer support.",
      "rating": 1.0,
      "verified": true,
      "author": "German J.",
      "helpful_votes": 12,
      "publication_date": 20180401
    },
    {
      "title": "Great Buffer and Polish",
      "text": "This kit has been a delight to use so far! I've buffed out several different vehicles, ranging from grandpa's old Mercury Grand Marquis to our brand new Toyota Highlander. The polishes and pads almost seem fool-proof and have managed to remove some minor surface defects from all our cars. If you've never used a DA buffer on a vehicle it may at first seem a bit intimidating, but the results are well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dayna J. Rupp-kilgore",
      "helpful_votes": 4,
      "publication_date": 20170803
    },
    {
      "title": "but I actually love it. Great products and the smell plesent too",
      "text": "I'm on a few detailing forums and people give the Vline a hard time, but I actually love it. Great products and the smell plesent too. The DA is also good but I haven't owned any others so I have nothing to compare it too. Only complaint is I wish the sail for the speeds was either harder to change or placed elsewhere. I change the speed sometimes by mistake when I hold it a certain way. Kinda noisy but I don't know how much quieter a DA can be.",
      "rating": 4.0,
      "verified": true,
      "author": "Dingus Kahn",
      "helpful_votes": 5,
      "publication_date": 20170328
    },
    {
      "title": "Great random orbital for a beginner.",
      "text": "So far so good. Did a full polish on my car this weekend. Performed great and gave me very noticeable results. My only complaints would be 1st the speed selector is very easily moved while in operation. I accidentally changed the RPM while maneuvering, but its easily noticed and adjusted back. secondly, would be the location of the power switch at the end but its really not that bad. Lastly the location for the vents for the motor are on the end sides of the handle. that's where I tend to grab it, but again an easy adjustment of my hand position. Overall the \"problems\" I have aren't that big at all. Still gave me great results and worked flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Speed&Angels",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Very happy with results",
      "text": "Machine is very heavy duty and powerful. So far it has done everything I expected out of it. I even bought more of the compounds that came with it, they are excellent products and I will stick with them.",
      "rating": 5.0,
      "verified": true,
      "author": "trimpey",
      "helpful_votes": 4,
      "publication_date": 20190312
    },
    {
      "title": "Pretty decent machine!",
      "text": "The polisher is great. I can’t complain about it at all other than the fact that it gets really hot, really fast. Even when not in use and is plugged to the power source it is hot. The compounds on the other hand, are mediocre. The v36 is the best compound/polish that CG offers. V32,V34, and V38 are all pretty bad. It removed no swirls or scratches. The Hex logic pads are great and overall I give it a 4 star. For the price, I’m not sure there’s anything better. With that being said, I do not have the most extensive paint correcting experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Dalton Rodrigues",
      "helpful_votes": 2,
      "publication_date": 20180905
    },
    {
      "title": "Damaged",
      "text": "I received my package and immediately noticed a blue/green wet spot on the corner. I brought it inside and thats when I smelled it. I knew what had happened. So I open the box and sure enough, one of the bottles had been crushed and leaked onto everything else that was in there. The polisher itself wasn't damaged thankfully. Still haven't heard back about replacement/credit/refund. 👎",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen Nicholas Gafford",
      "helpful_votes": 5,
      "publication_date": 20190207
    },
    {
      "title": "Still amazed after 5th car",
      "text": "I have been detailing cars for many years and had heard of the system and finally bought it. It is flawless no swirls or holograms effects and I use Collinite insulator wax #845 afterwards for protection Thank you chemical guys for making my job easier and making it look like better than a new paint job. I’ve never seen anything like this I’m still amazed by the fifth car. I totally recommend this system",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 4,
      "publication_date": 20180517
    },
    {
      "title": "Machine didn’t last two cars.",
      "text": "While I loved the polishing package this has offered I was very dissapointed this polisher didn’t last two full car polishing. It went dead while I was doing my second car. Now I have to buy another DA polisher which cost me fair amount. Maybe I would’ve saved more money If I had brought my car to the detailer. By looking at the reviews, looks like there are many people with same issues. I would recommend you buy the 32~38 polishing bottles separately and buy different brand DA polisher. This is just too ridiculous.",
      "rating": 2.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 2,
      "publication_date": 20191007
    },
    {
      "title": "Lightweight & Kit includes everything",
      "text": "Love it. The kit comes with everything needed; polishing creams & buffing pads. I'd never used one of these before but the instructions were easy to follow & understand. Quality seems good, only time will tell. It's not as heavy as I thought. Looked at a few sold locally before searching online & it's not as heavy as a few I checked out. It is on the expensive side. However, because it's lightweight & kit included everything it was worth the few extra dollars more.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeweli",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "First time polishing",
      "text": "The polisher doesn't have much vibration so you don't feel like your arms are going to fall off when you're using it. It is a little heavy so doing the roof of a vehicle can be cumbersome but I have to assume that's pretty normal for the type of machine. I'm satisfied with my purchase and am glad I bought it. I used it for a polish and a coat of wax. Excited to be able to use it again in the future",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley Isringhausen",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Very nice Polisher Kit. I liked the selection of accessories and samples that came with the kit.",
      "text": "This Polisher feels very solid and the speed adjustment is very smooth. It's random orbital gear works very, making sure the head is always moving, helping to prevent paint warm-up and swirls. It came with three pads, all a different color, which I liked, unfortunately, when washed, the color disappeared, making it hard to figure out which pad is which. They are all Dark Grey now (-1 Star) I would have expected the coloration to be permanent.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Smith",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Pack a sandwich...",
      "text": "I guess don’t read the directions on the compounds they offer and use with the videos. The videos say turn the buffer to level 6, but if you get the specs from the manufacture, the speeds are total opposites. The compound says go slow~1200rpm~, but apparently the lowest speed on the buffer is around 2400 rpm? And the guy on the video is like crank it up to 6 ~7400rpm~... so far it’s helped take out some swirl marks but no scratches at all, and just put more finer swirl marks. The SS compound they show in the videos, with this buffer and pads, is doubtful, but I’m going to keep trying at it with their other products.",
      "rating": 3.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 3,
      "publication_date": 20190311
    },
    {
      "title": "Great Polisher",
      "text": "Great polisher! A little heavy for vertical jobs like car doors but nice weight for the top of cars since you do not need to add much extra pressure. When you do add pressure the polisher doesn’t not slow muchbif at all. The pads are above average. It is not clear what the liquids are exactly. I did not use them. Two very small issues which prevent a 5 star rating. The power switch is at the end of the handle which seems awkward to turn off when you are holding other parts of the handle. Also the speed dial is VERY VERY easy to accidentally grab and dial up or down. Again small issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Cav Scout",
      "helpful_votes": 3,
      "publication_date": 20171203
    },
    {
      "title": "This would be a good buffer BUT...",
      "text": "This would be a good buffer BUT... The ergonomics are terrible, and the speed controller is is a terrible place, making SURE that every time you pick it up and use it, you will bump the wheel. The cord is far too stiff and should have more silicon content as well. All other things aside, it does a good job, but it's extremely heavy, clumsy, and the controls stink.",
      "rating": 3.0,
      "verified": true,
      "author": "V. Richie",
      "helpful_votes": 4,
      "publication_date": 20180702
    },
    {
      "title": "Loud",
      "text": "Does a great job only thing i personally dont like is that there is a power switch instead of a trigger but it is a great DA polisher it is so hard to mess up a detail with this! UPDATE: JUST BUY A RUPES this is so loud and it vibrates so much compared to a quality da the lhr15 mk2 gives you a better user experience the torx made my hand fall asleep and go numb after 1 hour",
      "rating": 3.0,
      "verified": true,
      "author": "The detailer",
      "helpful_votes": 3,
      "publication_date": 20180807
    },
    {
      "title": "Amazing first time results",
      "text": "Best money I've spent in a while. Watched a few instructional videos online and had the paint on my 20yr old Jeep starting to look like new within an hour. Scratches, swirls, rub spots and fog are gone. Maybe a bit heavy but not unwieldy. Gets quite warm during extended use but that's not surprising. Enough polishes for one car, give or take. I also bought the 3\" backing plate and pads for smaller areas. I'd recommend this kit in a heartbeat. No regrets whatsoever and I am very happy with the results so far.",
      "rating": 5.0,
      "verified": true,
      "author": "khornet",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "pretty happy with it",
      "text": "i disliked that it wasn't complete as advertised. Was missing the 3 big microfiber towels its suppose to come with and the cleaner bottle it comes with was also cracked so it leaked all over the insides of my box and was missing a lot of it from it leaking. !! other then those things everything else worked great !! used it on some chemical guys scratch and swirl remover after washing it with some Mr Pink, and clay baring it. worked pretty good left a nice polish too. did not use it very long either goes right to work !!!",
      "rating": 3.0,
      "verified": true,
      "author": "v8 300c",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "I did 2 cars and it worked great. Only complaint is the speed control is easy ...",
      "text": "My first professional style polisher after decades of using the hand buffers. I'm impressed! I did 2 cars and it worked great. Only complaint is the speed control is easy to accidently change. I like the fine adjustment but notches could help hold it in place. I'm looking forward to using this in the years to come.",
      "rating": 4.0,
      "verified": true,
      "author": "gcphost",
      "helpful_votes": 2,
      "publication_date": 20180618
    },
    {
      "title": "Love it!",
      "text": "I've been detailing cars for a long time.. I have a black ram 1500 and this tool keeps it shining like the day it was made... great for removing light scratches and swirls, great for polishing and applying wax.. oh and it'll never put a swirl in the paint! I'd buy another one if it ever quit working!!",
      "rating": 5.0,
      "verified": true,
      "author": "bill",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Just what I was looking for!",
      "text": "I’m very pleased with this little buffer, I had a Dewalt with 8” pads but it is heavy large and difficult to use in the detail areas on some Hot Rods. This buffer is built very well and light in comparison to others in its class. I love the on and off switch in the back which frees you from holding in a trigger, the soft start is a nice feature also. The only negatives I wish the dial for the speed selection was recessed it’s easy to bump while using, also the unit came with a spare set of brushes which were broken when it arrived. Overall I would definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark C. Leonberger",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Very good polisher",
      "text": "I was a bit hesitant dropping so much money on a polisher, but I know you get what you pay for. The polisher is pretty loud at full tilt, but still very easy to use and manage. Overall, the polisher has a nice heft and solid feel to it. The pads are good quality, and I will probably buy spares down the road.",
      "rating": 5.0,
      "verified": true,
      "author": "schan",
      "helpful_votes": 3,
      "publication_date": 20170425
    },
    {
      "title": "Broken at 10 uses or less...",
      "text": "We purchased this in April and we used it once or twice a month since then. It just broke on us today, 8 months later. The c-clip detached from the spindle, causing the spindle and the pad disk to separate from rest of the wand. It will still spin if we stick the spindle back in and hold it against the car but it seems pretty dangerous as there is nothing keeping the attachment... attached. Maximum of 10 uses does not seem appropriate for the amount of money we spent. I don't see an option to contact the seller so I am leaving this review.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Willing",
      "helpful_votes": 3,
      "publication_date": 20181216
    },
    {
      "title": "POLISH & WAX LIKE A PRO",
      "text": "I just purchased a used Acura TL. I took the car home, washed it, clay barred the entire car, polished, and waxed it using my new TORQX. I went back to dealership to pick up my plates and the salesperson had no idea it was the same car. The right tools make everything easy, and the TORQX makes polishing and waxing your car effortless.",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Feedbacker",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Perfect for beginner car retailers.",
      "text": "As with everything Chemical Guys produce this is a great product. The only problem I have is the position of the speed control. It’s very easy to hit while using and increase or decrease the speed of the unit while buffing. With time and practice I was able to learn where to place and hold my hands. I really enjoy all of the training videos you can find on their website and YouTube to teach how to correctly use the buffer and the speeds needed for each step of the detaining process. Sure there are better orbital buffers out there but for the most part this one is just as good as anything else available, the price is nice too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "solid polisher/power button is not very ergonomically located",
      "text": "It's a very solid piece of equipment. My only complaint would be where the power button is located. It's difficult to fumble and find it when you want to turn it off. I also did not care for the samples of polish that were included. There is absolutely zero indication of what each bottle's purpose is intended.",
      "rating": 4.0,
      "verified": true,
      "author": "B5HARP",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Buy the one with handles",
      "text": "I was using a rotary polisher before I got a D.A. Polisher the D.A. Doesn’t leave any swirling on the paint and is really great for using to apply wax. If you are going to use it a lot I would spend the extra money and get the next model up that has the handle on the bottom and top. It works great but would be better with the handles",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Better than anything one can get at a local(non detail specialist) retail shop.",
      "text": "So far so good. Did a paint restoration, to the best of my abilities, and the buffer didn't get too hot during the long session. pads are nicely made and resilient to soaking up too much product and getting to malleable. The towels are nothing special, but the pads and cleaner/conditioner make this a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "hugo",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "Worked Great!",
      "text": "This worked great! Had a lot of light scratches and slight oxidation and after a few passes with the medium duty pad and 32 polish it was gone. Did a finishing pass with the black pad and 38 polish and ended up with a nice high gloss shine. Not bad for a 2013 truck that has lived in the Arizona sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Kobylarek",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Absolutely love this thing",
      "text": "Absolutely love this thing! High quality tool, I have been detailing all my cars since I got it, I just wish the samples that came with the tool were bigger, as I used up most of the product on the 1st car I detailed & need to order more, I have been using left over product from another high quality Co. that I had laying around the garage before I purchased the orbital polisher. Thank you Chemical Guys!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Complete kit but no polish compound added.",
      "text": "Cool set up but it does not include any polishing or buffing compound, the 2 bottles are simply buffing pad cleaner. For something that's $200 I think there should be some compound added. The photo is everything in the box",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200804
    },
    {
      "title": "Big disappointment",
      "text": "DO NOT BUY FOR PAINT CORRECTION Operates fine but it vibrates more than any other buffer I've used and this will not take out even light scratches. I tried their hardest pad and cutting compound and it wouldn't remove even light scratches or swirling. As a polisher though it works as well as any other on Amazon. Got tired of using my friend's buffer and bought this because I've had great results from chemical guys products in the past and thought this would be a great deal like the rest of their stuff but this thing just doesn't work, even if I go super slow on the heaviest compound/pad combo.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Quality",
      "text": "Torqx is a quality product that works well for what i need it for. Compound, polish, and wax. Comes with everything you need to get started with a polisher/buffer tool except polishes, waxes, ect. Quality microfiber towels included leave no lint behind.",
      "rating": 5.0,
      "verified": true,
      "author": "Collins10111",
      "helpful_votes": 3,
      "publication_date": 20170530
    },
    {
      "title": "Good Consumer Detailer",
      "text": "I'm far from a pro detailer but we've used this for overall paint correction on three cars and, some work minimizing scratches here and there, and cleaning up some old headlights. I don't have a lot of experience with other devices in this class to compare it to but it has done everything we needed it to brilliantly.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Light and easy to use",
      "text": "shipped exactly as expected, arrived sooner than expected and performed better than expected . Very light and easy to use. Only one small down side, the speed adjuster is right on the handle and i kept hitting it and changing speeds but i would buy this again. Just need to get some more product . Great product.. Thank you !!!",
      "rating": 5.0,
      "verified": true,
      "author": "AdaptiveSoul",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "ONLY WORKED 4 TIMES",
      "text": "Your better off buying something else, used for times and quite working right in the middle of my buffing car, does not stand up buy a DeWalt or other brand and get good quality, spoke with Torq was referred to chemical guys, was told I would get e-mail to send unit back and receive another, got no e-mail and no further contact with anyone, Amazon needs to stop selling these they don't hold up to even occasional use.",
      "rating": 1.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Great polisher for the DIYer",
      "text": "This is a great kit for the money. I detail my own cars and help family members with theirs so it gets a decent amount of use. I'm not sure how it'd stand up to daily use by a professional detailer but for personal use its great. Came with lots of pads for every type of polish and sealer. cleaner and lube also worked well.",
      "rating": 5.0,
      "verified": true,
      "author": "Cajun",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Heavy duty and good making",
      "text": "I bought this set for my husbands birthday and it’s one of the best gifts. He needed a good quality to maintain our cars. After a few researching I came across this set. It was a wise choice because this is a heavy duty. The chemical guys does wonders. The set is definetly worth it because it’s expensive to buy individual bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "elisha",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great value",
      "text": "I got it to perform light polishing and to speed up wax and sealent applications. Pros: time saver, good build quality, middle noise level, and powerful. The pads are excellent too Cons: none yet for my application Recommended for light to middle size tasks",
      "rating": 5.0,
      "verified": true,
      "author": "Pancake Robot",
      "helpful_votes": 3,
      "publication_date": 20170104
    },
    {
      "title": "Starting my new detail shop",
      "text": "I love these guys. Learning a lot from their YouTube videos. Love the products and can’t wait for all my stuff to come in. I have a boat coming as my first detail customer and several vehicles on stand by. I’m ready for this new experience. I’ve always loved detailing my cars, but it’s time to step it up. Thanks Chemical Guys for the great tutorials.",
      "rating": 5.0,
      "verified": true,
      "author": "Alvaro Elias",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "No torq",
      "text": "Contrary to it's name, it has no \"torq\". This thing can't even turn under it's own weight. That makes it hard to do any corrections of any kind.",
      "rating": 1.0,
      "verified": true,
      "author": "Derek A.",
      "helpful_votes": 2,
      "publication_date": 20190227
    },
    {
      "title": "Worked great... for 45 minutes.",
      "text": "This isn’t my first orbital polisher, so - I know a thing or two about them. This worked GREAT... for 45 minutes. After that, even with just the pressure from the weight of the machine - it stopped spinning. I’ll be returning this for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy D. McGowan",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Lovely product",
      "text": "Great product. My bike had some 3m stuck on the tank for a long time and it made the paint not shiny. I got this and put of the product on in stages and it now looks so much better. It's a lot more shiny. I'll eventually use it on my car next.",
      "rating": 5.0,
      "verified": true,
      "author": "Piper Mock",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Very good value.",
      "text": "Great little machine. The pads are surprisingly durable. The compounds are small, 1 is not enough to do a whole car.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A.",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Happy with the results. Easy to use.",
      "text": "Happy with the results. Easy to use. My only issue is that the placement of the on-and-off switch is in a terrible location. I don’t think I would buy this again and opt for a different one with a better situated on-and-off switch.",
      "rating": 4.0,
      "verified": true,
      "author": "Leash",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Great product and set",
      "text": "This is an amazing buffer and combo pack! It has everything you need to get going. The pads are easy to install and you get your basic ones to accomplish most projects. Everything was in new unaltered condition despite what some of the other reviews have stated. I highly recommend this set to do everything from refinishing the gel coat on a boat to removing scratches and swirls on your car.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Safety Concern - Lasted 3 Car polishes",
      "text": "Used the polisher three times. On the third polish there was a load bang in the front section of the polisher. Bits came flying out and there was a grinding sound. I wouldn't accept a replacement if offered.",
      "rating": 1.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 4,
      "publication_date": 20190202
    },
    {
      "title": "Great polisher, highly recommended",
      "text": "I was hesitant to buy a DA buffer because I didn’t want to burn through my paint. I received the buffer and it seemed well built. I have since polished 3 cars. It works great and is super easy to use. The polish that came with it is amazing. I could not be happier with my purchase. Great value for the money. It makes your car look amazing",
      "rating": 5.0,
      "verified": true,
      "author": "James R.",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "polisher died after about 6 time use.",
      "text": "The polisher is poor quality. It died after about 5-6 time use. I was polishing a car an all of a sudden sparks came out and the thing was dead. It was well taken care of. Rest of the kit is decent but the polisher just ruined it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jibran Tahirkheli",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Highly recommended",
      "text": "Ok so after I try the kit I can tell you guys. It’s the best kit that I ever used. I have a black Mercedes I start with clay bar and then orenge ped with v 34 compound and then White ped with v38 polish and the car like brand new highly recommended. I followed the videos at you tube . Thank you !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Oshri",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Works Great",
      "text": "small, so it is alot easier to use and can get into the harder angle areas that a 10inch orbital buffer cant. Also speed controls make it for a perfect for almost any job other than high speed buffing you would do with a wool pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris J",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Easy to use",
      "text": "I am a beginner who learned how to use this product off YouTub. I had some swirls and marring from clay bar, this baby easily removed it with some scratch removal product. Can’t wait to use her again for polish and wax.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Frish",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Met Expectations",
      "text": "The product arrived in good shape and works to my expectations. The buffing pads work well. I find it most useful in applying finishing wax. It makes waxing the cars much easier than doing it by hand application.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great",
      "text": "It works great. I watched some of the YouTube videos and after doing 2 cars I haven’t had any issues. You can’t mess this up. Pads stay on, polish works great, it gets a little hot on the machine where the head meets the body so watch out. Best bang for the buck.",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Good Results, But Issues With the Polisher.",
      "text": "The results are great. However, my polisher was defective. I was only able to do about two thirds of my car since the machine would turn on and off randomly. On the bright side, Amazon was amazing and sent a replacement right away.",
      "rating": 3.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 4,
      "publication_date": 20161221
    },
    {
      "title": "Worked pretty good for a short while. Quit in the middle of a big job.",
      "text": "Worked really well for just under a year, but failed in the middle of a really big job. Should have spent my money elsewhere the first time around. Maybe thirty hours of total use? Total rubbish. And the speed dial is located in a spot where it's easy to accidentally change the speed. Very expensive paperweight is what I've got now. No word on any warranty.",
      "rating": 2.0,
      "verified": true,
      "author": "CyborgX",
      "helpful_votes": 2,
      "publication_date": 20180616
    },
    {
      "title": "Part 1-stopped working",
      "text": "I purchased this unit 13 months ago. Everything worked well and I was very pleased with it at that time. I took it out this week for its 2nd use, and it did not work, it just made a low grinding noise. At this time I will be contacting customer service to see what I can do",
      "rating": 3.0,
      "verified": true,
      "author": "Philip C.",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Does not work",
      "text": "I’ve used the polisher 4 times and now it will not start up, it’s like the motor is stuck. Hums but will not move",
      "rating": 1.0,
      "verified": true,
      "author": "Jjh",
      "helpful_votes": 4,
      "publication_date": 20180921
    },
    {
      "title": "Power cord gets loose, tool won't run",
      "text": "It was great when it worked, now it's junk, less than 2 years later",
      "rating": 2.0,
      "verified": true,
      "author": "Robert Wenig",
      "helpful_votes": 2,
      "publication_date": 20190826
    },
    {
      "title": "Professional grade products from Chemical Guys",
      "text": "I've been using Chemical Guys products for over a year now. This kit has everything in it to bring your vehicles paint to life.",
      "rating": 5.0,
      "verified": true,
      "author": "NaNaC",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Well worth the money, accessories provided are great!",
      "text": "Found this to be easy to use, and the provided Chemical Guys pads and 4 stage compounds/polishes did the job very well on my new paint job. I have bought more CG products as a result of this purchase. The polisher is not light, but working in small sections as one should, it is fine for non-commercial use.",
      "rating": 5.0,
      "verified": true,
      "author": "H Holland",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Great product",
      "text": "I purchased this to use for restoring a couple vehicles I have. It does a great job. I like that I can vary the speed and I like that it has a smaller (6 or 8 inch I think) head on it. Makes it easier to get into places with.",
      "rating": 5.0,
      "verified": true,
      "author": "jedg",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Awesome!!",
      "text": "Throw away you are side angle grinder buffer and buy this you will be very happy puts the product on very nicely using half of the product you would normally use. Leaving no buffer tracks it's great!",
      "rating": 5.0,
      "verified": true,
      "author": "dan m.",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Not happy",
      "text": "This machine has let me down. Twice. The first one just cuts on and off. I purchased this second one 11 months ago and the whole head is shaking and loose. I had my Griots gg6 for 7 years no problems. I’m done with chemical guys going to Adams.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle M Goodell",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Novice Ok. Professional No",
      "text": "This DA is great for a beginner or for your own vehicle. If your a professional Detailer you definitely want a more powerful Model for your customers investment.",
      "rating": 3.0,
      "verified": true,
      "author": "Diesel",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Looks good works like crap",
      "text": "Bought one used but it was all scratched and banged up with heavy vibration when I turned it on. This made more swirls than it got rid of.",
      "rating": 1.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Love chemical guys!",
      "text": "I bought this for my boyfriend for Christmas. It ended up being the wrong model. But for the price and quality of this everything you get in this pack it’s well worth it. W are big fans of chemical guys products and would recommend any of it to people looking for car cleaning products.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittnee",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Great Buffer",
      "text": "Awesome deal!!! This is what I got to prep my 2017 Roush Stage 3 Mustang.. 1 of 1 in the country to put a Ceramic Coating on!! The buffer is very easy to work with and all the different compounds allow you to get the paint perfect!!! Also everything is made very good design and build. So glad I went with this Kit!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Constantino",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Good entry level buffer",
      "text": "Good entry level buffer. The only gripe I have with it is the placement of the on/off button. It's on the bottom and is difficult to get to with your thumb when the buffer is at full speed.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 4,
      "publication_date": 20171009
    },
    {
      "title": "Great for a first time do it yourself project",
      "text": "After getting a scratch in my paint, I thought for sure I would need professional repair. I purchased this polisher, watched a couple videos and took my time to carefully fill and then polish the paint and I am very happy with the results. I was very concerned that I would do more damage then harm, but it was quite the opposite.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew L Harris",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Great for starters",
      "text": "I’m a newb and this was super easy to use. Compounds did a great job of removing scratches that I did not expect to come out. Make sure to get pad conditioner to go with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Murray",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "To heavy to polish my brass bed.",
      "text": "Never tried to use it. Too heavy for this old lady.",
      "rating": 3.0,
      "verified": true,
      "author": "Lynn D. Fantauzzi",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Not the results that I was looking for.",
      "text": "I did everything that I was supposed to do, and it made my paint worse! The cutting pad is too aggressive and left marks in my paint, and a white haze in my clear coat.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth Merritt",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "I'm in love with my Torq",
      "text": "Awsome!!! I'm in love with my Torq! easy to use, not too heavy, different experience to wax your car!",
      "rating": 5.0,
      "verified": true,
      "author": "Orlan",
      "helpful_votes": 2,
      "publication_date": 20170421
    },
    {
      "title": "Nothing but good things to say about this machine",
      "text": "Even for a novice, this polisher has been awesome. Just watch some of their youtube videos and read the directions on the bottles before use and you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "JayP Fullam",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Great products!",
      "text": "Used product (polisher) and Chemical Guys polish on 2000 Camaro with significantly paint maintenance issues. After completion the car looks outstanding and those that saw it before think I repainted parts of the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Very dissatisfied",
      "text": "Handle was broken in multiple pieces when unboxed. Very disappointed in the condition of machine when it arrived. I’m not even able to use it and it makes a weird noise when turned on.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa A. Kittleson",
      "helpful_votes": 3,
      "publication_date": 20190205
    },
    {
      "title": "Great for applying polish and wax!",
      "text": "Easy to use, fairly light in hand, and intuitive controls. Be advised, plug is not grounded but device is double insulated for similar protection.",
      "rating": 5.0,
      "verified": true,
      "author": "JVergara",
      "helpful_votes": 2,
      "publication_date": 20170128
    },
    {
      "title": "ca r",
      "text": "With this tool. Some minor troubles can be solved by yourself. I bought it to repair my car. With this tool, my car problem has been solved. not bad.",
      "rating": 5.0,
      "verified": true,
      "author": "dan dan zhang",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Well worth it.",
      "text": "All I can say is WOW! There were some negative reviews regarding power but I can’t imagine how much more would be needed. I had badly oxidized single stage paint on a 91 Miata and this did wonders. Could not have asked for better results. I’m new to detailing granted and it took me quite a while to do four passes over the entire vehicle but any issues I found were with my technique not the tool or products.",
      "rating": 5.0,
      "verified": true,
      "author": "Louislocke",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Ehh",
      "text": "This product broke right away. The motor is very weak apparently. I loved the buffer but do not understand how the motor died so fast. Literally, after the first use. I ended up buying the 10FX to hopefully fix that issue.",
      "rating": 2.0,
      "verified": true,
      "author": "John Guckian",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "No work anymore",
      "text": "I used 2 times and don't have power anymore I wish I can returned",
      "rating": 1.0,
      "verified": true,
      "author": "miguel",
      "helpful_votes": 5,
      "publication_date": 20180622
    },
    {
      "title": "Buffer and pads come as shown don’t expect much from the bottles of compound",
      "text": "Have not been able to use it yet I just received it today, that being said I was disappointed when I got the package and the cut and polish compound bottles were the sample size. And when I mean sample they are not even as tall as a can of coke. And I’m not sure if the product in it is even chemical guys or the right stuff so I will be re ordering the v36 and v38 compound from chemical guys to make sure",
      "rating": 4.0,
      "verified": true,
      "author": "Philip B.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Excellent Product",
      "text": "I've always kept my vehicles clean and polished. I bought the Torqx orbital buffer to get out some minor scratches on my 2001 Chevy Silverado and ended up using it to go over the whole truck. I had it repainted 4 years ago and it hasn't looked this good since it was painted. I don't know if I'll be using it to go over the whole vehicle again, especially in 90+ degree weather but it definitely does a great job!",
      "rating": 5.0,
      "verified": true,
      "author": "PEDRO D",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Quality product",
      "text": "My first DA Polisher so I can't compare to others but it seems to work perfectly. My biggest beef is with the placement of the speed dial on the grip. Constantly having to readjust the speed setting because my palm keeps moving it, is a real pain.",
      "rating": 4.0,
      "verified": true,
      "author": "dman68",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Best for the money",
      "text": "If you're a professional and this is your business, you probably have the talent to work with more versatile and expensive tools, but if this is for your POV, or you worry about burning paint, this is the machine for you.",
      "rating": 5.0,
      "verified": true,
      "author": "edkruzel",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Terrible all around",
      "text": "I don’t know if it’s the buffer itself, the included pads, or the chemical guys polish that’s sold separately but this it trash. I work at a car dealership and I used their flex buffer with Jax wax polish and McGuire pads and it completely blew this kit out the water. I watched all the YouTube vids and this still did nothing for my car. My car still looked terrible after two hours of polishing on the same spot.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Quality DIY polisher",
      "text": "This is a great polisher. The on off switch is a little oddly placed but easy to use once you get used to it. Overall a great tool for your car care.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Allred",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great DA polisher.",
      "text": "Love this DA polisher. Been great to learn on and hone my craft with the shorter throw. Impressed with the quality and the great slow start feature. Highly recommend, has plenty of power and can keep up with the 2 and 3 hundred dollar machines.",
      "rating": 5.0,
      "verified": true,
      "author": "Corbinwaterski",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Great quality! I haven't used any of the pads ...",
      "text": "Great quality! I haven't used any of the pads that come with the orbital, but using it with the bristle brush heads that I buy, it works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180719
    }
  ],
  "product_meta": {
    "title": "Chemical Guys BUF_503X TORQX Random Polisher Kit with Pads, Polishes & Compounds (9 Items)",
    "description": "Style:BUF_503X Kit\n\nTORQ Tools set out to develop an auto detailing tool that anyone can use, enjoy, and afford. The TORQX Random Orbital Polisher is the machine for the enthusiast detailer and weekend warrior who wants one machine to do it all. With the TORQX, anyone can polish paint, remove swirls and scratches, spread wax and sealant, scrub carpet, clean and restore clarity to headlights, and more. TORQ engineers designed the TORQX with simple and intuitive controls, rugged components, and durable build materials to last for years of dependable detailing use. The powerful 680 watt motor of the TORQX delivers the power and torque needed and demanded by enthusiasts and professionals alike. The TORQX uses the same gentle dual action motion and 8mm throw that enthusiasts and professional detailers know and trust even on the most sensitive or durable paint finishes. The TORQX is the powerful machine that won't bog down on any polishing, waxing, or hardcore cleaning job on any vehicle. Easily polish single stage, clear coat, or new ceramic clear coat paint finishes, polished metals, glass, and clear optical plastics with the TORQX. The tight form factor and precision balance of the TORQX fits comfortably in the hand and is perfect for any detailing situation. Use the TORQX to comfortably polish cars, trucks, large RV or trailer sidewalls, boat and airplanes, and any other automotive surface without strain or fatigue. The TORQX is the machine of choice for any beginner, hardcore enthusiast, or professional detailer looking for one simple, lightweight, and powerful machine that can do it all. Tackle any detailing task with the TORQX.\n\nHow To Use It:\n1) Shake well and apply 4-5 drops of V36 to Orange Pad.\n2) Prime pad with Pad Conditioner.\n3) Dab product out evenly across 2' x 2' section.\n4) Turn on machine on surface to speed setting 1 to spread product.\n5) Increase speed to 5-6 and using moderate pressure.\n6) Work area in 2-3 passes until product becomes clear.\n7) Examine results. If you are satisfied with results, proceed to step 10.\n8) If you are not satisfied with results, try using V34 with the Orange Pad; if you are satisfied, proceed to step 10.\n9) If an even more aggressive approach is needed, switch to the Yellow Cutting Pad.\n10) Refine finish with white pad and V38 Final Polish.\n11) Work until optical clarity is achieved.\n12) Remove residue with clean microfiber towel.",
    "rating": 4.6,
    "feature_bullets": [
      "Polishes and removes swirls, scratches, and defects from all painted vehicles",
      "Developed for enthusiasts and professionals using heavy-duty construction",
      "Applies wax, sealant, and glaze in minutes. Power : 700 W. Voltage : 120V",
      "Easy-to-use features for any detailing enthusiast or professional; Dynamic performance",
      "Designed with streamlined controls for maximum comfort on any automobile surface. The wide 2800 - 7800 RPM power band is ideal for polishing, waxing, scrubbing, and cleaning, the torqx the perfect first machine that handles all detailing jobs"
    ],
    "specifications": {
      "Manufacturer": "TORQ",
      "Brand": "Torq",
      "Model": "BUF503X",
      "Item Weight": "8.6 pounds",
      "Product Dimensions": "8.5 x 8.5 x 20.5 inches",
      "Item model number": "BUF503X",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "BUF503X",
      "Cover Included": "Polisher",
      "ASIN": "B01BKT63XM",
      "Customer Reviews": "4.6 out of 5 stars1,641 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#522 in Automotive",
      "Date First Available": "February 8, 2016"
    },
    "categories": [
      "Body Repair Tools",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Grinders & Polishers",
      "Automotive"
    ],
    "price": 159.99
  }
}