{
  "website_summaries": [
    {
      "verdict": "Boasts impressive capabilities that its competitors can't beat. Its bright light, long battery life, and strong yet compact design earn it the top spot on our list.",
      "pros": [
        "Offers 2,200 lumens and 3 light functions – high, low, and strobe",
        "Sports an anti-roll top and waterproof design"
      ],
      "cons": [
        "Our testers found it has a tendency to drain batteries more quickly than similar models",
        "A bit heavier than others and somewhat costly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Reliability",
      "text": "I am an Operator on a regional SWAT team and purchased this light for my SWAT dedicated rifle. Upon arrival, the light seemed perfect. Bright, clean light with the desirable mount kit. I rigged the light to my rifle and the issues started at my first training. I'd hit the pressure pad with no response. I replaced the batteries with no resolve. The problem continued and I was only able to get a flash out of the light when I whacked it on the side but couldn't get a constant on. I played with the connection and thought I fixed the problem until the light failed completely on a call out. I have emailed Streamlight twice with no response.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 128,
      "publication_date": 20171119
    },
    {
      "title": "Amazon sent me a counterfeit",
      "text": "Beware, there are a lot of counterfeits being sold Mine did not have the ten tap programing Did not have high, low, strobe...only high. Make sure you are getting the real deal here. Mine was sold and sent by Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Lucas Trengove",
      "helpful_votes": 19,
      "publication_date": 20200225
    },
    {
      "title": "Beware the fakes!",
      "text": "Received a fake Streamlight 88059 Pro Tac Rail Mount. Rubber on tail cap switch was extremely thin. Had the correct red O-ring and gold spring in tailcap. NO spring in front part of battery tube! This means FAKE. Spring is required for surviving recoil on actual firearms. On top of that, the tail cap switch failed on about the 10th use. Would no longer lock in the on position, just momentary. This cheap Chinese fakery needs to stop Amazon!",
      "rating": 1.0,
      "verified": true,
      "author": "Robert W. Thomas",
      "helpful_votes": 16,
      "publication_date": 20200403
    },
    {
      "title": "Counterfeit Flashlights",
      "text": "I ordered eight \"Streamlight 88054 ProTac HL USB 1000 Lumen Professional Tactical Flashlight with High/Low/Strobe with USB Charger - 1000 Lumens,Black\" for our business and I was sent counterfeits. The high low strobe function does not work. Only one function with this flashlight, \"high\" will function properly. I have a lesser lumens Streamlight that is significantly brighter than this \"1000\" lumen piece of junk. Once again, very disappointed with Amazon's quality control.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph H.",
      "helpful_votes": 9,
      "publication_date": 20200609
    },
    {
      "title": "Garbage light",
      "text": "Light didn’t worth after 1 use. Usually am happy with streamlight products but not this time. And the seller would not return and phone calls or emails.",
      "rating": 1.0,
      "verified": true,
      "author": "n navillus ",
      "helpful_votes": 9,
      "publication_date": 20190407
    },
    {
      "title": "1AAA now shipping in 115 lumen",
      "text": "As many have said the 1AAA is a great light and this is my fourth Streamlight. Wanted to confirm since it looks like no one has yet that (direct from Amazon at least) they are now shipping the new brighter 115 lumen version of the 1AAA. This version also includes the improved \"hat brim\" style clip that can slide on from both directions.",
      "rating": 5.0,
      "verified": true,
      "author": "BBQ 4 LYFE",
      "helpful_votes": 11,
      "publication_date": 20170929
    },
    {
      "title": "defective; could not be programed",
      "text": "I purchased this product earlier, liked it, and wanted another for a gift; so ordered another one. The 2nd one was defective in that it could not be programmed. Boxed it up and returned it to Amazon, which provided a simultaneous replacement. THE REPLACEMENT PROVED TO BE DEFECTIVE, TOO; IN THAT IT COULD NOT BE PROGRAMMED. That replacement has also been returned to Amazon. Don't know whether those 2 were the only defectives in the inventory, but that is statistically unlikely. UNTIL YOU CAN BE ASSURED THAT THE LIGHT YOU BUY HAS BEEN CERTIFIED AS SOUND AND PROGRAMMABLE BY STREAMLIGHT, DON'T WASTE YOUR TIME. The first light I bought has performed satisfactorily, and I admire the treble-fuel aspect.",
      "rating": 1.0,
      "verified": true,
      "author": "Sandcountryman",
      "helpful_votes": 4,
      "publication_date": 20191028
    },
    {
      "title": "I received a fake one based on the pictures of another comment.",
      "text": "Im pretty sure I got the fake model of this stream light flashlight... Before purchasing I did see a comment with pictures about counterfeit ones being sold. And of course I received mine today. I'm returning it and trying to buy another one hoping it's the real one...",
      "rating": 1.0,
      "verified": true,
      "author": "zach",
      "helpful_votes": 5,
      "publication_date": 20190822
    },
    {
      "title": "Battery life is awful on 88047 model.  Updated:  Now multimode no longer works...",
      "text": "Updated: Now the multimode no longer works. This thing sucks. I have the 88047 model. The light is super bright.. good news. The bad news is that that battery life is awful. 10 minutes and it is in low power mode. That sucks. I measured the Voltage of batteries when taking them out and each one of them are at 2.6 V . So at 7.8 volts this unit is going to low power mode. I dont know what the spec says but it seems that it should stay at higher power longer.",
      "rating": 1.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 11,
      "publication_date": 20170301
    },
    {
      "title": "Buy It. Energizer bunny of lights",
      "text": "Bought mine Jan 2017 and stays in my pocket all day doing fleet management for a construction company. Get RECHARGEABLE batteries, it will last that long. Great 5 star light. I've dropped it so many times I've lost count and it still keeps working I cannot stress enough buy rechargeable batteries you will thank yourself. UPDATE: 2019 I carry this light everyday in my pocket this light is a beast for the size see my before and after pictures. 2 years and still going strong. Semper Fi",
      "rating": 5.0,
      "verified": true,
      "author": "sbagwell",
      "helpful_votes": 5,
      "publication_date": 20180424
    },
    {
      "title": "it was a knock-off, a counterfeit.",
      "text": "Several reviewers said that its a great light IF YOu get a real one. But they warned to watch for counterfeit lights and gave several tips on how to spot a fake. Mine arrived and I could see that it was a counterfeit. It met several criteria. I asked Customer service if they could guarantee that If I exchanged it for another I would get the real thing but She said no they couldn't make that guarantee. So I asked for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Clay Blasdel",
      "helpful_votes": 2,
      "publication_date": 20200701
    },
    {
      "title": "Not a fake...",
      "text": "People where reporting allot of fakes with these, Just don't order blind make sure your ordering it from a legit seller or Amazon it's self, check it when you get it should have a Red seal on the threads and the Streamlight logo on the button came in official retail package. It's very bright, about a 2 foot circle of bright light across a normal rooms distance to wall. Mounted fine, it comes with zip ties to control your wires, If you don't want to use them (I didn't) get some Ranger Bands if you don't have um. (I use Ranger Bands for my wires)",
      "rating": 5.0,
      "verified": true,
      "author": "BenV.ART",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Failed after a year of home use.",
      "text": "Same thing as the last guy. Worked about a year and then the light output plummeted. I am going to buy another and send this back for a check up but decided to post the ongoing saga for such an expensive light that claims to have a 50,000 hour shelf life. I only use it sparingly for home use because at full brightness you only get 15 minutes from some very expensive batteries. Maybe used it 20 hours so far and the bulb must have failed.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 8,
      "publication_date": 20170607
    },
    {
      "title": "Highly versatile and capable.",
      "text": "In my opinion this is one of the best weapons lights. It's bright enough for mid-range engagements and works well for CQC. There's not much of a trade-off when it comes to output versus versatility like many other lights on the market. I can use it for searching as well as blinding and identifying a potential target. If you want high quality light that does exactly what it needs to, go with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 4,
      "publication_date": 20180903
    },
    {
      "title": "What’s not to love!",
      "text": "I bought this to replace theStreamlight TLR-1 I had been using. It still works great just wanted the distance and increased lumens this light offers. It has a great hotspot with a clearly defined halo ring for of horizontal light. The hotspot goes the distance so to speak. Well worth it just like every Streamlight product I’ve used. I now own 5 Streamlight flashlights. I still have the very first Streamlight flashlight I purchased over 15 years ago. It’s still going strong! Best flashlights on the market. I’ve been using Streamlight products since before, during, and after my military service. Performance and durability just as good or better than the competition, at 1⁄3 the price.",
      "rating": 5.0,
      "verified": true,
      "author": "K9Warrior",
      "helpful_votes": 2,
      "publication_date": 20190111
    },
    {
      "title": "Pressure switch is a problem",
      "text": "Only problem I've had is with the remote pressure switch. I've only had the light on for a day and the pressure switch doesn't work. I expected a lot more from such a reputable company to back up the quality of their products. This small problem will make the light very hard to use. This small flaw could end up being very dangerous in a situation where you need it to perform at that exact moment.",
      "rating": 1.0,
      "verified": true,
      "author": "john kronner",
      "helpful_votes": 8,
      "publication_date": 20170906
    },
    {
      "title": "powerful and reliable hi lumen portable flashlight",
      "text": "This flashlight is a great portable light that is more than sufficiently bright to meet most needs. the spread of the beam is wide enough to cover the right amount of ground while also focused enough to keep a direct hi lumen beam of light. I bought an eight pack of rechargeable batteries/and charger for times of power outages. Bought one for myself and my 22 yr old son. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Vigilant",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Great flashlight for concealed carry or home defense.",
      "text": "I bought this to use as a small, bright flashlight along side my firearm in the event of a break in. The brightness and strobe would prove very disorienting to an intruder in a dark home. Battery life is average for a flashlight like this. I can't complain. I don't really have a use for the low power setting and since it's not \"red\" it wouldn't be effective in preserving your night vision. Overall, it preforms exactly as I was expecting and I'm happy with the product. The price was much better than some of my local stores such as Cabela's, Bass Pro and other outfitter and firearms sales stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Great item",
      "text": "Instructions were horrible and useless. I had to find a youtube video to make it fit the way I wanted it to. No extra zip ties or way to release the ones it comes with to reuse, shipping was very slow, box was damaged upon arrival, but once mounted it works great. It's bright and light weight but can not be taken off and on. Once mounted it is glued and zip tied so you're stuck with it unless you want to ruin the paint on your rifle.",
      "rating": 3.0,
      "verified": true,
      "author": "Wolverine",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great little EDC flashlight",
      "text": "After four years of heavy use as my EDC flashlight, I lost my Streamlight ProTac 2AAA flashlight. I just ordered a replacement from Amazon. So I read the review that described the fake ones. Mine came with the waffle rear button, and a black o-ring. The pictorial of the ProTac 2AAA on the Streamlight website shows a black o-ring. The programmable feature worked just like it should. There was a spring in the back cap. So who knows what is fake and what is not. If it is fake, they manufactured a damn good one. The order states that it is sold and shipped by Amazon and not a third party vendor. I feel comfortable with my purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "LTRI",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Hummmmmm.....",
      "text": "I received the flashlight. It does come with batteries so, I guess that's a plus..... The light works and is bright...... It says it has different modes and it says something about ten programmable modes but, the instructions are predominantly foreign language so, I am lost. All I can do is push the button on and off, I am clueless about accessing other modes..... 3 stars because after opening this, I am completely lost when it comes to fully using this....... Sturdy and durable but, the instructions are terrible so, I am not able to fully utilize it's features...... It's good and durable but, how do I use it????? I'm lost.... LOL.....",
      "rating": 3.0,
      "verified": true,
      "author": "Mysterious Intelligence",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Even more versatile than advertised",
      "text": "This is arguably the best everyday carry or emergency preparedness flashlight. It is compact enough to carry in your pocket all the time. It can use a CR123 battery which give is excellent brightness of 350 lumens for almost 2 hours. However, it is a multi-fuel light, so as advertised, if you are in a pinch and don't have a CR123 battery, you can use a AA battery (still tight fit and no rattle due to built in spring loaded spacer). But wait, there's more.. what they don't tell you is that you can also use a AAA battery, which also is a solid fit and no rattling.",
      "rating": 5.0,
      "verified": true,
      "author": "Achar",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "MUST HAVE! ONLY BUY FROM AMAZON SHIPPED AMAZON!!",
      "text": "ONLY PURCHASE FROM AMAZON SHIPPED BY AMAZON!!! It is one of my favorite flash lights!!! I use this very much! It actually can use 3 different batteries!! Cr123, double AA, and TRIPLE AAA!! Very nice light very great for survival situation!! Must have!! I only use streamlight I have many models and this is one of my favorite!! Update - I had to return my first flashlight because the spring wasn’t long enough or cut properly from the factory, allowing my batteries to move or shake around in the flashlight, this is extremely annoying to me. I shipped back and amazon is sending me a replacement! THANK YOU AMAZON!",
      "rating": 5.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Do not buy! Cheap poorly designed, battery hog",
      "text": "Horrible, bought it and it worked for about a month then stop working completely. Tried using different batteries, and even swapped out the push button switch from my other one and still won’t work. Don’t waste your money on this. Going back to the real stream light flashlights not some knockoff stream light.also the rubber sleeve comes slides off after about a week. Can’t return it cuz it quit working right after 30 days, so I’m out of $100.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Sells",
      "helpful_votes": 3,
      "publication_date": 20180831
    },
    {
      "title": "Useless. Stuck in low beam mode less than two weeks in.",
      "text": "I would have given this 5 stars but I bought this two weeks ago and now it will not switch modes at all and is stuck on the lower beam. Useless. It will not change modes at all. For supposedly being a hearty and touch item it did not hold up to night time use to allow me to walk my dog at night. Never dropped and used for less than an hour total in these two weeks and this happens. Useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191210
    },
    {
      "title": "Works great on the rifle",
      "text": "The light construction is excellent. I probably should have read the details in more detail. The mounting attachment is dedicated and part of the light. The light tail cap and mount are all permanently attached. If you mess up a screw in the mount or mess up the switch you are basically going to need a whole new setup. For my use I will purchase a mount that can take different lights and lights that have optional tail caps. This will be a great light for some and awful for others. It is dedicated and specialized.",
      "rating": 3.0,
      "verified": true,
      "author": "DAVID TERRY",
      "helpful_votes": 2,
      "publication_date": 20181016
    },
    {
      "title": "Incredible value",
      "text": "Initially bought a less expensive budget light, but had a hard time getting a solid mount to my weapon. Decided to send those back and get the HL-X. What a difference. Quality light, quality mount, quality tape switch and mount. Installed and it doesn't budge and works exactly as expected. Bought some rechargeable batteries because it dos burn through quickly.. I feel like I can rely on this light to work when I need it. Definitely will do the job and money well spent if it hold up over time. Yes, there are even more expensive options, and maybe that's justified, but for what I need this is a sweet spot.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin B.",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "50-75 yrd limit. Get bigger than you think you need.",
      "text": "Great light. Low level is really low. Great for creeping ! Almost Too low. High is a really good spot that'll sure hurt eyes it shines into. About 50 yrd limit Strobe ... As it should be. Like a gun safe ... Get bigger than you think you need. Wish I had gone 1k lumas. Still a good light. Good auxiliary switch also.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Not much for a 100.00 light.",
      "text": "I ordered this pn all the positive reviews. I get it, charge it, the light flickers and goes out. Called streamlight and they said try bending the springs more for the battery. REALLY??? Over a 100.00 light and im supose to BEND the springs more! What is streamlight building today? Certainty not a high quality product anymore! I can not recommend this at all. Bought a Olight and very happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Thuesen",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Be Aware of Fakes!!!",
      "text": "Buying streamlight flashlights from Amazon is very risky, take CAUTION. Received a VERY good copy of the actual product (I have several authentic ones to compare to). Check for: -date between +- signs on batteries (fakes will have no date) - the +- signs on fake batteries will be facing wrong directions lol -streamlight button logo (fake has crossed-grid texture) -battery spring colors (gold = real, silver = fake) -10 Tap function will not work on fakes i.e. only bright setting no low -strobe is noticibly slow on fakes vs authentic one very fast -mounting bracket on the light is painted not anodized (use bright flashlight to observe this)",
      "rating": 1.0,
      "verified": true,
      "author": "Hunt",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Good inspection and EDC light.",
      "text": "I use my light daily, I bought a 2AA the first time and lost it somewhere so I bought a 3AAA this time in white light. It’s not as bright as the 2AA it replaced but I have never needed more light. This one has been sufficient. It’s light, easy to carry and bright enough. I don’t find myself replacing batteries often, battery’s last a long time. It’s easier to carry than 2AA and I like it better overall. My 2AA lasted over 5 years before I lost it. This one should last just as long.",
      "rating": 5.0,
      "verified": true,
      "author": "BrokeFarmerJohn",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Love it",
      "text": "Good well made product. I really like the size and feel of this light. It super bright and the strobe works well. It however go through batteries super fast. I have been having to put batteries in this light every 4-5 days. Just get some rechargeable batteries to save you some money and time. The silicone grip that comes with this product is a must. I will warn you it’s a nightmare to put on. The light also has held up in the rain so far. No issues.",
      "rating": 5.0,
      "verified": true,
      "author": "nobles125",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Don't buy",
      "text": "Light will not program into the high setting. This seems to be the main cause of the light getting bad reviews. I would guess that 1 or 2 out of ten of these lights are absolute lemons. Unfortunately, mine was a lemon. Brand new Streamlight batteries and the thing won't work right. You are taking a chance when you buy it, and it seems that Streamlight's customer service leaves something to be desired. Buyer beware!!!",
      "rating": 1.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 4,
      "publication_date": 20190406
    },
    {
      "title": "Awesome Weapon Light.",
      "text": "Bright, lightweight, and good quality. I bought the Protac Railmount 2L and am very satisfied with the brightness and throw of this 625lm model, don't know if it matters to the user but the color temp of this light is about 4500k unlike other LED lights that look more around 5-6000k. The tail switch quality looks great, the on/off button works great and has a noticeable sound and feel when pressing during use, the momentary pressure pad is consistent throughout its entire lenght. Overall a great light at a reasonable price. Cons: Not 18650 compatible, only CR123A batteries fit. (Only reasoni did not give it 5 stars.)",
      "rating": 4.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 15,
      "publication_date": 20161208
    },
    {
      "title": "Good light",
      "text": "This serves my purpose of a simple light on my home defense weapon. It is nice because it takes both CR123 batteries, as well as 18650 rechargeable batteries. The light is bright, enough to light up across my field at night. It comes with what you need to mount it to most weapons, a plain button AND a wired remote pressure pad button, as well as what you need to mount the pressure pad and zip ties. CR123 batteries drain fairly quickly, (1-2 hours of light ish) but are very bright. I recommend rechargeable 18650 batteries... they are rechargeable and good cr123 are expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad G",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great light",
      "text": "This is the best rail mounted light out there! Streamlight has really become a highly competitive option to Surefire and in some cases has bested Surefire. The beam is very bright due to the 1000 lumens but the high candela also makes it have a good Center with a good amount of spill. It also allows for use of Streamlight’s rechargeable battery. If you are looking for a rail light, get this. It includes an accessory kit as well to give you more mounting options. I ordered Cloud Defensive’s Pad Mount for this Too.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Smith",
      "helpful_votes": 3,
      "publication_date": 20170925
    },
    {
      "title": "Streamlight junkie says 2 thumbs up.",
      "text": "This is mainly a review of the ProTac 1L flashlight. I say that only because I have had the 1L the longest. I am also have 2 ProTac 1L-1AA lights, a 2L, HL and a 2AA. I have had the 1L for just over 3 years and have used it on a daily basis. As you can see if the picture, it's got some nice wear. I haven't had any problems with the ProTac 1L or any of my ProTac lights. I do believe the ProTac series of flashlights are reliable and durable as well as being a good value for the average person that can't or won't want to afford more expensive lights just to get these things.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Jones",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "I love streamlight",
      "text": "I love streamlight but after the first time firing my rifle with this light attached (approx 300 rounds) it no longer functions. I thought it may have been the battery but I have changed through several batteries and it is not the problem. I have switched between the pressure switch and the tail cap as to further troubleshoot the issue with no luck. I will be returning this to streamlight for them to repair or replace. All my other streamlight products have held up amazingly to very high round counts and untold abuse. I wouldn't use this review to steer you away from streamlight.",
      "rating": 3.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Didn't know what to expect ...",
      "text": "I normally use SureFire's because of the quality and longevity, but I needed something that was more for every day type stuff like going in the attic. OMG this thing so exceeded my expectations. This is a great little flashlight. It is durable and bright. I didn't want a ton of lumens because I am not trying to blind someone I just need to see the water main in the attic and too bright is actually a drawback. The flashlight is perfect for that kind of thing and with the lower lumens the battery life is awesome. This is great flashlight and I am very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Trashy",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "It works until it doesn't",
      "text": "I had one of these for over a year and never had a problem with it. That was probably due to a lack of use. I bought another one to mount on a new build for a low light class. It was not a super high round count, about 700 rounds over 3 days. The new light died, and my older one flickers under recoil. That sucks. If you're like most people and don't actually do much shooting this will probably serve you well. If you need a light that will survive a weekend of shooting you should probably look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Dick Danger",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great light. Wide bean, amazingly bright, and great strobe.  Buy the rechargable batteries",
      "text": "Great light. Wide bean, amazingly bright, and great strobe First, if you are purchasing this light you need to be prepared to purchase the rechargeable batteries (16850 - 2 units needed). If you are going to use this light it will burn through the 123 batteries, The strobe is amazingly bright, rated for 3.5 hours in strobe. The high mode is very very bright. It is more of a flood, but travels a good distance. In comparison, the Streamlight Stinger LED HPL DS Rechargeable Flashlight (FL893) casts a brighter bean that perceptibly outdistances the ProTac , but the HPL beam is not as wide. Why choose, I recommend that you buy both.",
      "rating": 5.0,
      "verified": true,
      "author": "Pinky",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Great Flashlight but it turns into a heater after 10 minutes",
      "text": "I will be returning this great Flashlight because you burn your hands after it has been on for more than 10 minutes. The generation of heat is so high that it's impossible to handle. I am really disappointed because I really like the power of this product. Unless this is a defective unit I will let the seller send another just to test.",
      "rating": 1.0,
      "verified": true,
      "author": "Itsme",
      "helpful_votes": 2,
      "publication_date": 20190205
    },
    {
      "title": "Great EDC Light",
      "text": "This light is great. I have used it as my EDC flashlight for about 6 months now and have absolutely no complaints. Pros: -Extremely bright for the size -Can use CR123A batteries or AA batteries with no conversion required -Dual sided pocket clip allows light to be clipped to a hat to make a headlamp -High and low modes are suitable for most tasks -Reasonably priced -Smooth body won't tear clothing Cons: -Somewhat short battery life -Power switch requires firm press, straight down with fingertip. It is difficult to turn the light on with the pad of your finger",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 2,
      "publication_date": 20170705
    },
    {
      "title": "Great deal",
      "text": "Not sure about durability or battery life, but seems to be a very well built light. Rail mount fits secure, pressure switch and mount feels secure and feels great. Cable management is easy due to rotating/swiveling cord exit from light. Allows really easy and clean routing. Super bright as well. Seems to be the best quality rifle light that won’t break your bank. I was deciding between this and the WMLX, but decided to go with this because the ability to use C123As and 18650 rechargeables.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony bocz",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Bummer",
      "text": "If I would have known that this light isn't easy to mount I would have gotten the olight odin. The plastic retainers for the pressure pad are garbage but the plastic retainers that came with the tlr-1 hl worked great not sure why these are different. If you have a offset mount I hope you have extra screws because they don't provide any to mount the light. I'm trying to think of something positive to say but I really can't just get the odin.",
      "rating": 2.0,
      "verified": true,
      "author": "painter4769",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Updated Review, Still Awesome.",
      "text": "Updated Review: This light has been my edc and trusted companion for a while now. It has been dropped from 5 or 6 feet a half dozen times easily. It went through an entire cycle in my washing machine. I've burned through a bunch of batteries. My light now has plenty of character but it still works great. Strobe still works fine and it clicks like new. Still every bit as bright as day 1 too. For $36 it's been a good investment. I have the 1L 180 lumen version. It's tough, dependable and it just works. 2 thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "wileypies",
      "helpful_votes": 6,
      "publication_date": 20160328
    },
    {
      "title": "Best price on flashlight around",
      "text": "Product looks to be legitimate Streamlight product despite concerns from older reviews, price is astonishingly good as local Batteries Plus store retails these for $69.99, took a little while to get use to the half click activations for High Bean, Strobe, and Low Beam. Flashlight is just large enough to be of use but just small enough from the next model up you don’t have an excuse to pocket carry one, but if you don’t want it in your pocket included is a nylon Velcro belt sheath. **One more important thing to note, packaging states with AA battery in flashlight max lumen output is only 140 lumens**",
      "rating": 5.0,
      "verified": true,
      "author": "Leland Kores",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Great function at a great price point",
      "text": "There are some other brands that are considered the gold standard but you pay a ton more vs Streamlight. I have several of these lights in addition to other models. The lithium battery gives you a very long shelf life, ideal for leaving in a glove box, etc., and the two battery model is very bright. I have liked all their products I have used, and their customer service is quick and responsive, which is too rare these days.",
      "rating": 5.0,
      "verified": true,
      "author": "EG",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Buyers Remorse. Is not 1000 lumens.",
      "text": "This flashlight is 400 -500 lumens max. I purchased my 3rd Streamlight 1 yr ago and is the 800 lumen full size model 75458. Fantastic flashlight! But, this compact streamlight is only half as bright. I still have an older 400 lumen flashlight, with new replaced and also recharged battery and is equal to this model. For $80-$100, a compact 400 lumen by streamlight is worth $80. Nothing more. I gifted a family member this flashlight . My 1st purchase was $81, fair price. My 2nd was increased to $101. Now, this flashlight is being sold for $108. DO NOT BUY. This is a 400 lumen flashlight.Note: I compared all my flashlights fully charged.",
      "rating": 3.0,
      "verified": true,
      "author": "Timothy J Kelleher",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "OK But Not As Bright As I Thought",
      "text": "I've owned a ProTac HL-X for several years. It is rated at 1,000 lumen and is quite bright. I figured this ProTac HL4, rated at 2,200 lumen, would turn night into day. I discovered that my HL-X seems brighter. The HL4 has more of a floodlight beam and the HL-X is more narrow. I'm not saying the HL4 isn't a good light or it doesn't shine bright, it's just not what I was expecting from a flashlight from the same company that is rated to be over twice as bright as some of its other products.",
      "rating": 4.0,
      "verified": true,
      "author": "RoadiJeff",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "A great flashlight for a good price! Highly recommend.",
      "text": "Fantastic flashlight for the edc. Fits and stays in the pocket well. It does come with a belt pouch but, my belt has enough on it. I haven’t bothered to change any settings because I like it as is. The rear button as a nice momentary/latched action. If something happens to this, I would definitely buy a replacement. Can’t speak too much for battery longevity yet but, I have a good feeling about it.",
      "rating": 5.0,
      "verified": true,
      "author": "likwyd",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Power Switch is a Thumb Downer",
      "text": "The power switch activation travel is so long that it inhibits activation with the thumb. It can be done but it takes a great deal of effort to bend the thumb enough to activate the switch while holding the flashlight in the palm of the hand. In a tactical situation it would be useless. I had 8 co-workers try the switch and all had the same experience. Because of this flaw, I give the flashlight 1 star. I encourage you to look for another flashlight.",
      "rating": 1.0,
      "verified": true,
      "author": "Snoop",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "??",
      "text": "Little disappointed, did not work. Got a replacement FAST batteries were fine light defective. 2nd light works fine. Reason gave 2 stars was light was a birthday gift for my son. He had to drive 50 miles to my house so I could switch out batteries to make sure that wasn't the issue. If he would have bought new batteries he would have wasted money for them either way he's out money gas/batteries. Jury is still out now have to wait and make sure I get credit for light I'm sending back. If light was for me no big deal but it wasn't.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "The Best EDC light available at the moment. A real pocket rocket.",
      "text": "This light is impressively bright in such a small package. Fits just right in the palm of the hand, and the settings are easy to get used to. The modes go from High -> High Strobe -> Low, which is perfect for tactical use. A quick double-tap and hold activates the strobe mode. If you're in an environment where you'll use a single mode, you can use the ten-tap programming to make that mode stick. The clip is useful for carrying almost anywhere, and it works both ways, so you can also clip it onto your cap. Can't find any cons at the moment. Just be sure you got the genuine ones (read other reviews).",
      "rating": 5.0,
      "verified": true,
      "author": "A. Li",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Bright light batteries aren’t standard and diffuser isn’t needed imo.",
      "text": "Super bright (2,200 lumens) but who knows if that’s at Halley correct. Only thing I know is it is bright and because of this the batteries don’t last long. As another reviewer wrote if they are left in the flashlight they self drain! Stupid but I just unscrew the cap and they are mostly good. Bright flashlight but it’s not an every day one because of the batteries aren’t standard and the diffuser up front it’s there to protect eyes from a direct shot I’m giessing but it would be nice if it was a clear lens. Overall good.",
      "rating": 4.0,
      "verified": true,
      "author": "Brendan Finn",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Great Buy",
      "text": "Great option for your carbine for illumination. Solid feel and great value in terms of all the accessories included and functionality. Bonus Tip: The Streamlight rail mount Protac series, while it does come with a picatinny mount it is set up for surefire scout style mounts how ever it does not come with the appropriate screws (#8-32x1/2 in) so you have to head to the local hardware store but not a big deal. Pictured mounted to A2 hand guards with heat shields with an Impact weapons components TMC mount",
      "rating": 5.0,
      "verified": true,
      "author": "B. Chance",
      "helpful_votes": 2,
      "publication_date": 20190411
    },
    {
      "title": "Burns when on high output too long",
      "text": "I like the compactness of the flashlight, I like the brightness, I really like the 3 different light functions, HIGH, STROBE, LOW, the clicker needs work as it malfunctions a lot, sometimes STROBE doesn’t come after HIGH and goes straight to LOW which is super frustrating and unreliable but my BIGGEST complaint is the intense heat that comes off the body when you have it on the HIGH output for more then a few minutes, I’d suggest wearing gloves because it will burn.",
      "rating": 3.0,
      "verified": true,
      "author": "Hugh Jassle",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "More than enough light for night work or tactical",
      "text": "This flashlight is large enough for tactical use in performing a strike, and to flash in eyes for temporary blinding effect. More than enough light for nearly any conventional use. A bit pricey, but well-made, with a rechargeable lithium battery, very nice holster and recharger included. Long run time between necessary charges. Is large enough and has sufficient heft to serve tactical purposes, but is heavy and long enough to weigh down your belt and get in the way when sitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Brujo",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "After repairs, works great",
      "text": "Initially, I got a light that broke down pretty quick. Streamlight fixed it for free and since then it's been fantastic. Bright, light, and durable.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean A.",
      "helpful_votes": 8,
      "publication_date": 20171225
    },
    {
      "title": "Great light in a small package",
      "text": "Very bright and the ability to take multiple types of battery is extremely convenient. Got one for my father as a work light to replace his old mini maglite which was not particularly bright and this is now his new favorite light. It has good throw for when he’s out in fields walking fences or checking animals on the farm in the dark and can clip onto a hat brim so it’s allows for easy hands free use when working on a vehicle or something where both your hands are needed but you still need light to see what you’re working on.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel O.",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "100% Streamlight",
      "text": "The one I received was legit. This is my third Protac mounted weapon light since I own several black rifles and will not be my last. These lights are high quality and very well priced. I can't see spending more on a Surefire when you can get very good quality from Streamlight, save money and it comes with everything you need to mount on a rifle. With that said... I would not buy a lesser quality light for my weapons.",
      "rating": 5.0,
      "verified": true,
      "author": "GuitarJem",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Projects a fair amount of light at a great distance.",
      "text": "Strong light at 2200 lumens. The down range light is very diffused. Not a spot for sure but it definitely lights up a large area at a good distance. Also has a fair spill to the light. If you need a flashlight to light up a large area for a fair distance. This one will do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "William C.",
      "helpful_votes": 8,
      "publication_date": 20160907
    },
    {
      "title": "Good light, just a little too big for everyday carry.",
      "text": "I have the 2 cell (800lm), 3 (this light) and 4 cell (2200lm) ProTac HL lights and think this one is the best bang for the buck. It is just a little longer than the 2 cell, and much smaller than the 4 cell with almost the same usable light output. In the video, the shed is 80yds-ish away. The video does not show very well just how much flood light there is on the 4 cell version, but that is my guess as to where the higher lumen rating goes/went.",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "Well I received a fake",
      "text": "When I got my Amazon box it was in perfect condition but the Streamlight box tape had been cut. It was missing parts and it had a flashlight branded NEBO. Did a return and got my money back right away, picked up a legit one at my local gun store. What a great light !! It's a bit bulky and heavy, threw it on a 7\" 5.56 build and it definitely added weight but still use it. Its not a Surefire but it is Streamlight, and they make great gear IMO. Save yourself the money and get this light. Very bright and reliable",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Nice Flashlight",
      "text": "I love this flashlight, it is my favorite EDC flashlight. Using AAA batteries is great for the quick swap when they die, and you get decent output for what the batteries are. The lens is the weak point in the design, if you drop it from just about any height the lens will crack. I wish Streamlight would sell replacement lenses but I cannot find them online anywhere.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Davis",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Very reliable and bright",
      "text": "Love the design of this product. The high beam can actually be too bright sometimes, which is easy to remedy by double clicking the switch to a lower setting. Labeled as a duel-fuel using AA or CR123A, I also found I could use AAA batteries in a pinch and careful placement in the compartment. I've dropped this flashlight dozens of times but it still keeps working great. I now own 6 in total, and purchased 5 more as gifts for family. The only criticism I have is that the body gets pretty hot during extended use.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Cawley",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "DO NOT BUY THIS FLASHLIGHT!",
      "text": "I bought this for my mom's 82nd birthday. She doesn't see well at night, and I thought a good-quality, lightweight flashlight would be perfect for her trips back and forth to the bathroom. It worked great! For two months. Now the on/off switch does not work. What a waste of money! I didn't keep the warranty information, which is my fault, but I don't know if the warranty was good for more than a month anyway. I expected that a $40 flashlight for professionals would last for years, not just two months.",
      "rating": 1.0,
      "verified": true,
      "author": "Laroo",
      "helpful_votes": 2,
      "publication_date": 20171013
    },
    {
      "title": "Sofaking bright!",
      "text": "The light is excellent. It's fairly big around, compared to a Surefire scout, but that is the only thing it gives away to a competitor that costs over 3 times as much. This light has a super cone of focus, it's great for near and far. I removed the picatinny mount and affixed it to a direct attach keymod mount intended for a Scout. The pressure pad can easily be directly mounted to keymod or mlok with some short low profile nuts and common hardware store screws. Or you can use the padded tape and zip ties that come with it. I'll most likely be buying more of this smae light for my other platforms.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Cress",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "BRIGHT AF",
      "text": "I have two of these mounted to my rescue helmet. This either gives me twice as much battery life (they drain batteries) or twice as much light to flood the area with. Great for swiftwater or vertical rescue where you have a rail on your helmet to direct mount a flashlight. I do wish the mounting point on the light could be adjusted to be on either side. The tightening knob is where it is...fixed. So on my helmet I have one side pointing up and the other side pointing down. Oh well 🤷‍♂️!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Siemer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great light and great service",
      "text": "The light is lite weight and the clip for the pocket is strong. I got mine a little later because it was delivered to the wrong address and I have no idea where that one is, however, Amazon made it right and sent me out one promptly. Great service as always. I recommend this light because of the clean operation, can use both AA and CR123 batteries. It disappears in my pocket. I like that i can use two different power sources because sometime all I have is a AA, granted the AA battery will run on the low setting of 150 lumens. The CR123 will run at at either 150 or 350. Overall great light and I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nevada Harward",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Beware! This is not rechargeable, misleading.",
      "text": "The flashlight in itself is a great flashlight but it has no ability to charge. The lithium battery is a one time use battery and goes right into the bin once done. A total waste of money and resources. It was too late to return as it was a gift so now I'm stuck with it. My only option is to buy a separate Li charger and Li battery to charge for another $40. No value there.",
      "rating": 1.0,
      "verified": true,
      "author": "mark delmuro",
      "helpful_votes": 2,
      "publication_date": 20181018
    },
    {
      "title": "It is perfect for intended use.",
      "text": "This was a pretty expensive little piece of gear but I'm very satisfied with it's construction, weight and capability. Mounted on my rifle via standard \"Picatinny Rail\" and the lock-up is solid. The strobe feature works perfectly and the light (strobe or beam) is more than adequate for use at dusk or complete darkness. I read some of the other comments about being a \"knock off\" but this (no doubt) is a Streamlight. Again, excellent piece of equipment in a compact, practical size.",
      "rating": 5.0,
      "verified": true,
      "author": "skyshot",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Very useful and clever option to the standard \"pen light\".",
      "text": "This is a very clever option to the standard \"pen light\" for EMS personnel. While not intuitive to use (I lost my instructions), once you 'figure it out', you have a very nice \"pen light\" along with a durable 50 lumen stnd. flashlight. It defaults to \"pen light mode\" (3.6 lumen) for pupil examination, and you can cycle up to a very functional 50 lumen for anything else. Kudos to Streamlight.... Very clever and functional. Now what do I do with all my \"pen lights\"?",
      "rating": 4.0,
      "verified": true,
      "author": "Art-the-MouseTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Compact and bright, but with issues",
      "text": "I bought this item a few years ago. It is pretty bright and small to handle and carry. But it does burn through batteries fairly quickly and gets very hot if you have it on after just a few minutes. The item does seem well made. I recently replaced it with another brand and am hoping it does not get so hot after some use. The new item offers a higher lumin and has a rechargeable battery, and seems as well made.",
      "rating": 3.0,
      "verified": true,
      "author": "Raptor",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "just buy it.",
      "text": "If your looking at getting a light for your long gun then this is a great option. Came with all the hardware and was easy to install. The pressure switch is a little large but is easy to operate when wearing gloves. The zip ties they send are nice but electrical tape works better. This light rides on my rifle 10 hours a day through some rough terrain. Has been through water and some less then ideal condition. Still works like day one. If your out at night you need this on your long gun.",
      "rating": 5.0,
      "verified": true,
      "author": "ben",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Randomly shuts off",
      "text": "I bought this to put on my patrol rifle. I attached it to my rifle with the pressure switch that came with it. I took it to my rifle school and after the first day of shooting, the light started just turning off. I would have to hit the light with my hand to get it going again. Then it would randomly shut off again while I’m searching rooms. Very unsafe when you are searching dark areas. I talked to our gun guy who told me there might be problems with the end cap spring and another guy told me about wiring problems with the pressure switch. I wish I had gotten this information earlier.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190523
    },
    {
      "title": "The sun at night. Won’t regret. GET.",
      "text": "1,000 lumens, this light is the sun at night, that is what your weapon mounted light is suppose to do. The pressure switch is perfect for C clamp on my battle steel quad rail, very responsive when my thumb presses on the pressure switch for both modes, strobe and momentary. This light is not to mechanical and hard to use, this light will be used just fine under stress and nothing will get in the way when you need it.",
      "rating": 5.0,
      "verified": true,
      "author": "New Mexico Nurse",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Great light, poor finish.",
      "text": "I use this light almost every night, nightshift private security and am fairly happy with it. I have had it since the middle of February and have only had to replace batteries once using Energizer brand batteries. The candela is decent, but not the greatest, you can illuminate an area from yards away enough to check for anything out of the ordinary though. My one complaint is the finish, this light virtually lives in my pocket secured by a Thyrim Switchback and already you can see more than a few scuffs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Good company, good product.",
      "text": "I was looking into options for a weapon light on my Tavor 7. IWI has this series of light recommended on their site as an accessory for the Tavor and I agree with their judgement. It was between this and the Surefire Scout - with this being WAAAAAY less cost for the same function. I am very happy with the light. It came with all the mounting options needed to make it work (aside from getting the Arisaka Defense mount, I only add this in case a Tavor owner sees this and thinks they don't need that).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "It's bright, yo.",
      "text": "This little puppy lit up the night sky in our rural area like the power of a thousand suns. I almost went with the 350 Lumen flashlight, but decided on this due to us living in a rural area where I would need to get some extra reach. Boy was I not disappointed. This flashlight bathes the trees 400 feet out in a powerful but wide beam. Also, this light comes with a mount for your gun of choice, so you can set your phazer to stun and blast foes with 1000 lumens of eye-scorching light instead of shooting in the dark like it's 1999. 10/10 would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Laurel B. Cull",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "By far one of the brightest lights I've owned",
      "text": "So just a little backstory, I purchased this light as well as three other lights. I purchased a cheap 2000 lumen light here on Amazon as well as the pelican 7060. I must say this light is my absolute favorite. It is very bright and while it lacks a charging port having spare batteries is not a problem. This light is just so bright that it blinds just about everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Dg3toyota",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "\"Programming\" Feature Does Not Work.  Difficult to Get to Preferred Light Level",
      "text": "I've had major difficulty \"programming\" it to shine the brightest setting each time I turn it on, but it never works. I read the instructions and went to youtube so I know I'm doing it right. Sometimes, even clicking repeatedly does not get me to the brightest light I need. Somehow I eventually, randomly get to it. I hope I don't have trouble some day in an emergency because I haven't gotten it to work the first time, yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Sunny Day",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Long Shelf Life CR123s",
      "text": "Bought this flashlight specifically because it uses CR123s. I keep it in my truck for an emergency light. With the CR123’s shelf life I don’t have to worry about the self-discharge of rechargeables and it’s got more light and lasts longer then AA or AAA types. Everything else is what you’d expect from a Streamlight.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Haynes",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "I have 2 of these and they are both great.",
      "text": "I have two of these 650 lumen lights with the remote tape switch. For the money, it's a great deal. Competitors are twice to 3 times as much. For your shorter range weapons such as PDW's, they are perfect. Only complaint is the mount. Could be a bit more robust, but is good enough for price. Can always be upgraded.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "I love this light!",
      "text": "Have you ever thought, \"man, what kind of idiot spends hundreds of dollars on SureFire?\" Me too, which is why I bought a couple of these. Awesome little flashlight, durable, bright, and long battery life. The programmable 10-tap feature is really cool too to adjust how you want it to operate. Buy this and laugh at other people who spend $300 on a SureFire.",
      "rating": 5.0,
      "verified": true,
      "author": "chrisazonian",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Satisfied customer",
      "text": "Works as described and a deal for the price. I'm giving it five stars, because I do think it is well made, light weight and has some good features. I like the mount. I'm still playing with the remote switch. The spacing on the rubber rail mounts is a bit funny, but that's not a big deal. Overall high quality. I'll update after use. Disclaimer, I originally had trouble with the mount and had to take it apart to get the spring to sit correctly. Not a big deal and I'm sure stream light would have handled it, but worth mentioning.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 3,
      "publication_date": 20160719
    },
    {
      "title": "Bright, but unreliable.",
      "text": "I really like streamlight, and I run several of their products as a LEO (handgun light, EDC light, duty flashlight). However, this product is a dud. Anytime I go to the range this light is totally unreliable and I usually have to bang on it with my hand or unscrew the battery cap to get the light working again (using the pressure switch). Further, the light flickers from just cycling the bolt on my AR. Def not something I'd want to bet my life on, and a surprising failure from streamlight. M600 it is!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Tough, bright and affordable",
      "text": "Very solid, bright and affordable light. I have mine on an AR pistol build and the size of the light and the pressure switch are just right for me. I haven't put it through much abuse but I have a protac hl-x handheld light that is basically the same thing as this, minus the built in mount, that I use for work every day that gets dropped and knocked around a lot and has not given me any issues so I don't expect this to be any different. I'll update this review if I ever have any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Skyler Tobar",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Best Flashlight EVER",
      "text": "Awesome wide flood beam and super bright. The ten tap program is easy to use and offers 3 different settings for the user. I kept it on high/strobe/low. The micro USB charging is AWESOME for a duty Flashlight giving me the ability to charge it anywhere there is a USB port. (lots in a scout car) package came with wall charger well as car charger. Streamlight lives up to its name. This light is very durable and built for heavy duty. Again, super bright and excellent battery life so far. (been using on graveyard shift for about 6 months)",
      "rating": 5.0,
      "verified": true,
      "author": "szepeda",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "This is my second one",
      "text": "This is my second Streamlight ProTac 2AAA. They are an excellent light for work. I use them everyday. They fit in my pocket. My first one still works like new. It's 3 years old and has been dropped, stepped on, lost then found. Very rugged for the price. Batteries last me about a month with brief, random 5 to 10 minute daily use. That also speaks to the quality of the push button switch on the back. I have worn the texture off of the rubber button. I does have three light modes 1) bright, 2) dim and 3) strobe. I only ever use the bright. I highly recommend this flashlight.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Swofford",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Great Little Flashlight",
      "text": "Great little flashlight, brighter than another flashlight I have that uses two CR123 batteries. It’s small enough that you can comfortably carry it in your pants pocket, I added a small hook so I can hook it on my pant’s pocket rim so it can be easily assessable. I also added a thick rubber band so I could grip it better as the flash lite is a bit smooth to hold. A plus is that it uses two kinds of batteries. It is brighter with the CR123 battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Hunds",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "No shelf life.",
      "text": "Its a great light for EDC if you are using it regularly. If it is a back up light then it is not the light for you. Without use it drains batteries. I have a legit SL but if I leave it lay for a few weeks then go to use it I get a near dead light. Wish I hadnt bought it. Love SL, just not this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Virginia Hord",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Did not last as expected! Keep looking!",
      "text": "I was excited when I got this flashlight for my rifle. So excited! Two month later, to be exact, after one, only one practice at the range, the flash died! The connector core is not working properly. When you need it, it will not turn on. Period! Garbage!",
      "rating": 1.0,
      "verified": true,
      "author": "Captain D",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Best light for the money",
      "text": "Best light for the money, especially with included accessories. The remote switcheck mount is helpful, but is rather large. My preferred method of mounting (after trying a few things) was to drill and tap my rail for the flush tape switch. It keeps it as low as possible and out of my sight picture (12 o'clock mounting)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Best bang for your buck",
      "text": "This light is incredibly bright, easy to use and set up. I put this light on my AR15 patrol rifle . I'm not a SWAT member who may prefer other lights for a variety of reasons but for my application it's great. It was easy to install on the forehand rails with the provided accessories. If you live in a state where you can hunt at night I would zero reservation about using this light on my hunting AR. It is truly the brightest light I've ever used, hunting or work. The battery life seems to be as described on the packaging.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie D",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Harness the power of the sun.",
      "text": "This flash light is bright and has a great battery life. I used it several times while hunting and have yet to replace the battery. The light has a very good illumination range and is extremely bright. Do not point it at peoples eyes as the light is so bright it will blind them for a moment. The light is sturdy and I feel that I could drop it a thousand times and it will still function. Defiantly worth the investment, don't buy a cheep flashlight spend the money and get something that is useful and will last.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler R Nebes",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Streamlight hasn't let me down yet.",
      "text": "Very easy to install, comes with zipties to clean up the tacticool look 😎. Extremely bright and great throw. Tested in the woods and had no problem seeing 100 yards out. The switch is also great quality. Was difficult to fit on the rail at first but I know it won't come off due to the tight fit. Will buy another in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Cassell",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Very versatile",
      "text": "I need this light when I am teaching classes with technicians. But I wanted a light that was a bit more flexible. So I got this one because it will run with a CR123 battery or a AA. Love being able to grab batteries just about anywhere. It does get a bit warm when I have it on for long periods with high beam, but that is to be expected. VERY bright and beam goes quite a ways for such a small light.",
      "rating": 5.0,
      "verified": true,
      "author": "Snowmanmo",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Not a \"cheap\" penlight.",
      "text": "This is the Cadillac of \"penlights\". Not a cheap penlight that one struggles with. Perfect for mechanics, electricians, professionals, sportsmen, hobbyists, moms, ANYONE that needs a really good, reliable, dependable, penlight, they will be happy to own and use. It is made extremely well, has a comfortable - rubberized ON/OFF switch, and a clip for your shirt pocket or button-hole. Stop buying JUNK, get one of these and you will treasure it forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Michael",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Ready right out of the box.",
      "text": "I took this out of the box and had to deploy my rifle with it about an hour after install. I will try and update the review over time. Very easy to install and the switch was easy to place wherever I needed on my rail. I used the light for approximately 30 mins right away and the batteries were strong with no variance. Also, the light did not get super hot and I was able to store it in a bag right away. The switch has a touch option as well as an \"on\" option.",
      "rating": 5.0,
      "verified": true,
      "author": "RicardoEstrella",
      "helpful_votes": 0,
      "publication_date": 20200923
    }
  ],
  "product_meta": {
    "title": "Streamlight 88060 Pro Tac HL 4 2,200 Lumen Professional Tactical Flashlight with High/Low/Strobe Dual Fuel Use 4x CR123A or 2 x Rechargeable Li-ION Batteries - 2200 Lumens,Black",
    "description": "Streamlight ProTac HL4 Tactical Light 2,200 Lumen Black",
    "rating": 4.3,
    "feature_bullets": [
      "2200 Lumens",
      "Dual fuel: Uses four 3 volts CR123A lithium batteries (included); Also accepts two rechargeable lithium batteries",
      "Ten tap programmable switch",
      "Durable, non conductive, corrosion proof polymer resin",
      "Self adjusting battery cradle accommodates multiple battery sizes"
    ],
    "specifications": {
      "Manufacturer": "Streamlight",
      "Part Number": "88060",
      "Item Weight": "1.1 pounds",
      "Product Dimensions": "8.63 x 2.35 x 1.24 inches",
      "Item model number": "88060",
      "Batteries": "2 Lithium Metal batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Style": "Protac HL 4, 2,200 Lumens",
      "Material": "Aluminum",
      "Power Source": "Battery",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Usage": "Youth",
      "Included Components": "Flashlight",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Lithium Ion",
      "Average Battery Life": "1.5 Hours",
      "ASIN": "B01B5DZ0LY",
      "Customer Reviews": "4.3 out of 5 stars324 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#55,972 in Tools & Home Improvement",
      "Date First Available": "January 28, 2016"
    },
    "categories": [
      "Flashlights",
      "Handheld Flashlights",
      "Tools & Home Improvement",
      "Safety & Security"
    ],
    "price": 93.89
  }
}