{
  "website_summaries": [
    {
      "verdict": "A simple deer decoy that's practical and effective for back country hunting.",
      "pros": [
        "Made of an HD photo of a real deer and a weatherproof canvas",
        "Lightweight and easy to take on a hunt",
        "Folds for easy transport",
        "Allows you to move quickly into position",
        "Easy stake down",
        "Packs very small",
        "Withstands the wind",
        "A mule deer decoy, but also works for white tail"
      ],
      "cons": [
        "This is a flat 2D deer decoy",
        "It does not have depth",
        "It doesn't have legs, but can be positioned many ways to still be very realistic"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great decoy, not the most ideal posture.",
      "text": "Disliked the posture of the doe for the circumstances. Doe looking to the side would have to be walking parallel to the target but rather than the goal to get closer to the buck.",
      "rating": 4.0,
      "verified": true,
      "author": "Whitey3499",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "good product quality",
      "text": "spooked more bucks than brought them in for a look.....the quality of the product is great",
      "rating": 3.0,
      "verified": true,
      "author": "Baumann",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Very easy to set up",
      "text": "This decoy looked real. Very easy to set up. In Idaho the wind blows continuously but Miss Muley stayed in place. All and all a good purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Jackie McGuire",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Headed for Sitka Black Tail Country in late fall",
      "text": "Headed for Sitka Black Tail Country in late fall...Rut season. I will put Miss Muley to the test.",
      "rating": 4.0,
      "verified": true,
      "author": "MEMLEY",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "easily collapsible and easy carry",
      "text": "this thing is cool feel good about using it for archery mule deer this year.",
      "rating": 5.0,
      "verified": true,
      "author": "ricky B",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "It’s an effective decoy for helping to draw in bucks.",
      "text": "It is realistic and I plan on using it for next year’s deer hunting season.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn S. Rounds",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Looks very real",
      "text": "This really does look like a real deer. It's large when set up, just like a real deer. Putting it together is fast and easy. It basically just flips out from a folder dinner size circle and then all that needs to be added are the stakes to hold it secure.",
      "rating": 5.0,
      "verified": false,
      "author": "Kitty",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Oh Deer",
      "text": "I shocked a few of my neighbors by setting this up in my backyard. It doesn't hold up under tight scrutiny, but for \"corner of your eye\" glances it looks very real! A nice illusion. Set up and take down is ridiculously simple. The whole thing, stakes included, collapses to about the size of a bundle of dinner plates. So far this has only done duty in my yard, but it looks and works great.",
      "rating": 5.0,
      "verified": false,
      "author": "Zack Davisson",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Realistic-looking; easy portability",
      "text": "My husband thinks this is a realistic looking decoy and is nice for portability. However, it is a bit flimsy and the stakes are a bit difficult to drive into solid ground (Pennsylvania) without feeling like they will break. I only deducted one star for these things because it works for what it is made to do. That is, it is not meant to be a sturdy permanent structure.",
      "rating": 4.0,
      "verified": false,
      "author": "Parents of 3 young boys",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Nice graphic display!",
      "text": "This deer comes almost fully assembled right out of the box with only minor work required to attach the two stand legs. In the picture here it almost looks 3D but I thought a little washed out on the one I received. Nonetheless, a nice product, light and easy to use and move around.",
      "rating": 4.0,
      "verified": false,
      "author": "Electric Z",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Very realistic!",
      "text": "Easy to put up and lack away for our next trip, very realistic. We tested it in the front yard, scared a very neighbors and dogs were barking at it. People who drove by did a double look, thinking it was a real dear! Uploaded a photo of it in the front yard.",
      "rating": 5.0,
      "verified": false,
      "author": "Parker-Moore Family",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Freakin' Awesome",
      "text": "I have used their turkey decoys for years. This Muley is just as good. Every deer that comes through my \"yard\" (13 acres of oak and holly) thinks this decoy is a real deer. Some have fallen for it three days in a row. Definitely recommend!",
      "rating": 5.0,
      "verified": false,
      "author": "S. Templar",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "This would fool a deer for sure.",
      "text": "This is a well made deer decoy. From a distance it is definitely convincing. It is easy to set up and light enough to carry with you. It folds up for easy carrying and storage. Very lifelike.",
      "rating": 5.0,
      "verified": false,
      "author": "Raed Haed",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Great!",
      "text": "The fabric that this is made from is very similar to that of yard flags. This sets up super easy and folds up for storage. It looks great, very realistic.",
      "rating": 5.0,
      "verified": false,
      "author": "Oceania",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Good Decoy - Easy to Stake - Quite Realistic",
      "text": "This is a high quality decoy. It is quick to assemble and easy to stake. I will update with how it does long term but for now I am happy with it.",
      "rating": 4.0,
      "verified": false,
      "author": "RicoTX",
      "helpful_votes": 0,
      "publication_date": 20170406
    }
  ],
  "product_meta": {
    "title": "MONTANA DECOY Miss Muley",
    "description": "The secret of many successful mule deer hunters is using a decoy to stalk bucks or lure them into bow range. It just makes sense. For that reason, Montana Decoy has created a one designed for the avid mule deer hunter. In stalking situations, the life-size body of this decoy gives you cover when there isn’t much. Its realistic pose will grab the attention of rutting mule deer bucks and offer a distraction as you take a shot.\n\n\nLike every decoy we create, the photo-realistic body pops open in the blink of an eye and folds down tight to the size of a dinner plate.",
    "rating": 4.1,
    "feature_bullets": [
      "Folds up easily and is light enough to carry on every hunt.",
      "Its size allows for better visibility and increased stalking advantages.",
      "Made from an HD Photo of a real mule deer.",
      "Compatible with the Quickstand (sold separately)."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "15 x 2 x 16 inches; 2 Pounds",
      "Item model number": "0065",
      "Date First Available": "January 1, 2016",
      "Manufacturer": "Montana Decoy",
      "ASIN": "B01BE8GHHQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Decoys",
      "Sports & Outdoors",
      "Hunting Accessories",
      "Sports & Fitness",
      "Hunting",
      "Hunting & Fishing"
    ],
    "price": 81.25
  }
}