{
  "website_summaries": [
    {
      "verdict": "Reliable scatter feeder with timer to help keep the deer coming back all day long.",
      "pros": [
        "Allows you to scatter food for animals at set times during the day",
        "Battery operated",
        "Will tell you how many feeds you can expect to get out of the filled food available",
        "Spreads easily",
        "Easy to assemble",
        "Stable legs",
        "Timer is easy to set",
        "Holds a lot of corn"
      ],
      "cons": [
        "The instructions that come with this unit are not very thorough, but setup is still pretty easy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Needs additional varmint protection",
      "text": "I own 3 of these feeders. They work just fine with one exception: The so-called varmint guard is inadequate for raccoons. I built my own varmint guards out of 1 x 1 rabbit fence, and that is doing the trick. Otherwise, no complaints. Mine have taken a beating from raccoons, deer, and 70+ mph winds, and stood through it all. I would definitely recommend to anyone - just buy some rabbit wire and plan on building your own varmint guards before you ever put your new feeders out. That's kind of a pain which is why I only gave this product 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181015
    },
    {
      "title": "Horrible customer service",
      "text": "After only one year the motor assembly stopped working. I bought a new battery thinking that would fix it but nothing. If the customer service department would have been more helpful my review would be better. I have tried for 2 weeks to get someone from Moultrie to help me and have yet to get anyone on the phone. I have sent emails as well but no luck. I'm done and will not be purchasing any of their products again. I also have their wireless camera which is NOT up to snuff with other cameras on the market at the same price point. Very disappointed in a company I thought was an industry leader.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190930
    },
    {
      "title": "The plastic will not hold up to the squirrels.",
      "text": "I bought this product for hunting deer obviously, but the squirrels have eaten all of the plastic parts which is pretty much the entire thing. Called Moultrie today to see if I could get some replacement parts for it. An automated service answered the phone proceeded to tell me to go to their website and then hung up on me. Sorry guys I'll never buy one of your products again.",
      "rating": 1.0,
      "verified": true,
      "author": "Don B",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Instructions suck and the plastic rivets to install the aluminum funnel ...",
      "text": "I got the feeder today and NO TIMER!! Instructions suck and the plastic rivets to install the aluminum funnel don't work. wth? Ok, THE TIMER IS IN THE MOTOR CASE!!! remove the thumb nut and take off cover. the plastic rivets still suck, I bought some 10-24 ss screws for the funnel. Ok, update, October 28th, 2018. Just ain't working. Changed the battery, works if I run it on manual, well sort of, it seems weak. I changed the battery and it seemed to work, then I was watching at the feeding times and nothing. I got it working by shaking it, I think there are a lot of cob pieces in this load. Need a stronger motor.",
      "rating": 3.0,
      "verified": true,
      "author": "iggy",
      "helpful_votes": 2,
      "publication_date": 20170603
    },
    {
      "title": "Moultrie fans.",
      "text": "This is our 2nd Moultrie feeder. So far like the undermount timer unit better. No chance of accidentally pulling the operating wires loose when filling with corn. (which can happen on our older unit) Husband built cage around dispensing unit to keep critters from eating/destroying it and have had our original one for years. Only replaced the battery. That's why we didn't hesitate to purchase Moultrie again.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper Kim NC",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Missing Parts",
      "text": "Pay attention to the bad reviews, they are there for a reason. My box arrived short two sets of legs it is only 4 feet tall. Also it is missing the bracket to hold the 6 V battery. Very disappointed and pissed off, I had ordered this during my scheduled days off to assemble and get placed in the perfect position. Now I have to mess with trying to get more parts",
      "rating": 1.0,
      "verified": true,
      "author": "Eddie M",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Good feeder for money.",
      "text": "Like the feeder for price. Lot of plastic for varmints to chew on though. Have two of these and they spread feed really good. Only problem plastic guards little lightweight and don't deter unwanted visitors. Have purchased a couple of the wire protectors, should work.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Doesn’t come with battery or charger, don’t try another battery.",
      "text": "I opened the box to discover that this product didn’t come with the battery pack or charger. Those are both separately sold items. The feeder is useless with out those so I don’t get how or why you’d sell it without those. So, I attempted to hook up another rechargeable battery I had to the feeder and the motor caught on fire. There was smoke all through my basement. So now I have to order a new motor, a battery and a charger. This could have all been solved if there was just a battery and a charger in the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Quits working....read other reviews",
      "text": "After 3 months it’s now so unpredictable I hate it. What a waste of money. Works for a few days then stops till I go out and test it. It then works. Then days later it stops . it’s a POS. I saw other reviews about this and thought it was just them. Nope. It’s a bad product. Find another brand. Tells you a lot when there are YouTube videos telling you how to keep it going.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly C ",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Lock the windows but leave the door wide open🙄.",
      "text": "It has a nice metal critter guard so critters can't unload the entire barrel from the bottom; however, it took one day \"1\" day for a critter to chew a softball size hole through the PLASTIC top! Why put any guard on it at all if the thing is so easy to enter. It's like making a fast car with seat belts and no breaks😯.",
      "rating": 3.0,
      "verified": true,
      "author": "vee",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "not for use in the rain/outdoors",
      "text": "First off do not place it where it may rain. First week out the timer filled with water and stopped working. The unit is not sealed and water from rain runs in and fills the base till the timer is submerged and no longer works.",
      "rating": 1.0,
      "verified": true,
      "author": "The BIG Guy",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Convenient for continuous feeding",
      "text": "I purchased this feeder to place on the back of my lot in view of our back house windows. It works great. I fill it with 80 to 100 lbs of corn and set the timer for twice a day feeding. It is great when we are traveling as the feed continues to flow and keeps the deer coming in. The grandkids love viewing the deer during the morning and late afternoon. Good product...well made...and priced right.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel W. Mowrey",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Moultrie junk!!",
      "text": "Not only is this product junk, but so isn't the customer service to go along with it. Of course 9 days after my return window closes from amazon, the electronics crapped. No big deal, I figured moultrie would take care of me. Nope this pos is a $100 paperweight with corn inside of it because of their faulty design. Stay as far away from this pos as possible. Please learn from my mistake! Elite is a sham!",
      "rating": 1.0,
      "verified": true,
      "author": "Budro",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Outstanding Feeder.  Very High Quality.",
      "text": "Fantastic product! Some reviewers complained about lack of instruction but let's be honest folks, the set up here was fairly intuitive. It took me probably 15-20 minutes to get it together. I also added the Solar Panel and Varmint Guard from Moultrie, two good products that pair with this. In it's first season, I harvested three Whitetail using this feeder. It never jammed or had an problem whatsoever. Looking forward to a long-run with this!",
      "rating": 5.0,
      "verified": true,
      "author": "DieselWMB",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Five Stars",
      "text": "Works great. So far Love It. I recommend you also get a guard to protect the motor unit & a solar unit to keep the battery at full charge. Just use your head when buying and remember there are a lot of animals out there and it is up to you to protect your unit not the manufacturer. Spend a couple dollars more now to save a whole lot later. Nothing you do can stop a BEAR!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "David L Williams",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Reset button inside controller!!!!!!!",
      "text": "Easy to put together. Directions setting timer are terrible, there is no explanation about the reset button inside controls. When I connected the battery I had an error message, no instructions how to correct this, I finally took off the set screws on the controller and found a reset button. Everything works fine now!",
      "rating": 2.0,
      "verified": true,
      "author": "Alan R.",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Great feeder for the price - Use the provided spikes",
      "text": "Didn't use the included spikes on the first one and a big doe got under one of the legs, got spooked and jumped in a manner to push the bottom of the leg out. Once it got to a point the square tubing bent/crimped and the plastic feeder crashed to the ground. Because it was 3/4 full it destroyed the plastic feeder. Overall great feeder.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Leadingham",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Do not purchase this product",
      "text": "Feeder has failed after only feeding 2 bags of feed Terrible product Buyer beware",
      "rating": 1.0,
      "verified": true,
      "author": "Mike dement",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Easy to use and put together. Feeder is reliable and convenient.",
      "text": "Super easy to install and seems to work flawlessly. The only issue I have with it is the “pins” that come with it to secure the funnel to the feeder itself are cheap plastic and broke as I was trying to put it together. I ended up assembling the feeder without even using anything to secure the funnel to the hopper and haven’t had any issues. Overall great performance and easy to use, program etc. I used a moultrie 6v battery which has kept a full charge for well over a month now without skipping a beat. I would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Mac Dills",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Easy assembly, easy program, worth money.",
      "text": "Very easy to put together. I like the lock on feeder timer pro which is very easy to program. At 8 sec spins, dawn and dusk, I get 6 wks of operation feeding with whole kernel corn. Battery life is a good 3 -4 months depending upon brand. Great feeder for the money. I use it for deer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kickinback",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "I’d buy again",
      "text": "I bought 3. Set up is easy. Watch YouTube video and you don’t even need to read instructions. Comes with everything you need minus the battery and corn. All 3 of mine are still working great 3-4 months now. Battery is still at 100 percent feeding twice a day for 7 seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Buy the solar charger...",
      "text": "People who complain about this breaking are retarded....I have not had any problems with it and I know for a fact there are critters around. Set up for deer now I have tons of turkey feeding off it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Nice-But missing Quick-Lock",
      "text": "Just received item and when we put together it was missing the Quick-Lock mechanism. Other than that we set up the feeder fairly easy and were able to fit 4 20 lb bags of corn in it. So now we will have to wait to see if we get the quick-lock mechanism.",
      "rating": 3.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "WARNING: This product is useless.",
      "text": "WARNING: Do NOT buy this product! Read the other reviews as well! The product arrived and the throwing mechanism does not work!! Did not work from Day one!!! Buy something locally so that if you have issues you can get replacement parts locally",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Makes a great gift for a nature lover or hunter.",
      "text": "I purchased one for my husband and my father as gifts. They both are hunters and enjoyed their gift. The feeder works as described and is a great product for the price. It is easy to install, holds plenty of feed and consistently works.",
      "rating": 5.0,
      "verified": true,
      "author": "kendall",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Not that easy to assemble",
      "text": "Not that easy to assemble. Must buy additional parts to recharge the battery and keep the squirrels out.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob M",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Works as stated, easy to assemble and set up. I have 4 of them.",
      "text": "No issues with the feeder, 6v battery last for quite a while feeding 2 times a day with 8 second run time. I do not like that you need to enter the #'s of feed you put in the feeder. This is designed to save your battery and not run when empty. I just set it to 100#'s more than I put in. Better to have it run a short time with no feed than not at all with feed remaining in the hopper. Solar compatible.",
      "rating": 4.0,
      "verified": true,
      "author": "ST",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "5⭐️⭐️⭐️⭐️⭐️",
      "text": "One of the best feeeders for price , I have 2 now, 1 has been going for over a 18 months with no issues!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Matlock",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Our Wildlife ♥️‘A the feeders",
      "text": "This is the third feeder that we’ve purchased because one wasn’t enough. Easy to assemble and to set the timer. Excellent purchase! If your on the fence, make the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth F. Leopold",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Don’t waste your money on a cheap timer get something better",
      "text": "Bought feeder in mid July go start feeding deer. After 3 hour drive from home, I filled up feeder several times. So I went back September 21st to check corn and camera and noticed feeder was still full. (Never threw corn for a month). Functioned test timer and wouldn’t do crap. Motor does not work. Only lasted 2 months. I would not recommend this timer for anyone.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Comeaux",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Perfect",
      "text": "Love these feeder. Easy to install. Takes roughly 180 lbs of corn or so. Timer easy to operate. I added the rechargeable battery and solar panel to mine. No issues so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Jones",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Great buy",
      "text": "Bought this second feeder after having great success with the first. Light to carry when empty, so simple to set up, and stood up twice to gale force winds without falling or leaking.",
      "rating": 5.0,
      "verified": true,
      "author": "Skip Hunter",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Works great, enough timers to suit anybody",
      "text": "Works great, enough timers to suit anybody. Haven’t had the opportunity yet to check the accuracy of the “remaining feed” feature, but it sounds great in practice at least.",
      "rating": 5.0,
      "verified": true,
      "author": "Greenwing",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "I definitely like this model of feeder far better than our other ...",
      "text": "I definitely like this model of feeder far better than our other two but still don't have any better luck with deer using feeders than without. The big bucks like the quiet; corn on the ground.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy F.",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Moultrie feeder...YES...",
      "text": "Exactly as advertised... Very easy to program... but... In soft soil needs longer stakes, hard ground, should be OK... Not a complaint, just my opinion...",
      "rating": 5.0,
      "verified": true,
      "author": "jim kizer",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Easy to put together",
      "text": "Works great ended up ordering another one Fast shipping and simple to put together",
      "rating": 5.0,
      "verified": true,
      "author": "Kristy ",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Bringing in the deer",
      "text": "I have been using it for a couple of months now and the battery is holding up and the timer is working great. The deer are also feeding at it which it is what is supposed to happen. So far I am satisfied with this product and would recommend it to a friend",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Excellent Feeder And Set Up",
      "text": "Excellent Feeder. Moultrie has upgraded from their older models with this new feeder. They have taken the six volt batter and digital timer and have located in the bottom of the Moultrie Pro Hunter Feeder Kit. Just remove the quick-lock adapter screw and remove the bottom lid and set your time and timing feeds. So simple and secure. Thanks for a great feeder.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard W. Higgins",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Works fine when pigs don’t tear it down.",
      "text": "Easy to set-up but damn pigs tore it down the second week. Ordered replacement parts from Moultrie and will set up again this weekend. Consider chaining legs together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Good structure terrible motor",
      "text": "So assembling the feeder was easy got it all set up and programmed and the motor continuously jammed up had a moultrie 1800 feeder last year that did the same thing. Feeders not bad the motor is trash. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth Harper",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Works great!",
      "text": "So far, seems to be durable and reliable. Received on time",
      "rating": 5.0,
      "verified": true,
      "author": "T.W.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Good quality",
      "text": "Works well. I suggest the varmint guard for squirrels and raccoons.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Delivery system quit after 7 weeks!",
      "text": "7 weeks in the field running dry corn and the unit won’t consistently operate without some help. Outside temps running low 30,s to mid 40’s. The battery came new with the unit. Waited too long to Call customer service. Should have put more weight on the low reviews prior to buying.",
      "rating": 1.0,
      "verified": true,
      "author": "terry moore",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Everything it claims to be.",
      "text": "I purchased 2 of these after researching several brands. After getting them and putting them to use I went back and ordered 1 more. They were easy to assemble, set up, and program. I am still on the first batteries and have been feeding 2 times a day for 7 weeks now. Highly recommend. So do the deer!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan M.",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Don't waste your money!",
      "text": "Timer broke after 3 months, shoddy workmanship, shoddy customer service on behalf of amazon and moultrie",
      "rating": 1.0,
      "verified": true,
      "author": "AJ Luke",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Lid should be metal or somehow varmint proof. Spinner varmint guard should come standard",
      "text": "Works well until varmint get a taste for that plastic!... they gnawed through two units like cheese!",
      "rating": 3.0,
      "verified": true,
      "author": "Walid",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Not worth the money.",
      "text": "Order deer feeder extra battery and solar charger, battery will not take a charge cannot set timer feeder is useless do not waste your time ordering.",
      "rating": 1.0,
      "verified": true,
      "author": "Garrett",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Horrible product",
      "text": "This thing is horrible. Doesn’t work most of the time. Don’t buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great and easy to use",
      "text": "Works great and easy to assemble. It throws corn a good 50 feet. I did have to use longer steaks to secure it to the ground.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Well made!",
      "text": "Gift for my daughter and son in law! They loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "James W. Powell",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Easy Set Up!",
      "text": "A little time consuming with all the bolts and wing nuts but from there it was a breeze. It sets up easy and the programming was simple and worked great. I just order this second one because it was so much more easy than my others in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Great feeder",
      "text": "This feeder is top-notch. It's easy to set up works great and throws a lot of corn.",
      "rating": 5.0,
      "verified": true,
      "author": "mark e.",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Water gets inside",
      "text": "This product was perfect for about 2 weeks till water got into the motor housing. Will never buy another one of these feeders",
      "rating": 1.0,
      "verified": true,
      "author": "Charity",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Highly recommend",
      "text": "Best feeder ever. Easy to assemble and set up. Totally happy with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Burton",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Buy the \"Elite\" 8 foot Moultrie Model.",
      "text": "The Moultrie \"Elite\" Feeder Works Great! I Own 6 of Them! The Regular \"Easy Fill\" model Moultrie Feeder is too low to the Ground allowing the Deer to Eat right out of the Broadcast Spin Plate! The 8 foot Tall \"Elite\" is the Way to Go!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Poth",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "So far so good!",
      "text": "Bought this to put up at the house. Set it and my new trail camera up yesterday and got this guy in the first few hours. Easy to set up, the digital timer is great and is quick to set up. We'll see how it holds up once its been out for awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Yearego",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Moultrie tripod feeder",
      "text": "Works good. Only was able to use for week due to had to get off lease. New owner.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Tompkins",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Feeder mechanism worked one time and has never worked since ...",
      "text": "Feeder mechanism worked one time and has never worked since. As far as I can tell the electric motor burned out. When you push the test button it properly counts down. When the timer reaches 0, the entire unit powers down. Now I'm stuck with a feeder but nothing to spread the feed. There are lots of negative reviews of that particular feeder kit, so I'm not the only one.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelsey A Krapp",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Kinda cool!",
      "text": "Just as described. Easy to put together. My only concern is it throws the food a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "Bearcat Bill",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Good product",
      "text": "Works great holds lots of corn and uses little battery with a solar panel",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary B.",
      "helpful_votes": 2,
      "publication_date": 20170108
    },
    {
      "title": "Cost is reasonable, and works great. Get what pay for.",
      "text": "Cost is reasonable, and works great. Get what pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "East assembly without tools",
      "text": "The spinner came off twice from deer judging it. Needs a lock screw.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great product",
      "text": "Bought a solar panel to charge battery I recommend buying one",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie S.",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Great value and easy setup.",
      "text": "Purchased 4 of them and they set up easy and seem to be working well so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Flake",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Five Stars",
      "text": "Easy to set up and it's slings corn. Nice product",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Pritchett",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "We were very pleased when this arrived",
      "text": "We were very pleased when this arrived. However, two months later it stopped working even though the battery shows full charge. The feeder motor won't spin. The battery that came with it won't take a charge either. We can't return it because amazons return window closed after 30 days. It has been two months. We are now very disappointed, as are our deer!!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Easy to setup but timer stopped working within the first year.",
      "text": "I purchased this feeder about 6 months ago and the programmable timer is no longer working.",
      "rating": 2.0,
      "verified": true,
      "author": "ClareS",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "this is the 6 and quality are the same super good I wish they secure the top cover more",
      "text": "this is the 6 and quality are the same super good I wish they secure the top cover more, we have raccoons and they manage to open the top cover very easy",
      "rating": 5.0,
      "verified": true,
      "author": "Lazaro suarez",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Love the feeder.  Bought 4 so far.",
      "text": "One 6 volt battery last almost a year feeding to times a day on 4 seconds",
      "rating": 5.0,
      "verified": true,
      "author": "judy",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Very satisfied",
      "text": "I really like this feeder. Even I could put it together and it was easy to program. I love that it doesn’t require tools. I can’t testify as to durability or longevity yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Lambo",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Works good",
      "text": "Great feeder so far! We shall see as time goes on! Only been a week or so!",
      "rating": 5.0,
      "verified": true,
      "author": "Keifer",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Easy setup. After 2 weeks of feeding twice a ...",
      "text": "Easy setup. After 2 weeks of feeding twice a day, battery still at full charge. Remaining feed indicator not accurate. Good spread of food. Deer and raccoons like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 2,
      "publication_date": 20171011
    },
    {
      "title": "Ya get what ya pay for.",
      "text": "I have tried cheek feeders. Save your $. This one works great and lasts for years. The boys like too.",
      "rating": 5.0,
      "verified": true,
      "author": "gatorman1",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble, variable leg height is great, other moultree products have stood the test so have no doubt this one will as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard B.",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Five Stars",
      "text": "bear tore up my old feeder...this one is still standing after six months",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Does not include battery",
      "text": "I bought two of these Assembled quick and easy, Works perfect. Holds 4 50# bags of corn",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly cates",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Good quality, but field testing will prove its worth.",
      "text": "Package came damaged (see pictures). Only thing missing was one wing nut. Seems like good quality. Will add to review towards the end of the year after it has been field tested.",
      "rating": 4.0,
      "verified": true,
      "author": "CJD ",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Super easy to assemble and setup.",
      "text": "Super easy to assemble and setup. Comes with pre-drilled holes in the feet supports to allow staking the feeder to the ground to prevent tipping over by the hogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Scorsone",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Lasted one season",
      "text": "Main control board went out after one season. Very disappointed after doing so much research and finally deciding on this one.",
      "rating": 1.0,
      "verified": true,
      "author": "david kuschel",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "So Far So Good",
      "text": "No problems so far other than I have not received the battery I ordered. Temporarily using the battery from my Mojo. Solar charger is keeping the battery full. Easy to set up and run. No varmint problems as of yet.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan R",
      "helpful_votes": 2,
      "publication_date": 20170212
    },
    {
      "title": "Complete Junk",
      "text": "I have four, the timers and motors were toast in a year, Moultrie is garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "chad beach",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great",
      "text": "After using for a year, it works great and I have no problems at all",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Howard",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Five Stars",
      "text": "Love it, not much more to say. Works as it should.",
      "rating": 5.0,
      "verified": true,
      "author": "Florida Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "worked great for a year",
      "text": "Feeder worked great for about a year and then the motor went out. Had to buy a new motor after I replaced the battery and solar panel figuring those were the cause of the problem.",
      "rating": 3.0,
      "verified": true,
      "author": "texas",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Five Stars",
      "text": "Well made, works perfectly. Need to get A few more.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig lazzaro",
      "helpful_votes": 2,
      "publication_date": 20170502
    },
    {
      "title": "Five Stars",
      "text": "works great, bought a 2nd one since the first one works so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Bane S. Cox",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "easy assembly, easy to program",
      "text": "easy assembly, easy to program, works great, just hope it lasts longer than the wildgame products, time will tell. also great price, ships fast if you pay the extra yearly fee from amazon (not crazy about that).",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Great product, Great price.",
      "text": "2 days after set up, we captured pics of multiple deer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen M.",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Appears to be well made and of good quality.",
      "text": "Ordered for a family member. Arrived promptly. Gave it 4 stars initially as the square legs and \"quick lock\" features don't seem as robust as the old round legs and screw attachments. Hope we will be pleasantly surprised. We will see how this one stacks up to the \"old\" Moultrie feeders we've had in the woods for years. Feed capacity seems the same. Motor and timer appear the same, just changes in legs, motor and funnel attachment. Hope they hold up as well as the old \"round leg\" feeders. Will also see how the twist lid fares over the positive lock catch older version. Time will tell.",
      "rating": 4.0,
      "verified": true,
      "author": "David G.",
      "helpful_votes": 2,
      "publication_date": 20170326
    },
    {
      "title": "N/ A",
      "text": "works great, but it did not include instructions on how to set the timer.",
      "rating": 4.0,
      "verified": true,
      "author": "ANDY MAC",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Feeder",
      "text": "Have not used it yet but it was easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "thomas moore",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Keep them coming on schedule.",
      "text": "Perfect size for 6 week + cycles, accurate timer with good impeller.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Henry",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Waste if money",
      "text": "Do not buy this. Made of cheap plastic. Squirrels are through it, and the feeder quit working less than a year old. Waste if money!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170907
    },
    {
      "title": "What a joke!",
      "text": "What a joke! Half the product missing, retapped box. They must think I am a idiot to accept this like this! I need it now too! Special 100 mie trip to BassPro now, question is whether I but Moultree - doubt it. I only have 28 of their cameras. Jeez!",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony L. Hough",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "\"Appealing to the Critters\"",
      "text": "Set it up and it has drawn a lot of critters.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Gary Keith",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Get a solar charger",
      "text": "Very reliable bought solar Charger and batter is Still fully charged after one month",
      "rating": 5.0,
      "verified": true,
      "author": "Everett Kelly Craig",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Get them feeding!",
      "text": "Easy to set up, no tools required... only one star off because the feeder cracked where it twist locks to the bottom. It's made out of cheap plastic on the timing module, would recommend the manufacturer to use aluminum next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Poor quality",
      "text": "Bought 2 not over 3 months old. 1st one water got into the electronics. 2nd racoons chewed a hole in the lid.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Five Stars",
      "text": "This product is perfect. It's extended legs allow for the feeder to feed in larger areas.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Kyser",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "The life span of batteries and reliability.",
      "text": "I really like the life span of batteries in all of my Moultrie feeders.",
      "rating": 4.0,
      "verified": true,
      "author": "Eddie P. Taylor",
      "helpful_votes": 0,
      "publication_date": 20191113
    }
  ],
  "product_meta": {
    "title": "Moultrie Deer Feeder Elite",
    "description": "Set multiple daily feeding times of your choosing, make the feeder short or tall and get the durability of metal moving parts, with a wind-resistant metal spin plate and Funnel. A UV-resistant plastic quick-lock hopper assembles in a snap, no tools required. Just insert the hopper into the kit and twist! new square, locking legs and feeder feet add stability to the already-awesome deer feeder Elite, which features a 360-degree feed pattern.",
    "rating": 4.4,
    "feature_bullets": [
      "Digital timer programs up to 6 feed times per day, 1 to 20 seconds each",
      "Durable, green plastic Quick-Lock hopper with a fill height adjustable to 5. 5, 7 or 8 feet",
      "Metal spin plate and funnel, plastic housing; built-in varmint guard, feed-level estimator, battery indicator, external power port",
      "Can be used pellets less than 0. 25 inch in size, the diameter of the stake hole on the feeder feet is approximately 0. 625 inch",
      "One (1) 6-volt battery required, metal feeder feet included"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "18.5 x 24.5 x 25 inches; 20 Pounds",
      "Item model number": "MFG-13062",
      "Department": "Unisex-adult",
      "Date First Available": "February 2, 2016",
      "Manufacturer": "Pradco Outdoor Brands",
      "ASIN": "B01BE3EURU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Hunting Accessories",
      "Game Feeders & Accessories",
      "Sports & Fitness",
      "Hunting",
      "Hunting & Fishing",
      "Game Feeders"
    ],
    "price": ""
  }
}