{
  "website_summaries": [
    {
      "verdict": "A unique set of 12-inch subwoofers that makes it easier to place and install in vehicles with minimal set up, cutting, and drilling.",
      "pros": [
        "Combines two 1200-watt dual loaded subwoofers in a single, durable box",
        "Comes with a 1500-watt amp that is compatible with most factory-installed and aftermarket stereo systems for easy setup",
        "Can be placed virtually anywhere in the interior with just a few mounting holes"
      ],
      "cons": [
        "Larger box takes up more space than most other 12-inch subwoofers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Subs, cheap wires",
      "text": "Love the subwoofer and amp! The wiring kit is what brought it down to 4 stars. I took my kit to Custom Audio Concepts (very respected) and the installer (who wasn't just a kid) refused to install the wiring kit in my car. He even said he used to install car audio \"in the hood\" and would never have installed these. Mentioned that there are tweeter speaker wires that are thicker than these. But overall very pleased with the subwoofer and amp. It shakes my lanyard on my rear view mirror on only half volume!",
      "rating": 4.0,
      "verified": true,
      "author": "David Stewart",
      "helpful_votes": 20,
      "publication_date": 20171014
    },
    {
      "title": "Good value, buy a separate amp wiring kit though",
      "text": "Overall very content. I'm not too bass hungry so I opted for a sealed enclosure instead of ported/vented. I also opted for the Planet Audio amp instead of the MTX brand amp because I heard the MTX amp has issues with overheating. I also didn't want a generic brand amp like BOSS or Crunch, no offense. One thing to note is that the wiring for this kit is GARBAGE. Do not under any circumstances use the amp wiring kit provided in this package. I ordered a separate kit online. The 8 gauge wiring provided is way too thin, I'd go so far as to call it speaker wire.",
      "rating": 4.0,
      "verified": true,
      "author": "sanchezm",
      "helpful_votes": 9,
      "publication_date": 20180505
    },
    {
      "title": "Yikes",
      "text": "The speakers sound good and work well but.... it took me 3 hours just to figure out how to install some of the wires and after that I had the power wire coming from the battery to the AMP start burning. So I took my car to Best Buy to have them install it and just for new wires it was $100 along with a $200 instillation fee. So in the long run these speakers are gonna be around $400-$500 WITHOUT instillation. Save yourself some trouble go to a local store such as Best Buy and just pick them out and have them install them saves money and hassle.",
      "rating": 2.0,
      "verified": true,
      "author": "Aincrad Reborn",
      "helpful_votes": 4,
      "publication_date": 20190312
    },
    {
      "title": "Updated! Great bang for buck!",
      "text": "For this price it's hard to find sound like this! They have held up strong for a month now. I've put over 100hours of sound through them. Their still kicking! These are a great combo. Can't beat the price. My personal opinion is that it is nice they give you a wiring kit but it's best to just buy an upgraded wiring. I went with a six gauge wiring.",
      "rating": 5.0,
      "verified": true,
      "author": "Pinkley",
      "helpful_votes": 35,
      "publication_date": 20170409
    },
    {
      "title": "love it its a great start off package except the ...",
      "text": "love it its a great start off package except the wiring kit its not strong enough but the subs and amp works great doesnt take up space barley got the bass knob at half and it knocks hard.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 11,
      "publication_date": 20170428
    },
    {
      "title": "MTX subs with planet audio 1500 watt amp",
      "text": "this is the best buy for the price and as a ready to hook up set. I have no complaints about the subs or amp. The only thing that i wish a little bit better was the speaker wire, to me it seemed to thin. So i bought some thicker wire and used that instead. But other than that very happy with it for my first set up. should last along time. Would recommend to anybody!",
      "rating": 5.0,
      "verified": true,
      "author": "Dean a.",
      "helpful_votes": 36,
      "publication_date": 20160531
    },
    {
      "title": "Just what I wanted, and at a great price.",
      "text": "These subs were cheap and I was not expecting much, but I am so happy I bought them. They sound great and I have been using them for a couple months now. Only recommendation would be buying larger power and grounding wires. I am using 4 gauge as opposed to the very thin 8 gauge included in the wiring kit. Besides that minor draw back, I am very pleased and would recommend this item to everyone interested in budget-friendly subs.",
      "rating": 5.0,
      "verified": true,
      "author": "Noah",
      "helpful_votes": 2,
      "publication_date": 20180807
    },
    {
      "title": "Great Value version of name brand product.",
      "text": "I'v had a better sounding system. Sound quality I rate 3, bang for your Buck I rate 5. Your not going to find anything cheaper, at this quality. It has a big boom. Not saying its terrible iv just had better.",
      "rating": 4.0,
      "verified": true,
      "author": "Britney",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "I recommend just getting a new wiring",
      "text": "I got them installed today and damn they bump so loud the only problem is the wiring kit its not a true 8 gag wire so, I recommend just getting a new wiring kit",
      "rating": 5.0,
      "verified": true,
      "author": "Darren Mihalic",
      "helpful_votes": 2,
      "publication_date": 20180119
    },
    {
      "title": "Terrible buy, status away from these.",
      "text": "Bought these for Christmas 2018 (less than 4 months ago) and the subwoofers already blew. I had the bass boost all the way down the entire time since day one and I added minor bass with the knob it came with. Truly disappointed with this company.",
      "rating": 1.0,
      "verified": true,
      "author": "Maylen Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "An experienced installer recommended to use a 4 gauge wiring kit for this",
      "text": "The amps & subs works great after gettin it professionally installed in 08 Chevy Impala.The wiring kit i was told by the experienced installer is trash & not needed so he used a 4 gauge wiring kit copper for my hook up & it does sound amazing. I did not know the amp came with a subwoofer level knob but that for me wasnt needed but it most definitely was a bonus",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Pierce",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Great buy!",
      "text": "Great bass, very well paired amp and subs. Easily sounds as good and even better than more expensive setups. 2019 and still going strong in sons second car.",
      "rating": 5.0,
      "verified": true,
      "author": "tfl",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Terrible Quality and customer support",
      "text": "The AMP fried in 7 months, and the speakers blew in 13 months. I purchased the extended warranty from Square Trade and they are HORRIBLE!!! DO NOT Purchase extended warranty as they will take 2 weeks to respond, and then tell you to bring your speakers to a local shop to have them repaired and then send your receipt and hope they refund you in amazon gift cards. Terrible terrible service I’m very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "The important thing to know that I would suggest is to upgrade the wiring kit",
      "text": "Super fast shipping!!! I place my order on July 31, 2018 Two days later August 2, 2018 my speakers amp and wiring kit all came at the same time and I must say for the price It’s worth the cost specially If you trying to add some extra bass to your ride",
      "rating": 4.0,
      "verified": true,
      "author": "Mr.3000",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Best to buy a New England 4 gauge wiring kit",
      "text": "This system provides amazing Bass I can't believe how good it sounds for the money it is but I had to upgrade the wiring kit because it was kind of tiny and weak to a better wiring system",
      "rating": 4.0,
      "verified": true,
      "author": "Robert L. Albers",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Decent sound for a decent price",
      "text": "So far so good sounds pretty decent for the money although they arrived split up 1day apart but still..... Only thing I don't like is the wire kit they give you not a true 8 gauge wire but I called and they refunded what I had to spend for a new wire kit so pretty happy!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Cletus Bagby",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Amazon and the third part that’s sells this is in false advertisement",
      "text": "I bought this and it did not come with my amp or install kit I’m not happy at all why advertise the whole kit if u only given the speakers only this is bs I’m so pissed I could have save my self 70 bucks if this the case I want to give 0 stars for this ba",
      "rating": 1.0,
      "verified": true,
      "author": "Korryj",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Good subs and sound but amp didn't work",
      "text": "It come fast shipping and everything but when I went to get everything install the planet audio amp didn't work no bass at all had to return but otherwise good sub box and put a 1200 amp on it and it bumps",
      "rating": 5.0,
      "verified": true,
      "author": "john moore",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "All amazing...except wiring",
      "text": "Subs: Absolutely insane Amp: Powerful and great Wiring: Cheapest thing ever. If you get these subs, it’s a great deal and worthwhile, but invest in some quality wires for the job. These little 1/8 inch plastic chinese cables won’t get the job done",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Good for the price",
      "text": "had it alittle more than a month and i must say for the price this subwoofer is amazing. hits hard with my stock audio speakers and has yet to overheat on me. would recommend getting different wires though.",
      "rating": 5.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 2,
      "publication_date": 20180224
    },
    {
      "title": "Hits lows well",
      "text": "Overall good subs, have a few songs that really hit good. Doesn’t hit the mids to well but does hit the lows really nice. Paired it with a 45 dollar headunit by boss and I love it. Does overheat sometimes if you’re really banging for 3+ hours (long road trips) but just turn it down via the bass controll nob for awhile and it’ll be good as new!",
      "rating": 5.0,
      "verified": true,
      "author": "Larry M",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Very simple and sounds amazing!",
      "text": "I was very happy with this purchase. A lot of systems can be difficult or annoying to set up and install but this was very simple and not very time consuming. Works great and I have had it for a while now with not a single problem with it!",
      "rating": 5.0,
      "verified": true,
      "author": "jeremiah darwin",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Fast Delivery",
      "text": "Not too bad for the price, however wires aren't all that good & amp isn't that powerful. Wasn't loud as I wanted to be, something go to start out with! A lot better than factory speakers.",
      "rating": 4.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 2,
      "publication_date": 20170506
    },
    {
      "title": "Quality is not found here.",
      "text": "I didn’t like the quality of the wires. There was more plastic surrounding the wires than there was of actual cable wire to move the current load. And get this theres no return policy. How are we supposed find quality in sound without there being a good wires. So I purchased 300 dollars more of materials including a new Amplifier.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Affordable and do able",
      "text": "They work and still sound good. Tuned the amp and let them have it and told them leave the amp alone here is your bass knob have fun",
      "rating": 3.0,
      "verified": true,
      "author": "Mike Pruitt",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Smells",
      "text": "Used larger wires than the wirekit that was provided. Sounds amazing. Has a smell of plastic but it goes away with time",
      "rating": 5.0,
      "verified": true,
      "author": "Lula",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "High quality",
      "text": "Amazing for the price you can't beat it. Just don't use the wiring kit that comes with it",
      "rating": 5.0,
      "verified": true,
      "author": "Haydon",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Get a bigger amperage wiring kit",
      "text": "The Subs are great!! The amp and wiring kit were delivered earlier than the subs were but its no biggie. The wiring kit that came with the amp was kinda small so I bought a bigger kit. Other then that the sound of them are great its deep and hard hitting. Its a good startup kit for beginners.",
      "rating": 5.0,
      "verified": true,
      "author": "McCabe127 ",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Awesome !",
      "text": "Very great product for the cost produces a lot of bass which I was surprised for a ported box , ive since putting the box in had to fix a couple loose parts on my vehicle because of the vibration . Great product. Be parpared to get product from two different shipping agents .. be patient the box will come.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex M.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Perfect for the ride",
      "text": "I love this item, I will continue to do business in the future",
      "rating": 5.0,
      "verified": true,
      "author": "kelly",
      "helpful_votes": 3,
      "publication_date": 20170325
    },
    {
      "title": "Comes with all hardware you need makes for easy install",
      "text": "The unit works great sounds wonderful the only thing is can't tell a difference when you adjust the bass controller and I went and order the wire upgrade kit ,after some adjustments on the amp sound great thanks for the great product",
      "rating": 5.0,
      "verified": true,
      "author": "James Wells",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Think it's the amp",
      "text": "It stopped working after a day. Everything's hooked up right, had the amp mounted to the sub, then my subwoofers stopped hitting. It's grounded properly , the spot was sanded down, connections good,",
      "rating": 1.0,
      "verified": true,
      "author": "Ej",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Four Stars",
      "text": "Awesome sound for the price you can feel the bumps 👍🏼",
      "rating": 4.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 3,
      "publication_date": 20170418
    },
    {
      "title": "Three Stars",
      "text": "Great Subs and Amp but would NOT put those cheap flammable wires in my car.",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 3,
      "publication_date": 20170918
    },
    {
      "title": "great system",
      "text": "they sound great i strongly recommend getting different cords for install, i'm really into audio systems so i'm picky. the cords they give are kinda bum compared to what i'm used to but everything else is perfect! very satisfied",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Quality",
      "text": "It came with almost everything I needed to install it into my 2017 Honda civic, just make sure that if you are installing it to stock you may need an adapter to integrate the sub into the system. It sounds amazing and I learned a few things about my car when installing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Feder",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Definitely Recommend",
      "text": "Amazing quality and the best bang for your buck! Really impressed with the sound! Definitely recommend this package",
      "rating": 5.0,
      "verified": true,
      "author": "Emerson Harper",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Great",
      "text": "Great sound for cheap easy installment if you know what you are doing definitely would get",
      "rating": 5.0,
      "verified": true,
      "author": "Johnathan Ariss",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Three Stars",
      "text": "Good setup amp is kinda trash speakers are great, I suggest getting another amp",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170919
    },
    {
      "title": "Unit was easy to install",
      "text": "Unit was easy to install. Looks great in my sons jeep cherokee. Sounds great. Only bad thing is that the amp doesnt work when he connects to his radio via bluetooth. He has to use a bluetooth receiver. Other than this issue, good buy",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald Holmes",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "This setup thumps hard....",
      "text": "These things pound, but you'll need a 4 gauge wire kit. It's too many watts to push through the 8 gauge that comes with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Woodruff",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Awesome deal, Full powerful bass",
      "text": "I used my own 4 gauge wires instead of the smaller ones that come with it, in order to handle the power. The sound is full and not distorted even at loud volumes. I’ve used a few different MTX products and I haven’t been let down yet.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Can’t beat it",
      "text": "An amazing set of subs for the price. Comparable to subs twice as expensive. The sound quality is unbeatable for the price, and the installation was a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "kaleablree",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Must buy asap.",
      "text": "So happy I got this came faster then expected also in mint shape hits hard love it definitely a good buy. Wish it came with 4 gage wires but price for this package deal can't beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "The amplifier is not so great",
      "text": "Good sound for the price however the 1500 watt amplifier is not truely a 1500 watt (view the Dyno test on you tube) overall this would be a good system for a beginner I just expected a little more power",
      "rating": 3.0,
      "verified": true,
      "author": "Steven English",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Great quality",
      "text": "I bought these sounds as a early birthday gift for my fiancé and he loves them they really have a knock to them. The only con I have is the amp gets hot and takes a while to cool down.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Murray",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Great overall value.",
      "text": "Loved the subs, box and amp- they work great. Great value for the money. Only thing I didn't care for was the wiring kit, because it was small (gauge). Overall great. Would order from again.",
      "rating": 4.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "The amp kit will not work on this amp & speaker to small of a gauge",
      "text": "I like the speakers but the amp kit I could not use had to buy one with a larger gauge of wire",
      "rating": 3.0,
      "verified": true,
      "author": "Michael R yan Doss",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Terrible",
      "text": "Only received the subs. No amp. No wiring kit. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler Stulich",
      "helpful_votes": 3,
      "publication_date": 20180822
    },
    {
      "title": "Great value",
      "text": "This is an awesome system. My son got it for his 16th bday and is absolutely loving it. It is a good value for what you get.",
      "rating": 5.0,
      "verified": true,
      "author": "barbv",
      "helpful_votes": 2,
      "publication_date": 20160727
    },
    {
      "title": "Great gift",
      "text": "My son loves this, he had it installed by Best Buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "08 dodge",
      "text": "It toke a couple hours to run wires but sounds amazing in my truck",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Great Quality Product",
      "text": "Bought this for my son for Christmas. He hooked it up that day. He loved the sound from this subwoofer. Thank for the smile on my sons face.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Kowalski",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Would buy again",
      "text": "I love them. Sounded better then expected and also fits in my 2008 Elantra trunk and has a lot of space left.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "Its a bad disappointment from a product that is rated so good",
      "text": "Recieved my speakers with broken box had bent skrews and stripped out holes. Ill fix my review and let you know how long it takes to get this fixed. Its a bad disappointment from a product that is rated so good.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven Phelps",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Make sure you always get a good ground or it won’t work",
      "text": "Just amazing sound ever for the little price honestly it’s a 10/10 review for me sound is exactly like I wanted it. Very simple to install",
      "rating": 5.0,
      "verified": true,
      "author": "Ezra Hughes",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Clear sound clean bass if tuned right",
      "text": "Pounding bass awesome price run a 2 gauge power cable and your good to go",
      "rating": 4.0,
      "verified": true,
      "author": "william",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Best sounding subs for the price!",
      "text": "I love the subwoofers! They hit pretty hard. Especially the lows and the price is really good for the quality",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff ",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Great Product",
      "text": "Purchased for my grandson's car. He absolutely loves the system.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Very Fast Shipper",
      "text": "My Son loves his \"boom\" system :) Very Easy to Install as well Thank you for being a loyal company :)",
      "rating": 5.0,
      "verified": true,
      "author": "Shantel Pledger",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Fits well",
      "text": "Perfect product, easy to install, sounds very good, fits well.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Roland",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Good deal",
      "text": "Love them they hit hard worth the money just don't like the wire kit it comes with but is still worth getting. The amp lights up had a Lot of power",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Canas",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Tune it just right before you turn it all the way up",
      "text": "It’s well worth the money sounds great Only thing is make sure before you buy check the back of your stereo for the hook up or get a new stereo. Other then that it’s worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley87",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Well worth the money",
      "text": "Best sub woofers and amp drives hard and sounds good I recommend them highly",
      "rating": 5.0,
      "verified": true,
      "author": "Earl",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "The wires aren’t good",
      "text": "You may need to buy better wires but the subwoofer and amp are great for the job",
      "rating": 5.0,
      "verified": true,
      "author": "Hayden",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Five Stars",
      "text": "Great product, great deal and easy installment. Love it!!! Would definitely recommend to anyone",
      "rating": 5.0,
      "verified": true,
      "author": "Twonni-D",
      "helpful_votes": 2,
      "publication_date": 20180513
    },
    {
      "title": "Five Stars",
      "text": "Everything was great! Best bang for the buck I've got in a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160905
    },
    {
      "title": "Great Subwoofer",
      "text": "I’ve had the kit for about 6 months and it’s been great except for me having to replace the wires.👍",
      "rating": 5.0,
      "verified": true,
      "author": "Fatality",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Works great",
      "text": "These subs work very well, still going strong after two years",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Send me my amp",
      "text": "The amp did not come with the speakers that I had purchased pissed off about it",
      "rating": 2.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Box is very heavy.",
      "text": "I like the detail in the construction of the sub box in which I use to shut the competition down. 😄",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Patterson",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Great deal, great quality",
      "text": "Easy installation, amazing sound quality and great customization options on the amp. All in all a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Wyatt Lokken",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Package Comes In 3 Days👍🏿",
      "text": "Nice everything was good except the wire package speakers banging an the amp pushing like a 3500 watt amp Amazon Really Know What I like 💯👌🏿",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Four Stars",
      "text": "Subs and amp are good. But terminals on box were broken off when it arrived.",
      "rating": 4.0,
      "verified": true,
      "author": "William Courtois",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Box was damaged from being packed thought they punctured one of my speakers",
      "text": "I love it looks nice box was heavily damaged thought that they punctured my speaker but everything was fine can't wait to hook it up so I can see what it sounds like",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce G Atkinson",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Five Stars",
      "text": "Amazing sound is on par with any super high end expensive sub would recomend.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Five Stars",
      "text": "Easy hookup and hits dang hard! Amp has plenty of power for these subs!",
      "rating": 5.0,
      "verified": true,
      "author": "Corey Jenkins",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great Product",
      "text": "Thank you I will recommend you to my friends it arrived very quickly and the product sounds great",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Wilson",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Five Stars",
      "text": "These are some bumpin speakers and came with everything you need, but it came in a ugly box",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Awesome sound quality",
      "text": "Awesome sound quality! Arrived quickly and packaged well. Easy to install and get to working. Clear deep bass. Well put together. Would recommend to anyone looking for a sub set for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "MELENDEZ FAMILY",
      "helpful_votes": 3,
      "publication_date": 20170324
    },
    {
      "title": "Great subs not so great amp.",
      "text": "The subs punch pretty hard! Now things you'll need are better cables and a better amp. My suggestion dong get this package. Buy the subs by themselves or look for a different package.",
      "rating": 4.0,
      "verified": true,
      "author": "Misael Guzman",
      "helpful_votes": 4,
      "publication_date": 20170501
    },
    {
      "title": "Five Stars",
      "text": "Subs work great so does amp, wiring kit is bad though need to upgrade",
      "rating": 5.0,
      "verified": true,
      "author": "Billy Mounce",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Perfect starter speakers",
      "text": "The speakers are absolutely amazing nice beat for a decent price.",
      "rating": 5.0,
      "verified": true,
      "author": "DeAndre R.",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "EXCELLENT SOUND & EXCELLENT DEAL!!!! 👍🏻👍🏻⭐️⭐️⭐️⭐️",
      "text": "Bought this for my 20 year old daughter for Christmas. I worried if I had everything needed for my husband to install for her that day. It was so easy! Everything needed was included. Took my husband about 3 hours but he is a perfectionist and made it look as if it was factory installed. The sound is perfect. It's not garbled like a lot of her friends stereos. Very clear and very loud. She was extremely happy!!! Thank You guys!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 8,
      "publication_date": 20170102
    },
    {
      "title": "Five Stars",
      "text": "These bump hard they are nice and clean absolutely satisfied !!!!!!!! Yup fantasizing I installed them today they hit hard",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20161107
    },
    {
      "title": "you get what you pay for. It isn't as ...",
      "text": "you get what you pay for. It isn't as loud as i had hoped but it does the job for how cheap it is.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill Zink",
      "helpful_votes": 4,
      "publication_date": 20170131
    },
    {
      "title": "Great sound!",
      "text": "Fantastic sound, easy installation. Great product! Speakers look and sound really awesome; makes a good stereo really rock! I installed a good Sony head unit and replaced six factory speakers with good pioneer speakers; the system sounded really good at that point. With the amp and sub, it is at an entirely different level. Not gaudy or cheap; really crisp and clear sound with tremendous bass. Comparable to the Mark-Levinson systems in my Lexus's. In order to save space I bolted the amp to the top of the speaker box. Wiring was easy, and installation instructions were clear and easy to understand.",
      "rating": 5.0,
      "verified": true,
      "author": "The Kernel",
      "helpful_votes": 6,
      "publication_date": 20161123
    },
    {
      "title": "You better get em",
      "text": "Awesome...Awesome...Awesome.... they bang, and for the price you CAN'T go wrong...amp is decent but I'll probably upgrade it later... seller is also awesome... entire package (subs in box, all wires, bass knob, and amp all came together in 2 boxes on the same day which was about 4 days early!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Karl",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Very nice",
      "text": "Very nice combo here... The only thing I have to say that's bad is that the ground and power wires are to thin that come with it",
      "rating": 4.0,
      "verified": true,
      "author": "austin kempfer",
      "helpful_votes": 6,
      "publication_date": 20160806
    },
    {
      "title": "Four Stars",
      "text": "There good starter subs but you need to tune them to your sound preference they hit hard.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160615
    },
    {
      "title": "The cables that come in this kit aren’t compatible with ...",
      "text": "The cables that come in this kit aren’t compatible with the amp. They can’t provide enough power for a 1500 watt and can literally start your car on fire.",
      "rating": 2.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 3,
      "publication_date": 20180119
    },
    {
      "title": "Good bass but not as good as a ported system",
      "text": "Product seems quality, worth the buy for the money. Good bass but not as good as a ported system. I plan to port this box myself and see how it works out. I am expecting it to work out even better.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaxon J. Klink",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "They can also handle a great amount of power",
      "text": "I was slightly skeptical, but after reading the reviews I gave it a shot. These subs hit high, mids and lows very well. They can also handle a great amount of power, they are loud, and they really do hit hard. The amp that comes along with it is also a perfect matchup. Overall these are well worth the money. The only thing that could be done better is if the box was ported, which you can do yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160809
    },
    {
      "title": "Perfect",
      "text": "Perfect for my 16 year old son. He's not looking to compete in stereo competitions, but it did everything he wanted and more.",
      "rating": 5.0,
      "verified": true,
      "author": "jemett3",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "... skeptical to buy these subs and amp but im glad i did",
      "text": "I was skeptical to buy these subs and amp but im glad i did. These are better than i expected. The only thing i changed where my wires, i changed them to 4ga ofc wiring and it came out great.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Ortega",
      "helpful_votes": 2,
      "publication_date": 20160829
    },
    {
      "title": "... that i did not expect them to be as good as they are",
      "text": "I can honestly say that i did not expect them to be as good as they are. For the price you can absolutely not Beat It the only reason I gave it 4 stars is because they have trouble hitting high notes but like I said for the money you can't beat it",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph dehaven",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Five Stars",
      "text": "Nothing bad to say great product all around would recommend it to a friend",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160921
    },
    {
      "title": "Worth it",
      "text": "Way worth it for the money you spend. Ive always had nice sound systems in my cars and these subs are perfect for someone that just wants nice quality sound",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler D.",
      "helpful_votes": 3,
      "publication_date": 20170809
    },
    {
      "title": "Five Stars",
      "text": "Very nice package deal, bass knob comes in handy and sounds great in a 2005 Saturn Ion3",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160821
    },
    {
      "title": "Great sound!",
      "text": "Really loud and great sound. You do need some trunk room.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20171020
    }
  ],
  "product_meta": {
    "title": "MTX TNE212D 12\" 1200W Dual Loaded Car Subwoofers + Box + Planet 1500W Amp + Kit",
    "description": "This is a complete package! Package includes, MTX loaded car subwoofer system with Mono amplifier and complete amplifier installation kit! The MTX TNE212D combines great subwoofer design with perfect enclosure design to deliver bass that far exceeds expectations. The unit is a dual 12\" sealed enclosure that has a single terminal cup showing a final 2O load to any connected amplifier. The Terminator subwoofers used in the enclosure include polypropylene dustcaps that are durable allowing them to survive the rigors of most trunks and are lightweight allowing them to efficiently move using less power. Each subwoofer can handle 200 watts RMS power, resulting in a power level of 400 watts RMS/800 watts Peak for the entire enclosure. The subwoofers also incorporate Spider Plateau Venting, which is a mechanical cooling process that allows the subwoofer to continually refresh the air around the voice coil helping to dissipate the heat generated during extended play. The enclosure itself is made using extra strength 5/8\" MDF (medium density fiberboard) which is the preferred material for subwoofer enclosures. Where other manufacturers only use a 1/2\" board, the MTX 5/8\" board is stronger ensuring that the enclosure can contain the massive low frequency sound waves generated by the subwoofers without problems. Thunder Bass, Hard hitting Dual 12 inch MTX subwoofers Designed For SPL, Rock your car and the neighborhood! Easy Installation, Mounts quickly in most trunks and SUVs We are an authorized MTX dealer!",
    "rating": 4.4,
    "feature_bullets": [
      "**Subwoofer:**",
      "New MTX TNE212D 12\" 1200W Car Subwoofer Enclosure",
      "1200 Watt Max",
      "400 Watt RMS",
      "Rubber Surround"
    ],
    "specifications": {
      "Product Dimensions": "32 x 16 x 16 inches",
      "Item Weight": "58.1 pounds",
      "Manufacturer": "MTX",
      "ASIN": "B01BGW8GOM",
      "Customer Reviews": "4.4 out of 5 stars304 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#83,836 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 25, 2016"
    },
    "categories": [
      "Subwoofers",
      "Car Audio",
      "Electronics",
      "Component Subwoofers",
      "Car & Vehicle Electronics",
      "Car Electronics"
    ],
    "price": ""
  }
}