{
  "website_summaries": [
    {
      "verdict": "A solid investment that has more to offer than others on our shortlist. The hands-down best model money can buy.",
      "pros": [
        "Exceptionally smooth ride, rugged construction, convenient features, and versatile jog or walk capabilities",
        "Boasts 9 seating positions"
      ],
      "cons": [
        "At almost 40\", its folded position is a bit large",
        "It's also expensive, but you might not mind, considering the quality"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love the stroller over all but since Britax owns them ...",
      "text": "I love the stroller over all but since Britax owns them and made some changes the fabrics seem thinner, the hood flaps are thin and don't Velcro as they did before just cheap feeling loops now. Biggest complaint is they changed the front wheel the quick release was fantastic this design not so much.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew McCallum",
      "helpful_votes": 25,
      "publication_date": 20170404
    },
    {
      "title": "Love it.",
      "text": "Can't say enough. We love this. We have 3 kids 2,4,6 and when they are all exhausted they can actually all snuggle in here just fine and ride.",
      "rating": 5.0,
      "verified": true,
      "author": "TheMrs.R",
      "helpful_votes": 13,
      "publication_date": 20160927
    },
    {
      "title": "Beast of a Stroller",
      "text": "This stroller is ridiculously easy to push and navigate but it is a beast and weighs over 40 lbs. I didn't realize that when I purchased it. It cannot easily be used as an everyday stroller and is difficult to fit in the rear of an suv and almost impossible to get back out of the suv by yourself so I had to purchase a 2nd double stroller for everyday use. That being said, it's perfect for walks and outdoor adventures as it will go over any surface type without a problem. It is the Humvee of strollers.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly F.Top Contributor: Baby",
      "helpful_votes": 4,
      "publication_date": 20180620
    },
    {
      "title": "Love!",
      "text": "The best product I bought for my twins. This has been a lifesaver for transitioning from one baby (and our single BOB), to two babies and a toddler! My twins have enjoyed this smooth ride since early on, and the front part serves as a seat for my toddler. The basket underneath is huge and the quality you would expect from a BOB is here in all the little details. This is perfect for walks around the neighborhood, jogs on the track, long runs, and hikes up decent trails. This is worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 2,
      "publication_date": 20171116
    },
    {
      "title": "Great stroller.",
      "text": "Great stroller. I couldn't recommend anything else. It's just a pleasure to have around and it pushes and folds up really easy. It's wide so it wont fit through narrow areas but it will fit through any ADA doorway.... which should be every commercial and business door. Accessories for it like the table is a must, kids love it.",
      "rating": 5.0,
      "verified": true,
      "author": "SupaF1y",
      "helpful_votes": 8,
      "publication_date": 20170109
    },
    {
      "title": "Love the double stroller but I don't understand why it ...",
      "text": "Love the double stroller but I don't understand why it is taking so long to release the car seat adapter. This stoller has plenty of room for my 3 year old and 5 month old. I have not run with it yet bc my son is too young but I have done plenty of walks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 10,
      "publication_date": 20160702
    },
    {
      "title": "We heart BOB",
      "text": "We had the single BOB but we just had another baby so obviously we chose the BOB side by side. It has tons of room for both our babes and tons of storage. It’s easy to maneuver just like the single BOB stroller and fits through MOST doors. You might have to go into some doorways at an angle and it might also be a tight squeeze but it should go through. Enjoy!! XO",
      "rating": 5.0,
      "verified": true,
      "author": "MsBrittany15",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Good stroller - but overpriced",
      "text": "I’m kind of surprised these are the “the best”. Folding this thing is not easy. Maybe a little practice and I’ll change my mind, but I was surprised at how unintuitive it is. Also maneuverability? Like maneuvering a cruise ship in a bathtub. It does roll well and turn easy, but dang this thing is big. So I wouldn’t use the word “maneuverable” to deceive this stroller. Finally, the price. These are really expensive and I will admit the quality is there. BUT I do think there are very good alternatives that are out there for much less. These just seem overpriced to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Jared James",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Pricey, but worth it!!!!",
      "text": "We live on gravel and we take our two kiddos (2 and 3mo) in this and it drives like a dream! The bigger tires are great and having the front wheel that can move helps navigate around the bigger rocks.. the shock system is great..We got the snack bar trays that goes across and the cup holder and storage for across the handle bar! Yes the price is crazy expensive but this product has brought us together even more bc we’re outside doing activities and it makes for a fun walk!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Too much for not enough.",
      "text": "Way too much money for an inferior product. Spent x amount on the thing in the first place. Need to spend even more to get the carseat carrier, not exactly cheap. Within a month all the tubes were flat. For the price would be nice to see run flat, puncture resistant tubes. Even solid tires I'd be happy with. Overall it's nice but being you need to spend almost 100+ for each accessory just to make the the thing useable leaves a bad taste.",
      "rating": 2.0,
      "verified": true,
      "author": "SDK",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great buy! Love this stroller!",
      "text": "Love this stroller. It is somewhat annoying to fold an unfold until you get the hang of it. I’ve used it about 5 times and am still getting the hang of it. It has so much storage. Love the adjustable handles. They adjust at the push of a button (super easy). Love the individually reclining seats. We ordered the bar that comes with snack trays and are going to order the bar with snack tray on one side and a graco baby seat bar when we have our next baby. The stroller fits through almost every door easily. The sun shades come down very low to block sun and there are netting areas to still allow airflow.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Can i give it 15 stars?? AMAZING!!!",
      "text": "I cannot speak highly enough about this stroller. I was skeptical as it was above the price range that we were looking into. However this stroller is AMAZING. Fantastic quality, easy to clean, durable. the stroller itself is so easy to push and turn. I can easily do it with one hand while both children are in it. It is also light. I can load it in and out of the car on my own. I live out in the county and this stroller is great on all terrain. We take it everywhere. I recommend it to everyone. Great product!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "worth every penny!",
      "text": "i love my BOB Duallie! this duallie works great. it is not difficult to maneuver around stores with. although it is rather wide, i have never had difficulty at stores. I started running with my newborn daughter at 6 weeks old and she could not feel a bump. this is not my first BoB Stroller. I also have the single BoB stroller which is also amazing, but for the purpose of traveling with a two under 2, the Duallie is worth every penny. although, i wish i would have purchased it during Prime Days, i would still purchase it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Myra R.",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Quality stroller - worth the buy",
      "text": "You get what you pay for. This stroller is easy to push around and has ample storage. I have a 3 year old and 9 month old and it serves it's purpose and then some. We've used it in stores, amusement parks and going on walks in the neighborhood and could not image having a better stroller. We bought ours for $475 which is a steal so put it in your Amazon cart and be on the look out for that price drop!",
      "rating": 5.0,
      "verified": true,
      "author": "L. L. S.",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "So smooth. Definitely feels expensive and well made.",
      "text": "I hesitated buying this stroller for a long long time because of the expense. We were in a situation where I could splurge a little and I have loved it. Not only does it ride smooth and turns on a dime, I would argue that it handles better than my single Graco jogger that I’ve loved. I can get it in and out of our front door, and I stow it in our trunk. The biggest downside is the cost of the stroller and all the attachments.",
      "rating": 5.0,
      "verified": true,
      "author": "mama_of_two",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "This stroller will get you and your kids moving! Love it. Not recommended for quick trips.",
      "text": "If you are an outdoor walker or runner this is the stroller for you and your kids. We also use this on the track at the ymca. It fits through doors, barely. We also have a little tiny $20 stroller for quick errands. You have to buy an adapter bar to use with car seats. Be careful ordering or buying a used adaptor because you have to order the correct year and correct stroller model. We also purchased a cup attachment from walmart .com. Highly recommend this stroller.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladonna Miller",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "High quality and tough stroller",
      "text": "Awesome stroller. We live in an area with tons of hills and some dirt roads so having a stroller that is easy to push and glides effortlessly over rocks is a big deal to us. Both my kids fit great in the seats and are comfortable. There is plenty of storage. The adjustable handlebar is amazing. We are a tall family (my husband is 6'6\" and he hates most strollers because of the low handlebar) but because the handlebar can adjust to a taller height he loves it. The quality is great and I know this stroller will last us several years.",
      "rating": 5.0,
      "verified": true,
      "author": "ashlee herbst",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "The BMW of double strollers",
      "text": "Pockets everywhere! Folds relatively small for a jogging stroller, and very small for a double. All wheels can be easily removed if necessary. Straps are adjustable to a wider size range than this mama of five is used to seeing. Awnings are adjustable to slightly cover, or even fully cover the seats individually. Suspension is amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "{Nie}",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Fits in a Honda Civic",
      "text": "I just LOVE this stroller. I bought another, cheaper stroller before, but the wheel fell off in 6 months. This one is so much better. It provides a smooth ride and I get compliments wherever I go. I tried it out running yesterday and it did a great job. I am able to fit it in my Honda Civic trunk, but I have to take the front wheel off first (which is easily done). Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Green",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Bob strollers are amazing. They are smooth gliding and are easy to ...",
      "text": "Bob strollers are amazing. They are smooth gliding and are easy to navigate. However, they are SO heavy. It takes a while to fold down and load up, had to make sure that it fit into the back of my SUV- It does but just barely. Wish it were lighter and smaller, but this stroller will overcome any terrain and doesn't require much effort at all! I'm a 5'3, 120lb female. My husband has a much easier time with the lifting, but since it's a lot of work for me to lift and store this in my car, I usually just baby wear and then let my toddler walk beside me!",
      "rating": 3.0,
      "verified": true,
      "author": "Christy S.",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Love it except for one thing",
      "text": "Overall - love it. One thing i don't like is that the pull down shade is cheaper on this than the single stroller...they might have done that to save on weight, but i don't like that change.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Best double stroller",
      "text": "Best jogging stroller ever. I use it for all walks, trips to concerts and fairs, and running. The only maintance is adding air to the tires once in a while. The seats are easy to wash with a rag and soap. You get used to folding it down, it's a little weird at first. I got this for my newborn and 21 month old. I got the adapter for the Britax car seat. Now they are 1 and 2.5... I'll have this for a while. It works for bigger kids I think...",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb and Kristina",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "AMAZING!!!",
      "text": "We love to run and do outdoor activities with the kids and we run half marathons. We have a single BOB and it was the first stroller that was recommended to us when we found out that we were pregnant the first time. The double BOB takes up the entire sidewalk so we frequently end up running in the street but it is perfect for 2 kids and very easy to maneuver around when we are out running, walking, or at the park! 110% recommend this to anyone who enjoys being outside with their family!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle D.",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Best on market, but not perfect",
      "text": "I still think this is the best double jogging stroller on the market. However, I think it mostly sells because people like the single. It's not as easy to fold up as the single. You also can't fold it up with the carseat attachment bar on it. You have to take that off and then fold it up. That's the most annoying part.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Top of the line quality",
      "text": "Very well made stroller. It is durable and long lasting. If you are in a big city environment there is a chance this wide stroller will not even fit through double door entries. I also wish BOB would make a quick release of the front swivel wheel(like the back wheels) for easy storage purposes.",
      "rating": 4.0,
      "verified": true,
      "author": "FLA48",
      "helpful_votes": 3,
      "publication_date": 20170316
    },
    {
      "title": "SIMPLY THE BEST",
      "text": "If you have kids and you are active, you can't beat this stroller. A bit heavy to lug around when folded up but my tiny wife can get it in and out of the vehicle when she needs to. Kids love it from the zoo to tagging along on trail runs. This stroller is the best. I would take better options for holding water bottles or cell phones but the stroller is amazing and super simple to fold and unfold.",
      "rating": 5.0,
      "verified": true,
      "author": "A.J. Weber",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "It glides like butter",
      "text": "I gave this as a present to my daughter in law. It is a little hard to fold until you get the hang of it. However she said that it glides like butter ha ha. She loves it. She has a 2 year old daughter and is expecting a son in Dec so it will definitely be used.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "It handles like a dream",
      "text": "I can’t say enough about this stroller! It handles like a dream!! It is super easy to push/steer and to set up and fold up. The only negatives (which for me are outweighed by the positives) are that it is pretty heavy and still pretty large when folded. It just barely fits in the back of my Subaru hatchback. I also wish it had cup holders, but the back of each seat has a mesh pocket and the storage under the seats is very generous.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180117
    },
    {
      "title": "Pricey, but worth it!",
      "text": "I love my double Bob jogger! It is pricey, but worth every penny. It makes working out possible with two littles! Make sure to also buy the handlebar console. It is definitely necessary!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Torra",
      "helpful_votes": 2,
      "publication_date": 20171204
    },
    {
      "title": "Terrific stroller",
      "text": "I love my duallie stroller. Very large which is why we got it. A little hard to get it to fold up just right, and its heavy but that's expected with a huge double stroller. Handles the gravel roads and trails perfectly! No wobble in the wheel, adjustable handle bar, fits through standard doors tight, love the independent sun shades and reclining seats. Does not lay down flat, but does the job good enough. I have a 3 yr old and a 1 yr old.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Hard to fold up, otherwise awesome!",
      "text": "The best jogging stroller! Such a smooth ride. It is annoying that basic features don’t come with the stroller, but cost extra (such as the tray). I docked one star because it’s pretty hard to close and the pull string often gets stuck and I have to fold up the stroller by awkwardly trying to press the buttons on the side in.",
      "rating": 4.0,
      "verified": true,
      "author": "ThoussaintTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Works perfectly, I haven't found much difference between this ...",
      "text": "Works perfectly, I haven't found much difference between this and the single revolution we have except when going down hills. Makes me wish I had bought the one with the handbrake, however Amazon didn't have the orange color which is preferable due to visibility.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 2,
      "publication_date": 20160920
    },
    {
      "title": "Babies and Athletes Dream Machine",
      "text": "Bad to the bone. Heck yeah. This is a Cadillac stroller. Absorbs bumps, has a best locking brake mechanism, and height for pushing is fully adjustable. Fully adjustable straps to keep the kids secure. You can jog really fast while pushing the twins. This think rocks.",
      "rating": 5.0,
      "verified": true,
      "author": "BlackGun",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Love this stroller!",
      "text": "Got the Bob a few months ago and we are absolutely loving it. We have twin boys that are 18 months and very tall and they fit perfectly together. Its so easy to push which helps when the grandparents are watching them and want to go for a walk. I’v jogged with the stroller a few times so far and couldnt be more happier with how easy it is. It is a fairly large stroller so obviously it might not fit everywhere but is easy to fold up and unfold. Overall really nice stroller and good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "I wish they had sturdy rods through the edges like with the 2016 single ...",
      "text": "I had a single Bob Revolution with my first daughter many years ago. I Iove this one as well. The only change I would make is with the visors. I wish they had sturdy rods through the edges like with the 2016 single Bob Revolution, to make them easier to put down. They are awkward with the current design.",
      "rating": 5.0,
      "verified": true,
      "author": "A. H.",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Great quality.",
      "text": "We LOVE bob. Second stroller for us. Great quality. Plenty of space. We use daily. Not great for tight spaces but we still love.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheena Hogan",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "AWESOME stroller, but big....",
      "text": "I was a little hesitant on purchasing this double stroller due to the size. But....after pushing many of my friends doubles I knew this was the way to go. I own the BOB Flex Single stroller and am obsessed with it, so I knew I would love this too. The only negative about this stroller is most definitely the size-it’s BIG and takes up the entire back end in my SUV.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Easy to handle",
      "text": "I love this stroller. It’s so much more easy to Maneuver than other twin strollers! It also fits through doors. The first few times I took it out, folding it was really difficult to figure out but I got it now. I’d plan on allowing some time to play with it and practice folding it before you take it anywhere. Also, I miss having a cup holder",
      "rating": 5.0,
      "verified": true,
      "author": "E. Sanders",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Love this stroller",
      "text": "Love this stroller. It is just as easy to push as my single bob revolution stroller and is such a smooth ride. Lots of storage space and very comfortable for my toddler. Bought the snack adapter with car seat adapter since my babes are 2 years apart.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Weaver",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Great stroller for jogging",
      "text": "Great stroller for jogging. Easily monoverd and switching from walk to run mode. Suspension is awesome and sooo smooth. Only complaint is the wheels deflating. I had a Britax single jogger before our second was born. Three years and never and problems with the plastic wheels. The rubber wheels on this one have had to be inflated almost after every run. Not sure if this is normal or not as it is my first expiernece with these types of wheels.",
      "rating": 4.0,
      "verified": true,
      "author": "brenda",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Best built.  Best ride.",
      "text": "Great ride but wish it were lighter weight and better accessories. Why must I have one large snack tray that must be taken off each time they get in or out. They should have separate cup holders for each.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Great stroller. Only have had it for a month ...",
      "text": "Great stroller. Only have had it for a month now but been off paths, in fields and gravel, and I. Stores and it's been great in all places. Easy to push and also easy to collapse. It's a double stroller so will be tough to take in department stores and go through clothing islle but all double stroller are a challenge in those types of stores",
      "rating": 5.0,
      "verified": true,
      "author": "cody donati",
      "helpful_votes": 2,
      "publication_date": 20161018
    },
    {
      "title": "Very smooth and comfortable for little ones",
      "text": "Simply amazing. Everything you want in a jogging stroller. We did have to buy a cup holder and storage pouch extra. Get the flexible off-brand one from Amazon, it's better than the BOB brand meant for this stroller.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe D.",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "I love this stroller EXCEPT for the sunshades",
      "text": "I love this stroller EXCEPT for the sunshades. They are flimsy and never stay down all the way. I had bought the Baby Jogger Summit x3 for a single Jogger and I wish I had done the same for the double.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Dixon",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Best double stroller",
      "text": "Absolutely love this stroller! Wish we’d bought sooner! Perfect stroller for all terrain. We’ve taken it to the beach, Atlanta, Costco, walks to the park, everywhere! It is rather larger but fits through most doorways surprisingly. My kiddos (2 yr old and 6 month) love it. My two year old can climb in and out by himself and my 6 month old frequently falls asleep in it.",
      "rating": 5.0,
      "verified": true,
      "author": "KateyWatson",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Great stroller!",
      "text": "I love the stroller. I use it everyday and it is perfect my family. The only reason I removed one star is due to buttons that accept the car seat attachment. One if my buttons jammed after using my stroller a handful of times. This is a huge safety concern as the attachment wouldn’t click in. I figured out how to fix it myself when it happens but I did have to remove a star as this shouldn’t happen on such a high quality stroller.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathryn M.",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Best stroller",
      "text": "This stroller doesn't disappoint! I researched pretty much every stroller on the market and decided to go with this one because it fits through a standard door, it has an amazing shock system, and it doesn't weigh a ton! I bought the infant car seat adapter to go with. I use this stroller every day! It's expensive but it is worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Two kids too heavy for these wheels",
      "text": "I have a single BoB and love it, I had it almost 4 years before I had to replace a tire. I’ve had this thing less than 6 months and I’ve had to replace the tires 3 times already. It needs air every time you take it out, which is fine, but I’ve used it only a handful of times and I’m on my third flat tire replacement (two of which were for small stickers the other unknown).",
      "rating": 3.0,
      "verified": true,
      "author": "Dalhia G.",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Best investment ever!",
      "text": "I absolutely love this stroller... It pushes like a dream and I love how easy the recline option is to operate. Yes it is bulky and heavy but it's a double stroller what can you expect!",
      "rating": 5.0,
      "verified": true,
      "author": "madelynn marcotte",
      "helpful_votes": 4,
      "publication_date": 20160802
    },
    {
      "title": "Best stroller ever!!",
      "text": "This is hands-down the best stroller that I have ever owned! We own a single Bob also, so I knew the durability and quality that I was getting . This is the smoothest ride and having a rotating front wheel is key to maneuvering it on different terrains . I love the adjustable handlebars and reclining seats so the kids can always be comfortable . The sunshade seems to be extra long so on sunny days to provide the protection that they need .",
      "rating": 5.0,
      "verified": true,
      "author": "Dina Wilson",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Great stroller",
      "text": "Bob is always a great stroller wish there was more room to store stuff but very smooth on point stroller.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin and Jenny Baggs",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Big but great for regular use.",
      "text": "Use for running on and of trails, shopping, you name it I use it. Easy turns, love that you can lock the wheel for running. It's big and not always the easiest to get through door ways but we really get a lot of use out of ours. We use it for our 1.5 year old and 3 month old.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Great",
      "text": "In love with this stroller! It is perfect for my newborn and three year old. It’s spacious compared to others of its kind. It goes through all terrain without issue. It is not easy to fold and it sits awkwardly in my trunk, but that’s my only gripe.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly M. Bane",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Love this stroller",
      "text": "This stroller runs so smooth!! It takes up a ton of space, but if you have the room, it’s a great stroller",
      "rating": 5.0,
      "verified": true,
      "author": "Kendyl",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "The easiest assembly ever! It meets all of my ...",
      "text": "The easiest assembly ever! It meets all of my expectations and truly lives up to all the hype. It's worth every penny if you're pushing toddlers. I use it regularly for walking and 5Ks. I regret not buying it sooner! I do wish it had a handlebar console for cups and keys.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 2,
      "publication_date": 20161213
    },
    {
      "title": "We love this stroller",
      "text": "We love this stroller! Not only does it make life so much easier because we can have our infant in his carseat on one side but our little 3 year old dude was just not ready to be able to walk around the store with us so having him buckled in and safe on the other side makes walks and shopping easy! I love that I can position the wheel to be stationary or pivot because we don't only use the stroller for tail runs. The suspension is great, the quality is amazing. This is probably the best baby purchase we made so far! This stroller also does very well on ice and snow!",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Worth the investment!",
      "text": "At first I cringe at the idea of spending this much on a jogger even my husband about passed out when I told him the price. However once we both put our boys in it and went for a walk we knew it was worth ever penny well spent! With a third little one on the way and being a very active family this is a perfect fit for our lives.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Mrs Matney",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Must have with two kids",
      "text": "You totally get what you pay for! This stroller will not disappoint. I love the harnesses, the canopies, and the pockets on each side of both seats. Also fun to push.",
      "rating": 5.0,
      "verified": true,
      "author": "swampmamma",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Love",
      "text": "Love this stroller. I've only used it for walks so far. I have the Bob single from 2013 and really like some changes they made. Better brake release, easy to adjust seats, etc. The shade for the seats is WAY flimsier than my other Bob. I feel like it could break at anytime. Other than that it's wonderful",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Best purchase I have ever made.",
      "text": "I bought this for my two kids and it has lasted years. We have gone to the zoo, ran races, countless walks. It is wide, but still fit through average doors and even in an elevator. You will need a little compressor to air up the tires occasionally, but that’s an fairly easy job.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Wade",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Had the single bob and loved it, had to get a whole new adaptor ...",
      "text": "Had the single bob and loved it, had to get a whole new adaptor to fit the car seat, way too expensive to not have it included",
      "rating": 1.0,
      "verified": true,
      "author": "ashley",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Great quality.",
      "text": "We use this for everyday, working out, hikes. You name it we’ve done it. It is a large stroller but I didn’t buy it to be compact. It’s great quality easy to use. I have a 1 year old, 3 year old, and a 6 year old. They obviously switch out but even my 6 year old says it’s the most comfortable stroller she’s been in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "perfect!",
      "text": "Rolls so much easier than any other stroller. One thing I was surprised by is how good the shade covers are - they go way down when needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Tomlin",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Wonderful stroller! Was frustrated at first that the car ...",
      "text": "Wonderful stroller! Was frustrated at first that the car seat adapter was not coming in until June, but we have actually just been putting my 1 month old in by himself, and he is tight and secure! I think I like it better! We have decided to cancel our order for the adapter attachment! Also amazed that it fits through regular doorways! My 3 year old son is 42 lbs and 41 inches tall and he fits just fine!",
      "rating": 5.0,
      "verified": true,
      "author": "lindseymae",
      "helpful_votes": 27,
      "publication_date": 20160523
    },
    {
      "title": "Worth every penny",
      "text": "BOBs have a great reputation and it’s easy to see why. Smooth when walking and running on trails and paved roads. Storage below is nice. I had a different brand single jogging stroller that I like, but now that I have this I can’t go back 😉",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie D",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "The Cadillac of Double Strollers!",
      "text": "LOVE this stroller. We always get compliments on it wherever we go. Smooth ride! Only negative is the amount of space it takes up in the trunks of our car...but I suppose that's expected with a double stroller.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexa Hubbard",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Great!",
      "text": "Love the Bob! Have single and double strollers - both have been exactly what needed for runs, walks, convenience and ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad and J",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "Good purchase",
      "text": "It's perfect for my 3.5 and 1 year old, I think we'll be able to use for at least a few more years. Tall seats.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "I knew this would be perfect. I love the maneuverability of this stroller",
      "text": "I started with a single bob but with the arrival of my second, I knew this would be perfect. I love the maneuverability of this stroller! It’s big but a must if you plan on running with two!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Best purchase for Mom that likes to run!!",
      "text": "The best workout stroller ever!! Very easy to fold and maneuver. I use it daily with my 2 kids.",
      "rating": 5.0,
      "verified": true,
      "author": "EVM",
      "helpful_votes": 3,
      "publication_date": 20160905
    },
    {
      "title": "Great jogger!",
      "text": "I love my double jogger! It’s the monster trucks of strollers! Haha",
      "rating": 5.0,
      "verified": true,
      "author": "Lonnie",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Awesome stroller!!",
      "text": "Love this stroller! Made with very high quality materials. We have a 3 month old and an 8 month old (foster baby) and they love riding in it. We purchased the Britax car seat adapter and it works perfectly. This stroller is worth the price tag! High quality and will last for years!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Can’t Believe I Didn’t Buy Sooner",
      "text": "This stroller is a must have if you are a runner with kids. Smooth as glass when I’m running & really great maneuverability in tight spots. Even in areas I think are going to be difficult are not an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Marathon Runner",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Best stroller out there",
      "text": "Seriously worth every penny. Very light weight and with both a swivel wheel and a locking wheel it’s perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Elisha L.",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Money well spent",
      "text": "Bought this and I LOVE it! It rides smooth, easy to steer, and easy to fold up. My kids get excited to sit in it. I have a 2 1/2 yo and a 6 mo. They both love it as well. Money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160810
    },
    {
      "title": "Best stroller!",
      "text": "I love this stroller. There is not one thing I would change, other than the price ;) I stared using it at 3 months with my twins using head supports I purchased. They happily take hour long walks in it. It takes a beating coming in and out of the car and is still in great condition. I did have to get new air tubes for it like a month after I got it, which was annoying, but not enough to deduct any stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea C. Friedman",
      "helpful_votes": 7,
      "publication_date": 20170212
    },
    {
      "title": "Fabulous Stroller",
      "text": "It’s a huge investment upfront, but definitely worth the money. Glides like a charm and I can fold/unfold it without issues most times. Occasionally I need my husband to help.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Naumann",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Smooth Sailing for Two Munchkins",
      "text": "The BOB duallie stroller has been great for walks with my 2 year old and new baby. They fit comfortably and the recline feature allows for one to be napping and the other to be sitting up on our walks to the park! The folding process was initially challenging, but after discovering the handlebar needs to be straightened for the buckle to click into place, it's a breeze. It is wide and doesn't fit into all doorways which makes it challenging to get into the garage after walks, but we've gotten into the routine of opening the big garage door for storing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kinsey Oakland",
      "helpful_votes": 31,
      "publication_date": 20160720
    },
    {
      "title": "Stroller Love",
      "text": "Works great for my toddler and infant/baby. I wish the cover was sturdy like the single BOB. The double visor seems a little too flexible. It is not as easy to fold compared to my single but I believe that comes in time and adjusting to the size difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Schultz",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Must have for big kiddos",
      "text": "I would not have made it though summer without this stroller. My large 2 and 1 year olds love it. I love it. I bought the snack tray for the boys and it’s a must have. I jog every day. Cadillac of joggers.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney M.",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Super easy to maneuver",
      "text": "Super easy to maneuver! Love being able to fit kids and stuff and still move around in crowds. Fits through doors. Not the easiest to fold up, but not super hard either.",
      "rating": 5.0,
      "verified": true,
      "author": "Deputy Jed",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "LOVE IT!!!",
      "text": "Can not express how happy I am to find such an awesome and easy to maneuver stroller. I have a 5 month old and 2 year old and they love it. Super smooth easy ride, easy to turn and run on rough terrain.",
      "rating": 5.0,
      "verified": true,
      "author": "Geeena",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Cadillac of strollers!",
      "text": "Absolutely the Cadillac of strollers! My son and daughter-in-law are thrilled with this stroller. It is very light weight for it's size. Easy to handle and maneuver in stores and through doors. They have no complaints! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Brady",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Best Jogging Stroller!",
      "text": "We have a single BOB stroller and was such a fan that when we had our 2nd we knew without a doubt, BOB all the way! So smooth on terrain and easy to push.",
      "rating": 5.0,
      "verified": true,
      "author": "Bndgrl83",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Essential for your mental health",
      "text": "The only way I can get my exercise in for the day! I consider this to be a health product for moms of 2! Great for zoo trips and large storage for packed lunches.",
      "rating": 5.0,
      "verified": true,
      "author": "dpetersen",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "Just save yourself the time and buy it. It's the best for many reasons.",
      "text": "Love this stroller. I thought it was overpriced until I tried one that was just about the same price and hated it after trying to use it for what I bought it for(running). I tried the summit x3 and the front wheel continued to get stuck when it was in unlock mode and I tried another summit but the wheel started to shake, so I went with the rest of the BOB lovers and made the purchase. Haven't regretted since. Best stroller for life!",
      "rating": 5.0,
      "verified": true,
      "author": "shawnie rector",
      "helpful_votes": 5,
      "publication_date": 20170106
    },
    {
      "title": "I highly recommend this stroller",
      "text": "I highly recommend this stroller. It has the smoothest push and can accommodate my very tall kids without them looking ridiculous in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Greatest Stroller Ever",
      "text": "Greatest stroller ever! Easy to navigate on walks. Large wheels can go through just about anything. Front wheel locks in place for morning jogs! Kids love it! We previously purchased less expensive strollers, but sometimes you just have to pay for quality. Wish we would have just gotten this one in the first place. LOVE IT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Great stroller!",
      "text": "Love the duallie!! Pushing two couldn’t be easier. Each child doesn’t have as much room as the bob singles but still a great stroller. Height adjustment is wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Wooten",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Best Stroller Ever",
      "text": "By far the best stroller ever! The stroller basically pushes itself as I do my daily walks / jogs. Would recommend pursuing additional products to use with the stroller such as the cup holders for you and the child (they are not included). Folds up easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Gift for grand babies",
      "text": "I highly recommend for the walker/jogger. It is quite big when folded but easy pop off back wheels make it easier to throw in trunk and go. I'm a big fan of the BOB. This is not the first one I've purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen M.",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Absolutely LOVE this stroller",
      "text": "Absolutely LOVE this stroller. Wait for it to go on sale and grab it! It's a lifesaver to be able to go running with two babies.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi Ann",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Great stroller",
      "text": "I love this stroller! I have a three month old and a almost 2.5 year old. I do a lot of walking and this is perfect. Worth the investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Young",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Glides nicely. Easy to turn and push",
      "text": "The stroller is very heavy and has a strap in the middle of it in the bottom storage so it's hard to get a diaper bag in and out. Glides nicely. Easy to turn and push.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie Miller",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Love the feature of being able to adjust handle bar ...",
      "text": "Only used a few times before winter but this stroller has a very smooth ride! Love the feature of being able to adjust handle bar for people of different heights",
      "rating": 5.0,
      "verified": true,
      "author": "M83k",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Five Stars",
      "text": "Best stroller (and double stroller) for any person (short and tall) with 59 kids. Do it.",
      "rating": 5.0,
      "verified": true,
      "author": "Keira",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Love this stroller !",
      "text": "Easy to move! Fits both kids perfectly! Little big for car but would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "emily hoerst",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Love it even though it's heavy .. Super heavy",
      "text": "Super heavy but amazing quality and new features. Fits through all door frames. Very easy to run with",
      "rating": 5.0,
      "verified": true,
      "author": "VeggieSara",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Great quality! Perfect for our kids!",
      "text": "The best stroller we've ever bought for our kids! We've taken it everywhere we go! And our kids love riding in it! Especially great for when we go for long evening walks!",
      "rating": 5.0,
      "verified": true,
      "author": "LuvT",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Perfect stroller",
      "text": "Best purchase I have made in a long time. I live in the country and needed a stroller that can handle bumps. This works like a charm. I love how easy it is to pack in the back of the jeep and go. Being able to quickly remove the tires is my favorite part of this stroller.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180808
    }
  ],
  "product_meta": {
    "title": "BOB Revolution Flex Duallie 2.0 Jogging Stroller - Up to 100 pounds - UPF 50+ Canopy - Adjustable Handlebar, Black",
    "description": "The BOB Revolution Flex Duallie 2.0 is an ideal on and off road jogging stroller for outdoor enthusiasts and urbanites alike. This double stroller is amazingly versatile. The swivel locking front wheel maneuvers easily through crowded streets and locks for stability when jogging. Air filled tires and mountain bike style suspension keeps you running smoothly on any terrain and the 9 position adjustable handlebar fits parents of all heights. Quick release design makes it easy to securely attach or detach both the front and back wheels. Adjustable front wheel tracking refines alignment with a simple twist of the knob; easily keep the stroller running straight when the front wheel is locked for jogging. The foot activated parking brake secures stroller in the stopped position; while the wrist strap provides safety while running. Independent near flat seat recline accommodates sleeping children; while the fully upright seating position lets them see the world on your adventures. Never rethread again; hassle free five point no rethread harness allows for easy adjustments and when you have finished your journey; the convenient two step fold is complete in seconds. Your children will have a cool; comfortable ride thanks to the ventilated seats and extra large UPF 50+ canopies. Keep all supplies; gear; toys and snacks in the integrated pockets and extra large cargo basket underneath the seat. This travel system ready jogging stroller can be combined with an infant car seat by BOB or Britax when using the BOB Duallie Infant Car Seat Adapter (B01BPCN0JY sold separately). The Revolution Flex Duallie 2.0 Jogging Stroller can be used from birth up to 50 pounds each seat; 0 8 weeks with the use of an Infant Car Seat Adapter & compatible infant car seat; child height 44” or less. Adjustable padded handlebar height 33.5 to 50.5 inches. Stroller dimensions 48” L x 30.5” W x 43” H. Folded dimensions 40” L x 30.5” W x 17.5” H. Stroller weight 33.1 pounds. Wheel rims and spokes high impact polymer composite.",
    "rating": 4.7,
    "feature_bullets": [
      "Fit: Birth to 50 pounds each seat; 0 to 8 weeks with the use of an Infant Car Seat Adapter and compatible Infant Car Seat; child height 44 inches. Dimensions 30.5 W x 43 H x 48 D inches",
      "Smooth; speedy stability: Locking swivel front wheel; air filled tires; and mountain bike style suspension system",
      "Adjustable and Safe: 9 position adjustable handlebar with wrist strap; no rethread five point harness; independent near flat recline; ventilated seats; and extra large UPF 50 plus canopies",
      "Carry more Gear: Store and organize your gear in the integrated pockets and extra large cargo basket",
      "Travel system ready: Compatible with a BOB or Britax Infant Car Seat when using the BOB Duallie Infant Car Seat Adapter (sold separately)"
    ],
    "specifications": {
      "Product Dimensions": "48 x 30.5 x 43 inches",
      "Item model number": "U601856",
      "Is Discontinued By Manufacturer": "No",
      "Minimum weight recommendation": "5 Pounds",
      "Maximum weight recommendation": "70 Pounds",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Item Weight": "33.1 pounds",
      "ASIN": "B01BQLPMPO",
      "Customer Reviews": "4.7 out of 5 stars393 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#35,763 in Baby"
    },
    "categories": [
      "Baby Products",
      "Strollers",
      "Joggers",
      "Baby",
      "Strollers & Accessories"
    ],
    "price": ""
  }
}