{
  "website_summaries": [
    {
      "verdict": "Tracking a giant snake mutant in China and evading zombies in small-town America are part of the intricate story and creepy experience presented in R.E.6.",
      "pros": [
        "Intertwining story with 4 playable characters",
        "4 wildly different survival horror adventures",
        "Huge array of rotting, slithering, and violent monsters",
        "Many multiplayer modes"
      ],
      "cons": [
        "Variety means you’ll likely enjoy some stories more than others"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fantastic couch co-op game",
      "text": "Although the resident evil series has started to go away from these action-oriented episodes, we have really enjoyed RE5 and RE6 as fun cooperative games to play on the couch together or online. The characters have a little nuance in their primary weapons and melee attacks, but generally play similarly enough to keep the learning curve very minimal. Levels can be a little long, but are very fun to re-play with lots of enemies and collectible items. LOTS of content as there are 3 full story modes (maybe 8h apiece, I believe), 2 of which are re-playable with a different character. I really can't recommend the game enough.",
      "rating": 5.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "It's boring and repetitive, but it's playable",
      "text": "This game was just Okay. You basically play as a tandem with some characters though each of their stories, which overlap with all the other characters' stories. it's repetitive and boring at times. I never got to play co-op online as none of my friends could make it past the \"tutorial\" as they really didn't like it. I just thought it was okay.",
      "rating": 3.0,
      "verified": true,
      "author": "B5HARP",
      "helpful_votes": 2,
      "publication_date": 20170402
    },
    {
      "title": "Meh, but still very mildly fun.",
      "text": "Definitely not the best Resident Evil game I've played, heck it might be one of the worst. But it was still mildly(very mildly) fun to play. If you're board and want to play a Resident Evil game and you've played all the others like I have, then why not, get it. But there are other Resident Evil games to play aside from this one, like Resident Evil Biohazard(7).",
      "rating": 3.0,
      "verified": true,
      "author": "vahe",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "RE6 manages to pull off four campaigns, while effectively ...",
      "text": "RE6 manages to pull off four campaigns, while effectively intertwining them. Leon's campaign is classic Resi survival horror, and a far cry from RE5's sunny locales. I found this to be the most enjoyable of the four. Chris makes a return, shooting up zombied-up gunmen and huge monsters, similar to RE5, whereas Jake's chapters are more of a mix between the latter two, with some platforming thrown in.",
      "rating": 5.0,
      "verified": true,
      "author": "Lovethrob",
      "helpful_votes": 3,
      "publication_date": 20160426
    },
    {
      "title": "Really fun game to play",
      "text": "Really fun game to play. I've been a Resident Evil fan since the first game, and despite the opinions of the naysayers, I really enjoyed all of the games in the series so far. Most complaints are about the games being \"different\" or \"turning into a shooter,\" but people need to understand that Capcom can't keep making the same exact game over and over if they want to actually sell anything. Of course it's different from the original, but that doesn't mean it's not a fun game!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Lee",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Great HD remaster transfer with all the added content",
      "text": "Great HD remaster transfer with all the added content. Sadly it doesn't fix the fact that this game is all over the place in terms of genres. It's like a COD game mixed with RE. This is only really playable in co-op over xbox live. Playing by yourself is super boring.",
      "rating": 4.0,
      "verified": true,
      "author": "Carnage300",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Arrived on time",
      "text": "Came in on time with no damage. I will say I liked the previous Resident Evils more. The game play is different for each character, so you get a few different games in one, so it's still a good deal",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Given as a Gift",
      "text": "This video game was a gift and has gone over very well to someone who plays a lot of games; good audio and video. It's a good game series.",
      "rating": 5.0,
      "verified": true,
      "author": "Satisfied Customer",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "RE six is a fun, long, and enjoyable",
      "text": "Further exploration into the saga of RE after Umbrella, before TerraSave, and into the fray of this incredibly complex story, involving scads of characters. The AI is actually FUN and helpful this time 'round, and Sheva makes a true blue patter to Chris. Must play.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom H.",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "It's a giraffe getting head.",
      "text": "Played a bit, and now I'm honestly thinking I just bought this to make it \"current\" with my RE collection. Good game, I don't care what anyone things about it being more \"action-y\" than its predecessors. So was 4, and it was amazing. Same with 5.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "a game that has an excellent couch co-op mode",
      "text": "Finally, a game that has an excellent couch co-op mode. I've been looking for a good game to play split screen with my girlfriend on the next gen consoles and the selection has been scant. Even though this is a remake of a game on the 360, it's still a fantastic play through. It addresses all of the issues with 5, and has the a lot of the stuff that made 4 great. I highly recommend this game to anyone who enjoys good third-person shooters.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Szymanski",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Best game in the world",
      "text": "I used to own this game a while back beaten every campaign with my brother and alone unfortunately i lost my copy then i bought a another that copy got lost so hopefully third times the charm and i keep it because i absolutely love this game",
      "rating": 5.0,
      "verified": true,
      "author": "GreenwolfC119",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great",
      "text": "It is new and what I was expecting perfect service, thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Love this game!",
      "text": "Love this game! It's even better on Xbox One. Graphics are great, upgraded the two player so that Ada no longer plays alone, she has an agent assisting her.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Resident call of evil duty 6",
      "text": "Yes I know we all hate quick time events, and yes this isn't the \"resident evil\" we grew up with, but this is still a fun action game with plenty of co-op/multiplayer to satisfy anyone. But the biggest selling point is the price, for 20 bucks you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Fun action game meant to be more accessible to new ...",
      "text": "Fun action game meant to be more accessible to new resident evil players but retain the characters that the store vets love. Don't go in looking for survival horror, think of it being more survival adventure",
      "rating": 4.0,
      "verified": true,
      "author": "G L Wells",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Back to regular zombies instead of bs monster ppl as ...",
      "text": "Back to regular zombies instead of bs monster ppl as in part 3 and 4. Definitely worth the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "justin",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Good for price",
      "text": "For being a remake the price on this game was excellent. The gameplay is pretty good even though it got a lot of hate. I consider it a good game if you wanna pass the time with a shooter",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos Ramos",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "perfect condition",
      "text": "perfect condition the date says the disc was bought in 2016 and has no scratches whatsoever only a couple fingerprints i can’t wait to play especially online 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Tillman",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "I love this game i played it on xbox 360 but ...",
      "text": "I love this game i played it on xbox 360 but i had to get it for my new xbox one",
      "rating": 4.0,
      "verified": true,
      "author": "stanquan",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Five Stars",
      "text": "If you want play the correct order is Chris Jack ada and león history",
      "rating": 5.0,
      "verified": true,
      "author": "Crishield21",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "The campaign was fun I hated playing the multiplayer it can't compete where ...",
      "text": "The campaign was fun I hated playing the multiplayer it can't compete where there are so many good multiplayer games on the market still a solid game however and I will be purchasing 5 and 6.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Next chapter is still keeping pace with the series",
      "text": "Love the series love this game! I cannot get enough of this game I'm going slow since I want to make sure I do not miss anything. I'm a gamer that loves to try and find everything there is. Now do I still miss things? Yup but I'll try to make sure I find everything, weapons, herbs all of it. This game will give you jump moments, lights off, sound up and go right into the game",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Thornton",
      "helpful_votes": 5,
      "publication_date": 20160831
    },
    {
      "title": "The Resident Evil games are one of my favorites!",
      "text": "Great game for fans of Resident Evil. I have the whole series of the Resident Evil games.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Love it",
      "text": "Love this game looks so much better worth every cent",
      "rating": 5.0,
      "verified": true,
      "author": "Kit lee",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Five Stars",
      "text": "I bought this game for the coop exeperience and it was definitely worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Nice game, good story, great replay value.",
      "text": "Can't bet this game for the price. Great story and gameplay. Replay ability is also great as you can go back and play as a different character in the story. This really folks in the blanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Four Stars",
      "text": "shipping was great came early and no damages to the product works great and alright game",
      "rating": 4.0,
      "verified": true,
      "author": "Harley",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Must have for Xbox One",
      "text": "Awesome video game! Love the Resident evil series and you wont be disappointed. Game play is realistic and even made me jump a couple of times. Definitely a must have for Xbox!",
      "rating": 5.0,
      "verified": true,
      "author": "Omar",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "Five Stars",
      "text": "Wonderful co-op game with lots of gameplay. Can't go wrong with the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly.Evans",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Great RE product.",
      "text": "Great remastered edition. Just as good as i remember. Great graphics improvement. Can't wait for the other remastered editions",
      "rating": 5.0,
      "verified": true,
      "author": "LP415",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Great game to play co-op with your friend",
      "text": "Great game to play co-op with your friend. Kind of a mess with all the stories but still a fun a game",
      "rating": 4.0,
      "verified": true,
      "author": "Gabriel Garcia Marquez",
      "helpful_votes": 0,
      "publication_date": 20160701
    },
    {
      "title": "Look if your a huge fan of resident evil than ...",
      "text": "Look if your a huge fan of resident evil than this is a must own having Leon,Chris,and Ada Wong and more in the same game say no more.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Great to see its available on Xbox One",
      "text": "resident evil fan! Great to see its available on Xbox One!",
      "rating": 4.0,
      "verified": true,
      "author": "B_BOX",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Incredibly great game!",
      "text": "Incredibly great game!!! I've played multiple RE games over the years as well as this version for the Xbox 360. The updated HD graphics are amazing and have made this game \"10 Times\" more enjoyable then before. I'd personally recommend this game to anyone that is a \"true\" RE fan without hesitation!",
      "rating": 5.0,
      "verified": true,
      "author": "daniel",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "... glitches but single player game is okay not the best res evil game story is lacking but strictly in ...",
      "text": "Lots of glitches but single player game is okay not the best res evil game story is lacking but strictly in action and zombie killing it's got it down",
      "rating": 4.0,
      "verified": true,
      "author": "Jarir DBA",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Five Stars",
      "text": "My wife loves it. But I could care less about it",
      "rating": 5.0,
      "verified": true,
      "author": "AJ Jones",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "A bold take on a great game series.",
      "text": "Why all the hate? This game has quite the variety of game play and story arch. Played this on the 360 and I was very pleased to have this title come out for the Xbox one, the game looks incredible and the game play is good as well. This game should have come out on the One to begin with. Can't wait to see Resident evils Four and Five when they come out later this year for the One. Definitely worth the price for all the DLC and everything included with this game. How could you go wrong? A lot of fun to play, and hey it's still Resident Evil with a few new twists and turns. Happy Gaming folks.",
      "rating": 5.0,
      "verified": true,
      "author": "Gojira 45",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "R.E. FAN",
      "text": "Resident Evil 6’s over-the-top world is fundamentally built through its many storylines, which cleverly integrate with each other.This time, your ally will actually be useful, assisting you when necessary and not taking your resources.",
      "rating": 5.0,
      "verified": true,
      "author": "xArkSlade08x",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Frustrating, not fun",
      "text": "Tried playing it for about an hour or so with a friend. Couldn't figure out how to beat the first big boss, gave up, wasn't fun anymore. There are plenty of other couch co-op games like Borderlands or Gears of War that are much better than this.",
      "rating": 1.0,
      "verified": true,
      "author": "J. King",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Good Game",
      "text": "it is OK but so far I was not able to transfer my progress on my 360 to it . . so you have to play it again all the way ..",
      "rating": 3.0,
      "verified": true,
      "author": "C Valero",
      "helpful_votes": 2,
      "publication_date": 20160718
    },
    {
      "title": "Resident evil 5 is more fun, 6 is trying too hard with to many ...",
      "text": "Resident evil 5 is more fun , 6 is trying too hard with to many QTEs and cinemas interrupt the action.but overall it's a fun game to play especially if you are a RE fan like me, then get it.",
      "rating": 4.0,
      "verified": true,
      "author": "Matrixx M.",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Five Stars",
      "text": "AWESOME GAME! IF YOU LOVE ZOMBIES THEN THIS IS THE GAME FOR YOU!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven F.",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "Something missing from it - the story or something else is just not right.",
      "text": "Not into this game. Loved some of the earlier ones, but I just can't get into this one..",
      "rating": 2.0,
      "verified": true,
      "author": "ThaisMayaOfficial / Zefa Real",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "i hate gathering points and stuff",
      "text": "I miss buying things at the in game store.i hate gathering points and stuff,if i want to do that i go play a RPG!!!!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Dorian C Rodriquez",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "It's not a bad game if you have someone to play with",
      "text": "It's not a bad game if you have someone to play with. That said, Capcom did a great job updating the graphics and it plays fairly well. Easily the best campaign was Leon's even if they made it unnecessarily dark.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Marroquin",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "Great game..Still love it",
      "text": "The game is great with hours of gameplay with multiple campaigns and pretty bonus content.",
      "rating": 5.0,
      "verified": true,
      "author": "Huzaifa Zahid Malik",
      "helpful_votes": 0,
      "publication_date": 20190212
    }
  ],
  "product_meta": {
    "title": "Resident Evil 6 - Xbox One",
    "description": "Platform:Xbox One| Edition:StandardBlending action and survival horror, Resident Evil 6 delivers an epic dramatic horror experience. Resident Evil favorites Leon S. Kennedy, Chris Redfield and Ada Wong are joined by new characters, including Jake Muller, to face a new horror, the highly virulent C-virus, as the narrative moves between North America, the war-torn Eastern European state of Edonia and the Chinese city of Lanshiang.",
    "rating": 4.6,
    "feature_bullets": [
      "Starting with four distinct, yet interwoven story threads, for either solo or co-op play, both offline and online, not only does Resident Evil 6 deliver both different perspectives and gameplay styles",
      "Ada Wong, Resident Evil's very own femme fatale, dives into a thrilling campaign of intrigue and infiltration, featuring unique missions, gameplay and weapons. Ada is available from the start",
      "The most expansive Resident Evil game to date- Experience the horror through four distinct yet intertwined campaigns",
      "Solo or co-op - Resident Evil 6 delivers both single and two player co-op gameplay either offline or online",
      "Includes all the available DLC content from Resident Evil 6: Siege Mode, Predator Mode, Survivor Mode, Onslaught Mode, The Mercenaries maps, ResidentEvil.net costumes"
    ],
    "specifications": {
      "ASIN": "B01CHU4JF2",
      "Release date": "March 29, 2016",
      "Customer Reviews": "4.6 out of 5 stars217 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#11,413 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Binding": "Video Game",
      "Rated": "Mature",
      "Item model number": "55018",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer": "Capcom",
      "Date First Available": "March 1, 2016"
    },
    "categories": [
      "Xbox One",
      "Games",
      "Video Games"
    ],
    "price": 21.74
  }
}