{
  "website_summaries": [
    {
      "verdict": "This paper bedding is a great value for the volume you get.",
      "pros": [
        "Though it doesn't block odors, this is a soft and absorbent paper bedding that comes in a generous volume",
        "Customers love that they don't need to change bedding every single week",
        "A good alternative to more expensive brands"
      ],
      "cons": [
        "The bedding does not expand to the volume promised"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Maybe a bad batch",
      "text": "Unfortunately I have 2.5 of my 3 bags left and can’t use them. 2 of my 4 perfectly healthy 1 year old guinea pigs died within a week of a liter change to this stuff. I’m assuming it was just a bad batch? Even more unfortunate is I can’t even get a full refund for this even though it killed my pets...unless you have used this stuff before and your pet did well with it, I wouldn’t risk the expense and end up not getting a refund. I’m a little disappointed that I’m not given an option for a full refund with these circumstances.",
      "rating": 1.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 81,
      "publication_date": 20180424
    },
    {
      "title": "I have been very happy with the Small Pet Select Paper bedding the past ...",
      "text": "I have been very happy with the Small Pet Select Paper bedding the past two times I have ordered it. The volume for the price is great. However, my most recent batch looks like it has gone bad somehow, looking almost like dust and cannot be used.",
      "rating": 2.0,
      "verified": true,
      "author": "JMirsky",
      "helpful_votes": 149,
      "publication_date": 20160802
    },
    {
      "title": "Does not control odor, but cheaper than CareFresh.",
      "text": "I purchased this bedding to replace the CareFresh animal paper bedding we had been using since this was MUCH cheaper. While it absorbs just fine, it does NOT control odor. After a day it is very stinky, especially since our guinea pig is in our daughter's room. I think I will be using this in the areas where the guinea pig does NOT use the bathroom and go back to CareFresh in the areas where he pees and poops!",
      "rating": 3.0,
      "verified": true,
      "author": "rickardfam5",
      "helpful_votes": 78,
      "publication_date": 20160617
    },
    {
      "title": "Just don’t!",
      "text": "This is the cheapest bedding around so I thought my rabbits would like the quality of it. I tried it out and the problems started. The badding is SOOO full of dust, it made us all sneeze. Then my rabbit started having urinary issues and then the bedding started getting stuck to his genital area causing a severe infection. Then, I found this mystery object inside it. Protect your baby and do not get this product!",
      "rating": 1.0,
      "verified": true,
      "author": "Nora Rose ",
      "helpful_votes": 9,
      "publication_date": 20190203
    },
    {
      "title": "Full of Lice! Do not buy!",
      "text": "Gave my rats lice! It took us far too long and too many vet visits to get it treated before we realized where the problem was coming from. Nearly killed the littlest one. This cheap bag of bedding ended up costing us hundreds of dollars in vet bills and nearly the life of a beloved pet. Do Not Buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Mo Ri",
      "helpful_votes": 6,
      "publication_date": 20190207
    },
    {
      "title": "The bedding is super soft, but MOST IMPORTANTLY I can leave their ...",
      "text": "I have 7 guinea pigs and 4 rabbits and this paper bedding has saved me so much money! The bedding is super soft, but MOST IMPORTANTLY I can leave their cage for one whole week without having to change it (with 7 guinea pigs thats a big time saver as I am usually cleaning their darn cage once a day!) I have tried so many different routes but this product is hands down the best bang for your buck. I first purchased one bag but after using that up I ordered the triple order because it was the best deal and saved me the most money. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylorbomb",
      "helpful_votes": 5,
      "publication_date": 20180405
    },
    {
      "title": "Two guinea pigs with clean feet!",
      "text": "I've been using this product for probably about two years now. It's a good value and it doesn't bother my guinea pigs at all. I use it in their litter box on top of a newspaper layer, it's soft so it doesn't bother their feet and it's got good absorbency. When it's wet, it clumps together so it's very easy to roll it up in the newspaper and dispose. I also love how there is no chemicals or dyes or anything like that. One 178L bag lasts me four months, I change their litter every other day, occasionally every third day.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanna",
      "helpful_votes": 5,
      "publication_date": 20180520
    },
    {
      "title": "Disappointed",
      "text": "Should have bought CareFresh instead. This package isnt much larger than a 60L Carefresh bag and is much thinner of paper. Definitely a disappointment and wont buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181006
    },
    {
      "title": "Do NOT USE THIS FOR RATS!!!",
      "text": "I only rated this a one star because I literally HAD TO in order to give my review. Do NOT use this bedding for rats!! I bought this bedding because of how “dust free” it claimed to be. I now have 5 sick rats, and one of them may not make it. I am heartbroken as my rats are more than just my pets. PLEASE PLEASE Do NOT use this bedding for your rats!!! I dont even recommend this for any small animal .... period. Its just too dusty for their sensitive respiratory systems.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190411
    },
    {
      "title": "Amazing!!!",
      "text": "I love anything and everything Small Pet Select and their customer services is the best. There is a lot of bedding in this bag so plan for storage. This bag filled two 18 gallon Sterilite totes. The bag it comes in is vacuum packed so when you open it, it'll stay put so you can leave it in the bag, but when you pull out a little chunk, it expands so it's more than enough. I have one Mini Rex bun and this one bag last me about 5+ or so months.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20190516
    },
    {
      "title": "Eco-friendly mulch",
      "text": "I buy these bundles to use as eco-friendly mulch in my flower garden. I spread them in the beds and then wet and tamp them down. The result is at-first a light brown mulch that holds together like paper mache. But within a couple of weeks, the sun bleaches it to a white. It looks nice and is completely animal safe and biodegradeable. And I have seen a large increase in the amt of worms in my garden because they love paper. Only problem I have is that in early Spring of the following year, the birds steal it en masse for their nests. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "LIDeb",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "178L",
      "text": "I bought the 178 liter because it was 3 times the bedding for the same price as the one we had been buying at PetCo. Unfortunately it has lasted one month, roughly 2 bedding changes. and regular spot cleaning. Doesn't expand like it is supposed to. Pretty disappointing",
      "rating": 2.0,
      "verified": true,
      "author": "Bond, James Bond",
      "helpful_votes": 3,
      "publication_date": 20190102
    },
    {
      "title": "Very good bedding",
      "text": "This is the best bedding I bought. my G-pig like it very much, the bedding absorb most of the pet's order and very easy to clean up. Another important thing is the bedding is compact, so only one bag of bedding could be used for about half a year, I have to say this is an excellent and worthy purchase. I plant to buy one more for my G-pig.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian Lyns",
      "helpful_votes": 5,
      "publication_date": 20181001
    },
    {
      "title": "Happy Rat owner. Superior to Kaytee bedding.",
      "text": "I am quite happy with this bedding. I have two rats that are using it. Prior to this bedding, are used Kaytee bedding. My rats seemed to sneeze quite a bit while it was in the cage. This small pets bedding has eliminated that issue. The cage remains smell free from 5-7 days. Changing the bedding is super simple as I just dump it into a trash bag and go. The bedding while compacted within the bag is not so tightly bunched to make it difficult to refill the cage with new bedding. Overall, I am happy with this bedding and will definitely continue to use this brand in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Bespeckled",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Thrilled with odor control!",
      "text": "A friend recommended I try switching to this bedding for our guinea pigs, and I am so glad she did!! Not only is it an amazing deal financially, with so much volume at such a small price, it also tops all other products I've used for odor control. The other feature that I am beyond thrilled with is the lack of fragrance. Our family is extremely sensitive to chemical orders, and all of the other products we've used, while saying they were fragrance free, always have an odor. This was the first type we tried where there truly was no chemical smell at all. This is officially the only kind I will now use.",
      "rating": 5.0,
      "verified": true,
      "author": "jjcrazycat",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Hamster Approved",
      "text": "This is great. I usually use boxo bedding, but I decided to switch it up for a better price. Straight out of the bag it's super soft, and it still expands a lot larger. Combined between all of my hamsters' cages, i have about 2200 square inches of space that need filled. This bedding fluffs up so well that I've barely used a quarter of the bag and they all have plenty to dig around in and make their burrows. I mixed it with the aspen bedding for added odor control. They all seem to love it. Even Winston, who never burrows, has started burrowing in this new bedding.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy K.",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great product",
      "text": "I have a hamster and two guinea pigs, so they go through a lot of bedding. I used dog potty liners and then place bedding over liners and make the clean up easy and under 2 minutes. After trying so many different types of bedding this is the one I use unless I forget to order a new shipment then I pay the same amount for half the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "kbrown",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "100% recommend",
      "text": "I absolutely love this bedding! I adopted both of my rabbits from a shelter and both have some signs of sore hocks. Because of this, I wanted a bedding that was soft and good for their little paws. This bedding is soft, but absorbent and perfect for my rabbits. Also, because of how it is made and what it is made of, I have no concerns of with my rabbits munching on a few pieces. I definitely would recommend this to anyone who owns a rabbit or small animal!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam25",
      "helpful_votes": 2,
      "publication_date": 20180316
    },
    {
      "title": "Great product and company.",
      "text": "This is by far my buns' favorite bedding. This is a HUGE package of bedding, it's super soft, and my two buns absolutely love it. They've always just been meh about their bedding, but as soon as I tried this I noticed a total difference. They're much more playful with this, and any time I change it our more hyper bun starts binkying all over in it. That adorable sight, the lack of dust, the absorbency, and only positive interactions with Small Pet Select mean I'll keep ordering this product for the foreseeable future.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Allen",
      "helpful_votes": 3,
      "publication_date": 20160821
    },
    {
      "title": "Goes a long way!",
      "text": "I purchased the 178L bag of paper bedding and it lasted a full two months. I change my guinea pig cage twice weekly (every three to four days). I am a new guinea pig owner, so I initially only made their bedding about an inch thick. Now I put two to three inches of bedding in heir cage because I find that it helps with the urine smell (this bedding doesn't have a smell blocker) and it just seems to make everything cozier. The paper is softer than the stuff I bought at the pet store initially. I just ordered a new bag and plan on using this for the life of my piggies.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "The softest bedding you'll find",
      "text": "I've got a 5 year old Guinea pig that is spoiled. I use this in his cage and he hasn't complained yet! I've tried a lot of bedding over the years and always found that it either was scratchy or smelled funny. This stuff is super soft, expands great and has a very neutral smell. I have been buying this brand now for at least 3 years, if not a little longer. It's the only bedding I'll use.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Bronder",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "The best I've tried; Pricey but high quality",
      "text": "I've tried a few bedding options for our guineas -- from the fleece liner to various paper bedding brands. We've used the Carefresh as our go to bedding for the past year. I have no complaints with it. However, I decided to try the Small Pet Select Premium Soft Paper Bedding on a whim as we know their Timothy Hay is hands down the best we've found. I didn't know that paper bedding could be this good! It's even softer and finer than the Carefresh. It also has a bit less dust. I'd say it controls odor just as well, too. The cost is a bit prohibitive. Otherwise, I would say this is our new go to bedding. Good stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Stooperific",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Hands Up The Best...",
      "text": "My Guinea Pigs Love this Bedding! We've tried every bedding there is and this is Hands Up the Softest and Most Absorbant. Gizmo, Toby, Betta, Theo, Chewie and Cookie Love Bedding Change Out Day! They Popcorn around all Happy as the bedding is flying into the cage. They know they don't have to Fluff it Up!",
      "rating": 5.0,
      "verified": true,
      "author": "The Duh",
      "helpful_votes": 2,
      "publication_date": 20190124
    },
    {
      "title": "The paper bedding Walmart has is much better and close to the same price",
      "text": "Didn't expand or absorb much. Have to change the bedding much more often with this. The paper bedding Walmart has is much better and close to the same price.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheyenne",
      "helpful_votes": 5,
      "publication_date": 20170613
    },
    {
      "title": "Still better than wood but not the best.",
      "text": "I have used A TON of different paper bedding brands and this is by far the worse. It doesn’t hold smell very well which not a lot do but this was terrible. It didn’t absorb or hold the mess like some others do. Will not be buying again. I guess it’s still better than wood though.",
      "rating": 3.0,
      "verified": true,
      "author": "Haley19",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Expensive and not a very good deal",
      "text": "You'd think that an expensive product like this bedding should be good quality but it is really just average. The pet urine soaking is just okay I usually would find wet urine on the bottom of my small pet's bin using this product. It doesn't prevent the bin from being stinky because the absorbancy is not very good. I will be looking for a better solution since this product doesn't work well soaking up urine.",
      "rating": 1.0,
      "verified": true,
      "author": "LoveElectronics",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Works great!",
      "text": "We have FOUR Guinea Pigs, kept in pairs so that means two huge cages to kept clean. This bedding works amazingly for keeping smell down and piggie toes dry. Its soft and doesn't smell funny right out of the bag like some bedding. We like it better than any other we have tried and we have tried many. We clean cages about once a week and this lasts. We order hay and food from Small Pet Select also and the company has AMAZING customer service, we had a issue with food coming open and within a little over 12 hours we had conformation of a new bag headed our way. Great products and Great people. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nita",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Not as puffy as Carefresh but seems very natural and made in USA",
      "text": "I had been buying Carefresh, but saw this was a larger bag and made in the USA, so I decided to spend twice as much in an effort to get over twice as much product. I’m not sure the actual usage will be twice as much though. The Carefresh is more puffy, and this looks more like paper shavings. The bag is quite heavy, but the product doesn’t seem as compressed. I’m not sure I will buy again, but I will update my review if I grow to like it more as we use it. The company offered a free item for a review, so we are leaving an intial review now.",
      "rating": 3.0,
      "verified": true,
      "author": "AmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "It is okay...",
      "text": "This is like cardboard boxes that have been through a shredder a few times and then packed into a bag. The bag did not expand when I opened it nor did it expand larger than its size when it got wet. Instead of cleaning out completely every third day, I had to clean out completely every night as it absorbs no odors and any wetness soaks everything instead of just a small corner. It is okay. It just didn't last as long as I thought it would.",
      "rating": 3.0,
      "verified": true,
      "author": "Darcy",
      "helpful_votes": 2,
      "publication_date": 20170521
    },
    {
      "title": "Best bedding out there",
      "text": "We've had guinea pigs for several years. This stuff is amazing. It lasts 2 weeks with 2 guinea pigs and it has no scent to it which was a problem with some of the other bedding we purchased. Many people don't realize that guinea pigs are sensitive to smells and should not have scented bedding it's bad for their respiratory system and can make them sick. This bag lasts for six months (we have a very LARGE cage), so it's well worth the price and more affordable than anything I found at your local chain store.",
      "rating": 5.0,
      "verified": true,
      "author": "MMC70",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Not great as rabbit litter",
      "text": "This product is just shredded paper, compared to Carefresh where it's thicker and more like pellets. It immediately gets tamped down in a matted layer from my rabbits walking on it. I have to change it twice as much as Carefresh, and it sticks to the bottom of the litter box. This might work as bedding for smaller pets, but it's not great for rabbits.",
      "rating": 2.0,
      "verified": true,
      "author": "CPH",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Awful company awful bedding",
      "text": "My healthy guinea pig got sick because of this bedding and passed away this morning. Thank you for that. Please don’t buy this bedding unless you want your pets to die",
      "rating": 1.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 2,
      "publication_date": 20190823
    },
    {
      "title": "Basically wood chips",
      "text": "I bought this because my fluffy loin head tracks wood bedding everywhere. Most paper bedding is fine but this is basically wood chips, with the same look and feel. Which sucks because at walmart I could get a bigger package of wood chips for $6.",
      "rating": 1.0,
      "verified": true,
      "author": "d",
      "helpful_votes": 5,
      "publication_date": 20170612
    },
    {
      "title": "Boycott this company for inconsistent quality and bad shipping policies",
      "text": "Small animal select quality is all over the place. The prices are moderate but when you pay $40 for a box of hay, and it is all powder net worth is 0000. The litter also not consistent. And they always ship with the signature required so if you live in a real City you have to be home from work to have their product delivered. Please boycott small animal select",
      "rating": 1.0,
      "verified": true,
      "author": "Derek Sanchez",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "I like the feel of this bedding",
      "text": "I bought this bulk size bedding because the price is better this way for the amount you get. However it is very big, that's the only downside- easier to make a mess. I suggest a container to store it in if you're really worried about mess. It should last a long time. I like that it's natural paper. Update: This bedding is a good price but is not as good as Carefresh's natural bedding at keeping the smell contained. You pay for quality.",
      "rating": 3.0,
      "verified": true,
      "author": "A.S.",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Great quality for the price",
      "text": "I have been buying my pet's shavings from Care Fresh for probably over a year now. I started to become very unsatisfied because it seemed that every time I bought another bundle of shavings the price had gone up again. So I decided to do some more searching for shavings that were cheaper and I came across Small Pet Select. I thought the price for the amount of shavings was fair. It also is a larger quantity then the bundle I have been buying, which means having to buy shavings less! So far I'm very happy with this purchase and I highly recommend! Thank you Small Pet Select.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Compacts down to nothing",
      "text": "Meh. From all the positive reviews, I expected to like this, but I really didn’t. I’m not too fussy, but this bedding is frustrating. It fluffs up nicely initially but, no matter how much I use, within a couple hours our guinea pig has compacted it all down so it’s all hard and looks like there’s virtually no bedding. Then when I spot clean I end up scooping out lots of it and by the end of the week the poor little guy has virtually no bedding left!",
      "rating": 2.0,
      "verified": true,
      "author": "Leeny",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "5 Rabbits, litterboxes changed weekly",
      "text": "We have 5 indoor rabbits so we go through lots of paper bedding! This bedding is soft & easy to use. I use it as the bottom layer of our litter boxes. I put Aspen as a middle layer & squish it down. The top layer is fresh Timothy Hay which helps promote foraging behaviors. They get fresh hay 2x daily. We clean our litterboxes, which are large, once a week. The paper bedding is a great absorber & helps keep smells at a minimum.",
      "rating": 5.0,
      "verified": true,
      "author": "Coral Crumb",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Decent... good for price",
      "text": "+Huge bag, approx 2’x2.5’x1’ -Not very compressed, so you don’t get as much as you would another brand that is tightly packed +Doesn’t fly around as much as other paper bedding has -Had holes in my bag, luckily I picked it up from that aide and none fell out. +Good absorbency +Decent odor control",
      "rating": 4.0,
      "verified": true,
      "author": "Knj101010",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Wish it was scented",
      "text": "Not really any scent to it, but so far no problems with or rotund little piggies. Our piggies are rescues from a lady who no longer had the time for these guys and this is what she sent with them. Works well for them, so we bought more. Prefer another brand for the hamster though. Daughter prefers the colorful stuff with the cutesy scents.",
      "rating": 5.0,
      "verified": true,
      "author": "L.Mangrum",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Guinea Pigs love it",
      "text": "My guinea pigs like this bedding more than previous ones I have used. They seem to have sensitive feet, this stuff is soft, way softer than the pine bedding I originally used. I do have to say though, it starts to smell sooner than the other bedding, probably because there isn't any scent to cover it up. I recommend this product, I also recommend buying large bundles of it to save some cash in the long run.",
      "rating": 4.0,
      "verified": true,
      "author": "Crusty McSwiggins",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Dangerous",
      "text": "This was incredibly dusty(which wasnt noticeable until about the 3rd use) . My rats developed skin infections, 2 began sneezing, 1 died from respiratory problems. My other we are taking to the vet as they believe he has lice/mites . Because they have not been anywhere else and no new littermates have been introduced the vet believes it could come from the bedding. Do NOT buy for pet rats",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "High quality at a bulk price",
      "text": "I use this as the bedding for my rats and hamster. They all enjoy it. The package is compressed, but it unpacks to fill my double-story critter nation (rats on the top story, hamster on the bottom story) with two top shelves on each level quite easily. I probably get 3-4 months out of a bag. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "GSB",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Less product than usual...",
      "text": "I usually love this bedding. I buy it every couple of weeks for my guinea pigs, but the last two I’ve purchased have been noticeably less than usual. Now it’s not enough for my large c&c cage. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Coley88",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "Must Buy!",
      "text": "I love this bedding. Amazing price, soft, and LOTS OF IT! Will definitely be purchasing again once I run out! (Which will be several months from now!!) I have a Guinea Pig and he loves it! The above was a previous review and I love this bedding so much I came to give it another review. This bedding is the most affordable and quality bedding I have found thus far! And now I am taking care of three Guinea Babies!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Best Bedding I've Used",
      "text": "I have tried all kinds of bedding for my guinea pigs (apsen shavings and pellets, Carefresh, Clean & Cozy, and generic grocery store paper bedding.) This is my favorite of all of them. It is light, fluffy, and dust-free. I really like that it is unbleached and unscented. It stays fresher smelling between changes than aspen, without the overly strong smell of the scented paper litter. I do add a small handful of lavender scented Clean & Cozy to the main potty corners to keep everything even fresher. The guinea pigs seem to like it. They popcorn when let them back into their cages after a change-out. The price is great. This is the best bedding I've ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Erickson",
      "helpful_votes": 2,
      "publication_date": 20161104
    },
    {
      "title": "Really good odor control and super soft",
      "text": "Pleasantly surprised! Really good odor control and super soft. My bunnies seem to love it! It doesn't seem as compacted as Carefresh, so I have no idea if it will actually last longer or save me money, but great to have as an option regardless! Will be buying again.",
      "rating": 4.0,
      "verified": true,
      "author": "Colleen from Minneapolis",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Great Bedding/Litter for Rabbits and Guinea Pigs",
      "text": "Thanks to the carefresh price increase, I decided to try this brand of bedding. After Amazon hiked the price of carefresh (from $10-$19 per large bag), I switched to this brand. For me, the Small Pet Select brand works so much better than carefresh (and cheaper). There is no funky odor (unlike carefresh) It is softer than carefresh It absorbs moisture and odor well. I think this is going to be my mainstay bedding for my rabbits and guinea pig.",
      "rating": 5.0,
      "verified": true,
      "author": "Athena Madison",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Avoid at all cost!",
      "text": "This is the absolute worst fill I have ever used for Jack ( the rabbit)! It turns to mush as soon as it gets wet! It sticks to his feet so he tracks it all over his “cage”, and it with how wet it got he was standing/ stooping in pee and stunk requiring frequent baths. I change my bunny’s box morning, after work, and before bed so never have a dirty box with typical fill, but with this shredded tissue paper it would require twice an hour to not have a smelly cage or a smelly bunny! I gave the remainder to the local animal shelter and bought the good stuff from PetSmart. NEVER AGAIN!!",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Not as advertised",
      "text": "Not as advertised. I have yet to receive a response if why I spent over 100 bucks for a 3 pack and only received one. I'm very upset over this. And my reviews keep getting deleted for violating Amazons rules. Not sure how. Never will purchase again. I have been trying to submit this review since April! No one will contact me at all! It keeps being deleted!",
      "rating": 1.0,
      "verified": true,
      "author": "Poisonivy",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Large amount of bedding! Great price.",
      "text": "I have been buying bedding from a giant pet store and I was paying way more for way less bedding! We have a small cage for our hamster and I realized quite early on his cage will have to be fully cleaned out on a weekly basis. So this bedding is great! I’ve already cleaned our cage twice and haven’t even put a small dent into the amount of bedding we purchased! It might last longer than the hamster!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Super Soft Bedding!",
      "text": "I purchased this bedding after reading all of the positive reviews. I am trying to find a good paper bedding after using the Care Fresh brand from PetCo. This bedding is SOOO soft! It's so much softer than the Care Fresh paper bedding, which is thick and chunky. I like that the paper resembles aspen bedding and makes the cage look a lot nicer. The only reason why I left off a star is because my piggies like to eat this bedding. They love paper in general, so it's easy for them to mistake the bedding for a regular piece of paper.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah G",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "As thin as tissue paper!  Not absorbent!  Very soft and not packed tightly.",
      "text": "I will not buy this product again for my two guinea pigs! It is made of paper which is as thin as tissue paper. It will get wet and stay wet because it will have little absorbency. I will stick with the “Big Box Store Brand” which is very comparable to the chain pet store without the inflated price. I will use this bedding up in the parts of the cage where they poop, but not where they pee. This might work well for a gerbil, as they do not pee very much.",
      "rating": 2.0,
      "verified": true,
      "author": "Praisetodd",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Loose fluffy safe no dust but not dense enough kinda messy",
      "text": "It's like crumbled loose thin paper not thick at all very fluffy not the best to work with. It works but be nicer if it thicker no smell nor harmful to pets not dusty would say good for bottom of a cage but again once wet it can stick to your part if they have long hair.",
      "rating": 3.0,
      "verified": true,
      "author": "Where There's a Will, There's a Way",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Best bedding I've used",
      "text": "I've ordered three bags of this over the past year and a half, and I love it. It's soft, absorbent, low on dust, and inexpensive especially considering how much you get. This is similar to Carefresh except it's a little more loose (vs. clumped together), less dust, and not as expensive. I'll keep getting this as long as it's available!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana T.",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "It gets the job done",
      "text": "It dose the job. Its is a massive amount. We have to store it in a tote. It is very dusty and very light weight, so it gets everywhere. It absorbes different then the other papers we have used. It ends up being a wet mess. We do change is more often because it has no oder control.",
      "rating": 2.0,
      "verified": true,
      "author": "Donald Wagner",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "This is Gilbert's (guinea pig) favorite bedding",
      "text": "This is our guinea pig Gilbert's favorite bedding. And ours also. Have tried a number of others but like this the best. I buy the 178L bag which lasts us a few months. I fluff his bedding daily and the poop settles to the bottom. Natural and reduces odor. Have repurchased several times. Small Pet Select puts a thank you note and team picture in the box. Nice touch!",
      "rating": 5.0,
      "verified": true,
      "author": "James E",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "PRODUCT IS NOT 172L LIKE ADVERTIZED",
      "text": "INCREDIBLY disappointed. Product says 172L in big bold letters on the page. I expected to get a HUGE bag of bedding. I open my box...it is not 172L like they promised. It's only 52L. Now why did I waste my time and change brands and pay more for the same size bag I normally get from a different supplier? I will be contesting this and sending pictures to Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "I'm not telling....",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Only received part of order",
      "text": "This is supposed to be 3 bags of litter, I only received one. I have ordered this item multiple times and the litter is good for the price- I have always received 3 bags. I don't see any other way to report only getting part of my order, so this is very frustrating.",
      "rating": 1.0,
      "verified": true,
      "author": "BookBunny",
      "helpful_votes": 2,
      "publication_date": 20190225
    },
    {
      "title": "One very happy guinea pig",
      "text": "Super soft and lovely pet bedding. Doesn't have the weird smell of other paper bedding like care fresh and way more absorbent. My guinea loves the new bedding and likes to push it around to build little sleeping spots",
      "rating": 5.0,
      "verified": true,
      "author": "kab",
      "helpful_votes": 2,
      "publication_date": 20170412
    },
    {
      "title": "Very soft and affordable!!",
      "text": "Ordered this bedding because of price and to my surprise it’s actually pretty amazing! It’s soft like the kaytee brand! My only complaint is that it wasn’t as big as i was thinking however it still is a lot for your money! ( I was able to fill 3 bin cages that are the 200qt about 3 inches in each one! So you get a pretty good amount for the price compared to care fresh! My hamsters are litter box trained so I personally have zero issues with smell so I can’t give that a rating really lol! NOTE!! Purple/pink crickle paper is not from their bedding!",
      "rating": 4.0,
      "verified": true,
      "author": "Albert",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Not absorbant.",
      "text": "Thought I was going to love this for our rabbit since the reviews were really good however this doesn’t absorb like it says it does it gets wet and it pacts down and it doesn’t make it easy to clean we used it in our bunnies litter pan and it was terrible. Would definitely not buy this again especially for the price it was.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Stemmer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great choice for rabbits",
      "text": "I have been very pleased with this bedding. It works just as well as the expensive pet store stuff in my opinion. It doesn't stink if you change it regularly, and is very soft once fluffed up. One bag lasts a pretty long time. My rabbit loves to dig in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Lloyd",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Very absorbent!",
      "text": "Since we swapped to using natural paper bedding from small pet select we have had no more issues with our guinea pig's feet! On top of being soft it is also really absorbent with the liquids and the smells. This has been a monthly reorder for over a year now!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Shipping smaller packages than described.",
      "text": "I really love this bedding. I love it because its 98% the same as the bedding I buy from Chewy. BUT the last two times (out of 12 times) ordering this bedding, the 178L bag is coming in a package half the size and clearly not 178L even though its labeled 178L. And I mean a dramatic half the size. So because of that, I'm unhappy. It is good bedding but if I'm paying for something, I want what I paid for.",
      "rating": 3.0,
      "verified": true,
      "author": "Sylvia Sugden",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "We seem to be allergic to this bedding!",
      "text": "After switching to this bedding, my daughter was breaking out in rashes and hives when she held the cavy. I thought that she was developing a hay allergy. But, then our pet sitter had the same reaction. I switched back to our previous bedding and no rashes or hives. So, we won't be buying this again. : (",
      "rating": 2.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "We buy this a LOT.",
      "text": "We use this bedding for two Guinea pigs and a very cranky hamster. It works well and holds in the normal odors that come with small animal waste and it's easy to clean up. I also enjoy how much bedding actually comes in this. It easily expands to over 3 times the size of the sealed block. Not only would I buy this again, but we DO buy this product over and over. As long as I have small critters, Pet Select has my loyalty.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Shoemaker",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Our Gerbils love it!",
      "text": "We have two 40 gallon glass tanks that hold three gerbils--two gerbils in one cage, and one in the other. We need lots of bedding! This is the perfect stuff. It's very soft paper bedding. If you mix it with hay the gerbils can tunnel very nicely. We usually change the cage every 3-4 weeks. It doesn't have much dust. It smells a little sweet. It's good for absorbing gerbil smells. The gerbils love when we change their cage and start tunneling right away. We just love it, so do our gerbils!",
      "rating": 5.0,
      "verified": true,
      "author": "Steward Academy",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Best bedding, worth the money!",
      "text": "My guinea pig loves this bedding more than any other we’ve tried. I also like it the most because it’s more absorbent, and when I use this product my home smells less. It’s super soft!! The bag I buy lasts me a long time because I line one habitat, and I use this bedding in the other habitat that has the food. I highly recommend. I like it so much I’m buying their hay.",
      "rating": 5.0,
      "verified": true,
      "author": "valerie jones",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Its killing my pet",
      "text": "Just got it today. Not as compact as i thought it would be, but it gets the job done so far. No problems yet Update: After changing the bedding around twice a week for about 3 months now, i found some shreds of cardboard box in it and the hamster seems to be having an allergic reaction to it. The hamster's leg is irritated and bloody and he doesn't seem to be moving as much as he used to before.",
      "rating": 1.0,
      "verified": true,
      "author": "BILL LIN",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Not a good deal",
      "text": "I thought this would be like Carefresh, but it's nothing like it. The paper is very thin. It doesn't help control odor. The material is loosely packed. I have to use so much of it for one change because it's so thin.",
      "rating": 1.0,
      "verified": true,
      "author": "Stacie",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Best, softest bedding you could pick!",
      "text": "This is the best, softest bedding you can get for your furbaby. We have been ordering this bedding since we adopted our bunny, Douglas, and it’s worth every penny. What’s awesome too, is that even though he loves to eat paper, some how he instinctively knows only to use this paper for bathroom use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren M.",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Soo glad we made this switch",
      "text": "Used to use the natural bedding from carefresh...amazon stopped carrying the 60L for $17, so I went to this brand for $40. We have three rabbits now so hard to tell if it's lasting longer or not. So much softer than any other bedding and the bunnies can tell the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Nerissa",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Perfect for keeping my bunny's room clean",
      "text": "I've had my bunny for about a year and I've only tried two bedding products. I started with one that was pretty expensive but it as good quality and then I found this one that was cheaper so I tried it. I was very surprised to find that this is amazing quality, better than the more expensive one, and there is a lot more in the package. I have a giant southern chinchilla rabbit (yes, that is an actual breed) and so she uses the litter box a lot and this lasts me about a month or so. Would definitely recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Fluffy paper bedding",
      "text": "I use this bedding in my mice cage, it is nice and fluffy and they are able to burrow through it. Very low dust and no initial odor. The paper is just flakes rather than little \"wads\" so I don't feel it is as absorbent as a thicker paper product but it gets the job done and the price is right for the volume of product per package, in comparison to other brands selling similar paper beddings. Give it a shot, one bale goes a long way for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Jill C",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Excellent Product!",
      "text": "This is the most affordable bedding I have found. I love this bedding! We have 4 rats and this bedding is excellent for them. I bought some paper bedding at our local retailer and it was not only more expensive but it also started with a weird odor causing it to stink almost immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "NOT 178 liters! Only 52. False advertisement",
      "text": "This product is advertised as 178 liters. That is not what u get. The actual amount u get is 52 liters. The compress 178 fluffed liters into 52 liters. So this is false advertising and I’m extremely upset that I didn’t get what was advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "jeff keller",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Perfect for guinea pigs",
      "text": "This is the best. I accidentally bought a different kind and will not make that mistake again. This is soft and very absorbent. My pigs love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanna",
      "helpful_votes": 4,
      "publication_date": 20180516
    },
    {
      "title": "Guinea pig approved!",
      "text": "This has to be my favorite \"fluff\" I've tried so far. It absorbs well, keeps oder at bay and our guinea pigs love it. Best of all, it's easy to scoop out of the pen even by the water bottle where it gets really wet. This is our second bag and we will definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Birdie",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "The right product, in bulk, no fuss",
      "text": "We were buying the CareFree products. They were ok, but the pricing, and lack of bulk packaging is not the best. Pros: The Small Pet Select product is awesome! It is bedding, so it's not complicated. No dusting, VERY absorbent. Our piggies load it up with poo faster than the absorbency is extinguished. EXCELLENT packaging. Open a hole in the top, and fluff out of the package. It will even stand on it's own. VERY competitively priced, Bulk packaging. Cons: None that we have come across, we are already a repeat buyer.",
      "rating": 5.0,
      "verified": true,
      "author": "ShopsAlot M.",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "Best bedding for the bunny fans",
      "text": "Have been extremely satisfied by the quality of the bedding, rapid shipping, and packaging (dense pack/durable plastic wrap). Since this product is a cost effective alternative to shopping at any pet retailer there really are not any better options. Even if the bedding does not mitigate odor it does absorb and prevent staining pet paws or fur caused by puddling liquid.",
      "rating": 5.0,
      "verified": true,
      "author": "H2OMAN",
      "helpful_votes": 2,
      "publication_date": 20170411
    },
    {
      "title": "Excellent value",
      "text": "I use this litter/bedding for my rabbit and for my guinea pig. The litter is highly absorbent and it is a very good price. It is my first choice. The company quickly responds to communication too. I will definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dogmom54",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Healthy bedding choice at a great price",
      "text": "This is a good bargain for the best quality bedding for small animals. Many of the wood shaving bedding products actually cause respiratory damage. You might like the smell of wood shavings, but they are very dangerous for your little pet. This paper bedding is soft and has no fumes to worry about.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina R D",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "but I love it. Piggies do",
      "text": "This has kind of a smell, but I love it. Piggies do, too. I catch them chewing on it sometimes, but its no big deal. It's not the most absorbent and it doesn't really hide any stink. I have to clean out wet chunks every day, but I still recommend this over every non-fleece bedding.",
      "rating": 5.0,
      "verified": true,
      "author": "lacey lewing",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Sticks to my bun",
      "text": "I love that I can purchase this product in bulk, but I feel like I do go through it a bit quicker due to the absorption. The fluff always sticks to my bun's fur so I find that he tracks it out of his litter box and on to the carpet more than other brands. I will still keep purchasing this product for the price, but I wish it didn't stick to my bun's fur because I find it all around the carpet or on my socks. Also I like that it doesn't have a smell like other fluff bedding I have purchased at the store.",
      "rating": 4.0,
      "verified": true,
      "author": "Roman H",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Good product.",
      "text": "Not dusty and there's loads of it for a reasonable price. It's softer than other bedding I've bought and my guinea pigs seem to prefer it. They definitely lounge in it more than the other paper bedding I've purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia Desousa",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Think again!",
      "text": "Terrible product. It produces so much dust! It’s not good for any animal due to all the dust it makes. I noticed within a few hours that the cage and surrounding area was covered in lint, dust from this. It doesn’t hide the smell at all either.",
      "rating": 1.0,
      "verified": true,
      "author": "Skye McKinney",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Good quality litter for rabbits",
      "text": "We buy this product every month for our rabbits and are happy to say that the quality is always consistent. Packages are always packed and filled to the brim. The litter is soft, lightweight, and generally easy to clean and replace. It does not control the odor much but that is not a big issue for us as we replace it everyday. This is the best litter have have found for our rabbits so far and this company's customer service is amazing. We appreciate all the little notes that come with the products we buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Vasu G",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Don’t recommend",
      "text": "Has nothing to help with scent. Tons of dust. Stinks. Not very absorbent. It’s ground up cardboard (found bigger chunks) and doesn’t absorb. It’s not packed into the brick like the store bought bricks so you aren’t getting as much as you think.",
      "rating": 1.0,
      "verified": true,
      "author": "Aharp4",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Best price for small animal bedding anywhere",
      "text": "We bought the 3 pack for $100 after buying the single pack and being very satisfied. We clean our guinea pig cage once per week and the bedding works great. We haven't noticed any bad smells, or any side effects for our guinea. overall we are very satisfied and will purchase again when these run out. Compared to the prices at Petsmart or Petco, this is a no brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "someoneinaustin",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Great litter - and affordable too!",
      "text": "We have been using the Small Per Select litter for a few years (we have made 18 purchases of the 178 liter container). It is great litter - and it is affordable compared to other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "It’s to expensive for what you get.",
      "text": "This product is much smaller then you would expect. It is about the same size as any other normal big bag of bedding. But it’s outrageously expensive for what you get. I could go to my store and pick up the same amount of bedding and my animals love it even more then this. I will not be buying again. It’s not a good deal at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily McGarvey",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "This stuff is not worth the price!!!",
      "text": "This stuff sucks! I've used it for a week and going back to the other bedding I've been pleased with! Throwing away the rest of the bag and not even going to use the rest.",
      "rating": 1.0,
      "verified": true,
      "author": "Colleen Stephansen",
      "helpful_votes": 3,
      "publication_date": 20170311
    },
    {
      "title": "this wasn't as great as i thought based on reviewss",
      "text": "I got this based on everyone else's reviews and ratings. Within a few days, it had an odor like no other bedding I ever used. It also stuck to the bottom to the cage way more where our hamsters would potty. This was the worst bedding I've ever used. I'm switching to another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "gm8",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Excellent for Hedgehogs",
      "text": "Works very well for our pygmy hedgehog. We have been using this product for almost a year and it is by far the best we have found. It is soft and light enough for her to burrow through it and dig (looks like wood shavings but is not - it is soft paper). We have found that not only does she prefer it but over time it costs about 1/2 what we used to pay. High five.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Best bedding we've used!",
      "text": "We've had guinea pigs for 8 years and are so glad we found this bedding. It is by far the best bedding we have used and the quality is consistent. We've used this for a couple of years and love that it has no smell and the cages seem to stay clean for a longer amount of time.",
      "rating": 5.0,
      "verified": true,
      "author": "wgerdes",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "The Best Bedding",
      "text": "I found this and nevr went back. It is a great deal for great paper bedding. I love it. Totally worth it. One of these will last me a month almost, even w all my animals tht I use it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Deckers",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "I've always used the Kaytee brand clean and cozy small-pet ...",
      "text": "I've always used the Kaytee brand clean and cozy small-pet bedding for my guinea pig, the natural brown kind because it was cheaper than the colorful stuff. Anyway, Kaytee was getting expensive: $22.99 for a 16.4L bag, the biggest size they offer. This is a 52L bag before expanding. This volume would cost over $60 at my pet store. This bag is going to last me a loooong time. This product came in a box fitting it perfectly, the product arrived in tact and in the same condition I expect it from the pet store shelves, for example, DRY and the bag had no holes and the quality looks the same as the previous brand I was buying.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Bell",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "I love this for my piggies litter tray",
      "text": "I love this for my piggies litter tray. There is some dust if you have allergies but if you don't this is an awesome product! My pigs root through it, lay in it and simply have fun. This pack age can last 3-4 months since only use it in the litter tray. It is safe for my girls and keeps the odor down.",
      "rating": 5.0,
      "verified": true,
      "author": "iluvoinkrs",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Great Product",
      "text": "My bunny was getting a bit of small burns on a few toes from other paper products. This cleared her right up. Very soft for her. Extremely pleased with this product. Lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla",
      "helpful_votes": 0,
      "publication_date": 20200526
    }
  ],
  "product_meta": {
    "title": "Small Pet Select Natural Paper Bedding",
    "description": "Size:178LSmall Pet Select Natural Paper Bedding For Guinea Pigs, Rabbits, Hamsters & Chinchillas,56L. 100% Natural and Safe For Guinea Pigs, Rabbits, Hamsters, And Other Small Animals! The Perfect Pet Bedding - Extremely Comfortable and Super Absorbent For All Small Pets. This Bedding Will Work Great For Your Rabbit, Guinea Pig, Hamster, or Chinchilla - Guaranteed! In setting out to make the perfect bedding for small pets - we knew firsthand that comfort and quality were extremely important. However we were also very mindful of the other factors as well. With our guinea pig Lizzy - we had difficulty with some of the other rabbit and guinea pig bedding and litter out there. Some of the harder pelleted bedding are affordable and absorbent but they were just too hard on Lizzy's delicate feet, others were too dusty, and others just weren't safe! In our opinion it was important for bedding to be great in a number of areas, not just one. So when you decide to use Small Pet Select’s Natural Paper Bedding For Guinea Pigs, Rabbits, Hamsters & Chinchillas, you'll receive. ✓ The Highest Quality - Natural Paper Bedding for rabbits, guinea pigs, hamsters & chinchillas.\n\n✓ By & For Small Animal Owners - We're passionate about our pets, so we make sure everything we sell is 100% safe for yours.\n\n✓ A Great Value - Each Bag Of Premium Bedding Expands 3X In Volume From It's Packaged Size.\n\n✓ 100% Satisfaction Guarantee! - For you and your pets.\n\nJoin thousands of happy small animal owners and their delighted pets today and see for yourself why they love our Premium Natural Paper Bedding!\n\nSmall Pet Select sole aim is to provide the highest quality rabbit supplies, guinea pig supplies, and chinchilla supplies. Try us out today with our 100% satisfaction guarantee - you won't be disappointed!.",
    "rating": 4.5,
    "feature_bullets": [
      "Ideal Bedding For Rabbits and Guinea Pigs",
      "100% Safe - Made In The USA Without Any Harmful Chemicals Additives",
      "Soft + Comfortable for Your Bunnies and Guinea Pigs, But Still Super Absorbent",
      "Each Bag Expands 3X In Volume From It's Packaged Size",
      "Made From Pure Unbleached Never Been Printed Paper"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "25 x 16.5 x 8.5 inches; 14.5 Pounds",
      "Item model number": "BDING-178L",
      "Date First Available": "March 8, 2016",
      "Manufacturer": "Small Pet Select -- Dropship",
      "ASIN": "B01CPO7JW0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Houses & Habitats",
      "Bedding & Litter",
      "Pet Supplies",
      "Small Animals"
    ],
    "price": 39.99
  }
}