{
  "website_summaries": [
    {
      "verdict": "Choose this portable model if you like the idea of quietly cooling larger rooms with a modern-looking unit for a mid-range price point.",
      "pros": [
        "Stands out for its streamlined design and and contemporary looks",
        "Reasonably quiet operation",
        "14,000 BTU can cool up to 700 sq",
        "ft. of space",
        "Has remote control and sleek digital display"
      ],
      "cons": [
        "Hose and connector pieces don't seem very durable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Barely cools my room",
      "text": "It gets to 100+ here, and it often heats just as much as it cools with the hose sticking out the window in my 300sqft room. I put it to lowest temp, max settings but it only cooled my room from 100 to 98. My room is also properly sealed, especially near the windows. I'm not sure how I feel about 2 degrees difference for this product, I expected more. I already tossed the box and I'm not sure if I can return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 68,
      "publication_date": 20190419
    },
    {
      "title": "Not quiet, didn't cool--defective??",
      "text": "I researched for a long time and bought this because many said it was quiet. There is no way the unit we received could be called quiet by any stretch of the imagination. It was so loud it gave me a headache. Not a simple fan sound as others posted, a loud grinding rattle. It also didn't cool well at all. Called Honeywell and they were not helpful. I assume it's defective and sent it back, but it's very heavy and difficult to dissemble and get back in the box. So I'm not willing to try again. Overall bad experience and I live in a small area where it's not that easy to find things locally :(",
      "rating": 1.0,
      "verified": true,
      "author": "A. M. Nelson",
      "helpful_votes": 24,
      "publication_date": 20190617
    },
    {
      "title": "perfect ac",
      "text": "very easy to install. ever since I got this ac i’ve been getting deeper sleep and having more vivid dreams, i’m in florida and this ac (10,000 btu)has no problem cooling my large bedroom(converted from garage) from 80-90 down to 65-70 easily if you are in an area where you need mild cooling I would suggest you go down to the 80000 btu unit and save about $70 bucks because this ac is so cold that I wake up freezing and it’s defintely overkill unless you’re in a hot state, my favorite part is how clean the air is compared to my old window unit this ac changed my life and it even has wheels for easy transport",
      "rating": 5.0,
      "verified": true,
      "author": "kosta yamani",
      "helpful_votes": 16,
      "publication_date": 20190323
    },
    {
      "title": "Air conditioner",
      "text": "I love it! I have a 650 sq foot apartment and although is says it only cools 450 sq foot, the way my apartment is setup it cools the whole place!!",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Hatcher",
      "helpful_votes": 16,
      "publication_date": 20190503
    },
    {
      "title": "Great warranty, & you can expect very good service from this Co if you need it.",
      "text": "I've had the unit for 2 years, it worked well until 3 weeks ago. At that point, the coil area iced over, and the unit stopped cooling. It worked again afterward, but I could not be sure this problem would not occur again, and so I called for service. My review is based on the excellent quality of the service I got. A simple phone call, and they offered to replace the whole unit. Just needed to send a few photos. Received the brand new unit yesterday. All this after 2 years of use! Very unusual! The warranty is for 5 years, they mean it ! Kudos for making this customer happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Afax",
      "helpful_votes": 15,
      "publication_date": 20180719
    },
    {
      "title": "NOT GOOD.  LOUD NOISE COMPRESSOR RATTLE SOUND",
      "text": "Why all the good reviews??? Bought this 14,000 BTU HL series. It looked great and was easy to setup. Seemed to cool well but the noise from the compressor once it kicked on was loud and very annoying. I tried to tell myself I would get used to it but I could not. I called Honeywell Customerservice and they said maybe I had a faulty compressor so I got another exact same unit. It was loud and disturbing as well when the compressor was on. I then bought a nice new LG model with WiFi that was a bit more but it’s great. No rattle noise and works perfectly. So glad I did not settle for this Honeywell.",
      "rating": 2.0,
      "verified": true,
      "author": "curt",
      "helpful_votes": 11,
      "publication_date": 20190425
    },
    {
      "title": "Starts off good then fails very quickly",
      "text": "I could be missing something, but at first it would cool down to 60 degrees all the time amd it felt wonderful, now it wont go below 72 ever, the remote control will never stay in sync with the unit.. and it wont keep the place cool anymore. On top of that their R&D department left a huge oversight when making these AC they didnt consider people who have basement aparments their exhaust hose wont reach the window, i have had this ac for about a month and ita already no long cooling. Maybe ill return it and try another ac but I would not recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "Pattrick ",
      "helpful_votes": 12,
      "publication_date": 20190520
    },
    {
      "title": "Hunk of junk",
      "text": "I bought this in April. It wasn’t warm enough to use it until June. It didn’t work straight out of the box. It tells me the tank is full when it’s never been run, the sensor is broken. It was past the 30 day return period. Amazon was as helpful as they could be and offered to replace it but I would have to pay an $80 restocking fee. I contacted Honeywell and their customer service left a lot to be desired. After an hour of getting the run around from tech support and the warranty department they finally agreed to send me a new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20190611
    },
    {
      "title": "Pretty, but slow.",
      "text": "Just received and hooked this device up. It’s a very attractive piece of machinery. However, I’m underwhelmed by it’s output. It’s kind of like a fancy sports car that won’t go over 60 mph. Ugh! I also have a feeling that there may be a problem. About 3 am I awoke to a very odd odor. I’m concerned there may be a problem with the compressor which seems to just chug along. Hope I don’t have to return this thing after having my friend lug it upstairs. I’ll never make this kind of purchase on line again.",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria L. Myers",
      "helpful_votes": 9,
      "publication_date": 20190626
    },
    {
      "title": "Work very well",
      "text": "I installed this in my 364 square foot garage and it cools it off better than the 5000 btu window unit I had in there before. 14000 btu's might be overkill but I did not really know how efficient these were compared to a window unit..and it's a garage so I went with the most powerful I could find. It cools it off rather quickly and found it isn't that noisy at all being that 3/4 of the unit is not hanging out the window where all the noise is actually going. Great unit so far and I am very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Richardson",
      "helpful_votes": 7,
      "publication_date": 20190515
    },
    {
      "title": "Love this portable A/C",
      "text": "After doing a thorough research for portable A/C units I decided to purchase this unit. Received unit within 3 days of ordering and had it installed. Installed on my patio which is about 500 square feet and it works like a charm. The room was cooled in no time and did much better than I expected. This unit has a great deal of features which i have yet to explore but will. If you're looking for a good unit, this is it. I would definitely purchase again and recommend this unit to anyone in search of a good portable A/C.",
      "rating": 5.0,
      "verified": true,
      "author": "clarence e. carver",
      "helpful_votes": 8,
      "publication_date": 20190526
    },
    {
      "title": "The Window Bracket Does NOT Fit Smaller Windows as Honeywell Claims.",
      "text": "Honeywell advertises that the window bracket fits windows as small as 26.6 inches, but this is NOT TRUE. The bracket pieces are about 26.6 inches, but you have to slide the interlocking pieces out to expose the hole for the air hose. When you do this, the bracket becomes 37 inches wide. This is the smallest window that the bracket will actually fit.",
      "rating": 2.0,
      "verified": true,
      "author": "Mid Atlantic Customer",
      "helpful_votes": 9,
      "publication_date": 20190330
    },
    {
      "title": "Expensive piece of garbage.",
      "text": "This worked great when the temperatures outside were under 70-75, but as soon as it got hot out it turned into a useless piece of garbage. Set it to 60 because I like to be cold in my room to sleep and the temp gauge doesn't go below 70, so it's not really doing jack. The vent flap does NOT open automatically and has to be held open with tape. The fan setting on high barely pushes air more than 2 feet in front of it. My silver floor fan works better than this does at pushing air forward. I really regret this purchase, don't waste your money, buy a window unit if where you live allows it.",
      "rating": 2.0,
      "verified": true,
      "author": "cassss",
      "helpful_votes": 4,
      "publication_date": 20200529
    },
    {
      "title": "Not happy!",
      "text": "Not very happy with this purchase. The ac works fine but the hose that goes outside is very short. They need to make them longer as it's easy to make it short but no way to make it longer. I have checked on the website to see if they offer a longer hose but found nothing. We have had a very humid year and the ac takes the water from the air we have a big container for it to drain into but it needs to be dumped several times a day. We can't run it at night because it will over flow.",
      "rating": 2.0,
      "verified": true,
      "author": "Debkin",
      "helpful_votes": 11,
      "publication_date": 20170824
    },
    {
      "title": "LOVE this portable AC!",
      "text": "I live in a Florida house where I prefer the temperature a few degrees cooler than everyone else. My room is also a couple degrees hotter and more humid than the rest of the house. This product has been the perfect solution! It has removed the humidity and easily cools my room to a perfect 70. I believe it can cool down to the low 60's. I absolutely love it! It was also very easy to assemble the vent in the window. All around great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Streater",
      "helpful_votes": 7,
      "publication_date": 20190412
    },
    {
      "title": "Trash!!!! Pure Trash!!!",
      "text": "I’m really, really disappointed in this Portable AC. I bought this unit to replace a prior Honeywell Portable that worked wonders until it died. Although it was easy to set up, it doesn’t cool a darn thing. To make matters worse, the older model I had was only 10,000 BTUs. Returning this crap. I don’t recommend buying this product. Do not let all of these positive reviews fool you. A whole mess.",
      "rating": 1.0,
      "verified": true,
      "author": "NoName",
      "helpful_votes": 9,
      "publication_date": 20180718
    },
    {
      "title": "Doesn't cool - just works as a very expensive fan.",
      "text": "Worked one night - from then on - it does not put out cold air. Temp outside at 78 F - cools to 75 after 4 hours. I have turned it off - left it off for 4 hours - then back on - same problem. When I set the temperature below the room temp - I can hear the difference in sound as the compressor comes on. But still no cooling. There are no error indicators lit and the fan runs at a good rate - just does not work. I will attempt to return it. My advice to anyone thinking of buying this unit: don't. If I could give zero stars - I would.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Horner",
      "helpful_votes": 13,
      "publication_date": 20170702
    },
    {
      "title": "Unsatisfied",
      "text": "I live in the northeast we rarely get above 90 but average 82/85 in the summer with moderate humidity. This air conditioner does not cool the room (16 x 14) below 72 running it all day and the air always has a \"moist\" feel to at that temperature range. I decided to keep it as a back up for a much smaller guest room since it was such a problem to repackage and ship back to them. I will never purchase another unit like this one and Honeywell is off my list period.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert R.",
      "helpful_votes": 6,
      "publication_date": 20190713
    },
    {
      "title": "Portable air conditioner did not blow cold air",
      "text": "The UPS delivery damaged the box and broke and crushed the styrofoam. The unit did not seem damage when we unpacked it, but it blew only room-temperature air regardless of all the troubleshooting and contact with Honeywell support. I had to box it back up and ship it to Amazon, a huge hassle considering it weighed 70 lbs. not happy with the unit or Honeywell support.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 7,
      "publication_date": 20190601
    },
    {
      "title": "5 for cooling, 1 for noise",
      "text": "It cools the area very quickly, and I'm cooling a Large Master bedroom with attached Master bathroom. The downside is it is crazy loud. Its like having a truck idling in my bedroom. It also gurgles. While it runs it switches back and fourth from just the fan running, to a/c running. When its just the fan its tolerable. When It switches between fan and ac it kicks on hard. It clanks real loud. Can startle me. It wakes me up. It your going to use somewhere other than a bedroom, Great. If going to use in a bedroom its very loud, and can make you jump out of your skin",
      "rating": 3.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20190609
    },
    {
      "title": "The loudest I have ever heard.",
      "text": "I wish I returned this. It is beyond loud. Between the noise and the humming. It’s enough to drive a person mad. It does cool. However I my opinion it maxes out before 300 square feet. It runs non stop cause I’m using it trying to cool the square footage it claims it can cool. This Is definitely in the top 5 of the worst purchases I have ever made my entire life. I have purchase 20 plus air conditioners. For my home and my tenets homes. I will never by this brand again. Best on the market everyone says. NOT!!!",
      "rating": 2.0,
      "verified": true,
      "author": "SheaTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20200806
    },
    {
      "title": "Air conditioner is a lemon",
      "text": "The product I received is a lemon. It doesn’t auto evaporate at all. It comes up with a water tank full error after about an hour or two and must be manually emptied. It only has about a quart of water which is also less than it is supposed to hold. I contacted Honeywell. They told me it was a sensor defect in the auto evaporator. I contacted the seller and told them. The seller told me to contact Honeywell. I called Amazon. Long story short- per Amazon it is about two weeks to get this resolved. Between the product and the warranty, I have spent nearly $700 for an air conditioner which is a lemon.",
      "rating": 1.0,
      "verified": true,
      "author": "pamela",
      "helpful_votes": 3,
      "publication_date": 20190704
    },
    {
      "title": "I really like this air-conditioner.",
      "text": "i really liked this air-conditioner but I gave it 4 stars because it takes 2-3 hours to cool my living room, about twice as long as my old window air-conditioner. However, once the room was cool it maintained the cool nicely with out a problem. It is easy to use and install. The hose fits snugly in the window but it is adjustable to fit several sizes of windows. the filter is easy to clean. It is pretty quiet, better than my old window one and nice looking. The out side of my house is more attractive with out the old air conditioner in my front window. I really like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 2,
      "publication_date": 20191211
    },
    {
      "title": "Cadillac of portable AC as a renter",
      "text": "I live in a hot humid place gulf coast FL. I got this a few days ago. My central ac (I rent) just cannot keep thing regulated how I want it. I have installed this and hooked up correctly I am in heaven. Now it's not hottest week in the year yet but this makes a world of difference so far. This is not my first portable. I had a 10k at a villa in my last place and it was loud. This thing is nothing compared to it. I will update if troubles arise or as the hottest days of year come.",
      "rating": 5.0,
      "verified": true,
      "author": "Goodyaz",
      "helpful_votes": 4,
      "publication_date": 20190410
    },
    {
      "title": "works well",
      "text": "I have been pleased with this. For the type of ac it is i think it works well. Much nicer than having a window unit , in my opinion. If i had it to do over , I would spend a little more and get the next size up for a little more power. I live in Georgia and I am using it in a bonus area over a detached garage, about 400sf. It gets hot up there! There is one vent from the house running thru breezeway roof, and the space is not complete. All that considered I think it does a good job. I think in a \"normal area\" it would do great.",
      "rating": 5.0,
      "verified": true,
      "author": "Y. Palmer",
      "helpful_votes": 3,
      "publication_date": 20190521
    },
    {
      "title": "Not really a Honeywell product",
      "text": "We ordered two. One arrived with a smashed caster. Amazon connected me with Honeywell rep who informed me that they don't actually make the air conditioners but have an agreement with another company allowing them to use the Honeywell name. They gave me a number to call. I needed to wait until Monday to call. After I called, they required several emails to confirm our purchase and other details. Once that was complete, we received our replacement part within 48 hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura Millar",
      "helpful_votes": 7,
      "publication_date": 20190416
    },
    {
      "title": "We’ll made, easy to install!",
      "text": "So happy with this purchase! Easy to install, sleek design and noise level is perfect for sleeping. We have only used it for two nights but it quickly cooled down our large upstairs master bedroom and master bathroom and held the temperature that we entered on the remote. Haven’t had the unit long enough to comment on the energy efficiency but we’re really happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica R.",
      "helpful_votes": 4,
      "publication_date": 20190505
    },
    {
      "title": "May have a faulty unit",
      "text": "This unit seemed to be absolutely perfect for the room ... cooling it down with little trouble. Then, not more than three or four used it seemed to seize up and not cool the room. I checked the coils - they were not frozen. Not sure where/what to do.",
      "rating": 1.0,
      "verified": true,
      "author": "C-L",
      "helpful_votes": 6,
      "publication_date": 20180809
    },
    {
      "title": "HL12CESWW is a Total Waste of Money",
      "text": "This review is for the Honeywell HL12CESWW 12,000BTU unit. This thing won't even cool a 200 sq ft room. Even at night, when the temperature outside was 86, the room wouldn't get any cooler than 79. When you put your hand up to the air coming out of the unit, it just feels slightly cooler than the air in the room. This thing is basically an expensive fan. It's properly vented and the water doesn't need to be emptied, I know the unit will shut off the cold air if it fills with water.",
      "rating": 1.0,
      "verified": true,
      "author": "3 to 1 Video, LLC",
      "helpful_votes": 6,
      "publication_date": 20180918
    },
    {
      "title": "Wow!!",
      "text": "Was a bit expensive but I am glad that I made the decision to go ahead and just get it. I have a 725 sq ft open concept apartment and with the addition of my tower fan positioned to draw the cool air into my bedroom this beauty has been keeping my place cool and comfortable for me at 68 degrees with temperatures at 90 degrees outside. I also have 12 foot ceilings and 2 walls with 9 x 6 windows. I am pleased as well as surprised. Hopefully it will continue to do so for many summers.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Expensive to run",
      "text": "I like this unit well enough. It doesn't blow out super cold air like our last less-expensive one did. It's adequate. We've had for a couple months now, and the main thing I'd like to comment on is that it is expensive to run. We set ours at 72 degrees, and run it from 9pm to 7:30am, and it our electricity bill jumped from $400/month to $600/month. This is for the months of May and June in sunny FL, and I imagine that July and August will be even more expensive. Maybe the cost will drop come Fall. We'll see. It IS quieter than our last unit, which is a plus.",
      "rating": 3.0,
      "verified": true,
      "author": "MacyMae",
      "helpful_votes": 2,
      "publication_date": 20190617
    },
    {
      "title": "A neat portable air-con",
      "text": "Took me a while to setup, had to make adjustments to the ventilation bracket because I have a small window. It runs a little louder than I like but the night mode makes it run much quieter. Overall I'm happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Sterling Bumgardner",
      "helpful_votes": 5,
      "publication_date": 20190507
    },
    {
      "title": "It’s a Great A/C unit, it’s ice cold❄️!!",
      "text": "I bought this to use in my bedroom for the summer. It gets so hot I can’t sleep. My apartment box a/c unit is from 1984. It still works great, but I’m sure it’s sucking up the electricity. I live in SoCal so the power bill last summer was $200.00 a month, for 3 months for a 650sq ft apartment. Hopefully this can knock the bill down! I don’t like the fact that you cannot adjust the vent. It points up, so I need a fan to direct it. I hate that. But it does blow ice cold air, I LOVE that!",
      "rating": 5.0,
      "verified": true,
      "author": "Shellbell",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "Easy to install and use, loud, thermostat off",
      "text": "This was easy to install and it works. We thought we'd save by using this in the room upstairs vs turning temp down for entire house and downstairs feeling like meat locker. It is loud and the thermostat is off. If I set the remote to 76 it cools to 73. It wont turn off unless I change remote to 78. Then it gets hot. Very difficult to drain. There are 2 drains. Both in awkward places. Be prepared it leaks when you drain it. It plugs up and doesn't leak in between. I move it to bathtub and let it sit angled downward. It's heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "JQ",
      "helpful_votes": 2,
      "publication_date": 20181020
    },
    {
      "title": "Works well in MN summers",
      "text": "Amazed at how quick this pulls the humidity from the air! Living through MN summers means hot and humid, and this takes care of both issues. Cools things fast, and dehumidifies fast. Easy to install and move around. I used the continuous drain method- drain hose goes right into a bucket and I empty the bucket instead of hauling the unit to the bathtub to empty. Quieter than most portable units.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer ",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Does keep about 500 sq ft cool.",
      "text": "The unit itself is great but not quiet, as advertised. The window kit is a one star as it is not long enough nor sturdy enough to fit in a slide to side window. I would buy again only if they upgraded the window kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Edwards",
      "helpful_votes": 4,
      "publication_date": 20190508
    },
    {
      "title": "R2D2",
      "text": "What a great product. We have nicknamed it \"R2D2\". Its a little larger than expected but fit well in our small 1200sq.ft house. The room is 400 ft. Sq. Where we have R2, and it is an ** awesome** air conditioner. Had the room cool very quickly, fan mode was quiet and strong. It too less than 5 mins of set up. Dont believe the people who say the hose is too short, it expands. I had to use cardboard and duct tape to affix the hose because the window contraption didnt fit my window. But again, 5 mins. Really a great product. WORTH IT.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa A. Santoro",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Glad we got it",
      "text": "We bought this in April so we've had it a while. We have a 918sqft apartment and it works pretty great. We keep it in the living room and it keeps that area really cool. It doesn't reach the whole 918, but its not supposed to. Makes summer bearable. Our electricity bill hasn't gone up at all so that's cool. We really like this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa ",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "NOT COLD ENOUGH",
      "text": "for a 14,000 btu ac unit in a 10ft.by 20ft. room Would think it would be an ice box in that room but your wrong. I have to put the ac on hours before I go to bed. And when I do go to bed the room is ok but not cold enough that you have to get under a blanket or sheets. My 14,000 btu ac is brand new but its working like a 10 year old ac unit.",
      "rating": 1.0,
      "verified": true,
      "author": "mike minnero",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Easy install & quiet/ But.....",
      "text": "Purchased for 10X20 sun room. Do not believe the square footage in description/ if you have a room with lots of windows you will need window coverings, and highest BTU's. Otherwise go with a window unit. This is the 2nd one we purchased / will try to sell the smaller one/ $ lost because of deceptive description. Should state clearly that for a sun room a much higher BTU needed. 14,000 is cooling well so far. And installation was so easy. If questions contact Honeywell before purchase. They were very helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "B&C.",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Great Air Conditioner",
      "text": "This air conditioner was a Godsend. It is as quiet as any air conditioner and very easy to connect. It was packaged very nicely. The best part is how well it cools. It brought our guest bedroom down from 76 degrees to 68 degrees in just a few minutes. It also cooled our dining room, which is part of a large open area. Our kitchen and dining room get very hot when we're cooking (holidays for example) and this cooled the dining room nicely. This was a great purchase and we're very happy with it. You may have to trim the window adapter if your windows are narrow, but that's easy. We would definitely recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "George A. Seaver, Jr.",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Cool Baby!",
      "text": "This is a lovely unit that cools the room down quickly and efficiently without straining the main cooling system. While it's a bit noisy, a pair of earplugs aids to decrease the sound. Easy to install and maintain. Best money that I have spent in a long time. Only one drawback as I see it, the window panel is not easy to cut for the proper size of the window, there should be an easier solution. Highly recommend this unit.",
      "rating": 4.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Noisy and doesn't cool room",
      "text": "Returned after a week. I have a 400 sq. ft. living room in my apartment (which is what this was advertised to accommodate) and I left it on for 24 hours, but it never fell below 80 degrees. A lot of reviews have said it is quiet, but it IS NOT QUIET. The room I have it in is quite large, but when it's running I have to turn the TV to full volume just to hear it. Forget about moving it to the bedroom, I walked in and it sounded like a factory! Very disappointed and will probably just invest in a window unit for the bedroom. DON'T TAKE A CHANCE ON THIS.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "So So Cool",
      "text": "I was nervous about spending this much money on an AC unit. I read the reviews and decided to take the plunge and I am SO glad I did. It is starting to get balmy here and being able to come home to a wonderful cooled down apartment is making a world of difference. It cools down my whole living room area, bedroom alcove, and front hall. An area well over 500 sq feet. I am so glad I bought this and would recommend it in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "Katja Frazier",
      "helpful_votes": 2,
      "publication_date": 20190523
    },
    {
      "title": "Easy to install, quiet and effective.  Who could ask for more?",
      "text": "What a relief this A/C provided. Our NYC apartment A/C (through cold pipes in the wall with a room unit) only brought our large living room to 76 degrees. Tooooo warm. We ordered this unit with some hesitation because of various reviewers of all brands said they were loud .... NOT SO! Even on high, this is quiet... no where near as loud as a window a/c unit. At 7 pm we turned it on after a 12 minute installation. By 7 a.m. it was 70.5 degrees. It's a big room. This worked well. Thanks for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Glo G.",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Noisy! 80 Db Loud",
      "text": "I purchased this product based on the reviews of how quiet it is. Unfortunately, this unit is anything but quiet. i have read that the unit should not exceed about 45 Db yet my unit is at 80 Db. this is almost as unbearable as the summer heat. the noise appears to be coming from a vibration in the machine when the compressor is running. i can only assume my unit is faulty and i will update this review if HoneyWell help address this issue. until then i will put my ear plugs in.",
      "rating": 2.0,
      "verified": true,
      "author": "The Hoodster",
      "helpful_votes": 2,
      "publication_date": 20190728
    },
    {
      "title": "Regretful purchase",
      "text": "Have bought lots of things, this was a first for a used and in \"good\" condition product. Won't be surprised if the item fell down two flights of steps or off the truck, it was that damaged and the description minimized the condition. But too bulky to return and the need was immediate.",
      "rating": 1.0,
      "verified": true,
      "author": "Uncle S",
      "helpful_votes": 3,
      "publication_date": 20181008
    },
    {
      "title": "WORKED WELL FOR A TEMP COOLING SOLUTION",
      "text": "Got this for a temporary cooling solution until we got the central air fixed. It wasn't August but it kept the room cool at the desired setting. If I needed it in August or for a longer period I would have gone for the 14,000 BTU. Our bedroom is about 400 square feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Memphis Music Man",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Great, quiet, love not having to empty",
      "text": "We got this to replace a different brand portable air conditioner that leaked all over the place. This one is a lot quieter, keeps the room more comfortable and I LOVE not having to empty it! I did notice, that it must have been dropped in transit bc the bottom front corner is cracked and pressed in a little. The unit still works fine so not a big deal, just worth mentioning.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Works",
      "text": "I live in an old farm house with no air conditioning. This saved the day so my pup and I could sleep in the recent 90+ degree days. Only critique would be the window \"attachment\" isn't fully modifiable for window sizes, so I had to saw off part of the extension so it wouldn't cover the hose hole. Then has to use tape to keep it in the window as it's not tension and there is nothing that keeps it in the window (my windows open outward at an angle, not just straight up)",
      "rating": 5.0,
      "verified": true,
      "author": "MNTNA",
      "helpful_votes": 3,
      "publication_date": 20170703
    },
    {
      "title": "Works pretty well, not great",
      "text": "I have one room that is 400 square feet (living room) and another that is about 100 square feet (bedroom). This works pretty well for both. With the 400 square foot room it does take some time, and I feel like the room is much cooler around the unit rather than the entire space. But this still does what it needs to quite well. The only thing I'd say I'm a little disappointed in, is that it doesn't seem like it can take the temperature to the upper 60's or even the very low 70's. It seems to max out around 73.",
      "rating": 4.0,
      "verified": true,
      "author": "Sunyata",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "WATCH OUT FOR DAMAGE IN SHIPPING",
      "text": "I received this unit a couple days ago but just now opened and started using it. The unit ran for three hours when I walked by just to check on it to find a HUGE puddle of water on my floor. I also noticed that the \"automatic\" opening door for the fan did not open on its own. Very disappointed. That was a lot of money to have it show up broken, and now I'm stuck loading into my car and taking it back to the UPS store.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20190617
    },
    {
      "title": "Might be a good product, but I will never know",
      "text": "Might be a good product, but I will never know. The manufacturer does not package the item well enough to survive transport and delivery. I returned one because of damaged box/missing parts and UPS returned a second one even before delivering it to my home. Note the other reviews that tell about the same problem. If you are going to buy this, get it at a brick and mortar store.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim R",
      "helpful_votes": 10,
      "publication_date": 20180510
    },
    {
      "title": "Didn’t Live Up To Expectations.",
      "text": "We Live in Westchester NY for a frame of reference. The unit pretty quite but doesn’t cool a 250 SF room. It just keep blowing but never achieves the temp - really a disappointment given the multitude of positive reviews I read. Also, we are emptying the water every 4 days. This too is super inconvenient. I would recommend over sizing or getting a different brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Failed to cool our living room",
      "text": "I had a high expectation after reading the reviews but it turns out to be disappointment. Our living room is 4~500 sqft at most but this one never able to make our living room cool. The air it generates seems not cold enough, and sometimes I can't even tell whether it's running in fan mode or ac mode.",
      "rating": 1.0,
      "verified": true,
      "author": "EJ",
      "helpful_votes": 3,
      "publication_date": 20190618
    },
    {
      "title": "Just OK",
      "text": "This AC does a good job of cooling a small ~180 sq ft bedroom when all of the doors, windows, and gaps are sealed off. Once we move it to our living room (~400 sq ft) it really struggles to keep up. It does cool the space down about 5 degrees but it doesn't seem to be able to do any better than that. I think these types of portable ACs are just inefficient by nature. Unless your room is sealed up really well with no gaps to the outside, performance is going to be just OK.",
      "rating": 3.0,
      "verified": true,
      "author": "Bud Valley",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Save the Packaging",
      "text": "We were so excited and hopeful that this unit would be he answer to beat some of the triple digit days we experience, but unfortunately, this product did not make a difference in cooling our room whatsoever. If we stood directly over the stream of air, sure, it was cool, but the temperature in the room did not change at all, in fact, as the day progressed the temperature went up by 2 degrees. Disappointed. Plus side is returning this product was simple. We repackaged it and UPS came and picked it up. So if you do purchase this, save your packaging just in case!",
      "rating": 1.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Worked the first time, and that was the only time it actually cooled the room.",
      "text": "Worked great the first time I used it. Every time since, it’s blown out cool but not cold air, and by the time it made my 250 foot bedroom cool, the central AC had already cooled the rest of the house, so I’m not sure it was doing anything. Also, the compressor isn’t super loud, but definitely louder than a window unit. It was a shame because I was excited to have the small panel in the window instead of having my view totally blocked by a window AC unit, but it wasn’t meant to be.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom W-",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Everything you need is in the box",
      "text": "I chose the Honeywell because everything needed to install it for use with my crankout windows came with the unit. Installation was easy. I mounted the window bracket vertically in my window and when it was not quite long enough Honeywell immediately sent an extension. This unit is not louder than a window air conditioner, but none of them rate 5 stars for quietness. Very pleased.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert L. Mckee",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Cools well but LOUD.",
      "text": "So.... I really wanted to love this air conditioner. We bought it for the bedroom during the relatively few really hot nights we have here in the northeast. This purchase was to replace a five year old sharp that died this spring. It does a great job of cooling our room, but this thing is LOUD. Even with earplugs and a pillow as a sound muffler I found it disturbing. Our older unit was much quieter, so I am disappointed. Too heavy to repack and return..",
      "rating": 2.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Great AC. Worth every penny",
      "text": "Love this AC. I believe this AC works great. I do not even use on the highest setting. It makes the room super cold and fast. This AC is very powerful and easy to sleep though.",
      "rating": 5.0,
      "verified": true,
      "author": "run99",
      "helpful_votes": 2,
      "publication_date": 20190902
    },
    {
      "title": "It is super quite, very efficient and high quality",
      "text": "I like the presentation of this 10000 btu unit and the cold air that it puts out!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Hollenbeck",
      "helpful_votes": 5,
      "publication_date": 20190427
    },
    {
      "title": "Sleeeepurrrr...",
      "text": "Cold Air!!!! Totally Acceptable Noise Level. Ee-Zee Hose Install Kit; Up & Running in 18.25mins(incl.2 smoke brks). Important to Know, Difference B/T 1 Hose vs. 2 Hose Port. A/C Unit, Research BEFORE Deciding what to buy, cant go wrong with anything Honeywell, im happy with decision to go with this one, recommend for sure!",
      "rating": 4.0,
      "verified": true,
      "author": "MR. MATTY £",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Decent",
      "text": "Definitely lowered the temp in my living room. Noise isn't too bad, it sits right by my TV and I didn't turn my TV up at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica B.",
      "helpful_votes": 3,
      "publication_date": 20190525
    },
    {
      "title": "Honeywell portable ac unit",
      "text": "Just received and ran this ac unit in the living room of about 700 square feet. This system cooled it substantially from room temperature of 75 degrees down to 70 degrees in about an hour. Not bad for the price. So far, so good and hopefully this unit keeps performing well consistently through several warm seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20200610
    },
    {
      "title": "The exhaust pipe is low quality, everything else is good.",
      "text": "Over one week usage review. Might update this in future. So far so good. Noise level is okay. Note: this portable AC is pretty huge, might want to look at the measurement carefully before purchase. Goods: Cool as stated. Fast cooler. Bads: The exhaust pipe that connect to window is low quality plastic. I can feel some heat leaking from it just right behind the ac... on my first use without adjusting it much, I don’t expect the pipe is leaking already.",
      "rating": 4.0,
      "verified": true,
      "author": "W. L",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Quit working within 3 weeks",
      "text": "All directions were followed to the letter..... PI error code (water tank full) showed up and tank was empty. Unit will start, then shut right back down. Apparently a common problem. Wish I had known. Nothing back from Honeywell support either, except a survey of how they handled my problem. they haven't!!",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa B",
      "helpful_votes": 3,
      "publication_date": 20180920
    },
    {
      "title": "Works Great",
      "text": "I purchased this unit for our 800 sq ft cabin in northern Michigan. Temp outside has been in the 90s with high humidity, and a perfect 66 in the cabin. We are slightly shaded with trees, however the traffic in and out raises the inside to around 80 during the day. When we turn it on at night, the cooling is felt fast, and takes about 2 hours to make it comfortable. So far its only been 2 days, but it is doing its job well",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "Using in our RV - Quite and efficient",
      "text": "Since we are full time Lampers this portable air conditioner is just right. The noise level is quite and allows a peaceful nights sleep. We found it helpful to use a 12 gauge extension cord directly into the power source helps the unit work most efficient. We are so happy with the unit we purchased a second one for the other end of our RV. The only negative feature is there is only one size slider for the window and we had to make adjustments for the rounded corners. The unit itself is great but do expect to make adjustments to the window contraption for an air tight fit for the exhaust hose if using this for your RV.",
      "rating": 5.0,
      "verified": true,
      "author": "Full time RV life ",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Not very impressive for it's price/size.",
      "text": "I bought the 10000 Btu version so I would have more than enough to cover the 500 sqft space I'm trying to cool down. It's 95 degrees outside right now and after 4-5 hours of running the AC has cooled it down to 78 deg. My previous 8000 Btu unit had no trouble dropping the temp in this room to 68-72 deg regardless of the temp outside. For the $430 I paid for this unit I'm not impressed by it's performance. This thing isn't small either, with the hose and everything it easily takes up a 3' x '2 space on the floor.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon T.",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Unit is very heavy but works great.",
      "text": "Just received unit so far it works very well. The unit is a lot bigger than expected. The only thing that was a pain was the window insert it had to be cut so it fits properly. And it dosen't stay in the window. But the actual air conditioning unit work good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190414
    },
    {
      "title": "Couldn't  be happier",
      "text": "We have had this over a couple of weeks now and I couldn't be happier. This portable air conditioner is easy to install and use. It cools my house down so well I dont even use my air in the bedroom. I will update after a few more weeks but as of now best thing I purchased to keep cool Update... This is the best purchase I have made. for me its so quite not one noise and the cooling is amazing.. I now get so cold I have to shut it off for a little while well worth the money..",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Works great!",
      "text": "Love this thing! Its quiet, cant hear it run. SUPER easy to install! It comes with window piece, attach hose that comes with it, and adjust to fit your window, I put tape around it to seal it from air and bugs. Its cranks out the cold! My home HAVAC system went down and used this until it was fixed, it was a life saver! I'm going to use it in the future in the master bedroom as that's always the hottest room in the house to give the room some extra cool with out having to cool the whole house. Can't go wrong with this unit! Remote control also!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Customer",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "The portable air conditioner was defective to begin with and did not start.",
      "text": "The portable air conditioner was defective to begin with and did not start. I am in the process of returning it and getting a replacement.as I want to give Honeywell benefit of doubt and second chance.",
      "rating": 1.0,
      "verified": true,
      "author": "In s kim",
      "helpful_votes": 4,
      "publication_date": 20190330
    },
    {
      "title": "Great Amazon service and great AC also!",
      "text": "The first Honeywell HL12CESWK that I received was damaged during delivery and the motor was making a loud whining noise when I turned it on. I contacted Amazon and the process of explaining the problem, having a new replacement shipped right away (same model) and then Amazon picking up of the first AC went very smoothly. I had returned items before but never this big or expensive and the process was pretty easy. So, 5 stars for service. And yes the replacement AC is very quiet and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Nice and cool!",
      "text": "Product easy to install. I have used it and it cools nicely, but hot months are around the bend, so time will tell!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 5,
      "publication_date": 20190422
    },
    {
      "title": "Decent but not great",
      "text": "I purchased this style unit almost 2 years ago. It wasn't cooling as well so I purchased another one. I really like the first unit. This second unit doesn't hold the programming and it is loud. I would have given the first one a 5 star rating and this current one a 3 star. I will look into another brand for my next one.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert A.",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "AC",
      "text": "Very quiet now waiting for hot weather to try it out",
      "rating": 5.0,
      "verified": true,
      "author": "tony malshuk",
      "helpful_votes": 3,
      "publication_date": 20190526
    },
    {
      "title": "Best unit I ever owned!",
      "text": "I bought this to cool my 2 car garage and I live in Arizona! I must say this unit is more than adequate! It keeps our garage very cool ! My dog is kept in the garage during super hot days and she loves it! I highly recommended this unit to anyone looking for a unit that is quiet and efficient!",
      "rating": 5.0,
      "verified": true,
      "author": "vincent talamantez",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Effective AC unit",
      "text": "This product works really well, will cool off a room in no time and looks nice. The controls are intuitive and easy to use. Its a bit loud, but that's kind of expected for AC units in general. The remote that came with it also doesn't seem to work; put batteries in, pressing all the buttons, but nothing happens. Not a deal breaker for me since I wasn't really planning on using the remote anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Gordon",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "works well, cost a fortune to run",
      "text": "it works very well. is a little noisy. But our electric bill went way up from running it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200510
    },
    {
      "title": "Returned Twice - Faulty Water Tank Sensor & Air Vent Wouldn't Open",
      "text": "I bought a 9,000 BTU version a few years ago it runs well (2018 maybe). However, I just a new 10,000 btu unit (June 2020) for another room in my apartment. The first one was returned because of a P1 error indicating that the water tank was full. I just got my second one delivered and the air outlet on the top of the unit doesn't open automatically like its supposed to. I'm giving up on this air conditioner, returning it, and getting a refund. It's a giant piece of garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Martin D.",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Water damage",
      "text": "Caused 500$ in damage to my floor. Had it properly set up with the hose draining in a bucket and the vent fan out the window. It leaked out of the bottom and with carpet under it I couldn't tell the floor was getting leaked on until it was too late and my floor gave in. It does a decent job at cooling down a medium sized room, but when it gets in the 90's and 100's it seems to struggle for sure. I'm sure the company wouldn't do anything about the damage, they would just assume it was set up incorrectly, but thats not the case. Would not recommend for any of my friends.",
      "rating": 2.0,
      "verified": true,
      "author": "CALMACE",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Top-of-the-line portable air condition",
      "text": "I read many reviews about many portable air conditioners. I chose this Honeywell. It is perfect. I don’t understand some of the other bad reviews. Mine was everything I wanted and needed. The air coming out is extremely cold. Just what you need on a hot summer day",
      "rating": 5.0,
      "verified": true,
      "author": "Jurey56",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Awesome AC...window kit could be better",
      "text": "Searched for weeks on Amazon to find a good AC unit for my home in Colorado Springs that does not have a central AC installed. Setup was very easy besides the window kit...as others have said the kit does not fit exactly and requires some manuveruing, but besides that this AC is great! It is 86 degrees outside right now and for the first time ever my house is 67 in the summer! Buy this unit",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Beymer",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "modification of window attachment",
      "text": "great deal as i caught it on a lightning deal. arrived a day early. set up was easy except i had to pull out my miter saw to cut a piece of the window attachment to fit my window. if i didn't cut it, the pre-cut hole in the gray window attachment would block the expelling air from the hose from the a/c. once cut it fit like a glove in the window. so far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Works as designed and as advertized",
      "text": "The unit looks great in our bedroom. It was so easy to setup, I thought I did it wrong. I highly recommend the product. The only negative thing I would say, is that I ordered 1 unit and received 2. I only needed 1, but returning the other unit due to content in the unit, is not an easy return and I have not received instructions from the seller as to how to return it.",
      "rating": 5.0,
      "verified": true,
      "author": "Antoine Wehbe",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Underpowered",
      "text": "I tried using this to cool down a garage workshop (well within the max square footage specifications for the 14000 Btu model) and it was no match for Phoenix heat. The AC cools for several minutes and then \"takes a break\" during which it only blows air like a fan. The volume of air and the amount of cooling are insufficient for cooling a hot room. It reduced the temperature by only one degree after running for 2 hours. Seems best suited as supplemental to central AC, or for modest cooling in less extreme climates.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Came damaged and was extremely loud",
      "text": "The Honeywell portable a/c clearly came damaged and looked like someone rolled the insides of the machine down a hill as seen in the photos. Also, the condenser rattled like a jet engine. I know condensers make noise but this one was hitting straight metal on metal like a machine gun. Maybe this was because it came so heavily damaged. Returned the product and ended up getting a working different brand from a local store.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Foul Smell After 2 Months Of Use",
      "text": "The unit never fills the drainage tray, and it smells like rotten socks after 2 Months of use.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "Little loud, but it cools down a room pretty well and pretty fast",
      "text": "I got this portable AC unit for my room with my computer because my computer made my room extremely hot. This cooled my room down within minutes. Although the sound is a little loud, it makes a buzzing noise once the compressor kicks in, but honestly if you have headphones in and playing games or watching something, it's easy to tune it out. Overall it's a really great AC unit and I'm glad I bought it, just wish it was a quieter.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Holland",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Easy Setup, Cools as intended, Noisy",
      "text": "Used it about 5 times this summer during temperatures above 90 degrees and so far it kept my 250-300 Sq ft room cool at around 68-72 degrees. This was easy to setup, took less than 15 mins but I do need to cut the window exhaust panel by a few inches to fit my 30' inch window across. I would say the noise level is not that great, not quiet at all but I could sleep through it.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael C",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Noise level is low, but is annoying because it is not white. In general, good but not perfect",
      "text": "I bought this to replace the in-wall AC in my apartment because of the noise level. Just installed it, and the noise level is indeed low, but the noise is not a white noise, I can hear vibration caused by the compressor. Something inside the AC is clicking on something else and making a toned noise, which is annoying even if it is not that loud.",
      "rating": 4.0,
      "verified": true,
      "author": "wty1992",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great ac!",
      "text": "I hesitated buying this ac because of price but now I am glad I did. It takes the temperature of my room from 76 to 68 very fast and stays that way through the night. Had some issues adjusting the window opening but used tape around it and works perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "EPCab",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Great, Good Looking Portable A/C",
      "text": "Besides being the nicest looking one out there, the performance is great! It is quiet, cools the room quickly- and installing was so easy- even with an odd shaped window. The remote is great, but from what I can tell, the remote doesn’t talk back and forth with the unit- just to the unit. So what the remote says may not sync with what state the A/C is in if you didn’t point the remote at the unit when pushing the button.",
      "rating": 5.0,
      "verified": true,
      "author": "HBG",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Honeywell Contempt Series",
      "text": "Nice look and the unit is quieter than most I have used. One thing to note is that this unit, if used for dehumidifying, does not self evaporate like other models in the same price range. If you do want to use this model as a dehumidifier you will need to attach to drain. The tank does not hold much when it comes to New England humidity, however a pro is the unit will shut off when the holding tank is full. Seemed to be every hour or less this past summer in NH.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Too noisy. Returning it.",
      "text": "This is my 4th or 5th Honeywell. I’ve never used anyone else. It is so loud. The low buzz and hum hurts my years. Not going to keep this. I’m angry cause now I have to figure out how to get it back to them. I saw Black & Decker had similar unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190722
    },
    {
      "title": "Does Its Job So Far",
      "text": "I find the noise level to be more or less equivalent to your average window AC, even when the AC is dehumidifying; if you've had one before, you know what I'm talking about. Mine sits on carpet, which may muffle the noise other reviewers are complaining about. This guy is VERY big (about waist-level on me, a 5'8\" person) and heavy (though the wheels on the bottom are a big help for moving it), so be aware when clearing out space. The hose can only extend so far. But so far, it cools efficiently. I'm very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Whittaker",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Quiet and comfortable",
      "text": "I have 2 ACs (other is a different brand). This one is more quiet but is quite large (they all are). Because of where I have it placed, I'm unable to move it around to different parts of the house, but it's definitely possible. I just can't. It's pretty quiet. I keep it in my office and when I'm on calls people can't hear it.",
      "rating": 5.0,
      "verified": true,
      "author": "LFlo",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Doesn't cool very much",
      "text": "I got the 10,000 btu version. My room isn't too big maybe 250-300sqft. It cools the room some, but not that much. It brings it down several degrees only, never been able to get it below 76 degrees which is a bit disappointing. Machine is quite large for something that doesn't cool the room much.",
      "rating": 2.0,
      "verified": true,
      "author": "Herman Liu",
      "helpful_votes": 0,
      "publication_date": 20200618
    }
  ],
  "product_meta": {
    "title": "Honeywell HL10CESWK, 10, 000 BTU, Black/White Portable Air Conditioner, 10,000",
    "description": "Color:Black/White| Size:10,000 BTU| Style:Air ConditionerThe Honeywell hl Series portable air conditioner combines 3-in-1 technology into one luscious and sleek body, cooling and dehumidifying areas 350-450 square feet. It features an auto-evaporation system, a reliable dehumidifying function as well as a traditional three speed fan only function delivering optimum cooling, dehumidification and fresh ventilation. The full-function remote control allows you to operate each feature from across the room. Unlike a fixed air conditioner unit, the Honeywell portable air conditioner requires no permanent installation and the smooth-gliding caster wheels provide easy mobility from room to room. A special sleep mode setting allows you to control the temperature for comfort during the night. This portable air conditioner comes with everything needed including a flexible exhaust hose and an easy-to-install window venting kit. The window vent can be removed when the unit is not in use.cfm241.",
    "rating": 4,
    "feature_bullets": [
      "Stylish, powerful & dependable - cools rooms 350- 450 sq. Ft. Thermal overload protection for added safety & peace of mind. Automatic vertical wind motion helps distribute powerful cool air evenly for fast & consistent cooling",
      "Dual filters designed to protect from dust & hair to extend product life & performance. Filters clean easily under a faucet for easy maintenance. Full set window kit included for quick & easy installation for vertical and horizontal windows (max. Hose length is 4 feet)",
      "Designed for comfort with 3 fan speeds, sleep mode, digital controls, 24 hour energy saving timer & remote control with digital display included",
      "Stress-free auto evaporation – no bucket to empty (except in areas with high humidity). built-in dehumidifier removes up to 80 pints/24 hours with continuous drain option for long unattended operation",
      "10000 BTU (ASHRAE-128 Standard) / 5500 BTU (DOE+ 2017 Standard)"
    ],
    "specifications": {
      "Product Dimensions": "18.9 x 15.7 x 31.3 inches",
      "Item Weight": "64 pounds",
      "Manufacturer": "Honeywell",
      "ASIN": "B01CS3J570",
      "Item model number": "HL10CESWK",
      "Batteries": "2 AAA batteries required.",
      "Customer Reviews": "4.0 out of 5 stars1,519 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#19,453 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Warranty Description": "5-year limited.",
      "Batteries Required": "Yes",
      "Included Components": "Air conditioner, remote control, flexible exhaust hose, window venting kit, manual, warranty"
    },
    "categories": [
      "Home & Kitchen",
      "Portable",
      "Heating, Cooling & Air Quality",
      "Air Conditioners"
    ],
    "price": ""
  }
}