{
  "website_summaries": [
    {
      "verdict": "This care package box gives you a good chance to sample a lot of gluten-free snacks.",
      "pros": [
        "28 single-serving bags offer variety, but ship together in the same box",
        "Also milk and casein free",
        "Vegan-friendly package",
        "Contains both salty and sweet snack options"
      ],
      "cons": [
        "Several items in the pack are spicy – could be a pro or con"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not As Fresh",
      "text": "I was trying to compare this box with atleast 15 more snacks. So I ordered this box which came on time, Ofcourse. I generally like most of the items. The first item though wasn’t as fresh as I thought it should be. The corn chips seemed not as crisp as they should be. So I’m wondering if anything else is not as fresh? I’ll update this if I find something else not fresh.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Straw",
      "helpful_votes": 12,
      "publication_date": 20180826
    },
    {
      "title": "Great gift for vegans",
      "text": "I got these for my neice's birthday. She's 16... says she's vegan, and it's hard to find pure vegan things for her, or anything for a 16 year old. So I figured a box f vegan snacks would be perfect since the rest ofher family isn't vegan. She loved it. Not sure if she ate everything in the box... I'd hope so since her birthday was like 6 months ago. But anyway, this makes a great gift for a vegan who is surrounded by non-vegans",
      "rating": 5.0,
      "verified": true,
      "author": "N & J",
      "helpful_votes": 9,
      "publication_date": 20180308
    },
    {
      "title": "i absolutely loved it! so did everyone in my family",
      "text": "This box was so much more that i had expected. i absolutely loved it! so did everyone in my family. Some of the snacks we had not seen or tasted before and It was all so very good! I am very pleased and plan to order a box and send to my son in Anchorage, Alaska. I know he and his family will love it too. It was so much fun going through the box to see what was in it. Thanks much for a great snack box!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Ewers",
      "helpful_votes": 10,
      "publication_date": 20170503
    },
    {
      "title": "but I came across The Good Grocer and all my frustration was gone",
      "text": "I just recently found out that I have a gluten sensitivity and I was so upset because most of what I diet included had gluten so I had to make a lifestyle change. I would go to the grocery store and they had a very limited selection for gluten free snacks and I was extremely frustrated, but I came across The Good Grocer and all my frustration was gone! I love all the options that come in the box, you have your salty snacks and sweet snacks too! This is a great options for anyone who has a gluten sensitivity or just likes snacks in general, the snacks taste great and I don't even worry about it having any gluten!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Herbst",
      "helpful_votes": 7,
      "publication_date": 20180314
    },
    {
      "title": "Perfect munchie box for a healthy person!",
      "text": "There are so many tasty items in this box. The box is full of things that I have wanted to try before but did not want to buy full-size. When it comes to healthy snacks, so many of them taste like cardboard. We have found a lot of new items in here that we will definitely buy again. Perfect munchie box for a healthy person!",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 3,
      "publication_date": 20180816
    },
    {
      "title": "Delicious healthy and convenient snacking!",
      "text": "Such a treat for my vegan (teenagers) granddaughters ! And I gift myself with a box. Value for money is only a 4 because it frustrates me that healthier foods cost more than their unhealthy counterparts. That is not this small business’ fault. Great variety! Always have been fresh and dated for reasonable shelf life. I’m not into the spicier items but the majority suit me just great! Great for lunchboxes and grab and go snacks without the guilty conscience, which is nice unless I can’t stop with just one or two....",
      "rating": 5.0,
      "verified": true,
      "author": "Maga loves her grand kids !",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Most of it was good. Could have done without the \"basic\" stuff and ...",
      "text": "Most of it was good. Could have done without the \"basic\" stuff and introduce more \"unknown\" brands/variety. Otherwise it is a good purchase to sample vegan snack foods i didn't care for the go light popped chips and the fruit strips same for the peanuts/almonds and pistachios. Would have preferred even a 1 off bag of something different maybe a kale type of chip or different flavor of something already in the box.",
      "rating": 4.0,
      "verified": true,
      "author": "IamME",
      "helpful_votes": 3,
      "publication_date": 20180421
    },
    {
      "title": "healthy????",
      "text": "IT WAS VERY DISAPPOINTING TO FIND SO MUCH SALT IN MOST OF THE ITEMS. UP TO 220 MG OF SALT!!!! I HAD TO RINSE MOST OF IT OUT IN WATER. THESE ARE VERY TASTY AND HIGH IN PROTEIN, BUT IT'S UNHEALTHY TO EAT THAT MUCH SAL.",
      "rating": 2.0,
      "verified": true,
      "author": "Norma P.",
      "helpful_votes": 4,
      "publication_date": 20190828
    },
    {
      "title": "Awesome variety!",
      "text": "I was hosting a few of my siblings for the weekend and wanted to make sure I had plenty of snacks! One of my sisters is vegan and I wanted to make sure I had vegan options for her but I honestly didn't know where to start. I found this care package on Amazon and it was the perfect combination! Everyone (vegan or not) loved all the snacks!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 3,
      "publication_date": 20190228
    },
    {
      "title": "Finally!!!  A healthy box of snacks bound for college :-)",
      "text": "This is the 2nd Good Grocer Vegan snack box I sent to my daughter in college!! She LOVES it, and I'm happy it's full of healthy snacks!! As a mother of a college student, you know that your son/daughter has 24/7 access to junk foods, it's nice to know she has some healthy snacks thrown in the mix!! Thank you for offering these healthy food items!! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Truly Disappointing",
      "text": "New to vegan ( due to allergies) and was hoping to find new products to continue to purchase after this variety box. None of these are new to me. Planters peanuts!!!! Really? 4 of them. Can’t return it. Won’t buy again. I got more info from the grocery store clerk.",
      "rating": 2.0,
      "verified": true,
      "author": "C77",
      "helpful_votes": 2,
      "publication_date": 20190916
    },
    {
      "title": "Simple. Great Price. Nice experience",
      "text": "I enjoyed this box of goodies very much. I live in a rural area and finding food that is gluten free AND dairy free is so hard to do, and if I do find something, it is REALLY expensive. The only reason I gave it a 4 star is because there was a lot of salty and savory items in the box, which all were good, but some more sweets or indulgences would have made the box an easy 5 star! I recommend this box to anyone with food allergies, or anyone in general really.",
      "rating": 4.0,
      "verified": true,
      "author": "Valerie H",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Disappointed, not everything was vegan. Misleading title.",
      "text": "I thought your products were going to be all vegan. I guess I read your title wrong. Some were just gluten free but not vegan. Very disappointed with that. Especially for the price I paid. I would suggest to whoever puts the packages together to not confuse gluten free with vegan.",
      "rating": 2.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 3,
      "publication_date": 20190216
    },
    {
      "title": "Didn't really seem worth $42",
      "text": "It was a lot of different types of chips mainly and peanuts a few interesting larabars but not as good as I'd hoped it would be",
      "rating": 3.0,
      "verified": true,
      "author": "Marianne Wood",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "fun trial size",
      "text": "I have a 5 year old grandson who has Celiacs disease so I thought this would be a fun thing for him to discover some new treats instead of hearing all the time \"you can't have that because it has gluten\", it is a little costly but fortunately I can afford spoiling him a little",
      "rating": 5.0,
      "verified": true,
      "author": "Christina L. Rasonsky",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Kid tested and approved",
      "text": "My kids love the snacks. They are insisting I but more. Such a relief to find healthy snacks my kids enjoy that are both gluten and dairy free. And as an added bonus, most are tree but free as well. It has been difficult finding snacks that are safe for my kids, that they enjoy, and are quick and easy to grab and go.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20160815
    },
    {
      "title": "Great variety and delicious options",
      "text": "I bought these are a gift for my boyfriend and to share together. He loved the variety and affordability. With his limited diet, it is harf to find both gluten frwe and vegan options. He couldn't have the almonds and didn't want the pinapple but hey, mpre for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Pleasantly surprised",
      "text": "For fun, I picked this up to try some new gluten-free treats. I was happy to see that everything in here was safe for me to eat, and there was a good variety of snack options. Haven't finished it all, but it came with some of my favorite snacks, and the food items I've tried that are new to me are very tasty. The expiration date on almost everything was about six months out from when it was delivered, which is plenty of time. I will probably buy this again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg H.",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Perfect Gift for Vegan Granddaughter in College!",
      "text": "Well, I peeked inside the box (it is a Christmas gift not yet given) and I saw layers and layers of healthy and fun snacks my granddaughter will love! I was tempted to pull a few goodies! I am so impressed with the quality of the food and decided I will keep her well stocked with Vegan Snacks Care Packages!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Ann",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "The Package is filled with products worth the money!",
      "text": "They are either completely vegan, organic and low calorie \"mom approved\" goodies or reliable non-organic snack. Organic dried mango was 100% organic air- dried mango, for example. Some goodies were packed twice, so my kid was able to keep one for others in their mind to share. It was quite a pleasant surprise after a long away camp. Quality of the box was also good to keep the products without damage during transitions. we will buy it again, hoping there would be a different variety package as well.",
      "rating": 5.0,
      "verified": true,
      "author": "eldosian",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Good vegan sampler",
      "text": "Second time ordering a vegan snack box (this one is larger). Arrived on time and well packed. It looked like everything was smooshed in the box, but nothing was crushed. Great way to try new products, and also have portion control!",
      "rating": 5.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Awesome box of goodies",
      "text": "I was very happy with this assortment of snacks. I used these treats to fill my older children's Easter basket. I was worried they would be disappointed that is was not a bunch of toxic candy this year, but luckily they were very happy. They want to make healthy food choices and this made it easier. I plan to order another one for my daughter for final exam week. My only suggestion would be to put some non-GMO peanuts.",
      "rating": 5.0,
      "verified": true,
      "author": "Smart shopper 444",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "Loved it!!!!",
      "text": "Was a gift for daughter who has severe food allergies. She is amazed there were so many of the treats she could eat! Fun gift for any person with sensitivities. Will buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Darla Robson",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "ANNIVERSARY GIFT FOR A GLUTEN FREE/VEGAN COUPLE",
      "text": "They were so happy to receive this, especially during the virus lockdown. Felt really good to add to their stay home time with healthy, appropriate snacks for their dietary requirements.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Michele",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Great Care Package Idea!!!!!!!!",
      "text": "These snacks were for my vegan son & his boyfriend. I got this for them to pack when going on a road trip. It was a huge hit! They loved the snacks and I love the beautiful presentation! Great idea! This will be something we get again!",
      "rating": 5.0,
      "verified": true,
      "author": "Mari E. Anthony",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Great alternative And healthier too!",
      "text": "We just found out my daughter is allergic to dairy, wheat and gluten. Your box was a great reminder for her that life isn’t over just because she has some allergens. There are stil snacks and treats she can have! So glad to have found this company!",
      "rating": 5.0,
      "verified": true,
      "author": "Desert Rat",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Family gift, lots of varitety",
      "text": "Gave this to mother for Christmas as she has all sorts of allergies. She said that she can pretty much eat everything and what she can't eat, dad will eat! Nice gift for any occasion.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great gift idea",
      "text": "I bought this for my mother in law and she loved it! She mentioned it is hard to get gluten free snacks and is bringing them on her trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa M. Hunger",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great Care Package!",
      "text": "Sent this as a gift to my best friend who has celiacs and is also expecting. She was so excited about all the options to satisfy all cravings and that they were okay for her to eat. She was also so amazed at how much came in the box. This was a great gift to cheer a friend up. I will definitely purchase these boxes again!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Slavens",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Highly recommend",
      "text": "So, I was amazon searching for vegan meals and or snacks to send to my daughter in college. I found this box and thought the price and snacks looked good. She received her box yesterday. She called me this morning super excited and loving her snack box. So far she said the cheese puffs are gross but everything else seems to be yummy. I will definitely recommend and reorder once she is almost out.",
      "rating": 5.0,
      "verified": true,
      "author": "Jelica Ginelle",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Yummy Yummy in Your Tummy",
      "text": "This is a box of deliciousness. I especially like the Sweet Maui Onion chips, which are weirdly awesome. I wanted somewhat healthy snacks in the house and this was the right call. There's nothing better than opening the box and picking out a yummy treat. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Bardsley",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Delicious and Nutritious!",
      "text": "I've sent this care package more than once to several recipients and their responses were all the same, \"FANTASTIC!\" There is something for everyone in this wonderful assortment. If I could add several more stars, I would.",
      "rating": 5.0,
      "verified": true,
      "author": "mae29",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Nice sampler",
      "text": "Nice variety. I wanted to try this to sample the difference brands and varieties. I like the variety and now know what I like and don’t like. I would try other items from the Good Grocer.",
      "rating": 4.0,
      "verified": true,
      "author": "Oceandiva",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Will buy again",
      "text": "I received this box for mothers day from my son. This box has tons of different Vegan snacks that are so good. Great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Will buy again!",
      "text": "I LOOOOOVED these snacks. I really enjoyed all of them. The fruity ones taste like REAL fruits. My 9yr old didn't like all of them, she's used to eating the bad snack, but the little one does eat whatever I give her :-D",
      "rating": 5.0,
      "verified": true,
      "author": "Alexadealvaz",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Healthy Quarantine Snack",
      "text": "I sent two packs, one to my grandsons & one to my granddaughter. They loved them. Both Mom's liked that they were healthy smacks. A great gift from Gramma.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorna Straka",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "I did not like most of the items",
      "text": "I did not like most of the items. The flavor was off on a lot of the bags. The seller did reach out to me and said they would send me new options but my review stands as of now. I was disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal C.",
      "helpful_votes": 2,
      "publication_date": 20180621
    },
    {
      "title": "Great snacks",
      "text": "Bought this for a friend for her birthday. She has given me great feedback on how much she likes this healthy snack package. Her teenage daughter doesn't have the health concerns about gluten that my friend does, and the daughter loves the snacks, too.",
      "rating": 5.0,
      "verified": true,
      "author": "C. M. Hoehn",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Needs more variety but very tasty",
      "text": "WAY too many sea salt chips, many brands.. Everything tasted great. I was disappointed in the variety of actual food to try. But it did save me from cooking during a snowstorm with crutches, so thank you. Also appreciate that you selected Live Love POP, they are charitable and tasty.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Client preferences",
      "text": "I was happy there were Gf included. Didn’t see Vegan as I am. Didn’t know it would be all chips!! I am just not a chip-a-holic. And alot of jalapeño ones too! 😟. But difficult to know when there was No opportunity for client specs. Would I order again?? Prob not unless vast improvements. Fruit snacks, crackers, cookies..variety!!! Gave over 3/4 of box away...costly! Extremely disappointed, but like I said no where for client preferences.",
      "rating": 3.0,
      "verified": true,
      "author": "deborah kent",
      "helpful_votes": 2,
      "publication_date": 20180423
    },
    {
      "title": "I ♥ Vegan Snacks!",
      "text": "These are great! They make a great gift, and they are much healthier options than most other \"care packages\" out there. The size of each snack is very generous as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh B.",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "GF is here!",
      "text": "Really yummy and gluten free! Some of the best gf cookies I’ve ever had, and I’ve tried a lot!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Y2jimmyk",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Loved by recipient",
      "text": "This was a gift for a coworker. His family loved it and ate the whole package in one day! He tells me everything was good but their favorite was the gummy bears.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda P.",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Great gift for Students in middle of exams",
      "text": "Sent this to my Vegan niece for snacks during week of finals. She loved it! Shared it with her study group.",
      "rating": 5.0,
      "verified": true,
      "author": "DLR",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Kids love it",
      "text": "I don’t know how healthy processed food can really be. But my kids love this care package when I send it to school.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "I absolutely loved this box",
      "text": "I absolutely loved this box. There was so many variaties of things to choose from. Most I never knew existed. The salt and vinegar popcorn was my absolute favorite. I'm a popcornaholic so that made my day. I will definitely be looking forward to my next box.",
      "rating": 5.0,
      "verified": true,
      "author": "nillared82",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Nice variety of healthy snacks",
      "text": "Nice variety.Great healthy snacks for my desk at work when I can't break for lunch. Already found some new favorites!",
      "rating": 5.0,
      "verified": true,
      "author": "Georgemom",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "\"The best yet!\"",
      "text": "I order the GLUTEN FREE and VEGAN Healthy Snacks Care Package (28 Ct) for my daughter to see her through the final few weeks of college each semester. This was the 4th time I have ordered. Her thank you response this time included \"It was the best yet\"! That makes me happy and for less than $1.50/item!",
      "rating": 5.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Great selection!",
      "text": "There was a fantastic array of different snacks in this bundle! I got these to put in my fiancé’s lunch. I highly recommend for any vegan looking for snacks to try.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan & Meredith",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Great Variety",
      "text": "My daughter was delighted with the assortment - too early to know about the taste!",
      "rating": 5.0,
      "verified": true,
      "author": "Cazimira",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Great variety",
      "text": "Sooo many goodies to choose from, n u can't beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "cmagic722",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great selection!",
      "text": "Great selection! All kinds of awesome, healthy snacks that I can give my vegan kids without having to worry about the ingredients. They loved the large assortment!! Big hit! Bought a 2nd one for the office also!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Huff",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Wonderful snack box",
      "text": "Yes it is great. I love all of the choices. Would be great to leave this box at work for a quick healthy snack.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbie41855",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "I really love box and she loves the variety",
      "text": "My daughter is in the Navy and this was my treat for her. She loves having healthier snacks in her room. With no refrigerator to keep actual food this helps her not skip breakfast or when lunch was too far away she has a few items in her backpack. I really love box and she loves the variety",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Ambrosio",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Package contents were quality and delivery happened as scheduled to my granddaughters college dorm.",
      "text": "My granddaughter who is in her first semester at college said the gluten free package was a hit. She loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet K. Henderson",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Good",
      "text": "Send these to my deployed, vegan husband. He loves getting them. Says there’s lot of random little snacks in them.",
      "rating": 5.0,
      "verified": true,
      "author": "Felicity Duran",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Good Variety",
      "text": "Great variety and delicious snacks. The only downside was that I felt some of the more chips were a bit bland, but I would just pair them off with some home-made guacamole, and I was set. I will most likely buy this again :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Perfect Vegan Starter Pack",
      "text": "If you or someone you know is new to the vegan lifestyle, this is an excellent way to sample lots of yummy vegan treats!",
      "rating": 5.0,
      "verified": true,
      "author": "Lesley Sullivan",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Not disappointed",
      "text": "It’s perfect as a gift for a vegan....I wouldn’t buy it for any other reason as it’s pricy.",
      "rating": 4.0,
      "verified": true,
      "author": "carole m",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Great to send to your GF College Student",
      "text": "This is a great selection of Gluten Free snacks that I send to my college student several times a year. The variety is great and all very tasty.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan E. Schaefer",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Every single snack is tasty!",
      "text": "My gluten-intolerant family gives rave reviews on this assortment. I had this shipped to them and will definitely do so again, based on their enthusiasm. Some gluten free foods taste like cardboard, but every single one of the snacks in this assortment is a winner. Very much worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "She's vegan/dairy/gluten free and it's always special to get a care package with special snacks -- great variety for quick",
      "text": "bought this for our babysitter who is going off to college. She's vegan/dairy/gluten free and it's always special to get a care package with special snacks -- great variety for quick, healthy snacks on the go!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Reilly",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "and ruled them excellent, with one exception",
      "text": "My daughter has to eat gluten free and has a hard time finding variety to take to work for lunch in our little mountain town. She was absolutely ga-ga over this selection and so, I have ordered more. My son, not to be left out, also \"sampled\" an entire box.and ruled them excellent, with one exception, he did not care for the kale chips. ... and he wants another box, as well. He especially loved the maui onion chips.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Ann Collier",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Amazing",
      "text": "This so awesome!!. There are so many different types of gluten free snacks, I never knew there were so many. A person that is gluten free this is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "VERY DISGUSTING",
      "text": "This is ridiculous. One hundred dollars for this small and embarrassing box. REALLY AND I CANT EVEN SEND It BACK. THIS WILL EMBARRASS ME TO GOVE THIS TO MY FRIEND. HORRIBLE. how can you possibly charge one hundred dollars for this and then have the nerve to not back it with hey satisfaction guarantee. It is obviously an opened and sealed. Shame on you.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "A nice gift...",
      "text": "I ordered this package for my son who is a vegan. I would like to see more vegan options like vegan jerky and other such products included in this package.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Cohen",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "It's nice to have grab-and-go vegan snacks (also GF) that are ...",
      "text": "I am impressed! This care package contained only quality items, no off-brand 'fillers'. It's nice to have grab-and-go vegan snacks (also GF) that are pre-packaged and portion controlled when you're running short on time. The snacks arrived exactly as pictured and listed. I will order again as a gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Fast shipping great products!",
      "text": "Gift for my daughter and son-in-law and kids. They loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Greenwood",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Ridiculously small offering and way overpriced.",
      "text": "This was one of the worst things I have ever seen. It’s extremely overpriced for the very few items included. I’m embarrassed to give this as a gift. And best of all, this box of cheap crap cannot be returned!",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Five Stars",
      "text": "What a great way to get misc snacks for the road or lunch on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony T",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Too many spicy snacks!",
      "text": "A few of the snacks were very good, but most were spicy. I liked the veggie straws.",
      "rating": 3.0,
      "verified": true,
      "author": "DHSK",
      "helpful_votes": 2,
      "publication_date": 20180909
    },
    {
      "title": "He loved all of them and said what a great variety",
      "text": "Son came in from out of town, very excited about these snacks, now says he will have something to eat on the plane going home. He loved all of them and said what a great variety!!.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "She loved them",
      "text": "Ordered for my 22 year old daughter and she gave it a 5 star",
      "rating": 5.0,
      "verified": true,
      "author": "Happy guy",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Nice snacks",
      "text": "I liked this product, my only complaint is the little packets of peanuts and a few other things you can get at any gas station. I like to try different things that I might not otherwise buy/ see in a store.",
      "rating": 4.0,
      "verified": true,
      "author": "Hannah J Mersinger",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Overpriced gluten-free snacks",
      "text": "It was overpriced and low-quality some of the food tasted bad. I really would like a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "PLES ETTA SCHNITZERp",
      "helpful_votes": 2,
      "publication_date": 20180621
    },
    {
      "title": "It’s not bad",
      "text": "It’s not bad. Some items were ok. I’m hoping they will vary the items inside. They’re pretty much the same snacks.",
      "rating": 4.0,
      "verified": true,
      "author": "Golden Phnx",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Godd for snacks",
      "text": "I purchased these products as gifts for people that travel a lot for their jobs and not much time to stop for food. They both liked to hold over snacks .",
      "rating": 5.0,
      "verified": true,
      "author": "Pearl W.",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "DON’T WASTE YOUR MONEY!",
      "text": "So glad I opened this beforehand. Will be giving this as a gag gift, a very very expensive gag gift at that! Small and crushed items that are readily available in larger portions at the local grocery store. Shame on me for not reading the recent reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Predko",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Vegan Snacks",
      "text": "This vegan snack pack was very good! It was so nice to try all the different items. There really was not anything in the pack that we did not like. I look forward to receiving these each month. Our family is always looking for healthy vegan snacks and where we are located we do not get much of an opportunity to try new things.",
      "rating": 5.0,
      "verified": true,
      "author": "Rainhadar",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Varied Snack Goodness 👍🏼👍🏼",
      "text": "My son loves everything about this snack box! His face lit up when I told him that I had ordered another box. So worth it to satisfy anyone with food restrictions!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Shapiro",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great buy!",
      "text": "So far we have tried five items and love them. Looking forward to trying out the rest. We think we may just buy these again to have variety.",
      "rating": 5.0,
      "verified": true,
      "author": "yicquick",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Great vegan gift",
      "text": "Huge assortment of snacks for a Christmas present. I’m positive my friend will love it and I’ll let her know where I got it for the future",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua A. Cavileer",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Love the variety of snacks",
      "text": "There are more than enough to try and enjoy! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Expensive snacks with lack of variety.",
      "text": "Lacked in variety and def didn’t pass the kid pantry test.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 2,
      "publication_date": 20180802
    },
    {
      "title": "Love the snack box a nice variety of gluten free ...",
      "text": "Love the snack box a nice variety of gluten free snacks. I haven't eaten all of them but what I have eaten I have enjoyed. Will by again",
      "rating": 5.0,
      "verified": true,
      "author": "Karen  Campos",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Great Variety",
      "text": "I have bought this package six times and enjoy the variety of offerings. There are about 15 different products in there, so you won't get bored, and I feel like it is much healthier than eating from a vending machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack McC",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Fun mix",
      "text": "Took these on a family vacation, nice to have snacks at the ready at all times",
      "rating": 5.0,
      "verified": true,
      "author": "Dare 22",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Great snacks",
      "text": "Used this for a gift basket, I loved the variety of products included",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Love this!",
      "text": "Excellent variety pack of gluten free products! Perfect care package for college kid with diet restrictions. Have ordered this twice! Very fast shipping!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Bradley",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Vegan daughter in college very happy",
      "text": "Sent it to my vegan daughter in college everything she's tried she loved especially the chickpea puffs sent me a Snapchat saying quote \"these are the bomb\"",
      "rating": 5.0,
      "verified": true,
      "author": "maria snider",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Great taste",
      "text": "It was a gift for my daughter- she absolutely loved all of it! You may not always think great taste and vegan but this hits both marks!",
      "rating": 5.0,
      "verified": true,
      "author": "dmck4",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Better than a birthday cake",
      "text": "I send this to my step daughter when there is a birthday to be celebrated. I think it is healthier than a cake. they like it.",
      "rating": 5.0,
      "verified": true,
      "author": "POKIE",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "NomNomNom",
      "text": "Second time ordering, pretty good variety. Our house has very opposite tastes in snacks and so far so good, everyone just picks what they want :)",
      "rating": 5.0,
      "verified": true,
      "author": "J-Bear",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Healthy and Flavorful",
      "text": "I bought these snacks for my daughter who is a Vegetarian and she absolutely loved them. She was excited about the variety of snacks and commented on how flavorful they were. We will definitely purchase more in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Adams",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "All for me",
      "text": "Yummy selection of goodies I can enjoy without having to worry about my food allergy; I am hiding them from my son because he'd eat them all otherwise 😎",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanne",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Great buy!!",
      "text": "These are VERY tasty and the added bonus of being gluten free!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary T Coccellato",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Five Stars",
      "text": "Great variety for those wanting to try GF products to see what they will like before buying in bulk.",
      "rating": 5.0,
      "verified": true,
      "author": "Chicka ",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "This Box is poor quality and a total ripoff",
      "text": "There was nothing specially packaged or thoughtful about this. I'm relieved I sent it to myself first before I sent it as a gift because it would have been completely embarrassing, that's how disappointing it was. I have ordered other gift box of food from Amazon like the Nom Nom brand and they were fantastic. I would NOT recommend this, buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "S. Kang",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Excellent options! Quality and fresheness were top notch",
      "text": "Excellent options! Quality and fresheness were top notch. We bought this to take for snacks while traveling and it worked perfect! Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Finally, some options for the dairy-free crowd!",
      "text": "Great mix of healthy and dairy-free (vegan, actually) snacks to throw in the lunch bag! They're all different - the ones my 13y.o. son has tried so far have been big hits.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Denny",
      "helpful_votes": 0,
      "publication_date": 20180918
    }
  ],
  "product_meta": {
    "title": "GLUTEN FREE and VEGAN Healthy Snacks Care Package (28 Ct): Plant-Based Snacks, Bars, Chips, Crispy Fruit, Nuts Trail Mix, Gift Box Sampler, Office Variety, College Student Care Package, Gift Basket",
    "rating": 4.6,
    "feature_bullets": [
      "NO ARTIFICIAL COLORS, FLAVORS OR PRESERVATIVES IN THESE GLUTEN FREE AND VEGAN SNACKS: The Gluten Free and Vegan Healthy Snacks Care Package by The Good Grocer is an assortment of 28 individually wrapped, grab-n-go snacks. Every snack in this healthy snack variety box is both Gluten Free and Vegan.",
      "PERFECT GIFT FOR VEGANS: Vegan and Gluten Free snacks that you can trust. Perfect for students, military, college care packages, get well soon care packages, office break rooms, kids lunches, road trips, college dorms, colleague and client appreciation gifts and more! Great for holidays, birthdays or housewarming gifts too! This Gluten Free and Vegan Care Package is a fun and hip alternative to gift baskets.",
      "BEAUTIFULLY PACKAGED: Snacks come packaged in our awesome gift box. It’s really cute and earth-friendly too! All of our boxes are made from 100% recycled materials. Expertly packed with care in The Good Grocer gift box, this assortment of premium Plant-based, Gluten Free snacks is sure to impress anyone.",
      "GUARANTEED FRESH: Each box is clearly marked with the earliest expiration date. We guarantee our snacks are fresh when you purchase them.",
      "SHIPS FAST! Send directly using Amazon Prime with no need for additional gift wrapping or packaging! ... Click 'Add to Cart' to treat yourself or someone special to this memorable gift! To include gift message select \"gift\" at checkout."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "14.1 x 10.3 x 5.3 inches; 2.65 Pounds",
      "UPC": "711730792645",
      "Manufacturer": "The Good Grocer",
      "ASIN": "B01CF4EAEA",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Food & Beverage Gifts",
      "Snack Gifts",
      "Grocery & Gourmet Food"
    ],
    "price": 43.95
  }
}