{
  "website_summaries": [
    {
      "verdict": "A well-designed tool that is lauded for its accuracy.",
      "pros": [
        "Comes with a protective case and cloth for cleaning",
        "The tool is easy to read and use with metered bands of color to help you determine ABV"
      ],
      "cons": [
        "Like some other products, a fairly large amount of test liquid is needed for results"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Math is done for you!",
      "text": "We watched all kinds of videos from the YouTube channel CitySteading and decided we were ready to make our first mead. We used their recommendation link to this hydrometer. We have used it a handfull of times already and appreciate that the numbers are separated by what type of wine you might get based on the sugar content (I.e a moscato, sweet wine etc) it's like the math is done for you! The case is solid plastic and closes well and keeps the hydrometer nice and safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda D. Wakefield",
      "helpful_votes": 49,
      "publication_date": 20190614
    },
    {
      "title": "easy for a first timer",
      "text": "This is the first time I have used one of these and it was super simple to use. I wish I would have looked and seen it DOES NOT come with the tube. The ones that do come with the whole set up are a couple dollars more. now I have to spend more money to get the complete set. Otherwise it was a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris R.",
      "helpful_votes": 41,
      "publication_date": 20190521
    },
    {
      "title": "Misleading ad",
      "text": "The picture makes it look as though the test graduated cylinder is included and it is not.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 56,
      "publication_date": 20180314
    },
    {
      "title": "Just pay an extra buck for a kit with a graduated cylinder.",
      "text": "Dude. Photo four says '...& test jar combo' then photo six states that it doesn't come with a test jar. I didn't get to photo six before I ordered and I'm pretty irritated that there is not one included.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 44,
      "publication_date": 20180811
    },
    {
      "title": "QC'd out at Zero!",
      "text": "I bought 2 of these hydrometers in the hopes that one would QC out at zero. I hate having to remember to do a correction when using them. Both of these QC'd as accurate! I QC'd 2 other brands and they did not. Brewer's Elite will be my go to brand when I drop another carboy on one! The numbers are easy to read and I like the color coding. The case is also a bonus. Great protection and it is easy to get the hydrometer out of the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Divnbrian",
      "helpful_votes": 35,
      "publication_date": 20190128
    },
    {
      "title": "Very nice device for brewing your own prison hooch at home!",
      "text": "It's a great product! It really deserves 4.5 stars. I brew home wines in store-bought jugs of juice with this and a cheap carbouy vent. This product is a quality measuring tool. I just wish it was a little shorter, for use in my juice jugs. Maybe they could develop one, with simpler markings for survivors gravity. I think the intent is for use with large batches, and measuring your samples in a graduated cylinder. I just want to be able to tell how much sugar to add, and when it's ready! PS - try keeping a sourdough starter for your home brews! Yummy and renewable!",
      "rating": 4.0,
      "verified": true,
      "author": "ScubaSteve",
      "helpful_votes": 42,
      "publication_date": 20170708
    },
    {
      "title": "Quality unit packaged well",
      "text": "This is a precision tool that does its job well. It comes packaged in a sturdy plastic case with foam pads at both ends and in the middle. There is a set of indentations that helps the top of the case \"click\" into place, so it stays on. Combine this with a quality test jar and you have a great setup for your home brewing, winemaking, or distilling.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy Kay",
      "helpful_votes": 45,
      "publication_date": 20160517
    },
    {
      "title": "NOT complete kit!",
      "text": "Like many other reviews, ad makes it appear it has all you need to test. NOPE, after I received it and realized there is NO graduated cylinder I saw buried way down in the description it says you will need to but separate. So basically it’s useless on its own. Don’t waste you money, just buy a complete kit. There are some cheaper that actually include everything you need. Yep- they got me. Guess I shoulda read reviews first!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 4,
      "publication_date": 20191127
    },
    {
      "title": "Great Hydrometers, Equally Great Seller",
      "text": "We ordered two of these for measuring the initial specific gravity of apple juice to be made into hard cider. They arrived quickly and work great! This would work equally well for beer, wine, mead, etc. Unicorp Ltd., was awesome! The package arrived earlier than promised, both hydrometers were packed well and arrived intact, they wrote to make sure everything was OK and provided contact info, very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Hydrometer review",
      "text": "The hydrometer is useful for metering hydros. It works swell. But I'm getting tired of breaking them. I can tell you. This time I'm putting a tight-fitting disk of foam silicone gasket material in the bottom of the test cylinder, and I'll deal with cleaning it. Unfortunately that's not the only way I break the hydrometers, but it should get me a couple weeks of use instead of only days. Sigh. If there was only some use for those little black beads.",
      "rating": 5.0,
      "verified": true,
      "author": "Roaster",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Made in China and small print",
      "text": "The picture gave the idea that it comes with a test tube, nope, false advertising, and the small piece of paper (instructual manual) is difficult to read, the print could be a bit bigger for fo,ks like myself. Further more it's made in China, not cool at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Cherry A. London",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Not hardy. Will break",
      "text": "It wasn't easy to use, because it has to float in the mead, beer, or wine, so you need enough liquid in order to make that happen or extra equipment. It ended up breaking, so we never got a reading and ordered a refractometer instead. Found out they are easier to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristina Smith",
      "helpful_votes": 2,
      "publication_date": 20181204
    },
    {
      "title": "Well made with good instructions",
      "text": "This device seems to work as it should. The print is small yeah it provides plenty of information and it's well-made and well packaged. It comes with good information and instructions. It's worth mentioning that when I touch this glass it hurts my fingers; not sure why that is. I hold it with tissue paper and I don't leave it in the liquid any longer than necessary. It only takes a moment to get the reading.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "After racking the hydrometer won't float so my meade is ???",
      "text": "Came in great shape and packaged well. Going to make some great mead. Handled with kid gloves based on reviews. Worked great on first use. Cleaned and repackaged in original container. Racked my mead and when checking the hydrometer won't float. No visible cracks. It's past my return time now that the mead was distilling. Unless contacted by the manufacturer I will say this is junk and should be avoided.",
      "rating": 5.0,
      "verified": true,
      "author": "ralph",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Works well, but it's larger than I thought",
      "text": "It works good, altough I'm still learning to use it. It's quite large though. I should have gone with the version that includes a measuring flask, as it is hard to find a large bottle where it can float. I ended up using a whine bottle, but it takes almost a litter of my drink just to check the density. Of course I still use it, but it looses carbonation in the process (Im doing naturally carbonated Kombucha)",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Pena",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Simple to Use - Making Rhubarb Wine",
      "text": "I wasn't sure I needed a hydrometer for making home brew Rhubarb wine for fun but a lot of the chat out on the internet recommended it. I have been guessing for the past three years - this year I will really get it right. Easy to read, easy to store. I am happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Diamond in the Rough",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Case does not double as cylinder",
      "text": "I bought this thinking that the protective case, which is nice, would double as the cylinder, as my old hydrometer did. This does not. It opens, weirdly enough, perfectly in the middle of its length. I had to go track down a graduated cylinder to actually take the measurements I needed. If I had known that, I would have considered other options. That said, it is of good quality and works once you get it going. Instructions are nice, too.",
      "rating": 3.0,
      "verified": true,
      "author": "Danny Batten",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Slightly less than 100% satisfied I bought the hydrometer to take a reading",
      "text": "Slightly less than 100% satisfied I bought the hydrometer to take a reading, not to turn around and buy an oversize tube or any tube for that matter. I carefully read and carefully looked to make sure that a tube came with the unit but surprise.",
      "rating": 2.0,
      "verified": true,
      "author": "Yvette atkins",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Good quality, quick delivery",
      "text": "I was prepping my brewery on a Friday night to be ready for a Saturday session and my hydrometer fell out of its cheap carrying case and shattered. Went to Amazon and had it the next day just in time for my OG reading. My favorite thing about this is that it comes with a sturdy carrying tube. Can't tell you how many hydrometers I have broken by falling out of their carriers.",
      "rating": 5.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "How do you use this thing??",
      "text": "Cannot, for the life of me, figure out how to use it. Directions says to measure your brew first before fermentation It goes straight to the bottom so there's nothing to measure. This probably is a user error, not the product, but I've searched YouTube forever and cannot figure out out so I can't actually use it.",
      "rating": 3.0,
      "verified": true,
      "author": "Nurse Heather",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "It doesn't seem to work.",
      "text": "I had bottles tall enough to use it in, but it's still mega long, and it didn't actually work. So put it in some alcohol that should've read at least 10%, and it drifted down to the bottom. I tried it in some of my vodka from a store, and it did the same thing. It doesn't seem to work.",
      "rating": 1.0,
      "verified": true,
      "author": "earshine",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Good Hydrometer",
      "text": "I like the square box it comes in to prevent rolling off the counter. It works and its a good value for the price. Easy enough to read and I believe it to be accurate based on the amount of sugar I added to my wine must.",
      "rating": 5.0,
      "verified": true,
      "author": "TP ",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Excellent",
      "text": "I lost one of these recently and bought two to replace it. These hydrometers work great and are easy to ready. Delivery ended up being a day earlier than expected and was able to address a brewing issue quicker than planned.",
      "rating": 5.0,
      "verified": true,
      "author": "JShep",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Another broken one",
      "text": "Arrived broken could hear it before I even opened package",
      "rating": 1.0,
      "verified": true,
      "author": "Chris I.",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Beer alcohol content",
      "text": "I'm older so I have to use a magnifying glass to read the numbers. Other than that it works great",
      "rating": 4.0,
      "verified": true,
      "author": "David Turnquist",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Recieved Broken! Replacement?",
      "text": "That it arrived broken. I was so excited to chk out a batch of sakè I made, which may sound silly, but we were truly looking forward to it. No word from ANYONE regarding a replacement! Why have Prime?",
      "rating": 1.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Works really well and easy to read",
      "text": "Really easy to use, clearly labeled hydrometer, it has estimates when first measuring for about how much alcohol to expect when the fermentation is finished. The color sections let you know what the finished product should be (wine/beer) which is a nice touch. Solid hard plastic case has enough give you could likely step on the box and not break the box though I wouldn't do that with the hydrometer inside.",
      "rating": 5.0,
      "verified": true,
      "author": "donald",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "No issues!",
      "text": "Had to replace my last hydrometer that I'd had for more than a decade when a kiddo broke it. This one came fast, and appears accurate. The case is also better than the last one I had. No complaints or issues!",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisB",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Hydrometers are fragile little things",
      "text": "I just replaced my old hydrometer with this one. But it looks like this one already has little micro cracks in it. It's like that with a lot of hydrometers. Everyone makes the walls of these things so thin!",
      "rating": 4.0,
      "verified": true,
      "author": "Ajay Ryerson",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "all about products use.",
      "text": "You did not tell me I had to have a very TALL container or tube to hold hydrometer and to be able to read for kombucha.",
      "rating": 1.0,
      "verified": true,
      "author": "Frances D. Galantine",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "No glass cylinder included!",
      "text": "I was excited to get this delivered until i found that the glass cylinder needed to measure is NOT included. C'mon guys it would only cost two cents tin include this item.",
      "rating": 2.0,
      "verified": true,
      "author": "ABC Williams",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Fantastic customer service",
      "text": "It arrived broken, seller was great with replacing it. Fantastic customer service. The hydrometer is excellent, but fragile. Keep away from children. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick D. Longe",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Does not come with graduated cylinder",
      "text": "This does not come with graduated cylinder. The tube shown in the picture is a plastic protector case, that is all. So to others who are inexperienced to the world of brewing, such as myself, you will also need to buy a test tube along with this product, unless you place the hydrometer directly inside your fermentation bucket. Hydrometer itself, works fine",
      "rating": 4.0,
      "verified": true,
      "author": "HVG",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Not As Pictured. Read Fine Print",
      "text": "Hydrometer is fine. The fact that the picture shows a graduated cylinder but the product does not come with one is false advertising. Amazon should require more from sellers and hold them accountable. I shouldn’t have to read through fine print and reviews to discover this.",
      "rating": 1.0,
      "verified": true,
      "author": "Darlene M Grucci",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Hydrometer - not what I expected",
      "text": "Was thinking this tool was going to give me an accurate reading of the abv without having to use a formula to figure out. Instead, it floated to nearly the bottom and it only appears to be giving me .99 for gravity. I know this has to be incorrect because I am one week into the clearing process and will soon be ready for bottling. IMO, it should have given me a reading of somewhere between 12-14% abv.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff Allen Stambaugh",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "The product is very good quality and the customer service is top notch",
      "text": "The product is very good quality and the customer service is top notch. I personally think the colors make it somewhat difficult to read and I prefer a clear glass to read from. Does not come with a test tube, as noted at the bottom of the description.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "A touch more durable",
      "text": "Doesn't seem to be quite as fragile as my previous hydrometer. The color coding helps with identifying ABV. I'm happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "lucas",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Accurate and easy to read",
      "text": "This seems like a really solid hydrometer. Very easy to read, comes in a nice container, and is accurate. What else could you ask for?",
      "rating": 5.0,
      "verified": true,
      "author": "mike pluff",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Dosen't last",
      "text": "Great at first, started giving inconsistent readings after a couple of months. Wax plug loose and weights shifting about. Non Rec",
      "rating": 2.0,
      "verified": true,
      "author": "J. Vosburg",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "bought to test some brews but..",
      "text": "i bought this to test some home brews but as soon as i opened the package the glass shattered inside.. just threw away i bet its a good hydrometer but i gave up on testing them brews maybe one day ill reorder when i decide to try again",
      "rating": 2.0,
      "verified": true,
      "author": "Miamimami",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Way too complicated",
      "text": "Way too complicated! Has to be put in wine as being made. Lots of complicated steps to follow. Decided to return",
      "rating": 1.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "well, I haven't used it yet, but my ...",
      "text": "well, I haven't used it yet, but my last batch of wine decorked because I corked too soon.. I hope this will help me know when fermentation is done!",
      "rating": 5.0,
      "verified": true,
      "author": "cinnamoncyn",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Nice item",
      "text": "I actually have not used it just yet, but the directions seem pretty clear and it looks good of quality",
      "rating": 5.0,
      "verified": true,
      "author": "Snaplily",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Exactly what I was looking for",
      "text": "if there are bubbles near the hydrometer, it can be difficult to get an accurate reading. maybe I'm just inexperienced...",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Looks good",
      "text": "In all fairness, I bought it and did not use it yet because I'm no brewing anything yet, but they asked for a review in email so at least I can say tht it looks promising, it has a nice scales",
      "rating": 5.0,
      "verified": true,
      "author": "JerzyR",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Great seller.",
      "text": "Seems to be of good quality but haven't had the chance to use it yet. Once i have had a chance to gauge its performance will update.",
      "rating": 5.0,
      "verified": true,
      "author": "Anibal Torres",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Very Misleading",
      "text": "Very misleading when you call this a set, pictures make it seam like you get everything you need but you do not, never realized it until it arrived, useless without the jar, will not buy again",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great service and came same day!",
      "text": "The product was exactly as described, and was received the same day, as promised! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Heidecker",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Hydrometer",
      "text": "I did not know the hydrometer required before and after fermentation measurements of wine sample in order to find the APV, otherwise I would not have purchased...at least when I did...most likely I will use my refractometer for my needs. It is a great looking device and shipping was fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "HYDROMETER BROKE INSIDE CASE",
      "text": "MY HUSBAND BOUGHT THIS AND USED IT ONCE AND THEN CLEANED AND PUT IT AWAY ONLY TO FIND OUT THE NEXT DAY HE TOOK IT OUT OF THE CASE THAT'S PROVIDED AND IT WAS BROKEN,(GLASS FEEL OUT OF THE CASE). NOT HAPPY",
      "rating": 1.0,
      "verified": true,
      "author": "JenBunny2104",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "BUY FROM SOMEONE ELSE (or pay extra for testing vessel)",
      "text": "Warning- Plastic case that hydrometer comes in CANNOT be used as testing cylinder! Every hydrometer I have used came in a tube that doubles as a testing vessel. These brainiacs cut the storage tube exactly in half making it useless as a testing cylinder - total waste- picture is totally misleading- PLEASE DO NOT BUY THIS PRODUCT",
      "rating": 1.0,
      "verified": true,
      "author": "Laurel Beeler",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Not all included",
      "text": "Great quality but it doesn’t come with a tube to test in, it would be nice if it came with a sample container and the tester so it can be used immediately, now I need to buy a container to put my beer and test it. Oh well",
      "rating": 4.0,
      "verified": true,
      "author": "Sheldon",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Good product at a fair price.",
      "text": "Hydrometer arrived much faster than expected. Well packaged and protected and quality for the price. One caveat: this hydrometer only measures to tenths, so you'll have to do some math to ensure accurate readings beyond that. But we all need more math in our lives!",
      "rating": 4.0,
      "verified": true,
      "author": "D. Figueroa",
      "helpful_votes": 2,
      "publication_date": 20160812
    },
    {
      "title": "Hydrometer",
      "text": "Works good but a little more confusing than my previous one. Also a little fragile. Very easy to break",
      "rating": 3.0,
      "verified": true,
      "author": "Ron Hutson",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Extremely fragile",
      "text": "Accidentally dropped it 2 inches into it's case and it broke.",
      "rating": 1.0,
      "verified": true,
      "author": "cactus",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Great",
      "text": "Great Product you need if your Trying to make Wine or Mead.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared shaw",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "GOOD",
      "text": "Works great, easy to clean and easy enough to read~",
      "rating": 5.0,
      "verified": true,
      "author": "Ariann/Jeromy",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Brewer's Elite Hydrometer",
      "text": "I broke the original one that came with the original kit so I purchased this one. Looks fine and accurate when tested against distilled water. Now I am able to see my final gravity prior to bottling.",
      "rating": 5.0,
      "verified": true,
      "author": "ojustme",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Does not work. Just sinks to the bottom of whatever I put it in.",
      "text": "Did not work. All it does is sink right to the bottom. I’ve read instructions over and over. Even put it into store bought liquor that I knew the alcohol by volume.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Corn",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Awesome",
      "text": "Looks good haven't used it yet. Really excited to see how well it works.",
      "rating": 5.0,
      "verified": true,
      "author": "J Rowland",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Easy to read. Easy to use.",
      "text": "I needed it for my hobby, it works verry good.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Edell ",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great deal",
      "text": "Great deal, I should buy these in pairs though, I break a lot of them",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Coleman",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great product",
      "text": "Great product, does what it supposed to do and pretty accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "yitz",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Very useful",
      "text": "Easy to use and easy to read. There is a guide on how to calculate the % alcohol with the readings taking before and after fermentation. The hydrometer, case, cleaning cloth, and small reference guide are included. My only problem was that it is 2 inches longer than I needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Isaac H.",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Hydrometer",
      "text": "All you have to do is know how to use one ;o)",
      "rating": 5.0,
      "verified": true,
      "author": "Slip",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "but what I really like is the color chart",
      "text": "Needed this for homebrew after I accidentally ordered one for distilling. It does what it's supposed to do, but what I really like is the color chart. Makes it easier to read. If this one ever breaks, I'll definitely be ordering another.",
      "rating": 5.0,
      "verified": true,
      "author": "DasHos",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Color coded hydrometer",
      "text": "Hydrometer arrived quickly. I have used it once to check the SG of a Cabernet I am fermenting. It’s easy to read. It’s color-coded which helps my aging eyes. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "caitsmimi",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Secure container",
      "text": "Overall works really well, mostly I appreciate the pack again because of stories of people who have broken their by having poor containers for them",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Clark",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Doesn't Come with Sample Tube",
      "text": "Hydrometer works well but the listing made it seem like the instrument came with a testing jar to take your readings, which it does not.",
      "rating": 3.0,
      "verified": true,
      "author": "Arne Weiland",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Precise",
      "text": "Definitely does the job, I’m sure sometime down the road I’ll break this one and need to order another and I’ll definitely roll with this same one. 10/10 would recommend to any brewer.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Good product",
      "text": "I have not used it yet, but I'm sure it works just fine",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Great Hydrometer!",
      "text": "I used this for a school lab project, but am now going to try using it to brew some wine!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandi Brown",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Nice hydrometer",
      "text": "Very nice product. Has case and instructions. When you're piecing things together don't forget the \"graduated cylinder.\" This does not come with one. There are others that do, but it depends what you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "A useful tool",
      "text": "East to read. Note of caution, insure it is clean.",
      "rating": 5.0,
      "verified": true,
      "author": "tom",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "The hydrometer works fine nothing special",
      "text": "The hydrometer works fine nothing special, can buy cheaper at your local brewery supply store. Thought it came with the measuring tube for the higher price but it didn't",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Great product!",
      "text": "I’d accidentally broke my last hydrometer (different brand) and this was an emergency order for me. I used the hydrometer the same day it arrived. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Peters",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "The hydrometer is OK - but seriously spend extra and buy one with a cylinder.",
      "text": "I got this hydrometer, it seems to work ok and get consistent readings but I thought I'd be able to use it in one of my cylinders and it didn't fit. Considering the ones that include a cylinder cost $4-5 more, I'd go with one of those",
      "rating": 4.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Item as described no issues what so ever!",
      "text": "Item as described. exactly what I expected in product and speed of delivery",
      "rating": 5.0,
      "verified": true,
      "author": "MR. Helpful",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "One Star",
      "text": "Will not work for kombucha!!!! This product is falsely advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Time for beer!!",
      "text": "This hydrometer arrived quitein time for my roommate's birthday. We were impressed with the hydrometer's case that has plenty of padding for protection.",
      "rating": 5.0,
      "verified": true,
      "author": "winniesmom",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "It is hard to read the numbers and if you ...",
      "text": "It is hard to read the numbers and if you place it in a big jar with a neck it is almost impossible to read.",
      "rating": 2.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "It's OK and looks like it should work",
      "text": "It's OK and looks like it should work. I thought it came with a test tube to float the hydrometer in, I guess I was wrong",
      "rating": 4.0,
      "verified": true,
      "author": "Lawrence T.",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Great for $12",
      "text": "Beginner homebrewer seems to works fine. Came fast and in a nice plastic holder with a little towel. Use it for my specific gravity scale goes down to .990",
      "rating": 5.0,
      "verified": true,
      "author": "J. Elliott",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "on time",
      "text": "Product came undamaged. Shipped on time. Seems to work well based on my expectaions",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great product and seller",
      "text": "Arrived on time and personalized letter from the seller. The hydrometer has a small crack from USPS and I informed the seller. Replaced it no questions asked within a few days. The hydrometer worked perfectly and matched all my numbers! Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Connaughton",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Great hydrometer, great company",
      "text": "Great hydrometer and great company. First hydrometer arrived broken. Had another one a day later. Hydrometer is easy to read. Love it. Thank you. Easy transaction.",
      "rating": 5.0,
      "verified": true,
      "author": "glashomb",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Easy to use!",
      "text": "Replaced a hydro meter in an old kit which looked like a thermometer. This one has nice colored bands to aid in reading. So much easier to understand and view how my beer is doing.",
      "rating": 5.0,
      "verified": true,
      "author": "M. R. McLaughlin",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Serves its purpose",
      "text": "This is a great little hyrdrometer that arrived in good packaging and doesn’t feel cheap at all. Only complaint is that the way it’s pictured makes it look like it comes with the graduated cylinder which it doesn’t. I know it clearly states it does not but the photos are a little deceiving. All around a good purchase and the cleaning cloth was a nice little addition.",
      "rating": 4.0,
      "verified": true,
      "author": "Trevor Nugent ",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Looks like it will work fine.",
      "text": "Havn't used it yet, but seeing as how i wont be using it for at least 6 weeks I'm rating this 5 stars because it looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Green",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Must have for home brewing",
      "text": "I like that the markings are bright & easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Good product",
      "text": "Super easy to use and well constructed. Comes with a container that helps protect the hydrometer thanks to a few well placed foam cushions.",
      "rating": 4.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Came quickly and as advertised.",
      "text": "Hydrometer came quickly and as advertised. I like that is has color segments on the scale. This makes it is easier to read SG through my carboy without my glasses. My other one broke so the hardcase should help.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "It does the job",
      "text": "Very easy to read. I wish the case could be used as the hydrometer cylinder (like my old one...) Color coding makes for easy reading",
      "rating": 4.0,
      "verified": true,
      "author": "RHF consumer",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "All good",
      "text": "Works great and very happy with price and time it took to get here.",
      "rating": 5.0,
      "verified": true,
      "author": "Chapy",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Five Stars",
      "text": "Great product, works like it should. I definitely recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Mitter",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "I didn't get to use it much",
      "text": "The two times I got to actually use it, it was great. However it shattered in my hands when I tried to use it the third. I'm not sure if I was too rough or if it was flawed, but regardless it worked really good the other two times!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Easy to use packaged well great product support",
      "text": "Product was packaged well with instructions and seller contacted me right away offering support. Was very pleased with purchase and look forward to using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason B.",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Works",
      "text": "Not the best quality, you get what you pay for",
      "rating": 4.0,
      "verified": true,
      "author": "Not to be taken advantage of.......",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Quick reship",
      "text": "Quickly reshipped, the second one came in one pc lol",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany5151",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "NO TEST JAR",
      "text": "This product doesn't come with the test jar that it NEEDS to be used. Three stars cause it works but kinda sucks to have to buy it separately",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20200417
    }
  ],
  "product_meta": {
    "title": "Brewer's Elite Hydrometer - for Home Brew Beer, Wine, Mead and Kombucha - Deluxe Triple Scale Set, Hardcase and Cloth - Specific Gravity ABV Tester",
    "description": "Do you want take pride in Hombrewing? Then you need the Brewer's Elite Deluxe Triple Scale Hydrometer Set! \n\nHere at Brewers Elite, it is our mission to make the world's best Hombrew tools & equipment, so that you can focus on making the world's best brews!\n\nThis Deluxe Set is the only kit to come with a FREE microfiber cleaning cloth, so you can clean up your set in style! \n\n\n\nCheck out how awesome our Deluxe Set is:\n\n\n★ EASY TO READ - Easy use colour scale gives you a visual guide of when your brew is ready. Our font has also been specially designed for crystal clear reading.\n\n\n★ HANDY STORAGE CASE - will keep your hydrometer safe for years to come.\n\n\n★ BEAUTIFUL MICROFIBER CLEANING CLOTH. - The only set to include a high quality cleaning cloth.\n\n\n★ ALL IN ONE - Triple scale hydrometer easily measures specific gravity, potential alcohol and brix, to easily measure density of fermentation liquids.\n\n\n★ INSTRUCTION'S - and handy conversion table to easily swap units and adjust for temperature correction.\n\n\n\nWhen you buy this kit you will receive a 100% Money-Back Guarantee! We are so certain that this Premium Triple Scale Hydrometer Kit will satisfy you that we offer a 90 day no-questions-asked refund policy!\n\n\n\nIN ADDITION your set is backed by a Lifetime replacement guarantee, should the hydrometer be innacurate.\n\n\n\nPlease be aware that you need a 250ml (or larger) graduated test liquid cylinder for this tool.",
    "rating": 4.4,
    "feature_bullets": [
      "★ Brewer's Elite Hydrometer - Premium Set - Handy Storage Case and FREE Microfiber cleaning cloth. Please note: NO TEST JAR INCLUDED. See our other Brewer's Elite combo if you require a full set.",
      "★ Easily calculate Alcohol % (ABV) - Graduated color bands help you know when you brew is ready, and our Crystal clear fonts are so easy to read.",
      "★ Create the perfect brew - with this durable all glass alcoholmeter make great beers, wines, ciders and Kombucha at home - The perfect tool to test when your sample liquid has finished the fermentation process.",
      "★ Triplescale - Specific Gravity (0.99 - 1.16), Potential Alcohol (0%-20%), Brix/Balling (0-35) - Check alcohol density with ease!",
      "★ 100% Money back guarantee - if you are not COMPLETELY satisfied we will give you your money back."
    ],
    "specifications": {
      "Package Dimensions": "11.06 x 1.53 x 1.37 inches",
      "Item Weight": "2.25 ounces",
      "Manufacturer": "Brewer's Elite",
      "ASIN": "B01CITP03W",
      "Item model number": "TSH-01",
      "Customer Reviews": "4.4 out of 5 stars1,188 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#6,692 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 3, 2016"
    },
    "categories": [
      "Beer Brewing",
      "Home & Kitchen",
      "Home Brewing & Wine Making",
      "Home Brewing Starter Sets",
      "Kitchen & Dining"
    ],
    "price": 11.99
  }
}