{
  "website_summaries": [
    {
      "verdict": "A reasonably sturdy ice cream scoop with an uncomplicated design, some nice features, and a few concerns.",
      "pros": [
        "Wide handle is comfortable to hold",
        "Shape of this scoop's top makes it easy to produce perfectly rounded ice cream scoops with the flick of the wrist",
        "Dishwasher safe"
      ],
      "cons": [
        "On the heavy side, and takes some muscle to scoop firmly frozen ice cream",
        "Chrome covered metal, not stainless steel"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I didn't know I needed this and now I can't live without it",
      "text": "I was tired of bending spoons or microwaving my ice cream just to get a few scoops from the container so I thought I'd try a tool that was made for scooping ice cream. I searched for some and the color of this one caught my eye so I bought it and got far more than I had bargained for. This has a great feel in the hand, is very hefty and sturdy, and slices through rock hard ice cream like it was butter. Now if you'll excuse me, I need to go buy some more ice cream!",
      "rating": 5.0,
      "verified": true,
      "author": "Felucca",
      "helpful_votes": 99,
      "publication_date": 20190218
    },
    {
      "title": "❤Best I've ever used! ❤",
      "text": "3 months later... I love this scoop. I'm here to buy one for my mother-in-law. It cuts through hard frozen i.c. so well. it's so easy, I tend to make a bigger bowl than I meant to. Oh darn. :) You know you're getting older when the utensil you're using hurts to use. This scoop is awesome. it's comfortable in your hand and has weight but isn't too heavy. Best part? it cuts right through hard frozen ice cream like a dream! Don't even need to run it under water of any temperature! So easy to use you'll have a bigger bowl of ice cream than you meant to get! and no hand pain!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca C.",
      "helpful_votes": 50,
      "publication_date": 20180623
    },
    {
      "title": "Trust me - this thing is amazing!",
      "text": "I originally wrote this review about a year ago and I still stand by it. Held up beautifully, still shiny and like new despite a ton of use. Here's the original review.... I don't normally write reviews, even for good products. Just don't have the time or inclination. However, this scoop is spectacular! The scoop itself is heavy with a very comfortable handle. It cuts through the ice cream like nothing. And if you heat it up? Cuts through like butter. Excellent, excellent product and amazing value. I would have paid twice as much had I known how great it is!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly M",
      "helpful_votes": 47,
      "publication_date": 20170303
    },
    {
      "title": "Unhealthy - peels into food!!!",
      "text": "Product plating peeled away after three uses. The product is dangerous. Clearly a cheap Chinese or other similarly low quality product product with no regard for health and safety. Use at own risk. Product will peel and add contaminants to your food. INCREDIBLY UNSAFE AND UNHEALTHY",
      "rating": 1.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 13,
      "publication_date": 20191225
    },
    {
      "title": "blister peel chip rough",
      "text": "I thought I loved this scoop, but after a few uses it has started to become rough inside, almost abrasive, I am not sure what is happening but I have heard folks describe it as bistering, peeling and chipping. What causes this. Thanks.",
      "rating": 1.0,
      "verified": true,
      "author": "DPInc",
      "helpful_votes": 15,
      "publication_date": 20190904
    },
    {
      "title": "8 months use and the chrome is chipping",
      "text": "This is easily the best ice cream scoop I’ve used, but after 8 months the chrome is starting to chip off. Sad face emoji.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily B.",
      "helpful_votes": 22,
      "publication_date": 20180701
    },
    {
      "title": "arrived damaged",
      "text": "item arrived damaged, it appears that the scoop it self has a metallic coating applied to it, the coating was delaminated/peeling when it arrived new in the box. There was no damage to the outer box from shipping. Item was returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 10,
      "publication_date": 20190723
    },
    {
      "title": "Metal coating erodes after only a year",
      "text": "Worked great for one year, but then the edge used for scooping started to peel / erode, exposing a copper colored metal underneath. I’m hoping that no one in the family ingested the metal coating that is coming off now.",
      "rating": 1.0,
      "verified": true,
      "author": "W. Byon",
      "helpful_votes": 10,
      "publication_date": 20191201
    },
    {
      "title": "Was not what expected",
      "text": "This scoop is very sturdy and well manufactured however I do not like that when you scoop the ice cream it is flat not round. i watched the video online, I mean its a scoop why would you need to watch it. However I can't get a round scoop of ice cream from the scoop to save my life..",
      "rating": 1.0,
      "verified": true,
      "author": "Bahameri",
      "helpful_votes": 9,
      "publication_date": 20190718
    },
    {
      "title": "Don't buy!",
      "text": "I am returning this product due to it's inability to cut through ice cream as advertised. My old ice cream scoop works much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Isitusal",
      "helpful_votes": 8,
      "publication_date": 20190303
    },
    {
      "title": "Doesn't Work With \"Rock Hard\" Ice Cream",
      "text": "I purchased this ice cream scooper based on great reviews, where many people said it did just as it claimed, working through scooping out hard ice cream. I disagree with these claims. I bought this ice cream scooper to use with homemade ice cream. We made ice cream which was frozen less than 2 days. It didn't work. I will most likely be returning it. What's the point of keeping it? I can just use my old OXO scooper that's basically falling apart, after having it for 10 years. I'll just buy the OXO scooper from Target online instead. I know the OXO brand scooper works. I just wanted to try something new. Oh well...live and learn.",
      "rating": 1.0,
      "verified": true,
      "author": "TrojanMama",
      "helpful_votes": 3,
      "publication_date": 20200706
    },
    {
      "title": "Coating peels",
      "text": "This ice cream scoop peeled within a week and we couldn’t use it anymore. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather Filipowicz",
      "helpful_votes": 102,
      "publication_date": 20191120
    },
    {
      "title": "Ahhhhhhh.....the best!",
      "text": "I have RA scooping anything makes me dread the task. What I love! 1. WORKS! a. I simply walk into kitchen and SKIP SITTING OUT ICECTEAM AHEAD OF TIME! b. Flip on my hot water kettle c. Grab scooper d. Pull out serving bowls PLUS one extra. e. Pour hot water (doesn't need to be boiling) into extra bowl.... dip scopper in the extra bowl f. Grab ice cold icecream out of freezer g. Scooping will be as easy as scooping butter!!!! I promise. 2. Small!",
      "rating": 5.0,
      "verified": true,
      "author": "City Dweller",
      "helpful_votes": 3,
      "publication_date": 20190611
    },
    {
      "title": "Fun colors and very sturdy",
      "text": "Nice sturdy scoop! Heavy and easy to hold so it glides through thick ice cream, especially when you run it under some hot water for a few seconds, cuts right through frozen ice cream! I was worried about the shape of the scoop, cuz it’s not round but I find this is about 10 times easier scoop with cuz the round ones the ice cream get stuck inside the scoop and you have to push it out, this creates a ball but you can easily plop it into a cone or bowl.",
      "rating": 5.0,
      "verified": true,
      "author": "K Dod",
      "helpful_votes": 2,
      "publication_date": 20200423
    },
    {
      "title": "Not 100% sure about this scooper . . .",
      "text": "I believe there's a better ice cream scooper out there somewhere. First off, the scoop itself is only a 1/4 scooper size - meaning that you can only scoop out about a fourth of the ice cream. Secondly, it's very difficult to use with hard, good quality ice cream like Ben & Jerry's, Haagan Das, etc., because you really have to crank down hard to get the scoop to cut through the ice cream. I always damaged the carton using this scoop. My suggestion is to find a good and sturdy half-moon sized scooper if using the good kind of ice cream; OR, wait until the ice cream is half-way melted (yuk!) and then go to town on it.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Better than the worst, but not the best.",
      "text": "Is it the best ice cream scooper in the world? No. But it does work well and it's heavy enough that it will go through some pretty cold ice cream. However, most of the reviews I read said it will slice through the hardest ice cream ever and that's not the case. Not sure what freezer anyone else has but mine makes my ice cream plenty hard and this scooper does not go through it with ease. You still need those muscles and a little warm water at the end to get the hard stuff out.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Bloom",
      "helpful_votes": 2,
      "publication_date": 20200305
    },
    {
      "title": "It works",
      "text": "I purchased this to try to save my marriage. My husband has the horrible habit of taking the ice cream out and leaving it on the counter to soften a little before scooping, forgetting and it getting melty and then refreezing which ultimately makes it harder to scoop. When I get ice cream for the kids, they don't want to wait for it to soften. I had high hopes for this thing. It's not AMAZING but it gets the job done and my husband has been using it so I'll mark it as a win.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenni BTop Contributor: Baby",
      "helpful_votes": 3,
      "publication_date": 20190425
    },
    {
      "title": "Great scooper!",
      "text": "The first one I purchased was a bad one (peeled horribly after a couple washings) but the supplier took care of us right away! This second one has been perfect! Ergo handle and it really gets the job done. Dishwasher safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl L. Sutton",
      "helpful_votes": 5,
      "publication_date": 20190414
    },
    {
      "title": "Not durable or dishwasher safe.",
      "text": "Started pitting after 4 months. Not dishwasher safe, as advertised. Not good quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Edmund  C",
      "helpful_votes": 8,
      "publication_date": 20190126
    },
    {
      "title": "Quality, ease and the last one you'll ever buy",
      "text": "Great ice cream scoop! Has very sturdy handle that is comfortable to hold and is very heavy duty. I have been searching for a reasonably priced, good quality ice cream scoop for a considerable length of time. I finally found one that easily scoops up very solid ice cream (we like our ice cream very firm, not mushy) with ease and is quality made. Have been using it for a few months now and I've found that if you use this one like one of the all metal ones, dip the metal part is super hot water, it scoops the ice cream like you're cutting through butter! Great purchase! Would buy again if I ever need to!",
      "rating": 5.0,
      "verified": true,
      "author": "Doogers_Wife",
      "helpful_votes": 4,
      "publication_date": 20170705
    },
    {
      "title": "Best ice cream scoop ever!",
      "text": "I’ve tried many ice cream scoops, but this is by far the best I’ve ever used. I was stuck at my brothers in quarantine and I definitely gained my 15 pounds because every night I had ice cream. I was never a fan of ice cream, but when I used this scoop compared to his other scoops, this is amazing. It scoops right through the frozen ice cream. There is no need to put it under running hot water. I’ve used many ice cream scoops during quarantine and the is the only one that worked best. This is better than the Pampered Chef ones. The shape also makes a huge difference compared to other ice cream scoops.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa V.",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Wow, great quality!",
      "text": "I needed a new ice cream scoop and wasn't expecting much. I mean: It's an ice cream scoop. How hard is that? Well, immediately upon taking it out of it's box, you can feel the quality of this ice cream scoop. It is very well built. The handle is perfect and the scoop shape makes it easy to use. I wasn't expecting much from an ice cream scoop, but I seriously love this, lol. I wasn't expecting to write a review of something so common, but due to it's fine quality and ease-of-use, I was compelled and happy to write this review, highly recommending this ice cream scoop.",
      "rating": 5.0,
      "verified": true,
      "author": "OCGabe",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Best Scoop Ever",
      "text": "I have used all types of ice cream scoops. From the spring loaded to the solid metal.. and they were always breaking down or the handle slid off the scoop end.. This is a masterpiece of engineering. The feel of it in the hand..the balance..when I scoop it into the carton I don't need a ton of effort..it glides in and the ice cream comes out great. If you have tried many scoops and were always disappointed..I suggest you give this a try...and it is great for stuffing ice cream into a cone too..then put a nice scoop on the top of the cone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathynye",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Scoops ice cream straight from the freezer",
      "text": "Great ice cream scooper. Zero wait time for scooping ice cream straight from the freezer with very little effort thanks to the weighted design. One downside: does not make perfect scoops (more like half scoops?) If that matters then you might be disappointed. Overall, very durable and feels like it would last a lifetime. I'd buy it again definitely.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "The metal coating peels off!",
      "text": "I've given 2 stars because the scooper was easy to hold and made scooping ice cream very easy, however, within the first 5 months of using it, the silver metal coating started peeling off. I am very disappointed because I really did find it to be a good scooper, but I definitely don't want silver paint in my ice cream!",
      "rating": 2.0,
      "verified": true,
      "author": "A.S.H.",
      "helpful_votes": 2,
      "publication_date": 20190924
    },
    {
      "title": "This Ice Cream Scoop has changed my life. I ...",
      "text": "This Ice Cream Scoop has changed my life. I have an ice cream problem. I eat a gallon of mint chip ice cream a week. My old Ice Cream Scoop was not up to the task after years of use and abuse. Enter the Spring Chef Ice Cream Scoop. It cuts through frozen ice cream and chunks of chocolate with ease. It has also increased the harmony in my household, maximized my Chi, and made me a virtuoso in bed with my wife. They should give one of these to Trump for his ice cream needs, and he will instantly do a complete about-face, stop tweeting and usher in an age of peace and prosperity.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigfish from WI",
      "helpful_votes": 13,
      "publication_date": 20170901
    },
    {
      "title": "Actually dishwasher-safe!",
      "text": "Cuts through cold ice cream with ease. Washes clean in the dishwasher without any problems. I haven't injured myself or gotten ice cream on my fingers while using it yet. No problems with releasing the ice cream into the bowl. I haven't been able to manage pretty balls of ice cream with it, but I haven't really been trying either.",
      "rating": 5.0,
      "verified": true,
      "author": "azurelunatic",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Best Ice cream scoop EVER - says my husband",
      "text": "We've tried a number of scoops, broke a number of them too, but this one is absolutely great. My husband does the scooping because the ice cream in our freezer is really hard. He loves it, scoops easily, he doesn't even run it under hot water, just scoops. Cracks me up cause ever time he scoops, he holds it in the air and says \"BEST...SCOOP...EVER!\" I think I'll be buying a bunch for stocking stuffers. We hand wash it, choose not to put in dishwasher. Won't be sorry if you buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Herbert",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "The best scoop ever.",
      "text": "When I got this I went out and bought 5 gallons of ice cream because it just makes you want to scoop. It cuts through rock hard ice cream like a hot knife through butter. Seriously, it is well made and solid. The handle is very ergonomic. A well made kitchen tool. I'm going to get a job as an ice cream scooper now.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Lowe",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great utensil - great quality",
      "text": "Once I started having trouble with arthritis, I grew tired of the old ice cream scoop where I had to squeeze the handles and try not to pinch my fingers. The search for a new type of scoop led me to read reviews on this one, and I decided to give it a try. It's been used several times a week for the past month or so. It performs well, has a substantial feel to it, and it works great. Happy with the purchase and I expect it to last for a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Heart in the Midwest",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "I love this scoop, best I ever owned!",
      "text": "Family laughed at me when I said I paid $14 for an ice cream scoop. \"Just use a spoon,\" they said. Well, this thing cuts through ice cream like a knife through butter. Sit the ice cream on the counter to soften it for a bit? Hell no! Not anymore with this amazing scoop, just dive right in. The weighty feel is nice, maybe could use more in the handle, but no biggie. Super easy cleanup. Others are not allowed to use it, just because they laughed. Yeah, I'm like that. Also, they'd probably scratch it or break it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Works great, glides right through!",
      "text": "Love this scoop! My old scoop was starting to leave a metal type residue in our ice cream so it was time for a new one. This seems to be heavy duty and glides right through. No, it doesn’t make balls as other reviews said, but I feel like that’s common sense since it’s not a rounded scoop. If you’re eating out of a bowl, who cares if it’s not perfect balls? If you’re wanting to use for an ice cream cone, this might not be your best option, but we use bowls and love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Perfect Scoop",
      "text": "This is a great ice cream scoop. You can tell just by looking that this ice cream scoop is constructed of high quality material, unlike the inexpensive cast aluminum scoops I have purchased in the past. This scoop feels great in the hand and has a superb polished finish. Strong design but still has thin cutting edges to soldier through very hard ice creams and sorbets. This is a heavy scoop that will give you years of use and will leave your guest impressed with its professional gourmet functionality and style",
      "rating": 5.0,
      "verified": true,
      "author": "DENISE GONZALEZ",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Hands down the BEST",
      "text": "I've tried a dozen different variations of ice cream scoops over the years and anything with moving parts fails. Then there's the ones with the liquid inside that you aren't supposed to put in the dishwasher but end up there eventually anyway. This one is easy to care for, solidly built, comfortable in my hand and it cuts through hard ice cream easily. What more could you ask for? It would be perfect if it removed the calories from the ice cream while scooping it but alas, the world isn't that perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Riddle",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "The perfect scooper!",
      "text": "It absolutely DOES make round scoops. You have to pull, not push it like a shovel... During isolation, we've been using our ice cream machine every few days, and desperately needed an upgrade of our scooper. This one is PERFECT. Fits well in the hand (righties and lefties in our house love it), and it shapes the perfect rounded scoops of sorbets and hard ice creams. Very sturdy, nice heft, great materials. Love. (And hand wash for longevity...)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon User",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "This is a GOOD One",
      "text": "The minute you touch this ice cream scoop you know it is solid and well made. This is a real ice cream scoop! Really nice to see the quality and even the little touches in design, too. It works just like it should--no having to do anythjing but grab it and dig in! We have had it for some weeks now and use it often. Washes in the dishwasher. Easy to use, easy to care for. Excellent in everyway. Wish more products were like this!",
      "rating": 5.0,
      "verified": true,
      "author": "Loch J",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Very surprised and very happy!",
      "text": "I hadn't used a scoop like this before, but this one works extremely well. It glides through the ice cream and makes it really easy to get some good scoops. It is shockingly hefty and has a good weight to it. We bought it to replace one of our old scoops that fell apart. A week after this one arrived, our other scoop died as well. it is highly likely we'll buy another one of these as we've really liked it. You always need to have more than one ice cream scoop!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave B",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Scoops like a Charm",
      "text": "We had an ice cream scooper with the little lever on it that helps push your scoop out . It was uncomfortable to my hand but I assumed it would be easier than one that didn't have that. My 14 yr old son kept insisting this kind of scooper was easier and he started looking them up and texting me links to ones he found. I finally caved and purchased this thinking he would regret it. But NOPE. This scoops it out with ease. I just hate it took me so long to listen to him. :)",
      "rating": 5.0,
      "verified": true,
      "author": "HLane",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great ice cream scoop",
      "text": "This ice cream scoop it very comfortable to hold. If the ice cream is hard, it’s nice to have an ergonomically friendly handle to grip on to because scooping hard ice cream requires a firm grip. I noticed some reviewers were displeased that this scoop did not produce rounds scoops of ice cream. I actually prefer this type of ice cream scoop. If you want round scoops of ice cream, you simply keep on scooping or rolling until a round scoop or ball of ice cream is formed. But with this scoop you also have the option of creating flatter scoops. I like having that option.",
      "rating": 5.0,
      "verified": true,
      "author": "Somsak Tanaka",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Seems Sturdy and Should Last",
      "text": "Our old ice cream scoop got really funky after washing it in the dishwasher over time (left dark residue in ice cream carton!!) so we wanted to get a new scoop. This one seems to be what we were looking for: it's super sturdy compared to old scoop, the shape allows you to easily scoop out ice cream from the carton and the handle is easy to grip. I think this will do the job! Hopefully it doesn't get funky in the dishwasher over time.",
      "rating": 5.0,
      "verified": true,
      "author": "Solobiz",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "The Best Scoop",
      "text": "Nothing is worse than trying to wrangle overly cold ice cream out of the container. You want to have a nicely-formed scoop, not shredded pieces. This Spring Chef Ice Cream Scoop is comfortable to hold. The sharp top edge helps it to easily cut into the ice cream and bring a nice ball to put into your bowl. Unlike ice cream scoops that are a struggle to use, this one is a pleasure. If that were not enough, it is also dishwasher safe so cleanup is a snap",
      "rating": 5.0,
      "verified": true,
      "author": "A. Silverstone",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Love, love, love!",
      "text": "Where has this scoop been all my life? I have had 2 Tupperware ice cream scoops as well as another expensive brand. All 3 are very heavy and both Tupperware scoops have pitted. None of them scoop ice cream anywhere near as easy as this scoop! It’s very easy to hold and cuts through very hard ice cream like butter. I bought the pink handled scoop. I would not hesitate to purchase another one. It’s worth every penny I spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Our Green New Deal!",
      "text": "This is absolutely the best ice cream scoop we've ever bought! Nice heavy weight to it and boy does it slice through hard frozen ice cream without running it under warm water first (see, it's also good for our planet!) My husband & I are very impressed with it. Plus, being Seahawk fans here in WA state, the peridot-lime green makes it a little more lovable, if that's possible. Go Hawks! ;~} ~ T & K",
      "rating": 5.0,
      "verified": true,
      "author": "Ken McCall",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Perfect Scoop!",
      "text": "I didn’t realize when I purchased this ice cream scoop how superior it is compared to other brands and types. This truly is a brilliant piece of equipment and a must have for any kitchen. We replaced another well-known and more expensive brand of scoop with this Spring Chef scoop after our old one started leaking water into the handle. With the design of the Spring Chef, that cannot occur. These are nicely packaged and come in a choice of colors to match kitchen decor. We plan to give these as “stocking stuffers” next Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Wright",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "LOVE THIS SCOOPER!!!",
      "text": "I recently lost a REALLY great and expensive ice cream scooper (from another company) and thought I'd look on Amazon for a reasonable and less expensive replacement. This scooper is 1,000% better than the one I lost! And much less money as well. I have slight arthritis in my thumbs and this scooper has a very comfortable grip. It cust through ice cream with ease. And the scooper is a breeze to wash. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Zootie's Mom",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Much better than supermarket scoops",
      "text": "I have a touch of ice cream nearly every day as my one vice. My old scooper finally wore out. I bought a basic one at the supermarket with a little mechanism on it that dumps off the ice cream but really does not work all that well. I finally looked online and found this one. It makes nice curls, enabling me to get a little more of the goodness in a single scoop. I have a hot water dispenser I use to rinse it off. That is all I need although the product is dishwasher safe anyway. I am very satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "mikesternqrc",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Inferior product - waste of money",
      "text": "2nd time using this ice cream scooper, just normal use in scooping out ice cream from the carton, and it breaks in half. Very disappointing. It’s been 60 days since I bought the product so I am now outside the 30 day window of return. Really disappointing. May not be a lot of money but don’t waste a penny on this inferior product.",
      "rating": 1.0,
      "verified": true,
      "author": "Sylvia",
      "helpful_votes": 2,
      "publication_date": 20200927
    },
    {
      "title": "Heavy Duty Scooper - (may be the last one you'll buy)",
      "text": "My old ice cream scoop recently broke while scooping, sending a chunk of mint chocolate chip flying across the room. When looking for a new one I had no idea there were so many choices. Took a chance on this one and really like it. It's heavy - enough to feel secure and sturdy while scooping. If you keep rolling the ice cream you will wind up with a perfect ball. Works great and even has a little slit on the end of the handle that will allow he scooper to hang on a bucket or container of ice cream. Would. It again but I'm betting this will last a long, long time!",
      "rating": 5.0,
      "verified": true,
      "author": "TT",
      "helpful_votes": 2,
      "publication_date": 20170704
    },
    {
      "title": "Buy this Scoop NOW!",
      "text": "This is a heavy duty ice cream scoop. Our ice cream freezes hard and with our old scoop is was so difficult to get ice cream. We’ve bent spoons, slammed the old scoop against the containers while trying to get ice cream, flung ice cream across the counters... it was bad! But this Spring Chef scoop is AMAZING! It’s heavy, fits in my hand just right, and the scoop part glides so easily through the Ice cream. 5 stars across the board! Buy this scoop now!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Comfy and efficient but already pitting",
      "text": "Based on positive reviews, decided to take a chance on the Sprin Chef scoop. Pleased with the cushioned handle and weight of the scoop itself; really does make cutting through hard ice cream much easier. Unfortunately, after only three weeks of use and consistently washed by hand, the inside of scoop has already started pitting like all my previous ice cream scoops.",
      "rating": 3.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "It's that good",
      "text": "You may be wondering like I was, how can an ice cream scoop have such high ratings? It's just an ice cream scoop, what's the big deal? Well, if you battle rock solid ice cream from the freezer, bending spoons or getting small shavings from the 'other' ice cream scoops then you'll really appreciate this one. It's just very good at what it does. I'm very impressed. It's also very solid and heavy. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "texmln",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "The last ice cream scoop you'll ever buy.",
      "text": "This will be the last ice cream scoop you will buy. I love this ice cream scoop. I am 57, I have arthritis and I'm left handed. This scoop checks all the boxes. It feels balanced in my hand and the handles is sturdy and easy to hold. It's also versatile. I used it to scoop out cookie dough and salmon when I made salmon patties last night. I would highly recommend this scoop for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin and Mari Cornish",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great Ice Cream Scoop!",
      "text": "I have had ice cream scoops in the past where the design was a rounded scoop with a metal bar that swings through the inside of the scoop to dislodge the ice cream. Problem has been that the metal bar breaks. I decided to give this Spring Chef scoop a try based on reviews. Well...... I'm impressed! The heavy weight of the scoop plows easily through the ice cream and not sure why but the ice cream falls easily from the scoop into the bowl. I'm very happy with it and highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Perfection!",
      "text": "Ok, they have perfected the ice cream scoop. I've used ice cream scooos before but they were still really hard to get through the ice cream and I might need to use another spoon to get the ice cream out of the scoop. This scoop is different. It feels good in the hand and cuts right through the ice cream, which falls out of the scoop into my bowl easily. I didn't know what I was missing and could not be happier with this surprisingly effective scoop",
      "rating": 5.0,
      "verified": true,
      "author": "Justin M.",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Sturdy and easy to clean",
      "text": "It’s still new for us, but this feels super sturdy. It washes up easily either by hand or in the dishwasher. It is easily the heaviest ice cream scoop I have ever felt, which is a positive as it works out well when the ice cream is really hard. I find it isn’t as easy to make the perfect spherical scoop as others I have used (and I know how as I used to manage an ice cream shop), but I am happy with the purchase so far.",
      "rating": 4.0,
      "verified": true,
      "author": "interiorlulu",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Best scoop I've used",
      "text": "This is truly the best scoop I have ever used! You don't have to wet it, it cuts into the ice cream cleanly and lets you roll up a ball every time. Just rinse it to clean and it's ready to go again. Ice cream extremely frozen? Doesn't matter, it still cuts and rolls just like it's soft-serve. Don't know how it will hold up, but for now I'm lovin' it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Must-have!!!",
      "text": "This is the best ice cream scoop I’ve ever had. It’s heavier than the ones I’ve had before. This scoop just slides right into the tub of ice cream with ease. It doesn’t make perfect round scoops of ice cream but it definitely makes scooping the ice cream a LOT easier. This is definitely a must have in your kitchen for ice cream dessert nights.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Outside Coating Quickly Blisters & Peels",
      "text": "The description says you should never need another ice cream scoop. Ha! I have used this scoop twice since I purchased it in good faith. I have hand washed it twice. The coating is blistering and peeling. Useless!",
      "rating": 1.0,
      "verified": true,
      "author": "Dissatisfied customer",
      "helpful_votes": 3,
      "publication_date": 20200630
    },
    {
      "title": "Fantastic scoop!",
      "text": "LOVE this ice cream scoop! It slices through frozen ice cream like a hot knife through butter. I keep my freezer very cold, which means my ice cream is extremely frozen like everything else. This is the only scoop I've ever had that can easily cut through very frozen ice cream. The handle is very comfortable and easy to hold. Would buy another one. Very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Addiss",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Life changing scoop, best I ever had.",
      "text": "This is the best ice cream scoop I’ve ever seen or used. Life changing really. It cuts through ice cream so easily, no matter how hard the ice cream. The front edge is very thin so it scoops with ease. I bought another brand (started with a G) that looked the same for my mom, but it was not as good! The front lip on the other was thicker so it worked like a normal scoop, not this amazing Spring Chef listed above. Best scoop you’ll ever own! Buy it now!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rm",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "This made me fat.",
      "text": "I was skeptical about this scoop, thinking it was going to be chinesium garbage. But after I got it, I was shocked at how hefty it was! The silicone grip is fine and there’s enough thermal mass to keep scooping away. I’ve scooped from Tillamook (easy) to Ben & Jerry’s without an issue. It’s so good I’ve gone through many tubs of ice cream. It’s also easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Park",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "No more broken scoops...",
      "text": "I have broken countless scoops on hard ice cream... I no longer have to wait for it to melt sufficiently to scoop it out...and then when it refreezes, it has freezer burn and a nasty taste.... This scoop is AMAZING. It scoops the hardest ice cream like a dream. It is sturdy and easy to clean. It doesn't slip so you end up smacking yourself in the face trying to have a cold and tasty treat. I recommend it to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "OooSillyMe",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "This is what you want!!!!",
      "text": "Don’t even think of buying a different ice cream scoop! I guarantee you - this one will beat them all - hands down! I don’t care how hard and frozen your ice cream is, miraculously this little guy gets through it with minimum effort! It’s super sturdy. It’s reliable. It’s the only ice cream scoop you’ll ever need - or want!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne Ambrose",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Not so comfortable after all",
      "text": "While this scoop appears to be a well made product, the handle does not feel right in the hand. I don't consider it ergonomic at all. On the contrary it seems to put the handle at a very odd angle which you feel immediately in the wrist as you grasp it. Will try it in action, but first assessment is the handle was not intelligently designed.",
      "rating": 3.0,
      "verified": true,
      "author": "Blair",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Soooooo wonderful!!!",
      "text": "I am short. Leverage is always a problem. This scoop is perfect for me!! My husband appreciates it also. Who likes to dig into a package of ice cream that is like a rock? The handle is soft and very easy to hold. It has edges that seem to just cut through the ice cream. I have never like the ones that you have to warm in hot water, and this you don't have to do. It is my new favorite utensil in the kitchen!!! Highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janette",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "It’s ok",
      "text": "I bought this because it was rated high but it’s actually kind of awkward if you are used to regular ice cream scoopers. The actual scoop is set back behind the handle and it’s kind of flat versus round so it takes some getting used to. I probably would buy one that’s more round in shape then flat like this one but for the time being it serves the purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin O'Brien",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Truthfully the best scoop I've ever owned",
      "text": "Looove this scoop! It's got some heft and feels very balanced and comfortable in my hand. The wide scoop makes it sooo much easier to dig into and get a nice full serving. Getting one for my Mom, too. She has inflammatory joint pain, and I know this product will make a tremendous difference for her. And I did NOT any discounts or goodies for this review, I'm just actually really delighted with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carey",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "No more spoons!",
      "text": "I put off buying this thing for way too long. I had myself convinced I could scoop ice cream with just a spoon. It got to the point that I would wrap a towel around the spoon so that my palm wouldn't be stabbed by trying to scoop the ice cream. Finally took the plunge and ordered this scoop and I will never go back. It is amazing and worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "oriley2013",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Highly Recommend",
      "text": "I have arthritis in my hands. After reading the reviews I was anxious to try this scoop because normally I can’t scoop hard ice cream. I have to either let it melt or have my husband do it. I’ll be darn! It works great! You really can scoop rock hard ice cream with this! The handle is comfortable, and I like the little hook thing on the end for opening the top of the ice cream.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Super Dooper Scooper",
      "text": "We keep our freezer set at -1. Otherwise, my wife says her fudgsicles are too soft. This makes regular ice cream difficult to scoop. Not with this scoop. Before I was using two hands on the scoop and maximum force to make little progress. With this scoop, I only need one hand and it cuts right through. Plus, the handle is very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Broke in Arizona",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "NICE",
      "text": "I have a Cutco ice cream scooper that ive sent back to them twice because the finish wore off. Mind you this scooper cost over 40 bucks.its great that they replace it but im disappointed that it simply does not last. This scooper is GREAT so far and hubby says its better than the Cutco. Time will tell whether it lasts.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Great scoop!",
      "text": "This is a great ice cream scoop! I'm not sure how we can be so impressed by such a simple, everyday product but it is one of the best quality kitchen utensils we've owned. It's comfortable to hold, great quality, cuts through even the hardest frozen ice cream/sorbet with ease, and has held up well in the dishwasher. So glad we bought this!",
      "rating": 5.0,
      "verified": true,
      "author": "Kiley",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Truly Amazing",
      "text": "I purchase many items on Amazon but only choose to write reviews when a product utterly fails or knocks my socks off. For this review, I have to absolutely say that this product most definitely knocks my socks off. Completely cuts through frozen ice cream like butter. Absolutely recommend those individuals fighting to get their just deserts.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke Skywalker",
      "helpful_votes": 5,
      "publication_date": 20161121
    },
    {
      "title": "Here's the Scoop...",
      "text": "Handy dandy little oce cream scoop. I like hard ice cream and managed to break two othe types. Can't imagine this would break even if I used it like a chisel with a hammer on it. It's solid as a rock.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas A. Boter",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Best ice cream Scoop I have ever used",
      "text": "This review is for use with Ice Cream Only! I have used several types of scoops in the past including the mechanical thumb lever style and solid scoops. IMO, the mechanical styles do not last so the solid type is better and this is the best I have used. The design of the metal scoop surface cuts through the ice cream (frozen solid) with ease. The handle is a bit big and I would hand wash this only. I would recommend this and buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "David P. Tierney",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Surprisingly easy scoop!",
      "text": "I bought this scoop based on the reviews. The way it is designed, it glides through rock hard ice cream fairly easy. Because the handle is thicker, it is easy to hold onto it while using some force to scoop the ice cream. After a few scoopings, I run the scoop under warm water so that it continues to work well well in the ice cream. It is definitely worth the money. The last scoop you'll ever buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Woods",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Works great!",
      "text": "Love it! I always used a pampered chef one because I was told that was the best ice cream scoop. Well they were sadly mistaken because this is the best ice cream scooper I’ve ever used. It was till easy to use on nearly rock solid ice cream. Would definitely recommend. The grip on the handle is also nice.",
      "rating": 5.0,
      "verified": true,
      "author": "desiree whale",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "just like everyone was saying:  great!",
      "text": "Easy to hold, can scoop ice cream from the side or the front and scoops just as easily as claimed. I really love it! We had an old fashion scoop that was not dishwasher safe, and when we ran it through the dishwasher, it looked strange and seemed to change color and I was worried that it would rub off on the ice cream. So trash can then Amazon, and a couple looked good, and I chose this one and was happy I did!",
      "rating": 5.0,
      "verified": true,
      "author": "cegfromsat",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "So far so good",
      "text": "Everything about this scoop is terrific. It's only been used a few times since we got it but it seems very sturdy. It's such a snap to clean that I don't see any reason to put it in the dishwasher; which may help to preserve the finish. Time will tell how it holds up. Overall a very nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommysmissus",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "I’ve tried them ALL!",
      "text": "This is about the 10th ice cream scooper I’ve bought in our 11 year marriage.. and it will be THE LAST! All previous scoopers have either broken or not scooped well enough - like when you have to use so much strength to get one scoop out that it ends up flying up and plopping on the counter. We’ve all done it lol. We keep our freezer very cold and this scooper scoops ice cream like it’s butter! No joke! I’ve tried it with 3 different brands/types of ice cream and it worked perfectly in all of them. I highly recommend it!!",
      "rating": 5.0,
      "verified": true,
      "author": "CGK",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "A great product",
      "text": "This ice cream scoop fits our needs perfectly. It is ergonomic so it doesn't cramp my hand to use, even with hard packed ice cream. It easily cuts through even the hardest frozen ice cream. And it is dishwasher safe. The perfect scooper. I read all the reviews before I bought it and I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Lannemei",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Solid ice cream tool",
      "text": "I've gone through I don't know how many scoopers that have rusted, hinge fell apart, gave me callouses...the list goes on. This simple scooper has already elevated the standard. Simple design is surprisingly ergonomic and makes scooping so much easier than it has been (or I could have imagined).",
      "rating": 5.0,
      "verified": true,
      "author": "hawaiianpapaya",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "A summer time workhorse.",
      "text": "There is not much to say beyond it being heavy, sturdy and easy to clean. I tried to break the head off with a reasonable amount elbow grease. It held up and didn't crack, bend or warp. It has grooves in the scoop to prevent suction and the grip is comfortable and slip resistant. Blows a table spoon out of the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Bear and Bunny",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Love the handle",
      "text": "We needed a new ice cream scoop. I wanted to find one with a good ergonomic grip for that really hard ice cream. This does the trick, the edges slice through frozen ice cream without a lot of effort and the handle grip is easy on your hand. The red color matches my other kitchen utensils.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Brown",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "THE ANSWER TO OUR ICE CREAM SCOOP PRAYERS!",
      "text": "This thing works! Seriously! A thousand times better than a regular spoon! No bending, no struggling, no crying, \"My wrist hurts!\" as you scoop your delicious but rock-solid-frozen-hard ice cream! It's fantastic. Buy it now. Buy it and don't look back! And stock up on ice cream while you're at it!",
      "rating": 5.0,
      "verified": true,
      "author": "HappyVegas",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Best scoop I have owned!",
      "text": "I was looking for a scoop that the wider than the round scoops designed to scoop for cones. This one fit the bill. It has good heft to it and bites easily into soft or frozen ice cream and then the ice cream doesn't cling much to the scoop when you turn it over. I highly recommend it and the price is modest.",
      "rating": 5.0,
      "verified": true,
      "author": "Ira",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Accidental Buy, but great mistake",
      "text": "So I actually thought I was purchasing a heated ice cream scooper. I must have put the wrong one in my cart, but let me tell you, I am so glad I did. This ice cream scooper is so easy to use, the ice cream folds over easily. It feels great and I don't have to struggle to get the ice cream out. 5 stars all the way! If you have this scooper, you dont need a heated one, it is just as good, if not better",
      "rating": 5.0,
      "verified": true,
      "author": "Latonia Green",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "The best ice cream scoop!!!",
      "text": "My ice cream was so hard like a piece of \"hard wood\" that when I used my old ice cream scoop it got completely crooked. So I decided to buy a new one. And based on the reviews I bought this one. Believe me, this ice cream scoop is the best I ever had in my kitchen. Now my \"hard wood\" ice cream is like a butter and this scoop is like a knife. Just buy it and you won't regret it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carla M.",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "I really like my new scoop",
      "text": "I really like my new scoop. I have owned a couple scoops before but they broke quickly or hurt my hand when I used them. This one has a nice \"heft\" to it and digs right into the ice cream, making the scooping easy. Used this to get ready for a Sundae Bar party where I needed 30 pre-scooped cups of a variety of ice creams and this scoop helped me get the job done quickly. The weight and design of the scoop are well thought out for the purpose needed. I admit to using flatware in the past, in desperation, but once succeeded in bending my serving spoons. Think I found a winner. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "SashaFoxtrot",
      "helpful_votes": 2,
      "publication_date": 20170303
    },
    {
      "title": "Believe the hype, it’s amazing.",
      "text": "This is the perfect ice cream scoop. Go to my friend’s a lot for dinner and we always have ice cream but he had this terrible scoop that made getting dessert difficult. I bought this for him and it was so great I bought one again for myself. So nice and heavy and the chrome shines, cuts right through hard frozen ice cream.",
      "rating": 5.0,
      "verified": true,
      "author": "Kez",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Sturdy, easy to hold, produces nice round scoop of ice cream",
      "text": "Produces a nice round scoop of ice cream that almost looks professional. Scoops a nice amount for a snack - not to much or too little. Hefty weight and solid handle and grip. Have washed it by hand and also in the dishwasher and there are no signs of it rusting, denting nor does the handle show any signs of cracking or wear. A satisfying purchase at a nice price.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Begelfer",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Durable, Functional, and Painless!",
      "text": "Having gone through about 3 scoops per year, I chose this based primarily on the reviews. I have owned it about a month and been through 4 cartons of ice cream, so it may be a little early to comment on durability but so far I could not be happier. The grip is comfortable and designed for easy use. You can build a nice 3-scoop cone without spraining your wrist! I do not believe that this one will snap in half like I've experienced in the past. Lastly, this scoop is Ideal for grandparents, like me, with arthritic hands and a crew of ice cream loving grandkids! No pain!",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Maxwell",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Lurve it, I screamed for ice cream!!!",
      "text": "It scoop-Dee-doops so good!! When it started to swirl it into like a pretty commercial curled ball of ice cream, it made me feel magical. I bet working at an ice cream shoppe or ice cream truck must be awesome if they get to use this ice scream scooper in particular! Also such a pretty color, and great feel/heft! I have super weak arms and \"princess\" hands, so it was so easy and smooth to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Lukey",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "The last ice cream scoop you’ll ever need to buy.",
      "text": "1. Good products. In addition to the Ice Cream Scoop with Comfortable Handle, we have their super-sharp box grater. Both products are well-made, of suitable materials. 2. The products are well-designed, with plenty of attention to how people will house the products. 3. The products are well-described in the promotional and ad copy. 4. The products are well-supported with customer service, follow-up, and a lifetime warranty",
      "rating": 5.0,
      "verified": true,
      "author": "Floyd Ian Slipp",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Great Ice Cream Scoop",
      "text": "I used to purchase oxo ice cream scoops but would have trouble with them pitting. Upon receiving this ice Cream Scoop I was thrilled. It has such great balance, The scoop itself stays shiny. Now for the most important information, it slides through the ice cream like a dream, even when your ice cream gets frozen a little too hard. Needless to say, I will never purchase oxo again. I love, love, love this ice cream scoop and would highly recommend it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rowlettmom",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Perfect Scoops",
      "text": "Perfect. It does scoop round ice cream scoops not sure how some reviewers had a problem with this. I used this on some very solid ice cream and thought it would pretty decently, which means a lot considering I’m weak and usually this sort of task is a struggle. Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "MER",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "The BEST !!!!",
      "text": "I thought this was the best so I ordered another one for myself and my adult children . We have a Restaurant business and they said they wanted to use theirs at the restaurant bc they loved it as well. This is the only ice scream scooper I will ever use now! It’s worth every penny! I believe you will not be disappointed bc We are very very happy with ours . Try it, you will like it as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "So glad I bought this",
      "text": "I almost bought an ice cream scoop that was double this price, so glad I didn't because this scoop is worth every penny and more! Love the ergonomic feel and hold of this scoop and most importantly it cuts right through hard ice cream. Doesn't take any force whatsoever to use this scoop.",
      "rating": 5.0,
      "verified": true,
      "author": "LivInTX",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Great scooper!",
      "text": "I didn’t know what a difference a good ice cream scooper makes. After bending numerous spoons on rock hard ice cream I decided to try a scooper and chose this one. It really makes scooping ice cream so much easier, it is heavy and therefore helps get the ice cream out so much easier! Who knew!",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Heavy duty",
      "text": "This scoop works really well. Its very heavy and solid. It has good grip and powers through even hard solid ice cream. Its the simple things in life sometimes that make us happy. Having a functional ice cream scoop that does what its supposed to and doesn't hurt your wrist or fling ice cream all over the kitchen is one of those things.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20191118
    }
  ],
  "product_meta": {
    "title": "Spring Chef Ice Cream Scoop with Comfortable Handle, Black",
    "rating": 4.8,
    "feature_bullets": [
      "THE LAST ICE CREAM SCOOP YOU'LL NEED - Genuine heavy duty tool that is strong and sturdy with no mechanical gimmicks or moving parts that can break. Plus it's Dishwasher Safe. Great for other creative kitchen uses as well including using it to scoop out seeds from melons or filling peppers with stuffing. Works amazingly well for gelato and custard too and is guaranteed by our Lifetime Warranty.",
      "CREATE PERFECT SPHERES OF ICE CREAM - cuts through smoothly and effortlessly so that ice cream curls onto itself, making beautiful and well-proportioned scoops for cones, brownies, sundaes, pies and more.",
      "INNOVATIVE DESIGN SAVES YOU TIME AND ENERGY - Unique shape that is the best combination of a scoop and spade to help you easily tackle rock hard frozen desserts. Curved area of scoop makes brilliant curls while the thin edges help dig out ice cream from the corners of the container so you can enjoy every last tasty bite. The handle even has a notch to lift container lids which will keep your hands happy.",
      "PLOWS THROUGH ICE CREAM LIKE IT'S BUTTER - Glides smoothly and easily through hard-packed frozen sweets. It will seem like ice cream flows right into the ice cream scoops and drops into your bowl or cone with little to no effort.",
      "LIFE IS TOO SHORT TO STRUGGLE WITH A BAD SCOOP - With its pleasant weight, ability to get into hard-to-reach parts of a carton and excellent handling of hard ice cream - this is the one for you. The handle is comfortable to hold, easy to grip and doesn't freeze your hand like scoops with a metal handle can. Simple yet ergonomic design that is easy to clean and will make you known for your perfect scooping abilities."
    ],
    "specifications": {
      "Package Dimensions": "8.3 x 2.1 x 1.7 inches",
      "Item Weight": "8 ounces",
      "Manufacturer": "Spring Chef",
      "ASIN": "B01CX2EZ3K",
      "Item model number": "SYNCHKG128186",
      "Customer Reviews": "4.8 out of 5 stars8,447 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#121 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 13, 2016"
    },
    "categories": [
      "Ice Cream Scoops",
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Specialty Tools & Gadgets",
      "Kitchen & Dining"
    ],
    "price": 11.97
  }
}