{
  "website_summaries": [
    {
      "verdict": "Inexpensive, vibrantly colored, and a fun callback to Goku’s earliest adventures, you can always count on Funko to deliver a quality POP! toy.",
      "pros": [
        "Young Goku riding the Flying Nimbus, redesigned in the iconic Funko Pop style",
        "Excellent attention to detail",
        "Great paint job",
        "Affordable",
        "Nimbus functions as a figure stand"
      ],
      "cons": [
        "No bobblehead feature"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awwesome Young Goku Figure",
      "text": "One of the better Funko Pop figures I've had. The paint job is clean and the mold is nice. The Dragon Ball meets Funko Pop style looks great and growing up with Dragon Ball I appreciate a young Goku figure with his original gi, staff, and nimbus cloud. If you're a young Goku fan or you know one, this is a great figure to get at a good price ~$10 and I can more than easily recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "I Like StuffTop Contributor: Action Figures",
      "helpful_votes": 9,
      "publication_date": 20160706
    },
    {
      "title": "Heavy",
      "text": "For the collectors: The box was pristine. Probably one of the best I've ever got. Paint was perfect. Lines tight and colors bright. Not sure it would look good displayed in the box because there is so much detail on the back. For the rest of us: This thing is heavy! It feels like it weighs almost as much as my 6 inch Alduin. Goku's weapon and tail seem pretty secure. The weight of Nimbus make this little guy pretty sturdy, but for Kai's sake, do not drop it on your foot. Not a pleasant experience...",
      "rating": 5.0,
      "verified": true,
      "author": "FrancisTop Contributor: Dragon Ball Z (TV Show)",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Well Painted Figure",
      "text": "I bought this figure for my friend’s birthday, so I really hoped that it would come with a good paint job and in overall good condition. I wasn’t disappointed. I think she will be really happy with this goku figure, the hair has very few flaws and the clothing has few paint errors as well. It’s sculpted very unique and well. The box didn’t come damaged as well. I recommend buying this figure.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Great figure",
      "text": "No issues with the figure itself having any defects like a few reviews I've seen. The box was in good condition, but is now in the trash because I like opening and using what I buy. Same quality as other Funko Pop figures and was cheaper than in the store.",
      "rating": 5.0,
      "verified": true,
      "author": "Xem",
      "helpful_votes": 2,
      "publication_date": 20180511
    },
    {
      "title": "Ok cool. Well this one came perfect",
      "text": "Apparently can't write a review based on the product I got from which seller. Ok cool. Well this one came perfect. But from the same seller I received a banged up pop. Maybe this one can be posted. If the box is important I would be careful ordering online.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara P",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "KINTA UN",
      "text": "Not sure how you spell it since it's actually in Japanese lol but love this kid Goku with Nimbus. Perfect bday gift for my husband. Sturdy and as pictured :)",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy Whyte",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Damaged box, but figure is great!",
      "text": "I was disappointed in the box being snagged on the Goku on the front, I am a collector of sorts. I think it wouldn’t be too bad for gifting someone, if they aren’t huge into having a perfect box. The figure i’m very satisfied with, it is flat on the bottom so no need to worry about balance issues on a shelf! I think any Dragon Ball fan would love this!",
      "rating": 4.0,
      "verified": true,
      "author": "Merob",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Goku Diaper cake",
      "text": "Perfect product for my dragon ball z theme diaper cake. Good quality and great size",
      "rating": 5.0,
      "verified": true,
      "author": "Nina Bacchus",
      "helpful_votes": 2,
      "publication_date": 20181204
    },
    {
      "title": "Nimbus Cloud Detail is extraordinary!",
      "text": "The best part of this FUNKO, besides it being dragon ball z, is the detail and attention to GOKUS NIMBUS CLOUD! I will leave several different pics both in the case and outside in an attempt to demonstrate the versatility of display potential",
      "rating": 5.0,
      "verified": true,
      "author": "brandon ",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Its a nicely put together pop",
      "text": "Very nice quality pop. was concerned with the paint going from cloud to feet, but pulled off very well. Its got nice weight to it so it wont fall over. Came wrapped in bubble wrap.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Right product but damaged box",
      "text": "Got the item on scheduled delivery date however the box was slightly damaged probably due to Shipping and Handling. Considering the item is a collectible this brings the value of the item down a bit. I would suggest offering as an option to have the item come with a protector even at an extra cost just to protect it from damage. But overall Happy With the product",
      "rating": 3.0,
      "verified": true,
      "author": "jr ofilada",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Squad Goals!",
      "text": "I had pre-ordered this Goku a few months ago so I forgot all about it until it surprised my by appear in my mailbox! What a neat gift to myself! As someone who grew up with DBZ it's really cool to see Goku hanging out on my desk every day. Its construction is really solid, colors are vibrant and true, and it has a good weight to it as all Funko POP products go. Definitely a good addition to any DBZ fan's collection!",
      "rating": 5.0,
      "verified": true,
      "author": "Ross Anderson",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Item for desk",
      "text": "Got this for a gift for my husband and he loves it. He puts this on display on his desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennylyn Ork",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Excellent Figure, Worth the money!",
      "text": "I bought this Goku Funko Pop figure for my boyfriend as a birthday gift & I think he will love it! He is a big Dragon Ball fan and he only has one pop figure so far so I figured I'd help him expand his collection by getting him this Goku Funko Pop.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica B.",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "If you like Dragonball, this is for you",
      "text": "The paint job on Goku's face, especially the eyes, isn't that great. I would have only gave 3 stars but Dragonball is one of the best animes and Goku is such an iconic character that I couldn't undermine the pop for such a small reason",
      "rating": 4.0,
      "verified": true,
      "author": "TAD",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Box bent",
      "text": "My box was bent which is a huge disappointment if your a collector my display shelf is rather high so you cant tell but still! I will keep him other then the packaging being creased and bent im happy with the purchas",
      "rating": 3.0,
      "verified": true,
      "author": "Dallas S.",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "Great price",
      "text": "My son loved these for his bday and he did not take them out of the package",
      "rating": 5.0,
      "verified": true,
      "author": "Juicy K",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Excellent cake topper",
      "text": "This was great,nice price. son wanted a DB themed bday party and this worked as a cake topper and then cleaned cake off and now its his DB cartoon watchin buddy",
      "rating": 5.0,
      "verified": true,
      "author": "Seven",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Really recommend",
      "text": "Very nice Funko Pop figure, I was very glad to find it at such a good price. I gave this to my brother and he loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi ",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Gift",
      "text": "A hit with my nephew. Need too buy him the collection",
      "rating": 5.0,
      "verified": true,
      "author": "Ileana Hilerio",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Arrived Perfectly!",
      "text": "Ordered this for a friend for Christmas and everything arrived in perfect condition without any damage!",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Hackman",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Great",
      "text": "Bought for hubby's birthday. He's a huge dragonball fan. Arrived in great condition. He hopes to get more ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Devon",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Perfect!",
      "text": "It’s perfect! It’s well painted and the box it’s intact.",
      "rating": 5.0,
      "verified": true,
      "author": "Adriane Reimberg",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Goku with nimbus",
      "text": "Love this pop and its heavty because of the nimbus, came in great condition, can't complain.",
      "rating": 5.0,
      "verified": true,
      "author": "John Flex",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Product arrived squashed",
      "text": "The box in this figure arrived squashed and ruined, very dissappointed with it. The box containing the pop figure arrived almost completely torn apart, for a collector this ruins the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Margacris",
      "helpful_votes": 2,
      "publication_date": 20160709
    },
    {
      "title": "Dragon Ball!!",
      "text": "Funko + Dragon Ball + Goku = Get you money out and buy it. Its amazing and I love the quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Safn",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Not Collection material",
      "text": "So this came in two boxes obviously bc it’s a pop so it’s in its own box. The amazon box was in great shape and delivered in my mailbox by the usps. I finally opened it after having it for a while, and there is a dent in the actual Funko Pop box... annoying since I’m collecting them.",
      "rating": 2.0,
      "verified": true,
      "author": "Boo",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "get this",
      "text": "this is so cute!! i love this, its exactly what you would expect and its gonna be so lovely on my shelf",
      "rating": 5.0,
      "verified": true,
      "author": "Jayme Cousino",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Box was destroyed",
      "text": "Figure is exactly as shows but the box was destroyed which sucked since I bought it as a collection item for a xmas present.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole B.",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Perfect for Fan",
      "text": "Bought this for my nephew and it was a great size to display in his room.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Villien",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "My Grand daughter loved this for Christmas gift",
      "text": "My Grand daughter loved this for Christmas gift, the color is better than in the picture, and the detail is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Perfect",
      "text": "The paint job is very clean and makes the perfect gift for a friend! When the package arrived I was so excited. My best friend loves DBZ! Nothing was bent or broken. The packaging was flawless!",
      "rating": 5.0,
      "verified": true,
      "author": "V. Guerrero",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Just one bad thing",
      "text": "It was literally all I was looking and searching for, the only complaint I have is. The box came banged up in one corner. So now technically it won’t be a perfect condition collectible",
      "rating": 5.0,
      "verified": true,
      "author": "Santa Rivera",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Plus Nimbus !!!",
      "text": "Man you have to have young Goko in yo collection",
      "rating": 5.0,
      "verified": true,
      "author": "Corey D Jones",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Almost perfect",
      "text": "This was a gift. It looks great and is the same quality of other Funko POPs I have bought. The only problem was after unboxing, his staff was a little bit bent. It is barely noticeable though.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah Hill",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Excellente product",
      "text": "I recommend this product, excellent quality and it looks like the one in the picture! I am satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana M.",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Awesome Goku",
      "text": "Bought this for my son who loves Dragonball. He loves it. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Carleenie",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "I love it",
      "text": "Wonderful just wonderful fast shipping thank you thank you I'm am so happy with it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mufinman",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Exactly what was described.",
      "text": "Goku is great. My wife and I enjoy him watching over the game room.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander C.",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Goku in the sky with diamonds",
      "text": "Honestly surprised this one wasn't more expensive since it came with the Nimbus. Love mine! Stands on his own and looks awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "DOnny Morgan",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Perfect Gift",
      "text": "Received this item very quickly due to prime shipping. I got this as a Christmas Gift and I mean Funko POP these are perfect Christmas Gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "lilb0yamp",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great POP!",
      "text": "Came before I expected and in great condition. I love this little guy. Honestly one of the coolest POPS I have, Dragonball fans should definitely pick this one up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Great quality",
      "text": "I bought this for my sons birthday back in November. It is so cute! Its light weight and not too big. I can't find them anywhere else but on amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "anna s.",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Great price for a great mini statue",
      "text": "Came in, in a secured box with bubble wrap around the Funku POP box. Great price for a great mini statue.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivanfedor",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Decent",
      "text": "This pop Funko is infact real. It came with one or two scratches on the box but I'm not a box collector so it's fine. Overall decent",
      "rating": 4.0,
      "verified": true,
      "author": "Josue rivera",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Bought as a gift.",
      "text": "I bought this as a gift for my husband. Goku's paint looks great other than a part of the staff near his hand that is flesh colored.",
      "rating": 5.0,
      "verified": true,
      "author": "T. G. Hall",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Love it!",
      "text": "Big fan of Funko Pop and a bigger fan of Goku. Great addition to the collection!!",
      "rating": 5.0,
      "verified": true,
      "author": "Zach Johnson",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Great figure for any DBZ fan",
      "text": "High quality vinyl figure and looks great, perfect addition to any collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Stokes",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Still pretty cool and great",
      "text": "Mine was misspelled on the box. I don't know if that's a large production error or what. Still pretty cool and great quality",
      "rating": 4.0,
      "verified": true,
      "author": "Jacky Anderson",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Dragon ball rules all",
      "text": "Came Quick no box damage or anything. The figure is awesome too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Williams ",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "ADORABLE",
      "text": "It is a really adorable pop although mines came in with some dents :(",
      "rating": 5.0,
      "verified": true,
      "author": "Aylena",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Need more quality control",
      "text": "Came destroyed and was already opened and did not look new. The packaging was better then I usually get and its obvious it was already like that and they just sent it out.",
      "rating": 2.0,
      "verified": true,
      "author": "Zack W",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Box terrible",
      "text": "the box came in totally broken, as a collector this it's terrible",
      "rating": 1.0,
      "verified": true,
      "author": "Diego Munoz",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Good Quality",
      "text": "The box came in perfectly fine and the figure is amazing, good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Received a used one",
      "text": "Received a used damage one. Box had been opened previously and there was damage to the character.",
      "rating": 3.0,
      "verified": true,
      "author": "just me",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Makes you wanna blast out a Kamehameha!",
      "text": "I bought this for my cubicle at work. In a world of screens and different technologies, Goku and his flying nimbus are a pleasant sight to catch when you're walking buy. Quality is OVER 9000!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nerdventurous",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Five Stars",
      "text": "Great Christmas gift. Glad to find it when I needed to. On. Made a good gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Super cute!",
      "text": "My daughter loved it! She is crazy about Dragon Ball",
      "rating": 5.0,
      "verified": true,
      "author": "Pati",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "One Star",
      "text": "Came with the cloud and feet broken off from together.",
      "rating": 1.0,
      "verified": true,
      "author": "Big D 88",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Don't get this!!! Head popped off first ...",
      "text": "Don't get this!!! Head popped off first night! And I bought it for a birthday party to a little boy. He was devastated!!!",
      "rating": 1.0,
      "verified": true,
      "author": "M. Shizzle",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Great for the collection",
      "text": "Great POP. I have both the Bulma and the orange suit version of this POP. Great for any collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Vedran Simic",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Good classic model",
      "text": "It's a good pop figure, would recommend for people like dragon ball",
      "rating": 5.0,
      "verified": true,
      "author": "kurogane",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "paint job looks good, box came in perfect condition",
      "text": "As described, paint job looks good, box came in perfect condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Warner",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Goku's worth getting",
      "text": "Arrived early and exactly as described. Great pop! Would recommend this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "The color was faded when it arrived and it looked ...",
      "text": "The color was faded when it arrived and it looked as if it was second hand. Do not buy this item",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "Poor quality in painting",
      "text": "It’s cute and everything But, the painting it’s really bad. That’s a shame. Especially to give as a gift to someone. mine came with a pink stain, and several little stains it looks like there were other stains and someone passed a pen on it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Got A Replacement - Not Worth It",
      "text": "This is my second time buying this same pop. After the first one came damaged, I filed for a replacement and this one definitely came worse. Weird cause it was even bubble-wrapped... I'll just stick with a refund this time.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Breaks easily",
      "text": "Broke so easily! Barely dropped and legs popped off from base and can’t even glue back on. Didn’t last a week :(",
      "rating": 1.0,
      "verified": true,
      "author": "jonathan",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "very cute",
      "text": "bought this for my bf and he loved it! nothing was damaged and the box was in perfect condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Buy it!",
      "text": "The box is bent in a few places. However, Goku's paint job is nearly perfect. I love him!",
      "rating": 4.0,
      "verified": true,
      "author": "Rae",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "So cute",
      "text": "I got it for my boyfriend and he loved it!! It is so cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Akina",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Box was dented and up in further inspection the item ...",
      "text": "Box was dented and up in further inspection the item itself had weird white markings on the cloud and the back of its head. Marks could not be removed with washing and were not noted on original order.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Hoffman",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Awesome! 😄",
      "text": "This POP! figure is so cute and surprisingly detailed. I would recommend it to any Dragon Ball fan out there who loves kid Goku!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Terrible condition",
      "text": "Disappointed. I usually never write reviews. The box came out in terrible condition as it came crushed and there are creases around the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Andres Arellano",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "bad quality control",
      "text": "purchased as a gift for a friend. showed up with paint defects on the face of figure.",
      "rating": 1.0,
      "verified": true,
      "author": "Arkham-Inmate-0801",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Great Condition",
      "text": "Figure came out undamaged and box was intact with no dents or markings.",
      "rating": 5.0,
      "verified": true,
      "author": "Crazy31",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Perfect! If you want this intact order with something ...",
      "text": "Perfect! If you want this intact order with something a little bigger and you will get it in a box but if you order by itself it will be bubble wrapped and no bueno",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Estrada",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Box was damaged, obviously before shipping. Since it ...",
      "text": "Box was damaged, obviously before shipping. Since it was a gift for a DBZ fan, the box didn't matter in this case.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Good Funko",
      "text": "They are original... I was worried about it. But I like so much. The box is in good condition.",
      "rating": 5.0,
      "verified": true,
      "author": "CONELI B. ",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "As a fan for 20+ years, I LOVE IT",
      "text": "Bringing loads of childhood memories to life in a small way.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Disappointed",
      "text": "Item came with scratches in it. Was disappointed because this is a gift for my boyfriend who loves collecting anything related to dragon ball z. Will definently be buying another one somewhere else.",
      "rating": 1.0,
      "verified": true,
      "author": "Shay Pierre",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "this figure is very nice and good quality",
      "text": "Other than USPS basically destroying the box, this figure is very nice and good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Cobb",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "He loved it! The price was great and shipping was ...",
      "text": "This was a Christmas gift for my brother. He loved it! The price was great and shipping was prompt.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Nicole",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Great Product",
      "text": "It came in perfect condition and the packaging was good. My boyfriend loved it a lot for his Christmas present :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqulin Thornton-schmitz",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Great quality and super cute",
      "text": "Bought it as a gift for my boyfriend, he loves it. Great quality and super cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Bought As A Gift!(:",
      "text": "I had bought this as a birthday present for my husband last year and he loved it! Another one for his collection!",
      "rating": 5.0,
      "verified": true,
      "author": "stephthemom",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Very cute",
      "text": "I buy this to my bf, its very nice for a present. He is a big dragon ball fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Mels",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Best gift for an anime love",
      "text": "Got it for my boyfriend for Christmas.... he LOVED it",
      "rating": 5.0,
      "verified": true,
      "author": "Jermya Stephens",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great Figure for  DBZ Fan",
      "text": "Greate figure im dragon ball z Fan i feel that the box was opened in the process. I dont know.",
      "rating": 4.0,
      "verified": true,
      "author": "JIMCAS",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Four Stars",
      "text": "I like it because is Goku but the paint job could be a little better.",
      "rating": 4.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "It's kid Goku",
      "text": "Paint job is good and the box it comes in is really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Awesome pop. Some paint issues",
      "text": "Awesome pop. Some paint issues, but its too cool to not like even with its flaws. Great for any dragon ball fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Soto",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Cutest little Goku",
      "text": "Bought it as a cake decoration. It was the perfect size for the cake and my brother loved it. This little Goku is super cute.",
      "rating": 5.0,
      "verified": true,
      "author": "MARIA",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Four Stars",
      "text": "It came damaged in the package so that was a bummer.",
      "rating": 4.0,
      "verified": true,
      "author": "Dirigible Occult",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Item water damage",
      "text": "Box came with a little water damage and the name was faded",
      "rating": 2.0,
      "verified": true,
      "author": "Lisandra Raquel",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Great gift",
      "text": "I loved it..it was exactly as i expected it was a gift and it was perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Araceli Franco",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "lovely",
      "text": "this was a present for my boyfriend and he loved it, perfect for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Florangel",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "So awesome!",
      "text": "I love this series so I really liked the bobblehead. Delivery was fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel marquez",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Five Stars",
      "text": "A really nice gift for my dad. I'm happy he liked it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaira",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Looks great and came in great condition",
      "text": "Totally worth it. Looks great and came in great condition",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo Arnold",
      "helpful_votes": 0,
      "publication_date": 20170330
    }
  ],
  "product_meta": {
    "title": "Funko POP Anime: Dragonball Z - Goku & Nimbus Action Figure",
    "rating": 4.8,
    "feature_bullets": [
      "From Dragonball, Goku, as a Stylized POP Vinyl from Funko",
      "Stylized Collectable Stands 3 3/4 inches tall on Top of the Nimbus Cloud, Perfect for any Dragonball fan",
      "Collect and Display all Dragonball Pop Vinyl's"
    ],
    "specifications": {
      "Item model number": "691025",
      "Date First Available": "October 28, 2019",
      "Manufacturer": "FUNKO",
      "ASIN": "B07ZP7P9NW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Collectible Toys",
      "Toys & Games"
    ],
    "price": 8.78
  }
}