{
  "website_summaries": [
    {
      "verdict": "This budget-friendly adjustable weight bench will continue to serve you well for an extended period of time.",
      "pros": [
        "Boasts a true weight capacity of 800 pounds",
        "Includes an adjustable leg hold-down bar that is removable and provides extra stability during workouts",
        "Bench can be folded for convenient storage",
        "Features a 12-position adjustable backrest",
        "Sold with a 1 year manufacturer's warranty"
      ],
      "cons": [
        "Lack of seat padding can make it uncomfortable to use the bench for prolonged workouts"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great dumbbell weight bench",
      "text": "Disregard all the reviews about the seat or back being to narrow -- this newer version is plenty wide. I wouldn't want it any wider or it will start interfering with full arm motion during workouts. I'm 6'3\", 250lbs, and I have zero problems (at least so far) with it's build quality, stability, size, etc. I also don't know why some reviewers mentioned it won't lay flat -- it most definitely does. You just have to extend the leg under the seat part properly and then the whole bench is horizontal/flat. Definitely seems to be good enough quality, and it's a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "C. PilotTop Contributor: Kayaking",
      "helpful_votes": 752,
      "publication_date": 20190728
    },
    {
      "title": "RESEARCHED DOZENS OF BENCHES, THIS IS YOUR BEST OPTION!",
      "text": "I researched dozens of adjustable weight benches on Amazon until I was sick of them. I ultimately decided to purchase this one. So should you! It arrived in professional packaging with instructions and tools, etc. I am not handy at all, and I assembled this bench in about 30 minutes without any help! I've used it for several workouts, and it is everything that a proper weigh bench should be. It is comfortable, it is durable, and it is high quality. When you rest heavy dumbbells on it for a few minutes then remove them, it does not leave marks on the soft material. I love it, and I urge you to buy this one now!!!",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 679,
      "publication_date": 20190316
    },
    {
      "title": "Most Comfortable Bench Ever",
      "text": "This weight bench is top of the line quality that's very much comparable to the expensive gym centers. I like to lift heavy weights and this bench doesn't bulge one bit with benching over 350 lbs. Fell very secure and safe under heavy weights while working out. Love the easy adjustments from benching, to inclining, to declining. No matter the position or weight load, this bench is top notch. The comfortability is incomparable and is much better than the benches at the gym. Wish I could use my personal bench in the gym; that's how much I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karanta",
      "helpful_votes": 643,
      "publication_date": 20190131
    },
    {
      "title": "Bench is too narrow, I feel like I'm going to fall of one of the sides!",
      "text": "I picked this bench after review several others. After using it consistently for the past few weeks, the part of the bench your back goes on feels very narrow and I feel like I'm going to fall off the sides. I'm an average size, 5'9\", 170 so it's not me. I would not buy this bench again.",
      "rating": 1.0,
      "verified": true,
      "author": "nyran20",
      "helpful_votes": 399,
      "publication_date": 20181021
    },
    {
      "title": "Mine Came Damaged",
      "text": "Its a nice sturdy bench, the kind you would want supporting you; however mine came with some ugly damage done to it as you can see in the pic. Not sure how this happened but i do know the box arrived undamaged so it mustve happened before it was packaged. Poor inspection standards.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 335,
      "publication_date": 20190909
    },
    {
      "title": "Arrived in terrible condition",
      "text": "Just opened the box and the bench seat was ripped and sliced in multiple areas...",
      "rating": 1.0,
      "verified": true,
      "author": "HP#1",
      "helpful_votes": 306,
      "publication_date": 20190402
    },
    {
      "title": "Folds up very compact and feels very sturdy",
      "text": "This is exactly what i needed. Was about to buy the bowflex bench then decided to search a little more and found this guy. The folding up aspect is huge for me since I am pairing this with a fold up PRX performance rack. The size is fine though I wish the shoulder area was a little wider. It feels very sturdy and if you adjust the leg brace part to where your ankles are, I don't find it uncomfortable at all. If anyone is still uncomfortable, you can always buy some foam pipe insulation from your local hardware store to add more padding.",
      "rating": 5.0,
      "verified": true,
      "author": "B Franklin",
      "helpful_votes": 430,
      "publication_date": 20171012
    },
    {
      "title": "What a bummer",
      "text": "I just received this in the mail moments ago and put it together, there is a large (paint?) stain on the seat as well as some on the back rest. And the hardware is rusty. I'm so frustrated because I know I'm going to have to take this apart, repackage it and return it through ups. I wish the quality control was better, this had good reviews so maybe I just got the lemon. I will update my review once I get this figured out.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbers",
      "helpful_votes": 356,
      "publication_date": 20170721
    },
    {
      "title": "Leg holder has a defect that prevents it from being assembled and bench doesn't lay perfectly flat :(",
      "text": "I was very disappointed when I assembled this item and last piece - leg holder has a defect that prevents it from being assembled to the bench and not so big deal but still bad - bench doesn't lay perfectly flat :( UPDATE: Buy this item only if you do not care how bad is seller or if you have very good luck, so item will come to you with no defect and you will not deal with return workflow. Do not believe to this seller replies. They will never answer your email and will never replace broken item. Going to return this stuff.",
      "rating": 1.0,
      "verified": true,
      "author": "Assarin",
      "helpful_votes": 292,
      "publication_date": 20170525
    },
    {
      "title": "Great depending on use and size of the person - See video",
      "text": "Hello! I’ve used this bench for 3 months. See the attached video for a more in-depth review.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert G Clifford",
      "helpful_votes": 79,
      "publication_date": 20180402
    },
    {
      "title": "It is really easy to move around",
      "text": "This workout bench is exactly what I was looking for. It has multiple angles so you can do a lot of difference exercises. It is really easy to move around. It only took me about 15 minutes to put together (all it really is is just putting a few screws in). It is very sturdy. It doesn't rock side-to-side. There have been reviews that it doesn't lay flat...not sure what they are doing but mine is flat.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 29,
      "publication_date": 20170316
    },
    {
      "title": "Love this bench",
      "text": "Love this bench. It works perfectly since I have Powerblocks. It does incline, decline, and flat bench. Also, it's not uncomfortable to use, but remember, this is a workout bench, it's not suppose to be plush and soft. I recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 27,
      "publication_date": 20170321
    },
    {
      "title": "Fantastic Free Weights Bench",
      "text": "This is a fantastic piece of equipment with size and length that's great for a 6'2\" 175lb guy. High quality materials, large variety of positions, no wobble, incredibly easy to fold up and roll away for storage in my tiny apartment. Contrary to what some reviews have said, it DOES lay flat when both the seat and back are adjusted appropriately. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20170405
    },
    {
      "title": "Underlying Material is Cheap Wood - Poor Quality",
      "text": "The seat portion of this bench broke after two weeks of use. The material underneath the cushion is wood and that is what fractured while in use. This makes the bench unsafe and now unusable. I am disappointed in this.",
      "rating": 1.0,
      "verified": true,
      "author": "David Cook",
      "helpful_votes": 12,
      "publication_date": 20190210
    },
    {
      "title": "Fantastic bench, sturdy and versatile",
      "text": "It took be about 20 min to put together. It's sturdily built and supports my weight just fine (230 lbs.) it doesn't rock or shimmy when I use it as a stepping tool during some exercises. I bought it primarily because I'm doing Body Beast and the different back positions and craftsmanship of the bench has made it a very valuable addition to getting myself into better shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Remus",
      "helpful_votes": 19,
      "publication_date": 20170103
    },
    {
      "title": "You should buy this",
      "text": "This bench is FANTASTIC. I bought it after receiving a different bench as a gift, which I promptly returned after finding it had a 225 lb. weight limit. This item, however, has an 800 lb. weight limit, is very sturdy, and it well designed. I put it together in about 15 minutes and have used it regularly since purchasing it without issue. I can change bench positions easily so this is very useful while doing Body Beast and other programs. I have nothing but great things to say and lastly, for a bench that costs HALF THE PRICE of the one I got as a gift, I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "dlamb",
      "helpful_votes": 6,
      "publication_date": 20170614
    },
    {
      "title": "Dangerous",
      "text": "It broke within the 2 week window lucky. I was doing step-ups with dumb bells onto the seat, and the seat snapped at the middle. I was holding 2x70lb dumbbells. Thankfully, I was at the top of the step motion and recovered without a fall, but it could have been much worse. Again I didn't have to deal with customer service or this might have been an even more heated review. The bench seemed fine until this. Also, shipping the bench back was a chore because I had tossed the box so I had to patchwork other boxes around it to ship.",
      "rating": 2.0,
      "verified": true,
      "author": "Micheal Nottingham",
      "helpful_votes": 4,
      "publication_date": 20190606
    },
    {
      "title": "Arrived RUSTED",
      "text": "This product came with pre-installed rusted bolts. Has flimsy padding so if I ever have to replace it, the bolts will not remove easily. Upon further inspection, I found rust elsewhere hidden in the metal. This was a supposedly new item that SHOULT NOT be rusted upon arrival. I tried contacting the manufacturer about this and they did not respond. There seems to be no way to contact the supplier, so I am posting this negative review even though I like to give companies a chance to make things right before posting such reviews. I highly recommend people NOT BUY this item. Inexcusable condition!",
      "rating": 1.0,
      "verified": true,
      "author": "Ben S.",
      "helpful_votes": 2,
      "publication_date": 20201009
    },
    {
      "title": "Too Narrow? Re-attach the backboard rotated around!",
      "text": "Fantastic bench for the COVID home gym. Light yet sturdy. For those of you who find the bench too narrow for bench presses: take an Allen wrench, remove the backboard, flip it around (pad still facing up but the narrow section of the pad with the logo faces toward the seat pad- see photo). The pad will be much wider where your shoulders will be. After doing that, I had no issues with bench pressing!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Allen Corliss",
      "helpful_votes": 3,
      "publication_date": 20200720
    },
    {
      "title": "Close to perfect!",
      "text": "Excellent buy, more pros than cons. The fact of the metal frame is sturdy, the convenience of the wheels makes it easier to move and the lower storage profile when folded makes it take up less space than others that are thicker. However the thickness of the bench rest feels unsturdy, when I lean to reach for a weight off the ground while sitting, it feels like it could snap at any moment, as if the core material is made of plywood. I noticed is the cushion should be thicker and the bars that help anchor your feet would need softer cushions instead of rubber coating. Work great none the less, just need to make adjustments.",
      "rating": 4.0,
      "verified": true,
      "author": "JohnNite",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Great for Home Work Outs",
      "text": "While all the gyms are closed, I wanted to be able to exercise at home, so I got this bench to help with that. It took a little time to get to me since I'm sure they were back ordered due to COVID, but once I go it, I was pleasantly surprised at the quality of the bench. The assembly was fairly straight forward. I like that it folds up pretty flat so I can lean it up against my garage wall to keep it out of the way. Raising and lowering the back is simple and very smooth and the wheels make it easy to move around. It's been a great investment for me and my family to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Honest Frizz",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "It is very uncomfortable.",
      "text": "I bought this bench primarily to do sit-ups. This bench is very uncomfortable to the point that I could not use it, and returned it (cancelled my order). I could not reach the foot support at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Manny Castillo",
      "helpful_votes": 6,
      "publication_date": 20180709
    },
    {
      "title": "Great Bang for the Buck",
      "text": "Transitioning from commercial gym to home gym. Have 30 years of experience with weight benches in the gym. For the money, I don't think it gets any better. The bench is highly functional, sturdy, and stable. That said, I do have one gripe - the padding does not provide level of comfort I've grown accustomed to in the gym. The jury is still out on the durability of the canvas and padding the seat and backrest are wrapped in. Hopefully it doesn't prematurely start degrading with use. In closing, great bench, I'd buy it again in a pinch, but would opt for more comfort (padding) given the opportunity of shopping in an ample supply market. Hope that helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Schwartz",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Stable, strong, durable",
      "text": "Heavy duty, with a 800# capacity, I was looking for an affordable adjustable bench. This thing is great. I have been using it for 3 years with not a single problem. I am a big guy. No shakiness or sturdiness problems at all. Completely stable doing incline bench, dumbell flies, you name it. Underload or not, you feel completely safe and stable. Great purchase and I'd buy again in a heartbeat. I do not know where these reviews claiming that the bench is flimsy or it breaks easy are coming from. No 140 pound kid is going to crack the corner of this bench. Lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Exceeding Expectations",
      "text": "This bench was without question one of the easiest put togethers and works flawlessly for all my lifting. The product arrived in a timely manner and I had it put together within fifteen minutes. The brackets make adjusting to different inclines and declines very fast and easy. Furthermore, the bench is extremely stable in all positions and I have yet to feel it wobble or buckle while in use in any sort of context. I highly recommend this bench to anyone who is looking for a sturdy and stable workout bench with adjustable positions. You wont be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20170314
    },
    {
      "title": "Junk",
      "text": "You get what you pay for I guess... description states it can hold over 800 lbs. I weigh 150 and have the powerblocks (max weight 180) yet somehow the seat broke. Maybe the metal frame can hold 800lbs but the actual seat and back dont seem to be on the same standard as what they claim. The seat broke a few months after purchasing and I've been trying to make due since then. However the lack of support in the seat is causing issues as I increase in weight and I nearly injured myself when the whole thing toppled over because of the poor weight distribution now that the seat is broke.",
      "rating": 1.0,
      "verified": true,
      "author": "dionysos",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Not for serious lifters",
      "text": "I bought this bench mainly because it was one of the few available during this covid 19. I am very disappointed. It is barely acceptable as a bench for lifting. The dimensions on the bench are odd. On the one hand it is long and wide, like it was made for big lifters. On the other hand it is way to flimsy to support anything serious. Fortunately I have a partner (female) who this will work for - because it barely fits me. NOT a product I would recommend for any serious lifter.",
      "rating": 3.0,
      "verified": true,
      "author": "Luther Stephens",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Great bench for something simple for free weights",
      "text": "I was just looking for a simple bench to do some free weights on and this worked perfectly. It is not the most comfortable if you plan on sitting on it like a chair for hours, but that is not the purpose of it. Works for all the positions I need and like that it folds up well enough to put in the closest. If you are looking for a simple bench for dumbbell or free weights this works great for the cost. I am happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay M",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "It was missing the leg holder. The only option ...",
      "text": "It was missing the leg holder. The only option is to fully repackage it and send it back to Amazon for a refund. It stinks to spend the time to set it up and realize an important piece is missing.",
      "rating": 1.0,
      "verified": true,
      "author": "Joel Reichert",
      "helpful_votes": 9,
      "publication_date": 20180105
    },
    {
      "title": "Great Value",
      "text": "PROS: Mostly pre-assembled. Took five minutes to get three more parts on. Very stable and sturdy. Convenient, hidden wheels. Folds up nicely and stands firmly against the wall. CONS: The pleather is going to breakdown, as they all do, over time. This low cost item has cheap material so, wipe it down to prolong its life. Sweat will eat away at it until it flakes, cracks, and tears.",
      "rating": 5.0,
      "verified": true,
      "author": "OK",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "This is the Bench",
      "text": "After buying the Flybird bench and realizing how small bench was I returned for this Fitness Reality bench...WAY BETTER ALL AROUND! Bench is made for all size users, multiple adjustments, decent pad & good construction. Simple to get together out of box. No issues, good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ella Bella",
      "helpful_votes": 2,
      "publication_date": 20200819
    },
    {
      "title": "Bad packaging!!!! Good enough for the price.",
      "text": "Bench is worth what it is $80. But why can't they just package it better. Several problems. The feet slide around in the box and scratches things. The bottom of the cushion was ripped because of it. Also the worse is the styrofoam stains all over the back cushion, you can't remove the stains. I've tried scrubbing it. Also, of course the zip lock bag of accessories, seriously? Zip lock? It bag broke and I was missing 3 washers which I had to go find from my tool box to replace. These are easy fixes, I don't get why they would do business this way.",
      "rating": 2.0,
      "verified": true,
      "author": "TKO",
      "helpful_votes": 3,
      "publication_date": 20180507
    },
    {
      "title": "absolutely love it. It's functional",
      "text": "For the price, absolutely love it. It's functional, simple, and sturdy. I'm 260lbs and feel that it supports my weight well. As others have mentioned, it would be a nice addition if the foot/ankle rest had foam. If you were to use this for sit ups as-is, it would be a little painful. Only other issue for me personally is the gap between the seat and back rest when using flat to decline. It's a little wide so your butt either sinks in to that spot. If not, you would feel that gap of no support during lifts. It met my budget and expectations so I have to give it 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 5,
      "publication_date": 20170105
    },
    {
      "title": "Solid bench!",
      "text": "If you decide you want a solid bench and are willing to put up a few more dollars over something cheaper... I promise you won’t be disappointed! This bench is sturdy, well constructed, and built to last. Since COVID I’ve been scurrying to put together a home gym— on a budget— and since I’ve overpaid for fitness related equipment many times in recent months... it’s a good feeling to know I scored a rare gem at a fair price with this bench! I paid $120 if you’re curious,, and well worth it 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Excellent bench, not for super heavy lifting.",
      "text": "Excellent home use bench for us regular guys. Feels ok when using free weights - up to two 40lbs dumbbells. At 50 (100lbs), I feel it rocks a bit but it could be me! The gap is not an issue for me....appears to be only an aesthetic concern. Extremely easy to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "Mazariegos",
      "helpful_votes": 2,
      "publication_date": 20200601
    },
    {
      "title": "Very happy with the product and would buy it again if ...",
      "text": "The bench came almost ready to use, just two base posts and the leg bar had to be screwed in. I had it ready to use from the box in10 minutes. Very impressed with the quality of metal and the welds for the incredible price of $105 with delivery! Started using it right away and it makes a huge difference in my workout. Certainly not a professional quality, but I am 5'6\" 175 lb and 77 so for my purposes more than enough (training more for repetitions rather than top weight). Very happy with the product and would buy it again if necessary. The bar holders also from Amazon, sturdy but light and easily movable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ahango",
      "helpful_votes": 3,
      "publication_date": 20170924
    },
    {
      "title": "Good.",
      "text": "Quality looks pretty good. Only complaint is that the seat is wide. The problem of a wide seat is, if you do sitting curls, shrugs, etc... the dumbells hit the side of the seat. I can see after a year, it will start tearing the vinyl. I assume they put in a wide seat because this is a multi functional bench. It also can be used for a sit-up bench, thus the wide seat.",
      "rating": 3.0,
      "verified": true,
      "author": "bahhhoo",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Good, but could probably be made more compact and revised in general",
      "text": "The front and back leg go out quite a bit, and in my opinion they could be revised to still allow the same levels of adjustability while making the bench more compact. Also, the front leg goes so far forwards that I have to be careful coming off a heavy lift to make sure I don't accidentally drop my dumbbells onto it and smash a finger or dent the leg. As others have said, the leg bar on the front for doing sit ups is only good as a torture device, but with some towels/extra padding it's passable. The wheels on the back leg are a great plus.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin H.",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "I Can't Say Enough About This Product",
      "text": "I originally bought this while shopping on a budget. I have to say, for the price I paid, I cannot be happier with this product. It was extremely easy to assemble and has held up great. I thought I was buying a cheap bench, turns out this is the number one piece of workout equipment I use and holds up to anything. Very durable, extremely stable and it easily adjusts and without any hassle. Very mobile for moving around for different exercises or to just get it out of the way. Overall I'm very happy with this product and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "jason sparks",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Great quality, very sturdy",
      "text": "I just got this put together in my workout room. It's made of good quality and is very sturdy. Easy to put together; however, I definitely recommend to scan the code they provide rather than following the directions in the book. The code provides you with 3 YouTube videos that follow one another for easy assembly. The directions in the book seemed to be way more complicated and not easy to decipher what/where you should be looking at and attaching the items. Lots of positions for making my weight workouts comfortable and easy to switch between the different exercises. I would recommend this to anyone that is looking for a good quality and easy to use weight bench.",
      "rating": 5.0,
      "verified": true,
      "author": "It's Me VC",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Seats too high can’t keep feet on the ground",
      "text": "For a $100 workout bench during covid life it’s fine but during normal times I’d say pass up this bench. I’m 6’ and the seat is wayyyy too high above the ground. In the flat position my feet cannot stay on the ground. Incline it’s bearable. The seat is way too wide, too. It’s balanced and I don’t feel like it’s going to topple over. Padding is pretty good though. The various angle positions are a nice feature. Breaks down for easy storage which is also nice. Definitely gonna take some getting used to though",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great Value",
      "text": "This bench is a great value got it around $90 it holds up to 800lbs which is a lot for the price most other benches you find for around this price will only hold around 350 to 500lbs. The seat is alittle wide though and does not adjust must the feet for the seat has 2 slots you can put it on flat and slight incline. I've been using it for all my work out and it is stable which is very important when your weight lifting. Overall love the stability and incline and decline of the bench would purchase again if I needed one.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Decent workout bench at a great price",
      "text": "Overall this is a quality product. Mine came well packaged and suffered no shipping damage as other reviews have indicated. Assembly was quick with the included wrenches, and the bench is stable and sturdy. I subtract one Star because the gap between the backrest and seat is rather wide and when using flat, or worse in decline, presents a lack of support right at the small of my back. I have solved the problem by using a small towel in the gap - but they could have easily engineered it better to avoid this issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew R. West",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Good for the price",
      "text": "For $95, this is a solid bench. However, keep your expectations in check. This feels like a lower quality bench and I would be very hesitant to actually test the 800# weight limit. But for the average user this will be fine. Adjustments are easy, bench doesn't wobble when in use. Bench sits very low to the ground which is nice. It does feel very hard when you're laying on it, but can't really expect much more from a bench in this price range.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Stop whining!",
      "text": "I’m sick ov these guys whining how it can’t handle 500 or 600 lbs, if ur lifting that kind ov weight, get a bigger bench/more suited for power lifting. If you lQQk at the pic sure there’s 800 lbs on their but the weight is spread out,like spreading ur body weight on ice, so the weight is not concentrated in one area. You can probably add more weight, all in all it’s a good all around bench.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan S.",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Good Product, Great Value",
      "text": "This was the best value I could find on a basic weight bench. There are several incline angles, a decline angle, and the bench folds up for easier storage. You probably won't be able to fit it under your bed but it's nice to be able to fold it and lean it against a wall or put it in a closet. About the only real negative I can think of is it has a fairly wide (2.5\") gap where the bench inclines when laid flat. It hasn't been a big deal for me though. If you're looking for a good weight bench at a great value, I definitely recommend this one.",
      "rating": 4.0,
      "verified": true,
      "author": "S B",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "So far we love it. We have not been using it very ...",
      "text": "So far we love it. We have not been using it very harshly; mainly for abs and some curls (sitting on it.) We are low to mid-weight, but this bench seems to be sturdy and firm on the ground! The price was right too and it has several settings. It could use more padding on the part you put your feet on to do sit-ups. We have improvised and added a loose pad to each foot as we work out, but eventually we'll need to find a way to - permanently, wrap something around it. Other than that, it is worth your money and it loos very nice too!",
      "rating": 4.0,
      "verified": true,
      "author": "anakonda",
      "helpful_votes": 2,
      "publication_date": 20170807
    },
    {
      "title": "Great for the price.  Made a seat incliner to make it perfect.",
      "text": "Only thing that was missing was a way to incline the seat upward for when I recline the back down. This makes powerlifting incline bench presses a ton easier because you won't be sliding down the seat. To get this functionality pre-built into the bench itself you're looking at a price jump of at least $100. So I made my own out of plywood and schtuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Davers",
      "helpful_votes": 2,
      "publication_date": 20190305
    },
    {
      "title": "This bench has been improved compared to some of the 1-star reviews. Very good design now.",
      "text": "I almost didn't buy this bench because of the rating and video from Steve that showed the seat having been broken when his 140 lb. son sat on the edge. Compare my photo to his video and you will see that the design has been improved to avoid this weakness. The bracket is wider now and should have been this way from the beginning. Not rocket science. My bench arrived this week and I was greatly surprised by how heavy-duty it is. Great design for changing the back angle, comfortable: seems nearly gym-quality to me. Maybe doesn't fold up as small as some, but still pretty easy to store. See second photo.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert E.",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Very satisfied and a great price",
      "text": "I have had the bench for a few weeks and have been very satisfied. It is very sturdy, especially if placed on top of a floor mat of some kind. One piece for the ankle bar was damaged and the company replaced it immediately. I would recommend this item to anyone trying to set up a home gym without spending a ton of money. Only downside: the 4th \"notch\" for reclining is missing, and I often find myself wanting to use the bench at that angle. I assume this was a cost-saving design. Overall very happy with this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Rickels",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "A very good bench at a great price",
      "text": "This bench was a great addition to my home gym. It was easy to install and doesn’t take up too much space. It easily supports my size (5’10 175) and the weight I have put on it (maxe; out woth 60 pound presses- highest weights I have). The flat and incline are very good, the decline isn’t great though. The bench cna also be used for step ons. Definitely a good value",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Kass",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Broke seat within 1 month.",
      "text": "Bought for the low price. This is one of those sad cases where the value proposition didn't work out. (But sometimes it really does, folks ... see my other reviews). Within a month I broke the front corner off of the seat just by sitting a little off kilter while finishing an exercise. It's just particle board with a little padding, tiny staples and elastic/plastic, of course. Oh well, will try moving up to mid-grade quality next.",
      "rating": 2.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Very happy with this upon delivery/assembly",
      "text": "Very happy with this upon delivery/assembly. Excellent price, good sturdy quality for a foldable home bench (don't expect professional gym-level sturdiness or pad thickness), moves around on rollers on one side, folds neatly underneath by bed when not in use (lack of space at weekend home was major consideration in purchasing a foldable bench). No issues with initial shipping, QC, assembly, no unusual smell. Plan to update this review after medium terse use/wear and tear. Again, this is not as well padded nor as sturdy as the equipment in your gym, but I will not be using it every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Good product, customer service missing.",
      "text": "Bench is great, easy to assemble, sturdy and value for money. Customer service is third rate. Seat arrived broken (Ace Venture delivered it) so I followed the details to contact them and order a replacement, week and half later no response so called only to find that they are not taking calls due to the current situation. Leaves me with a broken seat; to hard to repackage and return so it is what it is. Shame as the product is good",
      "rating": 2.0,
      "verified": true,
      "author": "RGB",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "great for the price",
      "text": "a lot of reviews out there that say the bench wasn't level after they put it together... I didn't have that problem. was easy to do, and fine when it was done. Look, it's not as padded as a bench at the gym, but it's comfortable. I don't know if i'd feel comfortable jumping up and down on it like a bench at the gym, but you're probably not going to be doing that at home. It's perfectly sturdy for the lifting that you and I will be doing. It's light enough to easily move around, and compact when you need to put it away. it's a good bench at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "goldnboy",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "it works",
      "text": "I weighed 330 when I bought this and starting lifting with 30lbs on each arm so close to 400 lbs, absolutely no issues what so ever. It is easy to setup, move adjust, and store. I keep it in the closet in my room and will set it up first thing in the morning before work. never any struggling or discomfort with setup. It is a solid and fantastic item and I am very surprised for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "ZAC",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Solid, no-frills adjustable lifting bench.",
      "text": "This is a pretty basic adjustable bench, with a back that adjusts from flat horizontal to nearly vertical. There are fancier benches out there, but this has everything a basic lifter would want. Construction is solid: all welds look good and the design puts major stresses on solid components rather than joints. Assembly is easy; all I had to do was mount the crossbars that form the base, and the footrest. One of the crossbars had little roller wheels. These might be useful on concrete, but they are too small to be useful on carpet. Regardless, the whole bench doesn't weigh more than 30lbs or so, so it's pretty easy to just pick up and move as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20170723
    },
    {
      "title": "Do NOT buy this product. It can cause injury!",
      "text": "Absolutely do NOT buy this product!! I was almost seriously injured because of this bench. On of the brackets that supports the adjustable seat settings broke off while I was using it, slamming me down and causing me to nearly drop 50lb weights on my head. Better yet, I had to pay $36.37 for a box at the UPS store to send it back because I didn’t have the box it came in anymore. Thanks a lot Fitness Reality! Your product is trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie Gocken",
      "helpful_votes": 2,
      "publication_date": 20200413
    },
    {
      "title": "great dumbbell bench",
      "text": "As advertised and the customer reviews, this is a sturdy bench. I weigh 200lbs and it does not waiver when sitting, adjusting etc. Of course this bench stand alone is more geared towards dumbbell type lifting and sit ups etc, but works great with a squat rack if you want true bench press with a bar to work that in.....Assembly required is very minimal and they provide a simple wrench. Overall for the price a value added purchase. And feels as if it will last....",
      "rating": 5.0,
      "verified": true,
      "author": "peter woodworth",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "If You Are Tall This Is The Bench For You! Plus Only 4 Bolt EZ Assembly",
      "text": "Took literally 10 min to put together (4 bolts 13mm) Sturdy/Stable and best of all I fit on it - I'm 6'1 Says it'll fit people up to like 6'4\" After being duped by another product on here that took an hour to assemble and I am now stuck with that wasn't made for people over 4' tall I love this bench! Easy to adjust. It declines and inclines as well as a flat setting ( you need to adj the chair 1 notch to make it lay totally flat). I find it perfectly comfortable and folds flat with little rollers on the back to store it if you want to.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob W. PA",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "great bench for the money!",
      "text": "I put this together in about 20 min- very easy and all tools required are included. I like the padded seat and bench. It's great quality and works well and is not super heavy so easy to move around. The only issue I had is the delivery person left this by my garage in plain view in the evening so I didn't see it till the morning; someone could have easily stolen it so that would be my only feedback to Amazon but that's not the supplier's fault.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "low quality bench and non responsive seller",
      "text": "The bench feels like it will break and isn't designed so that it feels sturdy. I contacted the seller about the wobbly foot rest, but I was ignored. It has been a few weeks and no response.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200708
    },
    {
      "title": "Very impressive quality",
      "text": "I was doubtful of the what the quality and stability would be like since I got this at a price much lower than other workout benches but I’m very happy with it! It’s heavy and feels very solid and stable, like it will last and be durable. Easy to adjust, good range and folds down to a fairly slim size for storage. If you’re looking for an adjustable weight bench don’t feel you have to spend any more than this for good solid quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig C.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Flat is not actually flat",
      "text": "This is a good bench for the money. I bought this to do Body Beast. Two issues. When you lay this \"flat\" you are actually at bit of a decline which makes it uncomfortable and awkward for some moves. I wish the back were wider. A person who is wider up top would not enjoy doing any sort of laying flat presses. I think the value is there depending on what you are looking for.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "Came missing a key piece",
      "text": "I was skeptical but went for it b/c I knew I could return it with Prime. I came missing one of the stabilizers that need to be attached. Like others stated the instructions were ridiculous and figuring out how to contact them seemed like a nightmare. I also was looking specifically for a bench I could store and in the end, I went with another model that had no assembly, better storage dimensions, and better reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "BT11",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Good product",
      "text": "This seems well built and very sturdy. It folds up to about 12 inches if you intend to put it under the bed. Only complaint, like other reviewers, is that it comes with a mark on the seat. If you put wd-40 on a dry paper towel you can rub this mark off. Very level when flat",
      "rating": 4.0,
      "verified": true,
      "author": "Markus Fair",
      "helpful_votes": 5,
      "publication_date": 20170831
    },
    {
      "title": "Great value, easy to use and assemble",
      "text": "I read a ton of the reviews and was nervous about the quality, but mine arrived in great condition. The box was sturdy and the items were secured within the box with Styrofoam and tape. The bench was easy to unpack and only took about 10 mins to put together. I did a quick workout and it's easy to adjust and feels very sturdy, although I'm using it on carpet, so I don't know how it would perform on a solid surface. Overall, I'm very happy with this.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Ueno",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Decent under $100 bench.",
      "text": "over all [B]Decent under $100 bench.[/B] the back to narrow and the leg bar really needs padding. when laying down u dont feel that large crack where the top part bends up. everytime i set on this to work out it bows alittle (not bending more like. ...flexing) edited the bench is ok for under 100 but i find me self falling out of it alot when trying to lay down with heavy weights. now i fear using it thinking im going to miss my back because the back narrows to much. its alittle to long for some weighted workouts.",
      "rating": 3.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Excellent bench",
      "text": "I was pleasantly surprised with this bench. It is easy to assemble and included all of the tools necessary. It is well constructed and sturdy. I am 185 pounds, and I was able to step up onto the bench, and it did not wobble or move. The seat and back are a good size and well padded. This is a quality bench and a good addition to my home gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great addition for my home workouts",
      "text": "This bench is a good addition to my home workout, but I wish I would have read the reviews. While putting the bench together, just 2 days after receiving, I noticed the seat was coming apart in the corner. I immediately sent an email to get a replacement...72 hours later, I still haven’t heard anything about a replacement. I called the 800 number and I’m happy to report that a replacement seat had been sent, they just didn’t let me know. The new seat arrived today.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara L. Conrad",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Careful not to lean to the right or left while seated!!",
      "text": "The corner of the seat broke while trying to pick up a dumbbell. I’m 195lb clearly I don’t think it rated below that. Tried calling customer service to see what they can do, but they are always busy, go figure.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 5,
      "publication_date": 20181204
    },
    {
      "title": "If it wasn't made in America, it should've been.",
      "text": "Assembled in 5 minutes (including a quick hardware check on pre-assembly), everything is shinny new, and it is solid. The only thing I could see someone having a problem with this bench, is a few welds could've been complete rather than the stringers utilized. However, I know that a proper 1 inch stringer is more than efficient where they are used.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody James",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Great Bench, one HUGE flaw",
      "text": "In the decline position the gap between the two bench sections exposes two square metal protrusions that will stab you in the butt, lower back or other areas (depending on your build). After my initial workout, I realized that the gap actually cut my lower back in two areas. We assembled the bench and immediately fashioned additional foam padding for the foot restraints and created a foam insert to cover the previously mentions gap stabber. See pic.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Williams",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great bench for not a bad price!",
      "text": "No dislikes! 5 star product, IMHO! Likes: assembly was a breeze, adjustments are simple and easy, and it’s sturdy yet comfortable! The price drew my interest, the reviews had me give it a chance, and the product has me pleased with the value I got! I don’t know if the higher priced benches are worth the difference, but I know this gem was a bargain for my needs!",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Very Sturdy and Already Assembled",
      "text": "I bought this bench for my home gym and it is great. It was already mostly assembled in the box, you just have to attach maybe two pieces. The bench is very stable and it can incline and decline just by picking up the head of the bench. The bench has wheels on one part of the bottom so it can be moved easily. I would recommend this bench for anyone starting a home gym. Not sure how it holds up for people who are very large or weigh a lot. I am a shorter 130lb female and so it fits me just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Adshaw",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Surprisingly Good Buy - Not Sure Why All the Negative Press",
      "text": "This was a nice surprise. I wasn't expecting much here, especially after pouring over the countless negative reviews on personal/home-gym workout benches. Everything just seemed to be risky and something of a gamble. Well, at 5'6\" and 140 lbs. This thing works just fine for all dumbbell exercises I perform every other day. I even like to do decline sit-ups on it, decline bench, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "dromatriptan",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "DO NOT PURCHASE, product is completely rusty and they will not replace",
      "text": "The bench arrived with all the screws rusted. Rather than send it back I followed Amazon recommendation to contact seller: Paradigm Health and Wellness. They asked for the exact part numbers and quantity of damaged parts so they can replace them. I sent them the information for replacement which included 16 part numbers altogether. They asked for the serial number and receipt of purchase as well. It was all sent per instructions. They sent me 4 generic screws that DID NOT replace any of the damaged parts. No follow up or any type of communication to make the product whole. Customer service is non existent with PARADIGM HEALTH AND WELLNESS and now I am stuck with defective product",
      "rating": 1.0,
      "verified": true,
      "author": "WCoast",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "horrible service missing parts",
      "text": "missing hardware pack and i cannot get a hold of any rep during their work hours thus i cannot assemble.... unless customer service actually responds i won't update",
      "rating": 1.0,
      "verified": true,
      "author": "JR McCormick",
      "helpful_votes": 5,
      "publication_date": 20180516
    },
    {
      "title": "Great addition to any home gym",
      "text": "I have had this bench for about a 6 weeks and it has been a great asset to my small home gym setup. It was a snap to put together and I really love that it can be folded down (similar to an ironing board) for storage in the closet when I have guests. It does not fold down low enough to go under the average bed, but putting it an upright position against the wall in a closet is no problem. I have found it be very sturdy and repositioning the back rest is a quick maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Smith",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Great home bench.",
      "text": "This is a great bench. It’s easy to assemble, sturdy, appears to have good workmanship so far, has various incline levels, and is large enough for a big guy. (Though I’m tiny). It folds for storage. I was able to do step ups on it with no issues. I am happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Bozzo",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Solid but instructions and part labels make it easy to screw up installation.",
      "text": "Solid overall but the installation instructions aren't very clear so I dropped it to 3 stars. I put the wrong leg on the wrong side then when I noticed my mistake and tried to fix it, I found you cannot unscrew the bolts - it just spins. So, I had to keep it assembled incorrectly. A simple label on each part (part B or part C) would have immediately made it clear which leg goes where. Very frustrating start.",
      "rating": 3.0,
      "verified": true,
      "author": "Brindysam",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Flat + Incline + Decline & wheels",
      "text": "So I bought this thinking that it doesn't have wheels and that was a major detractor, but the price was right and its hits the 3 things I needed it for. When it arrived, much to my surprise it does have wheels! However, the wheels are chincy, small barely stick out past the metal bar and do not roll on the diamond mat. So every time I move it I have to drag it. The other thing that annoys me about this bench is that I'm 6'2 with broad shoulders and this does not comfortably fit both shoulders on the bench. Really like that this item is versatile and goes: flat, incline AND decline. The padding isn' t gym quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Better than I expected.",
      "text": "It was much easier to assemble that I had planned. It comes mostly assembled and you only need to put 4 screws in. I love being able to adjust both the seat and the back of the bench. I’ve been trying to be creative and use different furniture around the house to substitute as a bench, but I finally gave in and I’m so glad I did! There is ample padding and it’s easy to move around.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine J.",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Worked ok for a while",
      "text": "It was an ok bench. Nothing special. Recently after 5-6 months of use the board where I sit broken during use. I was significantly under the weight limit. My weight shifted due to the seats wobble and it appears to have split the support board on one side of the seat. Luckily I was using a light load and wasn’t injuried.",
      "rating": 2.0,
      "verified": true,
      "author": "TimT",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Excellent bench",
      "text": "For the price, this bench is amazing. I was dreading the assembly, as other benches have had a lot of parts but this bench is only 3 parts. Apart from the assembly being easy, it is study. I haven't lifted anything crazy but I've put between 500-600 lbs of combined weight on this with no issues, no buckling or shifting. For the price, this bench has a lot of value.",
      "rating": 5.0,
      "verified": true,
      "author": "Supreme Allied Commander",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "good value for the money",
      "text": "Its really been tough getting workout equipment with covid-19 issues. This bench came when promised. very easy to assemble. This is not a \"garage gym bench\". but it didn't cost like one either, rather a workout room bench. light easy to move around or fold up. it does the job. having this 2nd bench in our workout room allows my wife and I the ability to workout at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorimer",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Decline is very poor",
      "text": "The bench is decent as a flat bench (though not entirely flat) and for incline, but for decline, it is horrible. Putting your legs under the bar feels unsafe and hurts your joints. When I actually try sit-ups from a decline position, my butt is basically on the metal piece between the 2 cushions. If you've used a bench at the gym, the difference is night and day. I somewhat regret not spending a little more for a better bench.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Quality, I love it!",
      "text": "I'm very happy with this purchase. I'm 6'1\" and the height works well and supports the back of my head. Its also great for sitting dumbbell exercises, incline dumbbell presses and as a flat bench for doing dumbbell back pulls etc. It seems well designed, solid and very durable. I think the piece will last a long time and it look good too. As an older guy who has been working out with it for 3 months, I would give it an enthusiastic thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Hopefully Satisfied in St. Louis MO",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "4.5/5",
      "text": "It's a little lightweight. You can only drag it from one side (one side has wheels) or else it sounds horrendous when you drag it. I love the method they took for the adjustable backrest. Takes one second to change it and you can easily see it's locked and secure. Great, for the price. No defects.",
      "rating": 5.0,
      "verified": true,
      "author": "Tali",
      "helpful_votes": 5,
      "publication_date": 20170109
    },
    {
      "title": "Perfect bench",
      "text": "This bench is pretty awesome. I know here have been reviews that say it doesn’t go completely flat. Well it does if you change the height on the lower part of the bench. Overall this thing is awesome cause I can easily fold it up and put it away in a corner. It also has little wheels to assist you in taking it from room to room.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "Sturdy bench at a great value",
      "text": "This was super fast and easy to set up. More importantly it is really sturdy and well built. I enjoy the functionality of this product as I can use it as incline, decline, and regular flat bench. Super value I would buy this again, luckily I don’t see it ever breaking so I won’t have to. If you’re looking for a good bench seriously do yourself a favor and get this one.",
      "rating": 5.0,
      "verified": true,
      "author": "MB1son",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Better than what you'd expect for the price",
      "text": "Solid bench for $89. I just needed a bench for home and I don't have a lot of room. I saw this had decent reviews and for the price, I thought I'd give it a shot. I'm 6'1\" 265 and I fit well on it. Feels solid and stable. Honestly, I'm pretty impressed for the price point. I like the ability to collapse it and store it away too. If you're not a hardcore lifter and you need a portable type bench, this is a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Great for tall guys",
      "text": "Very good bench and fits in my coat closet with plenty of room to spare. No concerns with stability yet after 2 days of use. I’m 6’4” and love the height and length of the bench. My head doesn’t hang of the top when doing bench pressing. If you’re on the shorter side, the height might be a problem but I wouldn’t think it’s a dealbreaker given the very favorable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Brainard",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "High quality I ordered a second",
      "text": "It’s 99% assembled. You have to put two little feet on it 4 bolts total. This thing all the way down to the stainless steel bolts are extreme high quality. I bought another bench and took forty five mins to put together. This one came in and took five mins to build. I put them side by side and this was way higher quality and way more sturdy. I returned the other one and ordered a second onesie my other gym. Don’t hesitate to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "law0472",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Great Bench for the price!",
      "text": "Great bench for the price. Good bench overall. Solidly built, easy to assemble (5screws) I’m 6’4” and weigh 270 and it works well and is big enough for big guys to have full body support. It’s not uncomfortable but a little more padding might work better for some people. Also I’d like to see another bracket welded in the large gap to add another angle.",
      "rating": 5.0,
      "verified": true,
      "author": "Titepants",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Over all good..little bit narrow for fat guys/gals!!",
      "text": "So, product itself is good, looks nice, easy to assemble and move around, multiple work outs can be done..I overll like it. One think I did not like about this product is its flat width. If you are more than 200 pounds, and trying to lay down flat on it, I guarantee 60% of your back is going to stick out; and it might hurt your spine. If you are a skinny guy or girl, I definitely recommend this product. I’m kinda skinny, so it works perfect for me. If menufacturers can increase its flat surface a little bit, this bench is definitely gonna rock the market.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Neupane, K",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Amazing Bench especially for the money",
      "text": "Amazing Bench especially for the money! Does everything I need for my home workouts especially Body Beast when I can't go to the gym due to my kids. Does decline, incline, and best of all folds flat and rolls for easy storage!!! Highly recommend this if your into lifting. I wish I would have ordered this 2 years ago instead of using a stability ball. Very sturdy and stable!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael Story",
      "helpful_votes": 3,
      "publication_date": 20170901
    },
    {
      "title": "Great Bench!",
      "text": "For the money, this puppy cannot be beat. It's fast to assemble (pretty much install four bolts with provided wrench and you're set up) and is very stable. It folds down to a small size, is light enough to pick up and move with the back wheels using one hand, and stows away pretty flat. It's versatile as described, easy to adjust. I feel like it was a phenomenal deal and am very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "honestjuan",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "It fall apart quick poor material",
      "text": "I give it a one star probably less as it started falling apart with in less than a month after I purchased this product. I have been throwing away staple after staple and it just seems to get worse. I use my bench quite a bit as I do use for weights to abs workouts and I never had a bench that fell apart this fast. Now I have to wait for money to purchase a better one as this was the worse product I have ever seen fall apart. Dissatisfied customer.",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa Wood",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Great value and product",
      "text": "I am so thrilled with this bench. It was super easy to assemble and is the perfect size. I am 6'2\" and the backrest is taller than me when laying down. It is also the perfect high when inclined and sitting up giving me the correct neck support. I am really impressed with the quality of this bench for being the lower price that it was. The back is from shoulder blade to shoulder blade making it wide enough for me. Very very very pleased with this bench.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Fuest",
      "helpful_votes": 0,
      "publication_date": 20200529
    }
  ],
  "product_meta": {
    "title": "Fitness Reality 1000 Super Max Weight Bench with Upgraded Wider Backrest/Seat (2019 Version), 800 lb (2804)",
    "description": "FITNESS REALITY. Real People. Real Results The Fitness Reality 1000 Super Max Weight Bench is built to last and can support up to 800lbs. The front leg has 2 adjustable positions which will double the number of backrest angles to 12. The bench will enhance your upper body workout and is perfect for dumbbell and other strength training exercises. So, get the strongest bench around for the price and try the Fitness Reality 1000 Super Max.",
    "rating": 4.6,
    "feature_bullets": [
      "Included Components: bench, manual",
      "Sport Type: Fitness & Yoga"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "59 x 23.5 x 48.5 inches; 35 Pounds",
      "Item model number": "2804",
      "Department": "Unisex-adult",
      "Date First Available": "March 9, 2016",
      "Manufacturer": "Paradigm Health & Wellness Inc. -- DROPSHIP",
      "ASIN": "B01CR4XFIK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Strength Training Equipment",
      "Exercise & Fitness",
      "Adjustable Benches",
      "Benches",
      "Sports & Outdoors",
      "Sports & Fitness"
    ],
    "price": ""
  }
}