{
  "website_summaries": [
    {
      "verdict": "Choose this snowboard for youngsters who are new to the sport, as it is a good tool for them to begin learning basic moves and fundamental skills.",
      "pros": [
        "A great choice for youngsters, as it has a rugged build, bindings that adjust as kids grow, and brightly colored graphics",
        "Designed for ages 5 through 8",
        "Affordable"
      ],
      "cons": [
        "Parental guidance is necessary for novices, as it has a learning curve and may be difficult for some kids to control"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not made for bigger kid as advertised",
      "text": "I know I didn't do a good job of paying attention to the length but I was paying more attention to the weight limit for my oldest. I bought a different board for my youngest bc of the weight limit and it was longer and had better control. My kid could not control this thing at all but could with the other one.",
      "rating": 3.0,
      "verified": true,
      "author": "Mdieme",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Strange Design",
      "text": "Not a great design. Did not work on our back yard hill because of the grooves on the bottom. Not sure why they are there. We had to purchase another smooth wooden one for a similar price and works much better. (It will probably work on ice.)",
      "rating": 1.0,
      "verified": true,
      "author": "NuggetsNelly",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Very disappointed.",
      "text": "Board is small and appropriately sized for a child however straps are way too large for a kid sized boot. Also it does not move grooves on bottom of board keep it from moving at all. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180527
    },
    {
      "title": "One Star",
      "text": "Sadly, this snowboard doesn't move in the snow. There is something wrong with the bottom of the board.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian A Vercruysse",
      "helpful_votes": 4,
      "publication_date": 20180210
    },
    {
      "title": "Doesn’t Move In Snow",
      "text": "Agree with other reviews. Snowboard doesn’t move in the snow. My seven year old received this for Christmas. We finally got some snow over the weekend, the family went to the local hill and her board was the only one that wouldn’t slide down the hill. It will be going back.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Armstrong",
      "helpful_votes": 2,
      "publication_date": 20190123
    },
    {
      "title": "Does not work",
      "text": "Bought this for my 7 year old who snowboards and wanted to use this on small hills in backyard. There is so much traction on the bottom, the board wouldn’t move, even on ice. It was a waste of money because we cannot use it.",
      "rating": 1.0,
      "verified": true,
      "author": "JennyCraig",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Poor quality",
      "text": "Does not slide on snow, and bindings snapped on 1st day. Very disappointed, and one sad 6 yr old on Christmas vacation",
      "rating": 1.0,
      "verified": true,
      "author": "Supermom Becky",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Useless",
      "text": "Doesn’t slide on snow unless your pointing very downhill; not a learning board. Do yourself a favor and buy the real thing.",
      "rating": 1.0,
      "verified": true,
      "author": "NR",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Boarding boy",
      "text": "Son wanted to snowboard down the hill in our yard, this fit the bill and was every bit the quality you would expect from radio flyer.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Burnett",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Broken binding",
      "text": "We just used one day and the binding is already broken.",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "Flexible Flyer Avenger Kids Beginning Snowboard",
      "text": "Gave to grandson for Christmas and he loves it. He is just learning to snowboard so he was thrilled with it. Thanks so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Jackson",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "A good gift",
      "text": "The grandson was thrilled. We haven’t had enough snow to use it much but I think we need to wax the bottom to make it slicker.",
      "rating": 4.0,
      "verified": true,
      "author": "Carla S. Starcher",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Not worth it!",
      "text": "The bottom of this snowboard is not smooth so it doesn't glide at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Misty E.",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "looks nice but that's the best part .",
      "text": "it dose not work , it won't slide at all so if you want to hang it on the wall , that's all it's good for...!!!",
      "rating": 1.0,
      "verified": true,
      "author": "lawrence j kuehn jr",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Christmas fun",
      "text": "Looks much better than the one we bought last year",
      "rating": 5.0,
      "verified": true,
      "author": "grannykuhl",
      "helpful_votes": 0,
      "publication_date": 20201217
    },
    {
      "title": "It is junk.",
      "text": "Horrible waste of money! Will not slide even when void of rider.",
      "rating": 1.0,
      "verified": false,
      "author": "Dana Overman",
      "helpful_votes": 0,
      "publication_date": 20200307
    }
  ],
  "product_meta": {
    "title": "Flexible Flyer Avenger Kids Beginner Snowboard. Youth Plastic Snowboarding Toy Slider, 90 cm, 37 x 8 x 3 inches, Black",
    "description": "This affordable Flexible Flyer snowboard is perfect for boarding in the backyard or local sledding hill. It's great for beginners because it's easy to maneuver! This childs snowboard is designed to be easy-to-use and forgiving so kids can ride with confidence. A snow board for learning to balance, turn and stop - great for practicing novice tricks. Blow Molded High Density Polyethylene (HDPE) for extreme durability. More than a toy snowboard. No metal edges to cut young kids. Pre-mounted kids snowboard binding straps accommodate snow boots; adjustable ratchet system ensures a secure fit with a wide range of boot sizes. A snowboard for kids ages 5 to 8 years old. Maximum rider weight 135 lbs. 90 cm snowboard measures 37 x 8 x 3 inches. Weighs 4. 5 lbs.",
    "rating": 3.5,
    "feature_bullets": [
      "KIDS BEGINNER SNOWBOARD - Flexible Flyer plastic snowboard that’s perfect for entry-level snowboarding in your backyard or local sledding hill",
      "BINDING STRAPS - Pre-mounted kids snowboard binding straps accommodate snow boots; adjustable ratchet system ensures a secure fit with a wide range of boot sizes",
      "DURABLE - Blow Molded High Density Polyethylene (HDPE) for extreme durability. More than a toy snowboard. No metal edges to cut young kids",
      "EASY TO MANEUVER - Youth snowboard is designed to be easy-to-use and forgiving so kids can ride with confidence",
      "TEACHES TECHNIQUES - The perfect snow board for learning to balance, turn and stop. Great for practicing novice tricks",
      "KIDS SNOWBOARD – Black snowboard for kids ages 5 to 8 years old. Maximum rider weight 135 lbs. 90 cm snowboard measures 37 x 8 x 3 inches. Weighs 4. 5 lbs.",
      "OUR PROMISE - Flexible Flyer has been producing sleds since 1889. We stand behind our products 100%. If you have any issues, search for “Flexible Flyer Sled Paricon” online and contact us through our website. We will make things right"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "36.9 x 8 x 3 inches; 4.5 Pounds",
      "Manufacturer recommended age": "5 years and up",
      "Item model number": "995",
      "Department": "Unisex Youth",
      "Date First Available": "September 1, 2016",
      "Manufacturer": "Paricon Sleds",
      "ASIN": "B01CEET37A",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Winter Sports",
      "Snowboards",
      "Snowboarding",
      "Outdoor Recreation",
      "Freeride Boards",
      "Sports & Outdoors"
    ],
    "price": 23.99
  }
}