{
  "website_summaries": [
    {
      "verdict": "A basic slicer with few accessories and the need for extra stabilization during use.",
      "pros": [
        "Japanese stainless steel blades and a professional-looking design",
        "Three blades",
        "Produces very even cuts"
      ],
      "cons": [
        "Flimsy body",
        "Not as stable as some other slicers",
        "No crinkle cuts"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "sales description is lacking full info on what comes with product",
      "text": "disliked the product as it did not come with additional blades how can i send back and replace?",
      "rating": 1.0,
      "verified": true,
      "author": "The Gourmet Gardener",
      "helpful_votes": 16,
      "publication_date": 20190531
    },
    {
      "title": "Excellent",
      "text": "Easy to use with excellent results. Quite safe as well, especially if you buy the no cut gloves. Sliced a whole ginger root very thinly, in no time. Works great for julienne as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mihail A. Popa",
      "helpful_votes": 14,
      "publication_date": 20190102
    },
    {
      "title": "Harder to clean than old one",
      "text": "I like the old one better...i want it to be easy to clean. This one has more hidden spots to clean. It works great its sharp and came on time",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Wagnon",
      "helpful_votes": 12,
      "publication_date": 20190619
    },
    {
      "title": "A well built but small mandoline",
      "text": "Using this tool requires skill, practice, strength, and more than a little courage. FOLLOW THE INSTRUCTIONS. It will slice off a finger if you're not careful. Be careful, but not timid. I find the julienne blades useless for everything but turnips and the like, it clogs and mangles onions. Stick to the straight blade. Makes wonderful thin slices. It would be better if it were an inch or so wider to accommodate larger onions. Using this does create more waste (about 1/2 an inch of whatever slicing is mangled by the pusher/slicing guard. NEVER cut without it. Even so, it's fast and easy once you get the hang of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Parker Frontier",
      "helpful_votes": 4,
      "publication_date": 20190907
    },
    {
      "title": "Great slicer! Very useful!",
      "text": "We use this thing in a professional kitchen and it holds up to plenty of punishment. The blade is replaceable and is a straight edge so it's very easy to sharpen. With minimal care this thing will last decades. The julienne blades may wear out quicker if they're used heavily and there's no compartment that holds them with the slicer but that's a small complaint for all the benefits of this device",
      "rating": 5.0,
      "verified": true,
      "author": "Zac",
      "helpful_votes": 3,
      "publication_date": 20200217
    },
    {
      "title": "Wow, great cut",
      "text": "My first cut was with sweet pickles. Cut into long slices and they were so beautiful. I can tell from the sharp blade and the way the depth adjusts so precisely and strongly that this was a winning purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron See",
      "helpful_votes": 7,
      "publication_date": 20190106
    },
    {
      "title": "Amazing home mandolin sharp and strong",
      "text": "Amazing mandoline, I had a Similar version in green but the knobs were plastic and the veg holder wasn’t too great. I saw this and purchased it and so happy I did. The blade is super sharp the knobs to adjust the blade are sturdy from metal or stainless steel and most important the Veggie holder is great and protects your fingers and has a strong grip. I use this for salads and makes everything taste much better when cut thin. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon ",
      "helpful_votes": 2,
      "publication_date": 20200325
    },
    {
      "title": "Not the same width as I have, returned",
      "text": "I have a benriner, however it doesn't have the various blades, and mine has 2 turn screws to adjust the blade. Thinking I'd like to update after a lot of years, I bought this. Benriner's have different colors for different sizes, this is the color of mine. Upon arrival, this isn't the width of mine, and mine isn't the extra wide (different color anyway), or however it's listed. This is too narrow, in my opinion, to be able to slice potatoes or apples very easily. I returned it with no hassle.",
      "rating": 3.0,
      "verified": true,
      "author": "iluv2garden",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Slotted blades pose a risk",
      "text": "I use to work in a commercial kitchen so I have a good amount of experience with mandolins. There are three slotted blades only one of which creates a usable size. The smallest one is more of a shredder and the largest one makes the pieces so big it’d be just as easy to do it with a knife. The straight blade is fine but be very careful if you’re cutting anything that’s harder than a cucumber as the slotted blades don’t work very well and it takes a lot of force to get something like a carrot cut.",
      "rating": 3.0,
      "verified": true,
      "author": "Jonathan E. Bowman",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Amazing",
      "text": "There's a reason why this is standard issue in commercial kitchens. It just...works. It doesn't try to include a bunch of bells and whistle and doesn't come with a bunch of random gadgets that don't work. It's just the mandolin itself with its super sharp blade, then a few more interchangeable blades. No fuss. And if you clean it promptly after each use before food dries on it) a quick rinse and run with a sponge will do the trick. Get yourself some protective gloves though. Your fingertips will thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "ChenP",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "easy to use, wide body great for cabbage.",
      "text": "Super sharp, easy to use works great, easy to clean and very precise cuts. If you are looking for the best mandoline on the market look no further. i was able to cut soft tomatoes, hard sweet potatoes, and super thin cut my cabbage for sauerkraut. I purchased the Jumbo model and intend to also get the thinner super model.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark W Shiver",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "After 4 other tries, found the perfect mandoliine",
      "text": "So interesting to read the other reviews. I can't imagine how someone had a problem using this mandoline. For about 10 years, I've been wanting a mandoline, and I have to admit I was a bit scared to use one when the online shops also advertise a protective glove. I've tried several other brands of mandoline, and they were just to complicated + didn't do the job. This one was perfect, easy and felt safe. I easily adjusted the thickness for beautiful slices of potatoes, zucchini and onion. Packaged great, comes with 3 other blades. Very happy with this mandoline. The hand guard works great too.",
      "rating": 5.0,
      "verified": true,
      "author": "21march",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "WIDE!  I have another but this is both ONION width plus and easy to clean",
      "text": "WIDE! I have another but this is both ONION width plus and easy to clean I have one that has lots of blades and is tediously challenging to clean up - THIS is just so quick and easy and solid to use....",
      "rating": 5.0,
      "verified": true,
      "author": "Wink",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Love the upgrade",
      "text": "Long time Benriner user after living in Japan. I finally decided to swap up from my older basic one after I started mashing my daikon instead of shreading it on my old bent tines. My wife thanks me since now with the notches I dont have to back it up against the wall (and make a mess there) in order to quickly do the necessary. Upgrades on the level control are also welcome. Great build quality and function as before. Can't recommend it enough, its going on my gift list for my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Beyreis",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Perfect with one exception",
      "text": "I have used this brand for years. The current model I am using has one flaw. The long side of the adjustable deck is able to flex too much. It does have a metal rod on the under side to prevent it from flexing but it needs to be stronger. I would make the metal rod larger.",
      "rating": 4.0,
      "verified": true,
      "author": "crippled1",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "D",
      "text": "The plastic teeth on the holder broke on its first use while cutting carrots. Terrible device.",
      "rating": 1.0,
      "verified": true,
      "author": "Hector Rodriguez",
      "helpful_votes": 2,
      "publication_date": 20200812
    },
    {
      "title": "I cut myself but I like it.",
      "text": "I have used these constantly to prepare vegetables for dishes. The blade is extremely sharp. I cut off a piece of my finger and it took weeks to heal. However, do not let that deter you. The new guard included in the new version is way better than the old one. It’s more pointy so it holds on to whatever you’re slicing very well. Without the guard, always do it slowly. It’s easy to clean as you can remove specific parts.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin M.",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Super model has a wide, non-adjustable gap",
      "text": "I got the super benriner. The gap between the blade and the guide face isn't adjustable; it stays at a fixed distance, unlike other models. This complicates fabricating thin slices, and reduces control and consistency. This was a lot of money to spend on a tool that takes up space in my drawer at work and I am *always* hesitant to use.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Not as good as the original.",
      "text": "Not as sharp as the original. I almost returned it. Not super happy with it. I also do not like the huge knob on the back.",
      "rating": 4.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Not for slicing Salami etc.",
      "text": "Everything else works great, this is heavy duty plastic that feels sturdy, and looks minimalistic and incredible!",
      "rating": 5.0,
      "verified": true,
      "author": "Inna S.E.",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Sliced my finger/palm a couple of times",
      "text": "You can very very easily slice your finger with this. Gotta be very careful and focused while using it.",
      "rating": 2.0,
      "verified": true,
      "author": "Fei",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Best thing I’ve bought in awhile",
      "text": "Sturdy, dependable and doesn’t rust. Excellent quality product that will withstand commercial use",
      "rating": 5.0,
      "verified": true,
      "author": "yekaterina balagian",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Everyone that cares about cooking should have one",
      "text": "Absolute game changer in the kitchen and it’s huge! Everyone in my family wants one now.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Welsh",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "It is good for small onions only",
      "text": "This mandoline, cuts like a razor, but the only bad thing, is not good for big onions, only smalls ones",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Works Great",
      "text": "The mandoline being used by virtually every professional chef you see on TV. Enough said.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Kinney",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "love this thing",
      "text": "I love this great piece of culinary equipment. I've been wanting one to add to my collection of culinary products. I'm called i went with the commercial grade type so I know it will last me a life time.",
      "rating": 5.0,
      "verified": true,
      "author": "bdmbooks",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Why do you need this?",
      "text": "Fast delivery, works great !!! I make beautiful Korean carrots !!! Blades from Japan,very sharp,easy to cut !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Valery Mutoukin",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "must be careful",
      "text": "First thing, I cut my self, second thing, this is a wonderful product.",
      "rating": 5.0,
      "verified": true,
      "author": "goldie",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Slice, Slice, Baby...",
      "text": "Super sharp, great size and easy to use. It’s a well made piece of equipment and is worth buying. Be careful this tool can do some damage; I recommend getting a safety glove.",
      "rating": 5.0,
      "verified": true,
      "author": "WineCommander",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Only shreds not slices",
      "text": "I read the directions and was only interested in using the simple blade already attached. Regardless of the width, and how far I turned the dial the slicer only shredded my lemons and cucumbers. I don't feel this is a superior product- my old simple no name one worked much better.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great value",
      "text": "The guard is pretty useless so just be very careful! Otherwise the tool is great. Recommend cut gloves for the young or inexperienced",
      "rating": 5.0,
      "verified": true,
      "author": "Gm",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Product looks good but missing blades",
      "text": "Opened the package when delivered, there was one blade missing and one blade had damaged tooth. Unfortunately, I had to return the product.",
      "rating": 2.0,
      "verified": true,
      "author": "HR",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Defective blade",
      "text": "Only used on cabbage, carrots and potatoes probably less than 20 times and there are already small chips out of blade.",
      "rating": 2.0,
      "verified": true,
      "author": "ca",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Amazing Product.",
      "text": "An excellent addition to any kitchen. Sharp blade, the attachments work exactly as you want them to, a breeze to clean. It would be nice if the adjustment dial indicated the width of the slice, but that’s what test slices are for.",
      "rating": 4.0,
      "verified": true,
      "author": "Roosco",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Slicing now a dream",
      "text": "Great product, made well, very sharp blades (my thumb found this out! Use caution!) I sliced the ingredients for pickles in record time. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "MayKay",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "favorite kitchen gadget",
      "text": "One of my favorite kitchen gadgets. It makes quick work of whatever I making and is very sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Forget about cutting your finger tips",
      "text": "The hold in surfaces thanks tip the rubber tip is a great addition.... This equipment just got a whole lot better.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Kitchen mainstay.",
      "text": "Great product. Chef tested for over 15 years.. just keep it clean and sharp. Make sure you practice and take your time when using this. Will easily remove anything you put on the blade.",
      "rating": 5.0,
      "verified": true,
      "author": "ChefTK",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "usability",
      "text": "It was supposed to be a primary product for use in a cook's kitchen. The instructions are in and Asian language. The pictures are so obscure I can't figure out how to use it.",
      "rating": 2.0,
      "verified": true,
      "author": "jp",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "One of the best mandolin’s for reasonable price.",
      "text": "Super sharp blades, different sizes, easy to use, made from sturdy materials.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Dixon",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "New model",
      "text": "This is a great upgrade to an already necessary kitchen tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Southern",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Got what I ordered",
      "text": "Bought to slice fruit to dry. Wanted pieces the same size so they were put in dryer and all dried the same.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Ahearn",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "excellent mandoline",
      "text": "Razer sharp, as advertised. Easy to clean and disassemble for cleaning. Decent grip on the handguard.",
      "rating": 5.0,
      "verified": true,
      "author": "Krishach",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Excellent, Sturdy, Sharp blades and Made in Japan!!!!!",
      "text": "I got the standard version. I would buy again. Highly recommended if you are looking for a real mandoline.",
      "rating": 5.0,
      "verified": true,
      "author": "BN",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Get one soon, you'll love it!",
      "text": "My go to item for slicing so many items. Super fast, easy and SHARP!",
      "rating": 5.0,
      "verified": true,
      "author": "Nole mom",
      "helpful_votes": 2,
      "publication_date": 20190112
    },
    {
      "title": "Missing parts",
      "text": "The mandelin I received was missing fine julian blade .it came with only 2 blades",
      "rating": 1.0,
      "verified": true,
      "author": "marzieh latifzadeh",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Simple but effective",
      "text": "No fancy bells and whistles, just the basics that get the job done. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "DotF",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Easy to use",
      "text": "Was a gift for my \"cheffy\" husband. He absolutely loved it and used it every day!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Best investment .",
      "text": "The best and sharpest mandolin I have ever bought .",
      "rating": 5.0,
      "verified": true,
      "author": "Fatiha Boutara",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Sauerkraut Slicer",
      "text": "The Benriner jumbo slicer is well made. The slicer will slice cabbage ultra thin for sauerkraut or slaw. Unfortunately, the blade can be hard to adjust. After turning the adjustment knob you must push the guide plate down to adjust the thickness. Turning the knob to decrease the thickness is difficult and the plate needs to be pushed from the backside. It took several tries to get the thickness I wanted. Once adjusted the Benriner is a joy to use. The Benriner has a notch that fit well over my large 11\" diameter stainless bowl to hold it in place while slicing.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Great, but wish it would cut thicker slices (and measure the thickness)",
      "text": "It really is a great mandoline in almost every way. Super easy to use and clean, super sharp, just great. My two complaints: 1. the max thickness seems to be about 1/8\" or maybe a little more. it doesn't seem to make it all the way to 1/4\" and certainly not beyond, which is a bummer as sometimes i need thicker slices. 2. there's no way to know for sure how thick it is. i've tried measuring, but it's really not that easy. i'd love for it to have some way of indicating the thickness of it's setting, that would be great. otherwise, highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Avalon0214",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Sharp and easy to use",
      "text": "As advertised, sharp, adequate size, good variety of blades, and easily comes apart for cleaning. Nylon holder for food being sliced protects fingers from the blade. Blade width easily adjusted but no markings or way to repeat an a previous setting without trial and error each time but over time. Only mandoline I have ever owned or used so value my opinion accordingly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff2468",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "not as stable and not thick enough",
      "text": "We were hoping this mandoline would slice thicker (no actual details on thickness). While it did have an adjustment, the thickest setting meant that the base becomes unstable, and the adjustable part pops up after each slice. So it was a no go for our apple slicing. Perhaps its just really meant for thin slices. Apples though did not slice easily.",
      "rating": 2.0,
      "verified": true,
      "author": "G. Asturi",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Save your money",
      "text": "I used this to try to grate (shred) carrots and potatoes. The food holder is a cheap piece of plastic with dull points on it. The points don't hold harder vegetables, so the vegetable just falls off. If you try to shred vegetables without the holder, you will shred your fingers. Since you have to take it apart to clean it properly, it really isn't any easier to clean than the food processor. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Raffles",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "blades dull and vegetable holder inadequate",
      "text": "Tried with both onion and potatoes. Interchangeable blade was in correct V-shaped orientation in front of the cross-sectioning blade but slicing was not easy because the blades are not sharp. Also the vegetable holder has short plastic tips that do not hold the vegetable securely. Returning.",
      "rating": 2.0,
      "verified": true,
      "author": "Patricia S",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "A must have kitchen tool",
      "text": "I love my mandolin slicer! I bought this one to replace one that my kids somehow managed to lose and the quality on this one is much better. It’s very sturdy and simple to use and clean. This makes preparing Korean food so much easier than trying to hand cut everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopaholic",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Wow love this tool!",
      "text": "Very well made and easy to use. I got this to make sweet potato chips in my freeze dryer. In addition, this device is great for preparing veggies for salads. I recommend this simple but versatile and effective kitchen tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Electric Z",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "DIFFICULT TO USE, VERY LITTLE INSTRUCTIONS",
      "text": "I bought this in April, didn't try it, now I am trying to use it, it is very difficult to use and to clean. If I knew that before, I would of send it back. The instructions given are not enough almost doesn't make any sense, maybe if you know Japanese. It was a waste of money for me. I will be searching for another one.",
      "rating": 2.0,
      "verified": true,
      "author": "candle1357",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "I should have had one of these years ago.",
      "text": "With this and an air fryer you can have homemade french fries within 15 minutes of the urge striking you. Easy to keep clean. Be careful, blade is sharp. Use the \"pusher\".",
      "rating": 5.0,
      "verified": true,
      "author": "UpRider",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Every penny",
      "text": "Love this product used it as advertised shredded carrots and cabbage if your not comfortable with this but a glove and enjoy EASY TO USE",
      "rating": 5.0,
      "verified": true,
      "author": "DELON SOLOMON",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Easy and amazing.",
      "text": "First use was amazing. Sliced tomatoes and zucchini for a casserole. Completed the task in no time. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms Margy",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "this is a must have in a chefs kitchen",
      "text": "really the only brand Benriner to own, its the best, have tried several brands, but stick with what the chefs use.",
      "rating": 5.0,
      "verified": true,
      "author": "jessica Kay",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Only one plate provided",
      "text": "Wish it would come with more plates tor at least provide info on where to order different cutting plates",
      "rating": 4.0,
      "verified": true,
      "author": "TD",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "This is what professionals use and so can you.",
      "text": "It what is was needing for years and now it was at to right price. My only complaint is I should’ve bought 2.",
      "rating": 5.0,
      "verified": true,
      "author": "Mj",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Dont waste money on OXO",
      "text": "Better than ANY mandoline you'll find at BBB for 80 dollars. What I've always found in professional kitchens, so it should be good enough for you too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Worth the higher cost",
      "text": "Jumbo size does have adjustable slice thickness. Extra wide cutting surface works with Vidalia onions. Expensive but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20200226
    }
  ],
  "product_meta": {
    "title": "Benriner Super Slicer, with 4 Japanese Stainless Steel Blades, Beige",
    "description": "Style Name:Super Slicer, BeigeBenriner's Beige mandolin quickly and easily slices medium fruits and veggies into consistently sized pieces that cook evenly and look great, just like the pros. It's a favorite of kitchen tools for easier food preparation to save lots of time during food preparation. Create delicious, healthy entrees and side dishes, like stir fry's, casseroles, or Vegetarian recipes, and prepare healthy Snacks or garnish, salad toppings, and so much more. Safe and easy to use. The safety guard holds smaller end pieces securely for less waste and to protect fingers. With 4 interchangeable cutting blades and an easy-turn dial to adjust slice thickness, it's easy to make a variety of cuts to fit every recipe. Use the straight-edge blade to make wider slices for chips, scalloped potatoes or thinly sliced onion, The coarse-toothed blade for Chunky French fry cuts and carrot sticks, medium-toothed or fine-toothed blades to make long, narrow and extra-narrow strips, called julienne or matchstick cuts, for hashbrowns, shoestring potato nests, noodles (zucchini spaghetti strands) and stir fry's the nonskid rubber base adds stability during use or securely hook the groove onto bowls to collect slices. Simply snap in the desired blade, hold the mandolin slicer by the handle and slice directly into a bowl or onto a work surface. Made from Handcrafted Japanese stainless steel blades and BPA-free plastic, Includes 4 interchangeable blades (straight edge, coarse-tooth, medium-tooth and fine-tooth), large open comfortable handle and nonskid rubber base. The safety guard holds smaller end pieces for safe-and-easy slicing and protects fingers. Disassembles for easy cleaning. Top-rack dishwasher safe for easy cleanup.",
    "rating": 4.6,
    "feature_bullets": [
      "Benriner's Beige mandolin slicer easily slices medium fruits and veggies into consistently sized pieces that cook evenly and look great",
      "Made from handcrafted Japanese stainless steel blades and BPA-free plastic; Large open handle for Comfort and non-skid rubber base for added stability",
      "4 interchangeable blades (straight edge, coarse, medium and fine tooth); make wide slices, chunky cuts, long narrow and extra-narrow julienne strips",
      "Safety guard holds smaller pieces to protect fingers; hooks onto bowls to collect slices; easy-turn dial adjusts Thickness; disassembles for cleaning",
      "Easy to use; saves time; Make chips, French fries, garnish, hash browns, stir fry, and more; Measures 14. 5 x 5. 25-Inches; top-rack dishwasher safe"
    ],
    "specifications": {
      "Product Dimensions": "14.17 x 5.91 x 1.57 inches",
      "Item Weight": "1.35 pounds",
      "Manufacturer": "Benriner",
      "ASIN": "B01D2C0AGG",
      "Item model number": "BN95B",
      "Customer Reviews": "4.6 out of 5 stars608 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#11,361 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 6, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Graters, Peelers & Slicers",
      "Peelers",
      "Kitchen & Dining"
    ],
    "price": 55.0
  }
}