{
  "website_summaries": [
    {
      "verdict": "Whether you need extra warmth, total weather protection, or outdoor seating, this blanket's got you covered.",
      "pros": [
        "Rainproof and windproof outer shell",
        "Soft fleece interior",
        "All-purpose outdoor blanket",
        "Generous dimensions easily accommodates two adults",
        "Lightweight",
        "Stuff sack for convenient portability",
        "Durable and machine washable"
      ],
      "cons": [
        "Polyester waterproof shell is noisy and crinkly when shifting positions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Keeps you dry and warm for rainy soccer games",
      "text": "This blanket has been awesome for cold, rainy soccer games. The blanket keeps me warm, and keeps the parts that aren't covered by my umbrella dry. Our last soccer game on the sidelines was pouring rain and blowing the rain sideways. Between the umbrella for my top half, and the blanket for my bottom half (it is big enough to cover my whole body) I was the only parent that remained dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 18,
      "publication_date": 20161023
    },
    {
      "title": "Very good windbreaker warm blanket!",
      "text": "This is just what I was looking for to use on our boat when needing warmth and a windbreaker. I'm sure if a splash gets on it it will stay dry also. It's a good size for my needs too. I believe I'll find other uses for it and it has a stuff sack for storing. Just the right weight. I can see no reason to give this anything but 5 stars. The company cares and makes a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Likes DS games",
      "helpful_votes": 5,
      "publication_date": 20170322
    },
    {
      "title": "Needs Carrying Strap - Not That Warm",
      "text": "There is no strap or handle on the carrying bag which makes it unhandy to carry especially if you are carrying a stadium seat. The drawstring cuts into your hand after a while. There is no strap across the bottom of the bag to hold onto when you are pulling the blanket out of the bag. We used it last night and the wife’s heavy coat provided more warmth on our legs. My wife wanted it because it is rainproof. I kept telling her we need to take rain suits if we think it will rain. She won but is now disappointed about the lack of warmth that it provided.",
      "rating": 3.0,
      "verified": true,
      "author": "LandDog49",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Good quality",
      "text": "Warm and totally waterproof! I got this for my dog because her blankets get wet in the damp ground. I forgot it in the rain, with the plastic to the outside, and it was dry when I found it! It is super comfy on the ground and keeps me warm when she lets me use it.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Wilson",
      "helpful_votes": 7,
      "publication_date": 20160917
    },
    {
      "title": "Not waterproof.",
      "text": "I got this as a dog blanket that covers an area rug, so it's subject to wet paws, fur and licks. It's definitely not water proof. Moisture seeps through. It's really light weight, too. Would work as a wind breaker but that's about it. I like the color and size but honestly, it's not worth 30 bucks...",
      "rating": 3.0,
      "verified": true,
      "author": "Some Blue Devil",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Great!",
      "text": "It’s really soft, and definitely waterproof. Likely not the use case they had in mind, but have a cat that is quite old and ends up vomiting quite a bit (poor girl)... well she would do this frequently on my bed, which requires washing all my bedding a couple times a week! I spread this over my bed and only end up washing this instead. Much better situation, and this really is water - and vomit - proof.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin H",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Very soft. 75% waterproof for cats business.",
      "text": "I got this to protect furniture from cat urine. Darn cat.This feels very soft and not very noisy at all (slightest crinkle). It worked so well the first time, I got a second one. But...it has not been perfectly waterproof each of the 4 times I needed it. It leaked through once. It does wash and wear really nicely. I haven't put in the dryer though. It air dries pretty fast. I do recommend it because it is soft and so far, 75% success. I like the look and feel better than other items like this that I have seen.",
      "rating": 4.0,
      "verified": true,
      "author": "fuller",
      "helpful_votes": 5,
      "publication_date": 20161017
    },
    {
      "title": "Soft and comfy, washes great.",
      "text": "Purchased to use on our bed to protect against spills of various types (enough said), we've been pleased. It is super soft and comfy to lie on, and is large enough to cover the top of our King bed. It washes well and dries quickly in the dryer, and looks new when it comes out. This would work great as a blanket for chilly or damp outdoor events, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Worth it and a life saver",
      "text": "I have a condition called Cold Urticaria (allergic to the cold and yes it’s a real thing) and this blanket had been life changing! I use it to hang with our friends on the patio, camping, baseball games, football games and the wind does not get through! It’s surpassed my expectations with flying colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Crinkly",
      "text": "I like this blanket in general, but the water resistant side is very loud and crinkly. I wouldn't use this for just lounging or sleeping.",
      "rating": 4.0,
      "verified": true,
      "author": "Courtney B.",
      "helpful_votes": 2,
      "publication_date": 20181010
    },
    {
      "title": "Horrible stitching",
      "text": "I purchased this blanket, and after receiving it proceeded to wash it. After I took it out of the washer I discovered the stitching around the edges of the blanket have already began to unravel. I would not recommend this blanket.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian F",
      "helpful_votes": 3,
      "publication_date": 20181126
    },
    {
      "title": "This was much less expensive and is completely waterproof and easy to wash",
      "text": "I use this for my bed to keep my dog who has a leaky bladder from getting my bedding wet. Pet diapers and other interventions did not work. The waterproof large pads under the pet section were priced close to $79-$80. This was much less expensive and is completely waterproof and easy to wash. My pooch is so happy to be able to sleep in the bed and I am elated to have found this product.",
      "rating": 5.0,
      "verified": true,
      "author": "mmmrn",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Perfect emergency blanket",
      "text": "The blanket is perfect. I use it as an emergency blanket in my car. It packs nice and small and unravels to a nice big size and covers your whole body. I love that it is wind proof and waterproof to protect against the elements. I haven’t used it outside yet, but I needed a few hours of sleep in my car on a cold morning and it sure did the trick.",
      "rating": 4.0,
      "verified": true,
      "author": "Rosie",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Thin and flimsy!",
      "text": "I was looking for a replacement to a nylon lined fleece blanket I had lost. This blanket is NOT it. Both the \"fleece\" and the nylon are very thin. I would worry that it would rip on the first use on aluminum bleachers. And the fleece is not fleece, but raschel; very thin and cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Engineer Mom",
      "helpful_votes": 4,
      "publication_date": 20170523
    },
    {
      "title": "LIVES UP TO THE HYPE",
      "text": "Though it hasn't seen rain yet, just attended an outdoor sport and this blanket was amazing in 34° weather with a steady frigid wind. Wraps up into a travel sack smaller then a loaf of bread. We bought 2 for the kids cold weather sports. Well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "B McKenzo",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "We use this to throw over a portion of the ...",
      "text": "We use this to throw over a portion of the couch so our dog can sit on the couch, without covering it in dog hair. Her hair is course enough that it actually works it's way through blankets, which is why we opted for one with some type of protective backing. It works perfectly for our needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle C.",
      "helpful_votes": 3,
      "publication_date": 20161217
    },
    {
      "title": "XL Plush Fleece Outdoor Stadium Rainproof and Windproof Picnic Blanket",
      "text": "For a light weight blanket it does provide a great deal of warmth and not a bad job of protecting from wind. Perfect for my customers on the back of my pedicab. And best yet, it's not too bulky so easy to pack up. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "L'Doleur Exquise",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "This is a nice, soft blanket",
      "text": "This is a nice, soft blanket. But it is in no way rainproof. I've used it to sit outside on dewy grass, and the entire blanket is soaked through in no time. Not worth the cost, as it's just a blanket with a crinkly blue backing.",
      "rating": 1.0,
      "verified": true,
      "author": "Lara Barkley",
      "helpful_votes": 3,
      "publication_date": 20180720
    },
    {
      "title": "Warm and wind breaking",
      "text": "We used this blanket at our son’s’ football games this fall. It really cut down the wind. It’s lightweight and not cumbersome. They (we bought 2) fold up nicely and can be put into a large reusable shopping bag along with our warm weather accessories. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki L.",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Well Made",
      "text": "Really though, awesome. Fabric inside is super soft, the waterproof outer portion is smooth and really does keep water out. The size is so big and comfortable, its an all around awesome blanket.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "I like it",
      "text": "I received the product a few days ago and although I have not had the opportunity to use it to the level I would like, I can say that it has good finishes and in the texture of the materials it is observed that they are of good quality, it seems very practical, it is easy to save.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente de Amazon",
      "helpful_votes": 3,
      "publication_date": 20171024
    },
    {
      "title": "Perfect sideline blanket!",
      "text": "I bought this blanket to use on the bus and on the sideline at soccer games. It rains and snows a lot during our winter season!! This blanket packs well, comes rolled up in its own pouch that doubles as a nice pillow, very light weight, very soft, very warm!! My assistant liked it so much she bought herself one too!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Wright",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "AWESOME, versatile blanket",
      "text": "This blanket is one of my favorite purchases in the last year. Perfect for sporting events or sitting outside in winter. Warm, totally waterproof and large enough to wrap up in! (I bought an extra to keep in my car for l0ng trips so kids could snuggle up :)",
      "rating": 5.0,
      "verified": true,
      "author": "susie cross",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Love this blanket.",
      "text": "Love this blanket. Love, love, love it for watching soccer games in the cold/rain. Love it so much, bought another one.",
      "rating": 5.0,
      "verified": true,
      "author": "vanv",
      "helpful_votes": 4,
      "publication_date": 20170407
    },
    {
      "title": "Love it!",
      "text": "This is great and just want I need to keep in my car. This is much better than the other product I brought several years ago to keep in my car for emergency especially during the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela H. Gramer",
      "helpful_votes": 2,
      "publication_date": 20171122
    },
    {
      "title": "Great for sports Moms",
      "text": "Lifesaver for chilly, misty days. I am a softball and marching band Mom, I am outside ALOT. Completely keeps me dry. The only reason why it's not 5 star is it could be a little warmer. The plush material is very soft and is nice quality, I'm a chilly Mom too so I like a little heavier blanket, but otherwise, I LOVE this blanket!",
      "rating": 4.0,
      "verified": true,
      "author": "Gayle",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "A MUST-HAVE blanket!",
      "text": "A MUST-HAVE if you spend your weekends outside watching kids' sports games! This blanket is perfect for cold days, wet days, windy days. I can't believe I've gone this long without it!",
      "rating": 5.0,
      "verified": true,
      "author": "UVMPT Mom",
      "helpful_votes": 2,
      "publication_date": 20171108
    },
    {
      "title": "Great blanket, so glad I purchased it",
      "text": "Use this blanket for soccer. Love it!!! Helps keep you warm and dry. The blanket side is soft. Other parents have seen my blanket and some have ordered a blanket for themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "Tigger",
      "helpful_votes": 3,
      "publication_date": 20170405
    },
    {
      "title": "Perfect for an outdoor football game!",
      "text": "I purchased this blanket for my first NFL game. I wanted to make sure it would be warm enough, light enough and waterproof just in case it rained. It met all my criteria and was the perfect blanket for the game. It also game in a bag so it was easy to carry it around.",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy Gamez",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Perfect for my intended use",
      "text": "Perfect for my intended use: The annual \"Opera in the Park\" concert & picnic. Where I live, September afternoons can be a little chilly, other times it can be a little windy and sometimes, both. These blankets will work great.",
      "rating": 5.0,
      "verified": true,
      "author": "RocketGranny",
      "helpful_votes": 3,
      "publication_date": 20161016
    },
    {
      "title": "We love it!",
      "text": "Love that we can put it on the ground for our baby to crawl around on & use it to cover her up & keep her warm while she sleeps. Perfect for any outing. The brown side is very soft & the blue side is great for keeping things dry. We use it several times a week for soccer practice & games.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "WATERPROOF.............?  NO WAY!",
      "text": "I used & purchased this \"WATERPROOF\" item for the top of my Ralph Lauren comforter. This was to prevent any accidental spills that I might make, from soaking into my nice comforter. The first time I spilled something (coffee), it not only went all the way through my \"waterproof\" blanket, but stained my nice comforter!!! I would not even think of buying this item again. It did clean up nicely, but my RL comforter is toast! Fake News on being \"Waterproof\"....................... Very Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Carrie A.",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Absolutely love this blanket",
      "text": "Absolutely love this blanket! This is the second one we’ve bought because it works so well (keeps us dry and warm) for us on our camping trips. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ryan",
      "helpful_votes": 5,
      "publication_date": 20180309
    },
    {
      "title": "Not as described.",
      "text": "The item is wind proof. We did not have rain so I cannot comment on that. Unfortunately, it’s is not plush and warm as described. My wife and I attended an outdoor event and needed a large blanket for extra warmth. The blanket was large enough for the both of us but did not provide additional warmth as assumed when an item is described as plush fleece.",
      "rating": 2.0,
      "verified": true,
      "author": "Lance W.",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Nice warm blanket",
      "text": "Really nice blanket. Feels warm. I like the water proof liner. Nice tote bag. Unfortunately, I wasn't able to use it for what I purchased it for. I wanted to take it to a NFL game and they no longer allow visitors to bring items like this in. Oh well, I'm sure I find a use in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Sicard",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Lightweight and keeps you warm but the color was not what I was expecting",
      "text": "It's a great lightweight blanket to haul around to the ballpark. It's a good size and offers good windbreaking. I don't know how well it will hold up yet but so far i like it. One note, it's more of a slate gray/blue color than the dark blackish the photos show. Not terrible just was surprised when it arrived.",
      "rating": 4.0,
      "verified": true,
      "author": "Oh_sandy",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Awesome!",
      "text": "This is awesome blanket! Actually this is my 2nd order. My daughter plays outdoor soccer and we spend most of weekend @ field including snow day. This blanket blocks cold wind and keep me warm. I love it and happy with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Reah",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Love it!",
      "text": "I bought this to take while riding our Polaris RZR, it comes in a neat waterproof bag and fits perfectly in between the two seats which acts kind of as an arm bumper when in rough trails. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "ketchumsgal",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "great blanket for a low cost",
      "text": "Low cost, light weight blanket. If you're looking for something to picnic with or to keep spills off furniture this will do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicky",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "It’s just ok",
      "text": "The seams have come undone already. It’s also uncomfortable because it slides when you sit on it, so you have to be constantly adjusting it. It should have a pattern throughout the blanket so that both the plastic and fabric are held together in place.",
      "rating": 2.0,
      "verified": true,
      "author": "SandraG",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "This Blanket is the best",
      "text": "We camp a lot and sit out around a fire at night, this blanket is so soft on one side & water resistant on the other which keeps the dampness off you. IT keeps me nice and warm too. I love how it rolls up into a matching bag & stores easy.",
      "rating": 5.0,
      "verified": true,
      "author": "fintime",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Disappointed",
      "text": "I like the size of this blanket and bought it for a camping trip. I used it all of 3 times and there is already a hole along the seam. I'm rather disappointed since overall this had almost a 5 star rating when I bought it.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "100% wind-proof",
      "text": "As I sit at my kids’ track meet and everyone around me is freezing, I am happy to report that this blanket is indeed 100% wind-proof! The super soft fleece lining is toasty. Wish I had bought it sooner!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cat Burns",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Definitely blocks the wind",
      "text": "I bought this blanket to use during my daughter's softball games in Iowa this past weekend. Temps were in the 40's and wind and this blanket definitely helped block the wind. It is thin but it keeps you warm! It also started misting rain and kept me dry. Worth $30!",
      "rating": 5.0,
      "verified": true,
      "author": "DMI515",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Awesome!",
      "text": "It's a huge windbreaker with a warm, cushy lining. Keeps you warm even with a frigid wind whipping! Best purchase ever for outdoor activities where the temperature can change quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Googstar",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Great blanket, just wish it was a little cheaper.",
      "text": "Love this blanket! It's big enough for 2 people and I've used it multiple places already - watching parades and sports events. It's very cozy inside the blanket and keeps the cold out. I'm going to leave it in my car so I will always have it on hand. The only downside is the price, I wish it was a little cheaper so I could buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Leahx4",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "so far so good",
      "text": "so far so good. not sure if it will stand up to the description of being waterproof over time but after just one use, it has been. will update with a 5th star if this blanket makes it through the summer in Central Park and continues to be water proof.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Suh",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great for the boat",
      "text": "We bought three of these for our teenage kids for those cool evening boat rides. They are excellent. Lightweight, warm, store easily in small compact areas on the boat. We lost one of the storage bags and lightspeed sent us a replacement at no charge. Thank you for your great service. I think we are going to order 2 more for mom and dad.",
      "rating": 5.0,
      "verified": true,
      "author": "Krisden Romine",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Recommend",
      "text": "Love this blanket. Holds in the heat when using as a blanket and stays dry when on the ground. Handy travel bag",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Didn’t work as listed",
      "text": "Was ok, however if you moved at all the blanket would instantly be cold and took sometime to warm back up. Used for football games, 2, and couldn’t do it again. Purchased another and used regular blanket until it arrived.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Buck",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Great for watching kids sports in early Spring or late Fall.",
      "text": "Bought this for my wife for our kids' sports activities. We had a cold and windy Spring and I think this made a huge difference for her. Helps block the wind and keeps the heat in. It's pretty big and permits you to burrito wrap yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "What we wanted but didn't last",
      "text": "It was exactly what we were looking for. Good size and light weight but after one camping trip with minimal use, there's already a 6 inch rip down one seam and it now soaks up water rather than repels it.",
      "rating": 2.0,
      "verified": true,
      "author": "Sara Mazurik",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Outdoor Sport Families Must Have!",
      "text": "This blanket is a MUST HAVE for outside sports families!! Used it all season! Works great to keep me warm and the wet bleachers to themselves!! Wish I would have purchased it earlier!",
      "rating": 5.0,
      "verified": true,
      "author": "Maryn Otto",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great for Baseball Games!",
      "text": "I was looking for something that would keep me warm during baseball games. I was very impressed with the quality and the size of it. A couple of us could fit under the blanket love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Ugh so annoyed!",
      "text": "NoT waterproof, dog just peed right through these and onto our white ottoman! So these blankets are not what they claim to be! Ugh so annoyed!",
      "rating": 1.0,
      "verified": true,
      "author": "Carla M.",
      "helpful_votes": 3,
      "publication_date": 20171120
    },
    {
      "title": "Works great for our dogs in the back of the car!",
      "text": "We use this in the back of the car for our dogs. Protects the car but is comfy for the pups.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Miller",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "LOVE this blanket",
      "text": "LOVE this blanket. I bought it to have for outdoor concerts and have not been disappointed. It definitely came in handy when the temp started to drop in the evening and it's nice and compact. I have it attached to the beach chair I take with me so it makes for the perfect outdoor concert package.",
      "rating": 5.0,
      "verified": true,
      "author": "czigs",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Warm",
      "text": "I love this. Way warmer than any of my other blankets I've taken to games and rolls up small and easy to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "This is a nice warm blanket and definitely recommend for stadium windproof cold ...",
      "text": "This is a nice warm blanket and definitely recommend for stadium windproof cold fall weather. I actually wanted it also to take as on a backpack trip as an extra blanket / ground cover but I am not sure I will take it as it is heavier than I was thinking it would be, so we will see how small I can pack it. The plush side is a very nice warm plush, and the other side is crinkly fabric.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Smith",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "PASSED FIELD TEST",
      "text": "Works great, FIELD tested! Literally, I had it outside at a soccer game, 40's with rain and wind, kept us warm and dry. The fleece is great plush quality.",
      "rating": 5.0,
      "verified": true,
      "author": "LAWillcox",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Super handy",
      "text": "Comes in super handy whether it’s to sit on or cover up with it. Not overly heavy but does provide some warmth",
      "rating": 5.0,
      "verified": true,
      "author": "jess z",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Would purchase again",
      "text": "This blanket is fantastic. It breaks the wind, keeps us dry and warm, and is big enough for two or three people snuggled together.",
      "rating": 5.0,
      "verified": true,
      "author": "dilite",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "All Season Utility",
      "text": "My wife wanted extra bed covers for the winter and was intrigued by these blankets. She was excited by the results. Not only is the blanket's fleece side warm, in addition the reverse waterproof side helps to retain warmth and keep cold from penetrating. We are more than pleased with this purchase and are ordering more as they appear to have utility for all seasons",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Helton",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Snuggly outdoor blanket",
      "text": "Great size and very warm! Super soft on one side and water proof on the other. And it’s not stiff, it’s snuggly. People were fighting to borrow these on my camping trip. Highly recommend and will use for sports events too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Great all around blanket for the car",
      "text": "Wife liked it so much I have to get another!",
      "rating": 5.0,
      "verified": true,
      "author": "richard",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Great all around blanket for 3 seasons.",
      "text": "This is a great all around outdoor blanket for 3 seasons. One side is waterproof, making it handy even in rain. One night after a ball game, I was able to use it to cover all my family on our way to the parking lot when it suddenly started raining. It is warm and quite handy when kept in cars.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Good blanket",
      "text": "I got thus outdoor waterproof blanket for my daughter to use at Camp. We opened the blanket and she liked the soft inside and I like the outside knowing if it rains all week at Camp her blanket should keep her dry at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Love- Smoky blue grey color",
      "text": "Just received. Love the color. It’s almost a smoky blue grey LOVE. Hoping it is as warm as others say it is!",
      "rating": 5.0,
      "verified": true,
      "author": "Fdamanti",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Easy to charge",
      "text": "Bought this for my husband who works as a supervisor at a construction site. He loves especially on cold, foggy mornings.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana in Missouri",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Overpriced for the quality",
      "text": "Way too thin, already somewhat ripped at the seams. Great idea, wanted to love it, but just not what I was expecting for the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Tabatha",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Dece",
      "text": "Loses it's waterproof-ness after maybe 10 washes, but it gives us an extra layer of protection when the rabbit gets too comfortable during bedtime snuggles. Take a pissing, keeps on ... blanketing.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew J. Glover",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Outdoor sporting events",
      "text": "Purchased two of these blankets for an outdoor soccer tournament that we knew the weather was going to be cold and rainy. They worked fantastic for the sidelines to keep the players warm when they came off the field.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "This blanket has been amazing. I purchased it to use while I watch ...",
      "text": "This blanket has been amazing. I purchased it to use while I watch my kids play soccer during the colder winter months. The XL size is fantastic to wrap around for maximum cover. Light weight, easy to stash and carry, soft, warm, and really cuts the wind. I've suggested it to several of my fellow soccer parents. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Duke",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Stitching falling apart",
      "text": "This blanket is effective for what it's supposed to do but the stitching on mine started falling apart after one mild use. I had to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Katherine",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Awesome!",
      "text": "Great outdoor blanket. Really traps body heat and ZERO wind gets through it. I wish it were bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "BMF450R",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Perfect for the Baseball/Football Mom",
      "text": "Perfect for the Baseball/Football Mom! I absolutely love this blanket! It blocks the wind and resists rain. I have battle tested it and have not a single complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Yes. Buy it.",
      "text": "Perfect for car camping in the mountain summer. That’s really all there is to say. Worked great. Twin bed sized. Cheap. High quality. Yep.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Not very thick, very large",
      "text": "Not as thick as I would have liked, but it is very large. It wasn't very cold at the soccer game we went to, but it kept us warm from the 50 degree + windy weather.",
      "rating": 3.0,
      "verified": true,
      "author": "Janina S.",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Great for football fanatics!",
      "text": "I bought this for my sports-mad sister and brother-in-law, who make a regular practice of going to football games in the freezing cold. They were delighted (and not just because it's the right color).",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Bryan",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Worthy purchase",
      "text": "I bought this blanket to keep me warm and dry during outdoor sporting events. It works well. The fuzzy side keeps me warm while the slick side blocks the wind a bit. Not sure how water resistant it is as, thankfully, I haven't had to sit through a game in the rain yet. It is lightweight and easy to carry. It fits back in the bag it came with easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "The blanket is nice, packs in a conveniently small bag",
      "text": "The blanket is nice, packs in a conveniently small bag. The nylon backing really blocks the wind. Plus, this seller was amazing and sent a replacement bag for free when my son lost it!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Size",
      "text": "It is not meant for two. I’m disappointed in the size description. Other than it is smaller than I thought, the blanket is great!",
      "rating": 3.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Wrong Color",
      "text": "Ordered slate grey which in the picture looks like dark grey but the actual color is much lighter and much bluer.",
      "rating": 1.0,
      "verified": true,
      "author": "Falconquinn101",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "So worth the money!",
      "text": "This blanket is by far so worth every penny. Used it for the 3rd time this week. This time watching baseball in the light rain... I was warm and dry! You can feel your own body heat when your wrapped in this. I love how it doesn’t have to be folded perfectly and will still fit in the bag nicely with little effort. Only takes seconds to put away. We love it! After lots of research I HIGHLY recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Good Quality",
      "text": "Since I purchased this item it has been so hot that I have not had a chance to use it at the football games. However, from what I see so far, I think that it is just what I was looing for.",
      "rating": 4.0,
      "verified": true,
      "author": "Khowell",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Great product!",
      "text": "Awesome and very easy to clean without sacrificing quality. Our girls U10 soccer team loved using on the sideline during wet/rainy games.",
      "rating": 5.0,
      "verified": true,
      "author": "kzoo329",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Camping",
      "text": "Sister in law Christmas gift she loved it. Exactly as described quick shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Mis",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Best of all",
      "text": "Received this blanket as a gift, used it for a wet, cold weekend of softball and baseball tournaments. It was very warm and shed the mist/light rain. Best of all, it is big enough to cover me (average size woman) from toes to neck and wrapped all the way around. Great blanket.",
      "rating": 5.0,
      "verified": true,
      "author": "BZ",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Perfect for watching sports",
      "text": "I love this blanket! It makes watching my son's baseball games in the cold weather much more enjoyable.",
      "rating": 5.0,
      "verified": true,
      "author": "CA girl",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Great blanket for a great price",
      "text": "These blankets are wonderful!! We bought these for our boat and they are perfect, they are waterproof on one side and warm fleece on the other. These blankets will extend our boating season because we can wrap up and stay warm and dry. They are the perfect size and store very well when not in use. They are easy to get in and out of the stuff sack.",
      "rating": 5.0,
      "verified": true,
      "author": "Buckle of the Bible Belt",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Warm and Dry",
      "text": "Very cuddly and wonderful if it starts to rain. One of the best things I have ever purchased!",
      "rating": 5.0,
      "verified": true,
      "author": "The Mema",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Wind and water proof",
      "text": "Bought these for an outdoor football game in Ohio in October/November. It was sooooooo cold. These definitely kept us warm. Definitely wind proof!.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "best little camping blanket",
      "text": "They are perfect for the pop up camper. I bought 4 to store in the camper and use as our bed blankets that can easily become fireside cover ups on cold day.",
      "rating": 5.0,
      "verified": true,
      "author": "Betsy Zeh",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Its perfect to carry in my motorcycle saddlebags for summer camping",
      "text": "Its perfect to carry in my motorcycle saddlebags for summer camping...slept under it last night at a party and was warm and dry",
      "rating": 5.0,
      "verified": true,
      "author": "W. L. S.",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Get iiiiiit!",
      "text": "Used this during the 2018 Rolex 24hr at Daytona. It was fairly rainy and chilly; this blanket was big enough to keep my husband and me warm and dry throughout the night.",
      "rating": 5.0,
      "verified": true,
      "author": "Breanna S.",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Nice blanket but a little thinner than I expected",
      "text": "Nice blanket but a little thinner than I expected. Works well and I love the plastic side for light rain or to put on the ground. Big enough to wrap around me. Worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Iosue",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Very warm",
      "text": "This is a great blanket. Pretty warm for something so lightweight. Helps with the wind and rain so I use it all the time at my sons sporting events.",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Great for the sidelines",
      "text": "Excellent windbreaker and highly recommended for watching games from the sidelines in fall and spring!",
      "rating": 5.0,
      "verified": true,
      "author": "Carsten Behler",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Sent back due to ripping",
      "text": "We liked this blanket until the fleece started separating from the edging. That started less than 3 days after we started using it.",
      "rating": 2.0,
      "verified": true,
      "author": "BCB",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Perfect if your cats love to pee in your sofa",
      "text": "I bought this to keep my sofa safe from my cat obsession of peeing on it, and it has worked! The pee stays on top of the blanket and never reaches my sofa, all I have to do is wipe it out or just trow it in the washing machine. I now have 3 of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonie Hanna",
      "helpful_votes": 0,
      "publication_date": 20190126
    }
  ],
  "product_meta": {
    "title": "XL Plush Fleece Outdoor Stadium Rainproof and Windproof Picnic Blanket - Camp Blanket (Blue)",
    "rating": 4.6,
    "feature_bullets": [
      "Never feel unprepared again: The Lightspeed Outdoors XL Plush Fleece Outdoor Blanket protects you from wind, rain, spilled soda, or any other unexpected element you may encounter while out exploring.",
      "Durable yet ultra-cozy at the same time, this blanket will soon become your essential item for anything from weekend sideline sports to adventurous backpacking trips with its rugged outer shell and super soft poly fleece interior. Rainproof and windproof outer shell and soft fleece interior will keep you comfy, warm and dry.",
      "Generously sized (72” x 58”) to accommodate budding soccer stars or adults cheering them on, the XL Plush Fleece Blanket packs down to a modestly sized (15.3” x 6.3”) in the included stuff sack and can easily fit in your pack.",
      "Perfect for chilly days at the park, windy stadiums, and cool nights at the campground, this blanket will be everyone's favorite.",
      "Machine washable because we know adventure brings with it unexpected spills and oftentimes unavoidable and messy FUN - get out and enjoy/play/adventure/etc!"
    ],
    "specifications": {
      "Product Dimensions": "16.1 x 9.1 x 5.8 inches",
      "Item Weight": "1.5 pounds",
      "Manufacturer": "Lightspeed Outdoors",
      "ASIN": "B01D5FY3V8",
      "Item model number": "27552-EL",
      "Customer Reviews": "4.6 out of 5 stars681 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#52,360 in Sports & Outdoors",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Outdoor Recreation",
      "Home & Kitchen",
      "Sports & Outdoors",
      "Blankets",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": 29.99
  }
}