{
  "website_summaries": [
    {
      "verdict": "You won't have to use a lot of this gel to get reliable hold, thanks to plant-based amino acids and clean ingredients. A great choice for tight curls and coils.",
      "pros": [
        "A little bit of this gel goes a long way, and holds without leaving hair feeling crunchy or sticky",
        "Works well on tight curls, and tames frizz and flyaways",
        "Earns Sephora's \"clean\" seal, so it doesn't contain additives like parabens, sulfates, and other harsh ingredients"
      ],
      "cons": [
        "Not very moisturizing, so it's not ideal for extremely dry hair",
        "Doesn't define waves and loose curls as well as it does tight curls"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Holy Grail for protein loving hair!!",
      "text": "This is my favorite gel! For reference, I have medium porosity, medium strands, low to medium density with 3A curls. My hair loves protein. This product is protein heavy with mostly large chains. The people leaving bad reviews could be protein sensitive. If you use this product and find it dries your hair out or leaves it like straw, that is sign of protein overload. Please don't blame this product. Educate yourself about your own personal hair and find what works for you! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley S.",
      "helpful_votes": 5,
      "publication_date": 20200201
    },
    {
      "title": "Got this in my ipsy bag and fell in love. Had to buy more!",
      "text": "Got this product in my ipsy bag and instantly fell in love so I had to purchase more. I have super kinky curly hair and this is one of the few products I have tried that has worked. It doesn't have a strong odor like the other products that I have tried and it doesn't leave my hair crunchy like some products do! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn Sorenson",
      "helpful_votes": 6,
      "publication_date": 20170304
    },
    {
      "title": "BEST LOVE IT!!",
      "text": "FINALLY a product that works without weighing my hair down or sticky. zero frizz, just bouncy curls that you can run fingers through and it won't make them frizz. touchable hair, not oily like other products I've tried. I have short hair, just about a dime size dab, run through wet hair and use a defuser to blow dry or let dry naturally. LOVE this, my curls look great. wish I'd had this in grade school, being called cotton swab wasn't fun lol. I'll never use another product!",
      "rating": 5.0,
      "verified": true,
      "author": "Mickie Dawn",
      "helpful_votes": 5,
      "publication_date": 20170529
    },
    {
      "title": "Not a Firm Hold Gel, But Still NICE",
      "text": "First, this line is \"curly girl\" approved with no sulfates, silicones, parabens, etc. I really love the smell and how it makes my curls soft, yet somewhat defined. I'm always searching for the perfect gel to define and protect my curls, yet not dry them completely out. This gel is a \"soft to medium\" hold level, but does seems tad drying the next day. I have bought the shampoo and conditioner to try out as well. If you are searching for the perfect line for your curls, give it a try.",
      "rating": 4.0,
      "verified": true,
      "author": "TNGal",
      "helpful_votes": 5,
      "publication_date": 20161030
    },
    {
      "title": "NOT at all like the original I initially received",
      "text": "I initially was turned into this product from my ipsy glam bag. It worked wonders on my hair. When I got this I was so excited. First time I used it noticed it was a faint yellow color, the one from ipsy was clear, and my hair was so frizzy after applying. NOT at all like the original I initially received. Should have realized it when it came out a yellow ish color. SMH. I want my money back 😕",
      "rating": 2.0,
      "verified": true,
      "author": "Shelley Day",
      "helpful_votes": 7,
      "publication_date": 20170221
    },
    {
      "title": "Frizz-free! (from an “I hate my curly hair” frizz sufferer!)",
      "text": "This stuff is the link that has been missing in giving my curls the texture and bounce I want without the frizz factor. I use this after a leave in conditioner and a little curl cream - scrunch all over and diffuse. It *could* leave your hair crunchy if you don’t break the cast, but I diffuse in varying head positions and then use the plop and shake method to boost volume. After fully dry I just “scrunch” again here and there with my hands to break up any remaining crunchy spots.",
      "rating": 5.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Love it, Give it a try.....",
      "text": "I use a combination of products on my hair. Living in the Deep South of Florida can do a number on it. This product has enhanced my hair immensaly. Have to have it every night. Totally helps the curls come out and NO FRIZZ. I bought more to keep as a back up. Love the product. My post menapausal hair has been difficult to get a grip on.",
      "rating": 5.0,
      "verified": true,
      "author": "Wolff Den",
      "helpful_votes": 6,
      "publication_date": 20160904
    },
    {
      "title": "Does the Trick",
      "text": "My medium thickness wavy hair responded well to this - helped with curl definition and frizz control. Makes hair look healthy. Had better results with this over more expensive products.",
      "rating": 4.0,
      "verified": true,
      "author": "The Wanderer \"Wendy\"",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Curly hair queens need this",
      "text": "Yes! Absolutely loving this product. I just chopped off my hair during quarantine and this product makes it so easy to style with minimal effort. I scrunch wet hair using mouse first and then coming back in with this product. It helps maintain the curl, add hold and calm any frizz while it sets! Great thickness that is not at all sticky, easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna Harlow",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Perfect.",
      "text": "I has previously tried a sample from list and loved it for my daughters curly whirly hair. It has the perfect hold without making it hard and does not flake. I would give it 6 stars if I could. It has a light scent so does not overpower you and is not sticky. Great product and quick deliver. Will be ordering again.",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia Aguirre",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "Not the real product inside",
      "text": "It is so watery and smells nothing like the original bottle I purchased of this same product (which I bought at a retail beauty store). Worse it makes my hair limp and straight which is the opposite of what the product did before. I don’t think this is actually the product I ordered. Disappointed for sure!",
      "rating": 1.0,
      "verified": true,
      "author": "Hope Wood",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Healthy ingredients.",
      "text": "I love this hair gel. Not firm or crunchy feeling like most hair gels. My natural curls feel natural. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "lauren",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Smells amazing but left weird texture",
      "text": "This product smells SO GOOD and I appreciate that it's made with natural ingredients but unfortunately it didn't give my hair the hold I was hoping for. Additionally my curls kind of fell flat after a few hours but the gel texture remained in my hair which made it feel gross and kind of dry. I am bummed!",
      "rating": 3.0,
      "verified": true,
      "author": "mavvv",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Terrible results",
      "text": "This gel turned my fine, 2C/3A curly hair into a dry, frizzy, rat's nest. I tried using it a few times on its own or with other products, and the results were always the same - a frizzy, straw-like mess. I had high hopes for this product, but it was awful for me, I do not recommend it and honestly would give it zero stars if I could.",
      "rating": 1.0,
      "verified": true,
      "author": "AGP",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Holy grail: definitely purchase this!",
      "text": "Holy grail product!!! This gel makes all the difference on my fine, wavy hair. It makes it shiny, defined, and completely eliminates frizz. Plus, it doesn’t make me break out. See before/after (orange shirt before, black shirt after) for reference.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Oh heck no!",
      "text": "It left my curls so dry and did nothing for curl definition. Very disappointed because of the price as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Catalina Davis",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Love it!",
      "text": "This product is amazing for my curly hair. Just put it on my wet hair scrunch it and let it dry and no frizz or wait and soft without your hair feeling hard like gel does.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha Martinez",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Addicting",
      "text": "Not a stringy strand in sight. Love how my hair is not left stiff or flaky",
      "rating": 5.0,
      "verified": true,
      "author": "Cox Family",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "it does a great job. You need to apply it to wet ...",
      "text": "For the most part, it does a great job. You need to apply it to wet hair and not mess with it after for best results.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Rowley",
      "helpful_votes": 2,
      "publication_date": 20170712
    },
    {
      "title": "Love this gel",
      "text": "I’ve used this gel for years & it’s by far the best curly hair gel I’ve ever used! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "heather",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Wonderful;",
      "text": "This gel is awesome. It takes my curly hair and makes soft waves",
      "rating": 5.0,
      "verified": true,
      "author": "Margy klammer",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Not the actual product",
      "text": "This is not actually the Briogeo Curl Charisma frizz control gel. The gel that I received did not have the same scent or consistency as what I have previously purchased from the Briogeo website and it severely dried my hair. The actual product is fantastic, but I did not receive it.",
      "rating": 1.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Must-have for curly-frizzy hair sufferers",
      "text": "Curly, frizzy hair like mine needs serious taming in humidity. This stuff works and leaves my hair soft.",
      "rating": 5.0,
      "verified": true,
      "author": "IdahoMary",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Sadly disappointed",
      "text": "Dried my hair out and did not control frizz at all. I had to wash it out. Made my hair feel like straw.",
      "rating": 1.0,
      "verified": true,
      "author": "Betty Fulton",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Different",
      "text": "I love this product! But, I agree with other reviewers. The product I received has a different color and scent than the same product purchased elsewhere.",
      "rating": 3.0,
      "verified": true,
      "author": "Crimson",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Four Stars",
      "text": "It's very sticky and does the job my waves stay in place and no frizz",
      "rating": 4.0,
      "verified": true,
      "author": "Tania",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "... some reviews on YouTube have mentioned that it smells good and mine smells like they forgot to put any ...",
      "text": "This is my first time buying the product and some reviews on YouTube have mentioned that it smells good and mine smells like they forgot to put any fragrance at all in it. How does everyone else’s smell.",
      "rating": 4.0,
      "verified": true,
      "author": "Carissa Southard",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "I love this stuff",
      "text": "I love this stuff! I received a sample from ipsy and decided to buy the big bottle. I'm mixed with naturally curly hair and this worked wonders!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Owens",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Best hair gel I've ever used",
      "text": "This is my absolute favorite hair gel I've ever used. It doesn't make your hair crunchy and a little bit goes a long ways. I have super thick, curly hair and this stuff works like magic.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathryn Whitworth ",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Love this product",
      "text": "Love this product. I found out about it because it came in one of my ipsy bags. I have naturally wavy hair and this keeps it smooth and frizz free! I always get compliments on my hair when I use this",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "I love this product",
      "text": "I love this product! I have curly hair. I use this after washing my hair, just apply it and let my hair dry. It decreases frizziness and keeps the curl!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer McAdams",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Love the way it makes my hair feel",
      "text": "Love the way it makes my hair feel! My curls stay nice for more than a few hours and sometimes for more than one night.",
      "rating": 5.0,
      "verified": true,
      "author": "char-day",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Five Stars",
      "text": "Only hair gel i have found to help my hair curl and not feel crunchy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Five Stars",
      "text": "Love it!! Works just as well as the sample I got from ipsy. That's why I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Yes! Hope for frizzy girls",
      "text": "My hair gets very enthusiastic if the weather gets damp. My head assumes something like a pyramid shape. This product gives me hope. I've even had people complement me on a damp day. If I make it through the next trip all female family members are getting this for Christmas",
      "rating": 5.0,
      "verified": true,
      "author": "Lovejoysgirl",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "SKETCHY!!",
      "text": "Product arrived wrapped in clear packing tap around the top. There was NO silver seal. The gel is also a different color. Almost yellow/brownish. The sample I received of this from ipsy was clear gel.",
      "rating": 1.0,
      "verified": true,
      "author": "NurseRatchet",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Best Gel For Curls",
      "text": "This gel coaxes my coarse, porous wavy hair into pretty curls. Florida humidity does a number on my waves, and this medium-weight gel keeps it tame and mostly frizz-free. I use it with several other products, and if I run out of it, my curls are less defined and frizzy. It is the one product I can use alone and still be presentable, scrunch and go. No flakes, no scalp buildup, no irritation or dryness, light scent that quickly fades, leaves hair soft and touanle not stiff and crunchy. I continue to repurchase after getting a sample from ipsy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel King",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Nice curl gel",
      "text": "This product is a little strange. Has a lube-like consistency. But it works really well for my hair. I have wavy/curly hair. I used a leave-in conditioner followed by this product, then diffuse with my blow dryer and my hair looks great for a day or 2! After 2 sleeps my curls fall but this product is the best I've tried for my hair type. The only complaint is I wish it helped my curls stay intact longer than 2 days. #wavygurlproblems",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly Seifert",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "I love this product",
      "text": "For a girl with naturally curly hair and on the search for a product that leaves your hair feeling gorgeous.....this is it. I recently received a sample of this in my ipsy bag and became an instant believer. I love this product. It doesn't leave your hair crunchy or give you that permanently wet look. It just calms the frizz and locks in the natural curls. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 11,
      "publication_date": 20160908
    },
    {
      "title": "Feels like a fake product",
      "text": "This is not the same product I bought before. The scent is different, and it feels overall like a different product. Wondering if this is a fake one. Sad that I can't get my money back since I purchased two based on the good experience of my first purchase. Makes you wonder ....",
      "rating": 1.0,
      "verified": true,
      "author": "Mireya Donahue",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "... 3a blonde curls but this is by far my favorite. Medium hold",
      "text": "I have gone through tons of hair products for my 3a blonde curls but this is by far my favorite. Medium hold, doesn't create crunch but helps my curls clump properly and stay pretty looking all day. Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "L.A.F",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Great product!",
      "text": "Let me start by saying that I think I have tried every product out there for curly hair and most disappoint. Briogeo gel is amazing. It creates well defined curls with significantly less frizz while still leaving my hair soft. Most gels give you crunchy hair or a slightly wet look, but not this one. I am going to try the leave in treatment next and then I perhaps their other products for curly hair. The price is comparable to the Redken products I've been using.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Thompson",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "I really like this product",
      "text": "I really like this product. It leaves my hair soft after applying it. My frizz is controlled. I'm using it with the Briogeo Curl Leave In-Conditioner and it's great. I think this is my favorite Gel after trying other brands because I don't feel hardness with it. My curls rock! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Rosa",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "I loved it. Gives my curls definition without making them ...",
      "text": "I have tried many products for my curly hair. I received a sample of this a few months back in a makeup bag. I loved it. Gives my curls definition without making them crunchy.",
      "rating": 5.0,
      "verified": true,
      "author": "Chachi101",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Briogeo Road",
      "text": "My natural hair journey is taking me down many different roads. I ran into Briogeo and boy am I happy. I have fine thin 3C to 4B hair and this product does not weigh my hair down. I’m really liking it. My wash and go in the winter months look good.",
      "rating": 5.0,
      "verified": true,
      "author": "Luv2read",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Does work on the curls, but makes my hair ...",
      "text": "Does work on the curls, but makes my hair drier and hands sticky....got product suggestion from a magazine article and thought id try....gels dont usually work for my hair",
      "rating": 3.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Terrific Hair Gel",
      "text": "Fabulous ship time and good packaging. Very nice product for aiding my curls to be gentle with no crusty product firmness!",
      "rating": 5.0,
      "verified": true,
      "author": "CATherine H.",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Brings out my curls",
      "text": "Love it. When blow drying with correct dryer and this product I get more culrs",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Love!",
      "text": "My hair is short, straight on top, curly, wavy on the bottom & out of control! I love this gel, my hair actually feels soft after blow drying & using a straightening iron now! No more frizzy straw!",
      "rating": 5.0,
      "verified": true,
      "author": "Cuzzisaidso0",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "love the smell and its weird",
      "text": "love the smell and its weird, because when you put it on wet hair, it foams. dries nice and not flaky or hard",
      "rating": 4.0,
      "verified": true,
      "author": "applebottom",
      "helpful_votes": 2,
      "publication_date": 20170228
    },
    {
      "title": "Doesn’t work",
      "text": "I have thick coarse hair and it did absolutely nothing for me. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Cangibbs",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Curl Charisma works great!!",
      "text": "Briogeo Curl Charisma really works great on my hair.. It makes my curls stay soft and look really shiney.. I am happy with the results and will order this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorraine Sederio",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Three Stars",
      "text": "It doesn't keep my naturally curly hair curly and leaves a white residue on my hair.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Straw hair",
      "text": "Have very thick dry curly hair. Dried my hair out. Made it feel like straw. Have tried so many products for my hair and this was one of the worse ones. My hunt continues for the product for my hair that works",
      "rating": 1.0,
      "verified": true,
      "author": "Gail C",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Mixed feelings",
      "text": "I had previously received a sample size of this product and loved it, however, shortly after receiving this item, the gel seemed to change in consistency and began to have a waxy odor. It's as if the product was breaking down.",
      "rating": 2.0,
      "verified": true,
      "author": "Christy M. Garcia",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Good product",
      "text": "Works good. I prefer a little bit stronger for my naturally dry curly hair . Also a decent price! Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa McNatt",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Good for frizzy curly hair",
      "text": "Works well to tame frizz on my naturally curly hair, not fond of the smell.",
      "rating": 4.0,
      "verified": true,
      "author": "Kirstie",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Great stuff!",
      "text": "I LOVE THIS FOR MY CURLY HAIR! Gives definition without the \"crunchiness\".",
      "rating": 5.0,
      "verified": true,
      "author": "J. Szmyd",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "... isn't a curl gel that is as light and easy to blow dry as this",
      "text": "There isn't a curl gel that is as light and easy to blow dry as this. I only have to apply a little to damp hair and my curls are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Heistan",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Best curl product ever",
      "text": "Best curl product ever. The only one that I can simple air dry once in and let it air dry and end up with no frizz.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Love it",
      "text": "I love the soft control this gives and how it helps my curls.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Good stuff",
      "text": "Love this product for curly hair. My most recent purchase was really runny though. Usually it's more of a firm gel.",
      "rating": 4.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Perfect for very curly hair",
      "text": "Perfect for very curly hair. Does not make hair hard. Enhances curls and takes away the frizz!! Best product on the market for natural curls!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Lee Carder",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Waste of money",
      "text": "Does not tame frizz for curly hair at all. Expensive for doing absolutely nothing. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd S. Lisk",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "Love",
      "text": "Love this stuff! Keeps my curls looking great. I just wash my hair put a small dab of gel in and towel dry then out the door for an all day curl control!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Herrera",
      "helpful_votes": 0,
      "publication_date": 20170226
    }
  ],
  "product_meta": {
    "title": "Briogeo Curl Charisma Frizz Control Gel, 5.5 oz",
    "rating": 4.2,
    "feature_bullets": [
      "GELLED TO PERFECTION: Curl Charisma Rice Amino + Quinoa Frizz Control Gel provides light to medium hold for long-lasting, natural-looking definition with superior movement, shine, and softness. Quinoa extract and keratin amino acids strengthen strands and increase elasticity to protect against damage while shea butter moisturizes, softens and hydrates curls.",
      "NATURAL FRIZZ CONTROL FOR CURLY HAIR: This unique gel contains a unique combination of natural ingredients including rice amino acids and tomato fruit ferment that smooth and seal the hair cuticle to lock out frizz-causing environmental moisture and promote consistent curl formation. It is ideal for those with wavy and curly hair texture types (2A to 3C).",
      "ADDITIVE AND CRUELTY-FREE: Briogeo is proud to say that Curl Charisma Rice Amino + Quinoa Frizz Control Gel is 93% naturally derived. Specially formulated, this product for curly, frizzy hair does not include sulfates, silicones, phthalates, parabens, DEA, or artificial dyes. It is certified gluten-free and cruelty-free so you can feel good about looking good!",
      "PERFECT FOR TREATED HAIR: The incredible ingredients in the Curl Charisma Rice Amino + Quinoa Frizz Control Gel make it the ideal formulation for styling and maintaining treated hair. Whether you routinely color your hair or use a keratin or chemical treatment, the unique blend of nutrients will help keep your hair looking and feeling its best!",
      "ABOUT BRIOGEO: Beauty shouldn’t be compromised by harsh or harmful ingredients. Briogeo offers a high-performance hair care collection that is naturally based, yet performance driven to provide visible results. All Briogeo formulas live up to their performance claims – providing the vibrant, beautiful and healthy hair we constantly strive to achieve."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3 x 6 x 9 inches; 0.01 Ounces",
      "Item model number": "SG_B01DZJIKG8_US",
      "UPC": "019962432149",
      "Manufacturer": "PerfumeWorldWide, Inc. Drop Ship",
      "ASIN": "B01DZJIKG8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Gels",
      "Hair Care",
      "Styling Products",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}