{
  "website_summaries": [
    {
      "verdict": "The perfect cruiser type of fat bike that is at home on snowy and sandy surfaces.",
      "pros": [
        "Smaller lugs on the tires decreases rolling resistance on hard and loose surfaces such as sand and asphalt",
        "Aluminum rims decrease the weight of the bike"
      ],
      "cons": [
        "The included coaster brake lacks the immediate stopping power of more traditional disc brakes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poor Engineering",
      "text": "for 1, rear driver broke within the 1st 2 days of owning this bicycle. the front brakes don't work and are rubbing on the caliper bracket along with a warped brake disc. if there were no issues out of the box apon retrieval, id of given this product a solid 3 stars. being that the product doesnt meet my product usability im leaving this at 1. LEARN HOW TO MAKE PROPER BICYCLES!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Nicholas E.",
      "helpful_votes": 7,
      "publication_date": 20190529
    },
    {
      "title": "Manufacture Defect in Front Fork Brake Caliper mount",
      "text": "The mount for the front brake caliper on the front fork is clearly not aligned. It's angled and off-center. The user will need to make a shim plate about 1/16 thick that is wedged-shaped like the blade of a knife. In fact, you can use a blade about 3 inches long, drill the holes and carve out some steel with a handheld grinder. The bike is a single speed and with tires inflated to 20 PSI, still doesn't coast very far. Brakes will not be required very often unless you are riding down a hill. Fat Tire Bike = High Pedal effort.",
      "rating": 2.0,
      "verified": true,
      "author": "Technical Consumer",
      "helpful_votes": 2,
      "publication_date": 20191122
    },
    {
      "title": "Hot boys bike",
      "text": "This bike was huge surprise when it arrive two days after I ordered it. I was not expecting it to be as nice and well built as it is. Some assembly required, wrench and screw driver to put on the front wheel, handle bars, pedals and tighten and position reflectors. My Grandson is going to love this bike. It has bad a$$ written all over it. Extremely satisfied with this vendor and product.",
      "rating": 5.0,
      "verified": true,
      "author": "turbo50t",
      "helpful_votes": 5,
      "publication_date": 20171205
    },
    {
      "title": "Bought 2,, both defective.",
      "text": "I bought 2 bikes. The first one the front fork blades were too close together, I couldn't get the front wheel axle on. I tried prying the fork blades apart a little by hand,, but they were welded too tight. Then I ordered a 2nd one to replace the 1st. I was thinking maybe during shipping the box might've gotten a little crushed and squeezed the fork too tight. Anyway, the 2nd came in with the same issue. I returned both. It could've been a good bike, everything else seemed to made ok. I'm debating if I want to try a 3rd,,, they say 3 times is a charm. 😜",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff S. ",
      "helpful_votes": 5,
      "publication_date": 20161023
    },
    {
      "title": "He liked it.",
      "text": "He liked it...and thats all that matters to me...there is a sound coming from the rear bearing area but he doesnt want me to have it checked out....its only when he is coasting that the sound is heard...i hope its ok cause he would be heartbroken if i told him we had to send it back",
      "rating": 5.0,
      "verified": true,
      "author": "gene martin",
      "helpful_votes": 20,
      "publication_date": 20150903
    },
    {
      "title": "The bike is not worth it",
      "text": "I’ve had so much problem with it, first the brakes didn’t work that I had to fix myself and they got worse again, the front tire always got loose but I sealed with it and tighten it again. And by time goes everything on the bike is getting looser, the handle bars started moving. Got flat once, for only my son using it on the street",
      "rating": 1.0,
      "verified": true,
      "author": "FaMo",
      "helpful_votes": 2,
      "publication_date": 20190809
    },
    {
      "title": "Handle bars way to low.... need ...",
      "text": "Handle bars way to low....need to be at least 6-8 inches higher. Brake mechanism was set/ adjusted much too tightly (very little clearance between brake pad and brake plate...kept scraping until I really loosened it up all the way on adjustment screws. Seat is EXTEMELY uncomfortable. Manufacturer needs to provide a wider, more padded seat!!",
      "rating": 3.0,
      "verified": true,
      "author": "Nick Dennis",
      "helpful_votes": 4,
      "publication_date": 20180610
    },
    {
      "title": "Front wheel won't fit into place  axel too wide for slot.",
      "text": "Front wheel won't ft into space. It's too tight Kid is crying and wants too ride his bike. Help!! Three weeks later and the only response from the country is that they are inconvenienced but Covid. She needs the wheel replaced or some recommendation as to how to remedy this situation. Summer will be over before the kid can ride his new bike I'm afraid. Please help here.",
      "rating": 1.0,
      "verified": true,
      "author": "Joan",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "VERY SMALL-BROKEN HEART",
      "text": "This bike is so much smaller than advertised in my opinion. \"MENS CRUSHER DYNACRAFT FAT TIRE BIKE\"...NO WAY ITS MENS....My Sons Walmart 20\" BMX is way bigger than this thing. He wanted a fat tire and we thought since the cheapo 20\" from walmart was still perfect for him, we would get this one. It was for his Birthday and he is so upset. This bike was a total waste of money as he cant even ride it because it's so small even with handle bars and seat maxed. I DO NOT RECOMMEND this bike period. Now we have to cough up the 300+ for an adult size plus the $110 invested in this junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Great bike at a great price",
      "text": "Got this bike for my 9 year old grandson and he loves it especially the fat tires. Pretty easy to assemble, great quality and the price was amazing. 1/2 the price of a bike I was going to buy in Kmart. Ya can’t beat it. I do wish it had speeds but grandson doesn’t see, to mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Lola Fanelli",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Good looking bike, brake is a little difficult to get used to",
      "text": "The fat tires looks great. But my 9 year old has difficulty braking. He is not used to it and he found it difficult to get used to. He practices emergency braking, he failed. At times, he thinks the gearing is too tall. But the brake is his most complain.",
      "rating": 3.0,
      "verified": true,
      "author": "HARRY M",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Sweet bikes great price!!",
      "text": "I bought two of these for my 5&7 year old. It's a little big for my 5 year old but he manages pretty good. These are very cool bikes and fairly easy to put together. I was able to accomplish it with one tool and without my husband! The rear tire was a little crooked and rubbed the chain on one of the bikes but it was easily fixed. I can't get them off the bikes so I would say they are a huge success!",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 3,
      "publication_date": 20150804
    },
    {
      "title": "It was fairly easy to assemble (well",
      "text": "My 7 year old has had this bike for a few weeks. It was fairly easy to assemble (well, my husband did it. But it looked like it was easy!). It looks really cool. It's flashy and my son loves the tires. I was looking for a 16 in frame with the foot brakes - it is the size that I was looking for and the seat is in the lowest position (he is 51 in). The only thing I don't like is that the paint has already scratched on the handle bars due to it falling over/him dropping it. I can imagine it will look pretty beat up in a few months. Overall, I'm very happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren A. Kenny",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "Great quality, good price, easy to assemble",
      "text": "Great quality, good price, easy to assemble, works great here on the beach at low tide",
      "rating": 5.0,
      "verified": true,
      "author": "Credo",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Very \"cool\" bike",
      "text": "Great bike, easy to maneuver. We bought this for our 7yo boy's birthday and it's the perfect size. He thinks the fat tires are \"cool\" and he gets lots of compliments. Fast and easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 7,
      "publication_date": 20150705
    },
    {
      "title": "Smooth riding.",
      "text": "Our 2nd grade son uses this bike. The fat tires are the talk of the neighborhood and the slick tires make it very easy to roll. While it does weigh slightly more than a typical bike of this size, he rode it no problem on the first try and even enjoys taking it off the road.",
      "rating": 5.0,
      "verified": true,
      "author": "J Howard",
      "helpful_votes": 3,
      "publication_date": 20161126
    },
    {
      "title": "Tiers are worthless",
      "text": "The side of the tire said 20psi max so I aired it up to 15 psi...before I could even start on the second one the tire popped off the rim and then the tube exploded...",
      "rating": 1.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "... old is thrilled with the bike and it's a great fit for him",
      "text": "My 7 year old is thrilled with the bike and it's a great fit for him. The frame piece that fits on to the tire on one side was bent and required some muscle to pull it out for assembly, hence the 4 stars instead of 5.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaymichael P. Neill",
      "helpful_votes": 3,
      "publication_date": 20160711
    },
    {
      "title": "Great bike and better than described.",
      "text": "As described and my grandson, which is almost 9 loves it! This is a great bike for the money. Highly recommend this little bike.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Just so so",
      "text": "Nice looking bike but not comfortable for my grandson, it’s either too low or too high. Adjustments don’t help. Seat twists.",
      "rating": 2.0,
      "verified": true,
      "author": "lisa sodergren",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Easy assembly. Looks cool!",
      "text": "Very easy assembly. Rides nice, brakes well. Looks cool. Only down fall, tire front tire can rub your foot while on petal when making sharp turns.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Drake",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Amazing Value",
      "text": "An outstanding well made bike at a surprisingly low price. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack  Ryan",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Instruction manual is useless",
      "text": "The owner's manual is generic; for all Dynacraft BMX models 12\" to 24\". None of the assembly instructions match the actual model. Luckily, it not difficult to put together. You will need Allen wrenches. The bike itself is okay. Son-in-law needed a model for 300+ pounds, so our options were limited and over-priced. It's holding up so far.",
      "rating": 3.0,
      "verified": true,
      "author": "James E Thomas",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Its a good bike",
      "text": "Fun to use and easy to assemble but if you ride it for a long time/to much it will stop working and the wheels dont pop that easily so its pretty much good!! And I like the bike and review if you have something to say about it",
      "rating": 5.0,
      "verified": true,
      "author": "John M. Matt Zengler",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "my son had a hard time getting balance but this ...",
      "text": "my son had a hard time getting balance but this bike helped him with getting his balance while riding his bike.",
      "rating": 5.0,
      "verified": true,
      "author": "coffeelover84",
      "helpful_votes": 2,
      "publication_date": 20160824
    },
    {
      "title": "Very nice, great looking bike",
      "text": "This is a very nice quality bike and my son loves it. The large tires and very cool and he has really enjoyed racing around on this bike. All the neighborhood boys are jealous. :)",
      "rating": 5.0,
      "verified": true,
      "author": "John Shaw",
      "helpful_votes": 2,
      "publication_date": 20151013
    },
    {
      "title": "Great for a tall 7 year old.",
      "text": "Great-grand-son loves it and grandpa had no problems putting it together, they said it seemed sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda D.",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Great product",
      "text": "I absolutely love this bike! I bought it for my 10 year old son for Christmas and he loves it!! The only bad thing is the seat is really hard and hurts your bottom, but other than that great bike!!",
      "rating": 5.0,
      "verified": true,
      "author": "Yalanda Mccord",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "thus boys can't trash these super strong bikes",
      "text": "Bought 2 for my grandsons to ride at my farm. Very big wheels so they won't 'skid' well... thus boys can't trash these super strong bikes. Coaster brake ideal for bikes that only get ridden on weekends:)",
      "rating": 5.0,
      "verified": true,
      "author": "A. Gage",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Gotta go fast :/",
      "text": "My son loves this bike, but it came with some deep gauges in the paint, and it seems very hard to pedal even with the wheel in the air. Maybe a bad berring or the chain is simply too tight. He is happy with it, so we have kept it, but I am not satisfied.",
      "rating": 2.0,
      "verified": true,
      "author": "R. H. Munny",
      "helpful_votes": 3,
      "publication_date": 20150711
    },
    {
      "title": "Great Christmas gift.",
      "text": "It was very easy to assemble. Looks really good in red and black. My 8 year old nephew is going to love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Have to put together",
      "text": "Have not put bike together yet but once I do I will let you know if my grandson likes it",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Walker",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "probably bent like that because to much weight stacked on it",
      "text": "Everything was there and went to put it together and had alittle trouble getting the front wheel mounted cause the front forks were squeezed together.... was able to bend them out enough to mount the wheel....probably bent like that because to much weight stacked on it...the bike turned out great and my son loves it...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "... through water u get ur back wet other wise nice",
      "text": "no fender on back wheel so if going through water u get ur back wet other wise nice bike",
      "rating": 3.0,
      "verified": true,
      "author": "larry hatcher",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Just check everything when you get it",
      "text": "I do enjoy riding. When I got mine it came with corroded brake cables. Other than that, it is worth it",
      "rating": 3.0,
      "verified": true,
      "author": "Patrick Laymon",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Squeaky Brakes",
      "text": "We love the bike, the brake system is a easy to adjust, however, if you tighten it enough to work properly the discs squeak.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark ",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "durable rugged bike. quality bike for reasonable price! ...",
      "text": "durable rugged bike. quality bike for reasonable price! my son loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey Neumuth",
      "helpful_votes": 2,
      "publication_date": 20160919
    },
    {
      "title": "Birthday gift",
      "text": "My Grandson loves his bike he received for his 6th birthday.",
      "rating": 4.0,
      "verified": true,
      "author": "34SmashNeal",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "Need for speed..just not on this one.",
      "text": "Stylish bike for 6-9 yr old . However my 7 yr old still rides his old one. ( which of course i don't like and want to scrap) He states this new bike is slower. Still rides it occasionaly...but honestly this bike is just not meant for speed. It is slow(due to tires) Good looking cruiser still. Keep purpose in mind for your child. Also company will not take back witnout a hefty price.* note that .*",
      "rating": 2.0,
      "verified": true,
      "author": "Endless Summer",
      "helpful_votes": 3,
      "publication_date": 20170418
    },
    {
      "title": "Cool Red Breeze",
      "text": "My little boy had chosen this bike on a previous visit to a popular toy store. But I decided to check Amazon for pricing and delivery charges. Amazon was the winner by a TKO. He loves the bike and his father put it together easily. It's gorgeous and he is very happy with his chose. Red is his favorite color. I then purchased a \"cool\" helmet to match from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Dusty Kelly",
      "helpful_votes": 5,
      "publication_date": 20150526
    },
    {
      "title": "Five Stars",
      "text": "Assembly took me a while, but my Grandson loves the bike.",
      "rating": 5.0,
      "verified": true,
      "author": "AMB",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Three Stars",
      "text": "wheels not trued and large tires make it heavy for child",
      "rating": 3.0,
      "verified": true,
      "author": "Christine spigner",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Five Stars",
      "text": "My 7 yr son is really happy with the bike. Its really worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "SAMerica",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Great Bike",
      "text": "The package arrived quickly and the bike was easy to put together. I thought it would be much more difficult to assemble. My son loves this bike. He says its fast. I'd recommend this bike for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20150922
    },
    {
      "title": "Beautiful bike and great delivery",
      "text": "Fast delivery and the bike is very beautiful. He love it. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Lion ",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "He loves it and it was very easy to assemble",
      "text": "Exactly what my son wanted!! He loves it and it was very easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel D. Leon",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "This is a very pretty bike though if it fits the needs",
      "text": "Although description does not mention it, the frame is actually 16\", the tires are 20\". Will need to return since was looking for a 20\" bike for my grandson. This is a very pretty bike though if it fits the needs. Box says for ages 6-10.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe K",
      "helpful_votes": 17,
      "publication_date": 20141206
    },
    {
      "title": "Great bike for my 8 year old son",
      "text": "Great bike for my 8 year old son. He loved it and rides everyday. The bike was decent quality for the price. It had a scratch on the frame and he seat was ripped. Amazon gave me 15.00 credit to replace the seat.",
      "rating": 4.0,
      "verified": true,
      "author": "charles shattuck",
      "helpful_votes": 3,
      "publication_date": 20150910
    },
    {
      "title": "Great bike",
      "text": "I got this for my 8 year old son, he says it is great, he loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "charles lanning",
      "helpful_votes": 2,
      "publication_date": 20150809
    },
    {
      "title": "This bike was too low and difficult to peddle with ...",
      "text": "This bike was too low and difficult to peddle with two wheels. The training wheels were hard to find it even.",
      "rating": 2.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Five Stars",
      "text": "my ten year old loved this bike but he out grew it",
      "rating": 5.0,
      "verified": true,
      "author": "petter cottontail",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "My grandson loved the bike and especially the large tires",
      "text": "My grandson loved the bike and especially the large tires. I love that it is a bike without gears and handle bar brakes. Pure enjoyment.",
      "rating": 5.0,
      "verified": true,
      "author": "celeste brooks",
      "helpful_votes": 2,
      "publication_date": 20150203
    },
    {
      "title": "Other than that it's a good",
      "text": "The bike is a oil small for a 20in. Other than that it's a good bike",
      "rating": 3.0,
      "verified": true,
      "author": "lakeisha Dorsey",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "I would have loved it if the rear tire was properly installed and ...",
      "text": "I would have loved it if the rear tire was properly installed and the chain didn't rub on the tire and chain guard. I must say, however, that once I realigned the rear tire, I couldn't be happier with the bike.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles W. Higgins",
      "helpful_votes": 4,
      "publication_date": 20150714
    }
  ],
  "product_meta": {
    "title": "Krusher Men's Dynacraft Fat Tire Bike",
    "description": "Ride over rough terrains and through all types of weather conditions with the 26 inch Dynacraft krusher fat tire men's' Bike, which features a robust construction and a steel frame that offers a durable hold. As you drive over sand or through snowy paths, use the mountain-bike-style handlebar to steer, and stop on a dime thanks to the disc brakes. The kickstand holds your sporty ride up until you're ready for your next journey.",
    "rating": 4.2,
    "feature_bullets": [
      "Deluxe steel frame",
      "Super fat stomper tires",
      "Features mountain bike style handlebars, three-piece crank, adjustable seat post and decorated aluminum rims",
      "Rear coaster brake",
      "Single-speed bike"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "76 x 23 x 41 inches; 45.19 Pounds",
      "Item model number": "8208-42TJ",
      "Department": "Mens",
      "Date First Available": "May 20, 2016",
      "Manufacturer": "Dynacraft BSC Inc. (Dropship)",
      "ASIN": "B01DL09A6A",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Bikes",
      "Sports & Outdoors",
      "Cycling",
      "Outdoor Recreation"
    ],
    "price": ""
  }
}