{
  "website_summaries": [
    {
      "verdict": "The industrial fan of choice for personal use in smaller spaces. 30-inch width is perfect for direct airflow over a single area.",
      "pros": [
        "Produces some of the greatest airflow in a 360-degree arc",
        "Fully oscillating to change the direction as it moves"
      ],
      "cons": [
        "More expense for a smaller single direction fan"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love the fan, but hate the 1965 James bond control box.",
      "text": "This might cut your head off. As others have stated the blades are like dull machetes, The fan for 75 dollars is a steal. The speed controller is like a 1975 bad movie box. Clumsy large and ....well useless. I love the fan. I am remodeling my house and put a fan box in the living room. In the summer my dog pants and gives me an approving node of thanks. The rod can be cut, I cut mine from 18 inches to 8. It really for the price is a not thought buy, the on;ly issues are the blades are metal and the rod might need to be cut and a hoel drilled for the retaining pin. No worries.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Happy Joy joy",
      "helpful_votes": 9,
      "publication_date": 20180531
    },
    {
      "title": "ATTRACTIVE , LIGHT , AND QUIET",
      "text": "This is a lightweight attractive product that runs a quietly as a quartz watch. installation difficulty is moderate for the average home handyman. The simple and reliable pull chain permits speed settings and directional reversal.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank M. Buselli",
      "helpful_votes": 5,
      "publication_date": 20180601
    },
    {
      "title": "Just as advertised",
      "text": "It works as intended for covered open on 3 sides deck 12’x30’. Mine runs quiet and steady with plenty of airflow. The wall controller is old school which is fine for the industrial type it advertises to be. I did not want a remote. The switch and fan are incredibly simple to wire. After using it a while I’ve found it to be deadly to hummingbirds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Nice fan",
      "text": "Very nice looking fan. I didn’t use the supplied controller. I used the Westinghouse wall controller instead. The only problem with using the wall controller is that you can’t change fan direction. It was set up for summer which is fine because I live in Florida. It does a decent job but I wish it would move a little more air.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard J ",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Industrial Fan",
      "text": "Didn’t like that there wasn’t any way to balance the fan. Liked that it is very quite. Does move a lot of air.",
      "rating": 4.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 3,
      "publication_date": 20181019
    },
    {
      "title": "... in my 900 sq ft garage and it works great. Moved tons of air",
      "text": "installed in my 900 sq ft garage and it works great. Moved tons of air. didn't use the controller included because it was big and looked out of date.",
      "rating": 5.0,
      "verified": true,
      "author": "Natuna Nguyen",
      "helpful_votes": 5,
      "publication_date": 20170612
    },
    {
      "title": "Speeds do not work",
      "text": "Make sure that your wiring supports the speeds. We have a new home and the speeds do not work. Skip the remote and buy a wireless remote.",
      "rating": 2.0,
      "verified": true,
      "author": "Xavior Bringas",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Not much airflow",
      "text": "Do not like this fan. Does not put out much airflow. The wall control is huge and extremely bulky. Recommend buying a $9 wall control until that can integrate with your existing light switch and looks much better. Not satisfied with the performance of the fan. The noise level is just fine, just wish it actually pushed air much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great basic long lasting fan",
      "text": "Like the headline says, this is a great, basic, long lasting fan. Purchased this one to replace one I had outside on my terrace (10 years old). The old one was working flawlessly, but had rust stains all over (they are not stainless steel), so, for aesthetics, I opted to change it. FYI, they are NOT bidirectional.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcos Cifuentes",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Great fan but...",
      "text": "This fan is good but it is Crazy loud and you can’t control the speed",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Good fans.",
      "text": "Really nice fans. I thought they would generate more air flow.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel Dabadie",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Metal blades survives Texas heat and winds for patio fan!",
      "text": "For once I have a fan that can survive the Texas heat and winds as an outdoor patio fan! With other plastic blade fans the Texas heat would make them droop and with the winds a standard fan with weak arms would bend. This fan is solid, sturdy metal blades and sturd metal arms securing the blades. Would have given it five stars but the wall switch, works fine, is a little cheap.",
      "rating": 4.0,
      "verified": true,
      "author": "cjhoff",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "wonderful ceiling fan",
      "text": "great fan. really stirs up the air and cools off two rooms living area and kitchen. thanks, chi",
      "rating": 5.0,
      "verified": true,
      "author": "pili",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Great fan, very large controller included.",
      "text": "Used this in my living room with raised ceiling, I only usually need to run it on low as it moves air nicely. The controller that comes with it is a bit cumbersome, I bought a separate one and it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "George Spalholz",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Good fan",
      "text": "Good fan and nice switch. Works and looks good. I would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "DAD",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Very good quality",
      "text": "No problems so far!! Very easy to install and didn't take that long to put together",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190221
    },
    {
      "title": "Best quality and value you can fine anywhere!!!",
      "text": "Great product, looks great and good quality, I bought this for my garage with speed selection switch option all works great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sal",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Good product",
      "text": "Good product. Installed in me garage, just the look I was going for!",
      "rating": 5.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Awesome fan",
      "text": "We love our fan. It looks exactly as it appeared on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Marlene Kirby",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Good fan love the speed settings",
      "text": "Great fan moves alot of air Wide range of speed settings",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "The fan itself works very nicely for a singular directional fan",
      "text": "I purchased 4 of these fans for my shop 2 yrs ago. The 12\" down rod is too short and had to make my own out of 1/2\" pipe for half the cost of replacement down rod. Its just a matter of cutting to length and drill hole for the pins. The fan itself works very nicely for a singular directional fan. What I mean is it is not reversible and the controller is rather old resistor style. It may not be what you want for your livingroom, but works just fine for a garage or shop. I give it 4 stars only because of the short down rod and not reversible.",
      "rating": 4.0,
      "verified": false,
      "author": "Drew",
      "helpful_votes": 2,
      "publication_date": 20170606
    }
  ],
  "product_meta": {
    "title": "Ciata Lighting Industrial 56 Inch Three Blade Indoor Ceiling Fan, with Steel Blades - Brushed Nickel",
    "description": "Color:Brushed Nickel\n\nWith great features and manufactured for long-lasting substantial durability, the Ciata Lighting Industrial 56 Inch Three Blade Indoor Ceiling Fan has been designed for Industrial and residential applications and is meant for providing excellent Airflow. Designed for Indoorapplication use and ETL listed for safety standards, the Ciata Industrial fan characteristics include airflow of 5972.83CFM and efficiency rating of 97 cfm per watt. Featuring a down rod size of 12 inches, this fan is the perfect choice for greater air circulation and quick cooling.\n\nSpecifications\n\n★Style: Modern\n\n★Material: Steel\n\n★Primary Blade Finish: Brushed Nickel\n\n★Blade Pitch (in degrees):8\n\n★Mount Type: Down Rod Only\n\n★Lead Wire Length: 54 inches\n\n★Slope Angle: 24 degrees\n\n★RPM (High):265\n\n★AMP (High): 0.52\n\n★Location: Indoor\n\n★Number of Blades: 3",
    "rating": 4.1,
    "feature_bullets": [
      "Manufactured for long-lasting and substantial durability, the Ciata Lighting Industrial 56 Inch Three Blade Indoor Ceiling Fan has been designed specifically for Industrial and residential applications and is meant for providing excellent Airflow to any setting in which it is installed.",
      "Featuring a Cold rolled steel motor with single capacitor for powerful air circulation, RPM being 265 per minutes and Ampere 0.52 respectively. The Industrial fan features 5 speed wall control and also includes ball hanger installation system for easy installation.",
      "Designed for Indoor application use and ETL listed for safety standards, The Ciata Industrial Fan characteristics include an excellent airflow of 5972.83CFM and airflow efficiency rating of 97 cfm per watt, using only 62 watts of energy without light.",
      "Highlights of the Ciata Industrial light includes a fan width of 56 inch three blade Steel material fan in brushed nickel finish and has a blade pitch of 8(in degrees) and has a dimension of 24.44 inches length and 5.81 width for wider air circulation.",
      "Product specifications and technical details include 12-inch down rod, 54-inch lead wire and a Slope Angle of 24 degrees. The length of the Canopy from the top to Bottom of the blade: 17.32 inches, and from the top of the Canopy to the Bottom of the canopy being 2.44 inches."
    ],
    "specifications": {
      "Manufacturer": "Ciata Lighting",
      "Item Weight": "16.57 pounds",
      "Package Dimensions": "26 x 9 x 9 inches",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1 Pack",
      "Color": "Brushed Nickel",
      "Style": "Modern",
      "Finish": "Brushed Nickel with Brushed Nickel Blades",
      "Material": "Aluminum",
      "Power Source": "Corded-Electric",
      "Wattage": "62 watts",
      "Item Package Quantity": "2",
      "Air Flow Capacity": "5973 Cubic Feet Per Minute",
      "Type of Bulb": "Not Applicable",
      "Blade Length": "24.44 Inches",
      "Teeth Per Inch": "8 Teeth per Inch",
      "Speed": "5",
      "Cutting Diameter": "56 Inches",
      "Coverage": "Large Room- Ideal for rooms over 400 square feet",
      "Plug Profile": "Downrod Mount",
      "Special Features": "Durable construction, steel blades; perfect for commercial use",
      "Usage": "Designed for indoor use",
      "Included Components": "Ceiling fan, down rod, ball-hanger installation system, and five-speed wall control unit.",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Assembled Diameter": "56 Inches",
      "ASIN": "B01D1Z5XR0",
      "Customer Reviews": "4.1 out of 5 stars49 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#142,971 in Tools & Home Improvement",
      "Date First Available": "March 16, 2016"
    },
    "categories": [
      "Ceiling Fans & Accessories",
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Ceiling Fans"
    ],
    "price": 81.76
  }
}