{
  "website_summaries": [
    {
      "verdict": "A good choice for insect control, but if you need diatomaceous earth for other purposes, you should consider one of the food grade brands",
      "pros": [
        "Rated specifically for eliminating insects",
        "Pure diatomaceous earth for killing numerous pests, including ants, roaches, fleas, bedbugs, and more"
      ],
      "cons": [
        "It's not food grade quality, so it's not as versatile as other formulas",
        "Messy to apply",
        "Not all users found it effective"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "it works!",
      "text": "I'll make this quick. \"Had\" ants. Thank you for reading :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny",
      "helpful_votes": 565,
      "publication_date": 20170128
    },
    {
      "title": "Amazingly worked",
      "text": "For over a year I fought with bed bugs. Everyone would tell me to spray 90% alcohol and it would get rid of the bed bugs. This only killed those that I saw. However, after putting out this diatomaceous earth, it killed all of the bedbugs easily. Have not seen one in months. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason G",
      "helpful_votes": 232,
      "publication_date": 20170828
    },
    {
      "title": "Cannot say enough about this product. We wish we ...",
      "text": "Cannot say enough about this product. We wish we had never had the issue of bed bugs -- but unfortunately it can happen to even the cleanest person -- this product helps you \"rest\" a little easier.",
      "rating": 5.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 188,
      "publication_date": 20170529
    },
    {
      "title": "Awesome",
      "text": "Never could even think of getting rid of the roaches in my apt. Until now. Dusted twice and they are gone. I can't believe how easy it was plus no toxicity. I have pets so this was the best thing I've purchased ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 325,
      "publication_date": 20161107
    },
    {
      "title": "Effective against roaches.",
      "text": "I had given up all hopes of getting rid of roaches. My apartment was infested and I used sprays, traps and tablets but of no avail. This powder has been very effective if used as per guidelines and I have suggested it to others too.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Khalid Hussain Bhat",
      "helpful_votes": 55,
      "publication_date": 20180929
    },
    {
      "title": "Be sure it's \"Food Grade\".",
      "text": "I had forgotten to make sure my purchase was \"food grade,\" so I exchanged it. Make no mistake about how immediate this is inhaled into your lungs; be prepared with the proper protections - even when just opening the bag or container - most of us do not have experience handling this product. It measures so unbelievably fine I believe it takes to the air just on the energy air creates no draft or breeze necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Moran",
      "helpful_votes": 47,
      "publication_date": 20181003
    },
    {
      "title": "Palmettos Bugs 1 Me 0",
      "text": "Absolutely does nothing for Palmettos. I watched one make his way through it as if a human walking through snow. Pretty sure he laughed at me too but can't confirm.",
      "rating": 1.0,
      "verified": true,
      "author": "Misty Weaver",
      "helpful_votes": 69,
      "publication_date": 20170806
    },
    {
      "title": "No More Bug Bites",
      "text": "I have NO idea what kind of bugs were eating me and my kids alive as I could not SEE anything after turning everything upside down. But the horrid bites all over was evidence that there were bugs . I spread this all over my house and sure it is messy but it works. Last night we all slept soundly- no more bites. I cannot use anything toxic with my kids and animals so this was a godsend. Such an inexpensive solution!",
      "rating": 5.0,
      "verified": true,
      "author": "Lia Lee",
      "helpful_votes": 35,
      "publication_date": 20181117
    },
    {
      "title": "Be careful not to breathe this stuff",
      "text": "Effective. We dusted this along our headboard, between the mattress and the box spring, and in other nooks and crannies where bugs might hide. But be careful. This product is so fine, it's easy to get into the air. Don't run fans in the room while you have this around, and if you spend a pronged time applying this, maybe consider covering your mouth and nose. Vacuum up the remains once you've confirmed no more bugs. You don't want to get too much of this into your lungs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20181205
    },
    {
      "title": "Didnt work Made problem worse",
      "text": "It didnt work at all. The fire ants in FL are very very hard to kill. You have to use some serious killer to get rid of them. I was hoping so badly this would work but they actually USED it to build bigger nests. So not only did it not work but it made the issue worse for us. it may work wonderfully for the other customers maybe trying to kill non fire ant species. We have 4 kids and a dog so we really wanted this safe option but it simply didnt work at all for us.",
      "rating": 1.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 23,
      "publication_date": 20180821
    },
    {
      "title": "Bed bug infestation",
      "text": "I had high Hope's for this, that this would work and finally take care of the bug problems we have been battling since my uncle stayed with us for Thanksgiving and brought this problem and we have been struggling every since. Nothing has worked so far and after doing research and seeing all the reviews I ordered thinking this would be the answer to sleep again. But its 230a.m and I'm up just killed a blood sucker right on my pillow and now I cant sleep!!! I just put this down today and this didn't even phase them the least bit. I just want to scream",
      "rating": 1.0,
      "verified": true,
      "author": "Nikki Miller",
      "helpful_votes": 22,
      "publication_date": 20190130
    },
    {
      "title": "Bed bug control",
      "text": "I found a single bed bug in my bed after I got up one morning. I have someone close to me who recently treated for an infestation. So I freaked out and looked up everything I could to treat or prevent. After tearing my room apart and finding nothing I puffed this onto my boxspring, mattress, bedframe, headboard, around the feet of my furniture, and the corners of my room. It makes me feel better knowing that this barrier is between me and anything else that could be out. I've also used it in my garage where ants seem to always walk and I haven't seen any evidence of them since!",
      "rating": 5.0,
      "verified": true,
      "author": "Z Kate",
      "helpful_votes": 18,
      "publication_date": 20180611
    },
    {
      "title": "Very upset",
      "text": "I purchased this diatomaceous earth in good faith that it is indeed safe. Now, after I've spread it around my house, i'm finding out that tHis is a hazardous material and should not be spread anywhere near humans or animals. Unbelievable. The manufacturer should be ashamed of making money by selling this under a misleading label.",
      "rating": 1.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 25,
      "publication_date": 20170823
    },
    {
      "title": "Like Magic!!",
      "text": "Works like a charm! We have a very serious problem with cat fleas and even pest control can't help that much! I end up wanting to try this one because I saw a lot of good reviews about this Diatomaceous powder. I put all over my backyard and the second day already reducing fleas. I will continue to use it every week to kill them! Fleas make our whole families have very serious itching scars on everywhere on our body. I hate fleas!!",
      "rating": 5.0,
      "verified": true,
      "author": "CkayLee",
      "helpful_votes": 17,
      "publication_date": 20180701
    },
    {
      "title": "Kills All XO Skeleton Bugs Without Harmful Poisonous Chemicals",
      "text": "Diatomaceous Earth is Not Poison or Harmful to Children or Pets. I learned about Diatomaceous Earth (in The Grow Book and Equipment Guide) when I started indoor gardening. Diatomaceous Earth is basically powdered sea salt that sticks to bugs when they come into contact with it. The powder basically dehydrates the bugs into nothing! This is the only product i’ve used that really kills black widows and brown recluse spiders. Most insecticide spray is useless unless the poison is sprayed directly on the bug or penetrates the shell. Diatomaceous Earth really keeps unwanted pest away.",
      "rating": 5.0,
      "verified": true,
      "author": "MiMikk",
      "helpful_votes": 11,
      "publication_date": 20180727
    },
    {
      "title": "A Marvelous Product.",
      "text": "I did have bed bugs. No long are there any presents of any bed bugs. Gone forever... Thanks Safer",
      "rating": 5.0,
      "verified": true,
      "author": "Ibrahim A. Arrahim",
      "helpful_votes": 36,
      "publication_date": 20170219
    },
    {
      "title": "Fungus gnats unaffected, dogs butt itchless",
      "text": "I bought this assuming it would bring death to my fungus gnat problem. Nope. \"dusted\" top of soil to about an 8th inch deep. The dweeby little guys could care less, still running around like aimless speed freaks. They have this annoying habit of flying directly in your face everytime the pot is disturbed, just to taunt i believe. This product works very well on most bugs, having bought essentially a lifetime supply im not shy with it around the house. I used a baby snot suction ball thingie to lightly dust above my dogs tail and it must have helped cuz he quit itching and chewing that area.",
      "rating": 4.0,
      "verified": true,
      "author": "Good Karma Lady",
      "helpful_votes": 10,
      "publication_date": 20181026
    },
    {
      "title": "Great product.",
      "text": "Diatomaceous earth is a must go to for ants, ticks, fleas and roaches.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 23,
      "publication_date": 20170530
    },
    {
      "title": "DOES NOT WORK",
      "text": "THIS DOES NOT WORK AT ALL AFTER 2 MONTHS NOT A SINGLE BUG KILLED (BED BUG).ive been using this for 2 months now and this didnt help at all only thing it did was cause a mess which i understand cuase its powder but for it not working it didnt really please me to have to clean up for nothing. IVE PUT ! BABY BED BUG ASND ! ADULT BED BUG IN A CONTASINER WITH SOME POWDER EARTH. AFTER # WEEKS THEY BOTH ARE STILL ALIVE!!! AND ARE COMPLETLY WHITE FROM THEW POWDER SINCE DAY ONE!. rating is low because it didnt kill a single bug.",
      "rating": 1.0,
      "verified": true,
      "author": "adrianna1026",
      "helpful_votes": 6,
      "publication_date": 20190710
    },
    {
      "title": "It is a very fine",
      "text": "We live rural, I use de all over my home. Under sofas, under beds. It keeps the fleas away, and ants also. Make sure you care careful when applying. It is a very fine powder",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal ",
      "helpful_votes": 55,
      "publication_date": 20170317
    },
    {
      "title": "Good product. Use face mask to avoid inhaling any.",
      "text": "Good product, to follow up with after spraying down areas with the bed bug spray I also bought. I do my research and due diligence. After using both of these products, and being a year later, they are GONE. I used VERY sparingly, laid out in potential problem areas, and, one year later, I sleep easy. Not an easy job, but, you need to be THOROUGH, if you want to eradicate them, and prevent any possible future infestations. WARNING...Use a face mask or some breathing protection, as this is a VERY FINE Crystalline powder, that spreads very easily throughout the areas where its laid down and applied.",
      "rating": 4.0,
      "verified": true,
      "author": "Ed Ski",
      "helpful_votes": 9,
      "publication_date": 20180730
    },
    {
      "title": "DO NOT spread this around your home as with \"food grade\" diatomaceous earth",
      "text": "This is not food grade and so is VERY hazardous to animal and human lungs and broncial linings. There are some that are specifically made to be used in carpeting.... this is not. But... it IS good in hidden places, in the back of, and below cabinets, around horizontal plumbing holes, outside in dry areas, along the top edeg of foundations, in the garage...... wherever it will not be disturbed and caused to become airborne. DO NOT BREATHE THIS!! Even a very small amount can cause lung damage. Not good for the eyes either.",
      "rating": 3.0,
      "verified": true,
      "author": "Soundman",
      "helpful_votes": 7,
      "publication_date": 20190417
    },
    {
      "title": "Very little needed",
      "text": "You get a HUGE bag and dont need much. I brushed it on my walls and trim and on our bed frame and headboard and then sprinkled it on the carpet and brushed it in with the broom. We let it sit for half the day and then vacuumed it up. The only issue is that our vacuum now shoots out white powder that didnt get out when we cleaned it. So once it gets nicer I will have to take it outside and let it run to hopefully get all the powder out before using it in the house again. But it did its job and will definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "megan goatley",
      "helpful_votes": 7,
      "publication_date": 20190326
    },
    {
      "title": "HAZARDOUS TO HUMANS AND DOMESTIC ANIMALS",
      "text": "The detailed manufacturer description AND their replies to customer questions all say that this is safe to use around the house with people and petsibing there. When I recieved it, I checked the label and it says \"HAZARDOUS TO HUMANS AND DOMESTIC ANIMALS\" and includes instructions for when you need to go to a poison control center. That IS NOT SAFE!",
      "rating": 1.0,
      "verified": true,
      "author": "Goddess Nevermind",
      "helpful_votes": 6,
      "publication_date": 20200131
    },
    {
      "title": "Anyone have a real solution?",
      "text": "Tried this twice for bed bugs. Our problem isn't a massive infestation so I was really looking forward to this fixing our problem. I applied it with a duster all over everything because I wanted to make sure I didn't miss anything, thus leaving my bedroom looking like a Coke heads heaven,white powder EVERYWHERE! I left it like that for a few days and upon checking for bugs, they were all alive and well. I decided to cover a live bug in a mound of this stuff just to see what would happen and it had zero effect, even after hours. Glad I only spent $10 on it to make my house a disaster.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 34,
      "publication_date": 20170904
    },
    {
      "title": "Be Proactive",
      "text": "I purchased this product has a proactive measure! I am around all sorts of children and households. No family is going to share with you that there is a possibility they have bed bugs. So be proactive and have this product in your household on stand-by. It's excellent for ants and fleas. Yes it's very messy but, overall it gets the job done! I wear gloves and a face mask when using this product! I feel great knowing I have some prevention methods in my home for pest.",
      "rating": 5.0,
      "verified": true,
      "author": "Benita M Leach",
      "helpful_votes": 8,
      "publication_date": 20181025
    },
    {
      "title": "NOT FOOD-GRADE - NOT SAFER",
      "text": "This product is listed with an Amazon recommendation badge and brand is \"Safer\". This is very misleading as I expected food grade and it is not even feed grade, so NOT SAFE. Very disappointed, there are many better choices.",
      "rating": 1.0,
      "verified": true,
      "author": "Faith Minier",
      "helpful_votes": 11,
      "publication_date": 20180604
    },
    {
      "title": "Good purchase",
      "text": "We had earwigs in our new home. They showed up after a particular wet week about a month after we closed on the house. I bought this magic and BAM no more earwigs in my house. I'll still see one occasionally in damp areas like the garage but it's better then what we were dealing with prior",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 8,
      "publication_date": 20190213
    },
    {
      "title": "Kills fleas.",
      "text": "works terrific for fleas in the carpet. seemed to do the trick. Sprinkled it. Then put on a face mask(bandana) and raked it into carpet. Let it sit for 24 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle T",
      "helpful_votes": 16,
      "publication_date": 20170628
    },
    {
      "title": "Bought it for bed bugs, still have bed bugs",
      "text": "I can't attest to the quality of the product but It did not get rid of my bed bugs. Called an exterminator he said stuff wont work for bed bugs although I put it in the corners of my apartment and found a bunch of dead spiders and potato bugs so it works for those.",
      "rating": 3.0,
      "verified": true,
      "author": "Darian Kaminsky",
      "helpful_votes": 9,
      "publication_date": 20181026
    },
    {
      "title": "Yeap it WORKS",
      "text": "I put this down in Oct, plus used the Harris spray and 91%alcohol and vacuumed daily.. slowly seen a decrease and now haven't seen any in 2 months thank God!! This can happen to anyone and will almost ruin your life and sanity. We got them from a bunkbed set from a rental place... total nightmare. This stuff really works BUT it takes time and CONSISTENCY!! I completely got rid of EVERYTHING in my sons room. If your reading this your probably going through it, hang in there...we all feel your pain. Good luck",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Lady!",
      "helpful_votes": 3,
      "publication_date": 20200126
    },
    {
      "title": "and easy solution I have found",
      "text": "I use this produce to rid my gardens of snails and slugs. It is the most effective, natural, and easy solution I have found.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Lou",
      "helpful_votes": 20,
      "publication_date": 20160821
    },
    {
      "title": "4 pounds is probably more than you'll ever need for ...",
      "text": "4 pounds is probably more than you'll ever need for an average sized house! Works well to kill the bugs, and is very pet friendly.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer1234",
      "helpful_votes": 16,
      "publication_date": 20170616
    },
    {
      "title": "Thank Goodness of This Stuff",
      "text": "I was in the middle of coating my daughter's bedroom in insecticide (due to bed bugs) when my husband discovered you can get rid of them with this product which is non-toxic (you don't want it in your eyes/lungs but that's just due to the \"clog\" factor rather than because its a chemical which its not. In fact, if its purified it can be put in food). Its a little messy but it seems to have very quickly put an end to what I believed would be a scourge on my existence for quite some time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber W.",
      "helpful_votes": 5,
      "publication_date": 20190624
    },
    {
      "title": "Diatomaceous Earth made me a ruthless killer!",
      "text": "In my experience, this is the safest and most effective non-pesticide product for eradicating any creepy crawlies. The diatomaceous earth basically works by cutting into the insects' exoskeletons as they pass through it. Those abrasions eventually cause dehydration which leads to death. It's perfectly safe for the kids and the cat to walk through, though. Just use caution and coming sense when dusting your home with this stuff. It can cause breathing difficulties if you're trying to breathe unfiltered in an active cloud of the stuff. I'm treating a house with this stuff today due to a combo German roach and flea infestation. Today I am a ruthless killer.",
      "rating": 5.0,
      "verified": true,
      "author": "｡･ﾟﾟ･ⓓⓔⓥⓘⓝ･ﾟﾟ･｡",
      "helpful_votes": 2,
      "publication_date": 20200131
    },
    {
      "title": "Healthy Choices",
      "text": "We use this in the tall grassy areas around the house. you DO NOT need any pesticides. This is 100% safe and you can use it around pets and people. Diatomaceous earth diatomite or kieselgur/kieselguhr is a naturally occurring, soft, siliceous sedimentary rock that is easily crumbled into a fine white to off-white powder. It will KILL ticks on contact. We use it all around the yard to keep the ticks off the dogs. It will kill indiscriminately so take care if you have butterfly gardens or bees.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Rootes Author",
      "helpful_votes": 2,
      "publication_date": 20200525
    },
    {
      "title": "Works awesome!",
      "text": "This stuff works great with the ants surrounding our house and this is the cheapest place that I've found to buy it! I love that I feel safe to let my kids and pets play outside and not worry about a toxic substance harming them.",
      "rating": 5.0,
      "verified": true,
      "author": "jen",
      "helpful_votes": 13,
      "publication_date": 20170622
    },
    {
      "title": "Strong odor",
      "text": "Really dislike that this has a strong odor! I thought I was getting 100% diatomaceous earth which has no odor. I bought it in a hurry and didn’t take the time to read the ingredients Decided to try it anyway since I was using it mostly outdoors. It’s much lighter weight than 100% diatomaceous earth. Researching online the 100% has the same affect I will not buy this again. Best to wear a mask when dispensing it so you don’t breathe in the particles, as recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "Featherb",
      "helpful_votes": 3,
      "publication_date": 20190815
    },
    {
      "title": "I used to have ants",
      "text": "This works but you have to find something to distribute the powder evenly in cracks and crevices and along doors and windows. I had to use one of those ketchup squirt bottles you see at cookouts. The powder can end up being a mess to clean up. You have to reapply if using outside and it rains. It may take a week or so but your ants will be gone. They don’t ingest this. It’s like a barrier that keeps them away/kills them. It’s worth a try.",
      "rating": 3.0,
      "verified": true,
      "author": "AMH",
      "helpful_votes": 3,
      "publication_date": 20190730
    },
    {
      "title": "Five Stars",
      "text": "Have only seen dead bugs since spreading this stuff around",
      "rating": 5.0,
      "verified": true,
      "author": "AD",
      "helpful_votes": 38,
      "publication_date": 20170305
    },
    {
      "title": "No Bugs to Be Seen",
      "text": "I got this because I had to store my belongings in a storage unit for a few weeks in a city that has had issues with rampant bed bug infestation in the past. I wasn't necessarily a real threat, but I was paranoid. Ultimately, I didn't get any bugs, so it seems to have worked! My only note of caution is that you should be sparing with your application. I ended up just taking handfuls of the stuff and lightly sprinkling it, but still ended up finding it almost smeared on any floor surface that wasn't carpet.",
      "rating": 4.0,
      "verified": true,
      "author": "Nina E",
      "helpful_votes": 4,
      "publication_date": 20190512
    },
    {
      "title": "Happy I bought it.",
      "text": "I have a 1000 sq ft home and I used 1/2 a bag sprinkling outside around the perimeter of my home and a few near by trees. I also sprinkled around my hedge bushes in the front of my house. I used a mask and also dishwashing gloves.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 3,
      "publication_date": 20200515
    },
    {
      "title": "This stuff works !",
      "text": "This product works and completely safe for your animals and that's always a plus in my book. This is the best stuff to get rid of fleas on animals of all ages with no chemicals what so ever. Just put some in a sock and tie the end and just dust your fur babies and fleas disappear.No string odor at all. I love this product and would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 6,
      "publication_date": 20181029
    },
    {
      "title": "DIATOMACEOUS EARTH",
      "text": "THIS WAS RECOMMENDED BY AN EXTERMINATOR. THE FIRST THING I FOUND OUT WAS I APPLIED THE DUST INCORRECTLY. I WATCHED A YOUTUBE VIDEO AND LEARNED THAT I NEEDED A DUSTER TO APPLY THIS VERY FINE AND LIGHTWEIGHT POWDER. SO FAR, I'M STILL SEEING ROACHES BUT I HAVE TO GIVE IT MORE TIME. THE BUGS HAVE TO WALK THROUGH IT SO IT WILL ATTACH TO THEM. JUST HAVE TO BE PATIENT.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190408
    },
    {
      "title": "It works.",
      "text": "On Monday, when I wandered through my 1/2-acre garden at midnight, there were thousands of earwigs, all chomping away on various vegetable plants. I gently kicked several plants (especially my potato plants) and witnessed more than three dozen fall to the ground. Tuesday, I dusted the leaves on all the plants with this, and dusted the ground where I could see bugs were most active. By Thursday night, I found less than two dozen earwigs in the whole garden. It was dramatic. It worked better than I could have thought possible. I buying more. If I would have applied it the plants earlier in the year, I could have saved more plants.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Hancock",
      "helpful_votes": 2,
      "publication_date": 20200708
    },
    {
      "title": "Kindof works as a repellent.. sortof",
      "text": "Kindof works as a repellent.. sortof I've been trying to kill an ant hill with this stuff for 2 weeks now. It makes them disappear, but I'm finding they are just building tunnels elsewhere to avoid this stuff. It doesn't appear to actually be killing any of them. Also, it's bright white, so everywhere you put it, it's a mess outside. I had high hopes, but it's not working like I expected.",
      "rating": 3.0,
      "verified": true,
      "author": "V. Richie",
      "helpful_votes": 3,
      "publication_date": 20180702
    },
    {
      "title": "Miracle in a bag!",
      "text": "I can't believe it took me so long to find this stuff! I have been battling ants/flying ants in my kitchen at the start of summer every year for 6 years. I have tried everything and nothing has worked to get rid of them. I bought this...put it down at about noon and the next morning...nothing! No ants, no flying ants...dead or alive. It's like they never existed. It's been about a week now and still nothing. I haven't even seen a rouge spider crawling around. It's been wonderful. I feel like my nightmare has finally ended!",
      "rating": 5.0,
      "verified": true,
      "author": "Shana Staten",
      "helpful_votes": 2,
      "publication_date": 20200605
    },
    {
      "title": "Goes a long way and works",
      "text": "Great for all kinds of crawling insects. I found it best to mix it with water in a spray bottle with a large straw that can handle the disolved \"earth\", then rinse the nozzle well after each use. By using the de in a spray bottle, you can lay a film more efficiently and that's all you need. It dries quickly and is easy to clean up when you're ready. Trial and error brought me to using it this way.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Kaltz",
      "helpful_votes": 6,
      "publication_date": 20181020
    },
    {
      "title": "This will stop what's bugging you",
      "text": "I share a house with some friends and one of the guys has a dog, unfortunately the dog it's always scratching and chewing on his legs and dragging himself around the room trying to get rid of chiggers or fleas or whatever it is that it has on him. So I purchased the D. E. this stuff work great!!! It does kill any type of insect with an exoskeleton so yeah I recommend it the food grade of course. Just remember 2 put light coats wherever you're putting it in the house. Outside you could go crazy throw it around whatever but inside you need to be careful because you don't want to breathe in too much.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Very Unhappy",
      "text": "I do not have any other bugs but bed bugs, I was told this stuff would get rid of them NOPE!! Still have them and I vacuum every day, wash my sheets every other day put this stuff down, fog and spray. I refuse to call the bug man for the cost is too high and they can't even get rid of them with any type of guarantee. So all I can keep doing is Fogging, spraying and earthing until they go away or they DIE!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Donald W.",
      "helpful_votes": 5,
      "publication_date": 20181030
    },
    {
      "title": "NOT FOR RED ANTS",
      "text": "This may work well for other pests but for red ants, they just laughed and relocated, literally inches from the application. Almost immediately it seemed to work but within ten minutes, the ants moved their entrance less than four inches away. Since their nests spread out over 100 feet and can go as deep as twelve feet, this is best used for residential perimeter protection, not farm, ranch, or field use on large mounds. Of the nine mounds I applied this on, seven came back within fifteen minutes and the other two just relocated a few feet away. Had to use professional pesticide for effective application and results.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Fabulous",
      "text": "I live in South Florida, insects are a year round challenge - and I hate using chemicals. Ants were just walking in the doorways. I tried everything organic,,, repeatedly. I tried Terro, probably the best product until I found this, I even tried RAID (it was given to me and I was desperate), regardless, the ants would be back within a few hours. I have never gone weeks with out battling ants until I put Diatomaceous Earth around the doorways. Non-toxic AND Effective, it doesn't get better than that!!",
      "rating": 5.0,
      "verified": true,
      "author": "Meme P",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "It worked against our war on millipedes... and every other creepy crawly",
      "text": "I can’t comment on price because I didn’t shop around at local stores. My husband actually made a little “duster” out of a plastic soda bottle for easy application. We have been overrun by the standard black 1” millipedes and not all pesticides kill them. Very happy I found this. And a little went a long way. I will buy again for around garden etc. It was a little unsightly seeing white powder all around the bottom of my house, but it’s killing the bugs!",
      "rating": 5.0,
      "verified": true,
      "author": "erin29349",
      "helpful_votes": 2,
      "publication_date": 20190719
    },
    {
      "title": "Works on fleas extremely well",
      "text": "I finally found something to get rid of the thousands of fleas in our basement. Somehow the fleas were out of control when I finally noticed them. I tried many other products but this did the trick. I have 3 newborn kittens in the house and a feral cat in our basement that we can’t catch to put flea treatment on. It was my poor dogs that I notice the fleas on, so having a safe way to get rid of them that ACTUALLY works was a blessing. I also ordered the trap so I could see how bad the fleas were. I am on my third sticky pad now and there are no more fleas. Highly recommend this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "DONT BUYY!!!",
      "text": "If you’re planning to use this on carpet, DON’T!!!!!!!!!!! It broke TWO of my Vacuums, one was BRAND NEW & I still wasn’t able to get it off!!!! It created a Storm inside my house which ultimately I ended inhaling so much of this!!! Even with a mask on!!!! I almost went to the ER I couldn’t breathe. Even on hardwood floor this stuff is impossible to sweep without it flying everywhere. If I could return it I would this stuff is TERRIBLE!!! UPDATE: I ended going to the ER because of this stuff. My lungs, Nose & Throat we’re beyond irritated. This stuff is bad news please make sure you’re wearing masks even goggles to protect yourself!",
      "rating": 1.0,
      "verified": true,
      "author": "Rosemary A.",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "DON'T WASTE MONEY ON \"ORKIN\"....",
      "text": "I ordered 4 bags after reading reviews and EVERY positive comment said was right!!! My husband sprinkled half a bag around the house and with 3 days we did a walk through....and found alot of dead bugs(killed ants, roaches, centipedes, roley poley(think I spelled it right😁)!!! He also put some in our attic and found dead bugs up there as well with days. COMPLETELY SATISFIED WITH THIS PRODUCT!! Will order again when needed. DON'T HESITATE BUY TODAY!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Davyian Roscoe",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "It works slowly",
      "text": "This thing actually works. It reduced 95% of the population of fleas. Dogs were constantly scratching all day. After a week or two there is no more fleas eggs hatching. I can bately find 1 or 2 adult fleas on my dogs which I believe they are getting from walking outside near my neighbour's house who never treat his lawn or bushes. For the first time in a while I can finally controle the infestation. The only downside of using this product is the mess that it leaves behind specialy if you have a dark wooden floor.",
      "rating": 4.0,
      "verified": true,
      "author": "Techie",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "If you have bedbugs...",
      "text": "THIS STUFF KILLS BEDBUGS!!! Dont let some expensive pest control company tell u otherwise. It cost a small fraction of when a pest control company charges. Just follow the.instructions. Years ago I did and within 48 hours I was never a blood meal again. It also kills roaches!!! Its completely safe to use around your family and pets. God bless mother earth.",
      "rating": 5.0,
      "verified": true,
      "author": "Nozama Reyub",
      "helpful_votes": 2,
      "publication_date": 20191222
    },
    {
      "title": "100 percent GUARANTEED",
      "text": "Having problems with bed bugs is not an easy task. Many times there is a perception that these intruders enter the home due to lack of hygiene. That I thought until after living in the same place without pets, with nothing different one day they appeared. They destroyed my peace and my pocket as I deal with all the products in the market until someone told me about this product. Bingo was my salvation since I finished my nightmare. Now I try once a month to use it in my home since I don't want to go through this again. It is a 100 guaranteed product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Figueroa Ramos",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Pest control at it's best",
      "text": "As the spring/summer comes in my new home, i prepare, plan, and plot. As the ant's start their way into this home my defenses are typically Tero ant traps both outside and in, and now to add to it this great product. After applying this to cracks crevaces around my house i've seen little to no ants, critters, etc crawling around in my basement/bathrooms. Excellent stuff for pest control, but would suggest having at least two types of bait/traps/control.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170802
    },
    {
      "title": "Did Nothing. Made Both My Dogs Ill.",
      "text": "Used exactly per instructions. Roaches came in cardboard boxes, as I’m disabled, was and am in strict lockdown. That is how I purchase my groceries. Until then, I have never seen a roach in 11 years, and I reside in the south. No matter how carefully you sprinkle this, even with a mask, it irritates eyes, and your breathing. My small dogs were kept out of the room I used it in, and they still became ill, requiring a pricey vet visit. I switched to plug in ultrasonics, and no more roaches. I requested a return, sent virtually full package back, but heard nothing from seller. I would like a refund. Only Amazon Prime items for me, from now on.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Kills fleas",
      "text": "Kills Fleas I've been a Pest Control Technician for nearly 5+ years. I can't vouch on the validity of all the uses of this product but it sure its cost effective and physically effective against fleas. I have the good stuff (Concentrated liquid) that i have tried but the application isn't as effective as powder. Which is why this stuff works so well, it lingers and kills. I just used a table spoon to shake a fair bit into an area and then used a household broom to mix it into the carpet. Better than the Industry leading Liquid pesticide.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirbythebamf",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Great value,non toxic.",
      "text": "I live in an apt. complex. It was only a matter of time until someone elses bedbug problem became mine.I used this product in conjunction with spray, foggers and good old fashioned cleaning. Including disassembling bed and treating frame, box springs and mattress. Then placed box springs and mattress in encasements, and washed all bed linen. Total cost approx. $60.00 vs 100's for a professional. It took about 3 weeks to really notice effects. I will keep this product on hand as a preventive measure.",
      "rating": 4.0,
      "verified": true,
      "author": "MT Kyle",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Great natural remedy for bugs",
      "text": "Better than harmful sprays. This did a great job of getting rid of my ant problem, which was out of control. A friend told me about this product so I figured I'd give it a try. I do believe it takes more than one application, at least if your problem is as bad as mine was. I am seeing a few ant hills returning just now after two months so I'll be putting more down. Be sure to only use it when there is no rain in the forecast. If it gets wet, it defeats the purpose since this works by drying out/dehydrating the pesky little critters.",
      "rating": 5.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 4,
      "publication_date": 20170726
    },
    {
      "title": "Good",
      "text": "I've used this product several times. Just let me give you a few pieces of advice. Yes its nontoxic to mammals Yes it will work to rid you of any bug with an exoskeleton But be warned. To much of this product will clog and destroy any vacuum cleaner!!! Also. You can apply this product straight onto your animals However. You MUST put out alot of water for them!!!!! Because when they lick themselves they will get dehydrated very fast. After this product touches moisture it will never work as it's intended purpose again. So if you use it on your plants outside. After it rains or moist air hits. You need to reapply again Thank god it's cheap right",
      "rating": 5.0,
      "verified": true,
      "author": "Kryc",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "BEST BUG KILLER",
      "text": "This works EXCELLENT! I had discovered big brown roaches in an old home I bought. I tried everything to get rid of them. I’m not a huge fan of chemicals so this seemed worth a shot. Let me tell you. The NEXT DAY places where I could consistently find five roaches at a time had ZERO. ZERO. it was unreal. After just sprinkling under the attic floorboards I have zero bugs. Have recommended to alllllll my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "No more insects in the house!",
      "text": "I packed a pretty hefty amount in the cracks of my front and back door because all sorts of insects (especially worms) were coming up through the cracks during the rain and winter. This keeps them at bay. I also haven’t seen nearly as many spiders as I usually do. The one time we saw a live spider, there appeared to be this powder all over it, so it definitely didn’t have much longer to live. Great stuff! (Wear something over your nose/mouth/eyes when distributing!)",
      "rating": 5.0,
      "verified": true,
      "author": "Rhea ",
      "helpful_votes": 2,
      "publication_date": 20200514
    },
    {
      "title": "Works great",
      "text": "This past winter we found that our attic was inundated with Lady Beetles. Very Gross. Tried everything to get rid of them resorting to kill them one at a time. Then read that this would work and it did. I put it on the window sill in the attic and sure enough started seeing the dead ones. It was easier to vacuum the dead ones than try to get rid of them any other way.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Samol",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "NOT AS ADVERTISED!!",
      "text": "IT DID NOTHING TO HELP WITH MY ISSUE & YOU NEED A MACHINE TO USE IT!! IT GETS OVER EVERYTHING!! THOUGHT IT WAS ADVERTISED AS BEING SAFE TO USE, BUT THE PACKAGING SAYS IT'S POISONOUS, SINCE IT IS A PESTICIDE!! WASTED MY MONEY ON THIS PRODUCT, SINCE I WASN'T AWARE WHEN I BOUGHT IT THAT I NEEDED A MACHINE TO SPRAY IT LIKE A DUSTING!!#smh",
      "rating": 1.0,
      "verified": true,
      "author": "Zannetta Mack",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "I LOVE This Stuff",
      "text": "I had an ant problem and I thought I was losing the battle until I got my hands on this! Within one week they were ALL GONE. I was ecstatic because I've tried so many other chemicals and spent so much $$$ trying to fix the problem but this was the only thing that worked. I recommend using a face mask since this is a very fine powder. Even if you don't have a bug problem it's good to have it on hand. It won't kill any exoskeleton creature right away but rather it will destroy it from the inside out.",
      "rating": 5.0,
      "verified": true,
      "author": "PandaLovin",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "This stuff works like a charm",
      "text": "This stuff works like a charm! It can get a little messy, so you may need to wear a mask while putting it down (if you have sensitive lungs). Overall, though, it works well outside and inside. I would not recommend using a duster for this, as it'll just end up in your face and on your clothes. Instead, just use a spoon or your fingers to brush it into cracks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20171119
    },
    {
      "title": "SUCCESSFUL CURE FOR BIRD MITES",
      "text": "We used this in conjunction with Permethrin for our chickens with a BAD case of bird mites. We first just tried the Permethrin (diluted in water, dunked the chickens). It seemed to work at first but the mites were never totally eradicated. A few weeks later we redunked the chickens in the Permethrin, hosed down the whole coop, and dusted this stuff everywhere (using a baby powder bottle). NO MORE MITES. We have periodically dusted the coop with it since then and have not had any recurrence of bird mites. Success!",
      "rating": 5.0,
      "verified": true,
      "author": "Cole Says",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "I’ve been SCAMMED",
      "text": "If you Just moved into your new apartment and ironically start dealing with bedbugs like I am. This stuff will only make a mess and track powder all through the hallways of your apartment building. Fumigation fumigation fumigation fumigation is the only way. They are in the walls, they are a part of the plumbing, they are literally in the cracks of the wood of the floor and in the floor board!!! There is nothing on earth that will remove them from their dwelling. There is nothing that will protect you not even mattress covers, NOT EVEN diatomaceous earth, Nothing! You’ve been trapped in a lease and AMAZON can’t help ya!",
      "rating": 1.0,
      "verified": true,
      "author": "Ally",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Doesn’t work",
      "text": "This product did Absolutely nothing to help our flea problem. I have used other brands in the past and they have fixed the problem quickly and easily. This did nothing. Fleas still all over my pets after rubbing it all over them and treating our yard. We use frontline, but the fleas must have developed a tolerance over the years, so we were hoping this would do the trick. Used the entire bag spread out over several days and no luck. Save your money and buy the real food grade product at Tractor Supply.",
      "rating": 1.0,
      "verified": true,
      "author": "Username",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great for ants",
      "text": "I live in a townhouse, so I only applied this around my foundation area, but we've gone from having clusters of ants daily on fallen vegetation, ants invading the kitchen/undercutting our back flagstones, to hardly any ants around at all, and I assume it's taking care of other bugs that hadn't gone into their mating season yet. I ended up giving the rest of the bag to a friend since he's got a full house to deal with - he was going to spray pesticides but out of concern for his toddler and also the stream he lives near, I convinced him to try this first.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170728
    },
    {
      "title": "Great product, highly recommended!",
      "text": "Great product, highly recommended! I used this product along the baseboards, throughout my entire house. Anything that flys in from outside dies almost immediately. Since I’ve started using this product, I’ve noticed dead spiders (didn’t know I had them) palmetto bugs (dead) and a few others dead. I would much rather see them dead than alive! I feel so much better knowing that this product is getting rid of bugs that we didn’t know we had!!! This product is very light weight and can get a bit messy. I read a very helpful review, tried it and it worked great. To get in the cracks and crevices, use a refillable ketchup/mustard bottle from the dollar tree. Life saver!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "It has helped with my bug issue",
      "text": "It says that it will kill the bugs that I bought this to kill within 48 hours of them contacting or ingesting this. I am not sure if it has been that effective, but it has helped.",
      "rating": 4.0,
      "verified": true,
      "author": "doubleb316",
      "helpful_votes": 5,
      "publication_date": 20190311
    },
    {
      "title": "Disappointed!  after 7 days, 3 applications  ,  mounds are STill  ACTIVE",
      "text": "I really wanted this work... as others have reported in their reviews. BUT, after 3 generous applications over 7 days . the target ant nestS, & moundS are still very much active, alive and agitated. Two in yard, one in mulch around tree. I am v.disappointed I applied the fine white powder to the active mounds, and approx. 8-18 ins. radius around these ant nests. I could see them crawling all over this D.E. material. These S.E. Texas ants must have developed immunity?",
      "rating": 1.0,
      "verified": true,
      "author": "Gadget Junky",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Worked within 24 hours",
      "text": "I had a flea infestation in my garden after some trees were trimmed by the city. I sprinkled this liberally throughout my garden and the fleas were nearly gone the next day. I used a mask and goggles for protection because the powder is really fine and can get picked up easily by the wind. I also noticed a decrease in earwings in my lettuce after using this",
      "rating": 5.0,
      "verified": true,
      "author": "Ariel",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Killed roaches when pest control couldn’t!",
      "text": "We have had a persistent problem with roaches at my apartment complex. I went through the hassle of packing everything up and having place sprayed 3 times in 2 months. The little buggers would come crawling around next morning saying “what up?!?” Finally spread this EVERYWHERE and haven’t seen them since. Downside- I got smallest bag and have way more than I need And bag doesn’t reseal very well. Being a powder, it got spread everywhere and breathing it in. It’s settled down now and still no roaches",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 2,
      "publication_date": 20190607
    },
    {
      "title": "Won't Close----Poor Bag Design",
      "text": "Very disappointed that the so-called re-closable bag this comes in won't close after initial opening. The contents are extremely powdery and would be very messy to try to transfer to another container given the size and amount. Don't know yet if it actually works to kill bugs.....am using it in my house plants. But I am really unhappy the built in zip closure will not zip shut even after several tries. Had to tape it shut so it won't spill or get into the air. Poor bag design.",
      "rating": 1.0,
      "verified": true,
      "author": "quirt27",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Effective and inexpensive",
      "text": "I used this to eradicate squash bugs from my garden; it did the trick with one application. I'm happy with it's effectiveness and it was very economical. Keep in mind that you'll need an applicator for most uses: a shaker/duster for indoor use or a sprayer/atomizer for garden use. Diatomaceous earth can be disolved in water and sprayed in the garden with a fertilizer sprayer, which is what I did. You should use a face mask when applying dry powder as it is very irritating if inhaled.",
      "rating": 5.0,
      "verified": true,
      "author": "Will Peterson",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Using for all-natural non-poisoness crawling-insect pest control.",
      "text": "It's a bag of diatomacious earth for all-natural non-poisoness pest control. Ancient farmers to today have been using it for thousands of years. ALWAYS Wear a respirator or dust mask when handling as it's very irritating to eyes and skin. Do not inhale the dust as it may cause respiratory issues. use carefully around areas where pets may \"sniff around\". If you are unfamiliar with using this type of pest control, be sure to read all the instructions carefully.",
      "rating": 5.0,
      "verified": true,
      "author": "ilive4fun",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "No mercy! DE IS AMAZING!",
      "text": "I never heard of DE before but needed something to help with fleas, roaches, ants, and pinching butt bugs! All seem maintained without harsh roach sprays. I LOVE SEEING FLIPPED UP ROACHES ON MY BACK PORCH! We made a border barrier and when there's a survivor - we scoop it up and dumped in a bottle and give it a fry chicken flour shake and within minutes no movement. No mercy! Hate roaches and the bugs with pinching butts (not sure what they are called).",
      "rating": 5.0,
      "verified": true,
      "author": "Caryn Hunter",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "This stuff WORKS. Within 24 hours I was finding ...",
      "text": "This stuff WORKS. Within 24 hours I was finding dead flea bodies just laying around. Rather satisfying in my opinion. Make sure to wear a mask when using this product so you don't breathe it in and use a duster to keep it low to the ground. Hoping this keeps us flea free!",
      "rating": 4.0,
      "verified": true,
      "author": "christina",
      "helpful_votes": 9,
      "publication_date": 20170930
    },
    {
      "title": "Does the job!!",
      "text": "Works well for the prce. Take a few weeks to notice any reults tho. Not too good on ants. As for application, its slightly messy to work with and it would be advised to wear a face mask while applying, (strong odor and dust only while spreading)I used an old mustard bottle to squirt it along cracks and baseboards for a more uniform coverage.",
      "rating": 4.0,
      "verified": true,
      "author": "Browneyedgal55",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "works quickly",
      "text": "Ss soon as I put some around our sliding glass door to the house garden within 24 hours I had dead bugs sitting in the powder. We live in Fla and bugs are a constant source of aggravation. So to keep down the need for chemical spraying I am using this stuff in areas where the cockroaches come in.",
      "rating": 4.0,
      "verified": true,
      "author": "marinjoe",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Bug free",
      "text": "After my divorce I had to move to a place that has hot and cold running roaches. The guy in the unit next to me complained of bedbugs. F that noise - put up molding where there wasn't any, caulked any gaps, put this stuff in any remaining cracks, etc. I used two store bought cans of bug spray and hit the perimeters (Left the place for 5 hours cause of the smell) - and I haven't seen anything alive in there that wasn't supposed to be there. I would suggest getting a bulb cause the powder is fine and a little messy without one. Good stuff though.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve D",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Awesome product",
      "text": "My back yard has so many trees and soooo many bugs....24 hours after putting this in the yard not one blade of grass had movement. We had every type of bug god created in the yard and lord forgive be but not one of em made it out lol. Saw this listen on google and I’ve tried everything else so figured why not? This is all you need. I don’t have a spreader so I pour a few thick lines in the yard and then use the leaf blower to spread it all over",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah ",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "not impressed. Did not get rid of our ants",
      "text": "I bought this product for an ant problem in my yard. I bought the duster to apply the powder to tree trunks, leaves and crevices. first off what a mess. I was in a cloud. second the ants just seem to now walk around where i dusted. So i still have a major ant problem in a new location. I of course dusted the new area but see this being a daily thing. Not impressed so far. I want to kill or completely get rid of the ants. not cause them to relocate daily.",
      "rating": 3.0,
      "verified": true,
      "author": "Deanna McNamara",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Effective",
      "text": "After getting mysterious bites for a month we finally found 6-8 bedbugs on our living room chair and immediately got rid of it. Never found any in the rest of the house but wanted to take all the precautions we could to make sure they didn’t spread. We put this stuff in our bedroom and living room and haven’t seen any or got bit in a month now. Will continue to re-apply this stuff to ward off any bugs!",
      "rating": 4.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 4,
      "publication_date": 20180912
    },
    {
      "title": "If you have bugs and pets this is your antidote",
      "text": "I got this because we got some weird bugs they weren't bed bugs though god knows we thought they were. I put this under the bed in between the mattress and I have never seen or been bitten by those bugs again. I bought it because it is pet friendly and I have my grand-babies over all the time. The dust is annoying but just knowing it is safe makes me happy. I now use it around my garden and no bugs there either. This is def a multi-use product.",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy Fabelo",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Good product",
      "text": "I'm hoping this product does the trick, still testing it out. DO NOT USE A LARGE AMOUNT. I sprinkled this product on top of my carpet, left overnight and tried to vacuum it up. The powder is so fine that it was passing my vacuum filter and clogging up my motor. Just be careful! Use a tool that spreads it out evenly and lightly.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrianna Panek",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Absolutely a must have for fleas!",
      "text": "We have had an issue with fleas for about a year now. Even with the cold weather. With two dogs, fish, and little ones we were limited on things to use. Nothing we tried helped! Not even meds for the dogs. Our house was infested. This has been down for only a few days. We have gone from being eaten alive to not one bite! This stuff works wonders!!! I definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Alisa Plott",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Kills bed bugs",
      "text": "I had bed bugs last year, and I covered my whole carpet in this stuff. Between me being very neurotic and my apartment paying for pest control, we have totally gotten rid of them! I definitely recommend making a circle around just the bed, and not doing the whole carpet because your vacuum will hate you.",
      "rating": 5.0,
      "verified": true,
      "author": "Elysia Arntzen",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Awesome for flea control",
      "text": "If you have fleas that are out of control, just get this and put it in a shaker container, cover the whole floor, and let it do it's magic, then suck it up with the vac and repeat for the \"hatches\" afterward. Works better than an exterminator and WAY cheaper!!! We keep a clean house, but when you get a flea infestation out of the blue (and you will), this is THE \"go to\" solution. I am SOO thankful for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Slish",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "unfriendly to ants",
      "text": "out at our property - there is a huge infestation of crazy ants. . I would say trillions - or at least it seems like it. this stuff basically took care of them in about 24 hours. the thing is, with that many you have to keep the area treated. a quick rain - this washes away and the ants come back. so, I suggest a light dusting of this on a regular basis.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard R. butcher",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Does exactly what it needs to and good quantity!",
      "text": "Did exactly what it was supposed to in killing pests and an added bonus is finding out it also kills dust mites! Just learned of our oldest son’s dust mite allergy and This DE powder has Helped to get rid of them! After we treated and removed the powder, we noticed he was getting fewer random outbursts of hives, and now we are down to none at all, using this & a few other cleaning solutions.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey S",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "It takes a few days to notice a difference, also, if it gets wet you must re-sprinkle.",
      "text": "This is a great product! I was unable to get rid of ants in my chicken pen, didn't want to put poison in the pen and poisons and ant bait didn't work just along the perimeter. This product can be sprinkled everywhere with no ill effects. Ants are GONE! I even put in the the nests and fleas and other pests are gone. I will be putting some food grade DE on my chickens for mites etc.....",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara T.",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "Really works!",
      "text": "We used this to kill spiders and it worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 4,
      "publication_date": 20190502
    }
  ],
  "product_meta": {
    "title": "Safer 51703 Diatomaceous Earth-Bed Bug Flea, Ant, Crawling Insect Killer 4 lb",
    "description": "Safer Brand ant and crawling insect killer's 100% diatomaceous earth pest control formula is ideal for killing ants, earwigs, cockroaches, silverfish, crickets, fleas, millipedes, and centipedes. 100% diatomaceous earth kills insects by ingestion and/or dehydration within 48 hours. Works indoors and outdoors when kept dry. Wear a dust mask approved by NIOSH/MSHA when applying",
    "rating": 4.3,
    "feature_bullets": [
      "Diatomaceous Earth based powder is a highly effective ant killer; 4 pound resealable Bag",
      "Kills insects by ingestion/deHydration within 48 hours indoors or outdoors; Active Ingredients Silicon Dioxide (85percentage), Other Ingredients (15percentage)",
      "Also for Bed bug, cockroach, flea, earwig, silverfish, cricket, millipede and centipede Control",
      "Insects canNot Develop a resistance to it since there are no chemicals to build immunity from",
      "Formula contains 100 percentage Diatomaceous Earth"
    ],
    "specifications": {
      "Product Dimensions": "15.6 x 10.8 x 4.2 inches",
      "Item Weight": "4.2 pounds",
      "Manufacturer": "Safer Brand",
      "ASIN": "B01D60GAW2",
      "Item model number": "51703",
      "Customer Reviews": "4.3 out of 5 stars6,390 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#2,223 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Pest Control",
      "Baits & Lures",
      "Garden & Outdoor"
    ],
    "price": 9.47
  }
}