{
  "website_summaries": [
    {
      "verdict": "The Saucony Showdown 4 is best for neutral runners looking for a barefoot feel when running. A track and field shoe intended for optimal performance, the Showdown 4 gives runners speed and comfort at a reasonable cost. Achieving such a feat has been through the coordination of the lightweight and aggressive technical features of the shoe.",
      "pros": [
        "Many of the runners claim that the Saucony Showdown 4 has improved their speed",
        "A lot of athletes appreciate the rigidity of the shoe",
        "It has a great fit, according to several users",
        "Some reviewers claim that it is very comfortable",
        "The stability provided by the shoe is lauded by quite a few people"
      ],
      "cons": [
        "Several are disappointed with the shoe’s massive weight",
        "Some customers state that the shoe easily wore out"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.6,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bright and Comfy",
      "text": "My son is a 10th grader who runs multiple events. He usually will not use his spikes immediately in a trackmeet. He likes to break them in at practice. When he tried these on, he said they were so comfortable and the fit was perfect... he wore them on Saturday. The picture does not do justice to the shoe. The shoe is a bright yellow (its helps me to videotape him) and the bottom is a metallic gold. Good shoe so far, now I need to see how long it will last. My son goes through a few pair of track spikes per season.",
      "rating": 5.0,
      "verified": true,
      "author": "Queen Gee",
      "helpful_votes": 5,
      "publication_date": 20170322
    },
    {
      "title": "... it is a very stylish and sleek shoe and great for sprinting",
      "text": "They are very comfy and fit as expected the only downfall was they a little bit thick in the counter part of the shoe but doesn't bother me during events overall it is a very stylish and sleek shoe and great for sprinting.",
      "rating": 4.0,
      "verified": true,
      "author": "Teri",
      "helpful_votes": 2,
      "publication_date": 20170324
    },
    {
      "title": "These shoes are actually more comfortable than my tennis shoes",
      "text": "These shoes are actually more comfortable than my tennis shoes. Extremely nice shoes, definitely worth the investment. The shoes are extremely flexible on top, a considerable advantage for anyone with an abnormal foot shape, like myself. Would buy again if I was good enough to do track in college.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170413
    },
    {
      "title": "Look \"Fast\"",
      "text": "The fit is as expected. Tight. It's a track spike not loafer. Made well. Look sharp. Wear well.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "Fit great and feel great.",
      "text": "Daughter loves them, says they fit great and they make her easy to find on the track field because of the bright color.",
      "rating": 5.0,
      "verified": true,
      "author": "Timbux2",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Five Stars",
      "text": "My grandson is delighted with his Track shoes. He competes tomorrow.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Lightweight shoe...great look",
      "text": "This shoe looks better in person. My child said they are very comfortable but to me it looks snug. Really lightweight though.",
      "rating": 5.0,
      "verified": true,
      "author": "Fel",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Great Fit!",
      "text": "Rigid like a sprint spike should be but comfortable inside. You really don't need a sock with this shoe. 10 great spikes included with shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Viracocha",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Four Stars",
      "text": "The fit was spot on and as comfortable as any pair of spikes can be.",
      "rating": 4.0,
      "verified": true,
      "author": "jerry wu",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Great product!",
      "text": "It's a great product. i just didn't rate it a 5 because 2 spikes were missing",
      "rating": 4.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Good buy!",
      "text": "I bought it for my son and he absolutely loves it and believes that it would make him run faster for the upcoming Sports Meet. Good buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Carla Manswell Hall",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "Five Stars",
      "text": "I bought this one size bigger for my son and it fit perfectly!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "5/5 for me.",
      "text": "Very nice spike. Materials are light but very high quality. Fit is nice and tight. The ISO Fit really helps with getting the spike to wrap around your foot comfortably. Grip is excellent, as you'd expect for a 10 spike, full plate. My school unfortunately runs on a dirt/sand track so these have already seen wear on the pike plate after only two 100m dashes during practice, so I will definitly be using these exclusively for meets. Other than that, which is expected, they are pretty light considering they cary 10 spikes each, and feel even lighter when you're sprinting down the track. Definitly recommend these to any sprinters looking for a high quality sprint, full plate spike.",
      "rating": 5.0,
      "verified": true,
      "author": "Osvaldo",
      "helpful_votes": 4,
      "publication_date": 20170302
    },
    {
      "title": "things like shoes or clothes",
      "text": "This is the problem when you buy through internet, things like shoes or clothes ...you can not try before you buy. The shoes are amazing, but the size that I bought was the same size that I use to use in others brand shoes, but these pair of shoes didn't fix good. And the problem is that I have bought outside USA. Now I have to sell to recover the money.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel D.",
      "helpful_votes": 0,
      "publication_date": 20170820
    }
  ],
  "product_meta": {
    "title": "Saucony mens SHOWDOWN 4-M Showdown 4",
    "description": "Why slow down when you can Showdown? The premium fourth edition to this elite sprint spike features FLEXFILM overlays and an ISOFIT lacing system that helps keep you securely fastened to the full-length 10-Pin Pebax spike plate.",
    "rating": 4.3,
    "feature_bullets": [
      "Isofit, flex film, 10 pin pebax spike plate",
      "Fast",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Shoe Width: medium mens_us",
      "Lightweight",
      "Rigid"
    ],
    "specifications": {
      "Item Weight": "226.8 Grams",
      "Date First Available": "11 Nov. 2016",
      "Manufacturer": "Saucony",
      "ASIN": "B01MZH41UY",
      "Item model number": "SHOWDOWN 4-M",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Track & Field Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 68.83
  }
}