{
  "website_summaries": [
    {
      "verdict": "A solid set of Japanese clubs that incorporates a number of special features to help you improve your game.",
      "pros": [
        "Features a titanium/carbon shaft, a speed face that increases both the distance and sweet spot, and a black oil finish",
        "Comes with leather headcovers",
        "Set includes clubs 4-9, as well a putter and sand wedge",
        "Good overall quality, particularly in the grips"
      ],
      "cons": [
        "Club headcovers are on the bulky side",
        "Some issues with the paint chipping",
        "Clubs are actually painted blue, not black"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love all the clubs except the 9 Iron.  Still, highly recommended at that price if you're a sweeper swinger.",
      "text": "These have made swinging a club much more enjoyable again. It almost feels like cheating, to be honest. Love the grips and the feel. I will say this, though... I do not like the 9 iron. I don't know what it is, but my 9 iron is messed up or something. I can hit my pitching wedge (also a hybrid like the rest of the clubs) further and more consistently. Can hit the 8 iron just as well. But when I pull out the 9, it's absolute mayhem. Also... they give you a hybrid SW. I'd recommend just going and getting an actual SW. Hybrid SW feels very weird.",
      "rating": 5.0,
      "verified": true,
      "author": "JHawk88",
      "helpful_votes": 14,
      "publication_date": 20180622
    },
    {
      "title": "Customer service is excellent. The product specifications appear to show the hybrid ...",
      "text": "My wife(Reyna) purchased these as a surprise gift for me. Well worth the price for looks and handling! The long hybrids replace the long irons for mid handicappers very efficiently. Some golfers may prefer continuing to use the traditional wedges instead of the short-iron hybrids. Customer service is excellent. The product specifications appear to show the hybrid lofts as being one club lower than the usual irons (i.e., #4 hybrid is indicated with a #3 iron loft etc., ). Could possibly be an erroneous description -- but, did not make any appreciable difference in playability for me. (Haven't measured the actual lofts, yet). Will purchase from this supplier again. Nazir Khan",
      "rating": 5.0,
      "verified": true,
      "author": "reyna khan",
      "helpful_votes": 8,
      "publication_date": 20180321
    },
    {
      "title": "Really decent hybrids...(should make them in Black, Not blue)",
      "text": "I think Wazaki made a mistake making these Blue, in place of a nice Black head, but, the shafts seem nice, about a regular as my other clubs. The mid flex is good, the heads, although not heavy, instead of the 'click' or 'ting', have a heavy 'thud' feel reported back to your hands. The ball flies well, overall, a good buy. It is confusing to call these 'Black Oil Finish' when they are bright blue in color.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry Bellomo",
      "helpful_votes": 6,
      "publication_date": 20180606
    },
    {
      "title": "Very good value",
      "text": "Pretty good product. Actually blue in color, not black, but quality was actually better than expected. Had to adjust swing weighting on all 8 clubs to get to D3/4 and changed grips to normal size. They came with what I would consider lady's sized grips. Head covers were nice but too large to fit into either my cart bag or walking bag and ended up using socks instead of supplied head covers. Same distance as with my normal irons, but it has been nice to see that my bad shots are not quite as bad. If you like hybrids over regular irons, I'd recommend these clubs and the price is very, very reasonable. I'm 71 and carry a 7 handicap.",
      "rating": 4.0,
      "verified": true,
      "author": "Craig Kennedy",
      "helpful_votes": 3,
      "publication_date": 20181108
    },
    {
      "title": "liked the shape of the head-easy to square up-the shaft ...",
      "text": "liked the shape of the head-easy to square up-the shaft supplied alhough they claim to be a reg shaft it is much closer to a stiff shat and at my age ie 80 would have preferred to have a senior shaft-have lost quite a bit of distance compared to my talylor made irons because of the rigidity of these shafts- would have been ecstatic with these clubs had they been available with a senior shaft or a true reg shaft with a bit more flex",
      "rating": 3.0,
      "verified": true,
      "author": "\"LEN\"",
      "helpful_votes": 6,
      "publication_date": 20180128
    },
    {
      "title": "Great for the higher handicap  senior golfers.",
      "text": "Visually a very attractive set of clubs. I've loss some of swing speed, and the flex is just about right (between stiff and regular). The grips feel a bit awkward, since the size is designed for smaller hands, so I'll be replacing them shortly. The middle to longer hybrids work well, but I've gone back to my standard wedges (PW and SW), again the hybrids feels a bit \"awkward\".",
      "rating": 4.0,
      "verified": true,
      "author": "Gary96825",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Good set for senior",
      "text": "I have problems hitting irons. These hybrids are easier to hit. They need to improve on the followings: (1) the club number is too small to see, I have hard time finding the right club because the size of the number is tiny. The club covers are useless, very easy to come off. So I don't bother to put them on. (2) My regular sand wedge goes 70 yards but this s-hybrid goes 90 yards. I think it has to do with the shaft length. They need to fine-tune it.",
      "rating": 4.0,
      "verified": true,
      "author": "ASL",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Awesome Clubs!!!",
      "text": "Outstanding clubs!! The first time I played with these I was very impressed. I hit them very straight and about 1 1/2 club length farther than the same number iron. I am not so impressed with the plastic-like head covers, but the clubs are a definite best buy.",
      "rating": 5.0,
      "verified": true,
      "author": "cliff.",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Pleasant surprise",
      "text": "Ignoring the fact the head covers w/hybrid irons are necessary and these are terrible as they won't stay on; the clubs perform much better than my modest expectations, especially for the money. These were designed as a 2nd set to leave at an alternate location vs. carry my current set back and forth. The performance is so good I am strongly considering replacing my (5yr old) Callaway and Idea hybrids with another set of these clubs. I want to play another 6-8 rounds (in addition to the initial 6-8 rounds) before making that decision.",
      "rating": 4.0,
      "verified": true,
      "author": "WG",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "I love the weight",
      "text": "I can feel the weight of the head of the club during my swing which allows me better control of the club. I have always had problems with the typical blade irons....it always felt like I was swinging a stick and I could not feel the club face in order to be consistent in striking the ball.",
      "rating": 5.0,
      "verified": true,
      "author": "David J.",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Paint comes off face",
      "text": "A good set of clubs for the money. The paint starts coming off the face after only a few hits. Head covers are cheaply made and start fraying early on. Overall a good value and I will try to find replacement head covers.",
      "rating": 4.0,
      "verified": true,
      "author": "John Smothermon",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Game Changer",
      "text": "The heads are great. I don't like the shafts; the twist is so much that I have to aim right a lot to get them straight (I compared the \"push\" to my last irons). But, I hit them about 10 yards further than my previous irons! I'm getting ready to re-shaft them, and then I'll truly have game changing irons.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr Edwin L Ballard",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Fantastic",
      "text": "Love these clubs, They take a little getting used to but what a great set of golf clubs. I find they are much easier to hit than regular irons, they have taken about five or six strokes off my score. I do recommend then to any player that is having trouble with hitting their irons. I only wish they made a 3 hybrid for that little more distance.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald sanford",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Just love these clubs",
      "text": "Just love these clubs! I'm a mid handicap golfer and thought I'd like to try something new. These clubs took 10 strokes out of my game. I know, I know it's not the clubs its the golfer, but hell these certainly do help. Easy to hit, very forgiving and a good price point. These clubs are a must have for any golfer!",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 3,
      "publication_date": 20180524
    },
    {
      "title": "easy for beginners to intermediates",
      "text": "For the price you can’t beat these clubs, easy for beginners to intermediates! Helped my accuracy from 150 yards and in! Hit em straighter also!",
      "rating": 5.0,
      "verified": true,
      "author": "James F. Pike",
      "helpful_votes": 4,
      "publication_date": 20171224
    },
    {
      "title": "Finally broke 100",
      "text": "Been using these for 1 year and playing for 2. Started with blades. These are amazing clubs. Very forgiving especially if you hold your arms low and use that wide front. I hit way higher and straighter shots than I ever did. None have broke or fallen apart. Very impressed with these",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Great set of hybrid irons",
      "text": "Very nice value hybrid set. I was having trouble with shanking my regular irons, so I wanted a set of hybrids to help correct the problem. These hit a great high trajectory with spin. If you do not rush your swing, they are very easy to hit. They are slightly offset, so I have to be careful not to aim left of target. Other than that I’m very pleased with the quality and performance of these irons.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Doyle-aubrey",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Amazing golf clubs",
      "text": "Amazing golf clubs, extremely forgiving, ball travels farther than with an equivalent iron. So far so good, been able to improve my game by seven strokes.",
      "rating": 5.0,
      "verified": true,
      "author": "Pedro N. Capote/Calderon Business Consultants",
      "helpful_votes": 4,
      "publication_date": 20170901
    },
    {
      "title": "Blue is chipping off easily.",
      "text": "If the blue color wouldn't chip off so easily it would be great. I keep covers on my clubs at all times and they still chip. The sand iron goes way more than my 56 wedge. I would say it is more like a 50. Other than that they are what I wanted.",
      "rating": 3.0,
      "verified": true,
      "author": "John Woessner",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "GOLF MADE FUN AGAIN",
      "text": "THANK YOU JAPAN GOLF I LOVE MY NEW CLUBS WITH ALL MY HEART ESPECIALLY MY SAND AND MY PITCHING WEDGES I NEVER HIT IRON WEDGES WITH THIS MUCH ACCURACY IF YOU ARE HAVING TROUBLE HITTING YOUR IRONS GO WITH THESE HYBRIDS YOU WONT REGRET IT THEY ARE WORTH THE WAITABOUT 8 WEEKS ONCE AGAIN THANK YOU JAPAN FOR MAKING GOF FUN",
      "rating": 5.0,
      "verified": true,
      "author": "James P. Tulli",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Great purchase",
      "text": "Husband absolutely loves these very light weight he does have some back problems and seeing him be able to swing again and enjoy playing makes me so happy",
      "rating": 5.0,
      "verified": true,
      "author": "April McVay",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Buy these clubs!",
      "text": "I've been playing about 5 years. I shoot pretty consistent 45-50 at our 9 hole course. Hit my irons pretty decent until about a year ago and developed this terrible shank i couldn't get rid of. I hit my pw pretty well and a 9 iron but the rest of my irons forget it. Best i ever shot on our 9 hole course was a 40. Tonight i had my first parred course. They are very accurate. I was on in regulation 6 out of 9 holes. The hybrid pw is deadly from 125 yards on in. Very pleased and would highly recommend for the folks that are hitting their irons bad and their woods good. Thanks again!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan B.",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Excellent customer service and satisfaction!",
      "text": "Great clubs....just didn’t work for my husbands golf game. As promised he was able to try these clubs and return if they were not what he wanted. So awesome to deal with! 100% refund. Would totally recommend for the product, customer service and quick response. Thanks again you guys were great! 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Annette",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Haven't hit the course yet",
      "text": "PLEASANTLY surprised!!! For what i paid i expected decent hybrids! what i got was extremely high quality clubs that not only feel great in my hand but also look kinda amazing. not sure why brown head covers were the choice but for what i paid who cares. i haven't played a round yet because of bad weather and work but ive been to my range twice and i have ZERO complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "corey Clark",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Hard to miss hit these clubs.",
      "text": "The clubs arrived on time and in perfect condition. I was impressed with the quality of the workmanship. A day later I took them to the golf dome where I practice in winter and used them all with impressive results. I'm anxious to take them out on a course next month when we go to Georgia.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas L.",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Very attractive appearance.",
      "text": "These clubs are a perfect fit for me. I am disabled and they allow me to play the game of golf.",
      "rating": 5.0,
      "verified": true,
      "author": "Kencollins",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "very very nice clubs if your over 50 like me",
      "text": "What can I say.....very very nice clubs if your over 50 like me..lol so easy to hit A must buy, very long and stays in the fairway !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Arceneaux",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "Great price. Great clubs",
      "text": "Great price. Great clubs. Regained lost distance, and better accuracy. Only drawback are the head covers are a little big to have all in the bag. Would recommend purchasing if you are looking for a set of clubs at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith A. Betts",
      "helpful_votes": 2,
      "publication_date": 20170929
    },
    {
      "title": "See above",
      "text": "Few new sets of clubs which I have purchased in the past have made any difference in how I have played. These clubs have been easier to hit and easier to score . A very good value for a set of good looking and good playing clubs .",
      "rating": 5.0,
      "verified": true,
      "author": "James L McKay",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "WaZaki clubs are great!!",
      "text": "These hi-bred clubs are great. I have been practicing with these clubs and am impressed at how well they look and how easy they are to hit. I honestly did not expect this quality for the price. Only one item i would improve which is that the club number should be much bigger on the club itself. The head covers (that came with the clubs) have great numbers on them which is making me keep the covers on while playing so I know which club I am going to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Carruth",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Hybrid Clubs",
      "text": "Using these clubs for a month. They have made my game better and I highly recommend them. Much easier to use than conventional iron.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Silver",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Is it a copout to use all hybrids? WHO ...",
      "text": "Is it a copout to use all hybrids? WHO CARES!!! As long as I'm enjoying the clubs and the clubs are legal clubs, that's all that matters. My shots are finally going consistently straight, and I added 15 - 30 yards. I've read online that the drawback to using hybrids are that you can't \"shape\" your shots. Heck, as long as my shots go straight, it doesn't matter to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim C.",
      "helpful_votes": 9,
      "publication_date": 20171228
    },
    {
      "title": "Nice clubs",
      "text": "I do not get the distance as i did with other clubs but the feel is great and i use them most of the time",
      "rating": 5.0,
      "verified": true,
      "author": "papajohn7",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Good so far",
      "text": "So far good results. I have increased distance and accuracy. I may change the grips they are a little small for my hands.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Great clubs but got an ugly brown head cover",
      "text": "Hybrids looks awesome and I'm playing better with these compared to regular irons. I would give this 5 stars but I received different head covers that I didnt like, I was eager to get the carbon fiber looking ones but got brown instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Aikham",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Great product at a fabulous price.",
      "text": "I’ve played three rounds and find I hit these one club farther than my old Cleveland hibore clubs. A friend hit them and had me order a set for him to replace his Cleveland 580’s",
      "rating": 5.0,
      "verified": true,
      "author": "bogeybill",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "So far good hitting",
      "text": "They seem good so far however not sure about the higher number hybrids. Don't have much of a feel for chipping with them. Took a golf lesson and the instructor was clueless on how to use them. Duh",
      "rating": 4.0,
      "verified": true,
      "author": "Victor E",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Awesome Value & Performance",
      "text": "I am hitting the ball straighter and with excellent distance! I have some expensive Callaways, some custom clubs and have tried Wedgewood hybrids...but these are outstanding and the price:quality ratio is off the charts! The shafts seem just a tad stiffer than regular. Very, very impressed so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "they are great clubs, easy to hit",
      "text": "Just delivered today, they are great clubs, easy to hit, much easier than traditional irons, soon to be my favorite set!",
      "rating": 5.0,
      "verified": true,
      "author": "Retired golf guy",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Great clubs ¡¡¡",
      "text": "These clubs are economical, with a high level of manufacturing quality. I use to shank most of my shots with my previous irons...not anymore with these great hybrids.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernando Florida ",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "dislike",
      "text": "i just do not like these clubs, I tried to use them to play golf",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Forbis",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Great hybrid irons",
      "text": "More than I expected they not only look good and feel great but they play fabulously",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco Zayas",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Hybrid irons",
      "text": "Anyone who struggles with irons, these will for sure help. My brother and I each have this set and we’ll never not have them.",
      "rating": 5.0,
      "verified": true,
      "author": "ty burstrom",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "I'm glad I bought them however you need a pretty big bag golf bag to house them because the covers on top of the clubs make for",
      "text": "I absolutely love the golf clubs I had to get them regripped I wanted a bigger grip fatter grip. The face of the club shows where from hitting golf balls more than I have ever seen on other golf clubs but I think the reason I like him so much is I can hit him farther and higher then standard golf clubs",
      "rating": 4.0,
      "verified": true,
      "author": "bob lohman",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Easy to hit...good distance",
      "text": "All hybrids are easy to hit but the pitching wedge and sand wedge are not as effective and accurate in my opinion.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Worth every penny.",
      "text": "I just used them and I am sold , love the contact distances the feel. I was having such a bad time with my irons. Now I can't Waite to get back on golf course!",
      "rating": 5.0,
      "verified": true,
      "author": "Ismael Torres Jr.",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Good clubs!!!",
      "text": "I need to play some more, making adjustments takes a while. I do like the fact that I can drive longer with each club comparing to what I had before!",
      "rating": 4.0,
      "verified": true,
      "author": "Jose Pedro Lopez",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Very forgiving!",
      "text": "Reduce mistakes. Hit it straighter with these clubs. Not much use for the sand wedge, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy H. Wigfield",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Well worth the money!",
      "text": "Sold my callaway irons for these, first par 3 I birdied and I hit the 4 almost 200 yards, great feel and well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "I really like these hybrid irons",
      "text": "I really like these hybrid irons. I lost confidence with regular irons but after hitting more greens with my approach shots I'm scoring much better since using these new clubs.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Williams",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Have no fear",
      "text": "Terrific product shipped with care and in time. Very pleased with the packing and with the performance of these clubs. Weighted beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Extreme quality for the price",
      "text": "The clubs are high quality and well made They are well worth what I paid for them I would highly recommend them",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Hayward",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "WowZaki",
      "text": "Never heard of WaZaki before. Initially bought this hybrid set just b/c no major brands make full hybrid sets. Very impressed now - solid ball contact, compression, and consistency. No issues compressing balls with regular shafts. Whoever made this (still don't know much of WaZaki), 5 stars well deserved.",
      "rating": 5.0,
      "verified": true,
      "author": "Single digit H",
      "helpful_votes": 7,
      "publication_date": 20170815
    },
    {
      "title": "Long and Straight",
      "text": "1st Time using a hybrid. Easier to hit and very forgiving.",
      "rating": 5.0,
      "verified": true,
      "author": "Orlando B",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Arrived early.",
      "text": "Arrived ahead of time. Played one round they hit the ball well. Gainned about 15 yards in distance.",
      "rating": 4.0,
      "verified": true,
      "author": "John Pederson",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "High quality",
      "text": "These are very nice clubs , I normally buy taylormade clubs. But wanted a full hybrid set which taylormade don't make. Fortunately these are high quality clubs and really enjoying them",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Gregory",
      "helpful_votes": 6,
      "publication_date": 20170717
    },
    {
      "title": "Great set of clubs",
      "text": "I enjoyed the ease of hitting the golf balls with these clubs",
      "rating": 5.0,
      "verified": true,
      "author": "William Hines",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "but the quality is excellent.. I received them on time and in ...",
      "text": "Since they are golf clubs..we need to use them first..but the quality is excellent.. I received them on time and in good order..",
      "rating": 5.0,
      "verified": true,
      "author": "mann aquino buencamino",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Overall a good club",
      "text": "Headcovers pop off to easily, numbers on clubs are to small and hard to see.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Glynn",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Still reviewing",
      "text": "Instructions were unclear and their video was not available when requested",
      "rating": 3.0,
      "verified": true,
      "author": "Larry Hermen",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "I like the clubs very much nice product would have given ...",
      "text": "I like the clubs very much nice product would have given a five but they are more blue than black thought they where all black",
      "rating": 4.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Hybrid golf set",
      "text": "Nice set of hybrids.... Still trying to adjust the clubs...",
      "rating": 5.0,
      "verified": true,
      "author": "Norman",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Not very happy",
      "text": "I ordered black oil clubs and got blue. After only using them two times, I noticed that the paint is chipping off badly.",
      "rating": 3.0,
      "verified": true,
      "author": "scott parson",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Love the feel and look of the club's.",
      "text": "Like the product I prove my score by ten shots.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Flores",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Great product... Prompt delivery!",
      "text": "Exactly what I was looking for at a reasonable price. Delivery was quick and everything was in great condition when it arrived.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Amazing clubs for the price",
      "text": "Amazing clubs for the price. Easily took 5-10 strokes off my game. Not everyone is effective with hybrids, but if you are you won’t be sorry picking these up and adding them to the arsenal!",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Lawendowski",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Disappointed and aggravated",
      "text": "When the drscription says \"black\" and the pictures show black clubs, one might expect them to be black. The ones I got are blue. I specifically ordered these clubs in large part because I want black clubs. They appear to be good clubs otherwise, and I might yet keep them. But.......argh.",
      "rating": 2.0,
      "verified": true,
      "author": "Shorpy",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "One Star",
      "text": "i didnt like anything the most. I liked the clubs the least.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180417
    }
  ],
  "product_meta": {
    "title": "Japan WaZaki Black Oil Finish WL-IIs 4-SW Mx Steel Hybrid Irons Golf Club Set with Headcover",
    "description": "An Innovative Shape with high ball Speeds.This is what the WaZaki WL-IIs Hybrid Iron brings to us.With the innovative technology designed to create faster ball speeds and more forgiveness.This hybrid iron deserves to be owed.\nThe new WL-IIs hybrid iron comes with a new incredible speed face and a casting body.This creates a low CG and added forgiveness.\nBushikadna Shaft made by MWMF,a company renowned for carbon fiber. The Shaft is the same stiffness tip to butt shaft delivers stability and control,that made by titanium and carbon. There are three flex is in available.\nBy doing this, this club offers up the full packages of high MOI for maximum forgiveness, impressive ball speed and launch stability.\nBrand:WaZaki\nModel:WL-IIs\nProduct:Hybrid Iron Set(456789ps)\nHand:RH\nHandcover:WaZaki Hybrid Iron Headcovers\nGender:Men\nLoft:21,24,27,30,34,38,42,46\nFace Angle:0 Degree\nF.P.:16.5,17.5,18,18.5,20,21,22,22.5\nSize:126,124,122,120,118,116,114,114cc\nLie Angle:61,61.5,62,62.5,63,63.5,64,64 Degree\nHead Material:Matrix Steel(high Strength stain steel)\nHead WT.:242,248,254,260,266,272,278,284g\nLaunch:Mid\nShaft:Bushikadna\nShaft Material:Gold Graphite\nShaft WT.:65g/55g\nRegular\nFlex:Regular\nCPM:260\nS.W.:D1/D2\nTorque:4.5/4.4\nIron W.T.:Standard\nGrip:WaZaki VL\nGrip WT.:55g\nCore:Round\nGrip Size:0.58\nLength:39.5,39,38.5,38,37.5,37,36.5,36.25\nOriginal Country:Japan\nHead-Made in Japan\nShaft-Made in Japan\nAssemble in Japan\nYou should receive\n456789ps Irons,Headcovers\nWaZaki Suggestion:\nWe sell two flex model,55g R,65g pro R.If you are get used to taylormade or callaway hybrids,the pro shaft is great.If get used to clevelands or the elderthe 55g R ones are more close to.The light shaft torque is 0.2/0.5 more than pro.",
    "rating": 4.3,
    "feature_bullets": [
      "A New Look with Traditional Japanese Black Finish Technology head. The club head is whole black finish with the blue paint cover the top and edges of the bottom, which makes it looks more great than whole black one.",
      "The new Speed face is a thinnest and different thickness made by thin, light and robust material. This WL-IIs face makes more speed over the face, increases distance, enlarges the sweet spot, and offers more forgiveness for off-center hits. The casting body promotes a lower forward CG location that provides high launch and low spin.",
      "MWMF Bushikadna Shaft is the same stiffness tip to butt shaft delivers stability and control, that made by titanium and carbon. There are three flex is in available, Regular, Stiff Regular, Stiff.",
      "Standard Length for 4,5,6,7,8,9,Pw,Sw is 39.5\",39\",38.5\",38\",37.5\",37\",36.5\",36.25\". Plus half inch length is 40\",39.5\",39\",38.5\",38\",37.5\",37\",36.75\".",
      "There are two models available for different players, one is 65 pro shaft, one is 55 light shaft. If the model which you bought is don't suit for you. We accept free to return and exchange within 46 days from you bought the clubs."
    ],
    "specifications": {
      "Date First Available": "May 8, 2018",
      "Manufacturer": "Wazaki",
      "ASIN": "B07D2JQS6Q",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sets",
      "Sports & Outdoors",
      "Irons",
      "Golf Clubs",
      "Sports & Fitness",
      "Golf"
    ],
    "price": 295.99
  }
}