{
  "website_summaries": [
    {
      "verdict": "A basic ice roller that can be used for a variety of cosmetic and therapeutic uses.",
      "pros": [
        "Gel ice roller",
        "Use on facial skin to shrink pores and calm skin",
        "Strengthens skin collagen to help prevent wrinkles",
        "Helps soothe facial swelling and ease headache pain",
        "Reduces appearance of bags under eyes",
        "Can be used to soothe inflammation on other parts of the body as well"
      ],
      "cons": [
        "Size is a bit large to use comfortably around eyes and nose"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Amazing for sinus pain!",
      "text": "I was in the habit of rolling a cold can of soda on my forehead to help with tension headaches and sinus pain but that was cumbersome and not always cold enough. This ice roller works so well to ease the pain from sinuses and tension. It froze very quick and I felt instant relief. The rolling motion even cleared my sinuses and I could breathe better right away. I love this. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "DT",
      "helpful_votes": 218,
      "publication_date": 20180108
    },
    {
      "title": "First time using this and I’m pleasantly surprised",
      "text": "Extremely affordable and feels great on my face right when i wake up in the morning!! I can feel the difference after a couple of rolls along my puffy eyes and face. It soothes my puffiness with the cold but Bearable feeling. And it does stay cool for a good amount of time. Best thing is its not a watery mess. I read other reviews about people complaining that the handle is plastic and cheap.... COME ON people YOURE paying LESS than $20.00 for this what do you expect?? Top of the line material??",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy N.",
      "helpful_votes": 192,
      "publication_date": 20180511
    },
    {
      "title": "Great for Migraines!",
      "text": "I have awful migraines. When I have a migraine I like to have something cold on my face and head. This does the trick! It’s soothing to rub it along my forehead when my head hurts so bad!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 184,
      "publication_date": 20171122
    },
    {
      "title": "Great for redness and helps with migraines",
      "text": "I use this whenever I feel tired, and always after I’ve cleansed my face. I use rubbing alcohol to clean it after use and then put it back in the freezer in it’s own ziplock. I notice it’s helped with the redness in my face and it also helped when I’ve had migraines. It starts behind my eye so I roll it over whichever side of my head is in pain and it seems to help.",
      "rating": 5.0,
      "verified": true,
      "author": "maihiro",
      "helpful_votes": 129,
      "publication_date": 20180522
    },
    {
      "title": "It really is useful...",
      "text": "This has helped my makeup look smoother and last longer. I live stream and record videos and this tool has been beneficial. I use it in the mornings at the end of my skincare routine. It wakes me up and helps with my tired eyes. I don't use it at night because it's a bit too stimulating to me...and I need my beauty sleep. I recommend this in conjunction with a jade roller--not in place of. I keep mine in the plastic bag (or you can use a ziploc) in the freezer and just grab when I want to use it in the morning.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Rogers",
      "helpful_votes": 113,
      "publication_date": 20180813
    },
    {
      "title": "Lifesaver!",
      "text": "It is a lifesaver!!! I bought it for pain relief e.g. Migraine and high temp induced neuropathy. I also have a tethered spinal cord and find that cold treatment helps more. It remains cold for a long time, which is beyond helpful. I hope it lasts a long time because it's very convenient to have on hand during the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 143,
      "publication_date": 20170613
    },
    {
      "title": "I'm in love. SO many uses.",
      "text": "I was skeptical about this product - I wasn't sure how it was much different than rolling any other frozen thing on your body. I'm beyond pleasantly surprised. I've used it for sinus pain, migraines, swollen neck glands, under eye circles/bags, inflamed acne, TMJ pain, ect. Not to mention, when used on my face, it leaves my skin feeling tight and wakes me up in the mornings. It also stays cold for forever, but it never sweats or leaves water behind. It's like magic. I also bought one for my mom who suffers from nerve damage in her arms and legs. I think it'll really help when she has bad pain days.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica McRee",
      "helpful_votes": 93,
      "publication_date": 20190107
    },
    {
      "title": "A great home treatment for many ailments!",
      "text": "This is AWESOME! I used it twice today. It’s SO cold and takes a few to get used to on my face initially, but then a constant, “ahhhhhhh.” So good! I use it for under eye puffiness (which resolved a great deal using this), flushing of my cheeks (really feel great and cools off), and good for migraines to rub over my forehead, temples, above my eyes and my neck. The size is awesome for what I use it for. It gets cold rather quickly too. It’s hard, not soft, so you can apply as much pressure as desired for effect. Superb product, VERY happy!! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 57,
      "publication_date": 20180906
    },
    {
      "title": "OBSESSED- how have I lived without this?",
      "text": "These great reviews are for a reason! How have I lived without this little gem?! I’ve had it for two days and have used it 5+ times... SO relaxing, helps with my rosacea inflammation and on incoming painful zits. I haven’t had a headaches to try it out, but going by how nice it feels on my neck and forehead I would assume it’s effective in that sense as well! Stop contemplating- get it! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 9,
      "publication_date": 20190826
    },
    {
      "title": "Amazing before makeup!",
      "text": "I use this on my face and eyes in the morning and it de puffs the eye area as well as makes my skin smooth before I apply my make up. Wash your face with hot water then put your serums on before rolling and it will seal it in your skin! Makes my makeup look extra amazing! Whoever complained about not being able to use it on their eyes due to size was being silly. That was my only deterrent and it wasn’t a problem when I tried it.",
      "rating": 5.0,
      "verified": true,
      "author": "Glam Mom",
      "helpful_votes": 21,
      "publication_date": 20180820
    },
    {
      "title": "Overall happy with my purchase",
      "text": "I bought this to wake up my face in the am. It helps with inflation and under eye bags. I grind my teeth hard at night so it helps to roll over my sore jaw. I was surprised how fast it got cold in the freezer after 10 min. I’m knocking off one star because of its size. It’s too big. It’s hard to delicately roll over my under eyes. Its big enough to be a back massager. Overall happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20180424
    },
    {
      "title": "Cold, but really, really hard",
      "text": "It's bigger than I thought it would be which is good. I thought the roller would be made of gel and be a little softer than the hard plastic. I bought this for help with migraine headaches. I have used it once and it is so hard that it hurt my already hurting head. I didn't find it very soothing, unfortunately. I also don't know if I could use it for puffy eyes as it will not contour to the shape of your eye.",
      "rating": 3.0,
      "verified": true,
      "author": "Suzanne M. Bucher",
      "helpful_votes": 10,
      "publication_date": 20180704
    },
    {
      "title": "Woah, a game changer. I use 1-2x/daily. ...",
      "text": "Woah, a game changer. I use 1-2x/daily. Definitely use when I wake up to tighten my face and undereyes. Also I have used when I have a headache and it helps bring some relief. Will update with more use.",
      "rating": 5.0,
      "verified": true,
      "author": "alyxsheerheart",
      "helpful_votes": 23,
      "publication_date": 20170831
    },
    {
      "title": "Perfect ice roller as long as you don't get a lemon!",
      "text": "I absolutely love this ice roller. HOWEVER it appears I received a lemon. Everything looked perfect out of packaging but after putting it into the freezer it appears on side has \"popped off\". While it still rolls wonky and is connected small pieces of the roller itself chip off due to the friction of rolling. May have to get this one exchanged.",
      "rating": 4.0,
      "verified": true,
      "author": "Eddie M.",
      "helpful_votes": 6,
      "publication_date": 20191010
    },
    {
      "title": "PERFECT!",
      "text": "This is the perfect go to in my freezer! I purchased it as an Esthetician to bring down redness from treatments on myself. I use it for that but also found it great for swelling anywhere, my partially torn meniscus pain, etc. Forget the bag of peas or saline filled glove. This works awesome and have bought multiples.",
      "rating": 5.0,
      "verified": true,
      "author": "kimberley Henschel",
      "helpful_votes": 7,
      "publication_date": 20180709
    },
    {
      "title": "Does not work as advertised",
      "text": "The spin roller on the product that rolls on the face was broken and popped off upon me trying it the same day I received it. It is also literally a plastic cylinder and may find it better to just ice with a frozen food bag.",
      "rating": 1.0,
      "verified": true,
      "author": "Say ",
      "helpful_votes": 5,
      "publication_date": 20191031
    },
    {
      "title": "ABSOLUTELY LIFE-CHANGING",
      "text": "I was on a Zoom meeting last week, and my team noticed a colleague using this on her face (we're pretty close!). After a good razzing and a handful of questions, we had this link in the chat. I have NEVER been this satisfied with a purchase intended as a joke. Use it in the morning? Reborn. Feeling puffy? BAM, not anymore. It's like a cold shower minus the feeling that you're going to die. 10/10. Do it. Clean between uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Hebert",
      "helpful_votes": 4,
      "publication_date": 20200423
    },
    {
      "title": "Fun to use and feels great on the under eyes",
      "text": "Product arrived exactly as described. I keep it in the freezer and it stays ice cold for about 15 minutes of use. It doesn’t get watery or “sweat.” It’s easy to clean - I wash the roller and keep it in a ziplock bag. I mainly use it to massage my under eyes and, while I do think it helps perk me up in the morning, I don’t really think I’m gaining any long term benefits, such as preventing wrinkles (as described by the Seller in the Description section). However, it’s fun to use and feels great on my face in the mornings.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 2,
      "publication_date": 20201013
    },
    {
      "title": "Doesn’t hold cold temperature for long. Good for a quick swipe.",
      "text": "I got this ice roller to combat morning face puffiness. I like that it comes with two rollers. I prefer the metal one because IMO it holds the cold better. I got this for the face; however once it arrived I thought it could multi-task as an ice pack for headaches, but it doesn’t because it warms up too quickly. If I was buying this today I would want one made from a different material that can hold the cold for a longer period of time. Is that too much to ask for? I don’t think so.",
      "rating": 2.0,
      "verified": true,
      "author": "capricious",
      "helpful_votes": 2,
      "publication_date": 20200510
    },
    {
      "title": "I love this ice roller",
      "text": "I love this ice roller. I use it every morning while drinking coffee and reading news. I haven't used long enough to know if it's helping fine lines but I definetly think it helps with puffy eyes and also helps with redness. It's very cool and is just a nice boost in morning. I don't get headaches so I cannot confirm or deny if it helps for that but that seems reasonable. I highly recommend and it's a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Brickman",
      "helpful_votes": 5,
      "publication_date": 20180225
    },
    {
      "title": "Great value",
      "text": "Omg. This product is sturdy without being heavy. Looks well made and has a metal and a plastic head. Good size. I can’t wait to use it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180822
    },
    {
      "title": "Hey, it works for me!",
      "text": "I love this thing! I’ve been using it every day for more than a month and, while I don’t see any life altering changes, I do feel like it helps to plump my skin and add a natural rosiness that lasts for several hours. I mosty use it just because it feels good and relaxes me. As others have mentioned, the metal barrel does make a horrible screeching sound, but I just added a dab of coconut oil to the little divet it fits into and it fixed it for me. The handle is pretty cheap feeling but I wasn’t expecting much better for such a low price. I plan on buying these as stocking stuffers when Christmas rolls around.",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal Lake",
      "helpful_votes": 2,
      "publication_date": 20190327
    },
    {
      "title": "Goo leaks out..",
      "text": "This thing is garbage. Bought one, immediately starting leaking upon first usage and had to return it... they replaced it instantly. Now the plastic piece on this one that keeps all the liquid in completely broke off. Super disappointed. It worked great while it wasn’t leaking toxic goo!!!",
      "rating": 1.0,
      "verified": true,
      "author": "ALLEGRA F.",
      "helpful_votes": 4,
      "publication_date": 20200623
    },
    {
      "title": "Fantastic for my reactive skin!",
      "text": "I love this roller. I have sensitive, fair skin with rosacea. This helps when my skin is irritated or when I'm just feeling puffy. I love the way it feels and how it calms my skin. I keep the roller part in the freezer all the time, and just take it out and put it on the handle when I need it. After getting a little too much sun the other day, this was a lifesaver!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica A. Miller",
      "helpful_votes": 6,
      "publication_date": 20180620
    },
    {
      "title": "Cheap Product!",
      "text": "Got this product in the mail and am just bummed out. I was super excited to try this out because i've seen it everywhere and got the red one because it was fun and bright. What I got was a plastic piece of crap. Like some of the other pictures, they send you some cheap knockoff that has absolutely no gel and is all plastic. Not worth the 20+ dollars.",
      "rating": 1.0,
      "verified": true,
      "author": "jigglypuff",
      "helpful_votes": 3,
      "publication_date": 20200613
    },
    {
      "title": "Love this on those early puffy mornings",
      "text": "This just feels so nice after those no-sleep, restless nights. No magic skin glow but it is just so darn soothing and helps diminish the embarrassing eye puffiness. Works great on a tense neck too. I'm an unfortunate sucker for Amazon deal of the days and strategically placed recommended items but this is probably the best self-care tool i was suckered into buying all year. Great quality and easy to wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 3,
      "publication_date": 20181031
    },
    {
      "title": "Great For Headache",
      "text": "I was so pleased to have the roller. Today I awoke with a headache and had plans to go out with my daughter. I really didn't fell well and had the headache. I had the roller in the freezer since I purchased it and had forgotten it was there. I took it out and started to roll my head and temples and the back of my neck. I did it for about 10 minutes and felt it going away without taking any pills. I am loving this roller and will use it more for cosmetic issues as well. I would try it if you get headaches. I get Migraines and I wish I had this in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Elena Marie",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "Disappointed",
      "text": "Got this a little over a month ago. Had actually liked it but now this happened and I can’t put it back together. I understand it’s cheap but at least have a longer survival of a few months please. Update second picture I still tried to use it and suddenly it got worse I have found no contact information to file a complaint didn’t even last a few months unbelievable",
      "rating": 1.0,
      "verified": true,
      "author": "Claudia ",
      "helpful_votes": 3,
      "publication_date": 20200703
    },
    {
      "title": "Ice Roller a Must for Migraines!",
      "text": "This ice rolled really works for helping to relieve my migraines IF I use it soon enough! It concentrates the cold (but not too much) right where I need it most. Then it allows me to move it over my eyes, forehead and cheeks, cooling down my face. You really do need the one with two rollers! If you fall asleep, having used 1 roller and wake up needing another, the next is ready and waiting for you! I can also see how it would be good for beauty applications. It is overall a very soothing feeling on your face. The silver roller is slightly colder and holds the cold longer than the blue cylinder.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Quinton",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Don't buy it.",
      "text": "I saw another ad on FB, thought this would be a cool product to have. I tried it a few times for a few different things, but really it's not worth it. I feel like the ads show it working so much better than it actually does. Stop wasting your money on a bunch of bs.",
      "rating": 1.0,
      "verified": true,
      "author": "RP",
      "helpful_votes": 2,
      "publication_date": 20200112
    },
    {
      "title": "Poorly crafted junk. Broken upon arrival. No refund granted. BS*",
      "text": "This product is absolute garbage and the customer service is terrible. I've been trying to return it and get a refund for some time. The roller falls off the body of the device. This is so poorly made - it doesn't work! Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie S.",
      "helpful_votes": 2,
      "publication_date": 20200930
    },
    {
      "title": "I LOVE THIS SO MUCH",
      "text": "This ice roller is extremely soothing for morning puffiness. It visibly decreases swelling and makes my skin tighter(not to mention ice on my face in the morning helps wake me up!) I use it in my everyday routine now. I also found it useful to sooth a bad headache by rubbing over my temples. One thing to note is that it's rather large, nothing like a Jade roller, but it does the trick for under the eyes just fine. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 4,
      "publication_date": 20190219
    },
    {
      "title": "Magical!! Feels amazing and it works!",
      "text": "This is amazing!!! A couple of days I woke up with puffy eyes and a headache and just rolled this on my face and it worked in minutes!! It feels soooo good. Brings down the swelling, closes the pores and gets rid of the puffiness. I also had back surgery almost 4 wks ago ....I can wait to use it on my scar area when it heals up. This would be a great Christmas gift, Mothers day gift even for Dads, yankee swap gift or just a gift for yourself!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Great for reducing facial puffiness & eye bags",
      "text": "I use mine in the morning when I wake up , to reduce puffiness, and my Gucci bags under my eyes from having 3 boys. It feels amazing and refreshing. I also use after I get out of the shower for a refreshing boost as i do my nightly facial routine. Definitely reccomend!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Bray",
      "helpful_votes": 2,
      "publication_date": 20200831
    },
    {
      "title": "Great buy! Definitely recommend",
      "text": "I got this after I saw a bunch of YouTubers recommending it on their Amazon fav videos. I love this! It gets super cold, the roller separates from the handle so it is easy to clean. I used this when I was having allergies& itchy eyes and when I remember I had it, I ran to the freezer, grabbed it and sat it & rolled it over my eyes lids. So much better than a traditional ice back because of the shape and size. No stiff square icepack that wont fit where I need it! This is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Roll the pain away, no mess! Love it! bye Felicia 👋🏼",
      "text": "Omg! Ok I just got this a few hours ago... but! Oh thank god! Migraines... freeze these two rollers, and then this, it numbs the area in a bittersweet way! I can already see myself carrying this thing around in the summer even when it’s too hot because the heat causes migraines and pain. it’s a little hard, it would be nice if it had like a soft gel type roller added also or an option to add that on for when it’s rolling on bone, but overall it will definitely be something I will be using a lot, I can already tell. 🙏",
      "rating": 5.0,
      "verified": true,
      "author": "PublicNameUser101",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Doesn't actually feel very cold...",
      "text": "I guess it's more convenient than an ice cube...but it doesn't feel as cold as my little SoothieQ or the glass orb thingy. it's also about a third too big to fit my forehead and face, so the sides of the wheel are basically useless. The handle isn't very easy to grip, either.",
      "rating": 2.0,
      "verified": true,
      "author": "A B",
      "helpful_votes": 3,
      "publication_date": 20181215
    },
    {
      "title": "Excellent for quick headache relief",
      "text": "I was a little skeptical at first about whether this would help my headaches, but anyone who suffers from sinus headaches or migraines knows you’ll try just about anything. My sister recommended this for a variety of reasons but knew I get some pretty bad headaches. This really helps! The cold is a shock the first time you use it but each time I’ve had a sinus headache and used this, I get instant relief (it may not make the headache go away but it often helps make it tolerable and is medication free). I only wish it stayed cold longer, but it gets the job done",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer D",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "lifesaver",
      "text": "This thing has exceeded all expectations for a device under $10. It had a slight smell at first but it went away after the second use. Sometimes if I leave it out and it gets condensation on it it will be a little icy when I get it out of the freezer but they break off and it's fine. I bought it to use for my TMJ but I'm using it for migraine and for undereye puffiness as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Ernatt",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Icy Like 1017",
      "text": "Honestly, I dont know what this device is \"officially\" supposed to be used for, but my wife and I keep it in the freezer. If we wake up feeling a bit sore (because we're getting older and our decrepit bodies can't take the beating they once used to), we roll this ice massager around the pain and the pain goes away. It's excellent for those \"I'm not exactly hungover, but have a headache\" mornings. Just roll this icy, magic gift from god around your face and neck and feel about 35% less horrible than you did ten minutes ago. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Skidmore",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Good medical device",
      "text": "Similar medical devices for my condition cost hundreds. This device does the same thing for a fraction the price. I have extreme polycythemia and get over supply of blood everywhere. When its happening this thing is a miracle! I use it to cold roll my engorged erections until the massive swelling subsidies. I took of a star as the handle seems a little cheap, other then that I like the device. Ill see if I can get a photo or video as it says “ Shoppers find images and videos more helpful than text alone.“ and I tend to agree.",
      "rating": 4.0,
      "verified": true,
      "author": "JHW",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Bye bye puffy eyes!",
      "text": "Awesome! I love this item. Easy to hold and change out rollers. It is great to use in the morning if your face is puffy. I have used it on a hurting muscle. It is cold, and stays cold- I keep mine in the freezer. This will be my ”go to” gift giving item.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Clark",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Hot day, headache, or inflammation relief!",
      "text": "I first got this as a river float bachelorette gift. My entire family fought over it so we had to buy a bunch across moms house and my household. I have shoulder and arm pain from computer overuse and find it extremely helpful to gently ice those inflamed areas. Mom lives in LA and loves it to cool down on a hot summer day in from on the tv. It doesn’t melt water leaving a mess which is why we adore it! Awesome for hangover or regular headaches as well ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Carla",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Stays cool a long time",
      "text": "I found this to be very easy to use, it does reach under your eyes with no problem. It moves smoothly and feels great to the touch, not too cold. It is not like putting ice on your face which is too harsh. Allowed my friends to try it out, and they were impressed. I think it is great for after facial treatments. You can also use this on a burn, as long as it is not an open wound. Along the temples feels terrific especially if you have a headache. So glad I purchased this.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mang",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "More for body not for face at all.",
      "text": "Not what I expected at all. It’s huge and can not be used on my facial clients. I now how to repurchase them from someone else. If you want it for your body then sure but for your face it’s way too big. It did however arrive on time so that’s a huge plus if this is what you want.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 2,
      "publication_date": 20190607
    },
    {
      "title": "Genius!",
      "text": "This is such an excellent, yet simple product. I often have puffy eyes regardless of how much sleep I get. Between allergies and animals I'm constantly trying to \"un-puff\" using spoons kept in the freezer, a cool washcloth etc. But this is nice because it has a handle and you can just roll it across your face. It would be beneficial for those with a sinus infection also to help cool the pressure & swelling.",
      "rating": 5.0,
      "verified": true,
      "author": "Karin E Challis",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Great purchase",
      "text": "Huge migraine sufferer for over 36 years! I am a fan of cold and ice when my migraines get bad. Sometimes I need that rolling cold pressure and this device fits the bill! Great coverage and stays cold for a long time. Was a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri Novoa-Wisener",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Nice idea for migraines",
      "text": "Nice idea for migraines. Feels nice as it is a cooling product, however when battling migraines I don't like moving (especially the constant movement that is required for this product to work). If you are lucky enough to have someone else roll this around on you I'm sure it would feel lovely. Smart product",
      "rating": 4.0,
      "verified": true,
      "author": "SasquatchRevenge",
      "helpful_votes": 5,
      "publication_date": 20180301
    },
    {
      "title": "Game Changer",
      "text": "Love it! (My moms account)I am 16 and I have battled with acne for a while. I have tried everything to get those pesky, red, and inflamed pimples to calm down. I found that ice really worked for me. The only bad part was the mess that came with it, my shirt would be drenched with water. I eventually ended up putting a towel on my neck every day. Now, I have nothing to complain about! I am dry, and the outcome is the same. I am super pleased with this product! I couldn’t ask for anything better, and I definitely recommend it to everyone battling acne like I am!",
      "rating": 5.0,
      "verified": true,
      "author": "Manifestlife",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Happy Camper!",
      "text": "I had double jaw surgery a little over a month ago & I noticed some random & residual swelling (completely normal for the first 12 months), so I decided to buy this ice roller as I’ve heard great things about their ability to assist with minimizing swelling and muscle aches. I’m a very happy camper! I apply Arnica gel & my skin care products to my face first & then use the ice roller for about 10 minutes twice a day. I have genuinely noticed a huge difference in swelling of the cheeks & jawline. It has also helped to minimize pressure & muscle pain before bedtime. (:",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea S.",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Amazing product",
      "text": "I purchased this for a few reasons...one being I have horrible TMJ pain in my jaw and Ive struggled to find ways to soothe the pain and this does a perfect job! Along with my bottom wisdom tooth is also coming in on the same side as the TMJ so Im glad I purchased when I did because it helps with pain relief. Another reason for buying this is because I am trying to take better care of my skin on my face so I will throw on a face mask and roll over it for 5-10 minutes and it makes my skin feel nice and cool!",
      "rating": 5.0,
      "verified": true,
      "author": "Jada Hampton",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great product.",
      "text": "I love this item. Feels nice after I wash my face I rub the roller and it tingles. I’ve seen my skin improve. I’m not going to say that it gets wrinkles and other blemishes off because that is a not true but it makes your face look more plump.",
      "rating": 5.0,
      "verified": true,
      "author": "latinasabrozza",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Decent roller feels soothing",
      "text": "Been using the roller a lot, like that handle can come off to keep it from being too cold when in freezer but even if you leave it on, it isn't too cold. The roller stays cold for awhile, I use it on thighs, belly, and flabby upper arms -- all places where I lost weight and have wrinkles. Not sure if it helps, yet. The roller is just wide enough to cover about 3 inches and is easy to roll -- easier than the kind using a ball.",
      "rating": 4.0,
      "verified": true,
      "author": "Ursula K",
      "helpful_votes": 3,
      "publication_date": 20180512
    },
    {
      "title": "Wonderful Product!",
      "text": "I purchased this ice roller to help with inflammation and swelling after esthetician treatments and for help with sinus pressure. I absolutely love this product and would 100% recommend to others. Feels great to apply to cold roller to your face. This roller smooths over your face with ease, and it leaves your face feeling wonderful. I can feel the difference and it makes my face feel not as puffy after using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bre Heard",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "This really works well without any mess.",
      "text": "So this is a guy's opinion on an issue that this great idea finally fixed. So for guys that use an electric shaver daily this is FAR better than any after shave lotion or balm that has ever been invented. I need to shave daily for presentation at my job. Not a casual place. Any lotion post shave made my face irritated and red. They just didn't work. This baby cools my face and stops any inflammation. It feels great. Goes back in the freezer and is ready for the next day. Finally free of that post shave alcoholic shock wave. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Good temporary pain relief",
      "text": "Purchased to ease neck and lower back pain. Works great for temporary relief. I pop the entire think in the freezer. Didn’t need to remove the roller ball. Rolls smoothly and freezes rock solid. No complaints about the product.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy Baker",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Roller will only stay in place w light pressure",
      "text": "At first, I really liked this purchase. I put the roller in the freezer and it felt great after a long day. I have chronic headaches and constant sinus pressure, so I was excited to have a tool that could help give me relief. However, I found that the pressure I need for my pain relief exceeds the abilities of this tool. I have gone many months without using it because it just feels too light. And if I push too hard on it, the roller pops out! Overall not a horrible buy but if you need very concentrated pressure, I wouldn’t recommend this roller.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Judge",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "LOVE this ice roller!",
      "text": "I got this ice roller three days ago and so far I LOVE it! I had a debilitating migraine yesterday and while I cannot say that it cured it, rolling it on my neck and forehead definitely helped. Then today after working in my garden for two hours I came in the house sweating and about to pass out and relief was instantaneous! I love this thing so much i am buying another. I can't testify how well it will hold up since I have only had it a few days, but so far so good. I'll update my review if anything changes. Do yourself a favor - just buy one!",
      "rating": 5.0,
      "verified": true,
      "author": "dblchocmint",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "LOVEEEE!",
      "text": "This is probably one of my favorite products I've ever bought off Amazon! I deal with tension in my brows and even though I do acupuncture I still manage to have pain sometimes. I run this over my face and neck it stays cold and is easy to clean. At first I thought the tool was too big but now I've come to think that it's the perfect size. If you close your eyes you can just rest it on your eye and it will relieve puffiness. It came with a stainless steel looking roller and a blue beaded one. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dulce",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "So many uses!",
      "text": "I love this roller so much that I went on to purchase several as gifts. I see it every morning in my freezer when I get icepacks for my kids’ lunches and it’s the perfect little pick me up to start the morning. Also use it to roll over my calves and quad after a run. My kids even like to run it across their foreheads to cool off after running around outside. Good for when they have fevers as well! We just use it for everything and it’s easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Tera Q",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Good versatility",
      "text": "I bought this mostly for my face for puffy eyes in the morning, but wanted something that could be more versatile so I could ice roll my shins or calves after running. If you're looking for an ice roller with more versatility than just your eyes and face, I would say this is a good buy. But if you're looking for something specifically for your face, this will do the trick, but maybe something smaller might be a little nicer.",
      "rating": 4.0,
      "verified": true,
      "author": "Hope Lindsey",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Fantastic product !!!!!!",
      "text": "I love 💘💘💘💘💘💘 this product! I suffer with very bad sinus problems & migraine headaches & this has been delightful. It doesn't melt like regular ice packs & it is so easy to use and so smooth on face. I am going to order a second one. Very happy ☺☺ and satisfied. Thanks for such a great roller.",
      "rating": 5.0,
      "verified": true,
      "author": "maureen",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "I LOVE THIS!",
      "text": "I have a chronic illness that tends to overheat me, but I’m also peri-menopausal. I LOVE THIS silly roller. It truly helps, and it’s discreet. If I’m sweating after I get off the subway but still want to look fresh, this is my go-to solution. I recommend it for all women between 30-90. It gives serious relief !",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Levine",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great product. Easy to use",
      "text": "Great product. Easy to use. The roller moves smoothly and even after being in the freezer for hours, it is not so cold that it is uncomfortable to use.",
      "rating": 5.0,
      "verified": true,
      "author": "KMCEsq",
      "helpful_votes": 8,
      "publication_date": 20170406
    },
    {
      "title": "Relieves facial and neck stress well",
      "text": "Love it! The cold roller helps relieve stress to my face neck and shoulders as I roll it on. The plastic holder is a little thin and could easily break if dropped but the cold roller is higher quality and works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Burnjrd",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Say goodbye to your puffy eyes",
      "text": "This is amazing. Whether you have swollen puffy face problems, or you have a cold or sinus infection. This ice roller is amazing. Truly amazing. I’ve been sick lately and this has given me way more relief in my face than any anti inflammatory medication. Super easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy N",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "A gift for migraines",
      "text": "I purchased this as a gift for my friend who suffers from migraines. She's reported that not only does she enjoy it, but that her husband often steals it from the freezer for his own headache relief. I may have to buy one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Wilde",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "How did I live without? Well, I just looked puffy",
      "text": "I feel like these people should send me a free one because I recommend to everyone!! Thinking about buying another because i cried a lot yesterday and did not want to go downstairs after rolling at evening to put it back in the freezer so it would be available in the morning. Forget the jade, rose quartz, etc...ICE is where it’s at.",
      "rating": 5.0,
      "verified": true,
      "author": "Elise",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Easy to use",
      "text": "I got this product to decrease the redness in my face. I've only used it a few times so time will tell if it will do the trick. I do believe, however, that it has reduced puffiness around my eyes after only a couple of uses. The handpiece is definitely squeaky, like others have noted, but for the short time that you use it, it's no big deal. Plus, the roller can be used without the handle if it's too annoying. Overall, I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "impulse buy but no regrets!",
      "text": "I can't explain why I bought this exactly. I can tell you that I do love it. I had a migraine recently and used this on my neck and head. It really helped! As far as skin care goes, I get puffy eyed and red from allergies. This was great at calming my skin. I wish it came in a smaller size for around the eyes. It also works great for after a face scrub and moisturizer to minimize pores. I would order this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Sam",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Rollin Cold!",
      "text": "I've always wanted a helmet of ice to encase my head when I have a migraine. I don't like icepacks--they slide and the condensation leaks and the velcro straps are irritating, et cetera. This little roller gets condensation too, true, but it makes up for it by being a literal roller of ice that rolls where you want. It stays frozen/cold for a long time, and while it is plastic, there aren't hard pointed scratchy edges. It really does what it says. Rolls Ice.",
      "rating": 5.0,
      "verified": true,
      "author": "plum",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Worth every penny!!!!!",
      "text": "I LOVE this product ! I have severe atopic dermatitis and roseaca, I'm always itchy & sometimes burning and in pain from it. For the face roseaca the roller feels AMAZING!! When the itching gets unbearable from the atopic dermatitis putting something cold on it can sometimes distract from the need to claw at it. Until now I have used frozen peas, but the roller is going to be so easy to use!!! I also think anyone getting hot flashes would love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "LBM",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Must have for puffiness and migraines",
      "text": "Great to use first thing in the morning... wash face, put any serums and moisturizers on, the ice roll - it reduces puffiness and swelling. Also great for migraines...just roll face and neck and it provides great relief!",
      "rating": 5.0,
      "verified": true,
      "author": "Jkats",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "great little device to keep in freezer",
      "text": "feels so good on a hot day or if feeling inflamed around sinuses. i use it instead of jade rollers now too. it's large so covers more area. it's lightweight and easy to hold. freezes super fast. stays nice and cold a good 15 minutes. i only wish it came in a protective case of some kind as other similar products do that belong w food in a freezer. hence one star lost.",
      "rating": 4.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Works great for me!",
      "text": "I was hesitant to buy this ice roller because other reviews said that it was too large to get close to the eyes. I don't have that problem. Everyone has a different shaped face so maybe that makes the difference. I use the ice roller first thing in the morning to help me to wake up and reduce puffiness under my eyes. It makes my skin feel tight and I have a nice healthy glow for the day. There were several reviews that said that this ice roller is good for migraines and I bet it is. I'm going to buy one for a friend that suffers from migraines.",
      "rating": 5.0,
      "verified": true,
      "author": "RB....",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Stays cold a long time",
      "text": "As a chronic migraine suffer I am always looking for ways to help the pain. This is working for me, I store it in the freezer and take it out roll it across my forehead, temples, neck wherever the pain is located and it does relieve the tension and pain. I think it works better than most ice packs and stays cold longer. Will be buying more so I always have a cold one and a couple for my mom who is also a migraine sufferer",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Hall",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Must have ! Slimmed my face down !",
      "text": "So so good! At first it's almost like shock to the face, because duh it's cold! But man after a minute of rooling it it's so addictive and it feels so great ! I really motive a difference in puffiness and ita almost like I am coolsculpting my face! Application: I apply at night after cleansing and roll , after I apply moisturizer. I keep the roller part in the freezer keep in mind to also keep clean since it can build up bacteria!",
      "rating": 5.0,
      "verified": true,
      "author": "Adriana",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Why did I wait so long?",
      "text": "I've been wanting to get an ice roller for awhile. And I finally made the purchase and I'm so happy with it. I loved it so much I bought my Mother one. I have really bad allergies and the coldness feels so good on my sinuses. It also helps with puffy eyes. I use it in the morning while I'm having my coffee and I use it at night before bed. I'm obsessed!",
      "rating": 5.0,
      "verified": true,
      "author": "BritePopple",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "AMAZING!",
      "text": "If you are questioning ordering this don’t even think about it just do it! I love it so much I’m ordering another one. It stays cold for hours at a time after freezing it. I love to use mine all over my face because I suffer swelling from an auto immune issue. I don’t know how I’ve even lived without this it works so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica D Reeves",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Great for puffy eyes from allergies and to close pores after a facial",
      "text": "I bought this for a facial roller to help with \"aging\", but recently my son's eyes have been super puffy from his allergies. Helps so much with the puffiness. I use it to close my pores after a home facial works great. I keep the roller in the freezer so that it is always ready for when i need it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Use for headache relief and morning/nighttime routine!",
      "text": "I have been popping this in the freezer and using it in the mornings and as a part of my bedtime routine. I put my oil blends on my face and then use this and it makes my skin feel so good! It feels very chilled and refreshed for a while afterwards too. It is so calming and relaxing and my skin has already shown improvement in redness and puffiness. I also used it around my cheekbones, forehead, chin and back of my neck when I had a headache and it provided some relief. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Cait ",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Really nice for summer!",
      "text": "So it is really easy to just pop off the ice roller, put it in the freezer, and re-attach to the handles. So far I haven't had any issues with re-attaching after cooling the ice roller. One thing to know though is that the ice roller can accidentally pop out if you apply too much pressure on it - but again no issues with putting it back in. This has really been so convenient for the summer heat and unexpected humidity of the year. I enjoy using it and so does my mom. I can't really say anything else about it regarding skincare absorption mostly because the main purpose for me is to have something cool for my face.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Any skin irritation, this is a MUST !",
      "text": "I have had this for a while and used it here and there then forgot about it. Well, let me tell you, I have Eczema and my face and neck broke out and by chance saw this in my freezer and used it and after the first roll it soothed my skin on contact. It is a must for any skin irritation or sunburn. I now use this 3 times a day and put my lotion on and have NOT had a flare up in months. I would highly recommend this product!!! Hands down",
      "rating": 5.0,
      "verified": true,
      "author": "leighann",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Must Buy!!!! Perfect for face and body.",
      "text": "This is the best thing ever to help with your morning routine after washing your face and also helps if you are a little sore and want to relive the pain. This also helps if you have a little burn from cooking or if you have nerve pain. Will buy another to keep one in the freezer and 1 in refrigerator. I was able to get mine for less then $15, a lot cheaper than other rollers I’ve seen. So I’ll be buying another ASAP",
      "rating": 5.0,
      "verified": true,
      "author": "Diamond Nicole Carroll",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Brrrrr -",
      "text": "Obviously, it really cold, and I haven't had a sinus headache since ordering it, but I did use it on my arms after having them waxed, and it was very effective and taming the itching and the sting. I ordered three, so I'll use the other two as stocking stuffers. I may order a few more just for some gals I work with as the price is so reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "Staats",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Amazing for sinus/allergy sufferers.",
      "text": "Maybe my best purchase to date during quarantine!! I have terrible sinus and allergy issues! This roller is amazing! It helps open my sinuses and relieves headaches and ease tension. Highly recommend! Fast shipping, great price! After I use it I put in a baggie and toss in the freezer! I use it at least twice a day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Inexpensive and so relaxing!",
      "text": "I love it, it came in the mail fast. The reason I bought this is because sometimes I get hives, rashes, (caused my my BF beard or cat dander) or when washing my face with textured cleansers. I hate itching the hives and rashes and hate the way my face can get irritated easily, so I bought this. I've used it last night and this morning my face feels great. My eyes especially feel better than usual this morning, less puffy and sleepy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Helps with my dry winter yesss",
      "text": "The best for my eyes. I’ve been waking up with dry winter eyes. Even with a humidifier I wake up with eyes sting . I have a hard time producing tears in the morning . Whenever my eyes feel this way, I wash my face, use eye drops, and then roll this over my eyelids a few times. It gets my tears going and in a few minutes the dry red eyes are gone. It’s the best purchase I’ve made all year.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick S.",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Feels good on the face",
      "text": "I bought this tool specifically to use on my face, under eyes, in the morning or before bed. I love it. It lives in my freezer and I just take it out when I’m feeling puffy or after a work out to cool down. Now I’m looking for a smaller version. Was shipped quickly. Very happy with this neat little tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Asja Steeves",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Cannot live without",
      "text": "I don't know how I have gone so long without having this in my life!! I use my ice roller a minimum of 5x per week! Easy to use, easy to clean and stays frozen for a long period of time! I have even purchased a few as gifts for friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "One piece, not two, but very worth it!",
      "text": "The only downside was that the roller doesn't seperate from the handle, though I was under the impression it did. This can be a plus because you don't have to worry about misplacing the handle somewhere, but it's a minus because then the handle is freezing cold when you pull it out. That being said, the product works well, and my toddler steals it from me constantly. It's very comfortable despite being so darn cold!",
      "rating": 4.0,
      "verified": true,
      "author": "Elyse Claassen",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "This WORKS!!",
      "text": "I bought it because I got a little sunburn on my face and OMG it WORKED!! No drippy mess like torying to use ice cubes, easy to use, very soothing.. I use it in the morning on my puffy eyes and in the evening after I do my light therapy on my face. Don't waste your $$ on more expensive ones, this does what it says and is worth every penny!!!",
      "rating": 5.0,
      "verified": true,
      "author": "H. Haffner",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "THIS thing is AMAZing",
      "text": "as a chronically ill person with heat sensitivity and body regulation temperatures this is AMAZING, i can run it down my arms, chest, and the back of my neck to cool off. Going to get a second one Just for my face, since I can't find replacement heads. The handle itself feels a little cheap, sharp edges and a little awkward to hold, but it's so good at what it does, that I don't mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Excellent product for pain relief. Excellent gift idea.",
      "text": "The Ice Roller is everything it claims to be. I get a lot of tension headaches and neck/upper body aches. This product helps alleviate some of the stress and helps the muscles relax. It also helps \"wake my face up\" in the morning when I'm tired. I would definitely recommend it for anyone, and it makes a great gift or stocking stuffer.",
      "rating": 5.0,
      "verified": true,
      "author": "ChinoiserieLove",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Practical",
      "text": "Great for headaches, though a bit too aggressive for general facial use. It gets too cold and can cause kind of a frost bite if applied too strongly. Didn’t give 5 stars because my little ice pack leaks since the first day so it gets kinda sticky. Either way serves its purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Fabulous for irritated skin!",
      "text": "I get laser work done every 8 weeks or so, and the technician uses one of these rollers to soothe the lasered skin. When I saw this, I thought this was an inexpensive tool to keep on hand for puffy eyes, sunburn, and any other type of irritated skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan L. Hughes",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Buy it already",
      "text": "I wasn’t sure I bought into the point of these tools. But... I decided to try it and give it a shot. Day two... and I love it. I rarely write reviews, but thought given my initial reluctance and now my quick to change point of view warranted a review. Buy it. It’s great. I love how large the roller is and it feels wonderful. Very soothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam lander",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Decent ice roller for price.",
      "text": "The plastic smells a little funny, and it definitely feels cheap, but it was okay after washing with soap and water. It works fairly well as an ice roller -- I don't think you need anything fancy for this purpose. I like that the handle is detachable, so I don't have to keep the whole thing in the freezer.",
      "rating": 4.0,
      "verified": true,
      "author": "Lucinda Black",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "LOVE this ice roller!",
      "text": "I never knew I needed an ice roller until I heard about it on the Bobby Bones Show from Amy Brown. It feels SO good on your face in the morning or the evening. It reduces puffiness and takes away my headache after a long day. I had serious doubts before trying, but I’m so thankful I bought this product. It’s cheap in price, but the quality is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlin Bare",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Ice Ice Baby",
      "text": "The product is easy to handle and the frozen gelatinous beads in it keep it cold for a long period of time. As someone who has really puffy eyes and big pores it helps significantly reduce any puffiness and the size of my pores, and I like to use it after I apply product because it keeps any moisturizing products in my skin longer. The only issue is the roller part is kind of big which make it difficult to use around the eye and nose area.",
      "rating": 4.0,
      "verified": true,
      "author": "Madi",
      "helpful_votes": 0,
      "publication_date": 20200210
    }
  ],
  "product_meta": {
    "title": "ESARORA Ice Roller for Face & Eye, Puffiness, Migraine, Pain Relief and Minor Injury, Skin Care Products",
    "rating": 4.6,
    "feature_bullets": [
      "After getting up, massage before makeup to eliminate facial dropsy",
      "Massage during mask caring to shrink pores and calm skin",
      "Prevent wrinkles and improve dry skin",
      "Massage eye socket and temples to relieve fatigue",
      "Calm skin and reduce burns of skin after sun exposure.Alleviate neck and facial redness and fever for menopausal females."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.7 x 3.6 x 2.4 inches; 4.8 Ounces",
      "Item model number": "A2",
      "UPC": "759218240011",
      "Manufacturer": "ESARORA",
      "ASIN": "B01E8IZ4ZA",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Rollers & Pens",
      "Eyes",
      "Beauty & Personal Care"
    ],
    "price": 21.99
  }
}