{
  "website_summaries": [
    {
      "verdict": "An organic broad spectrum sunscreen that’s won a ton of awards.",
      "pros": [
        "An all-year round sunscreen that’s particularly good for summer and winter sports",
        "Contains antioxidants, phyto-protector plankton extract and organic oils as anti-ageing agents and to help weather-beaten skin",
        "It absorbs quickly and is non-greasy",
        "3 varieties: unscented, cucumber or green tea fragrance",
        "Wears well under makeup"
      ],
      "cons": [
        "Some customers found that it dried out their skin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Sunblock...Even for Very Sensitive Skin",
      "text": "Love the light feel to this product. Feels very soothing to my sensitive skin. Will use it skiing this winter. I live at a very high altitude and need sunblock on my face year round. Very happy to have found this one.",
      "rating": 5.0,
      "verified": true,
      "author": "justice",
      "helpful_votes": 10,
      "publication_date": 20161220
    },
    {
      "title": "Not so great",
      "text": "I liked the way it smelled, and how it went on. Unfortunately, I looked greasy all day and broke out. I heard so many good things about Coola. I could not wait to love it, but was disappointed. There are so many better sunscreens.",
      "rating": 2.0,
      "verified": true,
      "author": "From Long Island",
      "helpful_votes": 8,
      "publication_date": 20180519
    },
    {
      "title": "Nice moisturizer but less effective sun protection than the Coola mineral sunscreen",
      "text": "This smells great, is super lightweight and easy to apply. Unfortunately I didn’t experience the same level of sun protection from it that I’ve gotten from Coola’s mineral sunscreens, even at a lower SPF. I’d recommend their mineral sunscreens over the “classic” ones if you’re planning on spending a lot of time outdoors.",
      "rating": 3.0,
      "verified": true,
      "author": "Lady La",
      "helpful_votes": 3,
      "publication_date": 20190704
    },
    {
      "title": "Best Sunscreen I've ever encountered",
      "text": "Loved this product. I live in a little beach town in Southern California and spend my weekends in the sun. I am an avid runner and hiker, and some days I am out for 8 hours. Coola goes on unlike any other sunblock I'm accustomed to; it is moisturizing and does not leave streaks. It allows your skin to breathe so you do not get extra hot when engaged in high intensity activities, running, hiking up hill. You will need to reapply approximately every 2 hours, but you will not burn and your skin will still be hydrated at the end of a long day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanthi",
      "helpful_votes": 17,
      "publication_date": 20160612
    },
    {
      "title": "I love the smell of this product and it goes on ...",
      "text": "I love the smell of this product and it goes on like silk. It makes your skin so soft but unfortunately I don't get a lot of protection from it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheri Maki",
      "helpful_votes": 7,
      "publication_date": 20170330
    },
    {
      "title": "Best sunscreen ever!",
      "text": "This sunscreen is very moisturizing. I wear it daily and do not need a moisturizer other than this. No odor. SPF 50 keeps the sun at bay all day. In direct sunlight, I reapply every 3 hours or so. My skin is protected! Been using this brand for over a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandi Packard",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "By far the best sport sunscreen for face",
      "text": "The good news is, this is BY FAR the best sport sunscreen for your face. It won't run in your eyes, it smells nice, it fully rubs in without leaving a white residue, and it's healthy. The bad news is, it's unbelievably expensive for how little you get in the tiny bottle. The bottle should be 5 times larger for this price point. If money is not a concern, GO WITH THIS. It's the best out there for sports!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Bateman",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Best sunscreen ever",
      "text": "My husband is very fair skinned. This sunscreen does an all day great job when we take our boat out for the day. It does not run and burn your eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathie Lindsay",
      "helpful_votes": 5,
      "publication_date": 20170510
    },
    {
      "title": "Favorite Adult/Young Child Sunblock! 👎🏼 For My Preteen",
      "text": "My 8 year old daughter & I love this sunblock! It applies like a high end moisturizer, clear & smooth. It moisturizes my 45 year old skin just enough. And it never runs into your eyes. My 12 year old son can’t wear it because it makes his normally clear pre-teen skin break out in teeny tiny blemishes. My skin is super sensitive so I am surprised that he has a problem & I don’t.",
      "rating": 5.0,
      "verified": true,
      "author": "Math Girl",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Pretty good",
      "text": "I have sensitive and oily skin. This product does the job very well...and it is great for on the go. However, the product is very runny, and it gives your skin an oily appearance, especially if you use too much. However maybe this will be a good product for you if you have dry skin?? My skin is already super oily so maybe that's why I didn't appreciate it as much.",
      "rating": 4.0,
      "verified": true,
      "author": "nanax8bm",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Good protection and feels great!",
      "text": "Love this brand for their ingredients and the way it feels on my skin. I tend to hand combination skin but more on the dry side. This does not make me feel oily in the T zone and it keeps my skin feeling soft all day.",
      "rating": 5.0,
      "verified": true,
      "author": "LiPa NYC",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Overpriced facial sunscreen",
      "text": "Bought this for my trip to Maui. Looking for a sunscreen for my face and moisturizer as well. I was hoping to like this product. Unfortunately I got sunburned on the nose and forehead. For the price of this product I was hoping this would work.",
      "rating": 2.0,
      "verified": true,
      "author": "BRIAN",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Perfect face spf to apply under makeup",
      "text": "Perfect face spf to apply under makeup. It is syrum in texture and soaks in without greasiness. I have dry skin and use this followed by a moisturizer prior to applying makeup. No sunburn",
      "rating": 5.0,
      "verified": true,
      "author": "Muffin",
      "helpful_votes": 4,
      "publication_date": 20160901
    },
    {
      "title": "Love the ingredients!",
      "text": "Natural (as possible) sun protection is VERY important to me and for my daughters. I am a stickler for sunscreen every day and my middle daughter has inherited my same tendencies! We have very fair skin but did not burn with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Rhodes",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Safe and effective sunscreen",
      "text": "I've been using COOLA for a few years now and it is the best safe sunscreen I have found. It absorbs into skin quickly and is very comfortable. No chalky whiteness, just a nice moisturizing effect,",
      "rating": 5.0,
      "verified": true,
      "author": "Neena Burkhardt",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Not bad but not great",
      "text": "This product was just ok. Definitely not worth the price. It made my skin break out unfortunately and I will not purchase again. I felt like it made my skin feel kind of slimy and didn't like that either. I'm sure it works for some skin types but i do not believe it suits all skin types.",
      "rating": 2.0,
      "verified": true,
      "author": "vee",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "My favorite green sunscreen",
      "text": "My favorite green sunscreen. Does not leave a white film like most sunscreen and easily absorbed. I always purchased from the store and glad to find it in Amazon and the quality is the same.",
      "rating": 5.0,
      "verified": true,
      "author": "J & J",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "I will only use this for my face",
      "text": "I've been using this product for a few years, and this is the only facial sunscreen I will use now. Totally not greasy, very lightweight, the sunscreen works and it smells great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary S",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Nice texture, good SPF protection",
      "text": "Love this! The scent might be too noticeable for some but it smells like summer and goes on easily/smoothly with good protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Mlars",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Clean Ingredients and Works Awesome",
      "text": "Super easy to apply and does not leave too much of a white trace. I have worn this in Arizona all day outdoors and have not burned. And super clean ingredient list.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Smith",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Best sunscreen for your face!",
      "text": "We have tried many sunscreens because we live in the south and both have a family history of skin cancer. This is the best ever. Feels like you are using a high end moisturizer and works like a true sun block. No sticky or greasy feeling and, best of all, if you sweat or go swimming and it gets in you eyes, there is no stinging.",
      "rating": 5.0,
      "verified": true,
      "author": "SH03",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "I had high hopes but wondering now if I received a dupe",
      "text": "Product beaded up and rubbed off after drying. Smells nice but I can’t even wear it because it flakes off and that’s especially problematic when I’m using it on my face, under my makeup.",
      "rating": 3.0,
      "verified": true,
      "author": "Zero fakes given",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "My fave sunscreen.",
      "text": "Favorite face sunscreen. Live in Florida - always use sunscreen - scent so. Ice - doesn’t leave face greasy or cause breakouts.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "great sunblock",
      "text": "I use on face, especially when out in direct sunlight. It does not run into eyes if perspiring. It feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "AnnieA",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Great face moisturizer with SPF",
      "text": "I have been using Coola spf face moisturizer for a while now since I got it in a fabfitfun box. It's great in the summer and the winter and it's just enough SPF protection. Works great under bare minerals makeup. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Genevieve",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Great Sun Protection",
      "text": "This sunscreen works really well, is light, and smells delightful.",
      "rating": 5.0,
      "verified": true,
      "author": "James Magnusson",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Good but could have more SPF",
      "text": "Good product, it almost disappears in my skin but I wish I could try more SPF... I live in Texas and 50 is nothing with all the sun and 100 degrees out there",
      "rating": 4.0,
      "verified": true,
      "author": "Gerardo",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "I love it for my face and I buy the body ...",
      "text": "I have been purchasing this product the last two summers. I was in the sun all day gardening yesterday and I just got a hint of sum. I love it for my face and I buy the body sun are also.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Green",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Great product",
      "text": "This product is thin, so feels light on the skin and goes a long way. There is no strong scent and is perfect for daily sun protection. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Lane",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Love the smooth application and White Tea scent",
      "text": "I just had IPL aka phootofacial and being super diligent about sunscreen. I live in Southern California so staying out of the sun is not the easiest achievement. I've had trouble finding sunscreen that doesn't leave dry clumps on my skin or dries out my skin. Coola is lightweight, moisturizing and goes on smooth. I love the White Tea scent which isn't overwhelming. It's pricey for just 1.7oz, but well worth it to maintain the wonderful IPL results.",
      "rating": 5.0,
      "verified": true,
      "author": "U. Kim",
      "helpful_votes": 6,
      "publication_date": 20170303
    },
    {
      "title": "Excellent facial sunscreen and moisturizer",
      "text": "Gives you a great glow. Top of the line. Works well, ultra moisturizing, luxury product. I am a huge fan!",
      "rating": 5.0,
      "verified": true,
      "author": "MEM",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Cool",
      "text": "I have used this sunblock before but the lower spf. Decided to try the spf 50 and it feels as weightless as the spf 30. You can never go wrong with coola. Cruelty free product !",
      "rating": 5.0,
      "verified": true,
      "author": "Alina King",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Very happy with this sunscreen!",
      "text": "Feels light going on, protects very well, and does not burn eyes. All day ballgames with no problems whatsoever. Does not feel sticky or heavy and smells nice- not that sunscreen smell. My son is sensitive to everything and wears this just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Flakes off",
      "text": "I didn’t find this item to be worth the expense at all. The smell still has a chemical scent to it. It applies like a thin lotion but starts to flake off quickly leaving white flakes on my skin and clothing.",
      "rating": 1.0,
      "verified": true,
      "author": "PB",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Sunscreen and Not Oily",
      "text": "I like this brand because it is organic and has a slight scent, not overpowering.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey HO",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "The best!",
      "text": "Hands down the best face sunscreen around. I am sporty, play tennis and it gets in my eyes with no burn at all! Stays on and protects my skin for hours. Non greasy at all.",
      "rating": 5.0,
      "verified": true,
      "author": "surfermoo",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "If only it was cheaper...",
      "text": "Light scent, light texture, it doesn't leave a sticky residue and it is overall a great sunscreen. If only it wasn't so expensive!",
      "rating": 4.0,
      "verified": true,
      "author": "Galia",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "I like the lightweight feel of this product",
      "text": "I like the lightweight feel of this product, not too greasy, but I wasn't a huge fan of the smell.",
      "rating": 3.0,
      "verified": true,
      "author": "Ren",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Fast shipping, great products",
      "text": "The seller shipped fast with no issues. Would highly recommend. The product is great and love the smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Lazarus",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Perfect for a non zinc sunscreen.",
      "text": "I liked that it didn’t make my face greasy/sweaty. I have a zinc allergy. Worked well!",
      "rating": 5.0,
      "verified": true,
      "author": "rachel",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Arrived expired.",
      "text": "I love the product...BUT mine arrived from Top Shelf Brands with an expiration date of last month. No good.",
      "rating": 1.0,
      "verified": true,
      "author": "victoria s.",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Perfect for Summer",
      "text": "I really like the Coola organic White Tea sunscreen for the face. It's effective, light, not oily at all, and leaves no white residue. Perfect for warm summer weather!",
      "rating": 5.0,
      "verified": true,
      "author": "Martine",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "YASS! FAVORITE!",
      "text": "Favorite sunscreen in the world! So light and refreshing! Definitely worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Coola is my favorite sunscreen!",
      "text": "Love Coola sunscreen--this has a silky feel, not sticky or pasty. Scent is a little funky to me (I usually use unscented products), but it's mild--I wish they made an unscented Coola face sunscreen with SPF50 (unscented non-sport version is SPF30, which is fantastic for daily use).",
      "rating": 5.0,
      "verified": true,
      "author": "twmmmom",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Great moisturizing protector",
      "text": "I love this face sunscreen, it moisturizes while providing protection from the sun. I need the moisturizer component, it feels good & brightens up my whole face!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia cigetich",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Wonderful light product but a bit too shiny",
      "text": "Only thing I would say that it is shiny on my face. Wish it was more matte than glossy.",
      "rating": 4.0,
      "verified": true,
      "author": "SG",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Perfect for everyday sunscreen use",
      "text": "Love coola products and this face screen does not disappoint. The scent is subtle, which I like. I use this almost everyday, definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great sunscreen",
      "text": "I liked the fact that it actually works and is easy to use. It is a little greasy at first but soaks in and keeps your skin moist and protected all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie WICKLAND",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "theres some that replace it, same brand, but really love this one.",
      "text": "Been ussing it for more ethan a year, recomendad to all my friends, had a hard time reordoring this product, but if its avaliable sooner i would really appreciated. Thank You.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "My new favorite!",
      "text": "Lightweight, doesn’t leave any residue and not greasy at all. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "A Davis",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Great sunscreen",
      "text": "Love the product and easy online ordering with free shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "John Watson",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Great lotion type sunscreen !!",
      "text": "Husband is a golfer and he really likes the product, the way it goes on, the feel of it, and the coverage.",
      "rating": 5.0,
      "verified": true,
      "author": "D.  Condello",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Love it!",
      "text": "Wonderful product! Works well, smells great, and best of all, is CRUELTY-FREE!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "smells amazing, protects well - melsema prone skin & it ...",
      "text": "Absorbs quickly, smells amazing, protects well - melsema prone skin & it keeps my face safe. Also helps combat redness - definitely recommend 👌",
      "rating": 5.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Love it",
      "text": "Repeat purchase. Been using it for more than 3 years",
      "rating": 5.0,
      "verified": true,
      "author": "A customer",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "This is the best product out their in my opinion my skin loves it",
      "text": "This is the only sunscreen that I use for my face love it I give it a 5 star",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Feel like not wearing sunscreen!",
      "text": "Great product, Light weight and smell pleasant also not oily. I gave 4 stars because the Price is high.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Perfect coverage",
      "text": "Organic and smells and feels wonderful but most importantly perfect coverage from the sun",
      "rating": 5.0,
      "verified": true,
      "author": "Gina Marku",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "No Irritation or Breakouts",
      "text": "I have sensitive skin and have searched for a face sunscreen for a few years that doesn't cause irritation (in fact, I previously tried a different COOLA face sunscreen that didn't work for me). This product worked great. It didn't irritate my skin or cause breakouts. Instead of applying it after moisturizer, I sometimes use it as my moisturizer if I'm going to be out in the sun.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ Cole",
      "helpful_votes": 2,
      "publication_date": 20170828
    },
    {
      "title": "Five Stars",
      "text": "Simply the best product - so light you don't even know it is on!",
      "rating": 5.0,
      "verified": true,
      "author": "LRSK",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Organic Sunscreen 50 SPF",
      "text": "Face sunscreen 50 SPF Sharing is caring found this amazing face organic white tea moisturizer sunscreen it goes on like silk feels amazing it feels creamy and jelly all at the same time superlightweight absolutely love this per packaging 70% certified organic radiance has amaranth seed extract and Chia seed that acts a skin firmer and it does make my skin feels firmer .... absolutely In love ... I’m a big sunscreen snob so super excited I found this ..",
      "rating": 5.0,
      "verified": true,
      "author": "Jeorgina Boulton",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Goes on thinly and non greasy however I experienced an ...",
      "text": "Goes on thinly and non greasy however I experienced an orange glow as I started to sweat while running",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Five Stars",
      "text": "Love this product! It gives me everyday sun protection as well providing a glow to my skin!",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Five Stars",
      "text": "Seems to be very effective with SPF 50 and safe ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Ranieri",
      "helpful_votes": 0,
      "publication_date": 20160817
    }
  ],
  "product_meta": {
    "title": "COOLA Sport Organic Face Sunscreen, Broad Spectrum SPF 50, Reef-Safe, White Tea, 1.7 Fl Oz",
    "description": "Designed for the sensitive skin of your face, this high performance, 80 minute water resistant formula is crafted with 70 percent plus certified organic ingredients and features an invigorating natural white tea scent. Infused with organic evening primrose and linseed oils, known to even skin tone and balance moisture, and safflower oleosomes, which provide lasting hydration, this sport face sunscreen keeps up with your active lifestyle.\n\nBRAND STORY\nCOOLA offers sun protection for a range of skin types and lifestyles; from the sensitive nature of FACE and LIPLUX, to the versatile BODY, and the demands of SPORT.",
    "rating": 4.7,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.5 x 1.5 x 5.5 inches; 0.01 Ounces",
      "Item model number": "I0037305",
      "UPC": "857770005779",
      "Manufacturer": "COOLA Suncare",
      "ASIN": "B01EPB7EIK",
      "Amazon Best Sellers Rank": "#159,051 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Sunscreens & Tanning Products",
      "Beauty & Personal Care",
      "Sunscreens",
      "Facial Sunscreens"
    ],
    "price": ""
  }
}