{
  "website_summaries": [
    {
      "verdict": "These 12 LED candles are perfect for setting the mood without having to worry about actual flames. Battery-operated, perfect for parties or events.",
      "pros": [
        "Realistic flickering appearance",
        "Warm white light offers a subtle glow",
        "Each candle has a simple on/off switch",
        "Same size as regular tea light candles, so they fit in votives and candle holders just fine",
        "Long-lasting",
        "Lights look very much like real candles, down to the \"melted\" edges"
      ],
      "cons": [
        "Batteries are tough to change"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Very popular brand of LED tea lights, realistic-looking with curved top and flickering, warm white light.",
      "pros": [
        "Very reasonable price for 12 tea lights per pack",
        "Convenient on/off switch",
        "Each tea light has battery with life of over 100 hours, and battery can be replaced",
        "Safe, flameless way to set a romantic or festive mood anywhere",
        "Tested for quality and guaranteed to work out of the box",
        "Full refund from manufacturer if not completely satisfied"
      ],
      "cons": [
        "Good product, especially for the price",
        "No real complaints"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "THE PERFECT COLOR!",
      "text": "I have been searching every where for the right color light that comes from a battery operated tealight votive. I thaught I found it ( pictured right side) until I found these. They look like real candle light. The perfect balance of warm white with a tiny yellow glow like the real thing. My picture shows this candle on the LEFT and the other warm white candle on the right. And you can not beat the price!",
      "rating": 5.0,
      "verified": true,
      "author": "april",
      "helpful_votes": 603,
      "publication_date": 20161114
    },
    {
      "title": "Finally!",
      "text": "Finally found faux candles that AREN'T orange. I understand flames are orange, but I don't know why every fake candle company makes the entire thing orange. Those never look realistic to me. These are perfect and white with an awesome flicker. I need these for my wedding since my venue doesn't allow real candles outside and I am so excited I bought these. I put them next to a competitors so you can see.",
      "rating": 5.0,
      "verified": true,
      "author": "K.T.",
      "helpful_votes": 167,
      "publication_date": 20170520
    },
    {
      "title": "Best LED tea lights!",
      "text": "I placed these LED lights in the Royal 6 pack lattice votives I also purchased through Amazon. Gave my dinning room table the gold glow I was looking for. You won't be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline",
      "helpful_votes": 104,
      "publication_date": 20161214
    },
    {
      "title": "Nice Tealights that are tall like votives",
      "text": "Great tealights that are tall like votive but work in tea light holders. Color is white on white flame.",
      "rating": 3.0,
      "verified": true,
      "author": "Cali Moki",
      "helpful_votes": 80,
      "publication_date": 20161113
    },
    {
      "title": "Perfect for the purpose!",
      "text": "Nice candles, really bright (see image) but soft at the same time. Happy with the purchase - ordered two more sets already. Update: the UPS guy saw one of them through the window and asked me if the candle was real and said that it looks amazing! I'll take a pic from outside and post it asap.",
      "rating": 5.0,
      "verified": true,
      "author": "Mirela",
      "helpful_votes": 74,
      "publication_date": 20170224
    },
    {
      "title": "Unreliable",
      "text": "When they work, they are pretty. But buyer beware. There is a good chance several of them won't work at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 68,
      "publication_date": 20161205
    },
    {
      "title": "Candle itself looks very fake!",
      "text": "The “flicker” effect and amount of glow is nice. However the candle itself is incredibly unrealistic. You can see the plastic seams and battery inside the candle from all angles. I really needed candles and hoped I could at least spin them to have a “good side” facing outward but that was impossible to find. The color while on is also more white than it photographs, which I was fine with. But the incredibly fake/plastic looking candle is not ok. I don’t understand how this candle has so many positive reviews!?",
      "rating": 1.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 20,
      "publication_date": 20191014
    },
    {
      "title": "Cold LED Bright White Color, not Warm White",
      "text": "Whatever people say here, in my experience, These work, but are Cold White LED light, NOT Warm White as described, and look unnatural. Save your money. Unless this is a \"bad batch\", warm white ain't happening here. ! But a great value if you don't care about the stark white color. The flicker and all, but color is stark.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad Barnburner",
      "helpful_votes": 26,
      "publication_date": 20181130
    },
    {
      "title": "Yikes-They Hurt to Look At",
      "text": "I could not take these. The LED bulb is clear and so white and harsh. They hurt my eyes! The flicker was not real and more of and on/off blink like a neon sign. Had to return and find another brand w/ a frosted bulb and amber/yellow glow. I ended up w/ Festival lights that are much less harsh and seem more real and do not hurt.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Page",
      "helpful_votes": 38,
      "publication_date": 20170324
    },
    {
      "title": "These are horrible!!!",
      "text": "March 16, 2019: These are the cheapest looking items I've ever had. They are electric candles - very tiny with a harsh neon like glow instead of a soft candle-like appearance; the 'flame' looks nothing like a flame. I am going to return them because they are not what I expected, not even close. Definitely not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "florin",
      "helpful_votes": 7,
      "publication_date": 20190316
    },
    {
      "title": "LOVELY!!",
      "text": "They light up very bright and make our home look so cozy & pretty! I cannot wait to decorate our fireplace with these and a garland. :) Yay! The only negative thing I could say about them is that they are a lil pricey and the battery life isn't so great. They started to dim after 10 hours of shining.",
      "rating": 4.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 8,
      "publication_date": 20181031
    },
    {
      "title": "Great buy",
      "text": "Really nice faux candle/tea lights. These are small but fit what I was looking for. Most pictures here show a yellow color when on but the are not that yellow more soft ivory, I absolutely love these and will be buying more for my wedding.",
      "rating": 5.0,
      "verified": true,
      "author": "ruby",
      "helpful_votes": 16,
      "publication_date": 20170210
    },
    {
      "title": "Not bad for the price.",
      "text": "I ordered a box of warm white. Some of them look a bit warmer than others. I turned them all on and found myself getting sleepy watching the flicker-- like real candles. They won't fool anyone unless you hide them in some other container, but they aren't bad for the price. The only thing I wasn't wild about was that they did not come with a paper tag over the battery which usually indicates the battery is brand new. Hopefully these will last a bit. One suggestion-- they could achieve an even warmer look if the plastic \"candle\" was ivory and not white.",
      "rating": 4.0,
      "verified": true,
      "author": "Amateur Critic",
      "helpful_votes": 4,
      "publication_date": 20171202
    },
    {
      "title": "Okay, but not very realistic",
      "text": "There are some LED candles which are almost hard to tell from real candles from a few feet away. This is not one of them. The intensity of the light varies a little, simulating a flickering flame, but it's too little and the \"flame\" doesn't vary, just the brightness. I bought these to help with my meditation practice, but I find myself just getting irritated when staring at the \"flame\". If you want some mood lighting, this should be okay, but if you want to be able to stare at the flame, find something better.",
      "rating": 4.0,
      "verified": true,
      "author": "Dee NTop Contributor: Amazon Echo",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Use Only at Halloween: Eerie Green Light! 🤢",
      "text": "These are just right in real candle brightness and flicker, yet only two stars because the color they emit is an eerie pale green rather than warmth, yet I will keep them because of price and just won't use them solo or in the foreground. 🤷🏼‍♂️",
      "rating": 1.0,
      "verified": true,
      "author": "HP USA  6'tall  165#  31\"waist",
      "helpful_votes": 6,
      "publication_date": 20181212
    },
    {
      "title": "Ordered for Holiday Votives- Will Keep Ordering",
      "text": "These little guys are great. I love candles, but if I have too many burning I tend to forget to blow them all out. These are great and have a pretty long shelf life for how tiny they are. I left them lit for about month continuously during the holidays because I kept forgetting to turn them off. While they weren't as bright as the first day, they stayed on and I've used them since for little accent decorations around the house. Love them! I'm ordering some more today.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika C",
      "helpful_votes": 2,
      "publication_date": 20190304
    },
    {
      "title": "Worked great.",
      "text": "These look fairly realistic if they are in a votive holder. Up close, it's obvious that they are flameless. Either way I really like them. My husband is constantly on me when I light votives in the house. He is worried about the fire hazard and I'm sure he's right but I just love the ambiance! So these little guys look great and are safe. The only thing I wish is that I had splurged a bit more and gotten the ones with a remote. If you have a number of them out it's a little bit of a hassle to go to each one and flip the switch on the bottom. Happy all in all tough. Good purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Suzy K.",
      "helpful_votes": 2,
      "publication_date": 20180225
    },
    {
      "title": "Perfect for what I bought them for",
      "text": "The reviews were mixed and I wasn't sure if I should order these but they've been great. They arrived in a box, none were broken, all worked. I wanted them for several different candle holders I have at home so I would not have to keep replacing the small little tea lights constantly. They work great, have a bit of a flicker to them like a real candle, and for the price you can't beat it. I purchased the replacement batteries as well but so far I haven't had to replace any batteries. Super happy with these and good quality for the price. I'd definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Chere M.",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Wish the “flame” would have a more pronounced flicker",
      "text": "I like this product - they are larger than typical tea lights and I like the design of the rim which makes them look more like real candles.. My only disappointment is that the “flame” is not wiggly like all of my LED pillar candles which makes them look more realistic than these. The “flame” on these is rigid and has only a faint flicker effect but I do like the fact that the light is a warm white (not yellow) and is pleasantly bright.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Mc",
      "helpful_votes": 2,
      "publication_date": 20191022
    },
    {
      "title": "Disappointing",
      "text": "These candles appeared to glow in the photo. I found them a stark, unpleasant white. I also, (wrongly) assumed that they had a \"moving\" flickering flame. I don't plan on using them.",
      "rating": 1.0,
      "verified": true,
      "author": "Ladyslipper",
      "helpful_votes": 8,
      "publication_date": 20170801
    },
    {
      "title": "Realistic Flickering Candle Sized Just Right!",
      "text": "These lights are great! Small, but honestly the perfect size, and pack a powerful punch. They’re about an inch in width and height. The brightness is exactly what a candle should be, and the flickering makes them look like real candles. They were used for my daughters beach wedding, so burned steady for 8 hours. They are now in the windows of my home burning 24/7 for the holidays. When they finally burn out I will replace the batteries. Every candle worked perfectly straight out of the box. I am very happy with my purchase! Price was reasonable too.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 2,
      "publication_date": 20191127
    },
    {
      "title": "These look so real because they flicker!",
      "text": "I bought these for an upcoming cruise as we can't use real candles and I like a little atmosphere in the cabin ;>) I've been testing them in our bedroom and they are great! They really look real because of the flickering. I can't comment, yet, on the battery life but will update if there's a problem, which can easily be resolved because you can replace the battery! I adore these! When we are in our cabin in September, I'll update with durability and battery life and a picture!",
      "rating": 5.0,
      "verified": true,
      "author": "Debi W.",
      "helpful_votes": 2,
      "publication_date": 20190216
    },
    {
      "title": "BEST Electric Candles",
      "text": "We have too many firefighter friends with horror stories and we cherish our home far too much to ever light a fire inside. I purchased these LED candles to go on a handsome wrought iron display inside our fireplace. Since we never use the thing for its intended purpose, LED candles are the next-best-thing! The display made for such a cozy living area during the holidays, even when it was 85 degrees Fahrenheit outside! LOL. I highly recommend these candles as they look very realistic. Many friends and family commented on their appeal. If you need small, long-lasting, realistic-looking, white electronic candles, then this is your go-to product!",
      "rating": 5.0,
      "verified": true,
      "author": "jj",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Worth every penny 🎉",
      "text": "They work as advertised. Turn them on once sat the time of day you desire them to come on each day. They remain lit for 6 hours and come back on again in 18 hours. They will sutomatically repeat the cycle unless you desire to change the 6 hour on 18 hour off. Instructions are easy to follow. They produce a white light glow. Very pleased with these candles. Go for it.😎👍🏻👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Kahuna @ 8746",
      "helpful_votes": 2,
      "publication_date": 20190627
    },
    {
      "title": "These little candles put out a wonderful, realistic light",
      "text": "These little candles put out a wonderful, realistic light. Shape looks so real too. Since they are hard plastic , and not wax, you can put them anywhere! I was very disappointed when i discovered that they were not internal timer controlled. I just know that is what i was ordering. I just re-ordered batteries but don't need them yet. Still bhrning after several days burning 24/7. Would reccomend buying.",
      "rating": 5.0,
      "verified": true,
      "author": "P. J. Galliher",
      "helpful_votes": 3,
      "publication_date": 20171226
    },
    {
      "title": "They really are tea light sized",
      "text": "From the picture I thought they were going to be a bit bigger than tea lights but they aren’t any wider. They are a bit taller and not perfectly circular on the top to give a more true candle look to them. They are brighter than the average battery tea light and they do flicker. They are a cool white not a warm white and the “flame” is white too, not yellow or orange. Will definitely use them for many decorative lighting needs when a real candle won’t work. Good purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "bethany2601",
      "helpful_votes": 2,
      "publication_date": 20190106
    },
    {
      "title": "Very nice light and VERY \"flame\" like",
      "text": "I'm only on my second candle,,, I'm using them one at a time, and they seem to last forever,, I bought the box of them months ago. The flame is an 'off white' and flutters just like a real flame, I have it in a clear glass candle holder and you really can't tell that it's not a real candle. It really is quite nice. Best of all, there is no smoke, no melting wax, easy turn on - turn off switch on the bottom. I use it for an hour or two most days,,, lasts several months before beginning to dim.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Not particularly realistic",
      "text": "Light is a pure white, not really a warm or yellowish color as the pictures indicate. Plastic bodies have internal ribs all the way up the sides in two areas that are readily visible when lit. Not particularly realistic. Plenty bright, though. Haven't had them long enough to comment on life of the battery or LED, but I'm basing my rating on the assumption that they'll be fine in these areas.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Definitly NOT warm white",
      "text": "I just received these tealights are are very excited to use. To my big surprise they are definitely NOT warm white. It's more to the bright white spectrum, around 4000K-4300K. I am so disappointed because a real candle won't flick this color. I lit a candle as a comparison. They are bright, but pale and COLD. If you are looking to create a warmth then this won't be a good choice. The description gives the false impression.",
      "rating": 2.0,
      "verified": true,
      "author": "Wei-nong Wang",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Worked out great for luminaries",
      "text": "We bought these candles to put in luminaries at a wedding reception. Since the bags were on the ground, we wanted something that wouldn't be a problem with little ones cavorting about. We turned these candles on at sunset, and they were still going strong at 3am (possibly longer). Nice warm glow and a gentle flicker. Would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamaloon",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Perfect little lights",
      "text": "I have these all over my house. I have purchased 2 boxes total and spare batteries. You can't beat the cost. I keep 3 on my table in my bedroom and they run 8 hours every day. I change out the batteries about every 2 weeks. But you can purchase 20 batteries for $6 so they are very cost efficient. I have bought the larger candles too but they required 3 AAA batteries and don't last that long. Now they are only for show since I can't afford them. These are well worth the price and use.",
      "rating": 5.0,
      "verified": true,
      "author": "K.R. Clayton",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Very relaxing!",
      "text": "I love these candles! I’m using them for 3 sconces I have in my room and they really add a nice ambiance. The flicker is very realistic and makes me feel so relaxed. The color they give off is a yellow white, not a bright white LED. So far the battery life has been good. I’ve put them on almost every night for the past week for 7+ hours at a time...I once forgot to turn them off before I went to work and they were on all day. I plan on using these for holidays as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "OK PURCHASE",
      "text": "The description of the product did not match the actual performance of the product. Lights were very, very bright and the flicker really didn't represent that of a candle. Seller was very receptive of my correspondence and very good about allowing me to return candles with no problem what so ever. Would buy from them if they had the actual flickering flameless candle and not just an imitation looking flame.",
      "rating": 2.0,
      "verified": true,
      "author": "PATRICIA J JOHNSON",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Excellent product! I used them for the entire month ...",
      "text": "Excellent product! I used them for the entire month of October, to illuminate my miniature Haunted Forest display. The perfect size for hiding in nooks and crannies, to cast appropriate shadows. I kept them on for 4 hours each night, and over the course of a month, not a single one burned out. A couple got somewhat dimmer, but that's to be expected. The white light is bright, but not blinding, and the flicker is good (and not annoyingly erratic). Extremely pleased - I bought 3 more boxes!",
      "rating": 5.0,
      "verified": true,
      "author": "Boris Karr",
      "helpful_votes": 3,
      "publication_date": 20170510
    },
    {
      "title": "Excellent tea lights",
      "text": "Wanted plastic tea lights for safety reasons. These look pretty realistic, are bright, were easy to turn on or off with a little switch on the bottom, and they all worked. I was very happy with them, and used them to form a heart on the beach or grass on our honeymoon. You can use just a few in the bedroom or bath to make your own mood lighting. Portable, safe, & cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumer",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Tasteful, nice glow, no timer function",
      "text": "I was impressed by all the positive reviews. Just know that they have a more \"normal\" flame glow than some previous ones I got on Amazon that glow a creepy Halloween orange. These small candles will fit in any tea light holder. The only thing you should consider is that these have no timer function. But they are very easy to click on and off. They are sturdy and seem well made. My quest for the perfect flameless tea lights goes on- I will keep them but wish they had the timer function.",
      "rating": 5.0,
      "verified": true,
      "author": "JanieO",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Not very Bright but very Warm and Relaxing",
      "text": "They are the cutest little tea lights, I love lighting candles and this is much safer. I light (2) scented candles and then place these all over my home in different whimsical holders and enjoy the relaxing light while I watch TV or sssshhh shop online LOL my photos show you them in two different candle holders, In a dark room to try and show you that if you are looking for a bright light these are not your product to buy. My last photo is during the day the middle is a real candle of course. They do not have timers or remote controls ENJOY & RELAX",
      "rating": 5.0,
      "verified": true,
      "author": "PJM7192",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "THEY DO WHAT THEY ARE SUPPOSED TO DO",
      "text": "These are great! Upon initially opening my package I was a little concerned because the packaging was so small. The candles are teeny tiny, but as I spread them around my bath tub and turned off my bathroom light, they emitted the perfect warm and comforting light, with a slight flicker to resemble an authentic fire. They are also designed well, and imitate a slightly melted candle, with the wick on the inside of the candle wall. I've only used them once, so I'm not sure about longevity of the product, but it definitely serves its purpose, and I look forward to many more uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie De Los Santos",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Nice formfactor and light, always on, no timer function",
      "text": "A lot of reviews give positive ratings and I agree with positive ratings on a) working out of the box b) correct form factor to replace conventional tea lights and c) pleasant light color and flicker affect. What we don’t like is it’s always on, no timer. We like LED candles that have a Rolling 24 hour 6 hour on time from initial turn on. Batteries last longer and no need to manually turn them off at night. 100hours batter life isn’t much if you don’t turn them off.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Long lasting battery life",
      "text": "I put 2 of these in a vintage bird cage and love the look. It’s hard to get to them where I have placed them so I’ve left them on. They’ve been on for two weeks and are still burning at the original brightness. I’m very pleased with these and will order more as I find more places to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "K Petty",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Great quality - flickers like real candle",
      "text": "The package comes with 12 tealight candles. They are slightly taller than a standard tea light but they have a pretty \"used candle\" look with an uneven rim across the top. The \"flame\" is stationary but has a flickering effect when on and a realistic glow color. Works great in my seasonal decorative candle holder. Overall I'd like it if it were a touch brighter to truly mimic a real candle but otherwise it is a great substitute. Note: There is no timer or remote control for the 12 pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Rach",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "I am happy to say I bought these the first day of ...",
      "text": "i waited to review these, as I bought them hoping the reviews were correct on the battery life. I am happy to say I bought these the first day of june, and they are still on their first battery as of today, oct 13th! So 3.5 months, and still going strong, not one issue with a single one.",
      "rating": 5.0,
      "verified": true,
      "author": "laura",
      "helpful_votes": 5,
      "publication_date": 20171013
    },
    {
      "title": "Flame is much whiter than real flame",
      "text": "There are a bright white. Next to a real candle, the flames are very different colors. They work great in a candle holder that totally hides the candle, but not in a clear glass one. Also, I misunderstood the description and thought \"flickering\" meant that the flame actually moved, like other realistic LED candles I've bought. They don't. They are stationary and the light flickers in them. But that was my mistake. I'm returning them because I love to have candles you can actually see, and I really want some with moving flames. Wondering if they make tealight versions of that?",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "I LOVE THESE!!!",
      "text": "I place 2 inside a glass candle holder from my husband's funeral last year, it has his picture, birth, and death date on the outside of it. I turn them on every night and it shines just like it did when I lit the candle without any safety issues. I also place a couple in front of my deceased mother's picture. I'm very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Excellent, worth every penny & more",
      "text": "I received these on Oct. 8th. Today is Oct 25. I put several of them in Jacko lanterns through-out my house the very same day I got them, have left them on 24/7 since. They are still going....18 days...amazing -- highly recommend....Cant wait to use them with Christmas decs!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janis R.",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Easy-Peasy",
      "text": "They just arrived and my office is lit up like a yoga retreat (^_^). All 12 candles work, the flickering their little hearts out; the flickering is just right -- not timed, just faint flickering. The only downside (does *not* affect my rating) is that you can see the switch and wires in silhouette; this is not a problem since many users will place the lights in a tea light cup/holder. The effect is very nice and sooooooothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Guy H. Power",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Most realistic battery candle",
      "text": "Our wedding venue won't allow for real candles so I have been on the search for a battery candle that didn't look plastic and cheesy. This is perfect. same diameter as a tea light, but about 3 times as tall. Seemed a little shorter than a votive, more like a votive that has been boring for a little while. It flickers like a real flame and gives off a nice yellowish glow not bright and fake like LED.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Impressive",
      "text": "I purchased these almost on a whim, and didnt even touch the box for 4 months. Why 4 months? Well, it turns out we lost power, and I curiously opened the box, and turned one on. Wow! I was impressed! These \"fake\" candles do a really good job. The light they give off is great for an emergency situation, and there is no fear of open flames or heat of any kind. I understand the batteries for these are not the cheapest to purchase, so I recommend getting a bulk of them just in case. I like the slight dancing the \"flame\" does just like an actual candle. From a distance there is no way to tell the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "HR",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Love these",
      "text": "I wanted to add some candles to my table runner for the holidays without burning down the house. These are great. The color is a bight white, which is what I wanted next the the faux snow. And the lights are bright also. They look pretty close to real candles. See picture of one on and one off. They all worked great right out of the box. I tossed away some others that I had for years that didn't look good at all. Wish these came in other sizes in the bright white color.",
      "rating": 5.0,
      "verified": true,
      "author": "KarenKB",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "These DO NOT FLICKER",
      "text": "Got these from this seller last year...THEN they flickered. Sadly, these years they DO NOT FLICKER. Seems like a minor point, but it changes the effect totally. There is another vendor whose tealights are flickering this year. Check recent reviews and see which ones flicker. Assuming that is an important point to you.",
      "rating": 2.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Satisfied",
      "text": "Firstly these are not tealight size; they are in between a votive and a tealight as far as size goes which is clearly obvious given the photos provided by the seller. Not sure why other reviewers were surprised by that. My only complaint is that they look better in a glass candle holder that’s tinted a warm color like gold. They look too stark white in anything clear or in cool tones like silver, blue or green. They don’t “flicker” but almost look like they are gently pulsating. The “flame” isn’t stark white in color but a subtle off white but again when it’s placed in a holder in the cool tones they look very fake. Overall I’m satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "S.E.",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Exactly right!",
      "text": "Absolutely what I wanted! They are NOT orangey like other battery-powered tea lights. And they’re flickery, but not too flickery. Perfect for my Moroccan lanterns! Update: I took that picture after the candle had been on for 5 days straight. Still bright and flickery!",
      "rating": 5.0,
      "verified": true,
      "author": "Dail ",
      "helpful_votes": 2,
      "publication_date": 20190218
    },
    {
      "title": "works great",
      "text": "description accurate. about duration of battery I can't give any information, since I just use them since yesterday. But so far I like them and would buy them again.",
      "rating": 4.0,
      "verified": true,
      "author": "Antje Morgenstern",
      "helpful_votes": 2,
      "publication_date": 20181205
    },
    {
      "title": "Not Candle Color Temperature",
      "text": "The color temperature is wrong. All real candles give off an orange color, but this gives off a more pure white color. This makes it not feel like a real candle. There are other led candles I've seen that get the color temp right. Also the flickering seems to be subtle. They do not deserve this many 5 star reviews, and they are shady because they must be getting fake reviews or bribing people to write 5 star reviews.",
      "rating": 2.0,
      "verified": true,
      "author": "L.C.",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Significant color variation in each box",
      "text": "I like the candles. They will be used in votive candle holders on my wedding reception tables. The candles look less fake than all the others. The toggle switch to turn the lights on operates easily. The disappointment I have with this product is that some candles have a very white light and others a very yellow/orange-ish glow, but most are in the middle with a soft glow. I turned on 72 of these little buggers. 4 of them outright didn’t work and 1 flickered on and off if I tapped it. Can’t keep these all given the variation. So I will return half of my order for and change up the plans for the table arrangements.",
      "rating": 3.0,
      "verified": true,
      "author": "Shamiere",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great for the price",
      "text": "I have a volunteer project where I need candles, but can't use real candles, so I searched out these. They fit into a small bag and don't turn on without hitting the little switch on the bottom. This is a plus! If you need tea lights for a project or event, these are a good find. I would not hesitate again to order these.",
      "rating": 4.0,
      "verified": true,
      "author": "AZN8TV",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "no remote control",
      "text": "I bought these for presents mainly, though I did keep a few for myself. All worked right out of the box and I think, they have a nice flicker. My sister was impressed! I haven't allowed them to just run to test out the timer so I cannot comment on this but the ones I have did npot come with a timer. Would I order these again, Yes, I would!",
      "rating": 5.0,
      "verified": true,
      "author": "William M. Doody",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Small but great!",
      "text": "Really tiny. Just letting everyone know. They are about an inch tall. But they’re pretty darn cute. They give off a warm white glow that flickers like a candle. Love the little details like the wax dripped on the side and uneven ridges. Great for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Felicia barroso",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "These last a long time and are very bright",
      "text": "I bought these awhile ago and when I got them I just left them on 24/7 in my bathroom to use as a night light. They are still going strong a month later and have dimmed somewhat but were extremely bright when I first turned them out. They do flicker, probably not as much as I like, but for the price they are a very good buy. I'm thinking about getting the larger ones because I like these so much.",
      "rating": 5.0,
      "verified": true,
      "author": "seeking_peace",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "These are the best!",
      "text": "I am a serious candleholic and these are the best flameless votive candles I have come across so far. They are bright like real candles, and from a distance look like real candles because of the shape of the \"flame\" and candle itself. I wish they made them with a timer and remote control. I use them as night lights at night. I have a bout 5 of them in glass candle cups around a room and they really light up the room. They would be perfect if the light was more orange toned instead of yellow. Then they would really look like a real candle flame.",
      "rating": 5.0,
      "verified": true,
      "author": "Americanbasschick",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Long lasting!",
      "text": "These lights seem almost immortal! I put them in my pumpkins the 3 week of October and without turning them off. They stayed on 24/7 and lasted until the beginning of December!! They didn't have the brightest glow but you could see them.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Davis",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Not nearly bright enough",
      "text": "These lights are a decent value with realistic color, and a nice, subtle flicker effect. But they aren’t bright at all. Not *nearly* bright enough to illuminate a pumpkin as pictured in the description. I’ve used a few of them around the house for various applications, and often, the light is so dim it’s easy to not even notice it’s there. Oh well, I guess I’ll just have to go back to setting things on fire.",
      "rating": 3.0,
      "verified": true,
      "author": "SeanE",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Didn't look good in gold mercury votives",
      "text": "Because they are LEDs, the candle was more white light then an orange light which made my gold mercury votive to turn a green color rather than gold. Ultimately will not work for my purposes, but they are great quality, very bright, and have a subtle flicker. *Photo: electric candle on the left, real candle on the right.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "SO COOL",
      "text": "I LOVE these candles. They look SO real when on and the remote function makes use sooooo much easier. Do not buy a set of LED candles without a remote--it's so convenient and makes me use them more because of the ease. The flickering candle is also what makes these look so real in comparison to one without. I will keep continuing to purchase these.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "2700k emitters, not 2200k.",
      "text": "These work fine, but their color is NOT that of a real candle. These use 2700k emitters, which have the same color temperature of standard household \"soft white\" bulbs. Real candle flames have the color of 2200k LED emitters, which for some reason are only easy to find in the \"vintage style\" LED filament bulbs. Whoever in China smartens up and realizes that 2700k doesn't look like flame, that 1800k is just plain yellow/amber, but 2200k is the sweet spot for simulating real flame ambience, will make a killing.",
      "rating": 3.0,
      "verified": true,
      "author": "Jim May",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "No Timer, No Remote, light is BRIGHT white",
      "text": "These candles look nice and they flicker, as advertised. When I purchased them, it also said that they had a remote and timer. They do not (it appears the ad has since been updated to reflect). I should have known, given the price, but I did not because it said it did. So I was disappointed. The light is whiter than I expected as well; I would have preferred a more warm, yellow tone. Oh well. However, they do work and flicker nicely. For the price, they are a good bargain.",
      "rating": 3.0,
      "verified": true,
      "author": "Zanne",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Exceeded my expectations",
      "text": "These are a great alternative to real tea lights. I use them in mercury glass votive holders, and everyone has commented on how I \"lit candles\" for their visit -- no, I just turned these votives on! I left them on overnight once, and expected them to be dead in the morning, but they were still going and I've used them several times since. The light hue looks authentic. I think they are quality and a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Sallie",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "No timer function.",
      "text": "I have had some of these candles for a couple of years and thought I would order some more. I thought I re-ordered off my old order. I was expecting that they would be the same product, but they are not. These candles do not have a timer function nor a remote control. I will be sending them back if I can.",
      "rating": 3.0,
      "verified": true,
      "author": "jbrown",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Works for what I got them for",
      "text": "I don’t think these have a timer and they didn’t come with a remote but I don’t think that was in the listing for them so I don’t know why it’s part of the review, they are a little smaller than most tealight candles. More narrow and taller. I got them for a Halloween decoration so it doesn’t really matter though. The packaging was nice anyway. They don’t flicker like a lot of battery operated candles though, it looks like it tries to flicker but doesn’t really",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "I'd like something \"warmer\".",
      "text": "The long title of this item says, \"in warm White\". That must be the plastic they're talking about, but neither the plastic, nor the light the candle puts out are warm. As you can see in the picture, it (on the left) is the coldest of the colors in light. The center is a tea light and the right is a \"flameless\" brand. Different cameras would show different colors, but side-by-side, you can see the difference.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Heintz",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great for setting the mood battery life A++",
      "text": "Bought these for a romantic effect while on vacation! I wanted to set the mood in the hotel room but didn’t want to use real candles they were great and lasted the whole weekend! One night I left them on & outside while it was raining, in the morning they were still working. Its been two months and they’re still working with the same battery!",
      "rating": 5.0,
      "verified": true,
      "author": "leea",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Love this product!",
      "text": "I am so impressed. The tea lights look like the real deal with a believable wax candle base, even though the reality is plastic. They flicker just like a real flame. I love the fact that I can have candlelight all over my home without worry of a fire caused by a candle that has been forgotten. I am ordering more to enhance the atmosphere of soft glow to all the rooms in my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Incredibly real lights",
      "text": "Just put a few of these up on my mantle and I'm thoroughly impressed!! They look super realistic and give an incredible ambiance to the room. Definitely worth the money!! Plus if you forget about them it's totally safe because no actual flame! I will be buying these again",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah M.",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Perfect for pumpkins",
      "text": "Not sure why we are asked to rate timer and remote, as this product had neither. But. These are perfect for pumpkins which is what I wanted",
      "rating": 5.0,
      "verified": true,
      "author": "jill",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "TRUE DESCRIPTION",
      "text": "LITTLE CANDLES ARE IDEAL. USE IN HOLDER OR BY THEMSELVES. NOT BIG . TURN ON BY HIDDEN BASE SWITCH, THEN AFTER ''LIGHTING & WARM-UP''...IT FLICKERS REALISTICALLY. ORIGINALLY WANTED ONE FOR A VALUABLE, ANTIQUE SHIP'S MASTHEAD COPPER/BRASS OIL-LAMP FOR A MORE DYNAMIC DISPLAY, NOT STATIC. AMAZING REALISM BEHIND THE GLASS. GOOD CHOICE, NOW ENOUGH UNITS FOR OTHER DISPLAYS, TOO. COOL.",
      "rating": 5.0,
      "verified": true,
      "author": "Svenska",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "would not buy again",
      "text": "I gave this a 2, because they look nice and have a nice yellow glow. However, battery life is terrible. After 1 day, 2 died and slowly but surely the rest died. I opened the back up on one to change the battery. It is 2 very small batteries against each other and as it was a 12 pack, I was not about to buy 24 batteries.",
      "rating": 2.0,
      "verified": true,
      "author": "Joanna Jenkins",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "❤ these!",
      "text": "I love these little battery candles. I have two cats so therefore don't like using real candles and having an open flame. These little candles give me the light that I am looking for without the danger. It is a very pleasant clear white light and I have bought additional batteries and they change very easily.",
      "rating": 5.0,
      "verified": true,
      "author": "tara t episcopo",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "The perfect LED tea light",
      "text": "I love these! I didn’t receive a remote or a timer (maybe different product) but I’ve always been loyal to the classic candle until these. Love the size and flicker - perfect tea lights! (Update: I've now purchased another set and had several friends buy them as well. Really great quality and price point!)",
      "rating": 5.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "So far, impressed!",
      "text": "I just got these so the review is based on first impressions, but I was very impressed with these. They all worked right off the bat, very bright beautiful flicker, not dull and yellow like a lot them. I like that they are slightly taller than others on the market. Haven’t tested their last ability but out of the box, these are amazing!! And I have bought a lot of these type of candle lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn Femrite",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "would be better if it were ivory color",
      "text": "These have a very plastic looking surface that is stark white, would be better if it were ivory color...and does not look like real wax but it does light beautifullly at night when you are looking for that touch of sparkle. I say for the price they are a great deal. During the holidays these are perfect for table decor, house decor and even safe for Christmas trees and for windows as they are flameless.",
      "rating": 4.0,
      "verified": true,
      "author": "Akiko Ashley",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Great, Long Lasting Tea Lights",
      "text": "I bought to use with Christmas decorations and they lasted the entire holiday season (month of Dec) and are still going. Light is nice and soft. The product itself is well made and fits well in all my tea light decorations and home décor. Will definitely buy again when needed",
      "rating": 5.0,
      "verified": true,
      "author": "Sabe",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "SPICY SPICY SPICY",
      "text": "I CANT HAVE REAL CANDLES IN MY DORM. BUT I DONT TRUST MYSELF WITH FIRE ANYWAYS. BUT THESE BATTERY CANDLES??? THE BANE OF MY EXISTENCE. I LOVE BATTERY POWERED CANDLES. WITH MY LIFE. THESE COME WITH BATTERIES AND AHHHH THEYRE JUST REALLY GOOD. WOULD BUY AGAIN. THE LIGHTS FLICKER AND LOOK ALMOST REAL. LOVE EM. MY FRIEND EVEN BOUGHT THEM. THEYRE REAL NICE. GOT EM A COUPLE MONTHS AGO AND THEYRE STILL GOING STRONG. HAVENT REPLACED THEIR BATTERIES YET.",
      "rating": 5.0,
      "verified": true,
      "author": "Minwoo",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Worked well.",
      "text": "We used these for my daughter's wedding on the reception tables. We put them inside shiny gold votive candle holders and they looked cute. They are not too bright, so the paint on the candle holder kind of hid the light more than we wanted, but they would look great inside a clear votive holder. Good value and the batteries last.",
      "rating": 5.0,
      "verified": true,
      "author": "Brea",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Exceptional Value",
      "text": "For the low price of this item you get a box full of these little lights. Of course you can tell the difference between real tea lights and these but these last longer and don't present a fire hazard. These types of light usually go inside some type of decorative candle holder so they don't have to be perfect. The flickering light shines thru and creates a lovely ambiance. Very satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "CintiBonnie",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Really nice for a cheap buy.",
      "text": "Wasn't expecting much for the price but these will do just fine for my wedding decorations. I was expecting more flicker but its actually more realistic to an actual flame that would be indoors. i like them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon S.",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Tea light size",
      "text": "I used these in a classroom that had natural light coming in just to add “mood lighting” and the feel of being in a fancy restaurant to practice social skills. They are just little tea light size, so I didn’t expect them to be bright, but they are perfect for what I needed them for.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Great customer service",
      "text": "I was excited to get this beautiful tealights to put/use inside lanterns that I have, I ordered warm white but I received a white tealights I believe by mistake but I contacted the seller/customer service and he replied super fast and was very nice and fixed the issue for me for free . Great👍🏻 Thank you will definitely buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Kareem Elwakeel",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Just like real votives only better.  Long lasting.",
      "text": "I know this may seem like a little deal, but these faux candles are awesome! I am using them in a Christmas village scene on my mantle and they flicker and illuminate just like real votive candles, without setting my house on fire, which I truly appreciate. Sometimes it's the little things in life that are important, and these little gems fit the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Kooky Marigold",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Really pretty good!",
      "text": "Of course the “flame” color isn’t exactly like real fire but the effect is very good! Seem to last a long time and so much easier than using real tealights at a party that would burn out in less than an hour. I’d still use tealights with real candles if I’m just sitting with it for ambiance, but for a party or an event, I highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Pretty nice, needs more flicker",
      "text": "They create a very nice atmosphere and the light is every bit as soft and warm as real candles. However, the light intensity is inconsistent across the individual units and the flicker is almost too faint to notice. Over all: the price is right and the product is far more convenient and safe than traditional tea lights. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Wagner",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Good overall, not quite perfect",
      "text": "They are cute and work well. Being critical in order to help you all as much as possible, they have a crease where the plastic overlaps (you can see it in the picture). In a perfect world, the plastic would resemble wax a little more. It is matte finish. And the flames are a bit wide to appear entirely real.",
      "rating": 3.0,
      "verified": true,
      "author": "E. K. Hartensveld",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "More realistic flicker than most flameless tealights",
      "text": "Hard plastic casings, but the melted wax shape on the top, the larger size of the candles -- the height is taller than a standard tealight but shorter than an unburned votive -- and the bulbs, particularly the flicker effect, makes these more realistic and attractive than most of those we've tried. With regards to the size (diameter and height), it's perfect if you want to use napkin rings as a \"sleeves\" around them rather than setting them out \"as is\" or placing them in decorative votive or tealight holders. We purchased the older version without the timer or remote. Good price combined with Amazon's 1-day prime delivery makes these a winner.",
      "rating": 5.0,
      "verified": true,
      "author": "B&K Ford",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Last for long time",
      "text": "I purchased to put in my bathroom to add to the ambiscience. It adds just enough light when using the restroom at night and very appealing. I have been using one for the last three weeks and it burns like new. I use it every night for approximately 8 hours. They are long lasting.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Battery operated - No remote!!!!!",
      "text": "I thought these were really great - they're warm but the brightness just isn't there too much. And they do have the nice candle flickering effect it's just I'm worried they're gonna die soon and the batteries are the circular ones, which I have no idea where to find those. I'm just hoping the battery life is really good. I do wish they came with a remote control, which I didn't even know was a thing - I didn't get one.",
      "rating": 4.0,
      "verified": true,
      "author": "Caroline Khoury",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Beautiful and well-made",
      "text": "These worked perfectly to illuminate a jack-o'-lantern and also make a good substitute for night lights. They give a nice warm yellowish glow that is not too bright or too white. The subtle flickering of the light makes them look just like real candles. The battery lasts a long time too.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Bottom Plastic is Weak",
      "text": "Used these tee lights for some outdoor halloween decor. While they do flicker, it would be nice if the effect were a little more pronounced. The bottom closing tab pops off way too easilly. I was using some double sided tape to hold some of them in place and when pulling them for removal, every bottom plastic piece came off.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Work Great!",
      "text": "These candles stayed lit in our Halloween pumpkins for 2 weeks straight outdoors in wet/rainy/cold Washington state. The pumpkins even filled up with rain and rotten goop and the candles still stayed on, even when fully submerged. After I took them out of the water I wiped them down and dried them off. Turned them on a week later and they glowed like brand-new!",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline Judd",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Beautiful",
      "text": "Fantastic purchase! Just as described ! I'll prob find some tea light holders to enhance the beauty but it's just fine without it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "I did not remember ordering them",
      "text": "I did not remember ordering them but they refunded me. I tried two of them just to see how they worked but did not last more then a few days even running them for the evening. I know i could not afford to replace the batteries in them all the time would have been nice if they were rechargeable",
      "rating": 4.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Do not buy",
      "text": "I have been looking for a votive with a timer for a long time. Very very disappointed. The remote does not work for every candle even though it came with the candles. They do not last a very long time and replacing the battery is damn near impossible. VERY Expensive and most of the time you can’t get it to work. I love these things and I have bought a lot of them",
      "rating": 1.0,
      "verified": true,
      "author": "b ridget parker",
      "helpful_votes": 0,
      "publication_date": 20200323
    }
  ],
  "product_meta": {
    "title": "Homemory Realistic and Bright Flickering Bulb Battery Operated Flameless LED Tea Light for Seasonal & Festival Celebration, Pack of 12, Electric Fake Candle in Warm White and Wave Open",
    "rating": 4.6,
    "feature_bullets": [
      "COOL AND ROMANTIC: The flickering bulb flameless LED Tea Lights are ideal for decorations, It can be used as mood lights night lights with votive holders or other holders like glass cups. You can put the battery tealight on table or other places in restaurants, home and garden wedding, party, festival decorations.",
      "EASY TO USE: On/Off switch for easy & convenient operation. The electronic tea light comes with batteries which have 100+ hours of light-time and can be replaced easily via the tab at the bottom.",
      "SAFE For KIDS, PETS, SENIORS: These LED tea lights can be used without having to worry of flame, absolutely no fire hazards or burning risks, safe for families with pet(s) or young child(ren).",
      "HIGH QUALITY: Each LED tea light candle is thoroughly and rigorously tested, guaranteed to work out of the box, or each defective unit will be replaced with one dozen candles or a full refund for the purchase.",
      "FULL HOMEMORY WARRANTY: If You're Not Completely Satisfied with Your Purchase Simply Let us Know and You'll be Offered a FULL Refund or Replacement, No Questions Asked. Enjoy this Absolutely RISK-FREE Purchase Today by Clicking the Yellow 'ADD TO CART BUTTON\"' Above."
    ],
    "specifications": {
      "Product Dimensions": "1.3 x 1.3 x 1.4 inches",
      "Item Weight": "5.3 ounces",
      "Manufacturer": "Global Selection",
      "ASIN": "B01EDKGFGU",
      "Item model number": "HMCLTLPNB",
      "Batteries": "12 Lithium Metal batteries required.",
      "Customer Reviews": "4.6 out of 5 stars9,149 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#308 in Tools & Home Improvement",
      "Is Discontinued By Manufacturer": "No",
      "Item Diameter": "1.4 Inches",
      "Scent": "Unscented",
      "Number of Pieces": "12",
      "Warranty Description": "One-year risk-free and hassle-free manufacturer's warranty.",
      "Batteries Required": "Yes",
      "Included Components": "Batteries included",
      "Import Designation": "Imported"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Flameless Candles",
      "Home & Kitchen",
      "Novelty Lighting",
      "Tools & Home Improvement"
    ],
    "price": 9.59
  }
}