{
  "website_summaries": [
    {
      "verdict": "All-in-one pet grooming option, as these wipes are safe to use on the pet's coat, teeth, ears, and around the eyes.",
      "pros": [
        "Wipes have received approval for safety from multiple pet welfare organizations",
        "Uses a tub storage container that keeps the unused wipes moist",
        "Safe ingredients for both the owner and the animal"
      ],
      "cons": [
        "Some owners don't like recent changes to the thickness of the wipes and fragrance of this brand"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Different ingredients and very strong odor",
      "text": "This is the third time I’ve ordered these and something has drastically changed. I took one wipe out and the fragrance is extremely strong (smells like lemongrass). In the past, the other wipes have no odor. After I wiped my dog’s paws, she paced around the house for 10 minutes, so I think these are irritating to her.",
      "rating": 1.0,
      "verified": true,
      "author": "Hells Bells Stratton 8",
      "helpful_votes": 25,
      "publication_date": 20180327
    },
    {
      "title": "Changed scent...dog now hates the wipes",
      "text": "These wipes used to be great. They were thick, always moist, and most importantly had virtually no scent to them at all. With the new pop up tub, came an unpleasant and overpowering lemon cleaner smell that neither my dog or I can stand. I tried wiping his paws after a muddy play session and he backed away and practically gagged. Unfortunately, due to the new scent I will no longer be purchasing these wipes. Too bad because the quality otherwise is great.",
      "rating": 2.0,
      "verified": true,
      "author": "Megan K",
      "helpful_votes": 17,
      "publication_date": 20180404
    },
    {
      "title": "I don't know why, but my 6 month old ...",
      "text": "I don't know why, but my 6 month old puppy allows me to clean his face,paws and nether regions w/o protest when using these wipes. Previously, I was using the well known wipes for babies and adults and the pup fought me tooth and nail There is no detectable fragrance to these Sofies Secret Wipes , that I can detect and they do the job. I wish the wipes were larger and also held more moisture...I am hoping the last wipe in the box remains as the first, and we will see. Hoping they do not dry out as not packaged in a plastic holding box , but rather a treated cardboard.",
      "rating": 5.0,
      "verified": true,
      "author": "California traveler",
      "helpful_votes": 10,
      "publication_date": 20160710
    },
    {
      "title": "Makes pupper smell good",
      "text": "Love these for wiping down a dog who needs a bath. When our dog got old and incontinent he needed wiping down frequently but the bathtub routine was painful for him. These wipes got him clean and fresh smelling between baths. They're a bit difficult to remove from the package opening. I made the mistake of opening the second package before the first package was used up. Don't do that. Only one fits in the re-sealable container at a time, leaving the other to tend to dry out as you keep opening the seal. BTW, I bought a similar item at the pet store and it was more expensive with no container included.",
      "rating": 5.0,
      "verified": true,
      "author": "S'Kay",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "I love these wipes",
      "text": "I have a Morkie that is on a raw food diet due to her allergies. She has long hair under mouth, so she sometimes gets some of the raw liquids from the meat in her hair. I wanted to find a more convenient way to make sure her face was clean after she eats. I love these wipes. She lets me wipe her face and the hair under her mouth looks clean and fluffy. I'm a neat freak, so this has eased the concern I have over keeping her clean and not stressing her out.",
      "rating": 5.0,
      "verified": true,
      "author": "LMP",
      "helpful_votes": 10,
      "publication_date": 20160716
    },
    {
      "title": "Wonderful Pet Wipes",
      "text": "Love these wipes. My dog is an inside dog & breaks out, inside her hind legs, from going outside. I haven't found what she's allergic to & she doesn't have fleas. When I started using these wipes, the rash went away within 2 days & she stopped itching. The wipes are wet & smell so good. I warm them with water quickly, before I wipe her during winter months, leaving plenty of the solution to help her rash. I've read a couple reviews, saying the wipes came dry in the box. Adding warm water to the wipe would solve that problem No need to send them back because the solution will still be on the wipe, whether wet or dry.",
      "rating": 5.0,
      "verified": true,
      "author": "JaeElle",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Natural Wipes that Keep the Dogs Clean",
      "text": "So these were a little pricey, but I am willing to pay the premium for my fur babies. I use these wipes to wipe the dirt off paws and to clean up around their bum when it needs cleaning. I find the scent to be soft yet not overpowering. I like it actually. The product is vegan approved and includes natural ingredients. The wipes keep my girls clean and they smell great. The package is also good for keeping the wipes moist especially in the hot/dry Vegas summer months. I intend to buy more once I am out.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Dietrich",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Easy to use",
      "text": "I am a repeat customer and they are so easy to use, i have 3 cats and they are not the most patience critters to maintenance but these cloths work very well from head to paws and they sit with no fussing and let me get to cleaning and wiping them down, i use them most for ears cause your not putting pressure and you are getting them clean, me and my cats approve, give them a try i bet your pet will be pleased and comfortable with maintenance.",
      "rating": 5.0,
      "verified": true,
      "author": "dat",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "suddenly strong scent",
      "text": "I'm so disappointed. These were my favorite wipes, that I kept reordering. Unfortunately the formula must have changed, and the wipes have strong, lemongrass scent, which my dog hates (so do I). They're going back",
      "rating": 1.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 3,
      "publication_date": 20180329
    },
    {
      "title": "Smells Like Floor Cleaner",
      "text": "These are VERY VERY STRONG! Smells like floor cleaner or toilet cleaner. Better off buying the wipes from Petsmart or Walmart. They don't smell like industrial strength cleaner. Was very leery to use on my animals and one had a bad reaction to the smell as well. It's cool they sent refills but this product is unusable unfortunately.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Honest product⭐️⭐️⭐️⭐️⭐️",
      "text": "Very neat packaging. Thank you so much for my order. This is an excellent product. It’s been a week now since I ordered and absolutely no rash, no skin irritations, no but scooting or allergies on my little doggies tushy. She actually gives me the vibes that she loves to be clean every single time she goes to the bathroom. She instantly wonders off while wagging her tale like a puppy although she’s been past puppy stage. I will absolutely recommend these anyone. 👌",
      "rating": 5.0,
      "verified": true,
      "author": "OnlineShopperholic ",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "The moment I opened the wipes they smelled fine but a couple minutes after I wiped them the ...",
      "text": "I used these wipes for my two poms. The moment I opened the wipes they smelled fine but a couple minutes after I wiped them the smell changed into something very feminine which I hate. I'm glad that my dogs are not as dirty but the smell is a turn off for me. It's not pleasant. I'm not purchasing it again.",
      "rating": 2.0,
      "verified": true,
      "author": "Cagedjock",
      "helpful_votes": 4,
      "publication_date": 20180323
    },
    {
      "title": "These wipes are a great purchase!",
      "text": "What I love about the Sofies Secret XL Pet Wash Cloths is their natural ingredients, so they won't harm our dogs, and their versatility. I use these cloths to wipe my Chihuahua's eyes in the morning before our walk, her teeth, and all our four dogs' mouths and paws after our walk. My dog, Sophie, has sensitive skin and the ingredients in this wipe doesn't affect that at all. One very soft cloth, natural ingredients, no strong odor, so many uses. What's not to love about that? I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jody Miller-Young",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Soft But Heavyweight Moistened Wipes",
      "text": "Our rat terrier has an allergy when we are in Texas that causes him to lick and chew at his feet. I use a medicated shampoo once a week on his legs (more often when it gets worse) and he takes Apoquel daily to reduce itching. I had hoped these wipes would alleviate the redness, but haven't noticed a change after a couple weeks of use. I will continue to use these because they are a convenient size (8x8 inch) and heavyweight, moistened wipes. Nice to have right inside the front door where I can wipe dogs' feet as they come inside for dirt and mud.",
      "rating": 5.0,
      "verified": true,
      "author": "Maryboo",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Really great",
      "text": "These are really great for quick doggie clean ups. I have a puppy and she gets messy sometimes. The scent is really nice and my puppy actually likes them. She will stand still and let me use them on her. They say XL but I'm guessing they are considered XL based on the sizes of the other versions, but to me these are not XL. I would call this size L.",
      "rating": 5.0,
      "verified": true,
      "author": "Lana",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "great product, poorly packaged",
      "text": "A wonderful product hampered by terrible packaging. They’re folded in a manner that makes removing ONE wipe difficult, if not impossible. An easy fix, as this shouldn’t be a two-hand ordeal when you have muddy paws to clean🐾 Cheaper, easier to use alternatives available. Won’t purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "timekeeper",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Wipes only a puppy could love...  Well, ok we love them too",
      "text": "These are great wipes. Came packaged well. Chihuahua doesn't have any allergies to them. Wife wipes his teeth after he eats with them as he doesn't enjoy brushing much. Dunno why? He likes the affection and attention she gives him when wiping him down. She uses them on his coat and on his teeth. Packaging looks great. We don't mind these being on top of the puppy box. lol",
      "rating": 5.0,
      "verified": true,
      "author": "Darryl (yellowrabb)",
      "helpful_votes": 6,
      "publication_date": 20160718
    },
    {
      "title": "Do A Better Job Than Any Others I've Used!",
      "text": "I have 2 white dogs with beards! Everything sticks to their faces! I've used these wipes for several months now and find them far superior to any of the others I've tried. They are thicker, softer, smell better and the dogs don't mind my washing their faces with these. Very clothlike and can clean up any mess your dog brings home from muddy feet to food in the face! I highly recommend SoftiesSecret! They are environmentally conscious, another plus!",
      "rating": 5.0,
      "verified": true,
      "author": "MorganOBX",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Makes the fur super soft. Takes odors away",
      "text": "Pros: Makes the fur super soft. Takes odors away, doesn't leave a scent behind. Best thing I've found for cleaning the stiff \"foody\" fur around the muzzle. Can use these anywhere front to back and it's not irritating. Each sheet contains just the right amount of \"wetness\". Cons: There are none. Don't let the price fool you, you get a lot of cloth for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Nice size and works well.",
      "text": "I like these wipes. They are handy, moist, and large enough to do a good job cleaning up my sometimes messy pups. I especially like that they come in a refillable container that seals well. The only reason I didn't give 5 stars is that the scent is somewhat strong and \"little old lady-ish\". Too flowery for my taste. I would have liked a citrus scent -- orange, grapefruit, lemon. Or even melon/cucumber.",
      "rating": 4.0,
      "verified": true,
      "author": "JudithTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "I ordered these because my pup seems to have some ...",
      "text": "I ordered these because my pup seems to have some allergies to grass or what it's sprayed with and had constant infections on her paws from licking and chewing on them. We now wipe her paws off with these every time she comes back from a walk and they have cleared up her feet completely - no more red, irritated paws! We have tried all kinds of solutions and this is the first one that has worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 2,
      "publication_date": 20161108
    },
    {
      "title": "These are the best wipes on the market.",
      "text": "These are the best wipes on the market. I have a very allergy sensitive hound and she requires wipes several times a day. I've tried other brands that either don't do a thorough job of removing debris or cause her to have a skin reaction. I stumbled across these a few months ago and other brands cannot compare. The wipe itself is sturdy and have a texture on one side that helps with debris removal. The cleaning solution is appropriately proportioned and very gentle, unlike other brands that are dry on top of the stack. Love. Love. Love these.",
      "rating": 5.0,
      "verified": true,
      "author": "November",
      "helpful_votes": 2,
      "publication_date": 20171219
    },
    {
      "title": "Best pet wipes around",
      "text": "I rated lower on the presentation as I'm not a big fan of all the plastic used here but the product itself is really great. It works super well for our crowd of monsters and doesn't have an oddball smell like some other wipes do. They are well sized, too.",
      "rating": 5.0,
      "verified": true,
      "author": "KE",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great wipes! My pet loves them!",
      "text": "This is a wonderful product! My puppy Koda lets me wipe his face and paws with no fuss! He actually enjoys it! His trip to the groomer is in a couple weeks and these wipes have helped me to train him so that the groomer fusses around his face he will be used to it! I already ordered another set and will continue to use them on Koda!",
      "rating": 5.0,
      "verified": true,
      "author": "C Green",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Excellent Wipes!",
      "text": "These wipes are awesome! I like that they're organic, but I love that they're organic and actually work well! They are very durable wipes and they even have a textured side, which works well in their ears. Also, they have a very light, nice scent. I will definitely continue buying these wipes for my Great Danes!",
      "rating": 5.0,
      "verified": true,
      "author": "CzechNovots",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "good",
      "text": "is very good, my cat is very nervous, and can't take a bath,so this is perfect bath for him and smell delicious",
      "rating": 5.0,
      "verified": true,
      "author": "maria lopez",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "My dogs stand in line when they see me get the doggie wipes ot !!!",
      "text": "I use these wipes for my English Bulldogs and Terrier mix. They clean tear stains good, that is they clean the tear goop,not necessarily the stains themselves. More important is that one wipe will clean the wrinkles, eyes, toes, ears and rump. If the ears are very dirty, it may take 2 wipes. The cats don't claw and scratch when it is there turn.....",
      "rating": 5.0,
      "verified": true,
      "author": "Gayla Waller",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Dog loves it and so do I",
      "text": "Dog seems to like it. Doesn’t cause her to stink after use. Refreshing for us both and find it helpful when she comes back inside. Yes I would recommend for it’s convenient and helpful when they need that freshness for skin and coat.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel R.",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "These are the BEST pet wipes I have ever used",
      "text": "These are the BEST pet wipes I have ever used. Two of my cats have always had trouble with dandruff and dry skin. These wipes have gotten rid of it and left their fur soft and shiny. They don''t at all mind being really rubbed down with these either. The only negative I have is that the box is very deep and the 2nd half of the box wipes are hard to reach. The box does keep the wipes moist though.",
      "rating": 5.0,
      "verified": true,
      "author": "Paulette Gibson",
      "helpful_votes": 2,
      "publication_date": 20180220
    },
    {
      "title": "Great item...don't hesitate to buy...",
      "text": "We got these for the \"wrinkles\" on our Boxers face and dry nose...She doesn't mind us using them at all on her,and we have definitely noticed a difference on her dry nose already and it's only been a week! We will absolutely be reordering these when we need them...And btw we had NO issues with the packaging!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Zara's mama",
      "helpful_votes": 2,
      "publication_date": 20161028
    },
    {
      "title": "Keeps my pet very clean",
      "text": "Love these wipes, they are strong, smell great and my dog loves them as much as I do. A clean pup in your bed is always a good idea :) My dog is all white and these keep him sparkling! We use 3 - 4 wipes a day.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Marie",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Still good, but used to be the best",
      "text": "Like other reviewers, I'm disappointed they changed the formula. My dog has a bunch of problems and pees/poo's himself everytime he goes out. I use these in-between baths to keep him clean and they used to be a LIFESAVER. With the new formula he doesn't get nearly as clean as he used to and he still smells. They work and I be see soils coming off, just not completely.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "NOT UNSCENTED! INCORRECT INFO ON IMAGE!",
      "text": "Naturally-derived fragrances and \"unscented\" are two very different things! These have a very strong odor. No way am I using these on my cat. Edited to add: Manufacturer seems confused about the generally-agreed upon usage of the industry term \"unscented\" versus \"fragrance-free\".",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Makes my dog smell great",
      "text": "My dog loves to roll in yucky things when we hike. I wash her with doggie shampoo (which she HATES) but sometimes the smell lingers. These wipes have been doing the trick of absorbing the vile order and leaving my pup smelling good. They are big sheets which means I only use one ( or two when she is really, really yucky).",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "best on the market!",
      "text": "These are the best towels on the market and I've tried them all and examined all ingredients. These are the thickest, most moist, and most comprehensive in it's uses. The ingredients have as much integrity in their safety and health-consciousness as the towels themselves. My puppy plays tug-of-war with the towels, they never tear and the ingredients and texture of the towel are a great and fun way to clean a dog's teeth. I'm rarely this enthusiastic about a product! Bravo to SofiesSecret!",
      "rating": 5.0,
      "verified": true,
      "author": "Lanie Kagan",
      "helpful_votes": 2,
      "publication_date": 20170103
    },
    {
      "title": "I really love these pet wipes as I've purchased several before",
      "text": "I really love these pet wipes as I've purchased several before.. but for some reason I received these and they were damaged. The box of wipes is completely wet and ruined. Kind of disappointed considering the fact that I had ordered these because I was running out and actually needed them. Be careful when purchasing... some boxes may be damaged.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr.M",
      "helpful_votes": 5,
      "publication_date": 20161104
    },
    {
      "title": "Works!",
      "text": "The only problem I have with these is they are not that big! I have 3 dogs, 34 to 54 lbs, and these need to be bigger for them! However, I still can use them and they work well!",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas H Roberts",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "I am using these wipes for my dogs paws after ...",
      "text": "I am using these wipes for my dogs paws after she goes outside and so far it seems to be working well. Other wipes have a stronger smell and I think it irritated her skin so she used to chew on her paws alot. I have not seen her chewing as much since using these wipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Inez Takushi",
      "helpful_votes": 2,
      "publication_date": 20170312
    },
    {
      "title": "Fail",
      "text": "They said they are suitable for a cat. It's not really. it smells. I would not trust putting it on my cat. Now I have about a 100 of them and don't know what to do with them.",
      "rating": 2.0,
      "verified": true,
      "author": "Kath LaFrance",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great for eye drainage.",
      "text": "This is the best. My daughter's Shitzu has runny eyes that stain her hair and smells awful. These wipes have really helped keep her eyes free of eye boogers and stinky smell without irritating her skin and eyes. So far I wipe her down once a week.",
      "rating": 5.0,
      "verified": true,
      "author": "De'vorah",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Strong sheets, very nice reusable container",
      "text": "Favorite wipes at a pricier cost than another. These are strong and large enough to wipe down pup or wipe a floor without tearing. The container is a plus, easy and quick to open, easy to close. I wish SoftiesSecret offered refills at a lower cost comparable to the other favorite.",
      "rating": 5.0,
      "verified": true,
      "author": " La Smurf",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "DO NOT BUY! They are now really cheap quality!",
      "text": "They have completely made the wipes cheaper. They used to be such good quality wipes now they are cheap petwipes that turn fiberous. Also the previous packaging has been changed to \"reduce waste\". Its been clear they are trying to cut cost every which way possible.",
      "rating": 1.0,
      "verified": true,
      "author": "Rcommander",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "These have a pretty intense floral smell to them which was a surprise ...",
      "text": "These have a pretty intense floral smell to them which was a surprise because the description says \"unscented\". I will not be making a repeat purchase on these.",
      "rating": 2.0,
      "verified": true,
      "author": "Karin Brown",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Pet Safe Wipes!",
      "text": "These are a perfect size for cleaning up messy little animals. I love that they are pre-moistened and unscented. Also, there are no worries of reactions from the pet because they are specifically made to be pet safe!",
      "rating": 5.0,
      "verified": true,
      "author": "Kay Adams",
      "helpful_votes": 2,
      "publication_date": 20161223
    },
    {
      "title": "Best product ever",
      "text": "Best product ever! Excellent quality, made with finest materials. I used to use 2-3 of other brands, these are so nice, I only need to use one at a time. I have all my family members ordering them for their pets - both cats and dogs! BEST PRODUCT ON MARKET.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Durable wipe!",
      "text": "Really liked the large size of the wipe, its durability, and the sturdy container! The only reason it doesn't get the 5th star is because I found the scent a little overpowering and felt it was too strong a smell for my kitty's sensitive nose.",
      "rating": 4.0,
      "verified": true,
      "author": "R. McQ",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Happy customer",
      "text": "Great wipes. I haven't had any issues with the wipes leaking through the box or molding. Guess I was a lucky one. Had them since July are they are still moist. My Yorkie hates when I wipe her off, so she is constantly biting at the wipes, which is a good thing that they can be used for her teeth too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Great Product",
      "text": "My dog has allergies and I use this to wipe her feet when she comes in from outdoors. Great product to gently clean paws and body off from allergens.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Lynne Selander",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Horrible Rancid Smell",
      "text": "Cannot use these the smell is horrible. Very upset because I've been using these for years and actually loved them, but they must have changed the formula or this is a bad batch. I actually used to love the smell and the wipes are a great size, sturdy and all natural. Unfortunately now I have to find new wipes for my dog. Way too expensive to pay for rancid smelling wipes!",
      "rating": 1.0,
      "verified": true,
      "author": "Tamiko Shimizu",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "All-purpose, natural ingredients",
      "text": "I don't find the new lemongrass scent overwhelming like some of the other reviewers; quite like it actually and my dog isn't bothered at all. The fact that it's totally natural and I can use them on her teeth and in her ears is huge. Other wipes have synthetic ingredients that would preclude that kind of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Slater",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "These work great!",
      "text": "I initially bought these to help clean one of my dogs paws and ended up using them to help clean ears and a quick coat refresher. All three of my pups have used them and we’re happy with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Works well",
      "text": "Best wipe I have ever used on my dog. Large size is perfect, smells good too. I totally recommend them. My dog sits while I clean his ears and face.",
      "rating": 5.0,
      "verified": true,
      "author": "The Main Book Lover",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Great for when you need help clean your kitty or pup",
      "text": "These wipes do an excellent job. I have a kitty who is ill and needs occasional help with cleaning. They are soft, well-moistened and clean quite well. Also these wipes leave no oily residue.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie J. Wood",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Awesome",
      "text": "Just what I was looking for to wipe dirty paws, eyes, and “privates.” Large and thick and moist.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris E.",
      "helpful_votes": 2,
      "publication_date": 20171113
    },
    {
      "title": "We like these for wiping our mastiff's face",
      "text": "Nice size wipes. Wish they were truly unscented but my dog doesn't seem to hate them as much as some other brands, maybe it's the scent that she doesn't mind. Who knows. I will buy them again when I get low.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria Soares",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "The Best",
      "text": "When these came out of the package I was really concerned. They smelled very funny. But that went away and I LOVE these, I live in an area where I wipe my dogs feet and face 3 to 4 times daily. Due to pesticides, other animal sniffing, etc. I love that I can keep her eyes clean also. They are not a light weight towel, and are very moist. Best product I have used!",
      "rating": 5.0,
      "verified": true,
      "author": "Olde Mare",
      "helpful_votes": 2,
      "publication_date": 20160728
    },
    {
      "title": "Yessss these are fantastic! My little buttheads love rollin around in the ...",
      "text": "Yessss these are fantastic! My little buttheads love rollin around in the dirt first thing in the morning so naturally, I use a lot of wet wipes. This package has a lot of wet wipes; wet wipes that don’t smell like perfumes or fancy oils. They’re sturdy, they don’t have a strong odor, and the packaging prevents drying out.",
      "rating": 5.0,
      "verified": true,
      "author": "ambird",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "The best pet wipe",
      "text": "To me, this is the best pet wipe out there. The reusable tub is wonderful and the wipes are large enough for my 70 lb American bulldog",
      "rating": 5.0,
      "verified": true,
      "author": "YogaPants",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Really as good as advertised",
      "text": "Perfect for freshening up if you are not able to shower. The size of the cloth is large enough to cleanse the entire body. The scent is light and pleasing. Definitely as good as the product is portrayed to be",
      "rating": 5.0,
      "verified": true,
      "author": "SjB",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "They changed the ingredients and now nothing is listed as ...",
      "text": "They changed the ingredients and now nothing is listed as organic. It also contains sodium benzoate which wasn’t listed before. The new wipes have a much stronger smell.",
      "rating": 2.0,
      "verified": true,
      "author": "natural princess",
      "helpful_votes": 3,
      "publication_date": 20180314
    },
    {
      "title": "I have two big labs who like their mud/dirt",
      "text": "I have two big labs who like their mud/dirt. These wipes are big enough that I have been able to reduce the amount of wipes I use when cleaning up after my puppers.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 2,
      "publication_date": 20170428
    },
    {
      "title": "Mehh",
      "text": "I liked the larger wipes made by this brand a lot better and no longer available.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "I love these wipes. I will buy again for sure!",
      "text": "Perfect size for my large dogs. Great that I can use them for face, ears, coat and even teeth! All natural and non-toxic. These wipes smell great and I'm glad I have an easy way to clean my dogs in between baths. We live in Arizona and my two pups love to roll around in the dust/dirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Petry",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Like the bigger size. Will order again.",
      "text": "I like the bigger size for my big dogs. Easier to pull 1 wipe at a time out of the pack than others I’ve tried. I will order again. The only negative is the plastic lid for the container doesn’t stay on.",
      "rating": 5.0,
      "verified": true,
      "author": "ruby",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "I used 2 boxes and LOVED them but when I opned the 3rd box it ...",
      "text": "I buy lots of itmes in bulk. I used 2 boxes and LOVED them but when I opned the 3rd box it was soft and there was mold on the inside so I thought it was a fluke and opened the next box it was the same, so on and so on. SO these do not last. I think it is the packaging.",
      "rating": 2.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 4,
      "publication_date": 20170111
    },
    {
      "title": "These wipes for my rescue maltipoo are great. I am bothered by smells",
      "text": "These wipes for my rescue maltipoo are great. I am bothered by smells; and these do not affect me. I keep them near the front door and wipe my dog's feet off after our winter walks through the mud. She doesn’t mind; they clean like standard wipes and get out that mud!",
      "rating": 5.0,
      "verified": true,
      "author": "Kakeed",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "I love these and so does my pooch",
      "text": "I love these and so does my pooch. Bought 9 months ago and wipes have NOT dried out. Very sturdy, thick cloths that do not tear easily. One wipe is enough for a touch-up of my 24lbs boston terrier. Two wipes if he's REALLY dirty.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared B.",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "love these wipes",
      "text": "love these wipes, have purchased multiple times - great to use after a walk.",
      "rating": 5.0,
      "verified": true,
      "author": "ks",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "they have wonderful customer service- I asked a question and they responded ...",
      "text": "I have a dog with an allergy to grass and pollen. I use these wipes to clean her paws and fur when she is suffering. They are very effective at cleaning and soothing her skin. They are soft with a mild scent that does not bother her or me. Also, they are not oily or sticky and do not leave a film on her fur. This product works very well for me. Lastly, they have wonderful customer service- I asked a question and they responded and answered my question very quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary  Marin",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Just okay",
      "text": "XL is a laughable description. When I searched anti itch these came up and I do not believe they work for that purpose.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott Neth",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "They work",
      "text": "They do help in between groomer apts and I like the scent. The scent doesn’t linger",
      "rating": 4.0,
      "verified": true,
      "author": "leanna blue",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "My Cat actually likes it",
      "text": "Great product as I am pretty sure I would never be able to get my cat in a bath without getting clawed to death. This is a great solution and surprisingly she doesn't mind it.",
      "rating": 5.0,
      "verified": true,
      "author": "J2006",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "These have been great! We use these on our pups paws every ...",
      "text": "These have been great! We use these on our pups paws every time we bring her in from a walk. I'm a bit of a germophobe and this eased my mind a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Quality control issue",
      "text": "I’ve been ordering these for over a year. Just received a delivery of four boxes. They’re all dried out ! Would like a product replacement or refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Buster Brown",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Great towels - clean",
      "text": "Great towels - clean, moist and soft. I live in NYC, so I wipe my dog's paws often, multiple times a day. The design of the box is also good, as it seals in the moisture so that the wipes don't dry out, but is also easy to open and close with one hand, while holding on to the leash with the other.",
      "rating": 5.0,
      "verified": true,
      "author": "AMMnyc",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Strong, and refreshing your pet will love them.",
      "text": "After a daily walk these work great on my dogs feet. He loves them,",
      "rating": 5.0,
      "verified": true,
      "author": "Banjobj",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Won’t be able to live without them now!",
      "text": "I don’t know how I lived without these great wipes! We live out in the country and my dogs do you get dirty. These things are big and thick and smell amazing❤️",
      "rating": 5.0,
      "verified": true,
      "author": "kirby",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "good value",
      "text": "One cloth goes a long way in wiping down my dogs, I have a Great Dane and 1 or 2 cloths will do the job easily. The packaging works well in keeping the product from drying out.",
      "rating": 5.0,
      "verified": true,
      "author": "jb",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Works great on cats and dogs",
      "text": "Outstanding product! Works great on cats and dogs. Thick material makes it easy to use. Pets seem to like it as well",
      "rating": 5.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Fresh scent!",
      "text": "Great for quick wipe up of muddy paws, or just a quick freshening of our dog’s coats.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Great Product!",
      "text": "These are really great. They're large and wet and they all stay wet down to the very last one and you can use them on humans too. A bit pricy but (for me) worth it. My dog is large and is incontinent so I often use two of these to clean her up when I take her outside to urinate.",
      "rating": 5.0,
      "verified": true,
      "author": "MaryB",
      "helpful_votes": 2,
      "publication_date": 20160903
    },
    {
      "title": "Good Wipes",
      "text": "Could be a little more moist but all in all a good wipe with natural ingredients. Will need two if there is a muddy situation.",
      "rating": 4.0,
      "verified": true,
      "author": "DawnG",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Love them!",
      "text": "These work great for my bulldogs wrinkles and snout!! They smell pretty good too!! They are a nice thick and textured cloth. I will be ordering the refills soon too!",
      "rating": 5.0,
      "verified": true,
      "author": "amber",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Love these. I use them to clean my sphynx ...",
      "text": "Love these. I use them to clean my sphynx cat and he doesn’t seem to mind at all. I do warm them up for 2 seconds before so they aren’t cold.",
      "rating": 5.0,
      "verified": true,
      "author": "Shayna Richard",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Crappy container.",
      "text": "The wipes seem to be ok, they only came a few day ago. My dog doesn’t seem to mind the smell others have complained of. So far. My complaint is the plastic tub. It does not close or seal, and the wipes would dry out in no time. I had to put the wipes in a snap-right storage container to ensure they stay moist.",
      "rating": 2.0,
      "verified": true,
      "author": "Julie G.",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Best Wipes",
      "text": "These are the best pet wipes. They are thick and textured, so they pick up dirt and stay sturdy when using them. They also stay and are really moist. I have had a box of 100 and it has been open for a couple of months and they wipes are still very wet. I've tried many dog wipes. These have no odor (which I require) and are the most sturdy and effective.",
      "rating": 5.0,
      "verified": true,
      "author": "alison armstrong",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "These are not extra large",
      "text": "They’re advertised as being extra large, but I wouldn’t describe them as that in any way. They’re basically the size of a standard baby wipe which does nothing for my extra large husky when he has mud on his paws.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristina Stoural",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "I like to wipe him down each day",
      "text": "I have a pug with seasonal allergies. I like to wipe him down each day. These wipes are perfect for that job. We like the scent, very pleasant and not too strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Very moist and very effective. My dog is small ...",
      "text": "Very moist and very effective. My dog is small so I cannot make claims on the effectiveness of these to work on larger dogs. My dog has sensitive skin and has not had any issues with these wipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew McKenzie",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Clyde says this is good",
      "text": "My rescued rat terrier Clyde 14 yrs old says this is good, but his wife Chloe runs away, and as soon as I catch her I am sure she will be happy too.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Pappas",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "grooming help",
      "text": "These work good and really helps with grooming care for one of our cats that has health problems and doesn't groom himself as he needs to.",
      "rating": 4.0,
      "verified": true,
      "author": "D.K.",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "I also recommend them to all my clients",
      "text": "I am a pet care provider and I carry these with me wherever I go. I also recommend them to all my clients. They are good for any cleanup from rear end to eye sleepy's. I can use them on dogs and cats, ones with allergies and ones that are just messy. I highly recommend you buy a box for home and a box for your car.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "These worked great and I was able to wipe down my pups ...",
      "text": "These worked great and I was able to wipe down my pups body and paws with one wipe since they are so big.",
      "rating": 5.0,
      "verified": true,
      "author": "Rochelle",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Nice & Thick!",
      "text": "Nice thick wipes for my Cockaliers ears after eating. Augie's nose gets a cleaning too and these hold up well. No harsh scents..love that!",
      "rating": 5.0,
      "verified": true,
      "author": "LLH",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "They would work well for dogs that don't like to roll in the nasty",
      "text": "They would work well for dogs that don't like to roll in the nasty!! But if you have dogs that like to roll around in the nasty like I do this just makes the smell worse.",
      "rating": 1.0,
      "verified": true,
      "author": "Crissy",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "Four Stars",
      "text": "great cleaning cloth with thick material. DO NOT BUY REFILL 200, that's as thin as a tissue paper.",
      "rating": 4.0,
      "verified": true,
      "author": "Techie",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Perfect, not overwhelming scent",
      "text": "Smell is not overwhelming, light and perfect for wiping my ADORABLE Carin Terrier's mouth after she eats....little bugger has a tiny beard that seems to catch Everything from leaves to treats.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelerp",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Great Pet Wipes",
      "text": "Very easy to use on my cats for a quick clean up, which minimizes hair, pet dander, and soiled coat. Leaves their coats shiny and clean. Makes them smell nice. Its all natural, so there is little worry about sensitivity to this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca L. Skalsky",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Best Wipes",
      "text": "These are great for a quick clean up. Super durable and large enough to only need one with our 80+ pounder. Holds up to mud and dirt on his coat. Our big boy has environmental allergies, so he needs a good wipe down daily and these are better than any other ones we’ve tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Ivlev",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great Pet Wipes!",
      "text": "These pet wipes are a little more expensive than others I've used, but they are washcloth size and stay nice and moist to the last wipe. They also pop out one-at-a-time instead of 4 or 5 like others I've used. They are cruelty-free, use organic extracts and are hypoallergenic. The scent is soft and natural; not overpowering, sweet or artificial. They are my favorite pet wipes.",
      "rating": 5.0,
      "verified": true,
      "author": "e.gee",
      "helpful_votes": 0,
      "publication_date": 20170211
    }
  ],
  "product_meta": {
    "title": "SofiesSecret XL PET Wipes, 100 Sheets +1Tub, All in One Grooming, for Paws, Coat, Skin, Face, Ears and Teeth, Made with only Naturally derived Ingredients, Oils & Extra, Cruelty Free and Vegan",
    "rating": 4.4,
    "feature_bullets": [
      "ENRICHED WITH NATURALLY DERIVED INGREDIENTS, OILS & EXTRACTS ONLY: such as Chamomile, Ginkgo Biloba Leaf, Green Tea, Aloe Leaf, and Tea Tree, Sesame Seed Oil, Cinnamon Oil",
      "USE IT ALL OVER YOUR PET: SofiesSecret Pet Wash Cloths are safe to use on your pets Paws, Coat, Face, Ears, Skin and Teeth.",
      "CRUELTY FREE & VEGAN: SofiesSecret is PETA Approved, Green America Certified and Leaping Bunny Certified. SofiesSecret cares about your wellbeing, the environment and our furry loved ones.",
      "FOR THE MOST SENSITIVE SKIN -PERFUME & FRAGRANCE FREE: SofiesSecret Pet Wash Cloths are not Scented with perfume’s or other artificial fragrances; we use natural extracts to scent our cloths.",
      "MONEY BACK GUARANTEE: If you changed your mind about our Pet Wash Cloths, send your unused/unopened Pet Wash Cloths back for a full refund."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "10 x 10 x 4 inches; 3.4 Pounds",
      "Date First Available": "May 1, 2016",
      "Manufacturer": "Moist Towel Services Ltd.",
      "ASIN": "B01E9MRHZ0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Top Selection from AmazonPets",
      "Pet Supplies"
    ],
    "price": ""
  }
}