{
  "website_summaries": [
    {
      "verdict": "This cute, vintage-styled microwave is perfect for cooking small frozen dinners and reheating food. If larger frozen food portions and microwave popcorn are on your menu, though, look elsewhere.",
      "pros": [
        "Unit with 0.7 cubit feet and 10\" turntable",
        "Features 5 power levels and 4 automatic programs",
        "Timer knob",
        "Child safety lock",
        "Defrost function",
        "End signal",
        "Uses no power on standby",
        "Attractive and space-saving",
        "700W",
        "Best for reheating meals"
      ],
      "cons": [
        "Cannot be used to cook bags of popcorn",
        "Not enough power for some frozen foods"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Aesthetically pleasing garbage.",
      "text": "This product, despite looking slick, is a pitiful excuse for a microwave. Takes forever!! to heat food and the \"add time\" stopped working after about two uses. If you are buying this with the hopes of any degree of functionality, I'd advice you to stay away.",
      "rating": 1.0,
      "verified": true,
      "author": "EG",
      "helpful_votes": 77,
      "publication_date": 20171020
    },
    {
      "title": "Quit after 3 uses. No warranty refund or return after 30 days. Disgraceful",
      "text": "I would give zero stars if I could. It is adorable but I used it a total of three times before the Power Save button quit working. I tried unplugging and replugging it several times. I tried different outlets. It simply won’t turn on again ....yep great way to save power! And I’ve had the thing more than 30 days so no warranty no return no refund. That is disgraceful. They should be ashamed.",
      "rating": 1.0,
      "verified": true,
      "author": "rebecca r",
      "helpful_votes": 29,
      "publication_date": 20180516
    },
    {
      "title": "delivered November 14th 2017 stopped working April 11th 2018 return ...",
      "text": "delivered November 14th 2017 stopped working April 11th 2018 return window is closed. now i’m stuck with a broken piece of junk. Don’t buy this product!",
      "rating": 1.0,
      "verified": true,
      "author": "Bradford Cusack",
      "helpful_votes": 27,
      "publication_date": 20180411
    },
    {
      "title": "\"Basic\" at it's best.",
      "text": "700 watts is my way of forcing myself to slow down and I can't use this without having that thought, and that's a good thing. Neat looking, clean design and no panel of numbers, buttons, etc. Love the color, didn't realize how tired I am of stainless steel! This will do perfectly for my limited requirements. I recommend this little hummer to anyone living in a small space and not in a hurry.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry A. Moyer",
      "helpful_votes": 8,
      "publication_date": 20180725
    },
    {
      "title": "Great so far!",
      "text": "I've been using for the last couple weeks. I don't use a microwave often but so far it's great! Cute design and I like the power on feature. My last microwave had a light that would come on when the door opened, this one doesn't come on until it's in use, I think that's due to the energy saving power feature. I hope I have this microwave for a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20161214
    },
    {
      "title": "You Pay for the Look and Sacrifice Power",
      "text": "The first microwave I ordered, sparked, and fried upon plug in. The replacement they sent me, has been working. You notice that it takes 2 or 3 times as long to heat anything up, at least compared to my last microwave. The \"add 30 second\" button, only works sometimes. I don't think I realized that their is NOT a timer function, which I used constantly for baking. I love the look, and love the size. I just feel that the quality is sub-par. It just seems cheaply put together. Part of me wishes I had just bought a basic looking microwave for half the price and twice the performance.",
      "rating": 2.0,
      "verified": true,
      "author": "Miya",
      "helpful_votes": 4,
      "publication_date": 20171217
    },
    {
      "title": "Buying my second one but only because it is grungy",
      "text": "I don't cook. I reheat Amy's, steam veggies, make tea and, every so often, a potato. This works fine for those simple tasks. Would not recommend it for someone like my Mom, who, when she got her first microwave/convection oven, spent most of a 6 hour car trip relating all the wonderful uses she had found for it. A lot of people have commented on how adorable this microwave is. It still works, but the inside coating is beginning to blister.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty",
      "helpful_votes": 3,
      "publication_date": 20190327
    },
    {
      "title": "Super cute and WORKS!",
      "text": "I have the refrigerator that matches this little Microwave and I love them both. I keep them both in my bedroom so I can grab a drink or pop me some popcorn durning the night and not have to run up and downstairs to my kitchen. I get lot's of questions about it and everyone loves the color. It is powerful and easy to operate. Perfect size too. HURRY before you can't get one...YOU will be so happy you did.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa F. Clark",
      "helpful_votes": 3,
      "publication_date": 20190128
    },
    {
      "title": "Died after 2 months.  Edit: came to life again!",
      "text": "Looks cute but quit working after 2 months. Just up and died one morning. Of course, it's too late to return it and get a refund. Do NOT buy. Edit: The microwave came to life again! I don't know if it had overheated, or just needed a rest. So...I would now say, buy it but use it carefully as it doesn't like to work too hard? We love the way it looks so I was very glad when it resurrected.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Fuller",
      "helpful_votes": 4,
      "publication_date": 20171219
    },
    {
      "title": "It broke in 2 months",
      "text": "I loved this little microwave, but the button to power it on came unhinged, and fell down so i can't turn it on. What a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "googleearth",
      "helpful_votes": 6,
      "publication_date": 20180917
    },
    {
      "title": "Works great, looks great",
      "text": "very cute and works like a charm. I've only had it a few weeks so we'll see how it holds out. But it heats fine; not sure what one or two others are talking about because mine heats just fine. It's great because it goes on my small countertop perfectly and is so much cuter than a plain microwave. It's pretty easy to use too; no presets, just you select the minutes. Personally I hate presets because they never work anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Baranabus",
      "helpful_votes": 4,
      "publication_date": 20171202
    },
    {
      "title": "Retro microwave up in smoke",
      "text": "This is a review on the mint green Daewoo microwave. I received this microwave yesterday and used it a couple times for less than 30 seconds. I just used it today for a cooking time of 2 minutes and was rewarded with the smell of burning plastic coming from the rear of the microwave. It also will not power on... Although I don't know that I would want to use it even if it did power on. I contacted Amazon and they were quick to send out a replacement so we will see how the second one holds up.",
      "rating": 3.0,
      "verified": true,
      "author": "Stefan",
      "helpful_votes": 2,
      "publication_date": 20180430
    },
    {
      "title": "Only works when it wants to",
      "text": "Worked ok but not great the first month then over the last month and a half or so it's slowly worked less and less often. There's nothing blocking the door and I've poured over the manual exhausting all possible explanations but can't figure out why it only works sometimes; most of the time I close the door set the time and the fan tuns on but the light doesn't turn on, the plate motor doesn't spin and doesn't heat up my food in the slightest. I love everything about the design of this microwave but there's been no consistency in when it actually does what it's supposed to.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 3,
      "publication_date": 20180612
    },
    {
      "title": "WEAK! But cute. :/",
      "text": "I’ve had this microwave on my wishlist for a couple of years. After a recent kitchen reno, I finally purchased. It is a good compact size (i didn’t want a big one taking up space), and looks great in our kitchen! However, it is not very powerful. I knew it would be weaker than we were used to, but it’s worse than expected. 5 mins for a small bowl of soup to only be lukewarm! We’re keeping it because I threw out the box.",
      "rating": 2.0,
      "verified": true,
      "author": "Lee B",
      "helpful_votes": 3,
      "publication_date": 20171106
    },
    {
      "title": "cheap crap with bad interface",
      "text": "this is not shielded. when you turn it on, your broadcast TV signal disappears. It also has auto-shutoff and a power button. So to use it, you have to push the power button, then set your time. The directions are in poor english, looks like google translate - maybe it's just fake.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190116
    },
    {
      "title": "Stopped working 3 months after \"support window\" closed. Only used 12 times !!",
      "text": "I bought this for my little vintage camper and was delighted to have all matching appliances , I bought the refrigerator , electric tea kettle , and toaster . They are adorable , I have only used it about a dozen times , after my last camp trip the electric went on , light worked etc but motor did not go on . And now I thought it would have at least a one year warranty , but can not find any customer support for this !",
      "rating": 1.0,
      "verified": true,
      "author": "GypsyJoNana",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "didn't think I would love a microwave so much but I do",
      "text": "love this funky dude. I wanted something fun for my small depressing apartment kitchen and this brings it. was worried that it would be annoying to have to turn on the microwave every time I wanted to use it, but I never even notice that I have to do it anymore. can definitely tell that it's saving me money on my electricity bill, so that feature is well worth any conveniences if it does bother you.",
      "rating": 5.0,
      "verified": true,
      "author": "Josie Sabo",
      "helpful_votes": 4,
      "publication_date": 20180613
    },
    {
      "title": "Perfect for small things like warming milk.",
      "text": "It’s a very cute little microwave. I wish it was smaller and I wish it was actually green. It’s more of a Tiffany blue than mint green. Here it is next to other green kitchen items (I was trying to math kitchen aid pistachio) . I bought this purely so my daughter can have her milk like warm in our new house with no built in microwave... so I’m not reviewing it for heavy duty use... just the way it looks.",
      "rating": 4.0,
      "verified": true,
      "author": "EFV",
      "helpful_votes": 2,
      "publication_date": 20180827
    },
    {
      "title": "Love this!",
      "text": "My husband bought this for me to match my other mint accessories (yup, he did good!). I absolutely love it! It's so cute. Nice and simple too, which I personally like. It's a tad on the small size, but it's not bad. It'll fit a full size dinner plate, but just barely (especially if you have ridges on the edge of the plates). Still, I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle C.",
      "helpful_votes": 2,
      "publication_date": 20180310
    },
    {
      "title": "Cute Retro Microwave for Occasional or Infrequent Usage but Not as Your Primary one",
      "text": "I love the Retro look of this microwave. I purchased it bc it matches our retro mini-refrigerator in style & color; we use these upstairs near our bedroom for convenience of not having to traverse our stairways. We are concerned if the energy-saving on-off button will stand the test of time bc it’s flimsy & questionable. We compensate by always leaving some time on the dial. Only time will tell. This is good for an infrequently used microwave. We don’t recommend it for your primary one.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "I need to return / replace please",
      "text": "Hello, The microwave seems to have a manufacture's defect: it started to smoke / burn, perhaps the electrical cord. The fire department came and confirmed none of the outlets in the house were 'alive' - so the issue was the microwave. I purchased a warranty - please tell me how to proceed replacing / returning or refunding. Thank you,",
      "rating": 2.0,
      "verified": true,
      "author": "Lady J, Seattle",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "does not pop popcorn on popcorn setting",
      "text": "I really like the look of this microwave and so that lead my decision making to purchase it. We only really use our microwave to pop popcorn in the bag so we were disappointed when our popcorn bag did not fully pop on the popcorn setting. For the most part, when we use this microwave everything has to be adjusted to a higher cook time because food comes out not warm enough or not cooked thoroughly. it is also really small. our dinner plates barely fit inside of it. We are going to order a full size microwave that is not as attractive but that will cook better and pop our popcorn bags.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "I love it",
      "text": "Simple, easy to use. I hate all the stupid buttons that come on modern micros. It is a little smaller than american standards. But my plates fit in it perfect. If ur plates dont fit inside, ur plates are too big. The micro is just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody Britton",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Outstanding looks, worked great until it died",
      "text": "This microwaved got compliments every time someone saw it. It worked great and fit the kitchen colors perfectly, even if it was a bit slow at heating larger or denser items. Unfortunately all that is for nothing, since it died 13 months after we got it. Doubt we'll be replacing it with the same thing again. I know every device has a lifespan, but this is pretty short.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew Rogers",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Purchased Aug. 2016—Dead Jan. 2019.",
      "text": "Bought this microwave Aug. 2016. Loved how cute it was. Spent over $100 for it. Still looks brand new. Used to heat up coffee or a frozen burrito. Not excessive at all. It died today. Changed outlets still dead. Poped a bag of popcorn and now won’t come on. Soooo bummed!!! Very disappointed. At that rate not worth the $110 I paid for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kala Pedersen",
      "helpful_votes": 2,
      "publication_date": 20190118
    },
    {
      "title": "Had to return it",
      "text": "This microwave did not seem safe to use. It gives off a lot of heat externally. In addition to that, it doesn't heat the food evenly and takes at least twice as long as any other microwave. The look of it is so perfect, I wish it was made well. I returned this one and got the Nostalgia brand instead. It's a little bigger and cost a little more, but the color (even though the online photo shows it as more saturated) is about the same as this one. Go check that one out instead!",
      "rating": 1.0,
      "verified": true,
      "author": "Grace Ross",
      "helpful_votes": 2,
      "publication_date": 20181030
    },
    {
      "title": "Does NOT heat food!",
      "text": "Ordered this because it matched my kitchen and thought was super cute. Noticed the first time I used it didn’t heat very well. Continued to use and no matter how long I put the time on and setting on high it wasn’t heating my food through. Tried to make popcorn in it and never allowed the kernels to pop even though there’s a popcorn setting. Would’ve loved to return it but was hoping it would get better and now I’m past the return date.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181112
    },
    {
      "title": "cute and perfect",
      "text": "This microwave is the best. Its obviously cute. My concern was if it was too small, we don't have much counter space so I wanted something small but a large paper plate fits in this microwave just fine! I also microwave bacon and that package fits in just fine as well. Honestly I haven't tried to microwave anything yet that doesn't fit. It shuts off on its own after a few minutes so its power saving which is nice. The only thing I miss is having a clock on the display. There is no clock.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Keeps shutting down",
      "text": "We have had this microwave for six months. It has started to overheat and shutdown nearly every time we try to use it, and doesn't heat the food. It then remains shut down for lengthy amounts of time until it decides it wants to turn on again. Even when it turns on, it will shut off again after a short time, and the process repeats itself. It’s a cute microwave but has not functioned well for us. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Dave B.",
      "helpful_votes": 2,
      "publication_date": 20190116
    },
    {
      "title": "Love this adorable aqua microwave!",
      "text": "Where do I begin? I absolutely love this microwave... It's cute, it's aqua in it works great! Everyone who comes into my kitchen notices it and says how cute it is. It does everything a microwave should do while still looking adorable! The only negative is that it has a very short plug so you will need a small 3' extension to plug it in to a normal wall.",
      "rating": 5.0,
      "verified": true,
      "author": "StarfishAndStripes",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Not the best at heating things up",
      "text": "This is super cute and fits well for small spaces. It has just enough room for a dinner plate. Cute is great and all, but it doesn’t heat exceptionally well. I always have to put things back in to heat further. Even a cup of water takes five minutes or more. I do t use it often, so that’s still fine for me, but if I wanted a microwave to perform the functions of a, y’know, microwave, I’d be disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Fifer",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Great for a cabinet shelf.",
      "text": "We like having our microwave in our pantry, because microwaves are ugly and take up counter space. We typically aren't cooking with one very often- just melting butter and reheating leftovers. This little microwave was perfect. It is shallow enough to fit neatly on a standard 12\" shelf. It's big enough for the plates that we use, too. It's a lower wattage that our previous microwave, but who cares? It still heats up our leftovers in just a few minutes. It's buttons are simple to use- I always love a +30 sec button. It's pretty darn cute, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Willard",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Cute and small",
      "text": "Make sure to read the wattage on this microwave before purchasing. It takes at least twice as long to cook as any other microwave I’ve had. It also can’t fit a full size dinner plate. I needed a very small one for my very small place so it works for me but I didn’t realize wattages could be so different.",
      "rating": 4.0,
      "verified": true,
      "author": "Mindy Brown",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Cute & Effective",
      "text": "Super cute, makes a cute retro statement in my kitchen. Only negative is it doesn't beep after like a minute to remind you your food is done and it doesn't have a clock either. It is great if you need something for a small space, and want something cute and don't use a microwave to heat food often (we don't use it too often, just needed something for quick on the go reheats). Works perfectly we love it!",
      "rating": 4.0,
      "verified": true,
      "author": "Gianna",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Meh",
      "text": "Not that it's a huge deal but all the pictures would lead you to believe there is a clock that constantly displays the time but no... The light only turns on when it's in use, not when you open the door. Also, to set the cook time, you use the dial and it only goes in increments of 10 seconds which I thought was very odd. It does look cool and retro but I'l have to see how it works a couple times to see if it's going back or not. Looking at other similar products of similar style and price, seems like you get more options...",
      "rating": 2.0,
      "verified": true,
      "author": "Mike T",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "It's perfect for one person",
      "text": "I've had it for half a year or so now. It's perfect for one person, and it is so dang cute that it makes me happy everytime I look at it. Daewoo is also pretty credible & big company.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 4,
      "publication_date": 20170429
    },
    {
      "title": "Retro Look!",
      "text": "I bought tis MW for the retro look, and the small size. I am not a microwave user, would prefer a toaster oven, but I got this one for a rental. Wanted to have a retro look, and not too big to allow for counter space. It has a power button that needs to turn on first before choosing any heating mode. I tried it on, and it does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Maline",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Adorable",
      "text": "Cutest microwave ever!!!! I just got this 2 days ago so I’ll update as needed, but omg I love it. This microwave is small but not to small and oh so adorable. I’m glad I spent a little extra to get this beauty because it’s a perfect statement piece for our kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith & Ashley Y",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "I seriously love this guy",
      "text": "it's smaller than our old microwave, which is great. It's really easy to use, and i really like that it has an auto-shutoff. We usually cook things at like 600 watts in our old microwave (which was half-power for the old one), so having one that is 700 watts means we aren't likely to accidentally burn anything. Plus the colour matches with everything else in our kitchen",
      "rating": 5.0,
      "verified": true,
      "author": "Wren",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Love it!",
      "text": "So the FIRST microwave I received it was DOA. I was sooo bummed. It looked good though! I requested a replacement and they sent me out a brand new one ASAP. It even came a day early! The product itself is better than my expectations. The look is stylish and it's not so bulky like most microwaves. The power button allows you to turn it back on when it self shuts off to save power. I love it thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Great for our small kitchen, works well, super cute!",
      "text": "Our counter space is extremely small, and this microwave is the perfect size. Only our smaller plates fit inside, but I only ever use a microwave for individual dishes, never anything like a casserole. My previous microwave was more powerful, so I’m using longer times with this one. It works well, and I’m extremely happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Alina P",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Very stylish energy saver",
      "text": "I love this microwave. It goes perfectly in my little 1932 bungalow kitchen. It has all the handy features I was used to, but I love the feature that requires that it be turned on before each use. It doesn't sit there wasting energy 24/7.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Samuels",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Too small for a plate",
      "text": "This is so cute! I would have loved to have kept it, but it was so small that a plate wouldn’t fit in it! I always warm my plate up in a microwave so....didn’t see how that could work. I found a similar bigger one, but this one is so cute.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen N.",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "I dig it.",
      "text": "In all honesty, I bought this microwave purely based on looks. A coworker then informed me that I should always read Amazon reviews before I make a purchase. To my horror, people were really not saying anything great about this microwave. With all of the excitement over this microwave drained from me, I cooked my first meal. This microwave works perfectly fine. It may need an extra 30 seconds on a frozen meal, but frozen meals are garbage anyway. Anything else I’ve cooked in this microwave has been piping hot. Plus, it’s little and cute and looks adorable in my mid century modern kitchen.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Lindsley",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "DO NOT BUY THIS!!!!!!!!!!!",
      "text": "Super cute but that’s it! Takes forever (no joke) to cook everything!!!! And the plate that sits inside the microwave easily comes off the plastic price that is supposed to hold it in place. I’ve never experienced this with any other microwave. Please DO NOT BUY THIS!!",
      "rating": 1.0,
      "verified": true,
      "author": "OH HAPPY DAY",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Stopped working after 3 months",
      "text": "Super cute, loved the look of it. Unfortunately it stopped working 3 months after i bought it. Amazon couldn't help and they gave me there manufacturers contact but the site wouldn't allow me to submit my information. Wish me luck as I wait on hold. Hoping this one was just a lemon!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20190204
    },
    {
      "title": "cute But poor quality",
      "text": "This microwave is cute but never really worked well. The strength of the microwave was not good and it would take about double to time to heat things as other microwaves. 2 years in it totally died. Very disappointed in the overall quality and longevity of this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Rachel Holmes",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Needs better rubber  gripping feet !",
      "text": "The first oven showed up at our door for Christmas and we spent a half an hour trying to get it to work and realized it was broken... Returned it and received one that did work, and it works great and it looks super cute! I did have to put rubber feet on the bottom because it’s slid around the countertop When you opened the door, but other than that it’s great",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisEld-Hartline",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Stopped Working after 4 months",
      "text": "This microwave is underpowered and you have to add time to thoroughly heat. We add 15 sec for every minute of cooking time and that does the trick. Daewoo made a super cute microwave, bit it quit working after 4 months. It is on the cheaper side of microwaves but I expected to at least get a year out of it. We used it in our shop where it is used several times per day. It doesn't hold up to daily use. 30 day warranty only, bummer. I would not purchase it again if I had to do it over.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Beautiful but does not work well",
      "text": "This microwave is so lovely to look at, but it does not work well at all. Heats so weakly that I have to at least double the usual time I would microwave things, and so unevenly that I have to stop it every 30-60 seconds to stir or half of the small dish will be literally frozen while the other half is near-boiling.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190131
    },
    {
      "title": "Great buy!",
      "text": "This is an adorable microwave! I love that it powers off naturally when it's not being used. It doesn't seem to have as much power as the ones a bit bigger, but you just have to put food in a little longer. The turn knob is a nice touch and the +30 seconds button is great for reheating!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Brooke",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "It is the SERVICE. It came fast in one day 🤩.",
      "text": "My neighbor loves it. She absolutely loved the old days look. She didn’t know she was getting it. Hers had broken down and she couldn’t afford another one so my wife bought this for her. I recommend this type of microwave to @nyone that likes nostalgia.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew E. Guyett",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Cute and works for me",
      "text": "This is great for normal mircrowave use. It heats frozen food and warms things. Seems to have a limit for amount of energy input 1 if you want heavy duty microwave for putting things on for over 10 minutes not for you. If you need a basic reheat and potatoe cooker - it works.",
      "rating": 5.0,
      "verified": true,
      "author": "BOomba",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Doesn't pop a standard bag of popcorn",
      "text": "It is BEAUTIFUL- don't get me wrong. But I am a girl who LOVES popcorn and it is just about an inch too small on the inside for the bag to spin enough to pop thw bag thoroughly. But GOOD LORD IT'S PRETTY.",
      "rating": 4.0,
      "verified": true,
      "author": "Kennanigans",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Don't reccomend buying used. Spend the extra money.",
      "text": "So I did buy this used, but they did not mention the handle was totally crinkled and dented. Also, it was super dirty and had dried food smears and smudges ALL over it. Kind of gross that they didn't even bother to wipe it down. Almost would've rather paid the extra 20 bucks for a brand new one.",
      "rating": 3.0,
      "verified": true,
      "author": "graham ",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Wrong voltage!",
      "text": "Dislike... I live in Australia and it is made for American voltage which was not written anywhere. The only thing I like is the colour it matches my kitchen theme.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190203
    },
    {
      "title": "Sweet little machine.",
      "text": "Cute little retro microwave, just right for my minimal needs. I live alone, so it works out fine. The color is just like this photo and fits in with my collection of old Ball fruit jars, etc. The instructions were good, but I had to go through it step by step to get it right, since it's different than my old micro-wave.",
      "rating": 4.0,
      "verified": true,
      "author": "The nurse/caretaker",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "This product lasted 6 months",
      "text": "This product is very beautiful and fit perfectly in my unique kitchen. However, it did not heat very well. I could have lived with that. The product ended up not working and completely crashing on me one night while heating up leftovers. Hopefully it was just a fluke in this particular microwave. I really like the style, but not worth it for 6 months time.",
      "rating": 2.0,
      "verified": true,
      "author": "Suzanne Vaughn",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "I love it",
      "text": "This is cute, functional, and works great. I purchased a 3 dollar protection plan to go with it. Don't think I'll ever need to use it. This microwave is well made and does all I ask it to do. Pops popcorn, heats up my coffee, heats up leftovers, and looks great in my kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "The color is cool, it works pretty well although most of the ...",
      "text": "The color is cool, it works pretty well although most of the time you have to opt for more time than the recommended cooking time on the items being cooked. Overall I am happy with the purchase, it is a bit smaller than the average microwave but it does the trick.",
      "rating": 4.0,
      "verified": true,
      "author": "devonnic75",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Love!!!!",
      "text": "Love this cute little microwave. I wanted a small microwave for our movie room. It's large enough to pop a big bag of popcorn and has a glass turn table inside. The cup that is in this photo is a tall cup. Everything is just like the description.",
      "rating": 5.0,
      "verified": true,
      "author": "Marley",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Cute, but didn't last long",
      "text": "I bought this about 2 years ago and today, it just stopped turning on out of the blue. I bought it because I thought it was cute, but I also thought it would at least be decent quality, especially considering the price, but it isn't worth it. I feel like I just bought it and now, I'm already microwave hunting again.",
      "rating": 2.0,
      "verified": true,
      "author": "Rebecca Wilcox",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "So retro",
      "text": "Love it, very cute, simple, doesnt take up much space, works well. Even has power save mode, but this doesnt allow for a clock lol, who cares? It is a smaller microwave, enough for a dinner plate size, I think just right. Nice color, only slightly more muted than the pic, but its nicer that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Worked a whole three times. Well 2.5",
      "text": "What the heck Daewoo? I went with this microwave because I felt good that it was a reputable well know brand. This thing died on the third use! About two minutes in to frozen Brussels sprouts. The suckiest thing is that we are in the middle of an entire kitchen remodel and this was our only way to make food. It won’t even turn on now! Very disappointed 😩",
      "rating": 1.0,
      "verified": true,
      "author": "iamafrozenpea",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "So stinking cute!",
      "text": "Moved into a small house with a retro look and though this microwave is miniature by todays standards, it works perfectly for this small space and looks even better! We don't use a microwave so much so it more aesthetics than anything else for us. In regards to the functionality of a microwave, it does the trick warming up leftovers or defrosting small portions, etc. We give this product high recommendations for the price and style. Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Drei Donnelly",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "IT'S CUTESEY LIKE THEY SAY",
      "text": "IT'S CUTESEY LIKE THEY SAY, BUT KIND OF CHEAPLY MADE.. THE CHROME LOOKS LIKE PAINTED PLASTIC, NOT REAL CHROME, AND THE DOOR IS FLIMSY. AND SO ARE THE BUTTONS..IF YOU PUSH THE \"POWER ON\" BUTTON TOO HARD IN.. IT MIGHT JUST GO INSIDE THE UNIT.. NOT GOOD.... THE SIZE IS GOOD, AND IT'S WORKING NOW, BUT DON'T EXPECT TO GET YEARS OUT OF THIS ONE. THE QUALITY IS JUST NOT THERE. IF IT WAS MADE IN THE 50'S OR 60'S.. IT MIGHT HAVE LAST FOR YEARS.. NOW.. 6 MONTHS TO 1 YEAR, IF YOUR LUCKY...STILL WORKS FOR WHAT I NEED IT FOR.. FOR NOW...",
      "rating": 3.0,
      "verified": true,
      "author": "Logan Garcia",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Pretty and works well",
      "text": "I love my little microwave. Yes it takes longer then full size and not all plates fit. But for the heating or reheating it great. Plus it looks good.",
      "rating": 5.0,
      "verified": true,
      "author": "Poppet",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "There is no comparison to a Daewood.",
      "text": "there is no comparison to a Daewood. there is an extra button for energy conservation. It is very compact. It is very easy to defrost food either by weight or time. it is well made. Good value. Beautiful color.",
      "rating": 5.0,
      "verified": true,
      "author": "Marlene Huber",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Grandma loves it.",
      "text": "Got this for my grandma because it matched her other blue green decor in her place, she was having a hard time pushing the button on those other countertop models, and it looks good overall. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Mad Cow",
      "helpful_votes": 2,
      "publication_date": 20170416
    },
    {
      "title": "Failed in less than 1 year",
      "text": "This thing looked good, but was underpowered and failed in 11 months of light use.",
      "rating": 3.0,
      "verified": true,
      "author": "Samuel Spade",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Quit working after 3 months",
      "text": "I loved this at first. It matches my other small appliances and it was good for reheating leftovers. Now it doesn’t work. It quit working after very LIGHT use within 3 months. I’m extremely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Meaghan Foshe",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Five Stars",
      "text": "so cute and works great! only issue/complaint???? is the color....its the groovy 50's car turquoise blue....not mint green",
      "rating": 5.0,
      "verified": true,
      "author": "bonnie",
      "helpful_votes": 2,
      "publication_date": 20180105
    },
    {
      "title": "Works great! Looks great!",
      "text": "Very quick delivery! Beautiful microwave! Replacing one from 1984 that was HUGE, and past its prime. I only ever heat up leftovers. Not a real microwave \"cook\". But I do a TON of bulk cooking, so something that heats leftovers well and consistently is worth it! I sort of miss the clock feature, but am learning to look at the coffeemaker instead. Soon I will be re-trained.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenn_dle",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Easy Operation and Nice Design",
      "text": "Very easy operation, cute color (mint green). I like the turn on, then twist the knob to set the time. Timer goes up very quickly in 10 second increments. Very easy to run up to 5 minutes or more quickly - it is pretty sensitive. Not super powerful, 1 cup of water is not yet boiling with 2 minutes time, but I knew it wasn't a super powerful microwave. Meets my needs to just heat things up fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Lara",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Good looking and energy efficient",
      "text": "Love love love this adorable little microwave! Super easy to use, love the power saving function, looks great in the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Sheafe",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "overheats and turns off",
      "text": "I'm so sad. I really like the look of the microwave. Unfortunately it does not heat well at all and it keeps overheating and turning off.",
      "rating": 1.0,
      "verified": true,
      "author": "katie",
      "helpful_votes": 3,
      "publication_date": 20180703
    },
    {
      "title": "Good product",
      "text": "I’ve had this microwave about 4 months now and never had any issues with it. I don’t even have to warm my food up that much longer to get it hot. Overall happy with purchase and it looks super cute and retro!",
      "rating": 5.0,
      "verified": true,
      "author": "Christale",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Broken one second out of the box",
      "text": "Right out of the box this thing had a chip of metal just flake off. Doesnt seem like it will work well or for long :( but its a cute color, haha",
      "rating": 2.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Stylish and Fun Piece",
      "text": "Cute and stylish for us who like to stand out and value every item in our home, doesn’t bother me it’s only 700watts just cool your stuff longer - guesstimate like we do anyway. Style rules when you’re wanting to purchase this !",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Cooks fine. Style is great",
      "text": "Works really well for a smaller oven. Cooks fine. Style is great. Small in size so fits in tight places. If you have a small place and like the retro style I would recommend this oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "I love the energy efficient features",
      "text": "I love the energy efficient features. It's easy to use, and doesn't have all those extra buttons that I never use. My biggest plates fit in the microwave, but are too big to spin around.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Good micro. And cute",
      "text": "It’s a good microwave. Takes a little longer than other to heat up but does the job. I love that it is energy saving and turns off when not in use.",
      "rating": 4.0,
      "verified": true,
      "author": "PV",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "I love it",
      "text": "Go with cute when you can! It’s not just an appliance it’s decorative too!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Great Mint Microwave!",
      "text": "I’m very happy with my purchase for the most part. I love the color of this microwave & it works well! The only thing that I wish was different is the clock. On the display picture it shows a clock but the actual microwave doesn’t have a clock.",
      "rating": 4.0,
      "verified": true,
      "author": "Anni",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Love it",
      "text": "Absolutely love it. The only thing I can say that's wrong is that when you hit the power button you have to press it 2 or 3 times for it to actually turn on. But aside from that and the turn table inside seems to be very weak. But it gets the job done and love the simplicity of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Skeen",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "It takes 20 years to heat something that should only take 1 minute!!",
      "text": "The WORST EVER!! It takes 20 minutes to head up something that normally would take 1 minute, no exaggeration! Everyone that uses it immediately tell me it belongs in the trash!! Worst purchase ever!! Don’t waste your money it’s nice to look at PERIOD.",
      "rating": 1.0,
      "verified": true,
      "author": "michelle deshazo",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "50’s mint",
      "text": "The United States post office DROPPED this package I had to be refunded and purchased another - womp womp but its light weight and gorgeous",
      "rating": 1.0,
      "verified": true,
      "author": "Exodus",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "straight up piece of jUNK",
      "text": "Got it home, set it up. IT DOES NOT HEAT.!!!! Now I have to box it up and send it back. Won't buy this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "Pandora",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "WHEN you use this item too much it overheats and ...",
      "text": "WHEN you use this item too much it overheats and won’t turn on for a little while. Very tiny and cute color but not worth the stress of It breaking",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180429
    },
    {
      "title": "Love the eco feature",
      "text": "This microwave replaced my name brand older model that was bigger. I wanted a smaller model. This particular one is actually less powerful than my old one, technically, but heats food up faster and more efficiently. Love the eco feature. LOOKS SUPER CUTE.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Simpson",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Poorly made, dangerous and irresponsibly sold",
      "text": "After 9 months of light use the table shattered into a pile of glass splinters. This happened during a simple bag of microwave popcorn. No unusual usage up to and including this incident. Poorly made, dangerous and irresponsibly sold. Amazon was eventually willing to ship a replacement plate.",
      "rating": 3.0,
      "verified": true,
      "author": "mfk",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Be careful when opening, glass tray that sits inside ...",
      "text": "Be careful when opening, glass tray that sits inside isn't packed well and fell out and shattered while opening the box. Cute, but doesn't have a lot of power, usually have to cook everything a few minutes longer then normal. Very compact.",
      "rating": 2.0,
      "verified": true,
      "author": "Chari Bird",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Absolutely love!!",
      "text": "Absolutely love!!! Looks so great in my kitchen! It's small wich is exactly what I wanted ! Takes up minimal counter space and actually looks great on the counter !!!! LOVE!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "L_Drizzi",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Low quality",
      "text": "Its a very attractive microwave tht is very underpowered and doesn’t work that great. The quality is low",
      "rating": 1.0,
      "verified": true,
      "author": "Christian Grosjean",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Do not Buy",
      "text": "My microwave was properly set up, plugged directly into the outlet and the circuit board over heated and malfunctioned without even cooking anything!! Thank god it didn't catch on fire and burn down my whole apartment!",
      "rating": 1.0,
      "verified": true,
      "author": "Brigitte",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Takes ages to heat",
      "text": "I can appreciate the energy saving part of turning off after use, but this thing takes AGES to actually heat things up and heat them evenly. Then when it does decide to work, it over heats... Too much of a puzzle for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Arryn",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Great deal!",
      "text": "Love that it has to be turned on instead of vampyring energy all day! Very cute retro look, and works excellently",
      "rating": 5.0,
      "verified": true,
      "author": "Faith R.",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Cute, put kinda cheapy.",
      "text": "Cute, & it serves its purpose, but cheap in terms of the knobs & handles. Some kind of plastic.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephani",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Wonderful quality",
      "text": "Attractive, durable, not powerful but good, much better than a larger monstrosity",
      "rating": 5.0,
      "verified": true,
      "author": "Carol w duff",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Love this!",
      "text": "Love this. A really great addition to my kitchen. A fun Retro look and works great. I originally thought it might be too small, but it takes a regular sized plate with no problems. I would get another in a heartbeat. Great shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "LiteraryLady",
      "helpful_votes": 0,
      "publication_date": 20161229
    }
  ],
  "product_meta": {
    "title": "Daewoo KOR-7LREM Retro Countertop Microwave Oven 0.7 Cu. Ft., 700W | Mint Green",
    "description": "Color:MintDaewoo’s retro series 0.7 cu. Ft 700W microwave lets you have a vintage aesthetic while keeping modern conveniences. With 5 power levels and 5 Auto-Cook options to reheat and cook various foods at, this mini microwave packs a mighty punch. The exclusive concave reflex system (C.R.S) cooks your food faster and more evenly than a traditional microwave. Worry less about space with the recessed turntable, designed to have more room than the average compact microwave. The child lock safety function gives you peace of mind by keeping Curious fingers at bay. Spend less time thawing with the 2-way defrost that defrosts your frozen foods by weight and time. The zero on energy saving function lets you have a small footprint on both your counter space and in energy consumption. With more color options in white and Red, stylize your kitchen with daewoo’s retro microwaves.",
    "rating": 4.1,
    "feature_bullets": [
      "Included Components: User Manual",
      "Container QTY: 40ft HQ"
    ],
    "specifications": {
      "Product Dimensions": "12.7 x 17.6 x 10.6 inches",
      "Item Weight": "23.4 pounds",
      "Manufacturer": "Daewoo",
      "ASIN": "B01EZB7D2M",
      "Item model number": "KOR-7LREM",
      "Customer Reviews": "4.1 out of 5 stars1,092 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#42,565 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 2, 2016"
    },
    "categories": [
      "Microwave Ovens",
      "Small Appliances",
      "Home & Kitchen",
      "Countertop Microwave Ovens",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}