{
  "website_summaries": [
    {
      "verdict": "The superior noise-cancelling capability of these headphones will shock just about anyone. While expensive, we think they're worth the cost.",
      "pros": [
        "While the battery will last 20 hours in wireless mode, the headphones also come with a cord for more conservative energy use"
      ],
      "cons": [
        "Expensive",
        "The noise-cancelling mode gave some testers a headache"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Bluetooth meets best-in-class noise canceling: the Bose QuietComfort 35 is the ultimate noise canceling  wireless headphone you can buy right now.",
      "pros": [
        "The Bose QuietComfort 35 combines top-of-the-line active-noise canceling with wireless Bluetooth operation in an extra-comfortable, fold-up design",
        "The sound is excellent for Bluetooth, and it doubles as a great headset for phone calls",
        "Works in wired mode with included cord if battery dies"
      ],
      "cons": [
        "Battery isn't user-replaceable, and the headphone is heavier than the QuietComfort 25"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 9.0,
        "Sound": 9.0,
        "Value": 8.0
      },
      "publication_date": 20160619,
      "rating": 8.8,
      "source": "cnet"
    },
    {
      "verdict": "The Bose QuietComfort 35 headphones continue to push the industry's best noise cancellation to new limits—and now they do so without wires.",
      "pros": [
        "Best noise cancellation on the market",
        "Balanced and powerful audio",
        "Can function wired or wireless"
      ],
      "cons": [
        "Cable has no inline remote control",
        "DSP has a major impact on the sound signature in terms of EQ sculpting and dynamics"
      ],
      "aspects": {},
      "publication_date": 20160608,
      "rating": 9.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bose Customer Service doesn't resolve issues, but Amazon does",
      "text": "I've now had 2 of these break in less than a year. On the first one, the sound stopped working on one side. On the second one, the battery suddenly got very warm and the unit wouldn't charge anymore. I was traveling both times, and Bose's options were abysmal for helping me out; I could wait weeks and weeks (hard to do when traveling) and have them receive my old ones and repair them, and ship them back. They wouldn't cross ship or allow me to return at a store, despite being under warranty. TL;DR -- the warranty has had a major downgrade compared to past products.",
      "rating": 1.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 239,
      "publication_date": 20170503
    },
    {
      "title": "Couldn't survive without them.",
      "text": "Such a painful price ticket, worth every single penny. I fly constantly. With or without music or movies, they are awesome. Plus, it drowns out the guy next to you who won't stop hitting on you, and the babies behind you whose parents should be buying everyone vodka for listening to their child, who should sit in the back, babies like it better back there. Don't get me wrong, babies need to fly too, but if you owned these, you wouldn't have to listen to it. You don't realize how loud a plane is until you have these bad boys on!! Get the silver, it ages better. They travel easy, and they are super comfy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lividoll",
      "helpful_votes": 70,
      "publication_date": 20170617
    },
    {
      "title": "Power Switch Broke and Bose will not Fix VERY COMMON ISSUE!!",
      "text": "I bought these 2 years ago. Very little usage as I only use them when flying which is about 3 times per year. So yes, 6 times and I am VERY gentle with how I handle them. The power switch broke and apparently Bose will not fix it or send a replacement part. This switch is a cheap plastic that cost about 1 cent to manufacture...please send a me a replacement!! I'll even pay shipping!!",
      "rating": 1.0,
      "verified": true,
      "author": "John Benkovic",
      "helpful_votes": 7,
      "publication_date": 20180930
    },
    {
      "title": "buy something else, wired preferrably",
      "text": "Frankly don't buy this headset if you're going to use in Windows 10. It has constant hissing like a cheap RF wireless set from the 90s. Extremely disappointed with my expensive purchase. When trying to use it for video conferencing it will sometime result in very loud static noise being sent instead of your voice, so terrible for conferencing. And yes I've got it updated to the latest firmware. The one thing they're good at is cancelling out ambiant sound. But again it just doesn't work well at all when paired to a computer. Must only be good with iPhones...",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 6,
      "publication_date": 20170505
    },
    {
      "title": "Sadly, these headphones have random bouts of stuttering and cutting out. :(",
      "text": "I've had these headphones for nearly 10 months, and when they work, they're fine. Unfortunately, they do not always work as they should. Considering they're $350, I would expect their price to match their functionality, but that is unfortunately not the case. It's not uncommon for them to randomly stutter or intermittently cut out. One time it even blasted a shrill screeching tone in my ear — that was pretty unpleasant. Compounding the issue is that Bose offers no real technical support or path of recourse, which is pretty astounding considering how much these headphones cost. I probably would not buy these again.",
      "rating": 2.0,
      "verified": true,
      "author": "CL",
      "helpful_votes": 6,
      "publication_date": 20180209
    },
    {
      "title": "Listen to the bad reviews. Do Not Buy These!",
      "text": "The good reviews outweigh the bad, but listen to the bad. I never write reviews but the frustration with customer support and their unwillingness to exchange a known broken product really upset my wife and I. My wife started having problems with these before her warranty ran out. They kept turning on by themselves. After over a year of not being able to use them and researching the problem Bose finally admitted to there being an issue. Tech support told her to update the firmware. After less than a month the problem started again.",
      "rating": 1.0,
      "verified": true,
      "author": "Rivera",
      "helpful_votes": 4,
      "publication_date": 20190411
    },
    {
      "title": "Great for Students!",
      "text": "These headphones are amazing! They are a little pricey (hence the 4 stars) but the noise cancellation is phenomenal. It cancels out fan/furnace noise, machine humming, etc really well, but peoples voices still cut through. The sound is excellent as well, very clear and sharp, but the bass isnt very intense. My phone has a bass boost built into the music app and that helped a lot. I highly recommend these to students! Update 10/23/17: I have since used these on a plane, and while listening to pop/rock I couldn't hear the engine drone at all!",
      "rating": 4.0,
      "verified": true,
      "author": "W.",
      "helpful_votes": 5,
      "publication_date": 20170521
    },
    {
      "title": "They started off good but over time became unusably frustarting",
      "text": "There are a number of fundamental flaws with this product that make it extremly frustrating. 1. No option to only connect to 1 bluetooth source at a time. When you try passing audio from two sources it becomes a garbled mess so I am not sure why Bose did this. 2. Disable the sound when you connect and disconnect. The sound is way way louder than other sounds coming from headset and gives me tinnitus it is so loud. 3. Over the months ALL audio has become distorted and unlistenable. I have no idea why this happened but today the headphones are unusable. They lasted around 6 months. 600 dollars a year for headphones is too much for me.",
      "rating": 1.0,
      "verified": true,
      "author": "asdasdasd",
      "helpful_votes": 2,
      "publication_date": 20180829
    },
    {
      "title": "Great sounding headphones, while they last...",
      "text": "I've owned these for almost two years but only use them occasionally at my desk. They've worked great, but last week they started powering on by themselves. I cannot turn them off anymore. This is a known problem (search for \"QC 35-I is Turning On By Itself\") and it is a hardware problem (a software update can't fix it). Furthermore, the Bose warranty only covers the headphones for 1 year, so I would need to shell out another $300 to replace these (Bose will not repair them). It's too bad because they sound great. If you're going to buy these, buy the extended warranty... (or buy a higher quality product).",
      "rating": 1.0,
      "verified": true,
      "author": "James Hudon",
      "helpful_votes": 4,
      "publication_date": 20190627
    },
    {
      "title": "Victim of the infamous power issue",
      "text": "This product is ridiculous. I was on a business calls and out of nowhere, my call automatically connected to these headphones. As to my astonishment, I checked the headphones that were on their case and the power switch was positioned to the Off side. I then found that the power indicator was lighting green. This made these headphones totally useless as I’m now having to monitor whenever my Bluetooth is on just to ensure my call is not abruptly cut off. Now when I want to use my headphones, they require a brand new charge since they never F**king turn off. Thanks Bose, you are now the Fyre Festival of headphones, or the Anthem of video games.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 2,
      "publication_date": 20190413
    },
    {
      "title": "These headphones are the Best!!",
      "text": "These headphones are the Best!!!! Cancel out noise, clear, can move around with 'no strings attached'! Why did I wait sooo long to get them!!!! Can sit back or work on preparing dinner as I listen my latest Audible book...no distrubance to others around and no worry about the other people, pets, etc. disturbing me. Thanks, Bose for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue Bowden",
      "helpful_votes": 5,
      "publication_date": 20170530
    },
    {
      "title": "... let me say that the sound quality is indeed awesome. BUT These headphones keep having a gap in ...",
      "text": "First of all let me say that the sound quality is indeed awesome. BUT These headphones keep having a gap in playing my music when connected to Bluetooth even when my phone is right next to them. I don't have this problem with any other Bluetooth headphones. Both phone and headphones are fully charged. At first I thought it was a one off thing but it keeps happening. For this price you don't expect to have to deal with issues and can't accept issues like these! You expect a product that works out of the box and you don't have to spend time on trying to get a fix for ! Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 29,
      "publication_date": 20170126
    },
    {
      "title": "Product doesn't work.",
      "text": "Simply doesn't work. I have an iPhone SE and a 15 inch MacBook Pro from 2014. After spending 30 minutes going through the process of updating the firmware and app version my headphones finally connected to my laptop. The sound cuts out every 15-30 seconds, about every 1 minute there is a crackling and popping sound. Read this 20 page deep forum post with others having the same problem. To find the thread search google for: \"QC35 Bluetooth Stuttering/Drop-outs\" I'm very disappointed and will have to keep searching for a good pair of noise cancelling bluetooth headphones.",
      "rating": 1.0,
      "verified": true,
      "author": "Max Bigras",
      "helpful_votes": 4,
      "publication_date": 20171103
    },
    {
      "title": "Worked Great till the On-Off Switch Broke",
      "text": "Loads of glowing reviews on this, and I would be one of them except for the fact the little toggle switch that turns the headphones off and on and also tells them to connect to the bluetooth broke. The toggle at rest sits in a middle position. Pushing it right, against a tiny internal spring, turns it on and tells it to connect. Pushing it left, against a different spring, turns it off. There's no longer any resistance pushing it left and thus it's impossible to turn it off. Had it about a year and seven months, using it maybe average of 4 hours a week. Now I'll start looking at other brands.",
      "rating": 2.0,
      "verified": true,
      "author": "Bobbobkk",
      "helpful_votes": 3,
      "publication_date": 20180112
    },
    {
      "title": "Love Bose, but these might not be ready for prime time.",
      "text": "I might update the review after more time, but so far Id have to say these are not worth the 350 bucks. The issue is the paring, somethings pair ok others not so much. I own three pairs of the wired QC2 and QC15 Bose headsets (for drowning our crying babies on planes) that I started buying ten to fifteen years ago, plus I own two of the bose aviation headsets, so I always buy bose and respect their products. These seem flaky and seem to be in my mind something that will be updated and a new version available within a year, I'd wait and wish I had.",
      "rating": 2.0,
      "verified": true,
      "author": "s33flyer",
      "helpful_votes": 5,
      "publication_date": 20170102
    },
    {
      "title": "after researching these headphones I happily made the $350+ (with tax) purchase",
      "text": "I have trouble concentrating both at work and at home (I have semi-loud roommates). So, after researching these headphones I happily made the $350+ (with tax) purchase. Bose is known for their quality products and these headphones are no exception. However, after four uses the headphones would no longer power on properly. I will not be buying Bose products in the future. I expect better from the brand, especially when I spend just under $400 dollars for their product. You would expect it to work at least a few years before malfunctioning.",
      "rating": 2.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 7,
      "publication_date": 20160818
    },
    {
      "title": "Power switch issue...",
      "text": "They are great while they last, but the power switch doesn't last very long and then you won't be able to turn it off anymore, (draining the battery in the headset all the time, and being paired with your phone when you are trying to use your phone for something else...) There are 100 pages on Bose's forum complaining about it. I got these to replace a 25 year old set of Radio Shack brand wireless (900 MHz) headphones that I could no longer buy replacement batteries for, and while I was initially concerned that the battery in this wasn't replaceable, the power switch died way before the battery did.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Denton",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Can't practically be used with video",
      "text": "These headphones have great qualities but lack of APT-X support (even via update) is a staggering oversight. For those that don't know what this is, it's the technology that makes video playback sync with sound, to avoid seeing people's lips move but not hearing them until about 1 full second later. Google \"Quiet Comfort 35 apt-x\" and you'll see forums littered with complaints about this embarrassing omission. Anyway, they're totally fine if you never plan to watch a video on your phone, tablet, computer, or television while using them.",
      "rating": 2.0,
      "verified": true,
      "author": "Jimmy John",
      "helpful_votes": 11,
      "publication_date": 20170821
    },
    {
      "title": "Bought in 2016 - still going strong!",
      "text": "I was just thinking how many trips and adventures these headphones have endured and still work perfectly. I have replaced the ear foam on both sides but have otherwise done nothing for maintenance or repair. The earphones still hold a long battery charge and pair quickly to all my devices. The sound quality is Bose - very crisp and clear. I have noted that some deep low range can have some distortion but the sound delivery is otherwise quite clear. I wuld definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Loren Parker",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Stay away. All headphones are defective.",
      "text": "Headphones have a defective power switch and it is just a matter of time when it will break. If you are lucky it will break within the first year and you can replace it for free. If not, Bose will offer you a new piece as a replacement for \"just\" $260 plus tax. You can check the endless thread on Bose support website regarding the issue. Definitely will not recommend Bose products to anyone going forward! They know that all pieces have the same defect but instead of fixing it decided just to monetize the issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 2,
      "publication_date": 20190618
    },
    {
      "title": "Great headphones, but beware",
      "text": "According to a recent lawsuit, the phone app (required to access certain features) phones home information about your personal listening habits. Not to be content to just making a great consumer audio product, Bose executive management decided to sell out their customers' trust.",
      "rating": 1.0,
      "verified": true,
      "author": "Marsh Ray",
      "helpful_votes": 5,
      "publication_date": 20170825
    },
    {
      "title": "Great Bluetooth Headphones for Daily Use",
      "text": "I was initially skeptical about spending $350 on a pair of headphones, but the QC35's are worth every penny. I use them every weekday, probably for the majority of the day: during my ferry boat commute, on the muni train, and at my desk. They're extremely comfortable, do a great job of removing repetitive noise, and have a great wireless Bluetooth experience. The headphones are paired with my iPhone and my Apple Macbook laptop. I can easily pause playback on my phone and then start playback on my laptop without having to switch any settings on the headphones or devices; it truly just works. I can't recommend these headphones strongly enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Kidder",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Over priced, poor quality, customer service couldn’t care less - what’s not to like.",
      "text": "Case is cheap, very poor quality. Zipper failure in first week of use. Customer service is atrocious...couldn’t care less",
      "rating": 2.0,
      "verified": true,
      "author": "FireRock",
      "helpful_votes": 3,
      "publication_date": 20190629
    },
    {
      "title": "Absolutely a fantastic product.",
      "text": "Absolutely a fantastic product. I honestly do not understand any of the negative feedback provided in other reviews. High quality product from how it looks, feels and operates. Noise reduction is the best I have ever experienced. Sound quality is top notch for both voice and music. Bluetooth reception is excellent - no disruption or crackle - maintains connection for well over 50 feet. Works very well for taking voice calls with microphone picking up normal speaking levels and able to clearly hear self in the NC earphones. Highly recommend this product. Bose hit a homer with this this one.",
      "rating": 5.0,
      "verified": true,
      "author": "JJS",
      "helpful_votes": 2,
      "publication_date": 20170322
    },
    {
      "title": "Great sound, comfortable, and smart",
      "text": "Since I have these, I tend to run around with them on my neck all day in the office. So much more convenient than the cable version I had before. And also smart bluetooth technology and a well made app to control it / install updates. I was impressed when it effortlessly connected to my iPhone and MacBook simultaneously and switched between playing Spotify from my Mac and receiving calls from my phone. Also nice: if the incoming number is recognized, the headphones tell you \"Call from John Smith\" instead of just ringing. Similarly, it tells you the battery charge when you switch it on, which device it connected to etc. Really well though through.",
      "rating": 5.0,
      "verified": true,
      "author": "Shlomo Konwisser",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "Fails after two years and there is a limited Bose warranty",
      "text": "Do not purchase, this unit failed after two years of light use. The main problem is the unit loses the ability to turn off. It will consistently turn back on, so you can never turn it off. It is a common issue after researching online. Unfortunately, Bose doesn't stand behind their products anymore and give you a small discount on purchasing a replacement product - even though this issue is a failure of the product for this version. Just be careful, we are talking our next purchase elsewhere unfortunately.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Very nice quality headphones with stellar noise canceling capabilities",
      "text": "Very nice quality headphones with stellar noise canceling capabilities. Having tried numerous brands the bose continue to impress and far exceed others. I have issues with the fixed battery and hated having to deal with individual batteries. The charge lasts a very long time so no worries on how long they can last. I really like that they are also wireless and can easily connect to the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "James ",
      "helpful_votes": 4,
      "publication_date": 20170528
    },
    {
      "title": "Love em. Expensive",
      "text": "Love em. Expensive. Originally bought for a noisey apartment. My first blue tooth audio anything. Completely sold on blue tooth for audio. I actively would rather be using these now than tethered. Latency is fine for anything not really all that serious........ Very nice audio quality. However I am not an audiophile. Apple earbuds and streaming is good enough. Built very well and will be lasting a long while. Tethering to apple products is pretty dang solid. Not foolproof but solid. I wish we could tether to say 5 devices.",
      "rating": 5.0,
      "verified": true,
      "author": "sleeping_lights_on",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Lasted only 2 years !!",
      "text": "Very disappointed with these headphones. The on/off switch stopped working after only 2 years of minimal use. Switch will be in the ON position and the headphones OFF and vice versa (switch in the OFF position and headphones ON) . This defect drains the battery pretty quickly. I used to have the wired version but now I am no longer purchasing any Bose products. Will switch to Sony for sure !! Been having the wireless bass boost headphones and they have lasted 4 years so far with ZERO issues.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Aragon",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Great software",
      "text": "Great headphones. Too bad they spy on you. The software really sets these headphones apart (not the sound quality, for that you should go for the seinheissers) It's really simple to connect multiple devices. Unfortunately because of the bluetooth delay (certain apps are worse than others, I'm looking at you HBO Now) I'm forced to plug the 3.5mm connection in more often than I'd like. It's also a shame that you can't control the level of noise cancelling without the app (which is only a recent addition to the software).",
      "rating": 4.0,
      "verified": true,
      "author": "Ashish",
      "helpful_votes": 2,
      "publication_date": 20170717
    },
    {
      "title": "Bluetooth connection issues render product unuseable",
      "text": "Owned a set for about a year now. Good for noise cancellation on plane rides. Work fine with iPhone. But Bluetooth connection issues make the headset impossible to use with my Mac. Audio stuttering, skipping, drops, and loss of connection (while sitting in front of Mac!). Absolutely infuriating in a $350 product. I've wasted hours searching Bose / Apple forums for a solution. I've owned plenty of Bose products, aviation headsets and other noise canceling headsets, all great quality products. Which is why I am surprised, these are, politely put, utter garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "L. C.",
      "helpful_votes": 3,
      "publication_date": 20170918
    },
    {
      "title": "Costly but effective",
      "text": "They aren't my favorite music phones but the noise cancellation is extremely effective and the sound quality is very good. No problems with Bluetooth pairing - there are voice prompts. Although I can't usually wear large, over-the-ear headphones for long periods of time, these are surprisingly comfortable. They are expensive so I sure hope they last a long time! If the don't, I'll revisit this review. So far, so good!",
      "rating": 5.0,
      "verified": true,
      "author": "factoryguy",
      "helpful_votes": 3,
      "publication_date": 20170620
    },
    {
      "title": "They are both fantastic and do the job amazingly well",
      "text": "I have both the QC20 and this one. They are both fantastic and do the job amazingly well. QC20 form factor allows you to sleep with it on a bed and with a neck pillow on the plan. QC35 is great for the wireless feature with a wire option for use on an airplane. Note that there is no way to have bluetooth and Active Noise Canceling (ANC) off. If you use wireless, ANC will have to be on as well. The only way to use the headphones without ANC is to plug it in via the wire.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Tse",
      "helpful_votes": 3,
      "publication_date": 20170404
    },
    {
      "title": "Worth every penny",
      "text": "Excellent sound, as you would expect from any Bose product. Comfortable to wear, doesn't pinch ears or press glasses into side of head. Worn on international flights to help block out sounds, connected to in-flight entertainment without issue. Connects to my iPhone and iPad without issue. Quick charging, battery lasts a good long time. Secure on your head, so they can be used while gardening or using an elliptical. I've found the mic picks up a little more background noise than a standard headphone mic; but not too bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Chasidy Simpson",
      "helpful_votes": 3,
      "publication_date": 20170718
    },
    {
      "title": "After 8 months of extensive use (6 days a week ...",
      "text": "After 8 months of extensive use (6 days a week, 10 hours a day, removed from head about 10x a day) the left ear now crackles as it does in and out of sound. It appears to be a loose wire. I had a previous QC headset. I fell off the back of a truck and the right ear whacked the asphalt, but it was the left ear that had the exact same issue I’m having with the replacement QC headset. The replacement was brand new, not refurbished, and never dropped.",
      "rating": 4.0,
      "verified": true,
      "author": "Sir Richard Dannatt",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Very effective wireless headphone",
      "text": "Bought this for my older brother who has hearing issues from military service. He says that it is the best gift i have ever given him. And he is in his 70s. He uses it with his cell phone and the tv etc. He loves that it is wireless. It has made his communication with others to be so easy. and mobile within his house and yard. Before this gift he would only text on his mobile phone because he could not hear the caller. Now he can speak directly and hear me when using certain electronic devices.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcy Silk",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "I'm now able to keep my sanity",
      "text": "I should have bought this sooner! My next door neighbor comes from hell and likes his music and bass loud. Moving out is not an option, and being a PhD student who is stressed out and needs quiet time at home, I chose to buy this pair of headphones in desperation of keeping my sanity. I have tested this for more than one week, and I'm surprised that I could barely hear my obnoxious neighbor with the right kind of music. Of course it's no miracle since it doesn't cancel out all noises, but I'm happy enough with what it can do! Can't recommend this enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Jing Chen",
      "helpful_votes": 2,
      "publication_date": 20170121
    },
    {
      "title": "Perfect!",
      "text": "Why didn't I buy these sooner?! I absolutely love these. I use them at the office, home, and the gym. Beautiful sound. I usually pair with a white noise app on my phone or music app. So comfortable. I was wary of their size but I really like how they fit. The wireless factor can't be beat. I've also paired these with my smart tv (using Bluetooth adaptor on TV) and can listen/watch TV without hearing neighbors, etc. Frankly, I thought it was ridiculous to pay hundreds of dollars for headphones, but I'm a total convert. Given how much I use these, I wouldn't hesitate to buy another pair if/when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Nora A. Murphy",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "... a little more than a year rendering the earphones useless. A product that costs this much should be ...",
      "text": "The on off switch broke in a little more than a year rendering the earphones useless. A product that costs this much should be made much more durable and last more than a year. The sound quality and noise canceling is excellent but the product is cheaply made. BUYER BEWARE!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Richard J, Baker",
      "helpful_votes": 4,
      "publication_date": 20171118
    },
    {
      "title": "QC35 are phenomenal",
      "text": "I bought these as a Christmas gift for my daughter, who rides the train to/from work an hour each way. She loves them! I tried them on Christmas Day and they are the best I've ever heard. I have the old original Bose noise cancelling headphones and I love them, but I have upgraded to the new QC35. Pricey but worth it. And I love Bose for their customer care; none better. No I don't work for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Hirkimer Thudpucker",
      "helpful_votes": 4,
      "publication_date": 20170524
    },
    {
      "title": "Excellent noise canceling",
      "text": "Excellent noise canceling. The sound quality is bland. these sound like low budget headphones. I always knew Bose was terrible for hi/fi as they are the dsp wizards fooling your ears with fancy digital algorithms to get decent sound from a potato, so I always skipped them. But for ANC headphones there's no choice with their patents, It was these guys or Sony and people say the Sonys headband cracks so I passed and got these. Anyways TLDR; great noise canceling but sound like a potato. Oh a plus they are light great battery life, and have cool digital features like announcing the bluetooth device albiet I just care about sound.",
      "rating": 4.0,
      "verified": true,
      "author": "Professor",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Work great. Big issue",
      "text": "Work great. Big issue: the external wired interface uses the tiny earphone plug, not the standard 3.5mm plug. You can't just buy a simple six foot extension plug-to-plug, you have to use the provided normal to small plug cable and a male-female extension. If you lose or forget the included cable, it will be much harder to find a local replacement. Bad Bose, you could have used a standard jack. It's also a very noisy headset for \"noise cancelling\". When I first put them on they repeatedly and continually kept telling me it was \"ready to pair\" and I must \"enable the bluetooth on my device\". This went on for a very long time until it gave up.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Six Stars! The best headphones ever !!",
      "text": "Over the years I have owned Sennheiser, Klipsch, Etymonic, SONY, etc., headphones and earbuds. I have never had headphones that were this good. The sound far surpasses any I've ever had. Bose's wireless technology and battery life are significantly better than any others that I have used. The weight, noise cancellation, comfort, ventilation, are unequaled. I've never paid this much for headphones, I wouldn't hesitate to buy these Bose QuietComfort 35 Wireless headphones again. They are worth it. Thank you Bose!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Hanks",
      "helpful_votes": 2,
      "publication_date": 20170318
    },
    {
      "title": "Indispensable for travel and tasks that involve a lot of noise",
      "text": "Originally I bought these headphones for the regular air travel that I do. They did not disappoint as the noise canceling is top notch as well as volume, sound quality, and consistent connectivity. Of all the bluetooth noise canceling headphones I've tried, these are the most comfortable and lightest. I have also found that they work well when doing chores such as lawn mowing and snow blowing. They aren't advertised as hearing protection but with their noise canceling abilities they did a great job in protecting my hearing during these kind of activities. The fact that they are wireless and I can listen to music is also a plus!",
      "rating": 5.0,
      "verified": true,
      "author": "AR",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Worked great until FW upgrade and switch failed",
      "text": "Revise my rating. After talking to Bose customer service, was offered a replacement. Although this product has some issues, their customer service is excellent. Thanks I had this for 2 years and it worked wonderfully in airplane. However, after upgrading firmware, the noise reducing has almost gone, now I can hear all sounds from outside loud and clear. Plus, the on/off switch went bad lately, it will turn on when the switch is at off position. This drain battery, also cause me to miss some calls from my cell phone since the cell phone is connected to the headphone, when I pick up a call,I cannot hear from my cell as it's connected to a headphone that's turned off.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Good sound Bluetooth is crap!",
      "text": "The only real complaint I have with these is that the bluetooth range is pathetic!!!!!! If you connect to your phone and go 5 feet away and put a wall between you, you can forget about it. I have a pair of jaybird ear buds that I can go to all 3 floors of my house without issue. So as far as comfort and sound A+ but as far as bluetooth capability goes they just suck! Very disappointing when you consider the price and name behind them.",
      "rating": 3.0,
      "verified": true,
      "author": "JBird",
      "helpful_votes": 4,
      "publication_date": 20170519
    },
    {
      "title": "Broke two months after warranty expired",
      "text": "The on/off switch suddenly stopped working. I can't switch it all the the way off now. Way too expensive to last for 14 months and then break. UPDATE: Contacted customer service and they're replacing it with the newer model despite it's being past warranty. I was amazed until I read other reviews and saw that this problem is happening to lots of people. I'd raise my rating to five (I had it at one before), but there are still a couple design annoyances. But generally it's worked great for my purposes. I put in earplugs and these headphones with a white noise application and can concentrate even in fairly loud places.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Better than I expected",
      "text": "The noise cancellation seems to work at least as well as my older wired Bose headphones. These are my first wireless headphones. I use them pretty much all day at work (cubicle land) and I only charge them every few days. It seems like a lot of features you wouldn't think about before purchasing just do the right thing. Bluetooth pairing with multiple hosts works like a dream.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Scherf",
      "helpful_votes": 3,
      "publication_date": 20170517
    },
    {
      "title": "Great headphones. I'm leery of giving it 5 stars ...",
      "text": "Great headphones. I'm leery of giving it 5 stars because the longevity of the Bose QC headphones is questionable. This is my 3rd pair in 10 years that needed to be replaced. Two of the three, Bose offered a significant discount to make the replacement less painful. But in my opinion, the headphones should last more than a few years given the price and the fact they are not every day headphones like a pair of ear buds. I use these for air travel and when I need to check out. The sound is awesome though and the bluetooth connectivity to my laptop or phone works very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark in VT",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "I never believed the hype before!",
      "text": "I always considered Bose overhyped and overpriced. However, I've recently started using the QC 35 and a pair of QC 25 (wired version) at work and I have to say the noise canceling capabilities are nothing short of amazing. I'm not an audiophile, so I can't really say much about how the sound quality compares to other headphones, but they do sound very good and with the noise cancellation, I can have the volume at a reasonable level and enjoy what I'm listening to so much more. Even now, I'd say this are a splurge item, but if you can afford them, they are definitely worth the $$!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Taylor",
      "helpful_votes": 2,
      "publication_date": 20170404
    },
    {
      "title": "It wont turn off",
      "text": "Despite the noise cancellation and sound quality, i wouldn't recommend this because product is not durable. After light occasional use on a few plane trips, and pretty much mint looking condition, the headphones can no longer be turned off. When flipping the power switch to Off position, headphones stay off for about 20 seconds, then power themselves back On, essentially draining the battery while not being used. For an expensive pair of headsets, I expect better durability, especially considering the light use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190529
    },
    {
      "title": "Honest and Thorough Review/Guide",
      "text": "Sound for movies and sports game - 5 (out of 5) Sound for pop music/heavy bass songs- 5 Sound for all other music - 3 (leaves me wanting more on the lows/mids) Comfort - 5 Battery - 5 Controls/Button/Accesibility - 3 (everything you inapp should be accesible with buttons like on the sony mdr1000x) Connectivity Speed - 5 Connectivity Issues - 2 (it randomly thinks my Amazon Fire HD 10 Tablet is getting a phone call and it shuts off audio, wonder who's issue this is, I'd imagine it's not Amazon's) Overall Rating - 3.9",
      "rating": 3.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "What headphones are supposed to be",
      "text": "Perfection in every way. The sound is amazing, you hear every sound so clearly and with dimension. The noise cancellation is great. It's also very comfortable; I have recurring jaw pain and usually over ear head phones press right on my trigger point, but these are so gentle and comfortable that they don't bother my jaw at all. The Bluetooth is also perfect, I left my phone upstairs and came downstairs with no fault in sound. Truly excellent headphones. I'm going to buy another pair for my husband. I recently had the new sennheiser momentum Bluetooth noise cancelling which were horrible compared to these.",
      "rating": 5.0,
      "verified": true,
      "author": "ncmot",
      "helpful_votes": 3,
      "publication_date": 20170528
    },
    {
      "title": "Great for tuning out the world and kicking back with some tunes",
      "text": "Pros : Wireless, I like the sound, software can limit max volume if so desired, speaks when first turned on in wireless mode . . . power level . . . seeking for a bluetooth source ( I have 4 it remembers, not sure if it stores more ) Cons : my ears do get warm",
      "rating": 4.0,
      "verified": true,
      "author": "q256",
      "helpful_votes": 3,
      "publication_date": 20170519
    },
    {
      "title": "Love this headset!",
      "text": "I have only had this headset for a few days, but so far, so good. The sound is amazing and the NC feature is pretty sharp as well. I wear this on the train and while it doesn't block all noise, it was amazing when I removed the headset and heard all the noise that I would always hear before! I haven't tried making a call when I have the headset on yet, but from what I was told by co-workers that have this headset, that is another feature that works flawlessly. This headset is not cheap, but hey, its Bose! You get what you pay for",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory R Grunewald",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "A great choice for use on airplanes",
      "text": "Premium product. I bought it for watching movies on the airplane and the combination of the \"over the ear\" style and the noise reduction makes a huge difference on airplanes as it keeps you from having to crank the audio volume to hear it over the constant hum and background noise on the airplane. Leaves you a lot more relaxed by the end of along flight. Can also wear them for just the noise reduction (with no sound piped in) to help you sleep comfortably on the plane. Obviously, they work for more than just using on an airplane, but they are so much nicer than earbuds for that environment.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Friend",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Fabulous Headphones - Highly recommended",
      "text": "The QuitComfort 35 are the best noise cancelling headphones I have ever used. I really enjoy using them in the office as they remove any background noise and can be worn for a long period of time. My only piece of feedback would be that you cannot turn off the noise cancelling, which can be awkward when someone asks you a question. I have to lift the headset as opposed to hitting a button and say \"What?\" They also work well with Dragon Naturally Speaking which is a great benefit.",
      "rating": 5.0,
      "verified": true,
      "author": "Technophobe01",
      "helpful_votes": 4,
      "publication_date": 20160828
    },
    {
      "title": "Noise cancellation works great and it sounds pretty good",
      "text": "Noise cancellation works great and it sounds pretty good. 1 star off because it's Bluetooth is NOT compatible with Windows 7. Stay away if you're using windows 7 and plan on using these headphones as wireless. I got the Bluetooth to work with my windows 7 computer however it's a hassle to connect it every time because you have to un-pair from both your headphones and computer and then re-pair them again and the whole process takes like 3-4 minutes so I just end up using the cable which defeats the purpose of getting Bluetooth \"wireless\" headphones. Feels bad man. =(",
      "rating": 4.0,
      "verified": true,
      "author": "ZidaneLeon",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "No regrets. Helps me decompress and keep my sanity in noisy surroundings",
      "text": "Awesome. Helps me decompress at home when it's noisy inside. It muffles voices and barking dogs. Sound quality is a luxury. No regrets. Easy connection to multiple devices with different platforms and comfortable. When you absolutely need quiet, turn on white noise.",
      "rating": 5.0,
      "verified": true,
      "author": "animalavenger2013",
      "helpful_votes": 3,
      "publication_date": 20170410
    },
    {
      "title": "These are the best headphones on the market.",
      "text": "The comfort level on the ears is beyond anything I have ever tried. Sound quality 10/10, makes everything so much better. The noise cancelling is out of this world. I go to school in NYC, where there is always construction. I was waiting at the bus stop and saw construction in the street (drilling, digging, the works) about 20 feet away from me. I usually take off my headphones before I get on the bus. Before I took them off, I only heard music which was at a moderate level. I took them off and the noise from the construction was so incredibly loud! Love what these headphones can do.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Parekkaden",
      "helpful_votes": 2,
      "publication_date": 20170609
    },
    {
      "title": "Mute the blabber.",
      "text": "Best investment ever for traveling in public (plane, trains and bus). That fantastic person that loves to talk via speaker phone while in a public place? Adios, you will see the gums and lips flapping but will not hear the mindless noise of the conversation. Worth every penny. Long battery life, great comfort and sound wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Really great sounding headphones",
      "text": "Really great sounding headphones! I use them mowing in the summer (and all the time) and they work flawlessly and sound great. Probably not worth the price, but that is what it costs if you want the Bose. I had a nice set of another brand and they had an annoying flutter noise when the blades of the mower were running. They had to be just right on your head to minimize the noise. The Bose DO NOT do that. They are perfect and block the mower noise very well. Great battery life as well. I highly recommend the headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Lewis",
      "helpful_votes": 2,
      "publication_date": 20161203
    },
    {
      "title": "High sound quality, but can break easily",
      "text": "These headphones provide excellent noise canceling and make plane flights far more relaxing for me. They are comfortable for me to wear for hours. However, the on/off switch broke about a month after the one year warranty expired. These are expensive headphones so that was very disappointing. This product earns a solid two stars for it’s high quality functionality but they should have a longer warranty if they’re going to charge over $100 and not use switches that easily break.",
      "rating": 2.0,
      "verified": true,
      "author": "A Shopper",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Great headphones - great sound!",
      "text": "Excellent Headphones. I do not think there are better bluetooth headphones on the market. The noise cancelling is superb, and the highs and lows are fantastic. I've seen a few reviewers comment that the sound was low. There are buttons on the headphones for adjusting the sound, and when turned all the way up I can't believe anyone could bear it - they are quite loud! The bass is great, as is the treble. They are expensive headphones but if you are into music they are worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Fruge",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Fantastic! No comparison.",
      "text": "Possibly the best headphone set I've tried in years. I have gone through dozens, including all the most expensive brands. Nothing compares. — Flawless BlueTooth connection (with audio confirmation of the pairing). — Absolutely stunning noise-cancelling. I know it is Bose's specialty, but this goes beyond all previous experiences: almost incredible. — Good sound quality. — Folds in small, practical carrying box. — Very comfortable to wear and use for hours — The charge lasts FOREVER! This is another impressive feature. Hours and hours without recharging. Exceeds specs. Overall, the best headphone set to come out in years.",
      "rating": 5.0,
      "verified": true,
      "author": "SCC",
      "helpful_votes": 2,
      "publication_date": 20160629
    },
    {
      "title": "Another great over the ear headphone with advancements to technology that actually work",
      "text": "Bose simply makes the best headphones. This being my third over the ear version they just keep getting better. Having previously used models from Parrot which is a technological dream, their quality is spotty. Bose however makes a product that works perfect every time, has the right technology that actually works, and builds a product that stands frequent use while showing little wear. Their carrying case on this model is very well made and as compact as can be. The voice over queues are helpful when the headphones connect to multiple devices and telling you of battery level. The battery level is really outstanding lasting me usually a week with daily use. Comfort and materials are top notch.",
      "rating": 5.0,
      "verified": true,
      "author": "jhelms54",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "IT WONT STAY OFF",
      "text": "they made an update that will make the unit stay on. like it wont be turned off. so it’ll stay empty if you leave it uncharged. tried calling bose but no solution at all. they wanted me to send it over but the fee is almost close to buying a new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Nes Canlas",
      "helpful_votes": 3,
      "publication_date": 20190619
    },
    {
      "title": "the world just goes away",
      "text": "Airplane travel has never been better, but I use these all day long as my bluetooth headsets for my phone. I have a home office and when I put these on every distracting noise my house might product just vanishes. In find these instrumental in getting heads down. And the sound quality - it's amazing. I don't have to crank my headphones to max on the plane any more. I can listen with high quality at a comfortable volume now.",
      "rating": 5.0,
      "verified": true,
      "author": "M. WUNDERLICH",
      "helpful_votes": 2,
      "publication_date": 20170509
    },
    {
      "title": "Very pleased!",
      "text": "This is what you need to get, do not second guess yourself. The sound quality is the best I have ever experienced from a headphone set. I was listening to music last night like it was the first time I listen to that particular piece. Just the noise cancellation itself was worth it, I started to feel more calm and relaxed. One of the best purchases I have ever made.",
      "rating": 5.0,
      "verified": true,
      "author": "5150",
      "helpful_votes": 4,
      "publication_date": 20170601
    },
    {
      "title": "Got a very nice person on the phone",
      "text": "Bought this in December 2016. Had trouble charging it and then the battery died in July 2017. Since you can't replace the battery yourself, we called the customer service. Got a very nice person on the phone, she would call back. But that didn't happen. After I called back again and mentioned that, they promised to exchange the product right away and send me a free label for its return. Took a day to get there and another day to receive the replacement. This one works great. So overall I'm very happy with the product. Would have given it a 5 star if the first one hadn't failed. Seen if this one keeps working.",
      "rating": 4.0,
      "verified": true,
      "author": "FnM",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Quite good;  experiencing frequent disconnects from mac lately",
      "text": "It took a week to get accustomed to the vacuum-like feeling around the ears. The bcq35 isolate background noise much better than irregular sounds such as people talk. Funny enough, you can actually comprehend what people talk better with the headphones on. Lately the headphones keep dropping connection with my 2013 macbook pro. Every 10 or so minutes they would disconnect and usually reconnect after a few seconds. Sometimes I need to reconnect manually. Updating the firmware (which is quite slow: took 30+ minutes) didn't help. It is becoming quite annoying. Thus 3 stars, it would be 4 otherwise.",
      "rating": 3.0,
      "verified": true,
      "author": "Miroslav Ristic",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Not worth the 350$ price tag",
      "text": "The noise cancellation isn't good considering the price, the only sounds that get cancelled are low frequency mild noises, the rest goes almost right trough it. The sidetone \"feature\" when using the microphone only degrades audio quality and amplifies background noise and there is no way to disable it. Firmware updates degrade noise cancellation quality. Tech support is mostly useless. This would all be acceptable if the headphones cost 100$-150$, not 350$",
      "rating": 1.0,
      "verified": true,
      "author": "Eleazar Meza",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Best for travel and work",
      "text": "I owned the QC3 for more than 7 years and used them for travel, at home and in the office. After they finally broke, I was happy that I did not upgrade to QC25 because the Bluetooth / wireless of the QC35 are exactly what I waited for. I LOVE THEM. With the included microphone, they are my most useful tool for daily work. I use them during travel and at the office, for phone calls and to focus on my work. Traveling a lot internationally, they give me the quite I need to sleep at the plane and I don`t need to take care of wires if I stand up and walk. Those are really my always on devices!",
      "rating": 5.0,
      "verified": true,
      "author": "Artaios",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "Quiet, comfort, and wireless, as advertised.",
      "text": "These are everything they're purported to be: well built, extremely comfortable, sound great - awesome full dynamic range - and the noise canceling technology is incredible. I've had them on trains, planes and other places with a droning, hissing background noise and they truly make 80-90% of it disappear. They even work great as headphones and mic for mobile phone calls. The Bluetooth implementation is excellent - they pair instantly with my iPhone, and an incoming call while music is on is handled gracefully and logically. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan B",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Love `em.",
      "text": "Bought these since I like listening to music while I'm at the gym, and for breaks at work to watch shows on my phone. I haven't had the chance to use it at work, but at the gym holy cow. Several people near me on the tread mill and someone 30-40ft away dead lifting and I felt like I was in a sound proof booth. Also, it works great to call people. I didn't know I could use it as a head set to talk on the phone. Everyone I've talked to using them so far has had no complaints of back ground noise it could pick up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarrod",
      "helpful_votes": 4,
      "publication_date": 20160610
    },
    {
      "title": "They've become part of my everyday carry on my daily NYC subway commute and they are great on planes as well",
      "text": "Sound isn't all that exciting. The sound profile is neither reference nor dynamic, just kind of adequate. Where the QB 35's make up ground is in noise canceling quality, style, usability, comfort, build quality.They've become part of my everyday carry on my daily NYC subway commute and they are great on planes as well. I tend to charge mine at work, but I also used them on a flight from New York to Portugal (about 5-7 hours of actual use) and they still had plenty of power (I believe around 60 percent or so). The only real critique I have about them is the sound quality, but I think the pros far outweigh the cons.",
      "rating": 4.0,
      "verified": true,
      "author": "O.I.",
      "helpful_votes": 2,
      "publication_date": 20170403
    },
    {
      "title": "Supernatural",
      "text": "Just received my Bose 35 cans today. I've tried soooo many headphones, some worth more than $1000. I purchased the Beats Solo 3's and sent them back because of the lack luster sound (sorry Apple). I am however using the Bose 35's with my Apple devices and they sound supernatural. They sound so beautiful, and over wireless! They connect in an instant. As others stated, the noise cancellation is second to none. I am very, very happy with them - I can't wait to see some of the extra things I can do via the downloadable App for these puppies. Thank you Bose!",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne Pruski",
      "helpful_votes": 2,
      "publication_date": 20161210
    },
    {
      "title": "noise cancellation headphones is the top reason to buy these!",
      "text": "Bought this as a gift for the GF and this works very well for her for travel and around the house as well. Sound quality is pretty good, not the best for the money, but definitely good for the price. The clarity and bass is not quite comparable to other brands like V-Moda and Sennheiser for the same or less money. The quality, comfort, and noise cancellation is top notch. If noise cancellation and blue tooth is high on your list, then you really can't get better than these BOSE headphones! Also, the silver color is much better than the generic black style",
      "rating": 5.0,
      "verified": true,
      "author": "Mark M.",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "The headphone is great if you are looking for a noise cancellation headphone",
      "text": "If you are someone who is looking for a great noise cancellation headphone and do not care about the money i highly recommend this headphone. The noise cancellation is undoubtedly one of the best. The sound is also good; i would not say great as there are many headphones with awesome sound quality and some are even better than this. The only reason i have not given 5 star is the fact that this headphone's wireless connectivity via bluetooth can sometimes have issues. I don't know if it is the firmware or the hardware of the headphone itself but it sometimes has issues when operated wirelessly.",
      "rating": 4.0,
      "verified": true,
      "author": "Ujjwal Acharya",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Best wireless headset to work with.",
      "text": "Bose does not disappoint with this headphone set. I worked from home often and these noise cancelling headphones are a must. I tried multiple other vendors and got feedback from the people that they were not able to hear me, that is until I bought these headphones which are excellent. The sound quality is amazing and the other end hear me very clearly. The microphones work a little too well, I have have a customer tell me they could hear my tv from another room. It also comes with an airplane adapter and a very nice case. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Benac",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Unreliable, will stop working after a year",
      "text": "I treat these headphones like my baby, especially given its price point. Everything worked well until a year later - the device no longer turns off which drains battery, and has bluetooth connectivity issues. Please do your research - These are all known issues with these headphones. Bose customer service does not help and makes you jump through hoops. They clearly do not take responsibility for the faults of their products. The sound quality was great but it really ends there. Will not purchase from Bose ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Light weight, effective and amazing sound quality!",
      "text": "I have been using my Bose QC 35's for over a year now, and am just happy with this product! Even after a year, there is nothing as amazing as these headphones on the market. The battery life, sound quality, build and product design are all absolutely perfect! The battery charge holds up really well. I frequently travel to the UK and I typically use headphones only for the duration of the flight. I put on some music and go off to sleep. I usually charge these after 4 return trips (even then, I tend to have close to 30% battery power). Sound quality is absolutely fantastic and noise cancellation is superb. They are also extremely light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Ameya",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Productivity Bubble",
      "text": "Noising coworkers, roommates, or a conversation you don't want to be a part of but can't get away from, this is your solution (at least mine). The bubble serenity you get with these is well worth the money. It suppresses almost all steady-state noise (humming from a jet engine; buzzing of fluorescents; loud dehumidifier; or cafeteria chatter); the spontaneous noises can be heard (unfortunately but I feel this is on purpose to not inhibit the sound quality). Which leads to my only request for Bose: Add a damn switch to turn on & off noise canceling without turning the headphones off at least in the Bose Connect app! lol plz.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Imig",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "soo close",
      "text": "These are great. The noise elimination is the best I've used and working in a noisy office that is critical. They are also comfortable to wear all day. I took off one star because of the wired option, it's a non standard connection. You have to use a proprietary connector instead of just going with a standard audio cable plug in, which I'd bet most of us have several 3.5's laying around in varying lengths. Bose opted to go for that extra $15 when you want a second or replacement cable.",
      "rating": 4.0,
      "verified": true,
      "author": "Bobbfrommn",
      "helpful_votes": 3,
      "publication_date": 20170420
    },
    {
      "title": "Great Bose functionality but hurt my ears",
      "text": "I like everything about their functionality BUT they hurt my ears. I wish I could exchange them for another Bose product that was a little easier on my big head.",
      "rating": 2.0,
      "verified": true,
      "author": "Simon Goncharenko",
      "helpful_votes": 5,
      "publication_date": 20170426
    },
    {
      "title": "Good product",
      "text": "One thing I find annoying is how it automatically switches between connected devices, even if I turn one off in the app. I have it connected to my TV and my iPhone, and occasionally I'll want to use my phone and hear that alone, so I switch off the TV device in the iPhone app. After a few seconds it will automatically turn on the TV device. I gave up on that route (one of the reasons I bought this) and just stopped using my phone. Other than that, it's nice quality headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh B",
      "helpful_votes": 2,
      "publication_date": 20170427
    },
    {
      "title": "Cannot turn off!",
      "text": "These headphones worked well for a while, but now they won't remain in the off mode. Using the slider switch to turn them off doesn't work, or if it does, the headphones come back on after a few minutes. Bose is aware of this problem but hasn't done anything to remedy the situation. You would, and should expect better customer support from Bose, a leader in noise cancelling headphones. I paid $349, money not well spent.",
      "rating": 2.0,
      "verified": true,
      "author": "jwc",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Comfortable, top of the line noise cancelation",
      "text": "This was purchased as a gift because I loved my own pair so much. Much has been said in other reviews, do the short and sweet is as follows: Top of the line noise cancelation, ability to still be somewhat aware of surroundings, extremely comfortable, good wireless distance. The only cons are that the battery does not last nearly as long on wireless as wired--I used these wired on an international round trip without charging (26+ hours), but at work these last me about one week (10 hours)",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine I.",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Bose QuietComfort 35 (Series I) Wireless Headphones, Noise Cancelling - Black",
      "text": "Not easy to connect Bluetooth. Sound is good but not as great as Sony Noise Cancelling Headphones WH1000XM3 which as great sound and bass. Also, the on and off function does not work well, after using for about a year. Overall, good but not great.",
      "rating": 3.0,
      "verified": true,
      "author": "ShopperWise",
      "helpful_votes": 2,
      "publication_date": 20190602
    },
    {
      "title": "Great headphones. Clean sound but not bass heavy.",
      "text": "Got theae headphones to use while traveling and they have been great. They do a great job with noise cancellation both on planes and bus rides. The sound is great. Could be a bit louder and the the bass isn't as strong as other options. For me, I prefer the noise cancellation and clean sound to heavy bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian C",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "great sound and freedom from wires",
      "text": "I purchased these headphones based on previous Bose product purchases and the need for headphones that incorporate comfort, great sound and freedom from wires. True to all the previous product experiences and the Amazon reviews; this product is truly amazing. They are extremely comfortable, sound amazing and incorporate decent range of wireless connectivity. I have never experienced any drop outs. The NC feature is spectacular; echoing previous reviewers, BOSE does indeed own the NC market. Very impressed. I also am impressed with the case provided; like the headphones the build is very robust. These headphones are worth every penny. I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "drcoke",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "As advertised",
      "text": "I do think these are worth the price. I commute on the subway and am always surprised at how they block out a lot of the ambient noise. They aren't great at blocking conversation completely, but I love these headphones. The battery lasts very long. I only wish that the charging cable was longer, since it is so short that you can't charge the headphones and wear them at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 4,
      "publication_date": 20170520
    },
    {
      "title": "Love them. This is my 4th pair",
      "text": "Love them. This is my 4th pair. I've looked at so many other options each time but come back to these for all my travel, noise cancelling requirements. Love the sound quality (I'm sure there is better), features and functions. No issues with any pair I have owned.",
      "rating": 5.0,
      "verified": true,
      "author": "auzigrl",
      "helpful_votes": 6,
      "publication_date": 20170530
    },
    {
      "title": "Great Headphones with Bose Sound and Quality Features",
      "text": "These are quite possibly the best invention out of Bose yet. Noise canceling is phenomenal, especially on an airplane. Battery life is something like 10 hours. When you turn them on, they automatically connect with bluetooth to any device that you have previously set up and identify it by voice prompt.You can connect to two devices simultaneously. Voice prompt also alerts you to percentage of battery power remaining. The sound is undeniably Bose quality. They fold nicely and fit in a hard case for storage and traveling. Expensive but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob-On-The -Go",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Best Bose Noise Cancelling Headphones Ever",
      "text": "These are amazing. The sound is incredible with accurate reproduction of tones, no artificial booming bass. Use them when walking and hiking with iphone in pocket....never experience skipping in signal. Battery life goes on for weeks with an announcement of remaining battery life to alert user at every startup. They are light and comfortable to wear, a noticeable improvement over my still amazing wired Bose QuietComfort 25 headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 3,
      "publication_date": 20161201
    },
    {
      "title": "Works great, even without music playing",
      "text": "The noise cancellation on these is a life-saver in an open-seating office. Works great, even without music playing. That said, for the price, I wish the frequency response and general sound quality was better. I get that they have to make some trade-offs to get noise cancellation to work, but compared to my Sennheiser or Audio Technica headphones, the quality is really pretty lackluster.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 3,
      "publication_date": 20170519
    },
    {
      "title": "These things rock!",
      "text": "These things are incredible. If you're going to be flying, and want complete peace, buy these. They drown out almost all of the annoying sounds you hear (including the engine noise). They make flying so much better. I went out to mow my yard yesterday and I put these on and, no joke, it was hard to tell if the lawn mower was even turned on -- I couldn't hear it! Five stars. These things work! The battery life is super impressive as well.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Simmons",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Great set of headphones!!",
      "text": "I am on an Amtrak train right now and bought these headphones for my trip. They are amazing! The noise canceling drowns out almost every sound when I have music or videos playing. I can hear a faint clack clack of the train and know when announcements are being made, but the hum of the ride and nearby conversations are nonexistent. The clarity is great and I love the Bluetooth connectivity! I am so glad I purchased the Bose headphones!!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie-Okie-Karaoke",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Just as good as my wired Bose NC headphones if not better",
      "text": "Just as good as my wired Bose NC headphones if not better. Losing the wire makes a huge difference especially if you fly a lot. Was much easier to sleep and move around in the seat without the wire. Paired it with several devices easily, it processes sound smoothly and accurately. Flew on a 13 hour flight this week and the things were still 60% charged at the end. Comfortable, long charge life and good looking. A bit expensive but definately worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "vicki w.",
      "helpful_votes": 3,
      "publication_date": 20161119
    },
    {
      "title": "Worth It!",
      "text": "I purchased these last week because I made the decision to start working from home. While I love my children, they're not exactly quiet and I really was having a hard time concentrating when they were making noise. I was reluctant to pay so much for these when the next best model was about half the cost, but I also am used to a quiet office and figured it was a good investment. Couldn't be happier. Even without power, they work, but when I have music playing, it's like I'm in my own little world. When I play Opera or Classical; I feel like I'm at a concert hall. Great investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20170219
    }
  ],
  "product_meta": {
    "title": "Bose QuietComfort 35 (Series I) Wireless Headphones, Noise Cancelling - Black",
    "description": "Color:Black| Style:Headphones onlyQuiet Comfort 35 wireless headphones are engineered with world-class noise cancellation that makes quiet sound quieter and music sound better Free yourself from wires and connect easily to your devices with Bluetooth and NFC pairing Volume-optimized EQ gives you balanced audio performance at any volume while a noise-rejecting dual microphone provides clear calls even in windy or noisy environments Voice prompts and intuitive controls make communicating and controlling your music hassle-free A lithium-ion battery gives you up to 20 hours of wireless play time per charge And if you anticipate a situation where charging may not be possible just plug in the included audio cable Wired mode gives you up to 40 hours of play time per charge Premium materials make these headphones lightweight and comfortable for all-day listening Use the Bose Connect app for a more personalized experience Included Quiet Comfort 35 wireless headphones USB charging cable backup audio cable airline adapter carry case",
    "rating": 4.3,
    "feature_bullets": [
      "World class noise cancellation makes quiet sound quieter and music sound better. Connectivity Technology: Wireless",
      "Volume optimized EQ for balanced audio performance at any volume",
      "Wireless convenience, with easy Bluetooth and NFC pairing aided by voice prompts",
      "20 hour battery life per charge; up to 40 hours in wired mode",
      "Noise rejecting dual microphone system for clear calls even in windy environments"
    ],
    "specifications": {
      "Product Dimensions": "3.1 x 6.69 x 7.08 inches",
      "Item Weight": "8.3 ounces",
      "Manufacturer": "Bose Corporation",
      "ASIN": "B01E3SNO1G",
      "Item model number": "759944-0010",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.3 out of 5 stars7,961 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#834 in Over-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 5, 2016"
    },
    "categories": [
      "Over-Ear Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 169.99
  }
}