{
  "website_summaries": [
    {
      "verdict": "Though it's not ideal for a huge cosmetic collection, this Caboodles bag is a good choice for transporting a few select pieces, and it's made with durability and style in mind.",
      "pros": [
        "Stands out for its sleek design with bold stripes and pink accents, making it fashionable enough to carry anywhere",
        "Structured exterior keeps makeup safe from damage",
        "Made by a popular name in cosmetic organizers"
      ],
      "cons": [
        "Interior isn't extremely spacious, but this won't be a dealbreaker for everyone"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect size makeup case.",
      "text": "This was exactly what I was looking for. A makeup case that is not too large to pack when I travel, but large enough for what makeup I take with me. Aside from being the perfect size, the sides are hard and sturdy. I do not like sides that collapse unless the case is crammed full of products. This case means less sliding around during travel and protection for my makeup. There are two pockets for brushes and such but even without those I would still give this five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "K LTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "I was excited for this one...",
      "text": "I expected better quality, maybe I got a dud - many cosmetic defects on the outside, but I don't see the material holding up well anyway. Too bad, because it was cute. Extra star for prompt refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 2,
      "publication_date": 20180905
    },
    {
      "title": "Great Makeup Case!",
      "text": "Love this Caboodles case! It's my second one. It's very compact, but is still a hard case unlike most of them. The only complaint I have is that it doesn't hold up very well over time. It starts coming unglued in places and my zipper came undone with this one. That's after months of use though.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Caboodles",
      "text": "Although this is geared towards teenage girls, I'm in my mid-30's and I love this. I purchased this because I can't stand having to search through my makeup bag, or empty it's contents to find something. This lays everything out nicely, similar to a suitcase. I wish it came in multiple colors, but most importantly, it does its job and does it well!",
      "rating": 5.0,
      "verified": true,
      "author": "M.E.F.L.",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Unique makeup bag",
      "text": "This is the cutest makeup bag I've ever opened with the bright pop of Pink color on the inside just completely took me off the edge hunny, I absolutely loved it, my mom thought it was a real purse lmao It came sooner then expected and with no damage!",
      "rating": 5.0,
      "verified": true,
      "author": "t.",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Cute",
      "text": "I really liked this case, but I did not pay enough attention to dimensions and it is too small to fit eyeshadow or makeup brushes, unfortunately.",
      "rating": 4.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Five Stars",
      "text": "This works just as intended. Fits all my makeup decently. And it’s very cute.",
      "rating": 5.0,
      "verified": true,
      "author": "brandy",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Super cute and sturdy to boot!",
      "text": "I bought this for my niece who is just about to start wearing makeup. It's very cute and she loved it. Sturdy and good quality. Had a small discoloration on one of the white stripes but I'm sure I'm the only one who noticed. Overall, I'm happy with this purchase",
      "rating": 4.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 3,
      "publication_date": 20161226
    },
    {
      "title": "Nice hard-body cosmetic bag",
      "text": "Nice hard-body cosmetic bag. Good for travel so some of your more fragile makeup doesn't get smooshed/knocked around too much. I had one I used for years and lost it, and haven't been able to find another hard-bodied one since. My only complaint is the top doesn't stay up very well when opened, I had to push it waaay back to stretch the fabric so that it stays open. Still nice though, it will get a lot of use!",
      "rating": 4.0,
      "verified": true,
      "author": "MEverhart",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Better than Expected",
      "text": "This is very nice. Bought for my daughter who just turned 13. It is a nice size for her and there were no issues with the colors or zipper. She commented how much she liked it as well when she opened it. So did her friends, lol. It's a good size for home or travel. Love the hot pink zipper and lining.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "I love this product perfect size & the style is gorgeous",
      "text": "I'm now starting to wear makeup so when I saw my makeup collection was expanding, I needed something to put it in, I love this product perfect size & the style is gorgeous.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170919
    },
    {
      "title": "Love it. Perfect for travel",
      "text": "Love it. Perfect for travel. Holds all cosmetics without damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Loboexp",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Five Stars",
      "text": "perfect for my daughter to take make-up on the go",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170215
    }
  ],
  "product_meta": {
    "title": "Caboodles Obsession Cosmetic Valet, Black/White Stripe, 0.61 Pound",
    "description": "Obsess much? We don't blame you! Petite and practical, this fun-sized cosmetic valet features a durable zipper closure and plenty of elastic pouches for maximum storage options.",
    "rating": 4.2,
    "feature_bullets": [
      "Sturdy open interior",
      "Elastic pouches",
      "Zipper closure"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.88 x 6.63 x 3 inches; 9.76 Ounces",
      "Item model number": "582489",
      "UPC": "024099446594",
      "Manufacturer": "Plano Molding Company - Caboodles Div",
      "ASIN": "B01EK4PQHI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tools & Accessories",
      "Bags & Cases",
      "Cosmetic Bags",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}