{
  "website_summaries": [
    {
      "verdict": "Offering a good blend of compression and comfort, these knee sleeves are ideal for those in search of dependable knee support that won't break the bank.",
      "pros": [
        "Boasts a sturdy neoprene construction that’s comparable to more expensive varieties",
        "At 7mm thick, they provide optimal support for weightlifting",
        "Graduated compression promotes blood flow while easing discomfort",
        "Contoured design delivers an improved fit that doesn't slip or bunch",
        "Suitable for all types of exercise",
        "Available in 3 colors"
      ],
      "cons": [
        "Sizing can be a little tricky, but phenomenal customer support is always on hand"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Its a great product that worked for me.",
      "text": "So, I work out 6 days a week. I can ride a bike for hundreds of miles but the weights hurt my knees. Leg day I find myself doing less weight and more reps. The older I get, the more careful I need to be. These braces... Now I'm not gonna push the limits because I still have a day job and don't wanna become disabled but, I'm able to squat again. Not hundreds of pounds but, 135# safely for sure. Very happy with this product. Would purchase again. Also... Customer service is A+. They are quick to respond and will address any problems you might have.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnyjl",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "So far they are great",
      "text": "I’ll start off by saying that I’d recommend most order a size smaller. I measure right at the upper end of large/ starting point of xl. I got a medium and they fit great. Not too tight. I won't say that these are the best on the market as I only used one other brand. I definitely like this brand better in that comparison. In just shy of 400 pound squats my knees feel very stable. I don’t feel that these sleeves impacted my squats such as allowing me to lift more weight. That’s not what I was looking for though. I just wanted stability and something that wouldn’t interfere with my range of motion. This is it.",
      "rating": 5.0,
      "verified": true,
      "author": "M06",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Good support, fantastic customer service",
      "text": "I purchased this after having 5 months of reoccurring knee pain due to a torn meniscus from heavy squats. I'm 140lbs, 5'4\" and was in between sizes with a 12.5\" knee measurement. I went with the medium, but found that it was a bit looser than I was hoping for--fine for running, but not lifting. ProFitness' customer service was awesome in getting a smaller size to me within 2 days. The small is very tight and much more supportive--very happy with this purchase. I will note that the neoprene is hot, and not the most comfortable thing to wear for a full workout. I plan on putting it on only for my heavy leg lifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy T.",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "This product is like a knee sock that no one asked for.",
      "text": "I bought a medium, and they were too big. I purchased these knee thingies to keep my knees from getting injured while doing leg workouts. They offered zero resistance for me and quite honestly caused problems that were there before. I started to have a lot of knee pain when I wore these after a leg workout. If I were going to purchase something like this again, I would buy something adjustable with a strap.",
      "rating": 2.0,
      "verified": true,
      "author": "Herby Beam",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Excellent Gym Staple",
      "text": "I have knee problems that had drastically slowed me up in the gym. I tried an array of knee sleeves in which I found were great for post workout wear but not for wear during workout sessions. I came upon ProFitness knee sleeves and couldn't be more happier with the performance of them. They keep my knee stabilized and supported. They fit and stay in place without rolling up or down. The quality and durability are great so far. I think I am going to have break them in a little more as far as flexibility goes because I haven't had them that long....however they do not impede my performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Trina S",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Saves your knees!",
      "text": "As an older adult, I’m learning I can’t quite push my limits of weight lifting like I could in my 20s. Before using these knee sleeves, I could always feel a bit of sharp pain and strain in my knees during a barbell squat. These knee sleeves have made a world of a difference. Not only do I not feel discomfort during or after my exercise, but I’ve noticed the great amount of stability it’s added to some of my leg routines. If you want to avoid injury, especially as a you get older, don’t hesitate to consider these!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim H.",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Husband loves them",
      "text": "My husband goes to the gym 5x a week and has been getting into heavy weight lifting recently. He asked to me find something for him to help support his his knees as the weight is getting increasingly heavy and he wants to reduce the risk of any injury. After reviewing several products I went with totalprofitness because of the great review and nice design. My husband has been using these for over a week now and loves them. He says they have great support without restricting his movement. They are comfortable and breathable and do not roll down mid workout. When asked he says 5/5!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Tremendous customer service",
      "text": "I ordered the wrong size, emailed ProFitness, and was immediately contacted by one of the co-owners who made it his personal responsibility to replace it with the right size. I was already impressed with their \"Lifetime Replacement Warranty\", and their numerous articles and suggestions for exercise and other important workout information. But adding the customer service aspect - if they keep this up, they should be #1 in no time. Oh, and the knee sleeve is perfect, although the original one I received was a little tight. But I'm sure the replacement will be perfect - and if not, I'll revisit and post after conferring with ProFitness.",
      "rating": 5.0,
      "verified": true,
      "author": "MHC",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Safe and secure for your knees!!!!",
      "text": "I ordered a M knee sleeve my knee is about 15\" and it fits perfect not loose just right, you want it to be a lil tight not loose, Excellent product I'm glad i can trust myself with this amazing knee sleeves, very comfortable but the best thing is i can push myself to the limits knowing that i have a product that backs me up to do what ever i put on my mind! You really feel the difference, no doubt!!!! Awesome product!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "iFROSTY",
      "helpful_votes": 4,
      "publication_date": 20170725
    },
    {
      "title": "Fantastic!",
      "text": "I have tried several knee sleeves in the past during my fitness journey but none feel as comfortable as these. Not only do they look great but they feel terrific during leg day! The material and compression really reduces pain and swelling in my knee joints (especially my right which is the one I have had issues before) during and after a workout. Also, I love how easy they are to wash and store in my gym bag. Profitness hit the spot with these knee sleeves, I think they are fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Frankie",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great support & customer service.",
      "text": "My wife is looking to increase her squat and needed better knee sleeves. She originally purchased the blue ones in a small because her measurement was right on the cusp of a small and medium and she didn't think anything of it. She was worried the small might be too tight and reached out to customer services before initiating a return. Benj answered my wife's email right away, and instead of having her return the small, they sent her a medium in the knee sleeves and let her keep the small as well. She loves to support they provide her. Since using the sleeves, her deadlift has gone from 205 to 225 and her squat from 135 to 170.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Kamber",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Seem to work",
      "text": "At first I thought I might need a larger size, since they were especially tight and somewhat limited my motion. However, after I got used to them and broke them in a little, they seem to be just right for me. They give good support for squats and deadlifts, and they seem to be well made with no early signs of breaking down. Range of motion is slightly impacted, but honestly I can't imagine an effective knee sleeve that doesn't.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Close",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "worth the extra few bucks, for the product you need. worked for squatting pain",
      "text": "hesitant at first, because a little more expensive than other brands amazon recommended, but after having them, I realized I could not have a better product, glad I chose these. I bought for knees because squatting became painfull. I squat around 205-225 consistently. helps to stabilize and I don't feel the pain under my knee cap as bad as I did before. great quality. and came with a little backpack to keep them in. professionally packaged. and I registered for free a 1-year warranty, and they gave me additional free products (hip resistance bands)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great value and comfort",
      "text": "Oh man, these are great. My knees would ache a bit doing squats, but these really help make my knees more comfortable. It allows me not to worry about my knees and focus on my form. I squat in the 350-405 lb range. I found the measurement chart to be accurate. Been using for a while now and they are holding up well. Update: This is the second pair I bought. First pair lasted about 9-10 months before stretching out which is normal. The price is good so I was happy to order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Mabbott",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Fantastic product, accurate sizing, amazing service.",
      "text": "Immediately when putting these on I could feel the difference in stability in my bad knee. For some background - I tore my right ACL approximately 12 years ago, and ruptured my meniscus in that same knee ~4.5 years ago. I have decent range of motion, but during leg exercises (squats especially) I struggle with joint stability on the way up. These sleeves don’t interfere with getting all the way down and have helped significantly with the shake I always feel in my right leg. For the price, they’re absolutely fantastic. Customer service is excellent as well, and with their exchange and refund policy you have nothing to lose by getting these. 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel H",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great buy..website sucks. Not user friendly",
      "text": "So I just tried them on did a few air squats so far so good . Feels nice and snug but not tight. I brought a medium and I measure 14.5 inches. Can't wait to use them for lifting... as for registering the product there will be major difficulties. This site is not user friendly. I had to goggle a million times only to finally find a.contact. now the guy on the other line was very nice and friendly but he had to register my sleeve but I still don't know if I get a lifetime warranty hope this is not a way to lose out.... So i advise to just make the phone call cause the website is annoying",
      "rating": 5.0,
      "verified": true,
      "author": "cee cee gilmore",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Best Knee Sleeves ever!",
      "text": "I recently came across ProFitness instagram page and I am so happy I found them. If you're looking for knee sleeves and you're serious about weightlifting, please consider these sleeves. My left knee was hurting every single time I had leg day. The support and compression the sleeve provides is awesome. I haven't had any knee pain ever since I started using them. Squats on the smith machine, leg press and leg curls are no longer my nightmare lol I already have 3 items from this company and nothing compares to their quality. Can't wait to purchase more items soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Gonzalo",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Awesome customer service!! ⭐️⭐️⭐️⭐️⭐️",
      "text": "I got these in February 2020. I use them for CrossFit activities. I really like them. They are very comfortable. I did have an issue with the front knee area breaking down ( I assume from knee push-ups). I contacted the company and in less than I week I had new ones. No questions and no cost to me. Thanks Benj for taking care of me so quickly. I highly recommend these or any other products NewAge Supply has out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Jode S",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "These things are great",
      "text": "Needed some knee sleeves for compression/support while we try to figure out what is causing some inflammation in my knees. Wearing these I can still do leg work (although a little lighter weights for now), elliptical, and/or treadmill walking for 45 minutes...and they stay in place. No slipping down. Then I wear a pair most days to work. At this point, my inflammation is going away (slowly but surely), and I think I owe it partly to the knee sleeves.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Love These!",
      "text": "Really love these knee sleeves! They are a bit tight at first, but break in after a few uses. Definitely cuts down on soreness and any knee pain I had from running or squatting is almost completely gone. They do slide down a bit when you start sweating, but that’s to be expected. Would most definitely purchase again in the future! Highly recommended, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great product and great customer service",
      "text": "These are awesome and PROfitness’ customer service was amazing. I used my pair and noticed i must have received one with a loose seam. I didn’t register for lifetime warranty but did email them explaining the situation. They replied same day and sent me a replacement pair that will arrive in a few days! Great customer service and a great product. Thanks Benj at PROfitness!",
      "rating": 5.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great for squats, But questionable durability.",
      "text": "Used these knee sleeves for mainly squats. They were amazing. The support and stability have given me the confidence to squat heavier without fear of injury. I bought these due to my knee creaks and since using these they’ve stopped. I bought the black ones in medium. However, one of them has ripped apart on the in seam behind the knee, see the picture. I bought these in November 2019, its been less then 3 months and they ripped unfortunately. The reason why I’m giving them 2 stars is mainly due to how short they lasted. Edit: I contacted the seller and they were kind enough to replace the knee sleeves.",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Awesome Customer Service",
      "text": "I'm an avid lifter and wore these knee sleeves for about 10 months with no problems but then they started showing signs of internal wear (neoprene tore). I was getting ready to order another pair and noticed that the Seller offered a 1-year warranty; I contacted them and within a few days I received a new pair. Awesome Customer Service...hands down. I believe in this product and believe in the Seller.",
      "rating": 5.0,
      "verified": true,
      "author": "W R",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Easy on while providing good support",
      "text": "These are exactly what I needed for Crossfit. They provide good padding to my knees during lunges, burpees and other knee-to-ground stuff. They also are super helpful during the heavier lifts to provide a little extra support. When they're properly fitting, they pull on easily and are tight enough. Taking them off takes a tad longer, as desired.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Redtights",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Good quality and support",
      "text": "I've used these nearly twice a week for almost an entire year, they have been comfortable and I have had no complaints. Only recently as my leg training has picked up I noticed that they had started to really stretch out, I emailed the company and am getting a no hassle warranty replacement to use as I absolutely love these sleeves",
      "rating": 5.0,
      "verified": true,
      "author": "Matt S",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "These knee sleeves will NOT let you down",
      "text": "These knee sleeves will NOT let you down... trust me! I purchased these sleeves with the intent to use them on leg day since my knees are not the best of quality... However, these sleeves are! Whoever came up with the design for these knew what they were doing and thats a fact! These are definitely high quality and will not slip, pinch, or bunch up with bending movements like other cheap knee sleeves. I have never been more satisfied with another product for the knees and I’ve tested many! These will not let you down! When you are lifting heavy weights injuries can happen, but with these sleeves injury will be the last thing on your mind!",
      "rating": 5.0,
      "verified": true,
      "author": "Chandler",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Great sleeves for heavy lifting.",
      "text": "I followed the instructions for the fit and they were great. The sleeves definitely help with keeping my knee warm and stable while providing compression while performing heavy lifts. Great sleeves. I was also gifted a profitness lifting belt from a friend which is a great product as well. Great product line will buy again when the need arises. Have been using these sleeves since March of 2019 and have had no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "RNorman",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great Product and awesome customer service",
      "text": "Pro: I had done some review of the Knee Sleeves online and I really love the stability of this sleeve. After knee surgery, I was very afraid to workout. However, after using the Profitness knee sleeve I feel very comfortable. It was sturdy, allowed me to move as well. It is great for squats and lounge. I love the great customer service given by the team on Instagram. I would definitely recommend buying the product. Con: I had to buy one size up from the measurement online, and return the original item in the size charge, but that didn't take anything away from the product itself.",
      "rating": 5.0,
      "verified": true,
      "author": "charmaine barnett",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great new, aged poorly",
      "text": "This is actually my second pair in less than six months. The first pair did not age well. I used for about an hour a week while performing squats and the bottom part stretched and broke on one of the sleeves. They were great brand new, so I wanted to give them one more shot before I switched brands. I already stopped recommending them. Hopefully the few people that bought them at my gym from my suggestion, don’t suffer the same fate.",
      "rating": 1.0,
      "verified": true,
      "author": "DV",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Awesome Products Even Better Customer Service",
      "text": "I am very pleased with the quality of this product. I accidentally ordered the wrong size and the rep on Instagram walked me through out to fix it and helped my find the correct size for all of the products I needed. Amazing customer service. I am looking forward to purchasing all of my fitness supplies with them. Another benefit is when registering your product for its lifetime warranty you get an awesome free gift. Best fitness purchase ever. Thank you ProFitness for being extraordinary in the customer service world",
      "rating": 5.0,
      "verified": true,
      "author": "Shania Hoban",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Very good quality",
      "text": "Customer service stands behind their product and will replace hoods that don’t hold up. After five months of squatting through the 2s and in to the lower 3s, these sleeves lost some tightness. The new pair was amazing and felt nice and tight. Ended up being fortunate and got an opportunity to buy another brand at a higher price point and the neoprene on the PF ones is noticeably thinner than the 7mm by touch. They still work great for warming the joint but if you want really tight support and maybe even some elasticity in your sleeves, these aren’t quite it.",
      "rating": 5.0,
      "verified": true,
      "author": "John C.  Roemer",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great support & customer service",
      "text": "Right out of the bag, these look and feel like quality sleeves. The thick material is extremely supportive and protects your knees. If you are debating sizing, absolutely go up - these babies are tight. I am 140lbs/female and my knee measurement was right at the high end of the sizing guidelines for a medium. I read the reviews that said size up but figured there was no way I'd need a large.... I was wrong, needed a large. Exchanging the sleeves was a pleasant experience and the seller was very quick to respond/exchange. Would recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "kristyn slater",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great support",
      "text": "I was having extreme issues with my knees while working out. I purchased these and I loved them. They make it easier and no pain while lifting. Definitely recommend these. The bag it comes with makes it also convenient to store the knee pads. To clean them you just wash them on cold and let them air dry and they're good as new.",
      "rating": 5.0,
      "verified": true,
      "author": "Noel Jaco",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Same quality for half the price",
      "text": "I’ve had these for a few sessions and so far, I love them. I have an old pair of Rheband’s that I’ve used for about 2-years on and off, and they’re essentially the same product for half the price. The best part so far has been how sturdy they feel. Def a must for heavy lifting sessions where my knees need the extra support. Plus, the team at PF is super helpful. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Van Evera",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Sleeves offer great support",
      "text": "The knee sleeves work great. They are thick enough to offer the right amount of support. I tried them out as soon as I received them and was amazed by the support it provided. Mind you all that I have a torn meniscus. At first, I had ordered the incorrect size but Benj was able to help me out in a swift. He sent me out the correct size sleeves within 3 days, and told me to keep the smaller size and gift it to someone else that could benefit from it. His fast response to that matter show immense customer service. Thank you Benj!",
      "rating": 5.0,
      "verified": true,
      "author": "Manny",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Comfortable and protective",
      "text": "I'll never do squats again without these. After suffering a minor injury, I've re-evaluated my squat and found that these sleeves have greatly decreased knee pain and help to significantly protect the knee and quads from bending too far. They are snug, which they are supposed to be, and you can really feel that glove-like feeling when using them. A must for any squatter, regardless of whether you go heavy or light.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A. Moreau",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Actually worked!",
      "text": "First off, I have not had any major knee issues in the past and am trying to keep it that way. Started lifting heavier squats, deadlifts, and leg press and started feeling some sharp pains during the heavy lifts which would subside after the exercise. Bought these to mitigate the pain and was totally SKEPTICAL. First use was on hypertrophy day and worked well but didn't usually have issues on that day anyway. Next up, heavy day...was able to increase squat and leg press with NO pains and my knees felt super secure! Size chart was accurate, super thick and a bit uncomfortable to walk in but worked awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "big daddy b",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Great product at a great price",
      "text": "These are exactly what i needed. I am a senior athlete and need additional knee support for squats and these fit the bill perfectly. I have powerlifting wraps but they are a pain to put on and take off when i'm doing metabolic training that lncludes squats, lunges, etc so these are a great alternative. I ordered according to sizing guidelines and the fit is right on. I think i saw some reviews complaining about them being too tight but that's exactly what you want. Great product at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeM",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Great sleeves and excellent customer service!",
      "text": "I originally ordered the knee sleeves in size medium according to the chart. My knee measures 13.5 inches. When I received them, they just didn't seem to provide enough support/stability. I emailed ProFitness and they very quickly sent me out a new pair in size small and let me keep the 1st pair I ordered. The size small is a much better fit for me and felt great working out in them. I highly recommend these knee sleeves and this seller for their exceptional customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Premium Quality Knee Sleeves Buy'em",
      "text": "I would highly recommend these knee sleeves! My knees measured at 15\", I ordered a Medium. I'm 30yrs old and have been working out since I was 14. I've never used knee sleeves before and I don't have any knee pain or injuries, however, I do get some soreness around my knees and wanted to be proactive in protecting and providing them with extra support. These almost help to spring you back into proper position and provide excellent support. The material feels vert quality. They came in very nice packaging, with a bag included, and have a lifetime warranty! Would definitely buy other products from ProFitness🤙🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan C.",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Great product Great service!",
      "text": "This product is amazing but the customer service is even better! These sleeves are high quality at a very affordable price. They keep my knees warm & in place at all times. I have not had one problem while wearing them. But before I could even get them, their customer service dept was reaching out. Right after I received them I realized I ordered a size too small & they sent me a new size for free. No questions asked. I am extremely pleased with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "NaturallyRooted",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Really helped with my knee pain.",
      "text": "I was getting knee pain if I slept wrong (dog lying on my legs) or just stepping wrong. These sleeves really seemed to do the trick. I sleep with one on my right knee all night and can go all day without any pain. They get a little hot sometimes but nothing too uncomfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "John T. McClanaghan",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "FANTASTIC CUSTOMER SERVICE .Great Quality. Low range of motion.",
      "text": "These sleeves have great support, and are very well made. However, they were a little too thick for my personally comfort and did not allow the range of motion that I needed for my workouts. Customer Service was FANTASTIC with communicating and making sure that I got what I needed. Even if you don't want these particular knee sleeves, definitely check out their other products!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Nice Quality Product and Comfortable while working out",
      "text": "Great product and very high quality. These sleeves are very thick and comfortable to wear. Much faster than trying to use knee wraps and the easily pull down to your ankle when you are not using them or in between sets. They come with a nice carry bag and appear that they will last for a good bit of time. The product was shipped very quickly and the company provided super email support as they were on the way.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hager",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "The Feeling Of Security",
      "text": "Profitness Knee Sleeves, The Support Is Very Comfortable, Feels So Much A Part Of Me That I Forget They're On. The Personnel Of The Organization Have Great P.R Skills A Pleasure To Communicate With Them, They Address Any Concerns Immediately. I'll Buy More Products In The Future. Thanks. NewAge Supply",
      "rating": 5.0,
      "verified": true,
      "author": "B.C.",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Not made well, with poor design.",
      "text": "They were too short in length. They cut into the back of my knee. Found that they fit poorly, with the lower half being too tight. The top of the sleeve felt okay, but too short. Felt weird.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Nothing Surprising, Profitness is Top Notch",
      "text": "When it comes to weightlifting gear, I always check what ProFitness has first. Their quality and cost is always exactly what I am looking for. These knee sleeves are no exception, excellent product. I am really glad my wife found this company, I will continue to purchase from them throughout our bodybuilding careers. Thank you so much! #OCBNATURALPRO",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph McKay",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great customer support, might have problems with stitching",
      "text": "Product worked great at first, stitching started to come undone and it got much looser. However, all it took was a quick email to customer support and they quickly sent me a new pair for free, haven't had any problems with the new pair so far. Product quality is pretty good for price (and my issue may have been more of a one-off thing), but customer support is superb and quickly solved my issue",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Knauss",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "They're Grrrrreat",
      "text": "I am 5'5\" 155 pound female with some pretty substantial crossfit quads.... and I ordered a medium... these were a little snug but fit well. Eliminates all kinds of weird crickety knee pain. I put these bad boys on and did set after set of heavy back squats without issue of pain or mobility. And best of all... after a week of wearing them and just airing them out... they don't smell like dirty feet... my other knee sleeves I had to wash every other day... yuck... These are sooooo worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Great product!",
      "text": "I’ve purchased a couple of knee sleeves on amazon but none compared to these. The Profitness Knee Sleeves keep your knees warm and allow you to squat deeper without experiencing any pain. Even when I took them off, my knees didn’t ache like they usually do when I’ve used other sleeves. Will definitely continue to use them for leg days. I did follow the sizing chart though and got a large but felt like they weren’t as tight as I would’ve liked them to be. I contacted customer support and they have been so great on getting me the correct size. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Good insurance, great value.",
      "text": "Back in the gym, and fear of agrivating my knee pain has been really hindering my leg day ambitions. Purchased these on the recommendation of a friend and gotta say that they are definitely worth the investment if you deal with any knee pain issues. The fit is nice and tight and my first squat session with these had me feeling confident to add some weight. I went with the XL for my 17.25\" knees. The size chart was dead on 👍🏽. Great stability and support through out the movement and had no issue with flexibility. Knees felt good.",
      "rating": 5.0,
      "verified": true,
      "author": "Bishop127",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Solid product",
      "text": "Great product overall and fantastic customer service. I ordered a medium because that's what the sizing chart called for but it was way too tight. I contacted the company and they sent me a large at no extra cost whatsoever and told me to keep the medium and give them to someone who could use them. They were initially a little too tight around my calves but I've used them several times and now they fit perfect and give me the knee support that I need to do any type of leg workout. Size up if you are on the cusp.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Top Notch",
      "text": "If you are looking for knee sleeves that provide the comfort and support you need for your lifts, these are the ones to buy!! I am beyond happy with this purchase and the customer service is top notch to add to the greatness that is this product. Highly recommend these for someone serious about protecting your knees!!!",
      "rating": 5.0,
      "verified": true,
      "author": "michael curry",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Fits great",
      "text": "I really love these. They work great. I slightly injured my knees from lifting heavy and I use these knee sleeves to prevent further damage. I have seen no issues yet and they keep my knees warm and stable. I've had them for 3 months, using them at least 3 times a week. My only issue with these is that they have stretched a bit faster than I would like but they still work great. I have a 11\" knee circumference, and bought a small. Fits good. I can do squats and lunges with these comfortably.",
      "rating": 4.0,
      "verified": true,
      "author": "Tenille",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Impressive Knee Sleeve Value",
      "text": "I've been considering getting knee sleeves for a while now, and just couldn't pull the trigger on the ones I'd been reading about because they price was just too high. Then I encountered a few reviews for this brand, and the lower price compared to other 7mm neoprene sleeves on the market. I've lifted with them twice now, and I'm very impressed. I measured my knee at 15.2 inches, and went with the suggested large size. They fit well, tight enough to provide support without being too restrictive. When squatting, they provide a small amount of bounce which makes the movement feel really good. I wish I would have bought these sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S. Brinkerhoff",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Great customer service",
      "text": "Good knee sleeves. I don’t own any SBD or Mark Bell’s so I can’t compare them. I do heavy squats at the gym (315 plus) and they work great. Also, great customer service. I ordered a size too big and emailed them directly and they replied back quick and sent me a smaller size. I definitely recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Brockadile",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great compression/knee support and very comfortable",
      "text": "If I am to pick which knee sleeves I used for the past years I like most, it would be this one. Too satisfied with this product I ordered 2 more pairs. The knee support is great and very comfortable. I am an olympic weightlifter athlete and I need a great knee support for heavy squats and cleans for knee stability and avoid injuries and this one does the work. Perfect for squats!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicola V. Lagatao",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Best Products on the Market!  Best knee sleeves!",
      "text": "I have been using Profitness for over a year ago. The knee sleeves are unbeatable! I am a powerlifter with experience in using different brands, and these are the only knee sleeves I would recommend to anyone. Squatting, deadlifts, or any other activity. These order was for my strength coach, as I have Recommended him. About customer service? They exceeded my expectations, and would have me as a loyal client. Sizing is accurate, but if you are lifting heavy, I personally recommend to size down for more compression, but if you want a normal fit that still keep your knees secure, stick to your size. Don't look anywhere else, with Profitness you have found what any athlete is looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "Kary Killinger ",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Awesome product, awesome customer service!",
      "text": "The knee sleeves are amazing, definitely worth the buy! I tested them out weightlifting and they provide a lot of support but still allow you to move naturally. The material is thick and durable and the sleeves are easy to get on and off. I would recommend going a size up if you’re in between sizes though. The customer service was also amazing, there’s a lifetime guarantee and they answered all my questions. Definitely would buy other products from them.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Great customer service",
      "text": "So I ordered the mediums and they ended up being too big, which I should've known better because I have chicken legs! So I contacted the company directly and they had a new pair in the mail for me the same day. If you have small legs definitely go down a size! They fit good and help with my knee issues a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "GrannyO",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "these are the knee sleeves you are looking for",
      "text": "Tried countless of compression sleeves to alleviate chronic joint pains with enough support to at least let me train legs again - though it still hurts like hell because you’re running out of cartilage in your knee joints lol-, but these are the perfect sleeves I’ve been looking for and looking for. The product is of great quality and the customer service is top notch. Definitely will be using their products from now.",
      "rating": 5.0,
      "verified": true,
      "author": "andrew martin candelaria",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Excellent value and great customer service!",
      "text": "These are great! They provide the stability I need and prevent my knees from hurting. Their customer service is also top notch. I ordered a size that was too large, and they were very quick to respond and made it right! I'll definitely be recommending this to all my gym bros.",
      "rating": 5.0,
      "verified": true,
      "author": "GR",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Really good knee sleeves",
      "text": "Knee sleeves seem to be well made, but only time will tell. The fit is nice and snug. If you like the tight feel of a knee wraps, I would suggest going one size down. The warranty really makes these worth the purchase. So far my experience with their customer service has been great so I don’t foresee any issues with the warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Awesome customer service",
      "text": "Great product, and even greater customer service. From reading the reviews i ordered the small, but after using it found it was stopping the blood flow right above my calf. So i notified customer service about my issue, and they are sending me a Medium at no charge to me. Customer service gets back to you immediately, thank you Pro Fitness. And thank you Benj",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Love my new sleeves, protects the knees...",
      "text": "I'm glad I purchased these knee sleeves. I'm 32 and have slight patella pain in my right knee. Which is getting better. These help when I do my squats. I never do squats without them now. Even if my knees don't hurt. My knees measure a little below 14 probably 13.8ish I bought the mediums but felt like they should be extra snug. They sent me smalls at no charge! Which was awesome. The only thing I say is only wear them when your working out then take em off. I'm very with the satisfied and the quality is great as well!",
      "rating": 5.0,
      "verified": true,
      "author": "F.w.",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great For Squatting",
      "text": "If you're old like me, you can never tell when your old knees are going to squeak and groan over to the squat rack. Or, when a sharp pain will emerge and you're going down into a squat. These knee sleeves are not flimsy. They are sturdy and they keep your knees warm which eliminates a lot of pains and lets you concentrate on your workout.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "These were incredible replacements until....6 months later they split at the seam! :o(",
      "text": "Bought these in November 2019. Been using them regularly on average 2-3 times per week for crossfit workouts. Took a couple months off when covid hit, and now back to regular use and one of them just split at the seam. I'm so bummed bc I felt like these really did provide some great stability.",
      "rating": 1.0,
      "verified": true,
      "author": "C. M. Pettis",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Felt stronger!",
      "text": "Just received a couple of days ago, wore them yesterday during my leg workout and they awesome. Been having sore knees during my heavy leg load and after using them, no soreness what's so ever. Was also to push 460lbs up 20lbs from last leg session without any stress. Stronger with the profitness knee sleeves. Glad I bought them! Definitely reccomend, also quality is great and great firm fit!",
      "rating": 5.0,
      "verified": true,
      "author": "Ewlises Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Good QUALITY material.",
      "text": "An exact fit with no breathing room so be sure to choose your correct size. There's limited stretch, although I am 5'10\". Other than that, I really like these. You can immediately tell this is some QUALITY STUFF. Nice and thick. No rolling down, expensive feel without the expensive price, all around nicely done. This company and customer service are GRADE A. New favorite brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Tomi",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "What a relief",
      "text": "Wow x 99. These made today’s squat workout so pleasant. I felt my quads and glutes isolated rather than feeling joint pain from the heavy lifting. My legs are nowhere near as sore as they were from previous leg workouts. In fact, I will have to go up in weight because knee pain is non-existent. The carrying pouch is convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank S. Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Solid support",
      "text": "Great knee sleeves, I have a torn pcl in my left knee so I usually wear a brace but that hindered my range of motion way to much and caused more problems. So I looked around and found these. Although it’s not a replacement for a brace these made my knee feel 100% more stable. I only wish they were maybe 2ish inches longer, I’m 6’4 and have really long legs but they still work really well and fit good",
      "rating": 5.0,
      "verified": true,
      "author": "tery",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Worth every penny",
      "text": "Tremendous help for my weightlifting. Night and day difference as soon as i put them on. If you're serious about weightlifting I highly recommend picking a pair up. You can't go wrong with a lifetime warranty, if i ever have a problem with these i'm happy to know they're covered. They're a complete gamechanger.",
      "rating": 5.0,
      "verified": true,
      "author": "maggie&teddy",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Really great buy!",
      "text": "I got these for a powerlifting competition coming up and they are pretty nice. It comes with a bag to carry them in. Only issue I had was the smell when first opening them and the size. They were a little snug. Luckily this company is awesome and they give you a flyer with your order with the contact info the swap out for a bigger size! I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Second set and not my last",
      "text": "This is my second set of ProFitness knee sleeves and I love them. I can't say enough about the quality of ProFitness products and fit is great. I went down a size this time because I noticed my XL's were a little loose in the small of my knee. I thought the XL's were nice but getting the correct size made it even better. Stick with ProFitness knee sleeves! They are an amazing game value compared to other brands and really give a sense of comfort on things like lunges, and pistols.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Moos",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Great product",
      "text": "Finally got a chance to wear these this week for a couple of CrossFit workouts. I am wearing them for heavy squats and anything that requires my knees to hit the floor. I ordered size medium, despite the website suggesting large, and they were pretty snug but worked perfect. They kept my knees warm and mobile throughout my workout. They were sweaty when I took them off but that is to be expected. I am so glad I finally broke down and bought these.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "My knees feel ten years younger",
      "text": "These have revitalized my workout. Not only have I reduced my knee pain, but I have been able to increase my movement. It's like taking ten years off of the joints. They are so good that I have ordered two more pairs for other people. One is a fellow teacher and the other is my senior quarterback. With these he was able to work past a knee sprain and get back to playing basketball. I highly recommend them. The larges fit just as they should for my legs, tight but not uncomfortable. They have also dried out well overnight and have not developed a bad odor yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Fits perfectly",
      "text": "I have only used the sleeves twice since arriving. I had meniscus problems in both knees. I had no issue during my first two sessions with machine squats. There is a noticeable smell of rubber at first, but, it is almost gone after airing. Using the ProFitness Sleeves allows me to wear them under my normal gym clothing and remove them when I return home.",
      "rating": 5.0,
      "verified": true,
      "author": "Photon713",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "If you have knee pain  these are worth every penny.",
      "text": "I have periodic knee pain and a I haven’t been able to run or squat very well which is why I purchased these. First day back at the gym and these gave me the much needed support I needed. My knee already feels better. I’m 5’10 190lbs and got size medium they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "alecon",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Amazing product and customer service.",
      "text": "I don't think I have ever left a review on a product before. But here I am. First I should say that the product is amazing. I primarily use the knee sleeves for squatting and they provide great support while still allowing a full range of motion. About a few days ago I noticed a small tear in the back of one of the sleeves, and contacted customer support. Literally within minutes I received a reply and was told I would receive new sleeves free of charge. It took about two days and I have already received the knee sleeves. If you're looking for a great product and outstanding customer service I would highly recommend purchasing these.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisG96",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Amazing product even better customer support",
      "text": "Great customer service they sent me an extra replacement pair no charge and I did t have to pay to ship the other ones back, these keep your knees stable like no other knee sleeves obviously because of that your range of motion can be off until you add heavier weight onto the bar. Squatting 315 narrow stance is a breeze now no more knee pain and man it keeps all that heat in there. Only issue is these soak up all the sweat so be sure to hand wash them and dry them otherwise they will smell horrible. Overall wouldn’t wear another knee sleeve these are perfect for my needs",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "awesome!",
      "text": "I severely sprained my right knee about a year and a half ago and haven't been about to squat. I recently tried to squat again a month ago for the first time since the sprain. I felt discomfort and popping in the joint. I tried the ProFitness 7mm knee sleeve and they worked great. No discomfort and no popping in the joint. I would normally wear an xl but with the weakness in the joint I went a size small and got large. They are very comfortable and gave me excellent support. I definitely wod recommend this product. Rob",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Utley",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "5 Star Service and Product",
      "text": "Simply the best customer service with a great product. I had to reach out to ProFitness after having a sizing issue. Not only did they reply right away - they right away sent me the correct size. That is what I call amazing service. The sleeves are simply perfect. I do CrossFit so plenty of squats and heavy lifting. These sleeves give me the knee support I really wanted. Do not hesitate - these are the sleeves you want and need!",
      "rating": 5.0,
      "verified": true,
      "author": "JNS Perez",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Perfect fit. Follow them on Social media. Look at the Whey-sted video",
      "text": "Fit like a glove! Can't go wrong with these knee support sleeves. Even thought my left knee recovered from arthroscopic surgery years ago. Take care of your joints. Even superman gets hurt. Their warranty replacement is 1000% legit!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Montero",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "The best sleeves you can find here!",
      "text": "Those are the best Knee Sleeves I ever had, tight enough and they’re comfy, now I can squat as heavy as I want...their customer service were just amazing, I ordered M because my knee size is 13” and they were a bit loose so I contacted them and somebody answered my within 12 hrs, then they mailed me new pair with size S, I got them 3 days later and I’m very pleased, Also they didn’t ask to return the pair I originally purchased!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Great knee sleeves for power workouts",
      "text": "I bought and used these for deadlifts and squats. I would have to say that I really felt solid support for my knees during my heavy sets and even inspired me to go heavier. Support and stability with full range of motion these sleeves are worth the money. Definitely go a size larger though.",
      "rating": 5.0,
      "verified": true,
      "author": "Bull Trader",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Great purchase and excellent customer service",
      "text": "I was in need of some knee sleeves due to minor pain when squatting/ doing lunges and these did not disappoint. Unfortunately, I ordered the wrong size so it is very important that you do measure accordingly, but without hesitation I was able to receive a new pair no questions asked. Super happy with the product overall and their customer service is excellent. They really make sure that their customers are 100% satisfied. The knee sleeves even come with a lifetime replacement warranty. All you have to do is register your product. Its super fast and easy. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica V.",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Unbeatable Quality For The Price",
      "text": "The quality is really good for the price and it is a simple design as i like it Really comfy and provide really good support for ur knee and does not feel so tight It comes with a small bag where you can put it in I also found a coupon for a free gift when i opened the package which is also nice :)",
      "rating": 5.0,
      "verified": true,
      "author": "Sherif Ali",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Outstanding customer service!!",
      "text": "Ordered a size medium after going by the size instructions. They didn’t fit as snug as I thought they would. Texted the customer service number late Friday night (May15th) number on the business card that comes inside the knee sleeve package, by early Saturday morning (May 16th) my new sleeve were shipped and are on there way! Cant say enough about the great customer service!!!! Thank you Benj you were fantastic. Will definitely buy from here again !",
      "rating": 5.0,
      "verified": true,
      "author": "Jade Vira",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Knee sleeve",
      "text": "This product works great. I have used it the day after I purchased it. Keeps nice tight compression on your knees and allows for great mobility. It also came with a carry bag, I didn’t know that; added bonus. Customer service was very responsive when I emailed with a question. Overall I really like these knee sleeves. I would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "JohnG",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Try it and you will be happy",
      "text": "The idea of purchasing something to help with knee support never really crossed my mind because I figured it wouldn't make much of a difference but I was definitely WRONG! The fit feels nice and comfortable and now I can do lunges and squats with hardly any discomfort. I tried their weight lifting belt and loved it so I knew this would be a product I could trust and enjoy. It came with a warranty and if you go the extra mile their promotion for a free knee sleeve or wrist strap it's definitely worth the extra time since it was easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Marco Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Recieved Used product!!",
      "text": "The first time I recieved the producth..BOTH pads were torn in the back..the white letters were so worn out and dim, it was unreadable...it was obviously USED..and not just used but like used for years! Didn’t like the fact this company is sending used products..I returned it and got a new one which works just find...The experience was horrible..waiting so long for a piece of junk",
      "rating": 2.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Good for powerlifting",
      "text": "I’m training for my first powerlifting meet and although I usually lift raw, I figured I would take advantage of them since they are allowed in competition. The sleeves kept my knees warm between sets and gave me a nice rebound at the bottom of my squat. Has a rubbery neoprene smell that I’m sure will fade the more I air them out. Customer service was friendly and prompt.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeebus",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Fantastic product for a great price!",
      "text": "I have been looking for a knee sleeves that doesn't roll down. I finally found it. With many reviews this was worth the money to spend on! This is great for squats,deadlift,running and Lunges! I tested this product on my leg day and I was blown away! Not once it roll down(I have big thigh). I didn't feel my any knee pain or when I squat heavy. The support is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine T.",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Jumping jacks usually give my knees some trouble too so I was very pleased overall with how well I managed to get through ...",
      "text": "Wore these for the first time the other day at Crossfit. I knew I would need the extra support since we were doing 400 jumping jacks, 200 walking lunges, etc. Usually my knees prevent me from doing lunges with proper form and from going as deep as I should. Jumping jacks usually give my knees some trouble too so I was very pleased overall with how well I managed to get through all those movements with the assistance of these knee sleeves. I haven't squatted or lifted heavy with these yet but I feel pretty confident that they will help.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina B.",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "No longer scared of leg presses",
      "text": "Sorry weight lifting a year and a 1/2 ago, and was nervous about squats since I play a lot of volleyball and my knees were already going signs of wear. These help stabilize my knees and there is very little discomfort now.",
      "rating": 5.0,
      "verified": true,
      "author": "RustyNell",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "5 stars",
      "text": "ProFitness knee sleeves are impressive and I've been using them for a month. It also comes with a lifetime warranty! If you're an intense weightlifter, make sure to get tight knee sleeves for a great support. They will help you when you do heavy squat, leg press, deadlifts etc. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Really great support",
      "text": "I really like these. It has definitely helped my workouts, my knees feel super supported. The sizing guidelines were very helpful. I would have ordered an XL based on what I THOUGHT I should wear, but went with the Large based on the sizing and they're perfect (snug - at first I thought I went too small - but once I got the hang of putting them on, I can clearly see they're perfect). They slip slightly when worn over my leggings and when doing a crazy number of squats. But overall I'm super happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great knee support!",
      "text": "Tried these for the first time for squats yesterday and I was able to squat 185 with no problem. Haven't been able to squat that amount with out feeling some type of slight pain in a while. With the sleeves, there was no pain in my knees. The compression felt really good. Just tight enough to still have support but mobility at the same time. My knee measures around 14 1/2 so a medium worked just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Myleah ",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Great supportive piece of equipment",
      "text": "Black L - 7mm knee sleeves. I'm 6' 2\", 230lbs and these fit snug and perfectly. They give plenty of support and keep my knees very warm. I don't feel like they limit ROM at all and I would highly recommend them to anyone considering adding these to their lifting equipment arsenal. I use them for deadlifts, squats, cleans, snatch, lunges, and even some WODs. Be aware, they can get very sweaty and can take a while to dry out, so don't leave them in your workout bag all day if you go in the mornings.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Seems ripped",
      "text": "Update. . . After only a month and a half, both sleeves ripped on the seams. And also ripped holes in other parts. They don’t hold up over time. (Customer service seems great though, they email you after purchase, and ask you to give a review) 2 months in, they slide down",
      "rating": 1.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20190518
    }
  ],
  "product_meta": {
    "title": "ProFitness Knee Sleeve Squat Support and Compression for Powerlifting",
    "description": "The Best Neoprene Knee Support Compression Sleeves Are Now Available On Amazon! \n\nWorking out and following a healthy lifestyle is of paramount importance. Nevertheless, we should always keep in mind that taking care of and properly supporting our knees should never be neglected. \n\nPrevent Injuries, Reduce Pain And Help Your Body Recover At A Faster Pace \n\nThe ProFitness, 7mm knee support sleeves have been specially designed to provide maximum support and shield your knees against injuries caused by intense workout. These incomparably sturdy knee compression braces keep your knee joints steady and warm in order to reduce injury risks. \n\nWhat is more, they provide orthopedic support and compression and they help you enhance your performance and enjoy full range mobility even after being injured. \n\nIdeal For All Athletes And Fitness Enthusiasts \n\nThese top notch knee compression sleeves are the best choice for anyone who like to exercise and take care of their body. They are suitable for powerlifting, weightlifting, cross fit training and countless other types of intense exercising. \n\nKeeping you satisfied is our priority. This is why we offer you a 1 year money back guarantee in case these support and compression knee sleeves do not meet all your demands. \n\nDo Not Waste Time And Place Your Order Now While Supplies Still Last!",
    "rating": 4.8,
    "feature_bullets": [
      "ENJOY MAXIMUM SUPPORT AND IMPROVE YOUR PERFORMANCE: ProFitness presents you with the best knee support sleeves on the market. They can provide graduated compression and keep your knees firm and perfectly supported, allowing you to enhance your athletic performance.",
      "PROTECT YOUR KNEES FROM GETTING INJURED: These top notch compression braces can aid joint recovery caused by an injury. Now, you can eliminate the pain and enjoy a faster recovery thanks to the premium orthopedic support that these 7mm neoprene knee sleeves provide.",
      "THE BEST KNEE SUPPORT CHOICE FOR ALL TYPES OF EXERCISING: Whether you are an experienced athlete or a fitness enthusiast, these knee sleeves are the ultimate choice for you. They are ideal for weightlifters, powerlifters and cross fitters who work out hard and need maximum knee support when lifting weights or doing squats.",
      "HEAVY DUTY CONSTRUCTION AND ERGONOMIC DESIGN: Forget about cheaply made compression braces that do not last long. The ProFitness knee compression sleeves are made of sturdy neoprene material and they feature reinforced stitching. What is more, their ergonomic design provides the perfect fit and assures maximum comfort.",
      "100% SATISFACTION GUARANTEE: Providing you with the friendliest customer service is our number one goal. This is why our products are backed by a 1 year warranty to assure that we will not rest until you are 100% satisfied with your purchase."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Item model number": "73-YGT7-QI7T-Parent",
      "Department": "Mens womens",
      "Date First Available": "April 8, 2016",
      "Manufacturer": "ProFitness",
      "ASIN": "B01N5LODXD",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Braces, Splints & Supports",
      "Medical Supplies & Equipment",
      "Sports & Outdoors",
      "Knee Braces",
      "Health & Household",
      "Leg & Foot Supports"
    ],
    "price": 32.95
  }
}