{
  "website_summaries": [
    {
      "verdict": "Unless slick style is your only concern, skip the Sony Xperia XA for a cheaper phone with better features.",
      "pros": [
        "With a super-skinny bezel, the Sony Xperia XA is a great-looking phone that's comfortable to use in one hand"
      ],
      "cons": [
        "Its low screen resolution, short-lived battery and meagre amount of built-in storage are major setbacks",
        "Sony has loaded the phone with a horrible mess of bloatware"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 5.0,
        "Performance": 6.0,
        "Camera": 7.0,
        "Battery": 6.0
      },
      "publication_date": 20160819,
      "rating": 6.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "NOT UNLOCKED",
      "text": "If I could give this zero stars I would. I recently bought two other Sony phones and they worked like a charm. Popped my sim card in and had no issues whatsoever but oh no not with this one...I tried my t-mobile sim and two other gsm carriers sim but it keeps asking for SIM NETWORK UNLOCK PIN.This was a gift for someone in the Caribbean so I ended up having to take it back with me to the US for a return; major inconvenience!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mellissa",
      "helpful_votes": 18,
      "publication_date": 20181017
    },
    {
      "title": "Pretty cell phone",
      "text": "Very elegant shape and good quality cell phone in reasonable price. When I went to AT $T store to set up SIM card, service people loved it a lot since Sony cellphones are not vey popular in US.",
      "rating": 5.0,
      "verified": true,
      "author": "Jovita Chow",
      "helpful_votes": 21,
      "publication_date": 20170225
    },
    {
      "title": "Great.",
      "text": "All in all a great phone, especially for the price. Nice aluminum back, good screen, and the battery is about average. I'm a heavy phone user, Netflix and Pandora all day, and so far the battery can last me at least the entire day. The camera quality actually shocked me, it's fantastic for a budget phone or even a higher end device. All in all I think it was a good purchase. One complaint would be the fact that the phone did not come with headphones, but heck that's a small complaint.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria Smallwood",
      "helpful_votes": 4,
      "publication_date": 20170725
    },
    {
      "title": "Kind of cool but I will replace as soon as I get around to it",
      "text": "Nice phone but kind of a slow processor compared to new expensive phones, the camera works when pointed down but lift it to take a picture and the thing disappears that you press to shoot. So forget about using the camera. Then there is the issue with the phone being from south america, when texting it wants to autofill words with spanish. Changing all settings to english does nothing to fix this. Takes twice as long to send a text! I will be replacing this phone in a week or two! Then I'll have to sell it for half what I paid here just to get rid of it.",
      "rating": 2.0,
      "verified": true,
      "author": "Karr Knutt",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "I love this cell it's has everything I need in a ...",
      "text": "I am a Sony electronics lover, I love this cell it's has everything I need in a cellphone and more, I am still exploring it.one questions I have is this cell 2 sims",
      "rating": 5.0,
      "verified": true,
      "author": "mirtha taylor",
      "helpful_votes": 5,
      "publication_date": 20170525
    },
    {
      "title": "Durability is the best for people who are like me. 19 DIFFERENY",
      "text": "Amazing phone it has outdated touchscreen response battery life has not been good at all due to the fact that phone was frozen when it came in. DURABILITY LASTED LONGER THAN I EXPECTED. AFTER 19 PHONES BROKE AND BOUGHT LAST YEAR. I had to mention the proper details I am typing my review with this SONY XPERIA and I am honestly happy to tell you that these phones have lasted longer than so many of my Samsung phones. Take it easy and buy one of these phones for you or your favorite person.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel W",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "very disappointed",
      "text": "do not buy this phone if you're living in NYC, the mobile data will not work. i don't know about other networks but mine is T mobile and it is not working. Customer service for T mobile confirmed it will not work and now i have to go through the headache of returning the phone. why didn't they clearly say this before i buy it? some people enjoy wasting time",
      "rating": 1.0,
      "verified": true,
      "author": "George botros ",
      "helpful_votes": 2,
      "publication_date": 20181027
    },
    {
      "title": "Don't even think about it.",
      "text": "Phone is a piece of crap. First I had to return it for the external speaker failing. it has always taken a long time to charge buy the other day it became uncomfortably warm in my pocket. Now it ony work connected to the charger. Previously I had an Apple Iphone 4 for 4 years and it still work better than this loser. I bought on Sony name and price, boy was that a mistake. All I can do now is have it repaired under warranty and put it on swap shop for $50.",
      "rating": 2.0,
      "verified": true,
      "author": "kunner",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Sony should have stuck with Walkmans",
      "text": "I will never buy a Sony phone again. Bloatware that you can't disable and that updates itself using cell data instead of over Wi-Fi as selected. After an Android update, the phone would not reliably ring or sound the alarm clock. It took a month for Sony to fix the issue and were cagey about it being a Sony issue. Multiple help forum responses had people removing apps until they found the culprit when this was a known issue during previous updates. The phone itself is pretty standard, although slow and frequent apps not responding. In short, Sony should have stuck with Walkmans.",
      "rating": 2.0,
      "verified": true,
      "author": "Shannabanana",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "TOTAL GARBAGE!!!!!",
      "text": "This phone was set up to work in latin America not in the USA. IT WILL NOT ALLOW PICTURE OR VIDEO MESSAGES LIKE EVEN THE WORST CHEAP PHONES DO. It took hours just to be able to view youtube then stopped working. calls and regular text messages work, but I am limited to only that and its unacceptable.",
      "rating": 1.0,
      "verified": true,
      "author": "bbbb",
      "helpful_votes": 2,
      "publication_date": 20190410
    },
    {
      "title": "Good little android phone",
      "text": "Works properly when you don't put too much apps. Seems to slow down when you have many and honestly the small memory won't let you fill it up with a lot of apps. Can't even transfer all apps to a micro SD card as it retains partial memory in the main storage.",
      "rating": 3.0,
      "verified": true,
      "author": "Fourblades",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Great phone, NO wifi calling at all.",
      "text": "Great phone, it does \"almost\" everything my previous $600+ phone did.. It will be five (5) stars if it had WiFi calling as an option (as some other Sony models do).",
      "rating": 4.0,
      "verified": true,
      "author": "Jorge",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Very good phone, albeit some apps do run a bit ...",
      "text": "Very good phone, albeit some apps do run a bit buggy on it. Can't fault the phone, that'd be down to the app or the Android version that is running on the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "RetiredMosin",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Great buy!",
      "text": "Perfect for a smaller hand, most of the the bells and whistles of a new $800 phone for fraction of the price. I.d like to see a new Sony with a small foot print as small as the Experia XA with a 23mpx camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam M",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Short life span",
      "text": "When it worked it was a greart phone, but I've only had it five months and the charge port stopped working. Now it won't charge past 0% and I'm getting white and green lines on the charge screen. Did all the trouble shoots and didn't fix anything.",
      "rating": 1.0,
      "verified": true,
      "author": "Mctavish96",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Bad battery life, cannot charge even when I used the different charger",
      "text": "I bought my mom this Sony Xperia XA. At first, I was really excited about the picture quality when I had a video call. 2 months later, my mom can't charge the phone anymore even though she tried to change either the cable or the charger. I called Sony but they can't help because at that time my mom with that phone was in Vietnam. I felt really bad about the quality of this phone. I chose Sony because of its quality but they made me disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Tu T.",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "would recommend",
      "text": "I love this phone!! Haven't had any problems with it, run smoothly, doesn't freeze and runs my games apps nicely. Would recommend this phone. Also love the rose gold.",
      "rating": 5.0,
      "verified": true,
      "author": "Erie'Anna Mc",
      "helpful_votes": 11,
      "publication_date": 20170109
    },
    {
      "title": "This is a terrible phone. Already returning it!",
      "text": "This phone looked nice out of the box, but that was it! It wouldn't update anything properly, kept performing the same sony and android update over and over again. The phone had no IEMI number until i had to reset it 4 times. The keyboard was glitchy and the phone overall was annoying! I just got it today and already not putting up with it. This is the worst of the Sony phones! The XA is not a good phone. Atleast mine wasn't. Defective.",
      "rating": 1.0,
      "verified": true,
      "author": "Robin Nadeau",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "It's legit.",
      "text": "Arrived in the mail today. A bubble wrapped around the box it came in and it looked repackaged. Came with no manual (not that I'd need one) or headphones. I slid my old Sim card into it's mini Sim card slot and signed in with my old phone number intact. I'm using atandt Lte. So it was definitely unlocked.",
      "rating": 5.0,
      "verified": true,
      "author": "Tefaly Marcus",
      "helpful_votes": 2,
      "publication_date": 20170812
    },
    {
      "title": "IT IS NOT UNLOCKED!",
      "text": "WHEN I PUT THE SIM CARD IT NEEDS A \"SIM NETWORK UNLOCK PIN\" I TRIED WITH A LOT OF DIFFERENT SIM CARDS AND DOES'NT WORK, AMAZON DID NOT GIVE ME A REFUND OR CHANGE. SO I TRIED TO CONTACT THE SELLER AND THEY DON'T ANSWER MY E-MAILS. I LOST MONEY. TRUST ME DON'T BUY THIS.",
      "rating": 1.0,
      "verified": true,
      "author": "Ivan Martinez",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Don't allow the modest price reel you in, it's an iPod touch with no data connection.",
      "text": "WILL NOT WORK ON T-MOBILE SATS. IN U.S. Phone is meant for Mexico, and is either locked (even though it states otherwise) simply does not have the means to connect to what was described.",
      "rating": 2.0,
      "verified": true,
      "author": "K1NGPE4SENT",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Nice Deal",
      "text": "awesome phone for the price I got it for, battery life is not great enough to get me through the day with heavy use, but with normal texting and calling it gets me through the day and then some. My previous phone had broke and this was a quick and nice replacement! never used sony brand phones before and so far Im liking it (:",
      "rating": 5.0,
      "verified": true,
      "author": "Vianca",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Sony Xperia xa!",
      "text": "Purchase as an unlocked phone but keep asking for Sim network unlock PIN. I go as far as to enter my t-Mobile sim pin and still no luck. Went online and try to purchase code and keep getting back refund with no help.",
      "rating": 1.0,
      "verified": true,
      "author": "Shimpy",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "WORST XPERIANCE EVER FOR $200",
      "text": "The phone didn't last a month and the screen started having a foggy like colour and sometimes lines from top to bottom. Amazon told me their warranty is already expired so I cannot return it. It's a piece of crap for almost $200 going to waste!! I presume Amazon sold me a used phone!!",
      "rating": 1.0,
      "verified": true,
      "author": "robert ngugi",
      "helpful_votes": 4,
      "publication_date": 20171002
    },
    {
      "title": "Beautiful phone.",
      "text": "I don't want smaller bezels or a larger screen, so I personally love the size and shape of this phone. It's pretty sexy as phones go. It runs quite smoothly, and the build quality is actually excellent! The main downside is just the battery. It's okay, but not great, as most new phones have better battery life I think.",
      "rating": 4.0,
      "verified": true,
      "author": "Dane R.",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Dont even try it",
      "text": "The Cellphone Die after 4 MONTH of Use and Amazon do not cover the Warranty after 1 Month you have to go straight to Direct MFG, Terrible unit do not waste your Money, I ship this Phone to Cuba so pretty much i Loss my money.",
      "rating": 1.0,
      "verified": true,
      "author": "jose",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Its light weight and perfect fit for smaller hands",
      "text": "I love the battery life of this phone. I've been playing this one game for 2 days straight and I'm only at 43%... I have small hands but this phone fits perfect. I also love the color",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "It's not unlocked",
      "text": "I am so mad because its not unlocked. I've been trying to get in touch with the seller but it has been unsuccessful as this is the only product I have bought where I don't see that option. Tried to contact amazon customer service but got no help there. When I placed my sim card inside it asked for unlock code. The worse part is that I left the country with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Was not unlocked when purchased but",
      "text": "I am in the Caribbean and I contacted the seller and got the unlock code thanks again!! The phone now works.",
      "rating": 5.0,
      "verified": true,
      "author": "Shan",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Good phone for the price. Excellent backup phone.",
      "text": "Not water resistant but still a good phone even though the headphone jack didn't work. I'd have to use Bluetooth headsets or headphones to listen to music.",
      "rating": 4.0,
      "verified": true,
      "author": "JASON GUTIERREZ",
      "helpful_votes": 0,
      "publication_date": 20170705
    },
    {
      "title": "Sony at its best",
      "text": "I've had my phone about 6 months now and it has standed the test of time I have dropped, cracked and spilled and it is still holding on I now know that I will have to get another phone but it is tough so if you are a person who is clumsy but don't want a ugly phone this for you",
      "rating": 5.0,
      "verified": true,
      "author": "JASMINE",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Really good phone",
      "text": "I am using this phone for more than three years and I bought it for my brother. Both of us are satisfied with the quality and ease of use. We love Sony brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "good",
      "text": "phones look good but the software was slow compared to this generation",
      "rating": 4.0,
      "verified": true,
      "author": "komuravelli",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Does the job",
      "text": "I's sure it's saved my phone from breaking after being dropped several times. However, dust and dirt get in the case and I still have to clean it out periodically.",
      "rating": 4.0,
      "verified": true,
      "author": "mar",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Nope...",
      "text": "Don't get this phone! The touchscreen is unresponsive a lot and glitches as well. This is the first week of using it. Guess I will be going back to Samsung. Too bad because I like many Sony products.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew F.",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Worth it",
      "text": "Dident even know that Sony made phones This phone was world universal and I had MO problons getting it hooded up n switched.. I love this phone",
      "rating": 5.0,
      "verified": true,
      "author": "Is ok",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Falsey advertised.",
      "text": "Phone was advertised as unlocked but is very much locked. keeps asking for sim card unlock code which you can only purchase from a provider for $40+. Don't buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Alva L. Francis",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Replacement phone for my mom",
      "text": "Good price for a mid range Sony phone. My mom loves it and it's not too upscale for her.",
      "rating": 5.0,
      "verified": true,
      "author": "adm_18",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Don't worry about it the phone is amazing",
      "text": "Amazing phone great size fast and best thing about it it's andoird with Sony's best Suport curved glass I would definitely recommend it to my friends",
      "rating": 5.0,
      "verified": true,
      "author": "Marcos",
      "helpful_votes": 3,
      "publication_date": 20170601
    },
    {
      "title": "Battery die with in a day with fully charged. Shipping take too long to received.",
      "text": "Battery die with in a 2 hours with fully charged.",
      "rating": 1.0,
      "verified": true,
      "author": "Murvy Hinh",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Unhappy",
      "text": "I have had this phone for 3 months, and last week the screen got all these wierd lines. I'm very disappointed. I had my last phone for 9 years, so I know it's not because I'm hard on things.",
      "rating": 1.0,
      "verified": true,
      "author": "Cassy birkeland",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Locked phone",
      "text": "DO Not buy from QUICKDEALZZ!!! Received the phone (Sony Xperia XA) few hours ago. The phone is locked to ATT network.",
      "rating": 1.0,
      "verified": true,
      "author": "Tati",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Very good for gaming!",
      "text": "Really love this photo will be buying XA1 next they send unlock code and it worked flawless",
      "rating": 5.0,
      "verified": true,
      "author": "Magik Productions",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Usable for little over a year",
      "text": "This phone did not age well. The processor speeds slow considerably with use, the battery life was small from the start and deteriorated FAST. Much better choices out there.",
      "rating": 2.0,
      "verified": true,
      "author": "Leonor",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "No phone was inside the box and yes the box was sealed",
      "text": "No phone was inside the box .... only a charger",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Phone broke 2 months after purchase. Screen flashing nonstop ...",
      "text": "Phone broke 2 months after purchase. Screen flashing nonstop. Physically giving me a headache. Contacted the seller and they told me to contact Sony. Contacted Sony and they gave me an estimate time of 1 month for warrenty repair. If you are looking for a reliable phone, do not buy this POS",
      "rating": 1.0,
      "verified": true,
      "author": "Wilson P.",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "I really enjoy this guy",
      "text": "I really enjoy this guy, bought to replace an iPhone 5s. Works well with ATT (unlocked) and I recommend this phone to my friends for its value and utility.",
      "rating": 5.0,
      "verified": true,
      "author": "Giancola",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Touch screen does its own thing",
      "text": "After about 5 months of usage, the touch screen went crazy, opening and closing programs by itself, almost impossible to use. We did get a refund an now looking for a non-Sony phone.",
      "rating": 1.0,
      "verified": true,
      "author": "wensink",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Battery and sound are horrible",
      "text": "Battery life is short. Sound is very faint compared to every other phone I've ever had. I can't hear the alarm.",
      "rating": 3.0,
      "verified": true,
      "author": "Laura Reynolds",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Not a good fit for me",
      "text": "I returned it the same day I received it. It takes along time to charge the battery and it dies very fast. The mic and speaker both very poor quality",
      "rating": 3.0,
      "verified": true,
      "author": "S. Gwen",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Unable to unlock the phone",
      "text": "Phone was in good condition, comes with an a&t sim card. I have tryed several times to unclock that phone, but wasn't successful.thats why I have returned the phone back to the Amazon. I think I got my refund to.",
      "rating": 1.0,
      "verified": true,
      "author": "Raman",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "... bought this to replace my windows phone but its worse than that",
      "text": "I bought this to replace my windows phone but its worse than that. All xperia devices cant format sd cards to internal, it restarts and freezes after the 7.0 update and it cant hold a charge. Im going back to my Lumia 550. at least i never had any of these problems with a low end windows phone.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "The battery life isn't totally amazing but i do love the camera quality very much",
      "text": "The battery life isn't totally amazing but i do love the camera quality very much. As I'm really big into social media. I would recommend if you do purchase this phone to buy an SD card if you enjoy taking pictures or know that you use apps. Overall I enjoy this phone. It's really good for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Venus Snow",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "The item has been unboxed",
      "text": "I bought a new one but received an unboxed one. Dust on the charger and cables",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "The Great Sony Xperia XA",
      "text": "Works great. It is really good for international calling and video calls. The internet function on it is also exceptional. I have really enjoyed it. I have recommended this phone to my friends. Many of my friends also enjoy it also!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CJweebee",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Waste of money",
      "text": "This phone didn't even last six months. Phone screen just went blank and couldn't see anything at all. Waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "dawseanne williams",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Very disappointed!!",
      "text": "I bought this phone only 5 months ago and already it does not charge, complete battery failure so now this phone is completely useless",
      "rating": 2.0,
      "verified": true,
      "author": "Debbie Francis",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "other inserted SIM...",
      "text": "I tried to insert SIM, but other SIM has been already inserted 'without SIM tray'. Then I couldn't pull it out. Too bad and too sad.",
      "rating": 1.0,
      "verified": true,
      "author": "Aiji Komiyama",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Five Stars",
      "text": "Love my phone! It's the right size and it goes well with my case.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170404
    },
    {
      "title": "I really came to like this",
      "text": "I really came to like this, it is decently fast and the ONLY thing I found against it, is that has a slightly low res display.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua James Feenstra",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "One Star",
      "text": "After 6 months the screen turns off suddenly, i m regretted of this purchase",
      "rating": 1.0,
      "verified": true,
      "author": "joseph",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "its ok",
      "text": "its ok the phone but the battery doesnt last all day,,barely half of day",
      "rating": 3.0,
      "verified": true,
      "author": "ExR",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "One Star",
      "text": "Don't ever buy this phone. It's junk tried to return it got know where it. Jo smith",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Functional Phone",
      "text": "Good phone and excellent service but battery life very poor. This maybe due to the phone model rather than quality issues such as refurbished battery. Functional product which does the job",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "This phone was good for about a month",
      "text": "This phone was good for about a month. The screen already has burns in it after 6 months of use. It is slow and it freezes a lot. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Jayne Henry",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "... the phone for about a year now and I love it. I plan on upgrading to a newer ...",
      "text": "I've had the phone for about a year now and I love it. I plan on upgrading to a newer Xperia. I got. Mines in rose gold so went I first opened the box I fell it in love with everything about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Frazier",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Amazing Phone well packaged and i dint have any problems",
      "text": "Amazing Phone well packaged and i dint have any problems. Comes new and untouched which is very important when buying new products",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "He loves it Price and quality is good..",
      "text": "I bought it for my father in-law for his birthday ... He loves it Price and quality is good ...",
      "rating": 5.0,
      "verified": true,
      "author": "M Ozdamir",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "not recommended",
      "text": "after 2 months of used i got a problem with the screen which appears of a broken lines not recommended at all",
      "rating": 1.0,
      "verified": true,
      "author": "fanta c.",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "This phone is great, like everything",
      "text": "This phone is great, like everything: design, functionality, camera, everything is OK. delivery fast, thanks Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Disappointed. The battery is bad",
      "text": "I bought the phone thinking it is in good condition, but the battery is bad. In the one day of having bought it, the phone is downloaded in just half a day. I'm disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "David Adan",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Mad can't return",
      "text": "This phone is nice, but I couldn't get it to work with any phone service. Kinda mad cause I can't return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Owen B.",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Works good but I didn't check all the details before purchasing",
      "text": "Works good but I didn't check all the details before purchasing, it cannot receive my carriers LTE signal, does not support that frequency....but other wise great.....Thank You",
      "rating": 4.0,
      "verified": true,
      "author": "Henlou",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Charger port",
      "text": "Disliked it had it for 2 weeks n when I went to charge it didnt work ne more",
      "rating": 2.0,
      "verified": true,
      "author": "Michael L.",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "speed is very good phone. For the overheats is the only reason ...",
      "text": "It is an incredible phone, but sometimes overheats, apart from camera, apps, speed is very good phone. For the overheats is the only reason to give 4 stars",
      "rating": 4.0,
      "verified": true,
      "author": "Orangel",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Five Stars",
      "text": "excellent device, the unique i don't like speaker, very little sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Hector Alonso Ojeda",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Slip card slot doesn't work",
      "text": "Sim card slot doesn't work, device doesn't register working Sim card. Other than that seems to work fine.",
      "rating": 2.0,
      "verified": true,
      "author": "JunePhan",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Better than expected",
      "text": "Good phone for the price, good picture, solid feel, a little to much bloat which can be taken care of. Miss the quick dial keypad assignment from my old phone which transferred to my BT in my car. Contacts are listed but now have to page through them when driving. Have not be able to find an app to give me what I had. Capability came with my old Samsung. Keypad could be a tad smaller, to make it easier for one hand dialing,,,I have piano fingers, and still cumbersome to dial.",
      "rating": 5.0,
      "verified": true,
      "author": "MJD65",
      "helpful_votes": 3,
      "publication_date": 20170130
    },
    {
      "title": "Nice phone, was in my country within 4 days ...",
      "text": "Nice phone, was in my country within 4 days after the enitial order was placed.. But it spent more than a week in customs for clearance",
      "rating": 4.0,
      "verified": true,
      "author": "James Dalgleish",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Five Stars",
      "text": "The product is of quality and the seller's service is optimal.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Four Stars",
      "text": "The phone works great. Nice smartphone with low prices. The only problem is the photos are not so nice.",
      "rating": 4.0,
      "verified": true,
      "author": "BIZHU LI",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Xperia doesn't disappoint",
      "text": "Wonderful handset for the price. I have always used Xperia's and this one hasn't disappointed so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael K Mwebaze",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Three Stars",
      "text": "Good price if you want a spare phone, slow and spotty connection thought",
      "rating": 3.0,
      "verified": true,
      "author": "Phu Tran",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Two Stars",
      "text": "Poor battery. I had to recharge three times a day. No storage. Always freezing up.",
      "rating": 2.0,
      "verified": true,
      "author": "danielle",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "definitely a great purchase!",
      "text": "Works perfectly with cricket. Got it quick and on time, got lots of compliments about the phone, definitely a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Exerblank",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "I was happy with this product",
      "text": "I was happy with this product, it works great, I was a little disappointed when I realized that the xa doesn't contain a Snapdragon, but instead the Helio, so I was a little worried about it overheating, but I don't have a problem with that, so far it stays cool, but I guess I already knew what I was getting. Anyways I was really happy with the shipping and handling of the product, it came on time and exactly as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Enns",
      "helpful_votes": 4,
      "publication_date": 20161116
    },
    {
      "title": "Five Stars",
      "text": "Box wasn't probably sealed everything was in the box untouched though",
      "rating": 5.0,
      "verified": true,
      "author": "natalie rose diaz",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Five Stars",
      "text": "it was nice but the only problem it was no headphones in the box",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "I am very sad for that but I need it and can't send ...",
      "text": "I bought 2 phones. One of them was all scratched. I am very sad for that but I need it and can't send it back. I feel trapped.",
      "rating": 3.0,
      "verified": true,
      "author": "Maicon Venâncio",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Great first Sony Phone",
      "text": "Love it. If you read the specs then you know what to expect. Perfect for what I wanted and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Great, the performance of this phone is very good ...",
      "text": "Great , the performance of this phone is very good I'm so happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "miguel arroyo",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Screen goes crazy after a few days!",
      "text": "Worst Experience! Within a week of using the replaced unit ( the original was returned for the same reason), the screen began to flicker continuously! The original unit had the same freaking problem which started on the 28th day of purchase. Asked a refund from Amazon - awaiting it since. there must be some problem with an entire batch which has churned up defectie items. Avoid this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170606
    },
    {
      "title": "Five Stars",
      "text": "Love this phone so far so good. Was in brand new condition and exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari Keyotn",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "At least it's pretty",
      "text": "It's a nice phone and I do enjoy using it however there are a few bugs with the software and engine of the the phone",
      "rating": 3.0,
      "verified": true,
      "author": "Greg Otero",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Three Stars",
      "text": "The battery don't last and phone stays hot while using some apps",
      "rating": 3.0,
      "verified": true,
      "author": "peter sarkodie-asabre",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "rounded edge screen is a bad idea",
      "text": "I was happy with my Sony Xperia M4 Aqua until it got the dead screen thing it is susseptiple to. Went with this in a rush, wish I had know about issues with this screen, random screen actions while I'm using it while it's in my hand. Also 16GB is anemic nowadays for storage, glad it has sd slot. OK phone but too low of storage and very lame screen style.",
      "rating": 3.0,
      "verified": true,
      "author": "NY Book Dude",
      "helpful_votes": 2,
      "publication_date": 20170509
    },
    {
      "title": "Good.",
      "text": "Awesome phone, very fast and convenient. Also was delivered in two days with no problems. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark D",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Great Sony Phone",
      "text": "Sleek looking phone with iffy battery life but doesn't affect me as i am a casual user. Very beautiful interface with no noticeable lag w the operating system. It's a nice metal bumper with a plastic back. Mid range phone gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "alfredo marquez",
      "helpful_votes": 3,
      "publication_date": 20170517
    },
    {
      "title": "Good camera, good battery",
      "text": "Worth the price: Good camera, good battery, good performance, slim and small compared to other phones in the market, I loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Adenisa Jimenez",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "Great camera but disappointing quality",
      "text": "Camera is great, battery life is okay but a month after receiving it, which. Was a replacement if the one I originally ordered that did not work, this one has started dropping the audio of phone calls. The call is still ongoing but no sound comes from the ear speaker or speaker phone. It happens multiple times a day and I have to end the call and call people back all the time.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer Mummert",
      "helpful_votes": 0,
      "publication_date": 20170705
    }
  ],
  "product_meta": {
    "title": "SONY Xperia XA F3113 16GB GSM Phone Lime Gold",
    "description": "Style:Phone Only| Color:Lime GoldThe Xperia XA has the latest Sony design and technology at an affordable price. The 5” borderless display gives you less bezel and more view. Sony’s Exmor RS 13MP main camera and 8MP front-facing camera can capture quick shots with a dedicated camera key. The Octa-core processor delivers reliable power and performance, and a 2300mAh battery lasts up to two days to keep you going.",
    "rating": 3.7,
    "feature_bullets": [
      "5” borderless display gives you less bezel with more view",
      "Sony’s Exmor RS 13MP main camera has super-fast 0.15s Hybrid Autofocus for blur free shots,1/3\" sensor size, 1.12 µm pixel size, geo-tagging, touch focus, face detection, HDR, panorama.",
      "Sony Exmor R 8MP front-facing camera with a wide angle lens that fits everyone in the shot",
      "16GB onboard memory and up to 200GB expandable with MicroSD card; Earphones are not included",
      "SIM unlocked and compatible with GSM/LTE carriers utilizing GSM network such as AT&T, T-Mobile, Straight Talk, MetroPCS, Simple Mobile, Bright spot, Net10, h20 Wireless, Cricket Wireless",
      "Model F3113; compatible with Nano SIM Cards"
    ],
    "specifications": {
      "Product Dimensions": "5.65 x 2.63 x 0.31 inches",
      "Item Weight": "4.8 ounces",
      "ASIN": "B01FJT7EVY",
      "Item model number": "1302-2517",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.7 out of 5 stars566 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#49,020 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android 6.0",
      "Wireless communication technologies": "Cellular",
      "GPS": "Geotagging",
      "Display resolution": "1280 x 720 pixels",
      "Other display features": "Wireless",
      "Other camera features": "13",
      "Form Factor": "Smartphone",
      "Colour": "Lime Gold",
      "Phone Talk Time": "11.3 Hours",
      "Phone Standy Time (with data)": "560 Hours",
      "Included Components": "Phone",
      "Manufacturer": "Sony Mobile Communications,",
      "Date First Available": "June 19, 2016"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": 59.99
  }
}