{
  "website_summaries": [
    {
      "verdict": "From whipping up omelettes to turning eggs and other ingredients into sandwiches, you'll be reaching for this affordable machine for breakfast, lunch, and dinner.",
      "pros": [
        "Boasts oval nonstick cook plates that are designed for making perfect omelettes",
        "Shape accommodates different types of bread for turning eggs and toppings into sandwiches",
        "Trim design has a handle and is easy to transport and store"
      ],
      "cons": [
        "Not submersible and the plates aren't removable, but wiping them clean is fairly easy",
        "Food will spew over the cook plates if you overfill it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Small but mighty; makes tasty 2-egg omelets, as well as other meals like efficiently cooking a chicken breast.",
      "pros": [
        "Pillowy omelets in minutes",
        "Dual non-stick plates",
        "Lightweight, good for dorms, apartments, small kitchens or for novice cooks who simply love omelets",
        "Users report that it’s easy to clean, and has an efficient design",
        "Read the manual to ensure best results"
      ],
      "cons": [
        "Messy if overfilled",
        "Plates cannot be removed for cleaning",
        "Requires flipping unlike other models"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Eggsplosive",
      "text": "Like some others have commented, egg will burst out the sides of the machine. This happened twice during the first use of the machine. All safety precautions were followed to a tee, two beaten eggs were used, two minutes per side, latch fully locked down, and it started shooting egg out the sides with about a minute left of cooking time. Not to mention the resulting omelet looked horrible. This 1 star review is pending however if the company can tell me whether or not the unit is faulty, could just be a bad one, but given this isn't the first complaint of egg-splosions I'm not holding my breath :)",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Cote",
      "helpful_votes": 62,
      "publication_date": 20181226
    },
    {
      "title": "Perfect little cooker",
      "text": "I eat eggs everyday and i am always looking for egg cooking gadgets to save time or taste better. I only used it a couple times but each time it comes out better. I learned to not over fill it and use a timer since i get side tracked easy. Look forward to experimenting",
      "rating": 5.0,
      "verified": true,
      "author": "Eric M. Schloegel Jr.",
      "helpful_votes": 69,
      "publication_date": 20170504
    },
    {
      "title": "Easy Omlette Maker",
      "text": "Its easy to use 5 minutes your eating a great two egg omlett. Having fun changing up the ingrediants. Its small and easy to clean best one i have owned. Update after two months it quit working. It has power but the element appears to be finished its a dud. Now a one star.",
      "rating": 1.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 43,
      "publication_date": 20180630
    },
    {
      "title": "Makes awesome omelettes. Says to use 2 eggs",
      "text": "Makes awesome omelettes. Says to use 2 eggs, but with as much fillings as I put in, I think I can get by with 1 egg.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 44,
      "publication_date": 20170915
    },
    {
      "title": "My husband is totally in love with this thing he likes omelets but they never ...",
      "text": "My husband is totally in love with this thing he likes omelets but they never turned out right with this he has been eating omelets more ......Thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 40,
      "publication_date": 20180416
    },
    {
      "title": "great for cooking small meal",
      "text": "I love this thing great for cooking small meal hash browns and dessert make grilled cheese sandwich quick ham sandwich you think of it it'll work quick and easy clean up",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 26,
      "publication_date": 20180216
    },
    {
      "title": "Perfect omelette!",
      "text": "Followed the directions exactly and the omelette came out amazing! 2 mins per side and I had a delicious breakfast. Works perfectly! I only wish it had a timer to tell you when to flip it or when it’s done.",
      "rating": 4.0,
      "verified": true,
      "author": "Vincent DAmico",
      "helpful_votes": 22,
      "publication_date": 20180625
    },
    {
      "title": "Short Lived",
      "text": "I love(d) this little device. But I’ve only had it for five weeks and the Teflon has started coming off. I used it pretty religiously and according to instructions so it should last longer than five weeks. Not happy!",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa Johnson",
      "helpful_votes": 19,
      "publication_date": 20180628
    },
    {
      "title": "Five Stars",
      "text": "Absolutely love this! It is fast to cook and easy to clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 18,
      "publication_date": 20170816
    },
    {
      "title": "11 yr old daughter loves it!",
      "text": "I bought this for my 11 year old daughter after seeing a review video on Facebook. It looked so easy and I'm over her making scrambled eggs in a mug in the microwave. I made an omelette with her the first time. The second time she did it all on her own. She likes cooking but is afraid of the gas stove. This is perfect for her and easy. We just upped our school day breakfast game.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristeen A. Evans",
      "helpful_votes": 5,
      "publication_date": 20180806
    },
    {
      "title": "Best Omelette ever!",
      "text": "It made the best 2 egg omelette I have had. I sautéed onion, Serano Peppers , habanero peppers, bell pepper, mushroom , bacon and cheese . It was delicious! It won’t hold more than 2 eggs. Best to cook 1.5 min then flip and cook 1 min The only bad thing is the inside of the omelette makeris mot removable to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 6,
      "publication_date": 20190114
    },
    {
      "title": "Co Workers LOVE IT",
      "text": "The first time I used it I really liked it.I told my co worker to bring eggs and stuff. I took it to work and everyone love it. They tried to buy it on Amazon and only one was left that could get it. Hands down I love this!",
      "rating": 5.0,
      "verified": true,
      "author": "Bronzze",
      "helpful_votes": 4,
      "publication_date": 20190302
    },
    {
      "title": "Niche kitchen appliance",
      "text": "I was excited to see how many uses I could find for this appliance. After cooking a few omelets, I haven't used it much. The 'skin' of the omelet comes out tough and unappetizing while the center can be undercooked, if you follow the directions. I still plan to try burritos and other foods with this but I feel like I have to experiment to fix the tough egg skin issue, and that's not very convenient. I give 4 stars because it is well made, easy to clean and priced right.",
      "rating": 4.0,
      "verified": true,
      "author": "William Goss",
      "helpful_votes": 2,
      "publication_date": 20190228
    },
    {
      "title": "Too small",
      "text": "This product is a disappointment. It is good ONLY if you want plain scrambled eggs but you cannot make an omelet with it. We tried & it brew the ingredients out from all directions while cooking. The description says you can make an omelet so I was rather disappointed. Also, the machine is too small to make anything I made in my 5 minute chef. If I were you, I'd pay the extra money & buy the 5 minute chef.",
      "rating": 2.0,
      "verified": true,
      "author": "Leslie G.",
      "helpful_votes": 2,
      "publication_date": 20190321
    },
    {
      "title": "My protein secret machine",
      "text": "Love it. Trying to up my protein and pizza is my weakness. I dice a couple of pepperoni slices with shredded mozzarella. It will only hold one egg without running over. I beat my one egg with salt and pepper. I call it my pizza omelet. I put more cheese on my plate with a little pizza sauce and slide my omelet on top. Heaven.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyn D.",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "She works long hours and needs to have easy meals. And does this fill the need",
      "text": "Christmas gift for my daughter. She works long hours and needs to have easy meals. And does this fill the need! Cooked a chicken breast in about 5 minutes, tender, juicy and healthy! I may get one for us.",
      "rating": 5.0,
      "verified": true,
      "author": "lokismom96",
      "helpful_votes": 19,
      "publication_date": 20171227
    },
    {
      "title": "Don't over fill!!!",
      "text": "It has been reviewed before about being careful not to over fill,this is so very true. The only problem is the dish is not deep enough.",
      "rating": 3.0,
      "verified": true,
      "author": "char blose",
      "helpful_votes": 4,
      "publication_date": 20180106
    },
    {
      "title": "Fast, easy and no clean up.",
      "text": "I really liked it. I read other not good reviews and the people who wrote them just needed to read the instructions. I also really like the product \"Just crack an egg\" , because the omelette ingredents are all prepared for you, I just added an egg, mixed it up, poured in to the Dash Omelette Maker and it worked well. Cleanup is a breeze, just wipe with a paper towel (if you sprayed it as the instructions stated.) Wait until it cools and put away.",
      "rating": 5.0,
      "verified": true,
      "author": "J Smith",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great-tasting omelets, and so easy to use!",
      "text": "Got this for my 16yo zon for Christmas, and our whole family loves it so much that I just bought another one. So easy to use, and great-tasting omelets. Plus you can grill sandwiches and other things. Great addition to our kitchen, and it gets used all the time. Would be especially great for kids in college, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Wixipedia",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Fast and quick",
      "text": "I love the ease of use and cleanup, I just wish there was a timer and the need to flip it is a pain. Brought it to work so that everybody could make their own omelettes and everybody loved it. I use mine several times a week for omelettes and toasting wraps.",
      "rating": 4.0,
      "verified": true,
      "author": "HeyItsMe",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Makes Perfect Fried Eggs!",
      "text": "I use this to make fried eggs. For the life of me, I cannot fry an egg without breaking the yoke or either getting it too done or not done enough. FINALLY!! Eggs just the way I like them. Easy clean up, too. I just take a damp cloth and wipe clean. I have not made an omelet, as I don't care much for them, but I plan to make one for my daughter this weekend.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Brewer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Omelette maker???",
      "text": "I like the idea of an omelette maker however this is not it. It doesn't have a temperature control so therefore the outside burns before the inside is done. I waited too long to use so therefore I couldn't return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Teresa Jackson",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Love Love Love",
      "text": "I love this! You can make almost anything in it. Will buy another one so I can have inlets ready for me and my husband at the same time",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Smith",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Perfect for a quick morning breakfast.",
      "text": "I love this. Now that I have it down it takes about 5 minutes per omelet. I actually bought it as a Christmas gift for my wife and I use it all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "This Is Fun and Fast",
      "text": "It is so difficult to buy a gift for my husband. I got this for his Father's day present. He loves omelettes. It works great. He even made little fruit pies with 2 large biscuits and canned pie filling. I thought it would be bought, stored and forgotten, but we use it 2 or 3 times a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "It is as described",
      "text": "item is as described. it worked good twice, then started taking longer and longer to cook eggs all the way. ended up with semi hard outside in order to have center done. it is a space saving design. maybe i got a defective one, i don't know. sent it back for a refund.",
      "rating": 3.0,
      "verified": true,
      "author": "J C",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Quick, easy, and very easy to clean and store.",
      "text": "I bought this item after trying one at a friend's home. It worked great and is just the right size for making an omelette for one or two people. The ability to use it for frying eggs, bacon, or fixing frozen hash browns makes it even more valuable in the kitchen. It is remarkably easy to clean and cools down quickly so it can be put away when you clean up after breakfast or brunch.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Driskel",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Not What Expected!",
      "text": "I put in 2 large eggs. Once it was cooked, I couldn’t lift the tab to open it plus the egg was coming out. I don’t really like it. Disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "Earlene  Bowman",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "5 stars. Love it",
      "text": "I love my little omelette maker. Some veggies, cheese and ONE egg make one perfect, delicious omelette in two minutes. Since it’s just my husbands and me, this little guy is enough. Heats and cooks quickly. Easy to clean with a wet kitchen towel. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Valdez",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Dash Omelette Maker is the BEST new tool in my kitchen 😁",
      "text": "I just made an omelette in the Dash Omelette Makers. It was so easy. I used 2 large eggs(beaten), very thin piece of ham, a little bit of onion and halved cherry tomato. This was one of the best Omelette I have made. Yummy 😋",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Make Omeletes easy with easy clean up!",
      "text": "used for the first time and am happy with this purchase, love omelets but was never very good at making them. This makes them quickly and easily and cleaned up nice and easy",
      "rating": 5.0,
      "verified": true,
      "author": "Scott E Anderson",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Cheaper price = cheaper quality",
      "text": "It was a bit flimsier than expected. There’s no on/off button. You just have to plug it and unplug it. There’s no timer. You just have to keep checking on it. It heat up and does the bare minimum task. But seems as cheap as possible",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonnieConnie",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Broke before 1 use.",
      "text": "I bought this omelette maker and got it yesterday. Plugged it in today to make an omelette and it literally blew out. Had to return it before I could even use it. Crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181215
    },
    {
      "title": "Great product",
      "text": "This little gem is just what my husband and I needed. We love this.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie DeSuza",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Dash Omelette maker",
      "text": "We LOVE,LOVE,LOVE this product. For years I had so much trouble making omelettes in a regular omlette pan....they would stick, fall apart, etc. Not in the Dash. ..It is fabulous and always turns out perfect!!! Would buy again in a heart beat!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra Parker",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Item arrived damaged",
      "text": "I think the omelette maker will work great, but it arrived with a piece broken off the back of the casing. The piece was in the box. The box was not damaged. I would have liked the option to tell Amazon about the broken piece, but it only let me do that if I wanted to return it. With social distancing, I am not taking it to the return center. I have pictures to support this, but have no clue on how or where to submit them.",
      "rating": 3.0,
      "verified": true,
      "author": "Ronald Waggoner",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Fantastic panini/omelette maker!",
      "text": "This is an easy to use “panini maker”. Very well priced!!! The recipes included are healthy and easy to make. Breakfast lunch or dinner is very quickly prepared in this little device",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Arrington",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Hard to clean",
      "text": "It makes a good and easy omelette, but since the plates dont come out it is hard to clean. Also, it barely fits the 2 eggs plus whatever else you want to add. Almost a great idea.",
      "rating": 2.0,
      "verified": true,
      "author": "RGC",
      "helpful_votes": 2,
      "publication_date": 20190304
    },
    {
      "title": "Works ok, not great.",
      "text": "Haven't figured out how to get the omelet to be completely done in the center and not burned on the outside. Seems to only work well with no ingredients which kind of defeats the purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Makes a decent omelet.",
      "text": "The item does what it is suppose to do, make an omelet. The capacity is limited which is the main drawback. 2 eggs with a Tablespoon of milk and a couple of spoons of filling sends it overflowing, which is OK because it holds and cooks the overflow along with the eggs. Using a cooking spray means it needs washing after each use, not just wiping with a paper towel. Will have to try using olive/vegetable oil and see if that works better. Would be great if it had a larger capacity.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170628
    },
    {
      "title": "Ok for making fries egg omelets",
      "text": "Very hard to clean butter or other oils or liquids out of the cracks or between the two plates. Wish the temp was adjustable.",
      "rating": 2.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "It’s a great item",
      "text": "I bought this product to make Omlette’s with. Works great. I also make quesadilla‘s with it and they are great. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Koelling",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Awesome appliance",
      "text": "Love this omelet maker so much , I even recommended it to several coworkers. fast, easy, and does a wonderful job. Have used it several time already in just a month of having it.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Mansmann",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Died after 3 months",
      "text": "I loved this unit - made breakfast a snap for my hurried mornings. I literally used it every weekday. Last week the lights became unreliable, this morning the unit refused to heat. It's dead.",
      "rating": 2.0,
      "verified": true,
      "author": "Music maker",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "For a quick meal...",
      "text": "Great for students and road warriors alike. Takes up little space. Produces omelets and other recipes as advertised. Quick clean up for a quick meal.",
      "rating": 4.0,
      "verified": true,
      "author": "Pablito",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Same results, just smaller appliance.",
      "text": "Easier to store, takes up less room. Great tool for households of 1 and/or 2 people. Expect it would work well in a college setting.",
      "rating": 5.0,
      "verified": true,
      "author": "AKLady",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Pefect gift",
      "text": "This was actually a gag gift for Christmas for my husband. (He loves eggs) but it quickly became his fav gift. He has mastered the no mess issue. Cook 5 minutes, turn off 5 minutes. Perfect everytime. He puts bacon pieces and pepper jack cheese in his. Might need to order a second one lol",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli Mizell",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Wish I had ordered this sooner.",
      "text": "Bought this to give it a try. It is awesome so far. Easy to wipe clean and so easy to use. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Boyd",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Great for any meal or snack",
      "text": "Many different things you can cook with this, easy clean, takes up very little space, gets up to temp fast and very easy to cook with.",
      "rating": 5.0,
      "verified": true,
      "author": "James Dover JR",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Great for the price",
      "text": "Would have been 5 stars but it doesn't have auto shut off. In two weeks left it on all night! This needs to be a standard feature. As for the omelettes they are the easiest and most fantastic way to make an omelette!",
      "rating": 4.0,
      "verified": true,
      "author": "BBS",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "No exploding eggs",
      "text": "It would be nice if it were a little bigger, you can't fit many ingredients if you want to use two eggs. Don't overfill it and it works like it's supposed to.",
      "rating": 4.0,
      "verified": true,
      "author": "xAng",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Could be useful",
      "text": "A bit too bulky. I am able to do the same thing without this. However, it performs the task very well for the purpose it was built for.",
      "rating": 3.0,
      "verified": true,
      "author": "Edgar S. Young",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "With some trial and error, great product",
      "text": "Running it through a charge converter because we live overseas, so I am assuming that's why it cooks so quick. But, food turns out great, may need to adjust the recipes in the booklet a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.Dimo",
      "helpful_votes": 2,
      "publication_date": 20180425
    },
    {
      "title": "Great and fast delivery",
      "text": "Great product and just as described. There are a few things I would change or would like to add. Such as a temp control and even maybe a timer to know when it's ready.",
      "rating": 4.0,
      "verified": true,
      "author": "SalmAN",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Omelettes at last!",
      "text": "I enjoy using this maker. Very easy to use and clean. Love the variety of omelettes I can make. They're delicious too!",
      "rating": 5.0,
      "verified": true,
      "author": "blizzard041",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Quick and easy",
      "text": "Great omelette maker. Easy to use for people that don’t know how to cook like my wife :)",
      "rating": 5.0,
      "verified": true,
      "author": "Zafirakis Fotopoulos",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Eggs quick and easy",
      "text": "Easy to make eggs for breakfast. I can cook the eggs and do other things at the same time. This is very helpful in getting a breakfast prior to leaving for work.",
      "rating": 4.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Perfect omletes",
      "text": "I can finally make perfect omletes! I also made pizza pockets the other day and they turned out good",
      "rating": 5.0,
      "verified": true,
      "author": "CindyA",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Three Stars",
      "text": "It’s good. Don’t fill as noted in directions, it’s too much.",
      "rating": 3.0,
      "verified": true,
      "author": "Avp1100",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Great Buy",
      "text": "My sister and I picked this out for our mom who absolutely loves cooking and loves her cooking gadgets even more. She loves using it and the omelets comes out beautifully. Definitely a great buy and an even better gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki Moore",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Easy cook and clean.",
      "text": "Works great. I love this thing for making omlets. Cant wait to use it for other things.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin V.",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "It is perfect for my daughter because she likes omelettes.",
      "text": "I am pleased I got this for her for Xmas. She really likes it",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Hofmann",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "They LOVE being able to use this and it works great ...",
      "text": "Got this so my girls could make eggs on their own instead of using a stove. They LOVE being able to use this and it works great too. 2 eggs is perfect it for them. Glad we bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Dash Omelette Maker",
      "text": "I guess you get what you pay for. I have used it one time so far and it half cooked my eggs and it sounded like it was going to explode, my dogs were going nuts over the sound it was making.",
      "rating": 2.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Does NOT accommodate TWO eggs AND toppings!",
      "text": "I'm trying to love this, BUT it simply DOES NOT accommodate TWO eggs AND toppings UNDER ANY CIRCUMSTANCES!! ONE SMALL egg and MAYBE a tablespoon full of toppings...that is all. If the chamber was expanded I feel it has the potential to be great. But in its current state, its OK at best.",
      "rating": 3.0,
      "verified": true,
      "author": "PD Professionals LLC",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Explodes!",
      "text": "The omelette inside has exploded twice and burned my hands. I really wish I could return it, but the return window is closed. I love all my other Dash products, but this one is actually dangerous.",
      "rating": 1.0,
      "verified": true,
      "author": "alison mccorkle",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Makes great omelettes",
      "text": "Easy to use and works great ! Fun to make omelettes ! Easy to clean too.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa ",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Global warming is real",
      "text": "To. Hot, to small, 2 minutes a side doesn't cook the inside , longer and it cooks the inside but burns the outside",
      "rating": 1.0,
      "verified": true,
      "author": "RADNAR",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Handy “little” cooker",
      "text": "Lots of negative reviews around spillage and eggs exploding out of the sides. Product works fine simply follow the directions. Two small to medium sized eggs with lightly filled adds. Back off on cook time though, maybe 1 1/2 minutes per side.",
      "rating": 5.0,
      "verified": true,
      "author": "tony cirabisi",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Perfect omelettes every time.",
      "text": "As silly as this sounds, this has been life changing. I make omelettes each morning and this has taken all of the guesswork out of that task. Makes a perfect omelette every time.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Caputo",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Easy Breakfast Omelettes",
      "text": "This product has been great to use for a quick breakfast. We have made omelettes, pancakes and hashbrowns. We even made a crab cake in it which was really tasty just oddly shaped. It is easy to carry if you are traveling and get tired of eating out as long as your hotel room has a mini fridge. It's easy to clean and so far has been very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "A. S",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Works great",
      "text": "This works great! It cooked my eggs perfectly. It also warmed up precooked bacon in no time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Timer/shutoff",
      "text": "I absolutely love this machine. The only reason I didn’t give it a full five stars is because I wish it had an automatic shutoff when it’s on for too long. I forgot to unplug it one day and realized twenty minutes from home. I also wish there was a built in timer. Or one and the same.",
      "rating": 4.0,
      "verified": true,
      "author": "Tami",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Fast and easy",
      "text": "I can make any kind of omelette I want. Quick and easy. I don’t use anything for flavor. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Watt",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Four Stars",
      "text": "Only wish the plates detached so it could be washed in the dishwasher",
      "rating": 4.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 8,
      "publication_date": 20180117
    },
    {
      "title": "Speeds up cooking",
      "text": "Once you realize not to lock it, the results are terrific. Quick and easy breakfast, lunch or snack. Be creative. Have fun.",
      "rating": 4.0,
      "verified": true,
      "author": "FEISTY",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Good for one egg",
      "text": "Work best with one egg. With two eggs you cannot add anything. Even just the two eggs makes the omelet maker whistle then pop.",
      "rating": 4.0,
      "verified": true,
      "author": "J Montiel",
      "helpful_votes": 2,
      "publication_date": 20190121
    },
    {
      "title": "Makes great omelets!!!",
      "text": "We love it!!!! I bought two. One for home and one for my husband to use when he's traveling. We have had a lot of fun creating new ideas for omelets.",
      "rating": 5.0,
      "verified": true,
      "author": "CardinalLover",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "makes a mess not an omelet",
      "text": "just a poor design, additions end up outside the finished omelette",
      "rating": 1.0,
      "verified": true,
      "author": "sad reader",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Perfect omelette in 4 minutes!",
      "text": "Makes perfect omelette in 4 minutes. I love this machine! Very easy to clean. Flipping cooks omelette so evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "Cfunk",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Four Stars",
      "text": "It does the job, I can fit maybe 1 1/2 eggs into this. Wish it was bigger",
      "rating": 4.0,
      "verified": true,
      "author": "Megan McCauley",
      "helpful_votes": 2,
      "publication_date": 20180222
    },
    {
      "title": "Great Omelette Maker once you get the hang of it!",
      "text": "Makes great omelettes. When you turn the unit over half way though, release the lock and relieve some pressure...otherwise it has a tendency to spit things out the side particularly if you have tomatoes in your omelet. Plus, if feeding a bigger group, buy 2.",
      "rating": 4.0,
      "verified": true,
      "author": "Korey V.",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "It makes very child like portions of one",
      "text": "The product is too small. It makes very child like portions of one.",
      "rating": 3.0,
      "verified": true,
      "author": "Rhonda L. Buris-Gaines",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Quick, easy and very little clean-up!",
      "text": "My daughter loovvveesss this machine. She is an active, health conscious young person. Every morning she can quickly make her egg whites. BONUS, super easy clean-up. I made a panini pocket too. Great little product.",
      "rating": 5.0,
      "verified": true,
      "author": "S E Davidson",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Easy to use",
      "text": "Worked perfect, I cook meats and veggies for week and store in plastic bags. Each morning just add meats or veggies and a couple of eggs and dine in a cpl of minutes",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Richard Garza",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Very easy to use",
      "text": "Live it! Very easy to use. I look forward to making different kind of omelets.",
      "rating": 5.0,
      "verified": true,
      "author": "Evans",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Over cooks",
      "text": "Really Disappointed Tried several times keeps coming out brown I can't stand over cooked Omelets it was a wast of money for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael McDaniel Sr",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "It cooks quickly and cleans up easily.",
      "text": "My sister asked for this as a gift nd she loves it. It cooks quickly and cleans up easily.",
      "rating": 4.0,
      "verified": true,
      "author": "geek girl",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Excellent product - good results - fancy omelettes !",
      "text": "So simple to use - 1 or 2 eggs will work. Add anything , like ham, left over steak and cheese. I enjoyed a fried egg as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Dcope",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Love it",
      "text": "I love this omelette maker. I could not make an omelet right to save my life until I got my omelette maker, so now I making omelette 1 week maybe sometimes two a week I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Easy to use !",
      "text": "Bought this for my wife and myself. Works great every time . Easy Omlet !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Clifton M cDuffie",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Quick breakfast maker",
      "text": "I can make an omelette so quick. Heats up fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "all times as directed are not a rule to go by..find your own times by checking your various meals..its a great buy !!  good luck",
      "text": "this is just what I needed I live alone so its perfect for 1 meal dishes, 2 egg omelets ? just right!! warm up some hash? yep! still looking for recipes I can cut in half...works so well ..just check your times ..",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Don't leave by no more s*** like that and asked me about it",
      "text": "I didn't like it I returned it you got it you tell us what you think of it cuz I ain't got mine no more I send it back",
      "rating": 1.0,
      "verified": true,
      "author": "NOT THE PIZZA GUY ORDER DOMINOS",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Yummy omelettes!",
      "text": "Makes awesome omelettes very quickly! I usually do closer to the max time per side to make sure it's cooked all the way through.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Single cookery",
      "text": "I got this quickly. No eggs yet. Hash browns. corn dogs (no stick) , burrito. raisin muffins. All good. It's quite handy I would buy again if needs be. I also would tell all to buy one.",
      "rating": 5.0,
      "verified": true,
      "author": "Dick",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "I like.",
      "text": "Use at least 3 times per-week. Never had a complaint with the outcome.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Not Very Good",
      "text": "Not very impressed. It either leaves the omelet raw in the middle or it gets like chewing rubber.",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas Tilley",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Great gadget!",
      "text": "Great little appliance. Works as advertised. Just be sure to follow the instructions. Reading the reviews first also helped.",
      "rating": 5.0,
      "verified": true,
      "author": "EVuser",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Dash Omelette Maker",
      "text": "This product is so easy to use. Makes great omelets and is a snap to clean. My grandkids can use it that's how simple it is. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Norah M.",
      "helpful_votes": 0,
      "publication_date": 20181208
    }
  ],
  "product_meta": {
    "title": "Dash Omelette Maker with Dual Non Stick Plates - Perfect for Eggs, Frittatas, Paninis, Pizza Pockets & Other Breakfast, Lunch, and Dinner Options - Red",
    "description": "Color:RedWhip up a healthy breakfast in minutes with the Dash Go Omelets Maker. Designed with a narrow footprint and an upright storage option, the Omelets Maker is perfect for any kitchen countertop or cabinet. From omelets and fluffy frittatas to pizza pockets and even crispy skin salmon, the Omelets Maker makes quick work of your favorite snack and meals.",
    "rating": 4.3,
    "feature_bullets": [
      "VERSATILE: Make fluffy omelets, fritattas, paninis, pizza pockets, crispy skin salmon, and more. Breakfast, lunch or dinner can be table-ready or quick to go, in minutes",
      "QUICK + EASY: No measuring required, just wait for the green indicator light to show the maker is preheated, pour in ingredients, close the lid and cook! Its so easy, even your kids can use it",
      "PERFECT GIFT: The perfect wedding or new home gift. Its small size takes up little counter space, and its sleek design and trendy color options will match any kitchen décor (add to your registry now!)",
      "INCLUDES: Backed by a 1-year manufacturer warranty, and includes a recipe book and recipe database access; Dishwasher safe: No",
      "COMPACT DESIGN: Weighing 2lbs, the Dash Omelette Maker is portable and a MUST-HAVE for that first apartment, smaller kitchen, college dorm life, or camper/rv traveling. The dual nonstick plates make clean up a snap!"
    ],
    "specifications": {
      "Product Dimensions": "3.06 x 4.75 x 11.3 inches",
      "Item Weight": "2.14 pounds",
      "Manufacturer": "StoreBound",
      "ASIN": "B01FMHQ9BO",
      "Item model number": "DOM001RD",
      "Customer Reviews": "4.3 out of 5 stars805 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#99,186 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 13, 2016"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Specialty Appliances",
      "Sandwich Makers & Panini Presses",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}