{
  "website_summaries": [
    {
      "verdict": "A large desktop external hard drive from LaCie that has a lot of space and speed.",
      "pros": [
        "Wide range of size capacities goes all the way up to 8 terabytes for media and graphic design use",
        "Connects via USB 3.0 or USB-C for fast transfer speeds"
      ],
      "cons": [
        "Requires an individual DC power connection instead of just a USB port"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stopped working after 4 months. DON'T GET!",
      "text": "I bought this Hard drive in September of 2017 as my back up drive to keep at home. I've had too many external hard drives fail, I finally saved up to have one at home. All of my work is backed up on this thing and nothing is retrieving anymore. I wouldn't pay attention to any customer reviews that are within a 3 month span. I heard great things about LaCie and thought my troubles were over. They just got worse.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 23,
      "publication_date": 20180121
    },
    {
      "title": "Setting This LaCie Up As My New Time Machine Was A Piece Of Cake",
      "text": "Arrived tonight. Unpacked it. Connected it. Ran the utility. Selected it as my new Time Machine, and done. Total time, from unpacking to turning on the Time Machine function, <10 minutes. BTW, I saw in one of the reviews a statement that the USB 3.0 connector was only 8\" in length. Not true. Mine was 36\". Anyways, as a Mac user, it doesn't get any easier than this. It also looks great next to my iMac.",
      "rating": 5.0,
      "verified": true,
      "author": "Erlo Banfield",
      "helpful_votes": 14,
      "publication_date": 20180117
    },
    {
      "title": "Support Ended Too Soon!",
      "text": "There is no way to find my \"missing password\" or get support. I was locked out of all support help right when I needed it most. That is crazy. There is no button for \"forgot your password\". I don't remember changing it, but I must have. Nothing works. I paid all of this money and now I can't return it or get help. Please take warning and don't buy this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 11,
      "publication_date": 20180619
    },
    {
      "title": "Died in less than 30 days!",
      "text": "Before this, I had only purchased 2 large backup drives in my life, one of which lasted a decade and the other at least 5 years that I can remember. This one... days! 27 days to be exact. It died so quickly I can simply just return it to Amazon and get something different. Avoid!",
      "rating": 1.0,
      "verified": true,
      "author": "Robert R. Leffel",
      "helpful_votes": 11,
      "publication_date": 20180208
    },
    {
      "title": "DO NOT BUY!",
      "text": "If I could give this less than 1 star I would. I used this hard drive 4 times and when I went to back everything up on a new computer-guess what? It did not work- would not mount, could not access it - dead to the world. After 2 months-- I have 10 external drives and this is only the 2nd one that has failed and the only one that failed after 2 months!!!! Of course the hardware is covered under warranty, but data loss recovery is $599! I will never buy this brand again",
      "rating": 1.0,
      "verified": true,
      "author": "Rocki",
      "helpful_votes": 10,
      "publication_date": 20180416
    },
    {
      "title": "Junk! Did not work out of the box! ...",
      "text": "Junk! Did not work out of the box! Tried to reformat it for a Mac and the capacity went from 4TB to 100 MB. I had one of these from 3 years ago that finally died so I though Id replace it with the same model. Big Mistake. I went with a G drive instead. No issues there at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe B",
      "helpful_votes": 9,
      "publication_date": 20180603
    },
    {
      "title": "Beautiful Design",
      "text": "This is a great drive for MacOS users. I recently purchased an iMac 5K with high sierra and the western digital drive wouldn’t work at all. This drive was easy to setup and looks gorgeous next to this beautiful computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Malcolm Gage",
      "helpful_votes": 2,
      "publication_date": 20180107
    },
    {
      "title": "It Only Lasted 1 year!",
      "text": "I purchased this device to back up all of my gaming saves, youtube videos and documents. It also looked great under my Mac. I purchased it in January of 2019 and it died today July 2020. I thought buying this LaCie hard drive was going to be the answer to all of my problems. I feel like this device has now made everything a LOT worse.",
      "rating": 1.0,
      "verified": true,
      "author": "Caden Joyner",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Disappointed in Reliability",
      "text": "I purchased the LaCie Porsche Design 4TB USB 3.0 Desktop Hard Drive about 4 months ago. It didn't take long to see that it is not reliable. There is one issue I continue to have and it is the only issue. When I turn my CPU on, 9 times out of 10, the hard drive is not recognized. I have to unplug from the ac adapter and wait about 30 seconds, plug it back in and then it recognizes it. This is so frustrating to say the least. I continue to have multiple backups but will replace this drive within the next 30 days or so.",
      "rating": 3.0,
      "verified": true,
      "author": "Patty",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "I am delighted.",
      "text": "Works great. Backed up a dying hard drive. Really saved a lot of data that I feared I would lose. The LaCie Porsche hard drive is a thing of beauty and it works perfectly. I am very glad to have purchased this drive. I am delighted.",
      "rating": 5.0,
      "verified": true,
      "author": "CARL R",
      "helpful_votes": 2,
      "publication_date": 20180206
    },
    {
      "title": "Perfect size",
      "text": "So far so good. It was easy to set up with my Apple computer. Light only comes on when it is saving stuff. So you don't know it is on otherwise. I have had these with my other computers and liked them better then other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Becki H",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Crashed After Less than 1 Year",
      "text": "I had 100% faith in the external hard drive, transferring my oldest and videos into this. A few months ago, it started to click on me. After several attempts to access the external, I had to accept that it crashed. I do not recommend this drive. Move on to the next.",
      "rating": 1.0,
      "verified": true,
      "author": "Cathy P. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "My $100 drive crashed...Lacie asking for $700 to check it out.",
      "text": "I got this drive 2 years ago and now it is clicking and beeping. According to Lacie, my drive is still under warranty for a couple more weeks, but if I want them to check it out, it will only cost me a sweet low fee of $700! I don't understand this.",
      "rating": 1.0,
      "verified": true,
      "author": "David Hughey",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Easy to install",
      "text": "It attached easily to macbook air and was formatted.quickly. There were no problems. I use it to backup my internal hard drive.",
      "rating": 5.0,
      "verified": true,
      "author": "Wvb",
      "helpful_votes": 2,
      "publication_date": 20170417
    },
    {
      "title": "Good for desktop",
      "text": "Bought for work and this worked great for desktop use only. Do not try to travel with these as they aren’t built for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah testa",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Plug and play",
      "text": "Using on Mac mini for back-up. Easy set-up, quiet operation, small desktop footprint. Highly recommended, but check connectivity compatibility with your CPU.",
      "rating": 5.0,
      "verified": true,
      "author": "kjk",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "A lotta Bang for your buck!",
      "text": "A lotta Bang for your buck! Great Price for a great product. Works great for storage of all my high res photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Frugal shopper",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Is USB 3",
      "text": "Great item with pretty design and very fast respond because the USB 3.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Premium design with reasonable price",
      "text": "I use it for weekly backup and this drive fits well alongside my other devices in similar elegant design.",
      "rating": 5.0,
      "verified": true,
      "author": "Zhen",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Five Stars",
      "text": "This produce is durable and efficient. Very well constructed. Thanks LaCie!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "John L Clarke",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "... just about full so upgrading to the way was easy. Out all my external hard drive LaCie Porsche ...",
      "text": "I have a 3TB that is just about full so upgrading to the 4TB was easy. Out all my external hard drive LaCie Porsche is a work horse I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie B.",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Top product",
      "text": "Works straight out of the box. Solid enclosure. Very fast delivery.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "AVOID: Two dead drives in a row. Don't waste your time on LaCie.",
      "text": "First drive arrived two days ago. Dead on arrival. Would not spin up. Returned it thinking it isolated. Got replacement today, same thing --- DOA. I feel it physically wanting to spin up. I feel it slightly vibrating. Drive gets slightly warm. Front Light never comes on. Drive never mounts. Total POS. Porsche would be embarrassed to have their name licensed on this thing. Two days of wasted time. FU LaCie.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Tucker",
      "helpful_votes": 3,
      "publication_date": 20170719
    },
    {
      "title": "Good drive",
      "text": "LaCie is the way to go if you own a Mac. Simply plug and play. On the other hand, Seagate drives require far too much setup with drivers to download and complicated setups. Miss a step a Seagate drive is useless. Go with a LaCie and save yourself a headache.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Niblick",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "HUGE",
      "text": "This thing is HUGE. And it requires an AC power supply. Not good for a discrete Time Machine backup. Returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "AMZN2000",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Five Stars",
      "text": "I love Lacie Harddrives. never had an issue with one",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra L.",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Five Stars",
      "text": "Haven't used it yet, but excited to crack it opened!",
      "rating": 5.0,
      "verified": true,
      "author": "Ant P.",
      "helpful_votes": 0,
      "publication_date": 20180101
    }
  ],
  "product_meta": {
    "title": "LaCie Porsche Design 4TB USB 3.0 Desktop Hard Drive + 2mo Adobe CC Photography (STEW4000400)",
    "description": "With the LaCie Porsche Design Desktop Drive, LaCie has joined forces with world famous\nPorsche Design to unveil a hard drive that’s as powerful as it is beautiful.\nThe LaCie Desktop Drive features a USB 3.0 interface for fast speeds plus a solid,\naluminum casing that looks great beside the latest Mac computers. System Requirements - Computer with a USB 3.0 or USB 2.0 port, Latest version of Mac OS X 10.11 and later / Windows 7 and later.",
    "rating": 4,
    "feature_bullets": [
      "USB 3.0 interface for fast speeds",
      "Massive capacity in a sleek form factor",
      "Sturdy, all aluminum enclosure looks great next to Mac computers",
      "Includes 2-month complimentary membership to Adobe Creative Cloud Photography Plan. Must redeem by January 31, 2020",
      "Computer with a USB 3.0 or USB 2.0 port* ;Latest version of Mac OS X 10.11 and later / Windows 7 and later*"
    ],
    "specifications": {
      "Number of USB 3.0 Ports": "1",
      "Brand": "LaCie",
      "Series": "STEW4000400",
      "Item model number": "STEW4000400",
      "Hardware Platform": "Mac",
      "Item Weight": "2.2 pounds",
      "Product Dimensions": "4.74 x 1.61 x 7.5 inches",
      "Item Dimensions  LxWxH": "4.74 x 1.61 x 7.5 inches",
      "Computer Memory Type": "DDR3L-1600 SDRAM",
      "Flash Memory Size": "4 TB",
      "Manufacturer": "SEAGATE",
      "ASIN": "B01FXDVSNG",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 20, 2016",
      "Customer Reviews": "4.0 out of 5 stars97 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#1,127 in External Hard Drives"
    },
    "categories": [
      "Data Storage",
      "Computers & Accessories",
      "Electronics",
      "External Hard Drives"
    ],
    "price": ""
  }
}