{
  "website_summaries": [
    {
      "verdict": "Though it has some quality issues and the larger construction may be too much for some consumers, it's still worth considering for those who need more space than traditional wristlets offer.",
      "pros": [
        "Doubles as a small crossbody bag",
        "Has a 21-inch detachable strap",
        "Multiple pockets and card slots",
        "Genuine leather is supple and flexible",
        "Bag fits most cell phones"
      ],
      "cons": [
        "Some long-term durability concerns have been raised",
        "Owners reported frayed seams, broken closures, and faded leather",
        "Somewhat bulky if you put a lot of items in it",
        "Card slots are small"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect! My smartphone fits perfectly",
      "text": "Perfect! My smartphone fits perfectly, and there is more than enough space for credit and membership cards. I use the wrist strap to clip my keys to the D-ring on the wallet, I use the snap strap to hold my glasses and there is just enough room to hold my lipstick. Initially, I thought the leather looked a little on the low-end, but like any leather item, it gets better with wear. I absolutely love my crossbody wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "C. K.",
      "helpful_votes": 35,
      "publication_date": 20171004
    },
    {
      "title": "After purchasing several wallet/crossbodies I think I finally found the right one!",
      "text": "i have bought several crossbody/wallets and none of them were just right. Some didn't have enough card slots, some were too bulky to use as a wallet within a purse, some were made from flimsy material that tore, some didn't have a good place for my phone, some couldn't hold a lipstick and my keys, etc. This one however, is perfect! I am so happy I found it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy S",
      "helpful_votes": 49,
      "publication_date": 20161012
    },
    {
      "title": "What a wonderful smartphone, wide safe zipper opening",
      "text": "What a wonderful smartphone, wide safe zipper opening, 17 slot card holder,center zipper change holder and 2 bill slots, wrist or cross shoulder strap. FREE MY HANDS!! To push,walk, even jog. THE BEST LEATHER LITTLE BAG! I have looked for a while and found the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 39,
      "publication_date": 20161202
    },
    {
      "title": "Flimsy hardware = broken on the first use",
      "text": "I read all of the reviews and I saw a few people said the straps broke but I was very excited to *finally* find a crossbody wallet that would fit my phone so I bought it anyway. My 7 plus fit even with a larger case and I was thrilled. I put all of my cards in, put my phone in, grabbed my keys and as soon as I got out the door the strap broke. The bag itself is beautiful but the quality just isn't there. If they'd use sturdier hardware I wold repurchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Sara Y.",
      "helpful_votes": 13,
      "publication_date": 20180609
    },
    {
      "title": "Almost 5 stars",
      "text": "Love my new Sak wallet, if fits my 6plus with a case on it fine, or if I need to take my checkbook it also fits. It has lots of card slots, my only concern it is hard to get cards & cash in & out. It's a tight fit, I'm hoping it will become easier as time goes on. If it was just a little bit wider they might be easier to get out. Just hope none of the stitches break. Other that that I love it!!",
      "rating": 4.0,
      "verified": true,
      "author": "Mls",
      "helpful_votes": 22,
      "publication_date": 20161024
    },
    {
      "title": "Love The Sak!",
      "text": "My Sak smartphone purse just came in and I Love It!!!! It's so perfect! Exactly what I was looking for. My iPhone 6 plus fit perfect and I love all the slots for credit cards, I.D., business cards, whatever it might be and also a pouch for small coins change. I'm definitely ordering one in the lighter shade of brown.",
      "rating": 5.0,
      "verified": true,
      "author": "young_grannie",
      "helpful_votes": 18,
      "publication_date": 20160913
    },
    {
      "title": "Disappointed",
      "text": "I purchased this based on reviews and because it was exactly what I was looking for. I received it & was very happy with it. I used it crossbody style and while shopping one day it just fell off my shoulder. Checking the strap I saw how the clasp just broke. So, I got another one sent free of charge! Yay right? Nope. The very same thing happened. I was soooo disappointed because this little bag was absolutely perfect. Guess I won't be ordering this brand any longer. I can use it as a wristlet but that's not my preference. I ordered it to use crossbody so I could be hands free. Oh well back to searching for another one!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kirk Chapman",
      "helpful_votes": 4,
      "publication_date": 20191118
    },
    {
      "title": "Perfect cell phone wallet",
      "text": "I have several Sak purses & this is no exception to the fine quality. It is perfect. My iPhone 6s Plus with thin case fits nicely & readily accessible. There are 16 card slots (8 per side), zippered coin purse, & 2 money slots that don't require money to be folded. I like that I can just take it in my purse, if I need a larger handbag or, grab & go with the wallet for quick trips, walks or to arenas, where purses are not allowed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay L.",
      "helpful_votes": 11,
      "publication_date": 20161113
    },
    {
      "title": "Beautiful wallet but did not work as a crossbody. All hardware so wimpy!",
      "text": "beautiful wallet but did not work as a crossbody. As soon as I put my phone in it. it pitched forward and pulled heavily against the little clamps of the long strap. I could see how these would break easily. Also snap on the front of phone pocket was very wimpy and destined to break. It should be a magnet/snap so there wouldn't be constant wear on this part of the wallet. Love the two-tone but even at these reduced prices I could see this wallet wouldn't work as advertised. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "jhk",
      "helpful_votes": 2,
      "publication_date": 20180708
    },
    {
      "title": "Strange odor.",
      "text": "This wristlet is a little on the large side but, it does carry everything I need when I don't want to lug a purse: money, cards, phone, lipbalm and 2 lip colors. The interior of this Smartphone Crossbody had an odd unpleasant odor to it. I have been leaving it open overnight for it to air out. Its been 10 days now, and the odor has reduced a bit. Will let it air out more in hopes that it does completely disappear.",
      "rating": 3.0,
      "verified": true,
      "author": "nadoja",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Shoulder strap clasp broke",
      "text": "The shoulder strap clasp broke 3 months after purchase. I'm not sure why as I always handle my purse carefully. This was not the quality I was expecting. Very disappointed. Don't buy this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 4,
      "publication_date": 20190531
    },
    {
      "title": "But this purse carries both and it's perfect! My iPhone 7 Plus (with a bumper) fits ...",
      "text": "There are times when I only want to take my money/cards and my phone with me. Normally I'd have to take them as 2 separate pieces - billfold and phone. But this purse carries both and it's perfect! My iPhone 7 Plus (with a bumper) fits nicely in the front pocket, and I can carry all my cash and cards inside. The only thing I'd like it to carry that it doesn't very well is keys. Of course if I'd take some of the unnecessary junk off my keychain, it would probably fit too! Smells really good - looks really good - and will last a long time. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mia",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "\"this thing is awesome\" <- according to my wife",
      "text": "My wife is so glad that she found this. She can't stand lugging around her entire purse everywhere she goes (can't say I don't blame her). She has been looking forever for an over the shoulder wallet that can hold all her wallet stuff, her phone (6\" screen), a woman item, clip on her keys and be able to easily access her cards and change. I think she must have said \"this thing is awesome\" a hundred times so far. If you are like her - I'd say give this one a shot, you'll likely be pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "ATechnoholic",
      "helpful_votes": 3,
      "publication_date": 20180307
    },
    {
      "title": "handy for carrying phone, money and small key chain",
      "text": "Perfect size for my smartphone and easy to get to when it rings. I like that I can open my wallet right in front of me with the strap on and easily get to and put things away. I frequently go to a cash only market and it's so handy to be able to see and get to cash then zip it right back up without having to fiddle with a wallet inside a purse.",
      "rating": 5.0,
      "verified": true,
      "author": "Faith",
      "helpful_votes": 5,
      "publication_date": 20161115
    },
    {
      "title": "Love this wallet/phone purse",
      "text": "I ordered the black with brown trim. My iPhone 6s fits with a protection cover around it in outside pocket. Flip snap will easily keep cell safe...lots of CC places, zipper area for change, two places for paper money(and do not have to fold money to fit), should strap can be any length, wrist strap a plus...it is a very compact style. I could not add lip balm, tissues, gum pack, keys or remote....but I'm finding somethings I can put in my pocket...I really do love this new style in my Senior years.",
      "rating": 5.0,
      "verified": true,
      "author": "memawrequest",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "It's perfect, just what the wife wanted!",
      "text": "Bought for my wife, she absolutely loves it, all those card slots, compact and long hands free strap. Her camera fit snugly in it's compartment, no sliding around. Real leather, smell and all. Reading bad reviews about hardware, if so I plan to go to a Hobby store and buy snaps or clips to repair it. It's a real keeper, will take a chance with it and repair if needed, just have not seen any other purse like it. Anyway it has survived a couple of days now, will up-date later! Cant beat the price either.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Patrick",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Terrible Odor!!!",
      "text": "Color was ok, but horrible odor!! Wanted to give as gift but the odor was so bad even after trying to air out for two days it was unbearable to pick up to see if smell was gone. Had to choose another gift. When I could send back after Christmas, the odor had lessened some but was still strong! If I had smelt this in a store I would have asked for a manager and expected them to be very embarrassed to find this on display!",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Fits everything I need it to",
      "text": "Love this wallet. Everything I need goes into the card slots. Room for dollar bills to go in unfolded, ample room for checkbook and coins. Extra spaces for stamps and important receipts. My Samsung 7 phone fits beautifully in the outer pocket. Cute little wooden bead pull on zipper closure. Comes with shoulder strap and carry handle. I use this constantly for running into the store without needing to carry my heavy leather pocketbook. Hands free - the only way to fly - no missed calls! This is a great wallet!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy S.",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Great bag!",
      "text": "What I like about this bag is that your cell phone fits well in front pocket. I have Samsung S7 in a charging case and it fits fine. Easy to snap/unsnap. I like how the shoulder strap attaches in the back of bag so when you open it, it accordians out and the card slots are upright (10 slots on each side with zipper compartment in between). There is also one more slot for bills. When traveling, I make this my wallet and carry it inside my tote. Grab it and leave tote behind when out and about. IIt will also hold a small set of keys and lipstick. Great choice of colors.",
      "rating": 5.0,
      "verified": true,
      "author": "bk",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Well made and beautiful",
      "text": "Best purse I have ever owned. I was trying to replace a Keen wristlet that I had for years, and this one appealed to me because it’s small, compact, beautiful leather, has many card slots, and the side pocket fits my iPhone 7 in a life proof case perfectly, with a tube of chapstick beside it. I keep a pen on the inside, but there isn’t much room for anything else that’s not cards or cash—this is fine though, it keeps it tidy. I like the placement of the change pocket. I love how structured the whole thing is. I have had it for about five months now and it still looks excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "E.E. ",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Highly recommend!",
      "text": "Great phone/wallet! I had to buy a second one 'cause I lost the first one last month. I had it almost a year and never showed signs of wear. I love the cross body strap, keep it in the car in case I go to a street fair, concert, shopping-any where I don't want to carry my whole purse. Like other reviewers, I attach the wrist strap to my keychain to easily find my keys in my purse.",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina Blue Bell",
      "helpful_votes": 3,
      "publication_date": 20170706
    },
    {
      "title": "Nice, but too big for me.",
      "text": "Very nice smartphone wallet/purse. Fit my iPhone 8 very easily with room to spare, plenty of slots in the wallet side and bills don’t have to be folded to fit. The leather tooling gave it a nice feel. Unfortunately it was just a bit too large for my personal taste, so I returned it. I want something between this size and my small Sakroots, which fits my IPhone 8 (only with a slim case though), but it is very tight, and bills have to be folded. Will need to keep searching.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Cute and functional",
      "text": "Love this small cross body cell phone wallet. The outside back pocket comfortable fits my iPhone 7 and the small snap strap keeps the phone secure. The zip wallet has plenty of credit card slots plus and interior zip pocket for things that need to be extra secure. Came with detachable wrist strap and adjustable cross body strap.",
      "rating": 5.0,
      "verified": true,
      "author": "Tori P.",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Fits an Iphone XR with a case!",
      "text": "I am very pleased with this smart phone crossbody wallet. I have a total of 18 cards/credit cards plus money, coupons and business cards. Still able to zip it up and go! I use the strap hook to attach my car key fob. Truly one of the best leather organizers for the money. I have a few Brighton organizers and this jewel is just as good for far less money. Way to go The Sak! Please make more like this or expand color options.",
      "rating": 5.0,
      "verified": true,
      "author": "westieluv",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Quality product that holds alot",
      "text": "I love this smartphone clutch! Exactly what i was wanting when I don't want to carry a large purse of any type. My phone fits perfectly and i can even fit car keys and a lip gloss inside. I love the versatility of using either strap that comes with it (crossbody or wristlet). I got the gray with the rivets and have used it about 2 months now and no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "J. F. B.",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "This one covers all the bases!!",
      "text": "I travel with a large handbag. This small one is perfect for running about. My phone is handy as are my cards and cash. There’s just enough room for a lipstick and mirror. The crossbody strap let’s me wrangle the grandkids hands free ... and the wrist strap let’s me switch things up when I want to. Well constructed. Love it! Ordering a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "DBee",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Nice",
      "text": "Stylish. Given as a holiday gift to high school granddaughter. She likes a bit of style and it goes well with her chosen clothing colors (neutrals trending to greys and black). Big enough for her phone, a pen, comb, ID. Some stiffness protects the phone. Cross-body strap for hands-free shopping and bike riding, less likely to forget it.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Safe shopping",
      "text": "The the crossbody Sak is everything I expected. It has ample space for cards, currency and phone for safe shopping. The quality is good.",
      "rating": 5.0,
      "verified": true,
      "author": "E Shelton",
      "helpful_votes": 3,
      "publication_date": 20181126
    },
    {
      "title": "I purchased this and love that it fits my iPhone 6plus",
      "text": "I purchased this and love that it fits my iPhone 6plus. Just wish the material was softer. Very stiff and not soft like I was expecting. Holds all of my credit card, money and change!",
      "rating": 4.0,
      "verified": true,
      "author": "M. Ingram",
      "helpful_votes": 6,
      "publication_date": 20161110
    },
    {
      "title": "SHOULDER STRAP CLIP BROKE IN LESS THEN 1 WEEK. SO UPSET!",
      "text": "SO UPSET!!!!!!! I loved this purse. I waited a while to receive it, finally got delivered a couple days ago. IT BROKE ALREADY!! Im contacting customer service. You’d think they’d replace it for the price it cost it should be better quality. The clip to attach the shoulder strap to the wallet should not break in less then a week! Unbelievable!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer M.",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Purse is cheaply made & not worst $47!",
      "text": "Within one week of owning, the strap for the crossbody broke & cannot fix since metal clasp on hook completely broke. Did nothing different than ordinary use!",
      "rating": 1.0,
      "verified": true,
      "author": "Diane Schultz",
      "helpful_votes": 2,
      "publication_date": 20190814
    },
    {
      "title": "Great wristlet for all the essentials!",
      "text": "Love this wristlet, it has plenty of space! On the inside it has two different sections with lots of card slots and in the middle is a zippered section for coins. It’s so easy to grab and go, as opposed to carrying around my big purse. Also, the front pocket is big enough for my iPhone XS and the snap enclosure holds it in securely.",
      "rating": 5.0,
      "verified": true,
      "author": "Druthb",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Secure but easy access - my wife loves it.",
      "text": "Got this for my wife for Christmas and she loves it. It's now her goto bag. On a recent week long trip including flights, she tucked it into her regular large purse during travel but used it alone during the week, sightseeing, shopping and walking around town. She says the phone compartment is perfect for her iPhone 6. Secure but with easy access to all contents.",
      "rating": 5.0,
      "verified": true,
      "author": "Blues 'n BBQ",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Nice size and color",
      "text": "I love this purse. It is great size for my phone, cards, and money. The only problem is that the side without the pocket got scratches on it, just from me using it. The softest scratch would leave a mark. I'm not sure if there is something I could put on it to make the scratches go away. I will still use it though.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane ",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "I have 3 different styles and their perfect to go shopping and dining out",
      "text": "It fits my iPhone 8 perfectly. I have 3 different styles and their perfect to go shopping and dining out. . I use my shoulder and the hand strap. I carry my phone keys, cards, glasses wherever I go. I leave my purse at home or in the car. The Sak is made well. I had my first Sak 6 Months or more. I used it everyday and it still looks good. I have taken it to restaurants weddings funerals because it does not take up a lot of space.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Love it",
      "text": "Nice, well made, fits in my larger purse if I want to carry a bunch of stuff or I can grab it out of my purse and it still holds my checkbook, cards, money, ID, pen and cellphone with room to spare. the size is allowable in stadiums for footballs games and other places where bag sizes are limited for entrance.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Exactly what I wanted",
      "text": "For me this was a five star purchase because I wanted a clutch type wallet and didn't really want the crossbody attachment. I love the wallet but if some want to use as a crossbody note the attachment doesn't look very sturdy. However not issue for me I have tons of crossbody attachments.",
      "rating": 5.0,
      "verified": true,
      "author": "Lglizete",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "No regrets.",
      "text": "I love all things the Sak and even Sakroots. I’ve had several cross body’s now in the Sakroots line but for some reason I really wanted something a little more sophisticated and classic looking that I know would last a while. First of all, the smell of leather... love it. The design on this is beautiful. It holds my iPhone XR and I have the option to use it as a wallet, wristlet or actual crossbody — very versatile in that regard.",
      "rating": 5.0,
      "verified": true,
      "author": "Carissa Noel",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Not the quality I was hoping for-",
      "text": "I bought this item , thought it was great , nice size , seemingly decent quality for the price. Then I wore it around for a week and the clip on the long strap broke. It can no longer be used as a crossbody bag which is what I bought it for . Very disappointing .",
      "rating": 2.0,
      "verified": true,
      "author": "christine therman",
      "helpful_votes": 2,
      "publication_date": 20191025
    },
    {
      "title": "Bought it for my wife and she loves it.",
      "text": "Wife likes it and it fits her iPhone 6splus perfectly. The phone slides in and out easily and the strap, when covering the phone, keeps it from falling out. The color was as advertised. Appears to be well made. The credit card slots hold the cards well. Zippered coin purse keeps the coins in check. Bills fig in easily without folding. So far the wifes been happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Panama Red",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Just about the best!",
      "text": "Completely amazing what this holds and fits my Samsung Galaxy 7edge perfectly. Attractive, light in itself, just perfect. Fits into a slightly larger handbag for work so I can carry my Kindle Paperwhite and a few extra things for commuting. I may buy one in another color. I'm a big cross-border fan and this is terrific. I just wish the longer strap was a tiny bit wider, absolutely not a deal breaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Living in the Amazon",
      "helpful_votes": 2,
      "publication_date": 20170131
    },
    {
      "title": "exactly what I wanted",
      "text": "This is exactly what I have been looking for since having to give up carrying a regular purse do to elbow and shoulder issues. it holds my phone perfectly along with all that extra space to hold normal wallet items. I do wish this black/brown wallet would have had a little more character to it like the other ones listed, I suppose it is a small price to pay to get what you want.",
      "rating": 5.0,
      "verified": true,
      "author": "CLB",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Nice quality leather and embossing",
      "text": "Nice quality leather and embossing, but wish the 2 zipped pockets weren't full of cardholders, etc. which decrease the amount of items you can carry, e.g., if they weren't sewn in, I could have put my glasses in one and my cell phone in the other pocket.",
      "rating": 4.0,
      "verified": true,
      "author": "brave new buyer",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Love it!",
      "text": "This purse is lovely. My iPhone 7 Plus (with attached card holder) fits nicely in the side pocket (or in the zipped part if desired). There’s room for my keyless fob for the car, lots of cards, money, chapstick and change. It comes with shoulder strap and hand strap so you can wear either. It’s roomy and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "El Markow",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "PERFECT for what I was looking for",
      "text": "Excellent quality. Exceeded my expectations. I chose this because it would serve as a wallet and hold my phone and keys AND fit in my SUV storage compartment (I dislike things sitting on the front seat). The Size, compartment configurations was exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Elizabeth Watts",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great Purse but “strap latch part”  broke first time I used out of box.",
      "text": "Not a smart move for The Sak . I will have to give low review because the detachable clasp from purse strap broke when attaching and customer service said they don’t have spare parts. My replacement part was a strap with a hook latch. I’m sure one strap can be taken off another returned defective purse🙄 and sent to me😊.",
      "rating": 2.0,
      "verified": true,
      "author": "Trinity",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "ABSOLUTELY LOVE THIS ITEM",
      "text": "ABSOLUTELY LOVE THIS ITEM. I WAS LEARY AT PAYING SO MUCH FOR WHAT I WOULD CONSIDER A CLUTCH PURSE. IT EXCEEDED MY EXPECTATIONS. IT IS THE PERFECT CROSS BODY THAT HAS A COMPARTMENT ON THE OUTSIDE FOR MY IPHONE. USUALLY IT HAS TO BE STUFFED INSIDE A POCKET. THE COMPARTMENT IS BIG ENOUGH THAT IT DOESN'T STICK OUT OR WORRY ABOUT IT FALLING OUT. IT IS GOING TO WORK PERFECTLY FOR MY VACATION! I WOULD DEFINATELY RECOMMEND THIS ITEM.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori R.",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "Phone pocket a bit snug for large phones",
      "text": "Adorable bag/ wallet. The inside is spacious and fits lots of cards and cash. The only issue is that the phone pocket is snug so getting the phone out when it is ringing is a little bit of a mad dash. It is stretching a bit so eventually I expect it to loosen up.",
      "rating": 4.0,
      "verified": true,
      "author": "Regina Ratner",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Strap clasp broke after less than three months",
      "text": "Well, that was fast. I had been quite pleased with this compact, attractive little purse and. But after less than two months of gentle use, I was standing at my doctor's reception desk today when my purse (which I had been wearing crossbody style) suddenly fell to the floor. The clasp had broken in two. See the picture of the clasp and the broken piece. When I got home, I replaced the strap with one from another purse so it's not a complete loss. But if this had happened while I was on the street or on the subway platform, it would have been much worse. Very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Iris Engelson",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Gorgeous!!",
      "text": "The embossed leather & the stitching is very well made. It’s got very good lining & lots of card slots, for a small crossover body purse. I would definitely recommend this purse not only for how well it’s made, but also the beauty of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Holds my 6\"x 3\" phone perfectly.",
      "text": "This is exactly what I was looking for. It holds all my credit cards, cash and a few extra things (pens, grocery list). My phone fits perfectly even with a slim protective back on it. My phone measures 6\" x 3\". (It would hold a phone up to 7\" long, but not much wider than 3\" if you want the little strap to snap shut.) The wallet/purse is also very attractive and well made. I like it and am very pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri Atmore",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "QUALITY!!",
      "text": "This wallet works perfect and holds my phone too. Plenty of room for cards, paper money and a change pocket with zipper in the middle. I have an iPhone 7 and it fits perfectly. Nice adjustable shoulder strap. The quality is very nice!! Highly Recommend. Have gotten several compliments on this.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Wallet Purse Fits iPhone 8 Plus",
      "text": "This is just what I’ve been searching for for years! I’m a minimalist when it come to carrying a purse. This is like having a wallet that fits a little bit more with a wrist and shoulder strap. It also fits my iPhone 8 Plus cell phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna T. B.",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Gift",
      "text": "I bought this for my mother in law. She had mentioned she wanted something a bit smaller to keep the essentials in when she goes to the casinos and shopping. It's a perfect size for her cards and ids with a little room for a few extras. She seemed to really like it so I'm giving this a bi thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne J",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Like this bag",
      "text": "Like that the crossbody strap is adjustable. Like that it has room for my cards. I don't like the snap for the phone compartment is difficult to open and close. I feel that opening the phone compartment snap will tear out the leather eventually.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacquelyn Crowell",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Didn’t last 90 days",
      "text": "At first, I loved it, but the clasp broke 90 days after so the pese is no longer usable. I am very unhappy about it breaking as I really did love this purse up to that point. But I need a purse to last more than 90 days! I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Leasa",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Hook broken within a month",
      "text": "I thought I found the right size bag I could carry around, Within a month, the shoulder strap's hook was broken. Not sure what to do since the return date is a week ago. I can't use this bag without shoulder strap. Is there a way I can get a replacement of this shoulder strap?",
      "rating": 1.0,
      "verified": true,
      "author": "H. Hwang",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great for travel",
      "text": "I wanted something lightweight that I could use while traveling. This is perfect. Fits iPhone XR and passport. Lots of card slots, coin pocket, two money spots. I take the strap off and use it as my wallet when I'm home.",
      "rating": 5.0,
      "verified": true,
      "author": "Enzo's Mom",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Even better than expected",
      "text": "This bag clicks off all of my boxes - plenty of room for my LG G5, lots of card slots, currency/receipt pockets, and zippered coin pocket. It will even hold my keys! The leather is supple with an almost glove-tanned feel, and the cross-body strap is plenty long. I appreciate the versatility of both cross-body and wrist straps. All in all, a bargain at the price - I looked at some of the designer brands, but nothing had all of these features - and this bag was a third of the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne Dudurich",
      "helpful_votes": 2,
      "publication_date": 20170710
    },
    {
      "title": "No regrets on this purchase.",
      "text": "Love this wallet on a string bag. I carry a tote and use wallets with straps so I don't have to carry a purse and a tote. Color combinations goes with everything. The zipper has held up nicely as well as the flap for the cell phone pocket. The phone pocket fits my Samsung Galaxy S7 Edge very nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa H",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Best wallet ever!",
      "text": "I absolutely love this wallet. It fits my android phone with protective case. I have purchased 3 so far in different colors. I use the teal one, gave my sister the grey one and I bought this one as a backup, just in case something happens to the one I have. Love the many compartments and the fact that I can take it from my larger bag and carry it into the store. The wallet is very neat looking and attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "Najsma1",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Nice replacement",
      "text": "I bought this to replace another Sak shoulder purse and was surprised that it's about 3 inches longer than my first two versions. I'm sure the makers extended the purse to fit a large Smartphone, but my phone fit the smaller purse perfectly so I was disappointed by the increased length. Even so, it's a great purse and I use it everyday. Thanks Amazon!",
      "rating": 4.0,
      "verified": true,
      "author": "Lynda K.",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Beautiful wallet",
      "text": "This wallet looks great and has everything I was looking for - 3 side zipper closure protects all my cards and cash. Front pocket fits my cell phone or a pair of reading glasses. Wrist strap is very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "LAReadingMama",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "It meets all my needs",
      "text": "Great or running & doing smallerands and it holds my iPhone 6s pulse with or without the mophie charging case. Great price too. I use it as a wallet wit bigger purse as well",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Heathcock",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Perfect!!",
      "text": "I love everything about this!! Very well made. It is the perfect size to take with you every day. It has lots of slots for your cards and room for some lip gloss and a small pair of glasses. It fits my phone perfectly, too. I may have to buy another on in black. I love it that much!!",
      "rating": 5.0,
      "verified": true,
      "author": "LuvMyGirls",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Snap Detaches With Wear",
      "text": "The crossbody is functional enough. However, I was expecting the material to be softer. The main problem I had with the purse is that the snap broke after a couple months of use. I would not recommend this crossbody for those reasons. I contacted Amazon but they said I'd need to get in touch with \"The Sak\" company. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "sassyone",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Great purse for walking",
      "text": "What a great and lightweight purse! I bought it so I could take it with me when going to meetings at work instead of lugging my big purse, it’s perfect! I also take it with me when walking my dog and taking walks at work. It will hold your cell phone, credit cards, cash, change and possibly even a chapstick or lipstick. The quality is good and it’s a trendy design. I’ve received many compliments already!",
      "rating": 5.0,
      "verified": true,
      "author": "Bernadett Mahanay",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "The Sak is always a great quality product and this item doesn’t disappoint.",
      "text": "The Sak is always a great quality product and this item doesn’t disappoint. Beautiful deep red color and great quality leather as always. Love this wallet/purse when I only need a small bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great quality and size",
      "text": "This is just the perfect everyday size without lugging around a big heavy bag. It hold my phone, lipstick, \"menu glasses\" and all my credit card, business cards and cash! Here's the real advantage, It still fits in my purse when I need to bring everything, It's a wallet with extras.",
      "rating": 5.0,
      "verified": true,
      "author": "glo",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Great Christmas Gift",
      "text": "I gave this purse as a Christmas gift and my friend was delighted with the size and design. She switched over to it immediately and was very happy with how much it held. She was impressed with the imprinted leather. I will update this review if her opinions change.",
      "rating": 5.0,
      "verified": true,
      "author": "Hardware Happy",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Cute and light weight!!",
      "text": "This works really well for what I wanted it for. A wallet that acts as a purse and is easy to carry. My phone fits in the purse but with my phone case on it's a little tight but that's fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J K.",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great wallet/shoulder bag!",
      "text": "Love this wallet/ purse! Perfect size when you don't want to carry a big bag and very well made! I was very disappointed I lost the strap somewhere at the airport I believe and I've been searching for a replacement that is the right color. For now I am using it as a wallet! Works for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Broken buckle on strap..disappointing!",
      "text": "The strap buckle broke the first month of use. Disappointed. I was told by customer service that I could not return for a refund. I thought “THE SAK” had a 1 year warranty. If I had purchased at a department store I would have been able to exchange. SAK needs to improve the quality of the buckles. As a girlfriend of mine purchased a SAK and the buckle broke the same day.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Fits all the basics in a small, elegant, shoulder bag",
      "text": "Beautiful design...I have the black leather, brown trim and shoulder strap. It looks great! The iPhone 6 fits snug (a little too snug but hoping it will stretch out with use), plenty of divided room for bills, cards, receipts & keys. Small package that is a work horse.",
      "rating": 5.0,
      "verified": true,
      "author": "TurboCat",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Lightweight & fits just enough for on the run.",
      "text": "Love this bag, but the cross body strap broke off 2week of using it. But bag is perfect for my needs & fits iPhone in front pocket perfectly. Just wish strap hadn’t broken off. But overall good simple purse.",
      "rating": 5.0,
      "verified": true,
      "author": "Shoezanne",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "UPDATE 2020 Durable Product Worth the Money",
      "text": "Very well made product. It's great as a wallet and is great as a cross body purse as well. Holds my phone great and I can clip my keys to the handle. I purchased this wallet/crossbody in 2018 and it is now 2020. This product has shown no signs of wear/tear inside or out and I use it daily. I purchased the grey color.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Nice all inclusive bag",
      "text": "I had another that had 2 zippers and had to open both for change and cash. Only one opening and room for all my cash and credit cards, insurance cards etc. love it. Second one like this I have purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "crittergitter",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Versatile",
      "text": "I like the fact that my large phone fits in the side pocket and has a snap to hold it in safely. I like the fact that all of my cards/bills/receipts fit in perfectly. I don't like the fact that I can't find a place for my eyeglasses since I don't wear them all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Morin",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Holds 20 cards",
      "text": "Nice small wallet purse with 20 card slots. Smells unpleasant.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Easy cell phone access!!!",
      "text": "I wish the clips that hold the clutch to the strap were stronger. I almost lost my keys! Otherwise, I'm happy with the quality of this product. Revised 2-5-2020 One of the studs fell off.",
      "rating": 3.0,
      "verified": true,
      "author": "J from WA",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Beautiful and so Functional",
      "text": "Love this little bag. Beautiful embossing and so functional. My iPhone XS fits in the front pocket & is secured by a clasp. Very secure and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "reballens",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Exactly fulfilled my needs.",
      "text": "Loving it! Matches the Sak bag I purchased earlier. I wanted this one fo use while traveling and it’s exactly what I was looking for. Also slips right into my bag for use as a wallet when I’m carrying my bag. I just take the strap off and no need to change wallets. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Stanley",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "So convenient and light",
      "text": "I use this for a wallet inside a larger purse with the straps attached. Now I can just grab the wallet out when I want and use it like a purse. It holds my iphone 7 plus perfectly. I even have room inside the zipper for a single car key.",
      "rating": 5.0,
      "verified": true,
      "author": "kberryhill",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Broken :(",
      "text": "Clasp broke and I hadn't even used it for one day!",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah Stutz",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Nice bag.",
      "text": "I was sent the grey bag not the black one. I kept it anyways because it was cute but it was irritating. good quality. I've used it everyday since I've gotten it and there no signs of wear yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Misaysay",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Love this bag",
      "text": "Use this as a wallet in my big purse and a purse when I don’t need all the mom stuff. Holds my checkbook, cards, stamps, photo sleeve, small quarter toys, lipgloss, and phone. I even once had all of this and a roll of quarters in it. It’s small compact and effective",
      "rating": 5.0,
      "verified": true,
      "author": "AstroGuy",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Requested Review",
      "text": "I disliked Nothing. Very Good in size and leather is great. Well put to getter and very handy as clutch or small underarm purse.",
      "rating": 4.0,
      "verified": true,
      "author": "Valera Williams",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Wonderful crossbody!!",
      "text": "I love this purse/wallet! It’s really attractive and my iPhone 8+ fits easily into the front phone pocket. It’s spacious inside, credit cards fit perfectly in plentiful slots. Perfect size.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Excellent small bag for cards, cash and cell phone.",
      "text": "I have never used a small purse like this before, always the big expensive clunky ones. After trying to carry a cell phone, wallet and keys in my pockets with all that weight trying to pull my pants down, I decided to change something. This all leather small purse/wallet carries those things nicely. Appears to be well made and durable. Very reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Edith eden",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Awesome purse.",
      "text": "Awesome purse. Bought 1 for myself. Loved it so much, I bought 3 more for Christmas gifts. Would not hesitate to purchase again. iPhone 6s Plus fits perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Rigby",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Almost perfect",
      "text": "Only reason not 5 stars is bc the strap that closes the phone compartment is too long. The phone can fall out. Strap shout be more secure",
      "rating": 4.0,
      "verified": true,
      "author": "nicky",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Love...",
      "text": "Many compliments while carring this on vacation instead of a large purse. Held my Motto Z phone, but was a tad tight. Can't get a whole lot in it, but worked for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah L. Schroeder",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Retured",
      "text": "Carried it one week and it looked like I'd drug it through a warzone.",
      "rating": 1.0,
      "verified": true,
      "author": "Jill Fisher",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Attractive Cell phone purse",
      "text": "Very attractive. Has a place for my Samsung S10+, not room for even my lip gloss. If I put anything more than credit cards & cash in it, my phone won't fit.",
      "rating": 5.0,
      "verified": true,
      "author": "kathya",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "The Front Button broke after less than 30 uses",
      "text": "The front button broke after less than 30 uses. It’s hard to contact the manufacturer because the phone number is international. I liked the look and I bought this bag in three colors. Update: Actually, the seller was Amazon. I wonder why the first Amazon support agent told me that this bag was sold by an international seller, and gave me an international phone number.",
      "rating": 1.0,
      "verified": true,
      "author": "MotherDuck",
      "helpful_votes": 3,
      "publication_date": 20180305
    },
    {
      "title": "Perfect. Great quality.",
      "text": "Absolutely perfect with the iPhone 7 Plus including keeping a case on the phone. Great quality as always from Sak.",
      "rating": 5.0,
      "verified": true,
      "author": "MY",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Love it!",
      "text": "I ordered it to carry when traveling or shopping. It is big enough to hold everything I need and small enough to be comfortable under a coat so that it is even more secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Love it!",
      "text": "Exactly like you’d find in Dillard’s for half the price. Perfect size for all my cards, chapstick, & cash. My iPhone XS fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Ninks1976",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "great gift",
      "text": "I bought the Sak Iris Large.......for my wife's birthday and she loved it. She liked it so well she bought one for a friend's birthday.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Stylish",
      "text": "Wallet has a strap for easy shopping when I don't want to take my purse. Smart phone pocket fits my I phone 11 in its case. Inside there is lots of room and a full length zipper compartment for change or anything else little. I am very happy with my new wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "Denisek",
      "helpful_votes": 0,
      "publication_date": 20201020
    }
  ],
  "product_meta": {
    "title": "The Sak Iris Large Smartphone Crossbody",
    "description": "Find the perfect companion for your day on the go with The Sak® Iris Large Smartphone Crossbody bag. Made of leather with polyurethane trim. Zipper closure. Detachable wristlet strap with detachable, adjustable crossbody strap. Exterior front pocket. Signature logo detailing. Lining made of polyester. Interior zip divider pocket. Sixteen interior credit card slots. Imported. Measurements: Bottom Width: 7 3⁄4 in Depth: 1 1⁄2 in Height: 4 1⁄2 in Strap Length: 54 in Strap Drop: 52 1⁄2 in Handle Length: 12 in Handle Drop: 5 in Weight: 9.2 oz\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :0.8 x 7 x 4.5 inches; 8.2 Ounces\n * Item model number :107467\n * Department :Womens\n * Date First Available :August 10, 2016\n * Manufacturer :The Sak\n * ASIN :B01FLNKEEM\n\n * Amazon Best Sellers Rank: #24,459 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #67 inWomen's Crossbody Handbags \n    *  #12379 inWomen's Shops \n   \n   \n\n * Customer Reviews:4.4 out of 5 stars867 ratings Find the perfect companion for your day on the go with The Sak® Iris Large Smartphone Crossbody bag. Made of leather with polyurethane trim. Zipper closure. Detachable wristlet strap with detachable, adjustable crossbody strap. Exterior front pocket. Signature logo detailing. Lining made of polyester. Interior zip divider pocket. Sixteen interior credit card slots. Imported. Measurements: Bottom Width: 7 3⁄4 in Depth: 1 1⁄2 in Height: 4 1⁄2 in Strap Length: 54 in Strap Drop: 52 1⁄2 in Handle Length: 12 in Handle Drop: 5 in Weight: 9.2 oz",
    "rating": 4.4,
    "feature_bullets": [
      "100% Leather; Trim: 100% Polyurethane; Lining 100% Polyester",
      "Imported",
      "Polyester lining",
      "Zipper closure",
      "26.5\" shoulder drop",
      "Strap Drop: 711640549971 inches; Pockets: 2 slip, 1 zip, 1 exterior, 0 id windows, 16 card slots"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "0.8 x 7 x 4.5 inches; 8.2 Ounces",
      "Item model number": "107467",
      "Department": "Womens",
      "Date First Available": "August 10, 2016",
      "Manufacturer": "The Sak",
      "ASIN": "B01FLNKEEM"
    },
    "categories": [
      "Women",
      "Crossbody Bags",
      "Handbags & Wallets",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 51.17
  }
}