{
  "website_summaries": [
    {
      "verdict": "Durable and highly adjustable, this clip fan can run on USB power or use a rechargeable battery for maximum flexibility.",
      "pros": [
        "This 7.5-inch tall fan runs on USB or rechargeable battery for flexibility",
        "Speed dial adjusts wind to maximum of 10.5 feet per second",
        "Offers 360° rotation, both vertical and horizontal",
        "Clips anywhere you need it",
        "Sturdy clip, but durable if dropped"
      ],
      "cons": [
        "Some report the fan's power suffers when the USB is plugged in, and the rechargeable battery doesn't last long"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "An absolute must for baby strollers during summer",
      "text": "This little fan has FAR exceeded my expectations. The battery that came with it will last an easy 2 to 3 hours on high. It moves plenty of air and keeps a little one cool during those hot days. We use this all the time at the theme parks. An excellent investment. Just a suggestion purchase yourself some extra 18650 batteries. Another tip, you are external phone charger/battery pack will also charge and run this fan for many many hours. If I could give this thing 10 stars I would. It is durable and I was also survived multiple drops off of the counter and several times and we have gotten caught in heavy rain storms.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 68,
      "publication_date": 20170715
    },
    {
      "title": "The power is amazing. Clip is good and strong",
      "text": "These things are awwweeeesoommme. Bought three. The power is amazing. Clip is good and strong. You will be surprised. Battery last a good hour on high and much longer on low takes a couple hours to recharge so long recharge. Doesn't run on full power when plugged in though meaning when you turn fan on high it doesn't run as hard as when it's not plugged in (weird huh?) Only thing i don't like is the \"special\" battery. Did Amazon search and doesn't seem to be any here. So I guess if battery breaks in a few years I have to re-buy the fan? Hope not, I'll have to come back here and update review.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr P Shopper",
      "helpful_votes": 202,
      "publication_date": 20160926
    },
    {
      "title": "I loved this little fan",
      "text": "STOPPED WORKING THE 5th TIME I USED IT!!!! I loved this little fan... until just now when it completely died. It's not the battery, it's the actual motor. I am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Deb Lynn",
      "helpful_votes": 44,
      "publication_date": 20170726
    },
    {
      "title": "Battery recharge doesn't work :(",
      "text": "Total bummer!! I loved everything about this fan but when it came time to recharge the battery, it simply did not work. The recharge light wouldn't come on and I removed the reinserted the battery several times bf to no avail. Seems the USB just wouldn't connect (I tried both on my computer and in a wall outlet). Recharge seems to work for some people so maybe I got a defective one? Returning because super disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie R.Top Contributor: Baby",
      "helpful_votes": 35,
      "publication_date": 20170530
    },
    {
      "title": "Powerful little fan!",
      "text": "This is a very powerful small fan! We use it on my toddler's stroller and car seat in the summer. It works great at circulating the air to her and helps keep her a little cooler. It does need to be kept away at a safe distance because little fingers can fit through. And it's easy to charge in the car with a USB port. If I'm traveling with one of our dogs, it works great at getting the AC air to the back of the car to them. I just hook it onto the divider. Wonderful for the summer heat! It's also very quiet. I highly recommend this fan!",
      "rating": 5.0,
      "verified": true,
      "author": "Couponanimal",
      "helpful_votes": 14,
      "publication_date": 20180521
    },
    {
      "title": "Dissappointed",
      "text": "A fully charged battery will barely last 2 hours. I bought this to use in the golf cart. A fully charged battery will not last for 18 holes!! It's a special battery, so you can't put in more batteries to keep it working for a round of golf. Golf carts will rarely have an outlet to charge the battery!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Carol B",
      "helpful_votes": 33,
      "publication_date": 20170625
    },
    {
      "title": "Like Leonardo DiCaprio HOT",
      "text": "I couldn't say enough about this thingy! It saved our kid from a heat stroke this past August (2017) in Naples area Italy. Do you know how hot southern Italy was this August? HOOOT! Like Leonardo DiCaprio HOT! Anyways... It has a strong motor and a pretty decent battery life! We even used it as a cooling fan when sleeping at night, attach right to the headboard, as one of the hottest region in Italy hardly has any A/C when doing air Bnb. One of the best travel expenses EVER! And yes, my husband looked like a terminator with the fan attached to our baby carrier, while walking around in Positano. :D",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 22,
      "publication_date": 20171011
    },
    {
      "title": "Grip mechanism failure / Sky Genius was a \"ghost\"",
      "text": "The fan I recieved was poorly constructed, which resulted in the grip mechanism failing after 3 months of intermittent use. Prior to this the fan worked fine - someone on the assembly line was probably overtired and inattentive. I suspect Sky Genius has closed up and reopened under a different name to avoid issuing replacements or refunds, because they have not responded to my emails, and do not answer their phone when Amazon CS tries to contact them. The Amazon people were quick to respond, and nice enough to issue me a credit. So, I recommend avoiding \"Sky Genius\".",
      "rating": 1.0,
      "verified": true,
      "author": "Harrison",
      "helpful_votes": 5,
      "publication_date": 20191028
    },
    {
      "title": "Functional, but mine is defective.",
      "text": "In a nut shell, it has a 360 rotational hinge, along with the clip you can attach to another object, but...mine is the defective and it sounds like a Geiger counter...and the clicking gets louder than the video shows. It’s really annoying to listen to...I don’t think I’ll buy it it again. Proceed with caution, but I’m sure not all are like this. *****UPDATE:**** I bought another because I had a feeling my old was just defective. The new one works great. It sucks that I actually had to purchase two to use one...but your luck may be different on your 1st purchase, unlike mine...",
      "rating": 1.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 4,
      "publication_date": 20190627
    },
    {
      "title": "NEVER WORKED!!!",
      "text": "We had a baby of 32 weeks, (emergency 46 days in the NICU) we got this product with a lot time in advance, so until today we wanted to use it, when our baby is 4 months now (2 months of her due date). IT DIDN'T WORK! We opened the box, read instructions, charged the battery, we did everything, but nothing. Until now the weather is getting warm, so that is why we used until now. BUT NOW we can't return it because is really late for it! It is new, but didn't work at all. It was a total disappointment!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Claudia Es",
      "helpful_votes": 2,
      "publication_date": 20200531
    },
    {
      "title": "Assembled at the Factory Incorrectly",
      "text": "I was eager to use this fan in my spin class. At the time, I was 6 weeks pregnant and wanted to make sure I was staying cool. When I took the fan out of the box, it took about 3 minutes for the fan blades to get going at a reasonable pace. Still, the airflow was terrible. I don't think it would have been possible to feel it clipped onto my bike. Then, I realized that the blades were blowing the air out of the back of the fan instead of the front. This was a disastrous little piece of equipment. I returned it the same day.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny S",
      "helpful_votes": 3,
      "publication_date": 20180918
    },
    {
      "title": "plastic is cheap",
      "text": "I got one that came with a piece of plastic broken on the front shroud. You could get a finger in the fan blade, so I had it replaced with a new one. The new one came with broken pieces of plastic too, but on the back of the shroud, bigger hole. Also, the battery says it's an 18650, which I have extras of, but my extras will not fit into this fan, they are too long. a bit disappointing. the battery life was decent and the fan was quiet, the clip seemed okay. but they both arrived broken, and the packaging from the manufacturer was not damaged at all. Maybe I'm just unlucky.",
      "rating": 2.0,
      "verified": true,
      "author": "Ray Merg",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "2 years later & still going strong.",
      "text": "I’ve been using two of these products as stroller fans for just over 2 years. Clearly, the fans don’t get much use during the snowy months, but the battery still holds a charge and keeps the kids cool after all this time. It still holds a charge that lasts through a whole soccer game + walk around the park, while on high power. Customer care is really great, too (the clip finally wore out on one of the two fans & they replaced it, free of charge, just this week. That’s why I’m here to sing their praises).",
      "rating": 5.0,
      "verified": true,
      "author": "LandlockedSquid",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Works as Advertised but It is  Loud",
      "text": "The fan works. However, since purchasing this fan, I purchased two other similar fans. The other two fans are much quieter and the battery charge lasts much longer. The other fans are within the same price range. All in all, this fan works, but it's a little too loud for my tastes. When my daughter in the next room knows when I turn the fan on and off, it tells me that it's not only too loud for me, but for her too.",
      "rating": 3.0,
      "verified": true,
      "author": "Low Tech Grandma",
      "helpful_votes": 2,
      "publication_date": 20180810
    },
    {
      "title": "Good, not great",
      "text": "First, keep it away from your child's feet or hands. It might get kicked or handled; therefore, becoming useless. Second, find a place to clip it. You think there are tons of places in your car, but there really isn't. The flexible neck helps, but the fan is heavy enough to droop out of position, such as; sliding down the seat belt, clipping it onto the carseat mirror takes the mirror out of position, clipping to the carseat is to close so she plays with it, clipping to the head rest neck (shaft?) blocks vision of the rearview mirror. We liked the fan, but placement was tough. And it ate the batteries!",
      "rating": 3.0,
      "verified": true,
      "author": "J. Whittemore",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Save your money for a REAL fan with REAL FC inputs for long duration fanning applications",
      "text": "So disappointed in these products which are grossly underpowered via DC/battery design. They don't throw much air and they certainly don't hold much DC charge to sustain use. I don't care how the marketing people spec it out to the world, they just grossly underperform. We went with a larger bladed fan from a different manufacturer that also accepts our DV inputs for long-duration use like for off-grid camping.We do NOT recommend buying this product as there will be a 90% chance you too will be dissatisfied and return. Save yourself both grief and time and research better product/solution for your needs.",
      "rating": 2.0,
      "verified": true,
      "author": "J.E.",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Broke after 2 uses",
      "text": "We lost power for 4 days this summer, and nights were getting unbearable without AC.. then I remembered I had purchased this little fan! We charged it when our generator was running, and it worked great for two nights and ran about 6-7hrs each night, which helped to ease the heat over our heads while sleeping. There is a little wheel to adjust the speed and to turn it off. After two nights, the wheel no longer works to shut off the fan. The only way to turn it off is to take out the battery. This is so disappointing because I was thinking of other ways to use this! Will not be purchasing this one again.",
      "rating": 2.0,
      "verified": true,
      "author": "Jaime B.",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Perfect for babies!!",
      "text": "The sky genius fan is perfect for car seats and strollers!! My son would get so sweaty in his car seat even if we had the AC blasting and now he’s cool as a cucumber while driving!! We recently visited Idlewild Park and it was 85 degrees out and the fan attached to our stroller and kept him super comfortable and he didn’t sweat at all!! I highly recommend this for any mommy’s and daddy’s on the go in hot weather!! *The battery life is great....used for 5 hours straight and it was still going strong. *It’s silent, so it’s perfect for anywhere. *It’s super durable....2 year old toddler tested and approved!!",
      "rating": 5.0,
      "verified": true,
      "author": "Evangeline",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "A great little fan",
      "text": "I assist in a church built in 1771, one of a handful of pre-revolutionary war churches on the east coast which has never been modernized - no water, no plumbing. Also no AC in the summer which is when the church is open for services on the first Sunday of the month. I bought one of these fans with fingers crossed. It works wonderfully - one might say it is a \"godsend\". I will be purchasing another for the altar area. Now, to also purchase a small light for those cloudy days. (PS I do not store the lithium battery in the church w/o AC out of an abundance of caution.)",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Loud hum, but worth it.",
      "text": "I got this for use outside when I’m working on my hobbies. It is fairly compact and lasts long enough for what I need it for. For the price, it is competitive for the other sized fans. It is a little loud, but it is a moderate hum and I can’t really complain given how strong the air is pushed. If you have similarly powered items and have multiple items that use the same battery it’s the perfect little investment. I have a few flash lights and gizmos that use the same battery and have a charging station to quickly swap out a power source. I actually plan on getting one or two more for my grandmother and dog.",
      "rating": 5.0,
      "verified": true,
      "author": "BUllitt514",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "The BEST",
      "text": "This fan is incredible. Strong motor, perfect range to rotate and twist to blow in so may different directions, and battery lasted a while. We took it to the beach with us and it clipped securely on everything- and held great to our city select stroller. I LOVE that you can just plug it in at night to recharge it, and then use it the next day,",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180510
    },
    {
      "title": "Awesome!",
      "text": "I bought this fan to clip on the window sill above my bed. I live on the coast and don't need AC, but sometimes do need a bit of airflow. This little fan is pretty powerful and I love it. I immediately bought a second one to put in my office. The only con is that I run it all night without being plugged in and it lasts for many hours, but after it dies, it comes back to life off and on which can disturb my sleep. I don't have an extra plug to plug it in or I could easily resolve the issue that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Celeste",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Very portable",
      "text": "I haven't used the fan for long but so I can't comment on it's quality. It's a nice little fan which u can put just about anywhere. Battery seems ok, but regardless, u can charge it and run it using ur external battery so it's very portable. I'm sure with very large external battery it can run non stop for about a week. My only complaint is that this fan is very loud for amount of air it pushes. I recommend it for outside, but I can't say the same for somewhere where u need little more quiet",
      "rating": 3.0,
      "verified": true,
      "author": "adam",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great for stroller!",
      "text": "We bought this to attach to our stroller to keep our newborn cool when out for walks in the summer heat. It is so helpful! It clips securely on the handle of the stroller seat and keeps our little one comfortable. The adjustable speed and direction is super helpful to keep it from blowing directly into the baby's face. Recharging is quick and easy - although remembering to do so can be a challenge at times! Great product, I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Rose",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Multi-use!",
      "text": "I wish I'd bought these sooner! I originally purchased them for use in the car/stroller, but since we've been staying home I use them in the kitchen to cool their food - no more almost passing out from blowing on nuggets and fries fresh out of the oven! They seem to be really durable as the kids like to carry them around and subsequently drop/throw them on the ground. The screw covers have popped off but they just snap back on. I only wish the charging light turned green because there's no way to know when its fully charged.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany W. ",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Perfect! Must have item for little one stroller.",
      "text": "This compact fan does great job. I bought this fan to put on my son stroller. It very adjustable you can position and point to any angle you want. My son can sleep and stay cool the whole time riding on stroller. Came with rechargeable battery no worry about outlet. The clip hold very well and also can stand on its own. The speed very powerful, easy to adjust the level, lowest speed already cool enough for my son. There is a sound of fan but not loud much. Valuable price. Going to order another one for myself to attach at bed side. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Poor battery",
      "text": "This was okay.. it was nice having it to cool off my daughter in the backseat. But it did not keep a charge at all! I'm talking like one car drive out and home and it would be dead already after charging it for hours.. not sure if anyone else had this problem. It's a bummer because the strength of the blow worked perfectly and the big clip is such a nice feature. But that battery is very very poor!",
      "rating": 2.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 3,
      "publication_date": 20180822
    },
    {
      "title": "Versatile",
      "text": "Bought this for my grandson. I have a 4RUNNER with a 3rd tow seat. There aren’t any A/C vents located in that area and my grandson loves sitting back there. This little fans helps keep him cool. It is quiet and the rechargeable battery last a long time. It come with a USB charging cable and the 4RUNNER happens to have a USB charging port located right next to the 3rd row seat. On top of all that the fan has a clip and it just happens to fit perfectly on the headrest extension bar of the 2nd row seat.",
      "rating": 5.0,
      "verified": true,
      "author": "P.R.",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Small but powerful",
      "text": "I use this on my spin bike. It fits in the water bottle holder next to the handlebars. You can vary the speed with a dial rather than set points (e.g., fast, medium, slow.) It is quiet but puts out a good amount of wind. It charges through a USB port so there are no batteries to mess with. I have easily used it 5+ hours without a charge. Advice: charge before using it. Mine came charged but quickly ran out of \"juice.\" This is a personal fan and not a room type fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Dogmama",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Perfect for Littles this summer!",
      "text": "You seriously need to buy this product! I am very pleased with this purchase. Yes, you need something to charge the battery with if you plan on going a whole day outside (in an amusement park for example) but that’s if you have it constantly on. I have it in the car currently and use it to and from destinations and have yet to have to charge the battery (3 days worth of driving). You can change the speed of the fan to your desired setting and the hold is amazing, I feel very confident it will not fall off when it’s latched on to her stroller or car seat. Highly highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Keesee",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Worked fine...for 3 weeks",
      "text": "I bought this for the portability and to use at night. It worked great the first 2-3x, on the low setting it lasted pretty much through the nite. Then it started burning through the battery and would konk out after only a couple hours. Now it doesnt work at all. As others have commented, the input jack for the power cord isnt seated properly and plugging this in has always been difficult and I knew it would fail eventually. Look elsewhere, dont buy the reviews, this thing will fail sooner rather than later.",
      "rating": 1.0,
      "verified": true,
      "author": "Sydney Greyhouse",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Great little portable fan",
      "text": "This product does the job! I bought this for my baby to attach to her stroller when we go for walks. Love that the fan has different speeds that you can easily adjust. I just wish the clip and overall body of the fan was made with better quality materials. The fan is plastic (seems durable so far, only used a couple of times) and the clips inner grip is a foam like material. So if you clip it on something that's round, it slowly begins to slide off as you go over bumps or lightly knocked it. So you've got to find a flat part to clip it on. But overall, great little portable fan",
      "rating": 4.0,
      "verified": true,
      "author": "Si",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "It broke apart when taking off the lid to insert the battery",
      "text": "When I removed the cover to insert the battery the backside broke off. I can not use it. The material and workmanship is very cheap. Not worth the money. Makes me wonder who wrote all those 5 star reviews. Save your money. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Travel Enthusiast",
      "helpful_votes": 3,
      "publication_date": 20190122
    },
    {
      "title": "Love it over all.",
      "text": "Pros: love it overall! It’s powerful and has easy settings low, med, high. Easy charge battery. Has a safe guard so small fingers can’t get hurt. Neutral: haven’t tested battery life yet. It can get a little loud, so position carefully if using for baby strollers and the such. Cons: it’s a bit heavy and a bit clunky. The clip base means you can only attach it to certain things, however you can turn the fan and it may be able to work for what you need it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Alana Bossie",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Doesn't last long",
      "text": "I bought the fan to hook onto a stroller for longer walks in the heat with my baby. The fan lasted for one long walk and then I would recharge it. After only a month or so of using it often throughout the week, the usb port or cord (not sure which) broke. It had to be twisted just right and clamped to hold in place to get a charge and after doing that 2x it never charged again. Worked great for a month but is now in the trash. Thought it would last a lot longer than that.",
      "rating": 1.0,
      "verified": true,
      "author": "tiffany",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Possibly the best product I've ever purchased from Amazon",
      "text": "I can't believe I'm about to sing the praises of a portable fan but I am! I live in the South where it's hot and humid and this little fan is powerful! I clip it on my chair when I'm relaxing on my porch. I clip it on the handles of my exercise bike and squat machine. I sit it on the edge of my desk when I'm working. The battery last for hours on end and it's just perfect. I'll likely buy another one (or 2 or 3) so I can give this one a break sometime. Could also make a good stocking stuffer at Christmas time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Updated Review",
      "text": "Updated Review: 12/28/2019 Seller contacted me and replaced the fan. Very easy transaction. I have not had the opportunity to really use the fan now as it’s winter therefore not needed. I will gladly update my review to five stars once summer hits as we just moved to the desert and will definitely need the fan. Great until it didn’t work while we needed it the most. The battery seemed fine when connected to a charger but as soon as it was disconnected the fan stopped working. We bought it for our Florida trip and it was useless for us. We used it a handful of times before our trip. I do not recommend this fan",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly B",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Doesn't charge after one use",
      "text": "I bought two of these for my double stroller (City Mini GT), which they fit perfectly on the canopy's. We used them for our trip to Disney. They were awesome and worked for the few days we were there. The one seemed to lose battery quicker than the other though. We packed them away until recently and wanted to use them for a trip to the beach. The one works fine and held charge but the other won't even charge. Pretty disappointing since I need two for my two young kids. $20 fan for basically one time use.",
      "rating": 1.0,
      "verified": true,
      "author": "MNJ026",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Good little fan short battery life",
      "text": "I bought this fan for our trip to Disney. I’ve been testing it outside at the pool. The fan actually blows pretty strong, I was surprised. I think it has a good amount of power. However I’m disappointed at the battery life. I used it twice for 15 min and it died. So it has about a 30min lifespan. I almost wish it just used AA’s that you could travel with and replace because it’s not realistic to stop and charge while at Disney or anywhere out and about all day.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle Anderson",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "MICRO USB Port is cheaply made; Broke and does not take a charge",
      "text": "I bought this product to use it on my rack (bed) on a ship and have it clipped in without wires. After about a week of use the product was working well, however the battery fully charged only lasted about 4-5 hours. Soon after the micro usb port broke using the provided cable to charge; and it stopped taking a charge. I swapped cables to see if that was the issue and it was not. I contacted the seller privately to ask for a replacement, but after a couple emails they stopped responding. The fan worked well at the beginning for what I wanted it for, but soon broke and would not function. cheaply made - do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Koachar Mohammad",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Fan stops working after about 10 minutes",
      "text": "At first glance, I thought this was a nice little fan. I could use it at work or in my car. The first day the fan lasted my entire drive home (40+ minutes). The next day it stopped working within 5-10 minutes. I thought, hmm....maybe the battery needs to charge. So I charged it overnight. Now the fan works about 10+ minutes and then just dies. I can restart it......and it does the same thing. It has one lithium battery. I would not waste my money on this device a second time.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Cannot find replacement batteries",
      "text": "I actually like the fan's performance. However, the main reason I bought it is because I already have 18650 batteries. Unfortunately, this battery (and the battery compartment in the fan) is smaller than any other 18650 I've found. I thought that my Nitecore batteries were oversized because they have protection circuits, so I checked measurements and bought some cheap unprotected batteries. None of them fit in this fan. Keep this in mind when you purchase the fan. If you find a battery that fits, I'd love to hear from you.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Nice fan, but no variable speed",
      "text": "The fan works fine, is 'fairly' quiet, and otherwise as advertised....except it does not have variable speed as indicated n the product description: \"Better Quality Battery - Replaceable and Rechargeable 2600mAh 18650 battery ( INCLUDED ),******2.5~6 hours working time depend on different speed******,. The rotary switch works as if it should apply increasing or decreasing speed, but the fan operates at the same speed regardless of the position of the switch. If variable speed is important to you - don't buy this fan. If not, then it's a good purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Lance N.",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Jealousy at the Gym",
      "text": "I belong to a gym that has NO fan on any of it's cardio equipment. I purchased this fan to use on the treadmill and the rower. When I set it up, other gym members look at me like I'm a pro :-)and I can see their pangs of jealousy while I'm basking in the cool refreshment of it. This fan is small but mighty. Only use the USB to recharge it, though. Once I plugged the USB into the treadmill because the battery was dead and it doesn't have the same power as a fully charged battery. The fan is super adaptable, it twists, pivots, and adjusts to any situation. I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "C Frazier",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Best little fan, good for baby strollers",
      "text": "Love this fan. I got it to clip inside my newborn daughters stroller and it works really good, it blows enough cool air to keep her cool. The battery charges fast and lasts a decent amount of time. My favorite thing about it is the base, its sturdy and big enough to clip onto things ( like my 6 year olds bunkbed lol) and not having to worry if its going to fall on my daughters head while moving and it can stand on its own. I would recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Gannon",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Great Product",
      "text": "We love this product! Great for our stroller to keep baby cool. We clip it on the canopy of the stroller. The fan head and strength is adjustable. The battery is rechargeable and has a good battery life. The fab head slats are a bit wide and sometimes I have to either place it so baby can’t reach or swat her fingers away but even when she’s sneaked past me, we have not had any injuries. The only improvement with be for the fan head to have smaller slits, other than that it is a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela C.",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Must buy if you’re a dad",
      "text": "Most amazing thing a dad can get for his baby, used it in San Antonio to keep the baby cool as we explored the river walk, if you’re a dad, buy this, it’s a life saver, especially when your on a river tour and you’re wife has to breast feed and you got to keep her and the baby cool and happy while she used a baby blanket to cover up, so people with weak feelings aren't offended by breast feeding",
      "rating": 5.0,
      "verified": true,
      "author": "daniel clark",
      "helpful_votes": 2,
      "publication_date": 20190616
    },
    {
      "title": "Absolute junk",
      "text": "This fan is awful. The battery lasts maybe 3 hours, which is awful considering it’s for our trip to Disney. Also, it literally snapped in half two days after using it. We had it clipped to the stroller and came back to it completely broken and can no longer be used. Absolute junk and waste of money. We even tried to super glue it, and the plastic just keeps breaking.",
      "rating": 1.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Lasts 3-4 hours before needing charged",
      "text": "This might be my favorite buy of the year. I’ve recommended this product to 3 other people who love it as well. One of my friends purchased two. This is a must for hot days. The fan power is amazing. I use it mostly for my son when he is in his stroller but my grandma was getting over heated in Disney and it saved her from leaving and going back to the hotel. The batter life is about 3-4 hours but I always take a cell phone back up battery with me wherever I go, so when this dies especially in Orlando or somewhere really hot you can have another 4 hours with a backup batter.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Salman",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Poor quality control and customer service",
      "text": "Bought this for my toddler for long car rides. Within a week, one fan started making a high pitched whirring sound because the fan bearings had failed. Contacted the seller to no avail. Then, 3 months after purchase, the battery life of both fans plummeted from multiple hours to maybe an hour on low. Finally, 4 months sfter purchase, the second fan stopped charging altogether. Waiting to see if seller will service or replace.",
      "rating": 2.0,
      "verified": true,
      "author": "Jos",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "What a GREAT portable fan that has a rechargeable battery!!!",
      "text": "This fan is GREAT!!! I bought for our stroller but have found soo many more uses for it like my bicycle, Peloton Bike and chair when sitting in the sun. Realy long battery life, USB rechargeable and can be plugged in as it uses a micro-USB which is soo universal these days.",
      "rating": 5.0,
      "verified": true,
      "author": "ragnu23",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Already broken",
      "text": "I purchased this fan 3 weeks ago to use on my infants stroller - we live in Florida, so a good fan for walks was super important! Considering the awesome reviews on this, it was a no brainer. Less than 3 weeks into using this fan, it’s broken already. For a few days, it was doing this weird thing where it was changing speeds on its own while in use, and then a couple days later, it just never turned on again. I’ve tried charging fully, taking the battery out and putting it back in, nothing has worked. Will be spending more $$ for a more reliable fan!",
      "rating": 1.0,
      "verified": true,
      "author": "Bridgette",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Surprisingly powerful for it's size",
      "text": "I picked up this little beauty on a lightning deal and wish I had bought two at the time. It does put out a good breeze within 3-4 ft. I leave it in a room that is warmer than the rest of the house and it enough to make the temperature comfortable. Although I wouldn't rely on this fan if the power were out in Florida in the middle of summer, it definitely does help. Manage your expectations and you should be pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Shadowne",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Blows strong and lasts long on one battery...",
      "text": "Fabulous little fan! Powerful. Quiet. Portable. I bought it to attach to my computer at work. I’m a nurse, so sometimes I even let my patients use it when they are sweating like crazy despite their thermostat being turned all the way down. I love that it is rechargeable, if necessary, but that it requires batteries I normally carry with me anyway. I work 12 hr shifts, so I needed a fan which lasted longer than 2 hours. On low (which still blows a lot), it can run on one battery for my whole shift. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Flinkity",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Great investment",
      "text": "I love this! I bought this in 2019 for my daughter for when we go to the zoo & for power outages. The only thing is, is that the battery life only lasted 20 mins for me & Well, I now want to use it for the car so I contacted the seller to see what battery size and the customer service is amazing! They’re so nice! Definitely buying another for the house, the car, and stroller! Great purchase! And it’s small and convenient to stick in my purse lol",
      "rating": 5.0,
      "verified": true,
      "author": "Jocelynn Jennawae ",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Quiet with ample air flow.",
      "text": "I bought this to provide air flow at my desk at work, so I needed a quiet fan. This fan can sit on a flat surface or clamp onto the edge of the desk, and the fan housing can be positioned to blow air in any direction needed. It will run a good while on a full charge, but you can also plug it into a USB port to keep it running longer. It’s variable speed but I find I only need to run it at the slowest speed.",
      "rating": 5.0,
      "verified": true,
      "author": "MV Fan",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Needs a better clip",
      "text": "Pretty powerful for a small fan. I had used it on walks with my infant son. My biggest beef is the clip. I wish there was a different clip, something adjustable and more secure. On more than 1 occasion, the fan popped off/unclipped from the stroller. I don't use it as much because of that. Bummer because I did like it and thought the fan itself worked well. It is easy to charge but I can't speak on the battery life since I stopped using it because of that clip.",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle B.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great little power house",
      "text": "I absolutely can not sleep without a fan on. Because of this, it is horrible whenever we lose power. Since this is battery operated, that is no longer an issue. I also plan on taking this with me to hotels when traveling. It has a clip at the bottom that I use to clip it on to my nightstand. I know that this is marketed as a stroller fan, and I'm sure it would be great for that application as well. But it has so many additional uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina Silva",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "DMALL, PORTABLE & LASTS A LONG TIME.",
      "text": "I really like this little fan for my treadmill. I actually use it for other things, but the majority of the time it's on the workout equipment. The battery lasts quite a long time and doesn't take a long time to charge. I've gone months without using and turn it on and it still works. I've also had it running a few hours before dying. I haven't tried plugging it in and keeping it plugged in while running so it might last longer if you're at a desk or in a car but I do like the small compact size and portability of it.",
      "rating": 5.0,
      "verified": true,
      "author": "K9-TRIGUN",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Perfect for keeping cool at work",
      "text": "I mainly got this to keep me from overheating at work. I do physical labor and sometimes it can get really hot. Also not having the ability to sweat makes this thing a life saver. It works for quite a long time and it's very durable. Everyone I've let try it out said they were impressed by how strong this fan blows especially for battery operated one. (Also, why have star rating for warmth? lol)",
      "rating": 5.0,
      "verified": true,
      "author": "Peewee",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Much Needed Breath of Fresh Air",
      "text": "I work in a factory and we never use the ac, as a result we use fans all throughout our departments. Unfortunately none of the fans hit my cubicle and I roast for hours without it. So naturally I went and got myself a personal fan! I have never been happier with a purchase! Its lightweight, easily positioned, quiet and so much more powerful than I thought it would be! 1 charge lasts me about 4 hours on the low setting and about 3 on the high setting. Keeps me cool and refreshed all throughout my shift! If you're looking for a great portable fan this is the one!",
      "rating": 5.0,
      "verified": true,
      "author": "Kai",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Fantastic for Stroller!",
      "text": "I bought this fan to attach to my childs stroller for long walks in the summer. The fan itself is amazing and I love that the dial control for speed lets you control at all speeds (not just 3 settings). The clip is strong and holds onto the stroller very well and the battery lasts a while. My only complaint is I wish it beeped or something when the batter was getting low. You have no indicator or way to know when it's low and I've had it die mid-walk for me multiple times.",
      "rating": 4.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Not Exactly What I Was Expecting",
      "text": "The fan is ok. The battery doesn't last very long. I honestly don't know how long it lasts, but it's less than the 5 1/2 hours I sleep. And I like to run the fan on the battery because it blows a LOT harder running on battery than if it's just plugged in. When it's running on electricity, it barely gets up to medium. But overall, it's not bad. It clipped on to my bookcase just fine. It's small enough to throw in a suitcase to travel with. It's just enough white noise for me.",
      "rating": 4.0,
      "verified": true,
      "author": "KellyH",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Needs better clip!",
      "text": "I bough this to use in my baby's stroller & wagon out in the summer heat. It blows pretty well, but the clip is aggravating on it. It doesn't like to stay clipped on to the wagon or stiller, which have totally different widths of where I'm clipping them at so that's not the problem. The wagon has about an 1.5\" spot where I clip it at & the only place it'll work on the stroller is on the canopy which is very thin! It will not clip on the try in front of the baby on the stroller where I'd like it to.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Nice Little Fan",
      "text": "I just received this Fan. I really like that it is easily portable and usb chargeable. I am able to either stand it up or clip it to most any sturdy surface. I am especially looking forward to clipping it to my bed for the upcoming hot Vegas nights. It is a bit noisy but I believe that’s because it’s pretty powerful. I would imagine it could also be kind of a relaxing background sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Broke after 2 days of use but they refunded the amount",
      "text": "It seemed like it would be a great product but unfortunately after only 2 days of use it stopped working for no reason. And this wasn't continuous use, only 20 minutes at a time off and on. I plugged it in to recharge hoping that was the issue but no luck. It happened at horrible time too, in the middle of a trip in a heat wave. So disappointing. Updated to add that the seller did reach out and offered to replace or refund the purchase price. I appreciate the great customer service.",
      "rating": 3.0,
      "verified": true,
      "author": "Kellie Coffey",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Great little fan!",
      "text": "We bought this for Disney and it was great! I used it while I was strolling my child (They had a fan) I would clip this to where it was blowing on me while I was pushing the stroller and it was a lifesaver! I will be buying another one as I left mine plugged in at the hotel on our last day there. :-( The battery life was pretty good considering I had it on full blast for about 5 hours with turning it off (when I remembered) when I wasn't using it. Love that you just have to plug it in and not worry about batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Trishak",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Spin class is more tolerable",
      "text": "I love this fan. I had tried another brand but returned it as it was too loud. This fan is perfect. Very quiet, wonderful adjustable air current, strong and adaptable clip. It's made of a strong plastic so is durable. I can throw it in my gym bag with no worries. It's so portable and will clip-on most anything. I'm getting more to help with airflow in shower room area. Highly recommend this fan.",
      "rating": 5.0,
      "verified": true,
      "author": "dawtravelbug",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Powerful little fan",
      "text": "This is a small, but powerful little fan. We clipped it on the stroller to beat the Florida heat while at Disney World. It kept the kids nice and cool. The battery didn’t seem to last long. We did a lot of “off and on” and had to recharge the battery once each day. We attached it to an external battery and I was surprised to see that is it works while charging. On another surprising note, this fan got completely soaked by the rain and it was still working! Worth it to me, I’m going to purchase another.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Great portable wireless fan except while charging",
      "text": "This fan works great. I purchased it for use at my desk during the summer to improve air circulation. The only complaint I really have is that it does not operate at full speed while charging. I ordered another one for my husband to use on the cart during golf rounds. I can't speak to the efficacy of the clip as I only use it on a flat surface. My coworker purchased the same product after seeing mine.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "The best kind of small yet powerful fan for the summer.",
      "text": "This is the best fan I’ve ever seen or used. I LOVE the clip on feature. It makes portability so easy. I use it on my desk and on my stroller and even on my backpack to keep me cool in the summer. This is an absolute must have. The clip is strong and the battery life lasts for about two and a half hours. I take around a portable battery pack and can keep cool for hours on end. Love this so much!!! Even my boyfriend who was dubious when I first bought it has been converted to be a true “fan”.",
      "rating": 5.0,
      "verified": true,
      "author": "K K",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Highly recommend! Must have!",
      "text": "Must have for a summer baby!! My little one cries when he gets placed in his car seat because he’s so hot. The minute I turn this fan on he immediately stops crying. I take it everywhere! I even attached it to his boppy at the beach to keep him cool and attach it to his stroller and baby carrier on walks. The battery also lasts the longest time! It ran for 2 1/2 hours straight on the car ride to the beach and my little one slept the whole time! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Paige Wiggin",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Perfect little desk fan... would be a good travel fan too!",
      "text": "Great little fan for my office desk... afternoon sun hits the back office windows and all but roasts the dr and I all thru the summer. I bought one for each of our desks and they both work great! The clip feature allows us to move the fan as we see fit and the battery life is decent and I like that its rechargeable (I just keep mine plugged into my computer USB most of the time) I thought it was a bit loud at first but nothing obnoxious and I got used to it fairly quick. The fan swivels nicely so you can redirect the air flow as needed.",
      "rating": 4.0,
      "verified": true,
      "author": "dmum89",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Perfect for strollers and carriers.",
      "text": "We use this fan on my baby’s car seat and stroller. It hooks perfectly to the handle and really comes in use on our walks. We’ve never had a problem with it staying in place. My only complaint is the battery life on the fan. It only lasted us about a month. I can’t find a replacement battery anywhere. Luckily there is a back-up charging unit that we are able to use, so we can still get effective use out of the fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "life saver!",
      "text": "Thanks to this fan, our baby was nice and cool during our Cancun Vacation. The battery life is pretty decent and we would take our back up charger and charge it on the go if we were out and we forgot to charge it. It's easy to charge and very light weight. You can clip it to anything and adjust it very easily. Some lady even offered to buy it off of us from how practical it was. 2 thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Roy V",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "My experience was that the item had to be returned.",
      "text": "Thought this was the cats meow when I bought it and used it the first day. Put it on charger overnight. Used it again the next day. It stopped and I thought the charge was gone really quickly, so I put it on charger overnight. Used it the next day and it turned off after twenty minutes this time. Charged it overnight again and it turned off in five minutes. Returned it for full refund.",
      "rating": 2.0,
      "verified": true,
      "author": "HappyRetiree 2015",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Works great clipped to the treadmill",
      "text": "I bought this to use at the gym for more air when in a treadmill walking class. I felt as if my body heat was slowing me down when my muscles had more energy to give. I bought the fan to have more air to reduce body heat. Works great! I’ve had the battery run out mid-class twice after trying to use it for more than one class. I’ve been more diligent to charge it after every use. I would highly recommend this fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Super handy!",
      "text": "This is SO handy!! We got it for my daughters stroller and I find myself using it even in the car or by the bedside for hot summer nights! The power is AWESOME! The battery is pretty good but wish it lasted a bit longer. I was sick and used this clipped to my nightstand so I’d have a breeze in my face and it died by the end of the day - now it may not have been completely full charge when I started but it was close. So still to last all day is good! Just wished a little more :) still 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Surran",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Awesome for carseat",
      "text": "I love this fan. I use it for my daughter’s car seat since there aren’t any air vents in the back of my car and NC weather is hot. The clip is very strong and secure. It is quiet. The air flow is great. My only complaint is the battery only lasts a few hours, but it is rechargeable.",
      "rating": 5.0,
      "verified": true,
      "author": "Trent C.",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Keeps your favorite gardener cool",
      "text": "I bought this fan as a gift for my mom, who loves to garden. It's compact but air flow is pretty good. The rechargeable battery means the fan can be used without needing a power outlet, and the built-in mounting clip lets my mom attach the fan to her potting bench as well as her garden bucket when she's on the move - so she can have fan cooling wherever she happens to be in her garden!",
      "rating": 4.0,
      "verified": true,
      "author": "James R.",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Powerful breeze even at the lowest setting!",
      "text": "I never write reviews unless I really LOVE and I mean, LOVE the product. We live in Hawaii and sometimes the humidity and heat are just overwhelming. With this fan, I can keep baby comfortable in her stroller while I’m out getting some exercise or even when we’re out at the beach. At the lowest setting, I got roughly about 6.5 hours of battery life at a full charge. This fan is super powerful. I haven’t seen how long it lasts at the max setting because it’s much too strong for my little one. I really love this fan and I hope it’ll last for a while. Get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Peyzel",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "Good for strollers!",
      "text": "I got this fan because I was needing something to keep my baby cool during the summer. This fan works great! The clip is very strong and has stayed attached to anything that I’ve clipped it on (but isn’t too hard to open with one hand). The speed setting is easy to use and has a good battery life. Also, the cage around it is small enough my babies fingers couldn’t get in!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Good Buy!",
      "text": "I used this fan on an extremely hot and humid day where I was vending outdoors. It worked pretty well, but the battery ran out after about a couple of hours. I did have a portable charger with me and I used it so I could continue using it for the remainder of the day. It would be nice if the battery could last longer. Overall, I was pleased with the fan.",
      "rating": 4.0,
      "verified": true,
      "author": "Crochet Lady",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Pretty impressive",
      "text": "I have used them one (long) weekend at this point. Charges from a usb and the weird shaped battery (at least weird for USA) does charge pretty quickly and lasts a reasonable amount of time. Using them in a primitive camping situation, they were a little loud, but kept a good air flow going for 4 hours at a lower speed. The clamp works well. Overall a good purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Capn Dar",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Great portable fan for baby (and me)!",
      "text": "This fan is amazing! I have used it on baby's crib, stroller, and pack & play. It is so powerful, I have only needed to use it on low. With all of its mobility, I can clip it on just about any where and still get the air angled at baby how I want. I've been using it off and on for over a week and haven't had to charge it back up yet! Love, love, love. Will be buying a couple more for friend and family!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great little fan! Especially for moms",
      "text": "I bought this fan for the delivery of my child and find myself using it frequently in the middle of the night during feeds! My hormones are still leveling out so it’s fantastic to have this little fan at my bedside. I use it all the time over the last 2 months and have only charged it twice! In the summer months I’ll use it on my stroller to keep my son cool. Couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Christix3",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Powerful little fan",
      "text": "Wish I came across this sooner. Not only are we in Texas my lil one is in a helmet so I need all the coolness enhancements I can get! Great for car and stroller. I didn't try crib, didn't feel comfortable leaving my baby unmonitored with it. But I love the 360 effect and the fan has power! I was surprised that it arrived on \"low\" setting because it felt very high.",
      "rating": 2.0,
      "verified": true,
      "author": "Astral Quest",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Did the job for 4 out of 7 days  and broke.",
      "text": "Ordered way before our Disney vacation and stopped working either 3 days or 4 days into our 7 day vacation. Was the most amazing fan up until the time it stopped charging. Apparently I'm too late to replace since I ordered it so early compared to the time now that I got back. Might want to check other options out there...Has a lot of good reviews so I might've just had bad luck.",
      "rating": 2.0,
      "verified": true,
      "author": "LoboUDL",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Charger input gets loose quickly and fan dies.",
      "text": "I really want to like this but I don't. We live in Vegas and it's super hot in the summer. Bought this to clip into the back seat for my daughter's car seat. We have purchased two of these both of which have stopped working pretty quickly after we started using. The charger input gets loose and then it doesn't charge and dies. This has happened on both of them.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole S. ",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Excellent fan! You can get it to your exact setting",
      "text": "What I absolutely love about this fan is the fact that it is not a one size fits all. Most fans have 2 settings, low and high. This one is completely adjustable between its lowest and highest setting. Only downside is that the clip doesn't go far onto anything. I have another fan that can fit on almost any surface area and hold on snugly, this one, although snug, only goes on about an inch.",
      "rating": 5.0,
      "verified": true,
      "author": "Althea",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Love it! Powerful, lightweight, quiet, versatile.",
      "text": "It is lightweight, but a little bulky. Not a problem for me. It charges well and easily. Excellent power for a small fan. I use it mostly at the gym. I clip it onto my spin bike, eliptical trainer, etc. I also use it on the bedtable when I travel, at home and at work on my desk when I need some extra airflow or coolness. I am hoping it lasts longer than a previous fan from a different company. After 2 years or so, the charging port would no longer work, even though the fan itself worked fine. Love this little fan!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CB75",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Portable, quiet.",
      "text": "It is relatively quite with fan speed that can be changed with dials which is extremely helpful. We got these to use for baby's stroller, but slits are big for babies where they can stick their fingers in. But once little older, shouldnt be an issur. Also, it is not regular battery, so charging has to be done using usb cable that comes with the product. Extremely portable that can clip on to whatever.",
      "rating": 4.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Wouldn't recommend",
      "text": "I've already purchased 2 and both times the USB cord connector to the back of the fan was faulty. This prevents the battery from charging, too. The battery is not good - only lasts for a little while. The manufacturer warranty is short, but Amazon did reimburse me. My advice is to purchase a different fan from another brand & manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Cassy",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Great value for price!",
      "text": "This fan is pretty powerful for its size when on full blast! It’s perfect for a stroller during hot days! I love the it can be placed on a table to stand on its own while also being able to clip on to something. After life is pretty good. I only wish it had an indicator of how much batter it has left! Overall great item and highly recommend as a stroller fan!",
      "rating": 5.0,
      "verified": true,
      "author": "DMR",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great",
      "text": "Absolutely adore this fan. I bought this to replace a fan I already had for my sons stroller because the other one doesn’t provide enough relief from the heat and I was not disappointed! This fan has great power and gives a lot of air for my baby. The only thing that is frustrating is the charge doesn’t last crazy long but it’s not super short either.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda King",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "A Cool Way to Spin",
      "text": "Several others in my indoor cycle class had this fan on their handlebars and all recommend it. There is only one large fan in our small room that doesn't even reach some positions, and in the summer, even the mirror can drip with moisture. It's been great to have my own fan, adjustable for how much current I want to feel, and easily slipped into my gym bag going to and from my workouts. The battery lasts a long time (I haven't run it down yet). Bought primarily for the cycle class, I expect this will go with me on camping trips, too.",
      "rating": 5.0,
      "verified": true,
      "author": "AZCharlie01",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Only good things to say",
      "text": "LOVED clipping this on my hospital bed and using it on my face during labor. Great to clip on baby's car seat and stroller when it's too hot. Great that the slats are narrow enough that I'm not worried if baby gets access to it (of course he shouldn't be close enough to touch it, but you never know). Great that it's not too loud. So appreciate the light in the back to indicate when it needs to be charged and when it's charging. Love the ease of changing the speed. Love the ease of swiveling and manipulating the direction. Easy enough to plug into a cord charger (works on my old phone charger and my baby monitor charger).",
      "rating": 5.0,
      "verified": true,
      "author": "Laura C.",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Nice breeze but short battery life",
      "text": "I bought this for cooling down our camper van at night while we were sleeping and it was not very useful because the battery died quickly, within a couple hours. I was hoping it would last longer, but I guess I’ll just have to buy a battery version, not a rechargeable one. Also, the fan got bumped while it was charging and the connection to the fan bent so badly it no longer works. Thankfully I have other USB charger cords I can use. All that said, the power of the fan was really good while it was on!",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Hengstenberg",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Poor battery life.",
      "text": "I live in a Texas, and walk 3X daily (30 min, 1 hour, 1 hour) pushing a wheel chair, and a stroller. I purchased one of these fans to test on our jogging stroller to see how it would hold up against Texas summers. While the fan does provide sufficient cooling, the battery life is terrible! The description states it should run for 6 hours when it’s used at its highest setting, but mine is dead after only 2 hours run time. Highly disappointed in this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Chubby Mako",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Portability best describes this little mobile fan!",
      "text": "It has a great design (optimal turning ability)! It's super sturdy and feels like it is made of quality material. The noise level of the fan rotating is low enough to not bother if it's directly in front of you. The battery for mobility is the plus feature. The reason for four out of five stars is due to only getting about 3.75 hours on a full charge running on the lowest setting. Overall, I am satisfied with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Dino",
      "helpful_votes": 0,
      "publication_date": 20190707
    }
  ],
  "product_meta": {
    "title": "SkyGenius Battery Operated Clip on Mini Desk Fan, Black",
    "rating": 4.4,
    "feature_bullets": [
      "Unique Design - Original, fashionable, powerful, potable battery clip fan",
      "Powerful - High quality motor, max wind speed 10.5ft/s, high speed and low noise, stepless speed regulation.",
      "Better Quality Battery - Replaceable and Rechargeable 2600mAh 18650 battery ( INCLUDED ),2.5~6 hours working time depend on different speed,USB charging from a computer,power band,USB Charger,Can be also powered by USB power source",
      "Compact Size - 19*15*10cm(7.5*6*4 inch), portability, handy, lightweight, 360° vertical and horizontal rotation",
      "Clip Style - Can be Put or Clip on anywhere you want, great for baby stroller, home and office, laptop, gym workout, car backseat, outdoors, camping, trips and anywhere need cool wind"
    ],
    "specifications": {
      "Product Dimensions": "7.48 x 3.94 x 5.91 inches",
      "Item Weight": "9.6 ounces",
      "Manufacturer": "SkyGenius",
      "ASIN": "B01FFWG0I8",
      "Item model number": "SKG-F130",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.4 out of 5 stars9,870 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#871 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Finish Types": "Painted",
      "Warranty Description": "1 Year",
      "Batteries Required": "Yes",
      "Included Components": "USB charging cable"
    },
    "categories": [
      "Home & Kitchen",
      "Household Fans",
      "Heating, Cooling & Air Quality",
      "Personal Fans"
    ],
    "price": 19.99
  }
}