{
  "website_summaries": [
    {
      "verdict": "We like this brand's affordable price and its sustainable and renewable sourcing.",
      "pros": [
        "Completely natural plant-based formula",
        "White color helps detect any urinary issues",
        "Clumps almost instantly, and traps odors without chemicals",
        "Soft on the cat's paws, and easy to transition from clay litter"
      ],
      "cons": [
        "Clumping ability can be hit-or-miss",
        "New formula may not be as flushable as advertised"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Caused $882 Damage to Pipes",
      "text": "At first I gave this product a five-star review, but that was before it caused a clog in my house’s plumbing system that cost $882 to fix. The cassava in this litter turns VERY hard and ended up clogging my (brand new) pipes so badly that I needed to have them professionally cleaned. Although this product is advertised as flushable it most certainly is NOT.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 30,
      "publication_date": 20190731
    },
    {
      "title": "Litter hunt",
      "text": "I've been on the hunt for litter that fits my criteria. Natural, clumping, affordable and low tracking. This corn clumps like a rock! The pee reached the bottom of the pan but it didnt stick. It just clumped together, didnt fall apart and I'm AMAZED by the hard clump. With the poop i doesnt clump around it however it dries out the poop. Doesnt stick to the scoop. Barely any litter in the floor because it is heavy. After months of litter after littler I finally found one that Mark's all the boxes.",
      "rating": 5.0,
      "verified": true,
      "author": "Preston & Asia",
      "helpful_votes": 2,
      "publication_date": 20200509
    },
    {
      "title": "Great for learning to use toilet",
      "text": "Great for the cats learning to use the toilet Safe for flushing Drys great for flushing Separates when in the toilet before flushing fast",
      "rating": 5.0,
      "verified": true,
      "author": "ValaundraCosplay",
      "helpful_votes": 6,
      "publication_date": 20190208
    },
    {
      "title": "Best litter ever.",
      "text": "This is my favorite cat litter ever. I have tried other brands recently but I keep coming back to this because it is super easy to clean the litter box. Nothing gets stuck to the bottom. The hard clumps means the whole mess comes out with sifting. I don’t flush it down the toilet. Also... I’ve been thinking about getting pretty litter which is way over priced. It tells you if there is something wrong with your based on the color of the litter. Well this litter did show signs of pink when my love had a bladder issue and I am grateful I was able to detect that so quickly. I wish they made 40lb size bags.",
      "rating": 5.0,
      "verified": true,
      "author": "the one",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Rock hard clumping!",
      "text": "I have 5 cats. I’ve tried every single litter available. It unbelievable how hard it clumps! With clay litters I usually have to toss the last quarter of a box of litter, because it’s been wrecked by pee balls that broke apart. Not this! There is no waste at all. I first tried the tiny grains, which worked great but the tracking was terrible. I’ve not had that problem with the small grains and it clumps just as good. I can’t recommend it highly enough! Update: My cat passed blood in his stool. I was able to see it immediately due to the light color, even after he covered it. I may have missed it with regular clay Litter.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Best litter ever",
      "text": "This is the best litter we have ever tried for our furbabies. We wanted to change from scented, chemical laden litter and absolutely did not want clay for their health. We tried, no joke, dozens of different liters over the years. This is hands down the winner. The only thing you need to change is you must get a very fine sifter to get all the little particles that break off the clumps. Regular litter scoops leave too much of them in the litter. Clean it diligently and it lasts a lot longer than other liters between full litter dumps and cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Reaperblade",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Best litter I have ever tried",
      "text": "My cats took to this litter with no problem. This litter clumps extremely well. It clumps better than the higher end clay litters I've tried. This is particularly helpful if your cat likes to urinate in the corners of her litter box as mine does. I even like it added to clay litter just to improve clumping as it is very fine powdery and may take a while for some cats to adjust to the texture. It also seems to absorb odors almost completely and certainly better than the clay. It has a unique smell but is not offensive. It makes cleaning the litter box almost effortless.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Clumps are SOLID",
      "text": "It’s expensive but it’s the only litter our temporarily disabled cat can/will use that doesn’t cake her butt and tail in a disgusting mess of pee, poo, and litter goo. The clumps are hard and do not break apart. It clumps so fast that it’s solid before she even drags herself out of the litter box. It’s pretty fine and she gets it everywhere, but I’m just relieved she’s not leaving slug trails of piss-mud around anymore. I was getting exhausted bleaching her area constantly and giving her constant full body baths. She’s been confined to a pen for most of the day for months now, and with this new litter she’s going to have a lot more freedom!",
      "rating": 5.0,
      "verified": true,
      "author": "Layla",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Heavenly product no odor so happy!!",
      "text": "Where has this litter been all my cat owning life?! I mean, what a huge huge huuuge difference from the other litters out there. I am 100% satisfied. It is pricey but totally worth it. No smell(not even after he goes #1 or #2) clumps great, no dust, and kitty approved. I mean I had to keep checking the box to see if he went because some cats are so picky. I saw that he went and I'm sniffing around thinking my nose is off because I was expecting some sort of odor. I left the room, waiting a minute, went back in, nothing. I lit(t)erally lol jumped up and down out of supreme happiness. 👍👍",
      "rating": 5.0,
      "verified": true,
      "author": "A. Gurkan",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Rip off. 12.99 for 15 lbs 9 months ago",
      "text": "The price has become stupid. 3 - 5 lb bags WERE 12.99. I like the litter, but tired of Amazon letting con artists sell on here.",
      "rating": 1.0,
      "verified": true,
      "author": "Jan B",
      "helpful_votes": 5,
      "publication_date": 20190904
    },
    {
      "title": "Superior clumping but tracks everywhere",
      "text": "Overall this litter is pretty good, it definitely clumps like concrete and is odor neutral for a time, but after a week or so, even with constant and regular cleaning, it doesn't do much to contain odor. It is very lightweight, which is a plus, but for me, the biggest downside is that it tracks everywhere, much like sand would, and that is very inconvenient and messy.",
      "rating": 3.0,
      "verified": true,
      "author": "NMH",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Five stars",
      "text": "I have used so many different clumping cat litters and Garfield, by far, it’s the best. The scent isn’t so great, but I don’t really smell it after pouring it into the litter boxes. This litter has great odor control, clumps quickly, has no dust, and lasts longer than any other cat litter I have used. I no longer have to deal with litter cementing to the bottom of litter boxes. The only con, is that, for some reason pieces of feces break off and scatter though out the litter, but thankfully the litter has awesome odor control.",
      "rating": 5.0,
      "verified": true,
      "author": "R.L. Mills",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Best litter I’ve tried",
      "text": "My Cat Sitter recommended this litter to me, and I’m so glad she did! Of all the cat litters I’ve tried over the years this is by far the best. It doesn’t stick to the litter box, it’s easy to scoop and there’s no odor. My cat sitter recommended this litter to me, and I’m so glad she did! Of all the cat litters I’ve tried over the years this is by far the best. It doesn’t stick to the litter box, it’s easy to scoop and there’s no odor. Very happy with it and highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "alyaug",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "What a mess",
      "text": "*This is the same product as Sustainably Yours, for anyone considering trying that one as well. Google the manufacturer, Sustainably Yours was a rebrand of Garfield.* This tracks absolutely everywhere and still sticks to kitty paws throughout the day, like sand. It does not contain order at all. It creates clumps around urine very well, but feces are another story. It breaks apart and you can never really get it clean so it starts to reek very quickly. The tracking is the worst part - it was absolutely everywhere throughout the whole house, even with vacuuming every morning.",
      "rating": 1.0,
      "verified": true,
      "author": "Karina",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Best litter hands down. Amazing clumping.",
      "text": "The best cat litter hands down. Scoops consistently the best and leaves barely any residue on sides of litter box if maintained rigorously. Covers smell well and no extra scent. It’s well worth the price, the 14 lb bag last a while due to its extremely effective clumping ability. I appreciate its bio degradable. Does track a lot due it being so tiny. However with enough litter mats around the box, it works out well. I really hope it’s not discontinued any time soon. I had trouble ordering it the last few months until I realized its on amazon. I hope I can continue using this great litter.",
      "rating": 5.0,
      "verified": true,
      "author": "Manuel Osorio",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Great flushable litter for toilet training kits",
      "text": "Discovered this litter when searching for one that is flushable to use for toilet training our cats. I haven't used it in a litter box so I can't review it for that purpose, but If you are looking for a toilet training litter i would recommend this one. It doesn't have a stinky litter smell. I like the way it absorbs the urine. I would recommend this multicat one over the purple bag for litter training purposes. They were out of stock of the green bag so had to go with the other and the grains just don't absorb as well. So if you need a flushable litter for toilet training, Garfield multicat is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "bluemonkey",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Zero Stars",
      "text": "if I could give this product zero stars I would. It smells terrible. Tracks all over the house. Big clumps.I hot rid of it 2 days after acing it in my litter box. Wastevof time & money. Cat pee in huge chunks taking half the litter with it. Very disappointed 😞",
      "rating": 1.0,
      "verified": true,
      "author": "Jacqueline L",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Love it, love it!  Clean and convenient, dust free, fast clumping, unscented",
      "text": "Hands down the absolute best litter I have ever used. I have had cats for at least 30 years. This is light, non smelling, clean clumping, easiest using litter. I have never had any problems or issues with this litter or the company. Love it beyond belief! When the production ran low, I couldn’t find anything to replace it. Amazon still hasn’t started back carrying the tiny grains except for the gougers. It costs 15.95 on Chewy, but you have to pay shipping. Why are these sellers charging 38.95 for a 10lb bag on Amazon?",
      "rating": 5.0,
      "verified": true,
      "author": "pianobiz",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Smells gross.",
      "text": "This did nothing for order control (I think it made my litter box smell worse) .",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20190830
    },
    {
      "title": "The Best Litter I've Ever Used",
      "text": "My GF once bought some other kind of litter by the same company and I was floored by how much better and easier to scoop it was. We did some research and found that this was the comparable litter and it appears to be pretty much the same. The price appears a little high, but this litter will last way longer and the ease of use is a wonder. I've been searching for better bulk options to lower the price but haven't had any luck so far.",
      "rating": 5.0,
      "verified": true,
      "author": "mark",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great, soft texture, no odor, easy to scoop, very lightweight",
      "text": "Me and my beloved cat, love this litter. Its lightweight, lasts full 30 days most of the time unless we have an unusual month of activity in the box. Scoops out solid within minutes. Doesn't mask the #2 odor, but I scoop as soon as its deposited. It does track because its light weight, but get a mat that collects the litter in the fibers and just shake out as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "AngieM",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Litter Review",
      "text": "It was scentless and did clump nicely, but it stuck to my cat’s paws as soon as he stepped into it (before he even used the restroom), and It trailed outside the litter box where ever he walked. This litter was a bit too messy for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Madelena",
      "helpful_votes": 3,
      "publication_date": 20200113
    },
    {
      "title": "It gets everywhere!",
      "text": "It gets everywhere! I put it in the litter boxes yesterday and my house is covered in sand! The cats have tracked it everywhere. We have hard wood floors and it is so slippery. I did not recommend this litter unless you want to pretend you brought the beach home with you.",
      "rating": 1.0,
      "verified": true,
      "author": "albert penkalski",
      "helpful_votes": 3,
      "publication_date": 20191128
    },
    {
      "title": "Flushable cat litter",
      "text": "I like this litter. Absolutely no odor, and if some goes into my septic toilet with doo doo, I know its ok. My cat likes it too. I understand its a cornmeal product? Interesting. I always buy multiples. Don't buy the 4 pack as its more money than 4 individual ones of the same size.",
      "rating": 5.0,
      "verified": true,
      "author": "Deirdre C.",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Flushable, clumps, no added scent",
      "text": "We got this because we had a cat we were toilet training. It is flushable. It worked fine but cat didnt progress. Then we used it when one of our cats was straining so we could see if there was blood on urine. There was.. so its light colored and worked well for that. It clumps into med hard clumps. Doesn't seem to have added scent. med. Odor suppression. But smells kinda like corn not urine.. scoops fine. Not dusty. Now we keep on hand in case we suspect cystitis again.",
      "rating": 5.0,
      "verified": true,
      "author": "sdrockgirl8999999999999",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Love it for litter maid",
      "text": "I was looking for something that would work well with the litter maid. I’ve tried the worlds best and god I hated it. Of course tried normal clay litter but the problem with litter maid is pee gets stuck at the bottom not clumped just mushy mess. I have a cat with a huge bladder. So when he pees he pees. This stuff clumps instantly. Love it. I wish there was bigger bags tho. Still trying to learn how much I need per payday.",
      "rating": 5.0,
      "verified": true,
      "author": "Aneres",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Not good",
      "text": "I got recommended on litter robot group on fb to try this litter because what I heard is hard clumps, contains smell good and less dust. Once i got this omg the tracking is EVERYWHERE. It’s like sand from the beach from all over the floor and on my bed. After 3 days I noticed the smell which it claimed to be good odor control. This would be my first and last purchase from these type of litter",
      "rating": 2.0,
      "verified": true,
      "author": "Ky Luong",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great litter, but way too $$$$",
      "text": "Great litter, way too expensive! It's light- made if corn. And sone other plant fiber. Fne granules, so easy to scoop, non scented ( most cats prefer non- scented litter), but the price has gotten outrageous. With 4 indoor cats and 2 litter pans, I can no longer afford this product. And it's only available through Amazon or Chewy.com, so I look ve it, but I'm leaving it.",
      "rating": 3.0,
      "verified": true,
      "author": "Linda K",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Broken Bag",
      "text": "The product was fine. We had previously purchased a bag and thought the litter was good enough to set up an auto ship of the product. Our problem was that the bag we received had obviously been dropped before it was shipped to us as it was split open and the contents had been swept up and put inside a large plastic bag. We only received half of the contents.",
      "rating": 4.0,
      "verified": true,
      "author": "Warm Friends",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Awesome litter",
      "text": "Little over a week now, I love this stuff, got this instead sustainbly yours for few bucks cheaper.. great odor control and clumpings way much better than world's best cat litter. but one of my cats seems to have the allergic reaction, I'm switching back to wbc litter to see if her sneezing stops. If this is the culprit, I'll be disappointed to discontinue using it. I was really excited that I've found my holy grail litter.",
      "rating": 4.0,
      "verified": true,
      "author": "kimmay",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great product",
      "text": "I've always purchased flush-able kitty litter but I like this because of the color. It doesn't leave a gray \"ring around the toilet\" like the clay Cat's Pride and others do. I also like the color (yellow) because I can see it on my hardwood floors as far as the cat tracking it. I gave it 5 Stars for scent - there is no scent and I didn't want a scent. I only gave it 4 Stars for Value because it is more expensive than the ones clay litters.",
      "rating": 5.0,
      "verified": true,
      "author": "kathytn",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Great litter but not  most effective",
      "text": "This is a fantastic litter! It clumps immediately and is so easy to clean. But one bag is really not enough to fill box. After about a week it has a strange (but not strong) smell to it so it's not one of those litters you can scoop and refill several times before emptying the box. It is too expensive for the size of the bag. If it ever becomes a little more cost effective I will switch back to it but I can not spend 90 bucks a month on cat litter sadly because this stuff does work very well.",
      "rating": 4.0,
      "verified": true,
      "author": "deanna hodgdon",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Tracks everywhere, odor control is iffy, sticks to the pan",
      "text": "We got this letter thinking we’d try something other than World’s Best. I feel like this was a mistake. The litter definitely clumps like a rock, but it will stick to the litter pan if you don’t get to it soon enough. The odor control is great for urine, but horrible for feces. We only have one cat and the litter is being tracked everywhere. We even have a mat to catch loose litter when the cat comes out of the bin, but it is still getting everywhere. There is very little dust, but the negative aspects of this litter are enough for me to not buy this again.",
      "rating": 2.0,
      "verified": true,
      "author": "flashtwenty",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Best Cat Litter",
      "text": "Best cat litter! All around perfect. I saw a review that it caused pipe damage. No one in their right mind should flush any cat litter and animal feces in the same toilet humans use. That is very disturbing. I scoop it in a bag and toss in the trash can outside. As it should be done. I recommend this because the odor fighting action. It clumps really well, which is a plus!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Excellent product!",
      "text": "This stuff clumps so much better than the other big brands! There is less waste, but the odor fighting isn’t quite as good as other brands. I add a little Arm and Hammer Litter Deoderizer, and all is good! I have used both types, the green bag and purple bag and both clump amazingly well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hudson",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "😳🤯😤 Cat ends up EATING this litter / sand  !!!",
      "text": "The worst litter ever! WHY??? It's like sand inside the house! Did u find easy cleaning towels and room after the beach??? !!! More important !!! ✖️ sticks to the paws, ✖️ sticks to the nose !!!! ✖️ Sticks around cat's fur. 😳🤯😤 WHEN CAT CLEANS its fur & nose -> ends up EATING this litter !!! And hard to vacuum, well - like sand, you know.",
      "rating": 1.0,
      "verified": true,
      "author": "Anhelina & 😺Masya ",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Impressed, I used it in a Litter Robot",
      "text": "I just opened the box and filled my litter robot, and my cats went right in and loved it. Easy on their paws compared to my other litter I guess. It clumped FAST and extremely hard. I put it in the toilet and waited for a little while and it dissolved like a charm and flushed it. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "K433Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Heaven s(c)ent!",
      "text": "Best cat litter ever. We have 5 cats and we just switched all of their boxes over. No dust, no smell, no problem. Lightweight, clumps immediately into unbreakable clumps. The oy complaint is that they need larger box sizes available, especially in the multicat formula. The fine-grained are the best, IMO. It's soft in kitty's paws and not a single cat had an issue with the switch.",
      "rating": 5.0,
      "verified": true,
      "author": "coypup",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Total Game Changer",
      "text": "Really like this litter! Very hard clumping litter. Doesn’t have that “litter” smell... No smell whatsoever. No dust. No waste. No mess! VERY easy to clean. We scoop it once or twice a day. No sticky mess or residue at all. It’s incredible. It truly is a game changer. Will go to subscribe and save now.",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Love this stuff",
      "text": "Wow this stuff clumps super hard and does not break apart! Only thing I don't like about it is it sticks to cat's paws and gets on the floor. The smell isn't wonderful but it works so well at clumping that I can put up with the scent. And I never have to scrape stuck-on litter out of the corners of the box",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Duck",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "this is the BEST",
      "text": "Ive been using so many different cat litter and this is the BEST ever! love this product, best long and my fur babies loves it. oder is week, if you are not home long time, maybe you are not like it about the smell however, my cat loves it and last long and crumble is rock hard and fast dry!",
      "rating": 5.0,
      "verified": true,
      "author": "lolo",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Nothing clumps better!",
      "text": "I’ve tried every litter out there. I recently discovered this. I can honestly say I’ve never had a better clumping litter. It clumps instantly and very hard, and does not break apart at all when you scoop. It definitely tracks though, and quite a bit. I think it’s worth it however. Zero odors in the litter box. No waste!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Awesome!",
      "text": "Best cat litter ever. It sticks to the urine but doesn't use tons. Super easy to scoop. It's in my bathroom and my car Francesca throws litter everywhere then my kid takes a shower and gets water on the litter on the floor. Other brands would get cement like spots on the floor and it would take forever to get off the floor. This stuff cleans up really well. Car litter never smells.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanine  Ickes callahan",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "BEST",
      "text": "Ive been using so many different cat litter and this is the BEST ever! love this product, best long and my fur babies loves it. oder is week, if you are not home long time, maybe you are not like it about the smell however, my cat loves it and last long and crumble is rock hard and fast dry!",
      "rating": 5.0,
      "verified": true,
      "author": "lolo",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "No cat pee smells! Amazing!",
      "text": "I'm not a cat person so I'm learning as I go with my adult cat. We use tidy cat but the urine smell is potent and it doesn't clump so the smell doesn't go when I clean the box. This stuff is great. It totally clumps and the urine smell is non-existent. I add it on top of the tidy cat and my cat is fine with it. Really great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Larken of the Swamp",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Very impressed. Clumps and less odor then Worlds Best Cat Litter",
      "text": "litter clumps extremely well but the clumps are hard. requires long soak in toilet before flushing. the litter box is much less smelly with this litter. highly recommended 10/10 more expensive than worlds best cat litter but will last longer per pound",
      "rating": 5.0,
      "verified": true,
      "author": "getsomesleep",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Tiny is better!",
      "text": "Prefer the tiny grain but it is always sold out. The small always bounces everywhere and makes a mess. My cats are now starting to avoid the littler box. Please bring tiny grain back! I need it in my subscription!!",
      "rating": 1.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Ill use the last 2 bags that i have but won't buy it ever again due to the lack of odor control.",
      "text": "Has absolutely no odor control.! I do love that its flushable and wasy to clean however...the lack of odor control will lead me back to the cystals that i use to buy.",
      "rating": 3.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Great clumping, terrible tracking.",
      "text": "Great clumping quality, in fact probably the best clumping litter I’ve ever seen. But it TRACKS SO BAD. There was litter all over the house. The clean up was murder. Had to give it up and switch brands.",
      "rating": 2.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "As described",
      "text": "If you have the litter box close to a toilet this is perfect. We are able to scoop directly into the toilet and dispose of the waste. No matter the waste it easily clumps and scoops out. The only negative is it doesn't scoop itself. Best practice is to add a small amount every couple of days and the litterbox will stay smelling fresh. Typically a bag will last about 3-4 weeks if properly maintained.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis & Claire T",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Amazing Performance...But Smelly!!",
      "text": "I really wanted to like this. As a matter of fact performance wise this Litter is outstanding. However it has no odor control at all. It clumps like nothing else. It doesn’t stick to the litter pan and it tracks very little. For me though...I can’t have my house smelling like a diaper pail. I have 2 dogs and two cats and everyone who comes over says they can’t believe that they can’t smell pets. Do this litter is a no for me. Unless, it was used for an outdoor catio",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "DUST FREE! CLUMPS GREAT!",
      "text": "This cat litter is dust free and the best price for dust free litter. Clumps great! The only issue is that my cat likes to kick and so the litter gets a little messy. I keep a stick vac for the litter that she kicks around the box. However, the price is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Corleykelly",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "More litters on the floor than any product I ever used.",
      "text": "Dusty small speckles of litter all over the floor immediately after I poured into the litter container, I had to poured them all back to its original bag...",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 3,
      "publication_date": 20190611
    },
    {
      "title": "Tight clumps",
      "text": "Forms tight clumps quickly. Great for multiple cats. This is probably the best litter we have used. I only wish it were more affordable. Tiny grains are very sand-like and make the surrounding floor slippery if you have a kitty who likes to dig vigorously. Use a litter mat or be extra cautious when approaching the box.",
      "rating": 5.0,
      "verified": true,
      "author": "A. B.",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Best but most expensive cat litter i have ever tried.",
      "text": "I have tried a lot of different cat litter products but this one is the best so far and this is why: 1. The only completely and truly dust-free litter. 2. All natural. 3. Finest particles i have seen. 4. Strongest clumping i have seen. 5. Lightweight. The only drawback that it's the most expensive per pound.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Best ever!",
      "text": "BEST cat litter I have ever used! I am toilet training a kitten and it works well in the toilet too - but for clumping in a box - it is truly the best! Very easy clean up - doesn’t stick to the pan - and my kitten loves the feel of it. I will only use this from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "contactcj",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "The best cat litter ever",
      "text": "To me this is hands down the best catlitter so far(been using it for a month), and I have tried them all. Even after 2 weeks you still do not smell any odor period, and with almost all other cat litter at some point I had to start using cat deodorizer, but not with this cat litter. This will be my to go brand from now on. It also works great with the litter robot.",
      "rating": 5.0,
      "verified": true,
      "author": "Ocean",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Stinks!",
      "text": "This litter does not mask odor at all. I had some really tragic time cleaning the litter box. It was very repulsive and I’d rather go back to a litter that has a fresh scent. This litter is light weight and easy to clean however odor masking the most important thing for me and in that this litter fails big time.",
      "rating": 2.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Gets EVERYWHERE!",
      "text": "Not as good as the other one. Man this got ALL OVER THE PLACE. It tracked everywhere I was getting cat litter in the weirdest places that I didn’t even know my cat could go. The green bag is the best cat litter ever. I love the fine grains. This one has bigger grains and thus gets all over the place!",
      "rating": 3.0,
      "verified": true,
      "author": "Mother Of Cats",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Not good at odor control.",
      "text": "It shifts well and clumps well. It is not good at odor control and tracks a lot. Hopefully that means it comes off the paws and is safer. Expensive, though as I have to put 20 pounds in just to get a decent coverage in the extra large box.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Heeg",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Garfield delivers everything you want in a litter",
      "text": "My 3 cats and I love this litter. It clumps Rock solid very quickly making it easy to scoop. It is dust free and made from renewable resources. The odor control is excellent. It does track a bit but adding a litter mat controls that. I highly recommend this litter.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Marie",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great product for easy clean up",
      "text": "I have had a hard time trying to find a litter that doesn’t track as much and does great with clumping. This was a godsend. It’s easy to clean up. Doesn’t track as much as some of the others that I have used and does well with masking odors. And my cat loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Marie",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great litter for toilet training!!",
      "text": "We needed a litter that was safe to use around the toilet because our wee one was so toilet curious we figured it would be good odds to toilet train and ditch the litter box. We absolutely love this litter, although it took our guy a bit to adjust from using the pellets. But he did and we will hopefully be to the point of phasing out his litter pan on the toliet and he'll be fully toilet trained!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Ahrens",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Long lasting, quick clean up, economical",
      "text": "Best litter I've ever tried, last a month amd I've got 2 cats. Clumps don't disintegrate when you scoop amd it sifts like no other...very quick since its similar to sand almost. It's non scented which i like bc i dont want my cats suffering thru the toxic perfumes.. Yes people that does effect your animals! Cats enjoy using it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Ryder",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Favorite flushable cat litter",
      "text": "Love the tiny grain cat litter. Easy clean, breaks down to loo quickly and does leave tracks around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "SGW",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Best litter ever!",
      "text": "This is legit the best cat litter I have ever used. It tracks like a bugger but that is inconsequential in the grand scheme of things. My older boy is declawed :( and regular litter was getting to be too painful for his paws. Bought this and he LOVES it. I also have litter robots and this still works perfectly with them. It is expensive but absolutely worth it in my opinion and I think because of the clumping power you actually end up wasting less litter in general. I will never go back!",
      "rating": 5.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Flushable making cleanup a breeze",
      "text": "This is great to use and completely fine for the environment. But these little grains do track onto the floor more than the “tiny” grains in the green bag. Both good products though. This is flushable also which makes cleanup super easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelleyk50",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Very clean but also an expensive nuisance",
      "text": "Clumps so much that with 1 cat you will go through a bag of this every single week. $60 per month. Also the small grains stick to my cats feet and get tracked all over the wood floors and then they get stuck to MY feet. Not ordering a second bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Blake Stover",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "If your cat(s) have asthma, Garfield litter is the best!",
      "text": "I love the Garfield litter. However, what I did not like this time I paid $7.21 more per bag (4 bags). The normal price has been $14.99/bag. This time the cost was $22.20/bag. That adds up to $88.80. And that's $28.84 more for the same product (4 ten lb. bags) vs. $59.96.",
      "rating": 5.0,
      "verified": true,
      "author": "GREG W. Naples, Florida",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Try it there is nothing better",
      "text": "There is no other cat litter like Garfield, you might think it’s expensive but it is not it is the best cat litter in the world I have tried all kinds and nothing believe me nothing compares to this cat litter. The urine goes into total clump you take every bit of the urine out and one clump try it you’ll find it amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Debora Collins",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Best clumping litter EVER!",
      "text": "This is the best clumping litter I've ever found. I wish it was better at controlling odor, but I scoop multiple times a day anyway. If I don't scoop every day the urine smell gets out of hand. The flushability makes this litter ideal and my cats prefer the super fine texture.",
      "rating": 5.0,
      "verified": true,
      "author": "ARI",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Clumping was the best",
      "text": "The big drawback was gritty sand everywhere. Yes, my cats have the nerve to walk on the table! It was covered in the litter every day. Gave up. Clumping was the best though, and the color was nice and clean to look at in the box.",
      "rating": 3.0,
      "verified": true,
      "author": "Viv Miles",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "New favorite! Cassava-processed is NOT toxic",
      "text": "Most efficient clumping ever! I constantly try out new litters and this is my new favorite. Yes, cassava contains cyanogens, but it would only be an issue if your cat ate a large quantity of completely raw (unpeeled, not cooked or processed) root. Cassava flour is used to make tapioca and is great to cook with. I would argue that silica based litters would be more dangerous to ingest.",
      "rating": 5.0,
      "verified": true,
      "author": "PrettyRad",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Solved litter box issues",
      "text": "Okay so I give this a five star review because I have a very picky cat and this litter solved the issues with urinating outside of her box. I love that it’s flushable and it doesn’t really have the kitty litter scent. My only warning would be that is have a distinct smell when the cat poops. I think it has to do with what it’s made out of. Also it tracks pretty bad but I have kittens and they are a little bit on the messy side. Over all I’d recommend and the price is worth it if you have a picky kitty.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Crabb",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Love this brand!",
      "text": "I have been using this litter for almost a year and it's the best litter I have ever purchased. I love that it doesn't have a scent, is dust-free, and easy to clean. When the smaller bags were still available I was able to flush the litter down my toilet, but since the smaller bags aren't available anymore, I started buying the larger bags and have noticed the litter doesn't degrade and flush like it used to.",
      "rating": 4.0,
      "verified": true,
      "author": "Oneesama",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "try something else",
      "text": "glumps but breaks up and does not dissolve in the toilet well. It makes a mess too when kitty jumps out Advantage is it's white and if your kitty is prone to infections or other toilet issues you can see if anything is wrong.",
      "rating": 3.0,
      "verified": true,
      "author": "dawgsmum",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Best litter ever",
      "text": "This by far is the best litter I have ever used. It truly does what scoopable litter is supposed to do. Forms a solid shape as soon as the urine touches it. It does not stick to bottom. Easy and quick to scoop, no smell. No issue with unused litter being on scooper with used.",
      "rating": 5.0,
      "verified": true,
      "author": "DNA_S",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Tracks and tracks then tracks some more",
      "text": "This stuff tracks everywhere even with a paw mat outside of the box it gets everywhere! Oder control is not good at all but I’m giving it three stars because it does clump urine extremely well. I won’t be purchasing again though.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Easy to keep clean",
      "text": "I have used all kinds of litter for dozens of cats over 45 years. This litter is white, forms hard pieces in the litter box making it easy to clean, and makes the need to change litter boxes less frequent. It is the very best litter we have ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Z.",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Pee clumps don’t get broken up",
      "text": "What I love most about this litter is that the pee clumps are hard as a rock. Our new cat is an aggressive digger and absolutely destroys her pee clumps, which makes the litter box disgusting really quick. This Garfield litter is a bit expensive, hard to find and doesn’t cover doors as well as the corn cob litter I was using but it does stay cleaner way longer and makes litter box duty take much less time out of my day.",
      "rating": 5.0,
      "verified": true,
      "author": "Meow",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "OH. MY. GOSH! This stuff is amazing!!! :-O",
      "text": "this is seriously the BEST cat litter i've ever used. it has no scent, and clumps like crazy!! i end up wasting waaaaaay less than any litter i've tried before, so therefore it's a great value for the $$. AND....it's flushable!! just break up the clumps into little, little ones or dissolve them in water, then flush. this stuff is \"gold, jerry! gold!\"",
      "rating": 5.0,
      "verified": true,
      "author": "Lovely Lady",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Not my favorite. Pine is better",
      "text": "While this does clump, it let's every single smell come through. And I clean it every day.",
      "rating": 3.0,
      "verified": true,
      "author": "Cristina",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Best litter ever!",
      "text": "I love this litter. The wet clumps create a very solid clump that is easy to scoop, however it's not a good idea to flush the clumps, as this clogged my toilet when I tied, so I throw it in the garbage. My two cats used it right away with no hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonwoman",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Always get Garfield",
      "text": "I tried a cheaper brand of kitty litter and oh my I will never try another kind again no other kind can’t compare to Garfield, the other kind clumped up all right into cement I could not get it out I’ve never experienced anything like the other kitty litter it was cement",
      "rating": 5.0,
      "verified": true,
      "author": "Debora Collins",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great litter!",
      "text": "Best litter I've ever used and I've tried all kinds for over 40 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernadette",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Pass on this one.",
      "text": "I do not like this at all. I liked the idea of no dust, clay free, and flushable, but it's not worth it. It doesn't have good door control and it gets EVERYWHERE. My cat is not that messy. I have the box under the sink in the bathroom with the door removed and rarely does the little travel outside of that area (I also have a litter mat for her to step on after), but this is all over my bathroom after like 5 days.",
      "rating": 1.0,
      "verified": true,
      "author": "Allyson",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "The BEST BEST BEST cat litter!",
      "text": "This is the best, vague vanilla scent, clumps well, flushable, it's great! Its not really available right now.. Which is a huge problem. The purple bag version of this is not as good... I'm dealing with using that right now. Please make this available again!",
      "rating": 5.0,
      "verified": true,
      "author": "moongoddess",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Clean up is a BREEZE!",
      "text": "It doesn't mask smell as good as Pretty Litter but clean up is a BREEZE! I have 4 cats and one litter box (right now). It clumps everything in amazing fashion and I can put it in the toilet. Love this stuff",
      "rating": 5.0,
      "verified": true,
      "author": "Cherie",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Very impressed!",
      "text": "I am very impressed with the quality of this cat litter and the easiness to clean the litter box. My cats seems to like it, and I am glad as well, since I am the one cleaning the litter box at home, and it has been better, since I am not fighting with a puff of dust!",
      "rating": 5.0,
      "verified": true,
      "author": "KC Newton",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Flushable litter",
      "text": "So happy I found litter I can flush with septic system. I've been using it for 6 months, only complaint is there is no scent, so sometimes there is an odor.",
      "rating": 4.0,
      "verified": true,
      "author": "kll",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "best cat litter",
      "text": "the best i ever found,super easy to clean,i have 3 cats and i use 3 bags a month!! don't waste your time looking for others.",
      "rating": 5.0,
      "verified": true,
      "author": "NILZETE OLIVEIRA FINAMORE",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Like clumping my cat didn't like the feel on paws grains were hard",
      "text": "I love the fact that it actually clumped litter without sticking to pan. I dislike that my cat didn't like the feel of grain on paws I was hoping for softer and smaller grain",
      "rating": 4.0,
      "verified": true,
      "author": "jose tirado",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Defeats cat poo handily.",
      "text": "The best cat litter, hands down. Cat doodies eliminated along with their hellish scent. Flushable so no bags waiting in the garage for trash day, making us retch when we exit our cars. Even our smallest precious kitty, who suffers from Nuclear Poo Syndrome, cannot defeat these granules. Yes, I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "lg2458",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great, but cats tracked it everywhere!",
      "text": "This has some dust, so mine wasn't dust free. No big deal. Odor control was good, not perfumy. This stuff though, is the champion clumper....awesome! However, it got tracked worse than any litter I've used. So that's why I wont buy it again. I bought the tiny grains...still tracked lots eveywhere. If you have a courteous cat who wiped their feet, lol, then buy this.",
      "rating": 3.0,
      "verified": true,
      "author": "shewbox",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Best cat litter",
      "text": "Buy this- nothing else. Seriously. I love this crap. So does my cat. Once it was out of stock and bought best selling alternative. I threw out 25 pounds of cat litter when this was available again.",
      "rating": 5.0,
      "verified": true,
      "author": "Xiomara Gana",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Love",
      "text": "We’ve been using another flushable litter for years but it would have a funky scent, I’m so glad I found this one! Clumps really well and hasn’t caused any issues. Will definitely be my go to from now on",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa Colvin",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Doesn’t trap odor but the best clumping litter",
      "text": "This litter is the best clumping litter out of everything I’ve tried. My only problem is that it doesn’t trap any odor at all. Also, a bit pricey for a 10lb bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Best you can buy !",
      "text": "I'm real...real...real...old. I've had so many cats...this litter is special !! I scoop, dump scoops in toilet...rest of litter remains fresh. I'm saving money... You gotta try this stuff !! 🌷",
      "rating": 5.0,
      "verified": true,
      "author": "jill",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Does not compare to Garfield tiny grains!",
      "text": "Does NOT compare to \"tiny grains) and I will not buy again! Not odor free,does not flush as easily, and is much messier. Very disappointed that I cannot get the green sack of tiny grains!",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Perfect",
      "text": "It’s a best litter I ever tried for my cat. I bought many different kind of litters, this one works really good. Ingredients are natural, no smell",
      "rating": 5.0,
      "verified": true,
      "author": "Yana",
      "helpful_votes": 0,
      "publication_date": 20200706
    }
  ],
  "product_meta": {
    "title": "Garfield Cat Litter Ultimate Clump, All Natural, Fast Clumping, 10lb",
    "description": "Style:Multi-CatEvery cat parent knows how important it is to provide their felines with high-quality, reliable cat litter. Not only is it Key for comfortable release of urine and feces, but for keeping hygienic their homes as well. Capturing unwanted smells, creating scoopable clumps, and making it easy to handle and dispose is essential for cat owners’ day to day life, and petfive’s Garfield Cat Litter is here to help you out.Free of chemicals or fragrance, This dustless tiny grain cat litter forms strong clumps immediately, up to 3 times more efficiently than clay-based litter. Composed entirely by natural corn and Cassava, a shrub native to South America, Garfield all natural tiny grains cat litter is 100% sustainable, biodegradable, and flushable, designed to care for pets, parents, and mother nature at the same time.The white color and extra-fine texture of these cat litter grains was especially developed to care for your cat’s health. The blank look allows for easy detection of urine coloring variations, possibly due to blood presence, which sign early stages of feline health issues. The tiny grains are soft on their paws, and the corn and Cassava natural properties make it safe for cats who suffer from feline allergic bronchitis and pemphigus foliaceus, the most common feline autoimmune skin disease. This effective, hygienic, and natural product is an essential part of any caring cat owners home.",
    "rating": 4.4,
    "feature_bullets": [
      "🐱 Backed by vets - The properties of this efficient Cat litter make it safe for cats with feline allergic bronchitis and pemphigus foliaceus, the most common feline autoimmune skin disease; garfield's tiny grains is great for all kinds of felines.",
      "🐱 dust free - Garfield Cat Litter is developed with cats and parents in mind: the extra-fine grains are soft on feline’s paws, providing a comfortable feel in the litter box, and the white color makes it easy to identify urine’s change of color due to early health issues; dustless means allergy-safe for everyone.",
      "🐱 odor control - The natural, long-lasting odor elimination properties of cassava and corn instantly capture the smell from your cat’s wastes, preventing it from spreading around your home without relying on artificial fragrances.",
      "🐱 100% natural - made of cassava and corn, The white grains are all-natural and biodegradable, completely FREE of chemicals; flush it down the toilet, its sustainable raw materials have no negative impact on the environment.",
      "🐱 perfect Clumping - garfield's Bio tiny cat litter is 3 times more powerful than clay in forming fast, strong, and perfect clumps, making it easier to clean the litter box without risking stains or clump breaks; ideal for multi-cat homes."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4 x 9.45 x 12.2 inches; 10 Pounds",
      "Item model number": "90001",
      "Date First Available": "May 1, 2018",
      "Manufacturer": "GardenAngel 2072616991",
      "ASIN": "B01FGD3JDU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Litter",
      "Litter & Housebreaking",
      "Pet Supplies",
      "Cats"
    ],
    "price": 14.99
  }
}