{
  "website_summaries": [
    {
      "verdict": "A tough scrub that only suits normal skin types.",
      "pros": [
        "Facial scrub energizes skin",
        "Ground walnut shells work hard to remove dirt and dead skin cells",
        "Formula foams and glides on smoothly to effectively clear skin"
      ],
      "cons": [
        "It can feel abrasive because of the texture of the scrub",
        "Not suitable for sensitive skin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best scrub I have used!",
      "text": "Love this scrub! Use this once a week and it leave my face soft for days after use. I first got this in one of those monthly box subscriptions from a famous company and loved it so much I purchased it here. I highly recommend it- it is much better than the one you buy in the pharmacies. It may cost more, but it is worth it, the results last for days..",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Worth the money.",
      "text": "Nice amount of grit - leaves my skin feeling smooth and well-cleaned. Plus, it's small enough to take in my carry-on. And you only need a small amount so it will last a while.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ka",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Great product. This scrub has a yummy small to ...",
      "text": "Great product. This scrub has a yummy small to it and it leaves your skin feeling soft. I use twice a week to keep my skin fresh. Works well.",
      "rating": 5.0,
      "verified": true,
      "author": "jill mackowiak",
      "helpful_votes": 4,
      "publication_date": 20170302
    },
    {
      "title": "Five Stars",
      "text": "Best exfoliating face wash I've used. Worth the price, high quality. Fine for my sensitive skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen",
      "helpful_votes": 4,
      "publication_date": 20170220
    },
    {
      "title": "Perfect",
      "text": "I’ve used it twice, so far, and it leaves my skin feeling tight and refreshed. The fragrance is nice, too. Great for under $17. Not sure what more one could ask for from a facial scrub.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory John",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Great for sensitive skin",
      "text": "I have really sensitive skin and too harsh of a scrub tends to really irritate my skin. This one is perfect. It gives a great exfoliation while still being natural and doesn’t upset my skin. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Love this stuff",
      "text": "I have been using this product for a few years and daily exfoliating is important....",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Amazing face scrub",
      "text": "I love this product it helps with my oily skin and it smells amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "I wouldn’t recommend since the beads do not dissolve",
      "text": "This is really harsh and the beads do not dissolve. It helps when I need a vigorous exfoliation, but, I wouldn’t recommend since the beads do not dissolve.",
      "rating": 4.0,
      "verified": true,
      "author": "amina m warfield",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Smells fantastic",
      "text": "This scrub is gentle yet does wonders. The smell is great. Other products I’ve used don’t tend to compare. This helped a lot with sun damage and areas of melasma.",
      "rating": 5.0,
      "verified": true,
      "author": "Paris",
      "helpful_votes": 3,
      "publication_date": 20180130
    },
    {
      "title": "Gold for my skin!",
      "text": "Keeps my Complexion glowing and bright. I use this 2 to 3 times a week! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Y. Head",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Sensitive skin",
      "text": "This is the only product that my face doesn't reject.. gentle exfoliation with a fresh clean feeling!",
      "rating": 5.0,
      "verified": true,
      "author": "Lacey Dahlem",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Lovely facial scrub without being harsh.",
      "text": "Love this scrub. I will only use this brand, not too harsh or rough, just right. Pleasant smell without being too strong. I have sensitive skin and typically react to anything with a scent bur had no problems with this.",
      "rating": 5.0,
      "verified": true,
      "author": "GHC1",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Fantastic!!",
      "text": "Wow! This is the real deal! Serious exfoliation... but not drying or irritating. I use 1-2 times a week and my skin has never looked better",
      "rating": 5.0,
      "verified": true,
      "author": "KENDRA EVANS",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Finally In a Tube and Better Price",
      "text": "I love this product and using it for several years. The original glass jar was dangerous in the shower and this stuff is not cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "FL Souri",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Love this scrub",
      "text": "Where, or where, is he on QVC anymore? Love this scrub, super smell and thoroughly cleans. Use it 2-3x a wk.",
      "rating": 5.0,
      "verified": true,
      "author": "Paulette L.",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "The best facial scrub ever.  Has tons of grit.",
      "text": "Every other facial scrub I have found pales in comparison to Ole's walnut scrub. Sure it's pricey, but you're paying for something that actually has a LOT of grit rather than a tiny amount of grit mixed in with mostly cleanser. I use this sparingly because a little goes a long way. I've tried to buy cheaper alternatives, but I always come back to this one.",
      "rating": 5.0,
      "verified": false,
      "author": "Sherry S.",
      "helpful_votes": 7,
      "publication_date": 20170625
    },
    {
      "title": "Works great! Leaves face feeling refreshed and hydrated",
      "text": "Love the way it makes my face feel! Smells great too! Just the right amount of exfoliant without the harshness.",
      "rating": 5.0,
      "verified": false,
      "author": "Sherri Z",
      "helpful_votes": 0,
      "publication_date": 20181031
    }
  ],
  "product_meta": {
    "title": "Ole Henriksen Walnut Complexion Scrub, 3 Fluid Ounce",
    "description": "Every so often, your complexion needs a little extra attention to enhance the skin’s natural renewal cycle. Nothing does this better than a densely textured, smooth gliding and terrifically energizing facial scrub. Activated with water, the finely ground walnut powder foams up and slips over the skin effortlessly to awaken beautiful glowing skin. BENEFITS Aloe Vera: Moisturizes, calms and heals Chamomile: Calms, softens and soothes Korean Ginseng: Increases cellular energy, stimulates microcirculation Walnut Powder: Mildly abrasive, aids in cell renewal",
    "rating": 4.6,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6.42 x 1.61 x 1.61 inches; 4.23 Ounces",
      "Item model number": "SG_B01FJBBIVO_US",
      "UPC": "687795397012",
      "ASIN": "B01FJBBIVO",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Polishes & Scrubs",
      "Skin Care",
      "Scrubs",
      "Face",
      "Beauty & Personal Care"
    ],
    "price": 49.99
  }
}