{
  "website_summaries": [
    {
      "verdict": "A little on the expensive side, but we highly recommend this tray table to those who need to retrofit their existing furniture for elderly or mobility-challenged users. Assembly may be challenging, however.",
      "pros": [
        "30-pound capacity for tray, 250 pounds for handle",
        "Numerous height adjustments possible",
        "360-degree swivel",
        "Support handle improves mobility",
        "Bamboo tray table easy to maintain",
        "Fits securely under most furniture"
      ],
      "cons": [
        "Can be difficult to rotate, not completely level",
        "Assembly is challenging",
        "Not designed for temporary or freestanding use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Table top is slanted",
      "text": "The table is well made and sturdy. Durable and holds a male adult putting all his weight on it to stand up utilizing the \"handle\" The only problem is the table is not level, its slanted towards the chair when its positioned over your lap. It's quite awkward and hard to use. While eating or typing you just want to twist it to be level. Not sure I would purchase again due to this slant, it definitely throws the whole thing off, other then that it would be great.",
      "rating": 3.0,
      "verified": true,
      "author": "Susan W.",
      "helpful_votes": 12,
      "publication_date": 20180429
    },
    {
      "title": "A very worthwhile purchase.",
      "text": "Very sturdy and has helped my husband tremendously. Added the cup holder and the tray is a great place for his beverage and reading material as he stretches out his bad hip after a long day of work. Some reviews complained that the tray wasn't level, but they must have missed the part in the instructions that indicates the easy steps for leveling the tray top. Ours also swings fairly easily, but not too easily. A very worthwhile purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Old McMalmberg",
      "helpful_votes": 6,
      "publication_date": 20180629
    },
    {
      "title": "Good product, but do your homework b4 ordering.",
      "text": "Made well. Good raw materials. Good welds. Good paint. End of good. Designer needs to do more research on potential uses and fits. Product description states it works on LIFT chairs. More research needed before making an \"All inclusive\" statement. Better to say \"SOME LIFT CHAIRS-you must check dimensions before ordering\" I had to build a significant floor framework assembly to shift vertical post far enough to the right to clear chair armrest during the \"lift\" cycle. And now 2.5 months later table top is splitting on lamination joints. I will need to eventially recover it with a covering and I'll choose something less slippery.",
      "rating": 2.0,
      "verified": true,
      "author": "PVFMN",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Terrific product!",
      "text": "This took a whopping 10 minutes to put together. (The hardest part was lifting the sofa to secure it under the legs.) The instructions are clearly written in English, with good illustrations. It's sturdy and stable, and works just as described. We are delighted! Please note: the organizer accessory is problematic. At one of the height adjustments of this product, the organizer covers the height adjustment button, making it very difficult to access. The cup holder and side tray are just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Northwesterner",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Near Perfect. Best I’ve ever used!",
      "text": "I’ve tried a few such stands designed for using a laptop while sitting in a comfortable chair or sofa, and this one is by far my favorite. Because of its unique design, the table can sit lower to your lap, making it much more comfortable to use. And if you prefer it to be higher, it’s easy to change. One recommendation I’d make is to be able to tilt the table for even greater comfort. Though I did find a way around that issue by purchasing a very nice adjustable laptop stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Eubanks",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Don’t buy! Not strong/waste of money!",
      "text": "If I could say 0 stars I would. It has no capacity for the things you need to eat a meal or keep at bedside when sick. This is obviously supposed to provide items to people who aren’t able to get up over and over to get them. It has fallen over on my lap every time we have tried it so I’m officially done.",
      "rating": 1.0,
      "verified": true,
      "author": "LAdybug",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Difficult to rotate the table.",
      "text": "As others have said, it is very sturdy. However, the force required to rotate the table is a lot more than it should be. I'm 225 Pound weight lifter and it's very difficult to rotate the table from the sitting position. very annoying and unnecessary. It is not that it takes a tremendous amount of force. It's just very uncomfortable. I hope this makes sense to the readers. It is also a little wobbly. I'm returning this as it's just not worth the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Rick U",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Great for keyboard and mouse.",
      "text": "The arm that holds the table will swing the table in front of you. You can then rotate the table itself to adjust for comfort. I use this for a keyboard and mouse. This is working out great for me. I use it with a recliner. It is placed so that the upright bar is not in front of but to the side of the chair so that the chair can recline.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Wonderful idea but could be improved",
      "text": "Great for my elderly mother who eats most meals in her recliner now. My only problem is that the two brackets of the base that fit under the chair only slide together so far. To fit her size recliner, they needed to adjust a few more inches for a better fit. The base tends to slide out from under the legs of the recliner having to be reset frequently.",
      "rating": 4.0,
      "verified": true,
      "author": "celeste hankins",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Swivel ability keeps all these she needs close",
      "text": "-We looked for a table high enough - mom is tall -a swivel table that she can move away and not feel stuffy, and not in the way when she is moving around and getting up, able to push away easy. -a stationary table This table provides all this! Tricky to line up under couch by oneself. A plus is it tucks up next to my mom like a side table for her items.",
      "rating": 5.0,
      "verified": true,
      "author": "Anibal Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great  table for working chairside",
      "text": "This is a sturdy table. I like that it's adjustable height-wise. It was kind of time consuming on the assembly. Easier if you have two people. My only problem is it doesn't slide under my recliner the way I hoped it would.",
      "rating": 4.0,
      "verified": true,
      "author": "MellyB",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Wobbly",
      "text": "This product is pretty wobbly. I like that it swivels but if the user really needs to use to for support to help stand then that will be a problem. Also, the tray really isn't very big",
      "rating": 2.0,
      "verified": true,
      "author": "Blake Franklin",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "I should have returned this item. It doesn't fit ...",
      "text": "I should have returned this item. It doesn't fit mom's Niagara Lift Chair and it's wobbles. If your planning to purchase this beware it doesn't adjust as it appears.",
      "rating": 1.0,
      "verified": true,
      "author": "Big KZ",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Table and stand assist.",
      "text": "This is an awesome table . The best part is the handle for help hubby needed to get out of his chair. The span was almost to far apart but we have each foot on half an inch of the stand. It's working great for now.",
      "rating": 5.0,
      "verified": true,
      "author": "Jere Andrus Thompson",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Best laptop stand, ever!",
      "text": "I have owned and used this tray as a laptop stand for nearly a year and I absolutely love it! Still just as sturdy as day one and very easy to operate. Smooth swivel. I use this nearly every day and highly recommend for anyone looking for a stationary laptop stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Loar",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Great little table",
      "text": "This table has been so helpful by my disabled husband's chair. Its the perfect size for him to use while eating or reading. My only complaint is that I wish the table folded down by his chair when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "holds up well my only issue is it leans alittle downward if they could figure out that issue it would be perfect.",
      "text": "Still use this everyyyyyyyy day and its a god send.... holds up well my only issue is it leans alittle downward if they could figure out that issue it would be perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Mchel1522",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "We like the quality of this item but when we removed ...",
      "text": "We like the quality of this item but when we removed the plastic wrap from the table top the smell of some type of chemical was over whelming. We had to put it out on our deck. Hoping a few days outside will take care of the odor.",
      "rating": 4.0,
      "verified": true,
      "author": "Marlene Kornmann",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "It works great",
      "text": "Got this for my 94 year old father. It is very sturdy and works great. He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Very nice",
      "text": "Very nice product. Installs easily. My 95-year old dad likes it, since he can eat at the table and work on his stamp collection. The handle is really too high for him to use and I have it on the lowest setting. Guess my sofa is too low to the ground. But it's ideal for the elderly.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Works for me",
      "text": "Very sturdy. It does the job. I have it with a lift chair. I can't lift the chair all the way up or the arm would hit it. But it goes far enough.",
      "rating": 5.0,
      "verified": true,
      "author": "weedshasta",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Great for unsteadiness, not for those with major disabilities.",
      "text": "Heavy, sturdy,looks good. Not so good for my husband who is parallized on one side.",
      "rating": 5.0,
      "verified": true,
      "author": "cheri ann hingtgen",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Great Product",
      "text": "Bought this for my elderly mother who spends a lot of time on the couch. This enables her to do her wordsearches, eat snacks and still get up easily when she needs to. It's a very sturdy and handy little table.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "... day for over 14 months it has held up great and is still is tight and secure",
      "text": "I have used this table every day for over 14 months it has held up great and is still is tight and secure. I love it and now cannot do without it",
      "rating": 5.0,
      "verified": true,
      "author": "eramir",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Works great",
      "text": "Good quality...works well...my chair is a theatre recliner and I had to put some blocks under it",
      "rating": 5.0,
      "verified": true,
      "author": "Joe in Georgia",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "very pleased",
      "text": "put this guy together and took it to The Grandmother, see likes it very much",
      "rating": 5.0,
      "verified": true,
      "author": "john lawter",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Great TV Tray for the Elderly",
      "text": "Fantastic for our 93 & 95 year old parents who still live at home relatively independently. An item to be put on the inheritance list. Brought 1 for a test drive, so good we brought another.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170327
    },
    {
      "title": "Box is heavy",
      "text": "Solid and stable .. hard to attach remote attachment but otherwise easy assembly and a great help for my 87 yr old mother",
      "rating": 5.0,
      "verified": true,
      "author": "pdeluca",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Works fantastic",
      "text": "This is just what my Dad needs. However one of the screws is damaged. It’s not a huge deal because a the first one works. But since my 90 yr old dad issues this I want it as strong as possible. Also it’s a bit tricky with a chair that lifts.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Wooden Desktop breaks off easily. Functionality otherwise is great.",
      "text": "The functionality of this item is great. The day I built the item, the wood desk top broke off the rotation base and due to design, could not be screwed back on. With the item already built, I had to figure out an alternate way to reattach the desktop.",
      "rating": 3.0,
      "verified": true,
      "author": "Trisha",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Works great - she is still using it 3 mos post ...",
      "text": "Bought it for parent recovering from hip replacement. Works great - she is still using it 3 mos post surgery!",
      "rating": 5.0,
      "verified": true,
      "author": "JClark",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Five Stars",
      "text": "Perfect solution for my husband's needs, well made, sturdy, lift assist handle is a good option",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Very sturdy and versatile",
      "text": "I liked the strength and the adjustments that can be moved and placed in any situation you might come across. Very nice. Had to wait for it but arrived on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Tenderfeet ",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Will not work with couch or love seat without modification.",
      "text": "Small modifications to make it work with a large leather couch. It works great otherwise. It is definitely designed for a heavy 4 legged lounge chair.",
      "rating": 5.0,
      "verified": true,
      "author": "LARRY E. TAYLOR",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Five Stars",
      "text": "moms been using it every day for meals need more table leveling options",
      "rating": 5.0,
      "verified": true,
      "author": "hiho",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Sturdy table support!",
      "text": "The weight and quality is exactly what I hoped for, to serve my family. It fits on the recliner perfectly and is useful for iPad and for journaling.",
      "rating": 5.0,
      "verified": true,
      "author": "Cerena",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Exactly what i was looking for",
      "text": "I'm not disabled just looking for a Laptop table that fits under a chair or couch. This is what i was looking for and very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "David J Cullison",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Sturdy, handy and looks good too",
      "text": "I bought it as a Christmas gift for my mother, she had me set it next to her bed and she loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "oxfordlab",
      "helpful_votes": 2,
      "publication_date": 20170330
    },
    {
      "title": "Perfect",
      "text": "Bought for my 97 year old mom. She uses it every day. Absolutely loves it! Have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilou Rao",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great table",
      "text": "This product is exactly what we were looking for, a sturdy table for my mother in law to use in her chair which could be moved out of the way for easy access.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Tray swing arm so stiff we could barely move it",
      "text": "Well made and sturdy, but the swing arm was so stiff and difficult to move that my elderly mother could not use it. Returned with no difficulty.",
      "rating": 3.0,
      "verified": true,
      "author": "anne m delarosa",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Great for elderly",
      "text": "This works great for my grandmother. Perfect for eating, totally accessible for elderly, love this!",
      "rating": 5.0,
      "verified": true,
      "author": "Carissa",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "They all love them.",
      "text": "Have purchased three of these for the seniors in my life. They all love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170809
    },
    {
      "title": "3 out of 4 screws have lifted",
      "text": "I need help. 3 out of 4 screws have lifted and this unit needs replacement or a replacement part needs to come this way. 11/20/2018. The boxes are long gone.",
      "rating": 2.0,
      "verified": true,
      "author": "D.S. or G.P. McKenzie",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great help!",
      "text": "Worked well with the lift chair and helped my Dad a lot when standing",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Table Problem",
      "text": "Table ONLY tips sideways not toward you. Not a useful feature if you want to see your keyboard!",
      "rating": 4.0,
      "verified": true,
      "author": "David Ludden",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Bad design",
      "text": "Bottom wont close enough needs to be able to slide together closeronly able to put under 1 leg of chair very wobbly unsafe",
      "rating": 1.0,
      "verified": true,
      "author": "Dale B.",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Great product",
      "text": "Perfect for the couch and holds 3+ beverages and plates. Easy to assemble, easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Andary",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Absolutely Perfect!",
      "text": "My husband had a stroke a year ago and I only wish I had found this table sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Couch table",
      "text": "Table is sturdy for work and dining. Use it everyday and lovin it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Martinez",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Excellent product!",
      "text": "Great for helping me get into or out of my recliner.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Donohue",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Works great Easy to install",
      "text": "The Omni Tray Table -Swivel Bamboo TV Tray Table. , Works great Easy to install, 1 Problem it could have more Adjustment On Table Hight .",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Love the table very sturdy",
      "text": "Love the table very sturdy, well designed, missing one of the set screws and need to replace set screw? Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Frederick Kovar",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Table works great!",
      "text": "One bolt was stripped. Replaced bolt and everything worked as expected!",
      "rating": 5.0,
      "verified": true,
      "author": "danny freeman",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Very Disappointed",
      "text": "I am very disappointed. It is not what it shows on the page. It is wobbly and even dangerous. I hired an outsider and paid him to come and see if it can be fixed and they couldn't do anything. I purchase this item on the promises they make which could be useful. But not satisfied at all. I tried to contact the vendor for the return slip and refund and so far no luck.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20160909
    },
    {
      "title": "WOBBLY",
      "text": "Can't tighten this thing so the table does not wobble.. very frustrating",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170403
    },
    {
      "title": "Works great. But it was not designed for my recliner",
      "text": "Quality product. Works great. But it was not designed for my recliner. So it's not as stable as I hoped.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul  A. Holtel",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "... looks solid and I think it would have been perfect. The only problem is the base pads",
      "text": "It looks solid and I think it would have been perfect. The only problem is the base pads, were just a hair too far apart , so that the chair legs wouldn't line up with the chair available. Would recommend if you were certain the legs aligned.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170104
    },
    {
      "title": "Perfect purchase",
      "text": "Excellent table! It's very solid and stable. I did a lot of research to find a tray that could be used with my mom's recliner and this ended up being the perfect tray! It was very easy to put together and the swivel action of the tray is easy and smooth for my 90 year old mother to use. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Wrangler",
      "helpful_votes": 10,
      "publication_date": 20170127
    },
    {
      "title": "Perfect recliner table",
      "text": "I got this table for my mom to use as a laptop table in her recliner. She absolutely loves it. It is adjustable enough to fit her perfectly and now she uses it for everything while she’s in her chair. My only concern is that the assembly under the table top hangs pretty low and has square edges that might cause scrapes or bruises on older legs. If you’re worried about this, it could easily be solved with some foam insulation or rubber bumper of sorts. All in all, very sturdy and aesthetically pleasing piece of furniture that helps improve quality of life big time!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany C.",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great table once we had a part replaced",
      "text": "When our table arrived the swivel arm was not stiff but absolutely frozen: neither my husband nor I (both reasonable strong adults) could budge it. We called the customer service number included in the packaging and without requiring us to return the bad part they promptly sent out a replacement which works fine. The table itself is terrific -- exactly what we wanted for my husband post-surgery. It would definitely have rated five stars plus if we hadn't had to replace the one part.",
      "rating": 4.0,
      "verified": true,
      "author": "ect",
      "helpful_votes": 4,
      "publication_date": 20170623
    },
    {
      "title": "Pefect with recliner sofa",
      "text": "I am not elderly, but I needed a space saving desk for my laptop. This table works perfectly for me. I use it under a recliner loveseat, and it works perfectly. (Yes, I can still recline and relax with my laptop hovering perfectly above my legs.) The swivel arm is a little more stiff than I had expected, but I think this is more of a pro than a con.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 5,
      "publication_date": 20180419
    },
    {
      "title": "Piece of junk.!!",
      "text": "Definitely not worth the price they are asking. I can build one using home depot parts for way cheaper, and make it a lot more stable. Do not purchase, I hate that I wasted money on this junk! The top is hard to turn, it puts a lot of pressure on the mast which is made of thin metal...Also the base is not correct, does not adjust to any chair or sofa. waste of money plain and simple. Read other reviews I am not the only one saying how thin the metal and unstable this junk is. Frustrated does not begin to describe the level of emotion. I will build one and post the pic.",
      "rating": 1.0,
      "verified": true,
      "author": "Just my opinion",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "laptop Swivel table.",
      "text": "After using a TV tray for 20 years my husband asked if there was a tray or small table top that would be better as he was having a hard time reaching his laptop. Found this came in the next day a little difficult putting it to secure it. But we put it under his little table on the side of his electric recliner. He has talked me into getting one for myself. I searched all over looking to see if I can find one I would like better and more stable, but I ended up ordering this one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Williams",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "So far I like it!",
      "text": "The legs on my chair won't fit on both pads at one time. And there is no adjustment to fix that. So far that is my only complaint. A couple days later I find another bad point. The table can't be tilted. When sitting in a chair they are built so you tip back so the tray needs to tip forward or you have to lean forward to use it. I wish that changed. But there is no way to tilt the tray forward. I love that I can swivel it out of the way!!",
      "rating": 4.0,
      "verified": true,
      "author": "L. Buchholz",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Making my recovery easier",
      "text": "My husband put the sofa on risers (5 inches) and then slide this in next to wear I sit. The knob like handle is easy to use and non slip. I can indepently rise from the sofa without help and feel very secure, making the transfer to the walker a breeze. After bilateral knee replacements this is so much safer than I had ever hoped for. The tray table is sturdy, holding a small basket of medications, a coffee cup and my notebook. I recommend if you would like some independence with getting up from a seated position and I think my PT would agree.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Sturdy and helpful",
      "text": "When my disabled husband asked for a TV tray to hold his snacks or tablet I thought of the light-weight aluminum jobs of the 60s....had no idea this was available. But it is awesome. The weight of his chair holds the frame in place, there is a handle knob for a standing aid, the table swings around (easily but not loosely) and its easy to clean. Even the health care workers had never seen one but it was a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "jsbach",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Very wiggly for something that should be stable.",
      "text": "This should be rock solid but it's unstable and already has a slight tilt. It would be easy to make this stable but the manufacturer cut corners. I think that when making products to help those who are sick or old, manufacturers should care whether their products actually meet there needs or the people they are designed too help. It looks nice but that's not enough. I don't recommended it. It was easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "S-GV",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Handy laptop table",
      "text": "I use this table with my lounge chair, and it works satisfactory as a laptop tray. I had to change the way the feet sit under the chair. I put it under both front chair feet -- so that the table vertical post sets off to the side of the chair (instead of in front of it -- as it would then block the lounge's foot lift or ability to rock). My lounger is heavy enough that this provides acceptable structure. Handy table. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Desert Daisy",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "broke after only 4 weeks use",
      "text": "The base bolts broke off after only 4 weeks. Too late to return for faulty make and now I am out $149 for what I needed to help me during my recovery and disability to use for my computer. So disappointed. Trying to find a welder who can possibly make it workable or develop a base for me to use it again. see pictures of broken bolts and base where they broke off leaving the nuts still attached on the other side of the base.",
      "rating": 1.0,
      "verified": true,
      "author": "synderyella",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Stable, solid and convenient.",
      "text": "My dad had a minor stroke and this has made it easier for him to get up and down out of the recliner. His recliner is actually the left recliner of a 2 recliner setup, where they connect in the middle. I separated the two and put it between them so that the palm grip would be on his right since the stroke effected his left. Not only does the arm supporting the tray spin 360 but the actual wood top spends 360. My dad is approximately 240 lbs and it works fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Sturdy and useful.",
      "text": "I got this for my mom, who uses it for a side table and eating tray. It's sturdy enough she can use it to stand up, which is great for her. Easy to clean, does the job, you can't beat it. It is a chore to put together but we've put quite a few pieces of furniture together over the years, we just roll with it and get it together.",
      "rating": 5.0,
      "verified": true,
      "author": "m rice",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "pretty good.  maybe not 100$ or 200$ good.",
      "text": "be sure to buy some WD-40 along with this. the swivel points are very stiff. the table is able to be leveled left to right but not toward or away from you. because of this if the support pole is on your left it slopes slightly toward you; if on your right it slopes away from you. beside that it is pretty sturdy. great for food or computer use. probably not much more that that though. a bit overpriced. if i hadn't gotten a decent tax refund i would not have purchased it.",
      "rating": 4.0,
      "verified": true,
      "author": "douglas carley",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Most likely the handle to assist you up out of the chair may not work under your recliner.",
      "text": "I like how well its built but the bottom where it supposed to set under the chair legs are not adjustable to the different lengths that chair legs are apart. Beings the base plates don't fit under the chair legs as shown in the instructions it causes assist up handle not to be stable enough to use.",
      "rating": 3.0,
      "verified": true,
      "author": "beover21",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Was a gift for my mom.",
      "text": "I got this as a gift for my mom. we had just gotten her a lift chair. it really didn't work well with it.... so i returned it. the quality of the table was great... looked nice... i'm sorry it didn't work with her chair.",
      "rating": 3.0,
      "verified": true,
      "author": "PickyVicky",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "what a great invention, you can push it out of the ...",
      "text": "what a great invention, you can push it out of the way when done eating or reading the paper. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Al Castagno",
      "helpful_votes": 5,
      "publication_date": 20170219
    },
    {
      "title": "LOVE!!!",
      "text": "This table is connected to my recliner in the livingroom. I use it with my laptop while working at home and I LOVE IT. As a matter of fact, I just bought my second one because I was tired of using a TV tray to hold my paperwork. I cannot express how much I love my TWO tables!",
      "rating": 5.0,
      "verified": true,
      "author": "Gusto Paraganos",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Super stable stand",
      "text": "This is an amazing product. It was easy to put together and I was amazed at how sturdy and stable it is. I am looking forward to using it. It is nice to have something so stable to help me stand. I like it so much that I may purchase a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Lippert",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Love it",
      "text": "Very handy for keeping the remote between our recliners and we use it for keyboard & mouse. I like that it can also help me get up from my chair. Well built & looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue H",
      "helpful_votes": 4,
      "publication_date": 20170521
    },
    {
      "title": "Perfect gift : )",
      "text": "Best present ever! This is the best invention for someone who likes to sit in a comfy chair and play on their devices (laptop, iPad, etc.) no more holding everything on your lap and trying to bend over to set everything down when you need to stand up. Nope. Just push the tray away (your devices are secure on the tray) and use the knob to stand up. You’ll wonder how you ever managed before it.",
      "rating": 5.0,
      "verified": true,
      "author": "bessiedarlin : )",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Big disappointment",
      "text": "The screws continue to loosen. The overall experience with this is not good. The table is difficult to turn for an elderly person. When placed under chair legs it caused the chair to tilt a bit and on flat floor. It now is used just as a side table. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Omni tray table",
      "text": "The tray is very stable. Putting it together was a challenge (senior citizen}. I like the way it swivels. I use it for my laptop. Having one handle to grab to get out of my chair is difficult.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Won't fit a lot of chairs",
      "text": "I am going to have to do major changes as the two rests will not go close enough together for my easy chair! I will have to shorten metal pieces to make it work. I didn't try to put this together when I got it as my 5th wheel trailer was not here yet. Now it is too late to return it!",
      "rating": 2.0,
      "verified": true,
      "author": "Steve Butler",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "A Game Changer for my Mom.",
      "text": "This is a game changer for my Mom who has trouble moving about. This is very solid very well built well worth the money. The swing arm is stiff but not too stiff as it should be. It took 5 minutes to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymnd",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Base defective, not flat, and causes the whole table to wobble...",
      "text": "Nice idea. Really hoped this would work as advertised. Sadly the flate base pieces appear slightly bent, and poorly reinforced. They allow the desktop to easily rock up and down, mainly due to this flaw in the base. Care for some spilled coffee in your laptop? Me neither...",
      "rating": 2.0,
      "verified": true,
      "author": "Miguelito",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "great overall. the best available.",
      "text": "Lots of space and much better than Able tray with built in cup holder. Get this with the Omni external Cup holder accessory.",
      "rating": 5.0,
      "verified": true,
      "author": "A Long-time Prime Person",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Better than I could ever have thought it would be",
      "text": "I have tried multiple tray tables and trays for hubby and this is the first that not only allows him to eat sitting up but helps him to stand as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Barb Batchelder",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Great chair side table",
      "text": "I have really enjoyed having this table set up. I can use it for a wide variety of things, but the fact it gives me a sturdy grab handle is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "William McMaster",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Very stable tray",
      "text": "I had bought my wife one last year and after seeing how sturdy and handy this tray is, I ordered one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Coop419",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Works very well with recliner",
      "text": "Working well for my wife. Only thing they need to do is provide spacers for the other side of the chair. This causes it to tip a little. Recommend their products for anyone with limited mobility.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas W Ogilvie",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Great for Handicapped Person",
      "text": "We bought two of these tables for our elderly mother who was limited in movement and spent a lot of time on the couch (one each in two rooms). They are very stable when the couch leg sits on the platform and swivel easily to act as an eating tray or as a side table.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Vaughan",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Need to make sure it can be used on a recliner",
      "text": "I don’t like that it won’t fit my recliner it keeps coming loose otherwise I love it",
      "rating": 3.0,
      "verified": true,
      "author": "swooping eagle",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "love it. Would by a second if I could ...",
      "text": "Bought it, love it. Would by a second if I could find a way to have it sit properly on the other side of the couch. It is a bit tricky because you need the right kind of \"feet\" to be able to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Warren Carver",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Strong and sturdy and well made",
      "text": "Strong and sturdy and well made. In particular I like the adjustability of placement relative to chair, recliner couch etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Blue",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Seem’s solid, but all most to wide between chair ...",
      "text": "Seem’s solid, but all most to wide between chair legs. Cannot use company web site to registor product. Web site would not let me contact company.",
      "rating": 5.0,
      "verified": true,
      "author": "al",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "nice table",
      "text": "Bought this for my Mom and it works great. She does not use it to help her stand but she likes it. exactly as shown and fast shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Measure the base of your chair before you buy",
      "text": "Its a great Idea but it is not adjustable to fit the feet on the lift chair. The base is too long.",
      "rating": 4.0,
      "verified": true,
      "author": "Cheri C.",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Outstanding laptop table",
      "text": "An excellent, durable, well make I will buy another unit,",
      "rating": 5.0,
      "verified": true,
      "author": "Hassan Hijazi",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great table",
      "text": "Very sturdy. Easy to assemble. Good sized table. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Not very sturdy. Fell apart after a month of",
      "text": "Not very sturdy. Fell apart after a month of use",
      "rating": 3.0,
      "verified": true,
      "author": "Tim Porter",
      "helpful_votes": 0,
      "publication_date": 20180520
    }
  ],
  "product_meta": {
    "title": "Stander Omni Tray Table, Work from Home Computer Desk, Laptop Lap Desk Station, Bamboo Swivel TV Tray with Ergonomic Stand Assist Mobility Handle",
    "description": "The Omni Tray Table from Stander gives you both the convenience of a TV table and the safety of a mobility handle in one product, keeping you happy and healthy. The Omni Tray features a large bamboo tray table that is perfect for using your laptop, eating dinner, or reading a favorite book. When not in use simply pivot the tabletop to the side and use as a couch side table that blends in with the rest of your living room furniture. The ergonomic mobility handle gives you the leverage and support needed when sitting down or standing up from your favorite couch, lift chair, or recliner safely and independently. Whether you have recently had surgery or simply lack the same mobility you once had, the Omni Tray is the functional and attractive tray table you have been looking for.",
    "rating": 4.3,
    "feature_bullets": [
      "OVERSIZED LAP DESK: Our multi-use bamboo TV tray table measures 20 by 15 inches, providing plenty of room to be used as a home computer desk, writing desk, or laptop stand; ideal for those who work from home or for students with online coursework; with 360 degrees of swivel motion, easily pivot the tray table out of the way when not in use; safely supports up to 30 pounds",
      "PROVIDES BALANCE AND SUPPORT: Stander’s ergonomic safety handle provides balance and support when sitting and standing from your favorite couch, lift chair, or recliner; our mobility handle can support up to 250 pounds",
      "HIGH QUALITY AND EASY TO ASSEMBLE: Easily assemble and securely install the adjustable Omni Tray Table under the feet of most four legged couches, lift chairs, or recliners with feet 25 to 35 inches apart; each tray includes all the needed equipment for assembly, no additional tools required; not intended for freestanding use",
      "FULLY ADJUSTABLE: Customize the Omni Tray to your individual comfort and furniture; tray height adjusts from 24 to 32 inches; support handle height adjusts from 28 to 36 inches; base length adjusts from 25 to 35 inches; please reference our assembly video and infographics to determine if the Omni Tray Table is compatible with your furniture",
      "SATISFACTION GUARANTEED: All Stander products are backed by our Lifetime Satisfaction Guarantee"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "29.5 x 18 x 28.5 inches; 20 Pounds",
      "Item model number": "2600",
      "Date First Available": "May 20, 2016",
      "Manufacturer": "Standers, Inc",
      "ASIN": "B01FSGZ6FE",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Medical Supplies & Equipment",
      "Mobility & Daily Living Aids",
      "Mobility Aids & Equipment",
      "Health & Household",
      "Standing Aids & Supports",
      "Health, Household & Baby Care"
    ],
    "price": 103.6
  }
}