{
  "website_summaries": [
    {
      "verdict": "Buyers interested in outdoor exploration may be interested in this camping-inspired travel mug.",
      "pros": [
        "Included lid built with a small opening and closing hole for sipping",
        "Lid is dishwasher safe and BPA-free",
        "Customers love the retro-camping look",
        "Keeps liquid hot and cold for hours"
      ],
      "cons": [
        "Mug must be hand washed",
        "Customers wished the cup had better temperature control"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Just ok",
      "text": "This cup is just ok, my ice melts fast, keeps coffee hot about 3to4hrs. It does leak so i can not just toss in my work bag( I added pics of cup closed upside down and leaking). I like that it goes on the dishwasher which is the only reason it gets that many stars. Not as cute in person either,it looked more rustic in the pictures, actual product is more pink with bigger white specs. Please click below up if my review helped you!",
      "rating": 3.0,
      "verified": true,
      "author": "Tiff",
      "helpful_votes": 72,
      "publication_date": 20170628
    },
    {
      "title": "Does not fit in any of our car cupholders, BEWARE!",
      "text": "Great looking travel mug but it does not fit into any of the cup holders in our cars! If you are looking for a travel mug that works in your car, forget this one, unless you have a car that has adjustable size cup holders. Our cars have holders in the center console and in the doors (Honda CRV and Chrysler 300). This travel mug is too wide and is not narrowed toward the bottom like our old Starbuck's travel mugs. It is worthless for me, so I'm returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Prime customer",
      "helpful_votes": 50,
      "publication_date": 20171111
    },
    {
      "title": "Keeps coffee hot and looks nice / handle broke",
      "text": "Bought this for my wife and she loves it! Keeps her coffee hot for hours and she loves the look. Only reason it’s not 5 stars is when you tighten the cap when holding the handle it seems like it may break after some use but as long as you tighten while holding actual cup you will have no issues. Update: So after 2 months of regular use the handle did end up breaking off. The cup was used normally and not in any manner that it shouldn’t have. The handle looks to only be held by 2 small pin welds which just isn’t enoug",
      "rating": 1.0,
      "verified": true,
      "author": "M Martinez",
      "helpful_votes": 21,
      "publication_date": 20180209
    },
    {
      "title": "Defective",
      "text": "The handle broke after my first use of this, as seen in the picture. I wrote the company when this happened, and never got a response. Eventually I just snapped off the whole handle in order to use this defective product and was horrified how easy it was to do so — it was attached with what seems to be really cheap glue. How could this survive a dishwasher? Terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Cassandra",
      "helpful_votes": 7,
      "publication_date": 20181105
    },
    {
      "title": "Cool campy design",
      "text": "Keeps my coffee warm for a couple of hours, get compliments on the color of the cup and the design, and it's leak-proof so far. I normally put creamer in the cup, seal the lid, give it some good shakes to mix it, and I haven't seen any trace of a leakage. Thumbs up! The simple lid design is easy to clean, but the spout is also the air hole so it doesn't pour out smoothly. That's okay because you're sipping it anyways. Only real down size was the cork material on the inside of the handle came damaged and you get some random flicks of coffee when you pop the spout open and closed.",
      "rating": 4.0,
      "verified": true,
      "author": "AttaboyAdley",
      "helpful_votes": 4,
      "publication_date": 20170421
    },
    {
      "title": "Great Mug, Horrible Lid Design",
      "text": "I've had this mug for 2 months, and it does what a mug needs to do - keep my coffee warm. Cons: 1) The enamel is scratched after normal wear and tear. Pretty disappointed, considering I work in an office; I'm not hiking/firefighting/Cagefighting with this thing. 2) Worst. lid. ever. You can't(?) disassemble and clean. I now have a dedicated toothbrush I use to scrub the nooks and crannies as much as possible - Update*** I actually just stopped drinking through the opening on the lid, it's too gross. I unscrew the lid and drink from the mug directly. I \"sanitize\" the lid once a week in the dishwasher.",
      "rating": 4.0,
      "verified": true,
      "author": "S Christ",
      "helpful_votes": 4,
      "publication_date": 20180102
    },
    {
      "title": "Leaks from the top when sealed",
      "text": "I've purchased oth Ello products and I love them, but this one leaks pretty badly when turned upside down (I have the Ello Cole and it can take a real beating without leaking). If you're looking for a mug that's beautiful and stops major spills, then this is perfect. I love to grab a coffee and load up the dogs to head to the park, and my mugs need to be totally spill-proof to withstand that chaos. It's really pretty though. I wish it would have fit my needs.",
      "rating": 2.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Cool looking mug",
      "text": "Positives first. Keeps liquids hot for a long time as long as the lid is on. Handle is comfortable to hold. The finish is cool looking with texture. Dishwasher safe. Cons. The lid is terrible. It is one of those you have to line up before you twist on so the hole lines up where you want to drink from it. The hole is super small and hardly any liquid can get through. The sliding mechanism is hard too. It snaps open and shut loudly and your liquid comes flying out. I don't use the lid very often and then the liquid grows cold faster.",
      "rating": 3.0,
      "verified": true,
      "author": "pattysue",
      "helpful_votes": 5,
      "publication_date": 20170625
    },
    {
      "title": "I always love Ello mugs and bottles and am slowly building quite ...",
      "text": "I always love Ello mugs and bottles and am slowly building quite the collection. This campy mug is great especially since it has a twist off/on and closable lid. I really do wish Ello would sell just the lids!! Since you cant really take them apart, over time grime really will buildup in the corners and whatnot. However, Ello mugs and bottles are such a great price that after 8 months of 5 days a week use, I wouldn't mind buying another.",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory Foy",
      "helpful_votes": 2,
      "publication_date": 20180521
    },
    {
      "title": "Beautiful and definitely keeps drinks hot",
      "text": "I love these mugs so much I've bought two of them. They keep hot drinks very hot for several hours (in fact, it's easy to burn yourself if you're expecting your drink to have cooled down at all). The colors are beautiful (I have the peach and navy ones), and I always get compliments when I use them. The only complaint I have is that if you're holding it by the handle, you have to do so in your left hand because of the way the lid screws on. That's only a minor inconvenience, and I love it so much that I still give it 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Dkx",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "Came damaged.",
      "text": "I was very excited about this mug to arrive. When it did the handle was completely separated from the mug. I can't even tell how it was fastened on in the first place.",
      "rating": 1.0,
      "verified": true,
      "author": "Maggie McKew",
      "helpful_votes": 12,
      "publication_date": 20170824
    },
    {
      "title": "Amazing camp mug, disclaimer needs to be bigger",
      "text": "So I bought this for my dad and slapped on a worlds best grandpa decal, and gave it to him for Christmas. Well he fills it up and has to head out of town on errands gets back 6 hours later and remembers the coffee. Expecting it to be cold In one swift motion he lifts the mug opens the top and swigs deeply. 30 minutes of story and mixed obscenities later I'm roflcoptering \"Dad if you don't put in the lid the coffee will cool faster.\" \"Oh great gift then. Thanx\" Mirael if the story warn them that it is an awesome insulator and will keep it blistering hot for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "The BEST coffee mug",
      "text": "I bought one of these from Walmart about 3 years ago and it's still going strong. The coating JUST started chipping a little bit by the mouth area. But that is also because I'm lazy and don't always hand wash it. It fits perfectly in my car cup holder and is just the right amount for my morning needs. I bought this solely because I wanted a new, shiny pink one lol! Keeps the coffee hot forever so long as you close the lid after sipping. Oh and it's definitely spill proof I can't tell you how many times I've been working with it next to me on the sofa and my kid has jumped up. No stains yet!",
      "rating": 5.0,
      "verified": true,
      "author": "haley",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Love this cup",
      "text": "I absolutely love this cup!! It keeps my coffee warm for hours- I sometimes have to keep the lid cracked to cool off my coffee enough to drink it. I highly recommend this for people who work a job where they can’t be constantly sipping coffee and who take a bit of a break between sips. It’s also insanely spill proof, I can essentially hold it upside down and not a drop spills. There’s been multiple times I have a bunch of stuff in my hands, including this mug, and I can hold it sideways without worrying it’s going to spill. Also, it’s super cute. I get compliments on it often",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "A lid fight. It's on its way back.",
      "text": "I don't understand the large number of very positive reviews. both my wife and I tried for 20 minutes to get the lid aligned after we removed it. It's nearly impossible to place the lid so that the opening is ready for right-handed use as it was in the box. That was all I needed. It's being returned. I can't imagine fighting with my coffee cup in the morning and risking dumping hot coffee on my chest because of an incompetent lid design. If you can get it in, it's great. But if you can get it in, I admire you.",
      "rating": 1.0,
      "verified": true,
      "author": "Don S",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "THIS is amazing.. as good as my Yeti and a fraction of the price.",
      "text": "Guys, this thing ROCKS. I put just brewed coffee in it at 8am, and at noon it was still piping hot. It is still semi-warm at 4pm. (I'm a sipper). Its double walled stainless steel covered in enamel paint, with a screw in locking lid that completely prevented the potential spill when I accidently turned it over in the car. And so far I've had 4 people ask me to send them the link on Amazon because they thought it was so pretty! And at this price it is one of my best buys.... blows my old Contigo out of the water...",
      "rating": 5.0,
      "verified": true,
      "author": "E. A. Sawning",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "How to line up the lid",
      "text": "This a decent mug for the price. (I got an instant discount.) Getting the lid on so that handle and hole are in the right position is tricky. Here's how: Set the cup in drinking position (handle on right). Set the lid so that the tab (not the hole) is between 1 and 2 o'clock (see photo). With light pressure, turn clockwise. The last bit of turning positions and seals. For lefties, set cup with handle on left and position tab between 7 and 8. Cup sort of fits in my 2019 Subaru Outback. Only goes about halfway in but that's because the Outback has ridiculously small cup holders.",
      "rating": 4.0,
      "verified": true,
      "author": "SaraInCaryTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Perfect for travel!",
      "text": "Definitely the perfect travel mug! I was looking for a travel bottle/cup/mug for my SO, who has been looking for one with a sliding top, leak proof, and perfect for hot or cold beverages. This was it and it came with a handle! We tested it on a few trips and different situations and it lived up to its description. No more and no less. The color was spot on too! Only complaint I have is that it can be difficult to clean thoroughly more so than let’s say a hydro flask or any other standard water “bottle” but with a few washes you’ll get the hang of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Moriah",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Wonderful mug!",
      "text": "I love the look of those camping mugs, and was really interested to see this larger travel mug version of it. I got it for a coworker for Secret Santa, and she's still using it every day well into February! It keeps her drinks hot up at the checkstands all day, and it looks so cute. I'm tempted to get one for myself, but I know I don't typically use travel mugs. I'm a little jealous I don't need one!",
      "rating": 5.0,
      "verified": true,
      "author": "Stefani V.",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Hot is hot!",
      "text": "I loved this cup and found I had to keep a close eye on it to keep it from wandering off. (other people liked it too!!) It held my beverages (both HOT or cold) temperatures longer than any other insulated mug I own. The only complaint I had was that it didn't fit the cup holder in my older model car...I'm sure the newer cars have adapted. The lock down lid was a feature that was great, but I had to make sure I had the lid tight enough to prevent all drips. Just remember to never put it in the dishwasher (same as all insulated cups). And don't let it wander off with strangers.",
      "rating": 4.0,
      "verified": true,
      "author": "Shar_Grummy",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Stays hot and fresh for so long!",
      "text": "This is literally the best travel coffee mug one could ever want. I have very strong feelings about my hot coffee so this saying a lot. I like strong, piping hot coffee and was afraid to buy a mug that I couldn’t microwave because I despise when my coffee gets even slightly luke warm and I can never finish my coffee quick enough to drink it hot in one shot. This mug exceeded expectations and keeps my coffee fresh and hot, not just warm, for at least 5 hours. I can’t stop raving about this cup and I just bought another one for a friend because I feel every hot coffee lover needs one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Best Yet!",
      "text": "This is the second one of these I bought ...first was from a discount home store a couple of years ago and I liked it so much, I recently got one for my husband. It keeps your coffee hot for hours! I dislike drinking hot beverages out of plastic, and I am not crazy about stainless steel, but I have not found a ceramic cup with thermos-like feature like this one. I took a star off because the lid is a bit hard to clean; I use a toothbrush even after soaking overnight. But if you want Hot coffee, this is the cup.",
      "rating": 4.0,
      "verified": true,
      "author": "Pegthechef",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Keeps coffee hot, but handle breaks off easily",
      "text": "The handle broke off. Loved the idea of having a handle. However, each time you tighten the lid, you can feel the unsteadiness in the handle. After a while, it just broke off. Not using it incorrectly or hard on. Regular use. Product does keep coffee hot for 5-6 hours, so no nuking it throughout the day. And it’s pretty stylish. Cleaning: dishwasher soap coats it, so definitely rinse it prior to use so it doesn’t ruin your coffee.",
      "rating": 3.0,
      "verified": true,
      "author": "keg",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "New lid design is not an improvement",
      "text": "I have purchased several of these over the years. Though the previous lid was impossible to really clean without a dishwasher, the newly designed lid leaks. I've read the hundreds of reviews, and I while I appreciate the effort to make the lid easier to clean, the old lid didn't leak. The new one isn't so dishwasher friendly, since the new mechanism must be held open to rinse and dry. My dishwasher doesn't have enough hands to accomplish this. I replace the mugs when the paint chips off, and since I now wash them in the dishwasher, this is inevitable after a while. Sometimes a long while.",
      "rating": 4.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Favorite Travel Mug",
      "text": "I bought one at a local store and was so happy with it that I wanted another one. Of course I knew I could find one on Amazon. I love how long it keeps coffee hot, the shape which is tall, size (18 Oz) perfect, & the screw on lid which stays secure. I haven’t had a problem with the handles like other reviewers. I also run mine through our dishwasher on the top shelf even though it advises to hand wash. We put everything in the dishwasher and take our chances lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Jampuddles",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Paint chipping off. Can’t use.",
      "text": "Did everything I was suppose to, didn’t put in microwave, washed on to rack of dishwasher. Paint started to come off blue mug. Can’t use it. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "C Jane Heffernan",
      "helpful_votes": 5,
      "publication_date": 20180424
    },
    {
      "title": "The Basic Durable Travel Mug You’ve been looking for!",
      "text": "Beautiful, strong, easy-to-use, I bought two mugs, each in a different color. One for me, one for my father, for Father’s Day and they were a hit! Even though my Father doesn’t usually use travel mugs, our father/daughter tradition of meeting several times a month for coffee made me hopeful he’d appreciate a great mug if I could find one. These are fantastic! The colors are bright and durable, but not too bright for a guy, the handles are comfortable and high enough on the mug that they sit well in a vehicle cup holder. We’ve enjoyed everything about these mugs.",
      "rating": 5.0,
      "verified": true,
      "author": "MuGra Music",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great for cold drinks",
      "text": "Bought one for myself and one for my husband. He likes the light gray, I like the dark teal blue. Keeps colds cold for hours! Heated beverages, not so much. But that's ok, we use them for ice water. The only other drawback is that you have to get the lid just right in order to get the opening to be where you want it vis-a-vis the handle. You THINK you start it at same point (almost full circle), but about half the time it doesn't end up where you want it. Problem? Eh. It seals really well. Also, they're very cool looking, love the large handles, and they fit in our drink cups in the car.",
      "rating": 4.0,
      "verified": true,
      "author": "DST",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Leak proof, fits in car cup holder. I Highly reccomend!",
      "text": "I love this mug. It has a campy look which is cute, it is leak proof for sure, and even fits right in your cupholder in the car. It fits under a keurig if you take the tray out. It's easy to wash and great for people who camp and travel. It holds a good amount of liquid and keeps it hot or cold for many hours. It's pretty light weight. I plan on getting the blue one too! It's a perfect gift and I highly reccomend.",
      "rating": 5.0,
      "verified": true,
      "author": "morgan",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Don’t waste your money",
      "text": "Ordered this because of the great reviews. I must have gotten a different mug. First of all it didn’t fit in my coffee cup holders in my Silverado truck. The ice lasted about 2 1/2 hours. Which was ridiculous because it was cold out. I’m sure it lasts less time when it’s hot. I was disappointed with it’s heat retention also. My coffee stayed hot for about an hour. Not impressed with this mug at all.",
      "rating": 2.0,
      "verified": true,
      "author": "A.U.",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Nice!",
      "text": "I like that is looks like a mug and yet has that insulated properties. It feels a bit light compared to the other vacuum-insulated stainless steel tumblers I have. Look nice thought. Hope the handle is durable. Overall, I am satisfied. I have to make this edited review regarding one thing, and that is the awkward sliding port. I don't like how it feels when my lips is pressed against the mug and the awkward orientation of the handle in conjunction to the port when the lid is fully screwed in.",
      "rating": 4.0,
      "verified": true,
      "author": "ionix",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Ello Campy screw-on cup",
      "text": "This stainless steel, tall ,cup with securely-screwed on lid; does not spill or break if it falls off the rolling walker. The color(s) are attractive and the handle is large and just right for easy grip. The only little problem with it is it is difficult to get the opening from which to drink at just the right spot for right or left-hand pickup of the cup. Maybe there is a trick to it and we will figure it out soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161021
    },
    {
      "title": "Lid off to drink!",
      "text": "This is attractive and sturdy, but not for me. The sipping opening is tiny and removing the lid could be an option, but that decreases the heat retention. Also, trying to sip with the lid off is difficult because of the slope of the top. The handle is easy to hold but when the lid is screwed closed, the handle is very close to the drink opening. Puzzled by all the very high reviews and I'll return this.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Kurtz",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Awesome thermos but the lid is a bit hard to clean",
      "text": "This keeps liquids hot and cold for a long time. I really liked having ice cold water in the mornings first thing while I was pregnant. I would load the thermos up with ice water the night before and have very cold water eight hours later The only drawback is that the lid is very difficult to clean well so you just kind of hope that there's no mold growing",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Hall",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Love it. Use it everyday.",
      "text": "Really leak proof! I threw this into my tote bag with hot coffee in it and ran errands all morning. Not only did it keep the coffee hot but not a drop spilled. The only small negative is the white lid can get stained a little overtime on the inside if you drink coffee out of it. This does not affect the utility, really just aesthetically and really only on the inside. Oh, actually another negative is it doesn’t fit into my cup holder in my car.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle J.",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "one cool cup... in this case hot!",
      "text": "I love this cup! I love the color, it is exactly like the picture. Surprisingly it also keep my coffee pretty hot, it stays warm for 5-6 hours. The reason I didn't give it a 5 stars is because it is so hard to wash! we don't have a dishwasher at work and washing this is not easy. especially the spout area. I need to use q-tip to go in there and wash it. So now I don't even drink from there... I just twist the lid off and drink from the cup.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Will be buying more!",
      "text": "I bought one of these from a local store a few years ago. It still holds heat very well, for HOURS. is very durability and light easy to carry around. So I turned to Amazon to see if I could find it again. Was happy to see this product on here. Ordered another one and it too is Very Durable and holds hot liquid for hours. Will most likely be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary.p",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Great insulated cup",
      "text": "Love, love, love this mug! I bought one at Walmart several years ago for camp outs because it’s leak proof and has a handle, so I can put a carabiner on it and clip it to my backpack. When I found these on Amazon, I was so happy! These newer updates versions have a feature where you can flip the seal inside to clean it better. My old cup had lasted 5 years and still going but I wanted different colors. I’ll never buy another brand of insulated cup again!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly R",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Several hours of warm coffee! GREAT PRICE!!",
      "text": "I’ll have to admit that for this price I didn’t expect the kind of quality that I received. This mug keeps coffee warm for an unexpected amount of time, and LONGER than tumblers I’ve paid twice as much for. The lid is fine while upright, and is great to prevent spills, just watch out if it sits horizontal for more than a few seconds. Don’t leave it on the floorboard of the car with liquids in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Seth Janisse",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Too many annoying stickers",
      "text": "Leak proof and size is good for cup holders. I'm disappointed because you have to twist the cap on just right in order to use it right handed or left handed. Cup arrived with 2 stickers that left sticky residue on the cup and one was right where you put your mouth. I am irritated by any company that makes me work or use a chemical like goo gone to get their stickers off! I returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria R.",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Great longevity",
      "text": "This is my second purchase. The first survived daily abuse of toddlers dropping it on concrete and going through the dish washer. The handle finally broke off the first mug after 15 months but the seal never failed. I bought this because the handle is high enough up that it fits in my car cup holder without a problem and I can attach the mug to my bag with a caribiner when commuting on public transit.",
      "rating": 4.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Good and Bad",
      "text": "So I read all the reviews before buying this mug. And everything is true. It keeps beverages hot for a really long time, it’s very lean proof. But also true is that the lid is so difficult to clean and the handle is very flimsy. I am super annoyed because my handle broke off today and I’ve had the mug for under two months. I will probably buy another one because it really doesn’t leak and it keeps everything so hot. But it’s annoying that the handle broke with minimal use.",
      "rating": 3.0,
      "verified": true,
      "author": "OswaldAna",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "truly leakproof",
      "text": "I love this cup. I is truly leakproof, which is very important because I keep it on my desk. Keeps things hot and cold for a long time. I gave it only a four start because the lip of the lid is kind of big and a little difficult to drink out of without it dripping a little bit and it does not fit in my cup holder, but I have an older car so I just hold onto it. but overall I really love it. especially the metal exterior and rustic camping look.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrea Parks",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Devil is in the detail",
      "text": "Brought this one only because of its elegant looking on picture. However, after 2 days use, I have to put it away due to the major design flaws: 1. The coffee stains around the drinking hole cannot washed away by hand. Need some Q-Tips to get it done. 2. You have to be strong enough to make the drinking hole 90 degree to the handle. Also depends on the position the cap has been twisted in. Many times, I have to hold the mug body, instead of the handle to be able to drink comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "just4li",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Looks to be excellent",
      "text": "I bought this mug as a gift. Will update with any complaints later. Looks to be a great mug. The lid threads on and there is a secondary seal underneath the slider mouth opening. When you slide open the outer piece the inner seal opens. Cork handle is nice feel, dont know how long it'll last. Don't put in microwave, its steel.",
      "rating": 4.0,
      "verified": true,
      "author": "airtight_python",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Buy this cup",
      "text": "This completes a set of 4 of these. I have been buying these over the years for camping. They are the best! We drink tea in the morning and it stays hot for hours! Then, we switch to cocktails at night in the same cup! Ice stays cold and takes much longer to melt in these. It’s interesting to see the evolution of the mechanism for the lid over the years. They all work very well to make the lid leak proof, but now it’s even easier to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Dickey",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Handle snapped off after 3 days of use.",
      "text": "I was initially really happy with the performance, volume and handling on the mug. However, 3 days into being used, the handle snapped off while I was screwing on the lid. Really no excuse for such poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazonymous",
      "helpful_votes": 3,
      "publication_date": 20171204
    },
    {
      "title": "Hot coffee at last!",
      "text": "Today, I took me about three hours to finish my coffee and it was warm right til the end! My work day is starts early and can be chaotic- and drinking my coffee while it was still hot was a luxury for the weekends only. Not any more. It is leak poof, handle is good. Color is nice. Easy to clean. Well worth the $$.",
      "rating": 5.0,
      "verified": true,
      "author": "MLWhite",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Good Quality, Do Not Put in Dishwasher",
      "text": "I love this cup for my coffee. I had one in blue that I used for a couple of years and I stuck it in the dishwasher all the time. Needless to say, the paint chipped a lot. I decided to upgrade to the more coral colored one. I have only hand washed it. It is attractive and keeps my coffee hot all day. The threads on the lid are a little difficult to clean but not terrible. You can put the lid on to use right or left handed- a pretty cool feature that not everyone is bound to notice. I definitely recommend this cup. The 70s camping style is so fun and unique!",
      "rating": 4.0,
      "verified": true,
      "author": "david gramblin",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Keeps my coffee hot",
      "text": "Keeps my coffee hot. The lid is leakproof. I like the blue enamel. It reminds me of the old camping cups we had when I was a kid. The insulated cup doesn’t keep the hot beverage as hot or as long as a Yeti cup but for me that’s just fine. I use it at work where the temperature is normal. My favorite coffee cup.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Cas",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Adorable and practical - what could be better?",
      "text": "This is totally adorable and practical - what could be better?! It is easy to clean (particularly since it's dishwasher safe), keeps coffee hot, and so super cute. The handle is comfy. I was a bit bummed that I can't put a straw in the sip hole - but it has a nice blocker there to prevent leaks even when it's open, so that's better actually.",
      "rating": 4.0,
      "verified": true,
      "author": "HopeTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Keeps coffee hot for HOURS!",
      "text": "This is my absolute favorite coffee mug! It keeps my coffee hot for HOURS! I found one of these at Marshalls for super cheap and kicked myself for not buying more. Thankfully, I saw this one shared on Erica's Steals and Deals FB page and was able to snag another one for a great price. You won't be disappointed with this cup!",
      "rating": 5.0,
      "verified": true,
      "author": "Tank",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Leisurely Coffee Drinking...Finally!",
      "text": "This is so great! I've had this mug on my desk all afternoon and the coffee is still hot. No more gulping it down to avoid that lukewarm yuckiness. I love the peach color. It's nothing like what's pictured in the listing. It's actually a nice soft peach color with white speckles. The lid is white with a matching peach colored slider over the drinking hole. We'll see how it holds up over time, but for now, I'm a happy camper. I have HOT coffee to sip and an attractive mug on my desk. What could be better?",
      "rating": 5.0,
      "verified": true,
      "author": "LKB in North Carolina",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Beautiful and works",
      "text": "Very nice mug and it keeps stuff hot for a couple hours (2-3) The 4 star is for the fact it has to be hand washed I'm guessing because the inside has a seam in it rather then being all one piece and smooth and because it has a cork ish layer inside the handle that adds comfort but not sure how long it will hold up..",
      "rating": 4.0,
      "verified": true,
      "author": "D.A.K",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Cool looking mug, with plenty of room",
      "text": "Cool looking cup. Reminds me of the old campfire enamel cups, in appearance. I like this orang/peach color. The tops are a royal pain getting on & off for awhile, but seems to get easier over time. Hold the CUP, not the HANDLE, when putting the lid off & on, as you could easily break it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Gijoe",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Love these!",
      "text": "Filled up my mug at 8:00 am with boiling water (212 degrees F), it was still warm at 2:00PM that afternoon. I love these mugs for work, I don't have to worry about my tea getting cold while I'm busy running around the office or in and out of the car. I had purchased one originally from Fred Myers but it was $20! Thank you Amazon for saving me $5 each. I have three of these now and I just adore them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Gail",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Love love love",
      "text": "I love this mug. I use it every day and have bought it for friends and family. It will keep piping hot coffee hot for at least an hour and then slowly loses its heat. I’ve tried my coffee after about 3 hours and it’s still warm. I seriously tell everyone to buy one. Only down side is that the handle makes it difficult to fit in some car cup holders but that’s like every handled beverage.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi G.",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Disappointed This Time",
      "text": "This is my fifth Ello Campy mug purchase. I was excited because I was expecting to have a cold drink experience. Unfortunately, not this time and I’ve been bragging about this cup since I first purchased it. This cup definitely does not keep my drink cold like the others. It’s light in weight which is good, but your ice melts quickly and although insulated with a vacuum lid, the drink does not stay cold for the time specified. I don’t use my mugs for hot drinks! I hate returning things. Very disappointed. Ack!!!",
      "rating": 2.0,
      "verified": true,
      "author": "revmd621",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "love this mug",
      "text": "Love the look of this mug and how it keeps my drink warm for hours (yes, hours). I now have 3 of them. The mug is large enough that I can reach my hand inside to give it a good scrub. The cover is a little bit difficult to get into all the little nooks. A straw brush and soaking help with that.",
      "rating": 5.0,
      "verified": true,
      "author": "salvan",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "The take with you anywhere mug. Doesn’t spill.",
      "text": "My mother in law loves this travel mug. She is over 80 years old and has a better social life, then myself. She lives to have her tea and hot water with her everywhere she goes. This is her 2nd mug, her first one she had for a few years, the handle broke off due to heavy use. When closed properly, it doesn’t spill and it keeps your beverage hot to warm or cold for several hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa L.",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "this cup is great..",
      "text": "this cup is great... first I love the old timey tin cup look, I didn't want the peach I wanted the grey but it was out of stock and I needed the cup asap. am so glad I bought the peach beautiful color.. next the cup is great for keeping my tea hot, it kept it hot for 5 plus hours. and the cup has something on the inside handle so your fingers don't slip. I will be getting another one of these great cups",
      "rating": 5.0,
      "verified": true,
      "author": "Pennington",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Wonderful Mug That Keeps Cold/Hot for Hours",
      "text": "Bought this as a present for my husband and ended up purchasing two more. I’m considering giving these as gifts this holiday season too. Have had them for 9 months and they work great. Keeps my tea hot for hours on end. Only down side is that it can’t go in the dishwasher as it would ruin the seal.",
      "rating": 5.0,
      "verified": true,
      "author": "Nichole",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Does it matter to you if it fits in the car’s cup holder?",
      "text": "I didn’t think I would mind that it doesn’t fit in the car cup holder but I do mind. It’s pretty leak proof but you have to be careful of the slider on top. It’s a little tricky to screw it on so the opening is in the right place but you get the hang of it. It keeps my coffee warm.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Nye",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "MY PICKY DAD LIKES IT",
      "text": "My retired dad is a VA volunteer, driving vets to a VA hospital 100 miles away, at least twice weekly. He is a no frills kinda guy. This cup was a gift given about 4 months ago and he is using it. (that's a big deal! lol) It fits the cup holder in the van he drives and keeps his coffee hot for the 2-3 hour trip to pick up the veterans and drive to the hospital. When he gets to the hospital, he refills it with fresh coffee. I like the gray, speckled design; it's a little different from your typical navy, speckled design, but not crazy. He digs it. Happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "jenngin",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Really stays hot",
      "text": "this thing is great, coffee stays warm for at least the hour it takes me to sip two cups . Also i can clip this cup to my belt loop when I ride motorcycle to work and it will not leak. also like the lid always locks into the correct position for drinking (the spout aligns properly) I noticed that you can start the lid 180 degrees and it even lines up for a left handed person !",
      "rating": 5.0,
      "verified": true,
      "author": "Edwin Hall",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Long lasting and easy on the eyes!",
      "text": "Years ago I had this in blue. For whatever reason my parents seem to accidentally take things of mine if I leave them at their house ...mostly travel mugs and reusable shopping bags. Whatever, they gave me life so it’s fair. My dad had been using for maybe six or seven years. The handle had fallen off and he was still using it. I could he liked it. Plus it has that great vintage camping look. I also really like the handle that has cork on the inside. This Christmas I bought myself one (pinkish one) one for my dad (Grey) and For my husband (black). They are great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "My Go-To Coffee Cup",
      "text": "This bottle is so cute in the peach color and is lightweight too. The handle has a nice non-slip grip that is comfortable to hold too. Gotten compliments on it too since the speckled pattern is very cute/rustic. I haven't tested the amount of time it keeps my coffee hot but it certainly seems like longer than it would in a paper cup.",
      "rating": 5.0,
      "verified": true,
      "author": "ACJean",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Use it everyday",
      "text": "I really like this cup. I use it every day to put my coffee in and it is definitely leak proof. It keeps my coffee warm for several hours and it's not hot to the touch. Also love the color. I've had it for awhile now and it's holding up really well, although I hand wash it instead of putting it thru the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Eva Ortiz",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Finally a coffee mug that is tall and large enough to hold the amount of coffee I drink",
      "text": "Great tall coffee mug. I really like the enamel look of it while the inside is stainless steel. The color is very beautiful and the handle having cork inside is nice. As I normally hold my morning coffee while driving and sip it along the way, the only thing I would suggest is to have the handles wider so it will be more comfortable holding it for long durations.",
      "rating": 5.0,
      "verified": true,
      "author": "simon",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "We're ordering two more!",
      "text": "We're ordering two more! We've taken this trial mug on several trips and we couldn't be happier. It keeps liquids cold for a VERY long time which means we can take our own filtered water with us in a stainless steel mug. It's easy to wash and dry. The lid is well-designed so that it's easy to get liquid into your move without spilling and sloshing. And we haven't had any liquid spill at any other time. We're very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader from Rice Lake",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Really does keep hot for 4 hours or more!!",
      "text": "Been looking for many many years for a mug that truly does keep my tea hot for hours. I poured it at at 10 am and it was still tongue burning hot when I finished it four hours later. Love this!! Going to buy the smaller one and probably a few more. Finally found the one!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Patty",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Great Travel mug",
      "text": "I love this little travel mug! It's such a cute color ( I ordered the blue color) and it holds the perfect amount of hot chocolate, tea, or coffee. I gave it four stars because i was expecting a metal lid but this one is plastic. That being said the plastic is thick and the lid seals well, not one drip when I left it on it's side in my book bag for 3 hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Keeps it hot",
      "text": "Main thing is keeps drinks hot. Like the look and size--I use mainly for tea. Fits in car cup holder. Find the plastic stopper mechanism in lid stains w/coffee. Threaded lid.I put the lid in the dishwasher, however lots of nooks/crannies in lid so can be hard to clean if not rinsed before drink dries inside. Inside of handle is cork or synthetic cork?, but I put in dishwasher --instructions say not to--and holding up for a few months so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Hot or cold it will hold",
      "text": "Starting with the comfortable handle so easy to hold. We bought these for a group to carry at an all inclusive resort. Starting with coffee in the morning and ending the day with beer, wine, or beach cocktails this mug has done the job. They have made several fun trips with us.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny Bensyl",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Best bottle ever!",
      "text": "My friend gave me it as a present a few years ago and I still use it, amazing quality, no leaks, keeps my coffee hot for hours (saved a lot of money on Starbucks).",
      "rating": 5.0,
      "verified": true,
      "author": "Ksu",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Good for daily commute, not camping",
      "text": "This mug legitimately keeps my coffee warm for 6 hours. I work in a medical clinic and typically get to sporadically sip my coffee throughout the morning. I now know when lunch is coming up because my coffee has gone from hot to luke warm... after 6+ hours! The top has crevices that need to be deep cleaned every so often to prevent mildew, etc. I use my mug every day and throw it in the dishwasher to sanitize every other week with soapy rinses every morning. The handle is comfortable, but does feel a bit loose. I wouldn't take this mug camping, but love it for my every day.",
      "rating": 4.0,
      "verified": true,
      "author": "Danny Wilkens",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Unclean",
      "text": "This is a decent mug *except* for the lid. It's exceedingly difficult to clean, even with a tiny straw brush. Gross black gunk accumulates under the seal before the coffee in the mug is gone. The underside of the seal is hard to even see, let alone scrub clean. I can't recommend this one to anyone who cares cleanliness.",
      "rating": 1.0,
      "verified": true,
      "author": "twistedflatcat",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Awesome!",
      "text": "Keeps my coffee warm for hours! It also doesn't heat up the outside of the cup at all so it doesn't burn my hands to hold it. Love the look of it and I have washed it in my dishwasher multiple times and it has held up great. Fits perfectly in a car cup holder, all around a great mug and I will probably buy one in every color.",
      "rating": 5.0,
      "verified": true,
      "author": "kes",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Mold",
      "text": "I thought this product was wonderful. Kept drinks hot for a long time and really did not spill. However, recently I discovered that the rubber that keeps the liquids from spilling has grown mold on it. I didnt realize that the plastic parts come off to get cleaned. I am trying to find a way to contact the seller to maybe send a replacement rubber parts, but am not having any luck. I gave it 5 stars originally, but now I think more like a 2.",
      "rating": 2.0,
      "verified": true,
      "author": "Stuff",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Very Good",
      "text": "love this cup, I like my water and drinks ice cold, this stays cold all day, at night I drink all the water and will still have ice in the morning. the only problem is the mouth opening is so small it will only take thin straws, my reusable straws will not fit. but I still love the cup",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra A. Washington",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Keeps my coffee hot!",
      "text": "I did some research before choosing the Ello mug and I have not been disappointed by my choice. I love the retro campy look of the cup and I didn't have to sacrifice any quality. I am a slow coffee drinker so I need an insulated cup that will keep my coffee hot while I'm constantly distracted and running in all directions at work. The Ello cup keeps the coffee hot for several hours (in the amount of time I need to drink it all) and I have been more than satisfied by my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "nicole kilgore",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "BROKE",
      "text": "When I got the cup the lid was leaking where the drinking spout was. The lid wouldn't screw all the way shut. I was also disappointed that it didn't keep things warm or cold as long as the company claimed. I was not satisfied with the purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Katina Carroll",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "I USED TO love this mug",
      "text": "For about a month I loved this mug and received several compliments on it. It kept things hot, but not for so long that it was impossible to drink a hot drink. I was consistently drinking tea, then one day I had a cup of coffee. The taste of the coffee saturated the seals on the cup. No matter how well I washed it or how many cups of tea after, the coffee taste lingered. After a month and a half of use the seal gave out and it started leaking whenever it wasn’t exactly upright, included while I was drinking from the mug. I have replaced this mug and now I use a Hydro Flask for hot drinks.",
      "rating": 2.0,
      "verified": true,
      "author": "Leslie Z",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "cover cannot be cleaned properly",
      "text": "This is a really nice mug with one poor feature that ruins it. I plan to return it. The leak-proof cover mechanism does not disassemble for cleaning. Unless all you drink is water, the slider mechanism looks like it will harbor residue of whatever you have been drinking and get nasty after a while. Hopefully they come up with a better design for the cover in the future.",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 3,
      "publication_date": 20171220
    },
    {
      "title": "COMPLIMENTS",
      "text": "I love this. The problem is, however, the one I was able to identify from its first use in my home: the handle. Today, it broke clear off when tightening the top and after many uses, in all honesty, but? Far too easily and soon. That said? It's so attractive and does exactly what you want a thermos to do: keep it hot; keep it cold; keep it secure. I'm repurchasing because it's become indispensable.",
      "rating": 4.0,
      "verified": true,
      "author": "LesNieces",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Great mug, awkward mouth feel",
      "text": "Keeps coffee warm, attractive design, nice large capacity, and seals the coffee well. definitely a nice mug. I was a bit disappointed with the mouth feel, I think the opening is a bit narrow and somewhat awkward to get your lips around to sip. I also am not a huge fan of the plastic handle. Would recommend, but it’s not perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "KMoody",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Leak proof",
      "text": "Good capacity and keeps coffee hot longer. Fits under single brew makers too. Had to replace one due to broken handle ad Amazon service made it easy. Looks like the lid has been redesigned so it twists on easier and not as tight but still leak proof.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter S.",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Broken handle, otherwise great mug",
      "text": "I loved this mug, reminiscent of the good ol’ times spent around the campfire. Fits in most cup holders, lid is simple and functional, well insulated. Keeps hot drinks hot. Could be bigger, at 16 oz I drink two of these in he AM. Handle broke after a few uses leaving this cup unusable. Disappointing, I will contact the manufacturer to see about a warranty but I won’t hold my breath. Will update review if replacement is issued.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew S.",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "LOVE LOVE LOVE",
      "text": "I LOVE this cup! I have been very picky when picking out to go mugs because I do not enjoy drinking hot beverages with a lid on (I have no idea why, I just don't). This product is perfect because the lid's screw in indention's are low enough to when I drink from the cup without the lid, I have a clean rim to drink from (almost like a regular mug!). The lid is for sure sealed and spill proof, I have tested multiple times. Also, the insulation is good which means the outside does not get hot which is beneficial when carrying. 10/10 would recommend :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie Rae",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Like, every single coffee cup I buy seems to ...",
      "text": "IT HASN'T LEAKED. This is all I want to put in my review. Like, every single coffee cup I buy seems to leak two days after I buy it. Maybe this will leak in a few months... but as it is, it's worth it to just have a non-leaky mug for a month! Looks way nicer than my ancient mug (that doesn't leak, but just looks awful and I keep searching for a replacement), too.",
      "rating": 5.0,
      "verified": true,
      "author": "tj",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Leakproof but tricky to align top with handle",
      "text": "Does excellent job of keeping drink hot. Extremely leakproof. While it ensures no leaking, the only flaw with the screw-on method is that it is quite tricky to get the threads lines up so that when it is fully tightened, the sip hole is at 45 degrees to the handle.",
      "rating": 4.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Perfect for AeroPress while camping",
      "text": "The best size and shape mug for making AeroPress coffee. Keeps my coffee hot and delicious for hours. LOVE this mug. Also takes abuse well - I've used it every day for a year while living on the road and camping, have dropped it many many times, and it still works wonderfully. The lid is not super easy to clean, but you can get all the nasties out, which is way better than most lids!",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Cheaply made",
      "text": "We got two, one for myself and one for my husband. Both handles broke within a week. Got a replacement, handles broke again. Now they both leak, too, after just a few months. Reached out to the company about another replacement, never heard back. Wanted to like these so much, but seriously careless construction.",
      "rating": 1.0,
      "verified": true,
      "author": "Antonin",
      "helpful_votes": 2,
      "publication_date": 20171206
    },
    {
      "title": "Love. This. Mug. I have 3 now.",
      "text": "Love love this mug. Bought the first at target in the dark teal color - was obsessed, then saw amazon had it and in 5 colors - bought the navy and the gray. I’m a nurse and make coffee in the morning before work around 6 am - I usually don’t get around to actually drinking it until 11 am and it’s still piping hot! I get compliments daily from someone on how cute the mug is. If I ever lose it I will replace it - my favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "JaclynB",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Happy with this mug",
      "text": "This is a nice mug. It keeps coffee hot for 4 to 5 hours. Nice shape and size & the handle has a nice grip. I'm not fond of drinking from plastic so I occasionally take the top off to drink. I bought another one and also two more for gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "S C",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "The perfect travel /work cup",
      "text": "Does exactly what they say, absolutely spill proof, the underside of the lid flips for cleaning. & Gosh does it keep things hot of cold. Like for hours.... I put in hot coffee & it was still \"HOT!!!!\" 5 hours later. I will be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Eaton",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "A great mug that is almost perfect",
      "text": "I really like this mug and have used it quite a bit so far. The camp style looks really great and the lid is easy to use and clean. It holds a good amount and is perfect for coffee. The issue I have with it is the handle is plastic, which cheapens the look and feel of it for me. If the handle was metal and seemed a little more secure it would be perfect!",
      "rating": 4.0,
      "verified": true,
      "author": "Yarrow10",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Lid is difficult to remove.",
      "text": "This mug almost has it all. The lid is difficult to get off. When removing it, you naturally want to use the handle as leverage. But the handle starts to shift if you put pressure on it. I’m sure it would rip off if you used it to remove the lid every time. This mug also does not fit in some cup holders. Other than that, this mug is awesome. It keeps liquids cold or hot, and is spill proof as long as it is closed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "color not exactly as shown.",
      "text": "I ordered three of these mugs and still too early to rate. However I have a minor complaint about the color: I ordered gray, dark blue and avalon. The color that is shown for avalon is kind of a blue green but it is hard to tell at first glance that it is not the same dark blue. I would have liked it to be more like the photo shows. Will update after we have used them for a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Big \"O\"",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Lefty Approved",
      "text": "This mug pissed me off when I first used it. It held temps fine & did not leak, but the lid screwed on so I could only use the handle with my right hand. Being left handed, I was annoyed I'd spent so much on yet another right handed elitist household item. Not a huge issue, of course, but if a handle is there, I like to use it. BUT a few uses later, discovered that it's actually double threaded and can go either way you need! Win!",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah B",
      "helpful_votes": 0,
      "publication_date": 20180531
    }
  ],
  "product_meta": {
    "title": "Ello Campy Vacuum Insulated Stainless Steel Water Bottle with Slider Lid, 16 Ounce",
    "rating": 4.5,
    "feature_bullets": [
      "Perfect for the Commute: 16 oz vacuum insulated stainless steel travel mug designed to keep drinks cold up to 10 hours and hot for 5 hours. Enjoy this stainless steel mug that is car cup friendly and completely leak-proof.",
      "Comfy Carry Handle: Convenient handle with Ello Evercork inlay is designed for taking coffee on-the-go.",
      "Guarateed Leak-Proof: Ello's patented sealing slider won't leak and is designed for easy, one-handed open/close.",
      "Peace of Mind: All parts are BPA free. Ello's Lifetime Guarantee protects purchases from authorized retailers.",
      "Combines the vintage aesthetic of a camp cup with modern vacuum insulation and a soft touch handle",
      "New 100% leak-proof slider lid for easy open/close",
      "Vacuum insulated stainless steel keeps beverages hot for 5 hours, cold for 10",
      "All parts top rack dishwasher safe",
      "BPA/BPS free",
      "Easy Cleaning: To ensure product quality and longevity, hand wash the mug. The lid is dishwasher safe."
    ],
    "specifications": {
      "Date First Available": "October 4, 2019",
      "ASIN": "B07YQNQ1PQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Home & Kitchen",
      "Sports & Outdoors",
      "Thermoses",
      "Travel & To-Go Drinkware",
      "Kitchen & Dining"
    ],
    "price": 17.99
  }
}