{
  "website_summaries": [
    {
      "verdict": "A soft, creamy snack to satisfy your sweet tooth and fight off mid-day hunger.",
      "pros": [
        "The bar's center is thick and creamy, while the exterior is soft and chewy",
        "Bars are filling and tasty",
        "There's a wide variety of flavor combinations to choose from",
        "Ingredients are healthy and natural",
        "Bars are soy-free"
      ],
      "cons": [
        "Slightly smaller in size than the original Clif Bar"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I can't choose a favorite flavor.  They are that good!",
      "text": "First, I avoid most nutrition bars. I can't have soy. That negates many of them. Most of the nutrition bars I've tried, taste like cardboard, shoe leather, or like they're fifteen years out of date. These nut butter filled Clif bars are yummy. I use them for a meal replacement bar or for a snack.",
      "rating": 5.0,
      "verified": true,
      "author": "Baird-Greene",
      "helpful_votes": 24,
      "publication_date": 20190407
    },
    {
      "title": "If you love the regular clif bars, you'll really love these!  Better tasting, same great water-resistant, durable packaging.",
      "text": "I LOVE THESE; so much so, that I shouldn't order again because I might eat more than 1 per day! The filling really enhances the Clif Bar experience. I keep these with me during the day to prevent me from those weak moments I might do a fast food drive-thru. These are delicious, and the package is good for carrying without damage. Really love the nut butter filling.",
      "rating": 5.0,
      "verified": true,
      "author": "LillyView",
      "helpful_votes": 18,
      "publication_date": 20170331
    },
    {
      "title": "Disappointed, but tasty",
      "text": "Was really excited to try these, but was really disappointed to only get 11, when the description says 12 count. The main reason I bought this pack was for the chocolate hazelnut butter, and that's the one that is missing!!",
      "rating": 1.0,
      "verified": true,
      "author": "S. Berard",
      "helpful_votes": 8,
      "publication_date": 20200308
    },
    {
      "title": "These are great tasting but have too many unnecessary sweeteners and ingredients",
      "text": "These are great tasting but have too many unnecessary sweeteners and ingredients. I prefer larabar or raw bite, which both offer delicious bars without the added sugars to sweeten their bars. They use fruit instead. The other bar companies also dont use preservatives. Love this bar but clif bar appears too focused on profit margins over health.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180114
    },
    {
      "title": "Good value and quality",
      "text": "I'm a big fan of Cliff bars - especially the nut butter variety. I eat them as a snack and take them hiking / mountaineering. They do tend to make you a lite thirsty, which is a plus because being pushed to drink is helpful at altitude, less so in the dessert!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 2,
      "publication_date": 20200430
    },
    {
      "title": "Yum!!!",
      "text": "Bought these bars for vegan snacking. Haven’t had all the flavors but what I’ve tried are great. Always pack a bar for the trail or long walk. They are even better as they warm up in the backpack!",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie S. McMullian",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "My favorite protein bar!",
      "text": "I LOVE the Clif fruit and nut butter protein bars and for some reason they are really difficult to find and almost impossible to find in stores in my area. I treat myself to a box or two of the cherry berry each month. Expensive but worth it. Great flavor, great texture, it has oats and a variety of nuts. I highly recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Crago",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "yummy but a bit smaller than other Cliff Bars",
      "text": "We are daily Cliff Bar consumers! My husband had a gout outbreak and was searching for any item that was \"tart cherry\" and came across these online. They are delicious. They are a bit different than other Cliff Bars in that the cherries are a filling. They are also just a tiny bit smaller that other Cliff Bars, though the weight may be the same. Overall, we like them and have bought them more than once.",
      "rating": 5.0,
      "verified": true,
      "author": "dawn",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Overwhelmingly artificially sweet",
      "text": "I’m not a fan of this flavor for the nut butter filled bars. The maple almost feels overpowering, too sweet, and somewhat artificial. If you love bars that taste like candy this might be for you. However I really prefer the coconut and almond butter as it isn’t as sweet.",
      "rating": 2.0,
      "verified": true,
      "author": "Lyn",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great tasting bars.",
      "text": "I purchased these on Amazon because they are much cheaper than in the store. I enjoy some flavors more than others but overall I like them all. My boyfriend loves them too. I decided to subscribe and have them delivered regularly because they are some of the best tasting energy/health bars I have tried and they are easy to grab and go. Overall very satisfied with the taste and the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Mutka",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Very satisfying mid ride",
      "text": "I cycle and on some long rides I'll have to snack on something. I thought the nut butter would MAYBE be a problem but taking a quick swig of water after eating one of these...feels great. So satisfied. These also taste really good. Not saying its bad but my least favorite is the cherry. A friend of mine loves the cherry though so to each their own. They can be a little crumbly. Wish they were a little bigger but at this size I can just shove it in my mouth...thats what sh-",
      "rating": 5.0,
      "verified": true,
      "author": "mattifus",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Not that great",
      "text": "All I can say is just no these were Nasty, I hope and up the package and I thought it was a turd in all honesty. They are extremely dry and wild this filling has a good flavor the outside is chaulky and bone dry",
      "rating": 2.0,
      "verified": true,
      "author": "Julie R.",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "The maple is strong with this one.",
      "text": "The maple is very potent. If you dont want to smells like your nose is swimming in maple syrup, breath through your mouth and not your nose while eating. Otherwise texture is great and definitely satisfying if not a bit sweet.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Delish",
      "text": "These are delicious and a great breakfast item, for when I am on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Beau Honig",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Fuel for Biking",
      "text": "I tried the smoothie filled during a mountain biking clinic and liked those. I decided to try the nutt butter filled and like the coconut almond ones even better! I like to use them on longer rides. I’ve had bad luck with cramps or stomach issues post eating a bar on rides but not with that ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda M.",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Quarantine Food",
      "text": "Sent this to my son out of state to make sure he had something to eat with the quarantine. He said he ate all of them. So, it must be okay. He would have told me if he didn't like them.",
      "rating": 5.0,
      "verified": true,
      "author": "amyeileen",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Clif Nut Butter Filled - Coconut Almond Butter",
      "text": "This is the most delicious protein bar I have ever tasted. Other protein bars pale in comparison to this one. I have tried so many over the years and the sumptuous almond butter filling in this bar gives it just the right texture and taste. YUMMY!! I have found the perfect protein bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Jilly",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "What happened?",
      "text": "This review reflects the way the bar arrived. I these bars all the time and I love these tart cherry and cashew nut butter bars that would otherwise receive a 5 star rating. But... After being delayed in transit for 2 days my Clif bars arrived with the box practically torn to shreds. The padded bag that the opened box was in was in perfect condition. Not sure where these bars got delayed or what caused this destruction.",
      "rating": 3.0,
      "verified": true,
      "author": "Joy A.",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Yummm",
      "text": "I discovered these in a gas station (the tart cherry one) and loved it so much i came to Amazon and ordered this variety box. I ate the whole box in two days 🤦 they are so yummy",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Yummy",
      "text": "I like the variety of flavors that you get in this box. They all taste good to my family. It's a quick snack that will fill you up. Also good to stick in lunchboxes. Plus I like the box that it comes in. Easy for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Leanne Graham",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Best tasting Clif bar yet!",
      "text": "Wow these are the best Clif bars we've had. They don't taste like chewy pasty cardboard. they actually are super tasty with that buttery flavor in the middle. almost seems like a dessert bar. Not to mention it really gives you a kick of energy...especially when driving.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Mc",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Came squished!",
      "text": "The box came totally squished down, and one of the flaps is open. Some of the nut butter bars got squished along with the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Megan L. Cowan",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Gross. Yucky.",
      "text": "Awful. Awful. Awful. Flavor was wayyyy offfff. Tasted like bland butter. None of these were worth trying nor did they taste like a Clif bar.",
      "rating": 1.0,
      "verified": true,
      "author": "DP",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Hoping this item is continued. Great lunch snack!",
      "text": "My boyfriend absolutely loves these. I packed them in his lunches. Right now it says they are no longer in stock. I hope this is resolved quickly, because I have this on my auto-ship.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri A. Brandt",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Flavors are not good",
      "text": "Disappointed with the flavors. The only good ones are peanut butter.",
      "rating": 1.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "These are really good",
      "text": "I tried all the new Clif Nut Butter Bars. This Tart Cherry is my favorite, along with the Maple flavor. Those are the two best, by far, and they're equally good in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Gentile",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "The surprise flavor is definitely a surprise",
      "text": "Eat these all the time and took a gamble on the variety pack with surprise flavor. The surprise was an unfortunate one though. They included a \"tart cherry berry\" fruit smoothie filled bar instead of a nut butter filled variety. Personally though the flavor was terrible, which is fine and subjective, but was more frustrated that it was a different product altogether. Just be aware before you look at making a purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Good flavor, creamy peanut butter",
      "text": "Good flavor, creamy peanut butter, chewy oat meal cookie outside. More substantial than some of the other health bar options though it has more calories too.. but I would rather eat 1/2 of this bar than one of the Chia seed bars.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Truly the greatest Clif bars ever known to mankind",
      "text": "These are truly the greatest Clif bars ever known to mankind. The coconut and almond butter flavors go well together, the bar has a nice texture, and it's also very satisfying. I'm a runner, and I usually eat one of these about 2-3 hours before a race. It works well for me, and I've found myself just eating these as snacks, or as part of a meal, because they're just really really good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "Filling",
      "text": "These are filling, which is great. Love the variety they have. Good snack option, or for while hiking.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "wrong info",
      "text": "Quit saying \" it was handed to a resident\" nothing could be farther from the truth---",
      "rating": 3.0,
      "verified": true,
      "author": "BarbaraLWalker",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Magical combinations of goodness.",
      "text": "These bars are magical, they hit the spot for a between meal snack or as part of a quick meal on the go. I'm reordering these because unlike regular Clif bars (which are good) these are filled with Almond butter, yum!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Myers",
      "helpful_votes": 2,
      "publication_date": 20170308
    },
    {
      "title": "Better than the original Clif Bars",
      "text": "The nut butter Clif bars are really tasty. Especially the peanut butter filled ones. That is, IF you like peanut butter... 😋",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Real healthy and tasty!!!",
      "text": "I love the coconut flavor but the other flavor is good too it healthy and better than a lot of the bars I've seen out there :) over all I'm satisfied with this product",
      "rating": 5.0,
      "verified": true,
      "author": "Zhou",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Dont wait... order now!",
      "text": "These bars are so good. I've introduced them to four people so far and they all love them. This is a great price as well. In the store they are double the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tobias",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "I absolutely love the filled ones especially this flavor",
      "text": "I absolutely love the filled ones especially this flavor. They are so expensive to buy individually. We discovered them when Costco had them as a special item and luckily Amazon has the 12 box. Prime is one of my favorite things.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "A tasty clif bar with less sugar!",
      "text": "i like clif bars but they can sometimes be a sugar-bomb. These nut-butter clif bars are smaller, Tastier, and have a more milder sweet taste that i love without being saccharine. they are more crumbly than normal cliff bars, probably due to the peanut butter. Overall, a great energy bar.",
      "rating": 5.0,
      "verified": true,
      "author": "kennethchau",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Expensive but good",
      "text": "Very tasty. I only tolerate energy bars but these are above average.",
      "rating": 5.0,
      "verified": true,
      "author": "swassociates",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Good bars, good price",
      "text": "At around $1 a piece, they are not too bad a deal with free shipping. Quality and taste are good, and they are ORGANIC, which means a lot in this day and age.They are a bit small, about 4 bites. 11g of fat is pretty high for a small bar.",
      "rating": 4.0,
      "verified": true,
      "author": "Artism",
      "helpful_votes": 2,
      "publication_date": 20170510
    },
    {
      "title": "Oh man are these DELICIOUS. I bought them because ...",
      "text": "Oh man are these DELICIOUS. I bought them because I never get a real chance to eat lunch and they fit the bill. I will say they are smaller than the normal cliff bar but the coconut almond butter really hits the spot for me.",
      "rating": 5.0,
      "verified": true,
      "author": "bakeyou",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Yum",
      "text": "Yuuummmmm! Soft, delish, yummy, I'd buy again. Bummer my son got to them😜 he ate almost all of them before me😃",
      "rating": 5.0,
      "verified": true,
      "author": "Lorre lvs chocolate!",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Tasty and healthy snack",
      "text": "I have been purchasing these for over a year now. They are a great snack, and I am soy sensitive, and unlike other Clif bars, these don't have soy in them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim D.",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Delicious",
      "text": "I love the nut butters. The flavors are rich and enticing. I wish they had less carbs, but they are truly good! And good value!",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa Seals",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Cherry is the finest of the flavors",
      "text": "Product arrived when expected and these bars are quasi healthy and certainly double as a not too sweet dessert. Win-win.",
      "rating": 5.0,
      "verified": true,
      "author": "Patron-of-art",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Delicious!!",
      "text": "I didn't think it was possible to improve the original Clif Bar but I was wrong! These are seriously amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Felicia B",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "The best Cliff bars!",
      "text": "Better than regular Cliff bars because they are tangy and less sweet. Nice contrast with nutty filling. My favorite flavor.",
      "rating": 5.0,
      "verified": true,
      "author": "CHEF PANTS",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Small but ridiculously good",
      "text": "I keep telling myself I'm not going to get these anymore because they are higher in calories then what I prefer for such a small bar but they are very tasty.",
      "rating": 4.0,
      "verified": true,
      "author": "OlyNomad",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Great small snack that keeps you full",
      "text": "I love these--they make a perfect \"in between\" snack between lunch and dinner so I don't overeat. They are smaller than the original Clif bars, so they don't feel overindulgent with them being filled with nut butters.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Tastes great",
      "text": "As far as commercial bars go, these are some of the best I've had and I've tried too many to name.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Expensive",
      "text": "I love these but they are quite expensive. Try Kind bars - they taste great and are cost effective.",
      "rating": 3.0,
      "verified": true,
      "author": "Biff",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Worth the price!",
      "text": "My favorite energy bars! I love that it’s made with oats and such because it helps with my breast milk supply. Just a tad more expensive then I’d like to pay, but still worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah Guilmette",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Really good",
      "text": "With Clif bars I usually like them initially and then I dislike them more with each bite to the point where I'm forcing myself to finish it by the end (and sometimes I hate them from the first bite). These are surprisingly good. I like the mix of coconut and almond butter. It has a good taste and your jaws aren't exhausted by the time you finish the bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Doe",
      "helpful_votes": 8,
      "publication_date": 20170322
    },
    {
      "title": "Overly strong maple flavor",
      "text": "Too strong and sweet on the maple flavor. Wouldn’t buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Kane",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Itty Bitty",
      "text": "Very tasty, much more so than the regular Cliff bars. However, like a lot of products nowadays, they are really really small. Like someone took a shrink gun to them and threw them in the dryer tiny. I really doubt they could make them any smaller and still sell them as a “bar”. Really not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Joe Durishin",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Love these!",
      "text": "use these to fill gaps between meals when hungry or on the go!",
      "rating": 5.0,
      "verified": true,
      "author": "Derek",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Amazing love them",
      "text": "I love these things they are addictive , and I could eat the entire box.",
      "rating": 5.0,
      "verified": true,
      "author": "Curvy Girl",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Great variety",
      "text": "I stock up on these every month best snack bars, love this variety collection",
      "rating": 5.0,
      "verified": true,
      "author": "Check Mark",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "My fav",
      "text": "Great price. These are my favorite CLIF bar. The brick & mortars sent to have stopped carrying them. Now they come to me! Always fresh & no more hunting or disappointment.",
      "rating": 5.0,
      "verified": true,
      "author": "Navy Blue Frenseca",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Yum!!",
      "text": "Love these! Lots of great flavors, so you never get bored.",
      "rating": 5.0,
      "verified": true,
      "author": "TikiMonger",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great variety for snacks!",
      "text": "The variety pack is a great way to go! Some hard to find flavors and all very tasty. Great option for a quick snack when on the go!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Okay, not great",
      "text": "Much prefer the regular Clif Bars but this isn't bad. I only tried the one flavor.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Johnson",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Can’t go wrong!!",
      "text": "These by far are our favorite protein snack! We love the almond butter & coconut together...they’re delicious!",
      "rating": 5.0,
      "verified": true,
      "author": "Jayna DiGenova",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "My New Favorite",
      "text": "I’m not a maple person by any stretch but these were delicious",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Delicious, especially for being gluten free!",
      "text": "I absolutely love these bars! I have a lot of dietary restrictions and have tried a lot of different protein/energy bars and these are by far my favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "No guilt snack",
      "text": "I like that it is a quick on the go grab snack that tastes good. Peanuts are not good for inflammation and are in so many protein snack bars.",
      "rating": 5.0,
      "verified": true,
      "author": "Zoey12",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Great taste and easy on gut",
      "text": "Love these. Great flavor and sit well on my stomach during cycling activities. They do dry out if you keep them too long though.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Great Variety Pack",
      "text": "Great deal and variety. Will buy again when I run out.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Chichester",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Quick satisfying energy!",
      "text": "Gently sweet ,easy on digestive tract ,very tasty,full of energy.easy to carry with one for understandings attacks!! Very satisfying !!!",
      "rating": 5.0,
      "verified": true,
      "author": "teresa maguire",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Great on the go!",
      "text": "Great tasting, filling, good for a quick boost of energy",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Axford",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "These are healthy",
      "text": "I like that thee are healthy, but do not like the taste of these!",
      "rating": 3.0,
      "verified": true,
      "author": "MayaTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "I love it",
      "text": "They all taste very yummy. I like to keep one on my work bag. Never get hungry.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "A must to squelch those sweets cravings.",
      "text": "These are probably the best tasting Clif bars out there (although I admit the cool mint chocolate one is all time favorite). The peanut butter chocolate is my favorite of the three flavors offered on Amazon. For this price, will continue to buy them! Saves about $.50 per bar compared to buying them solo retail.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Wong",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Best CLIF bar ever!",
      "text": "There is no bar that comes even close to the deliciousness of the CLIF Nut Butter Filled - Coconut Almond.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuri Dogandjiev",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "old OR not fresh",
      "text": "old OR not fresh AGAIN... I love these usually ...unless they aren't fresh. these usually are good, but not this order",
      "rating": 1.0,
      "verified": true,
      "author": "tlem",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "I would not recommend this flavor to anyone",
      "text": "The taste was average and resembled some sort of grainy product. I would not recommend this flavor to anyone. The coconut taste was not even there.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr.Bula",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Great product, it doesn't contain as much sugar and ...",
      "text": "Great product, it doesn't contain as much sugar and carbs as the other cliff bars. This has more natural fats which I prefer as I would crash with all the sugar that's in other cliff bars. This taste great as well",
      "rating": 5.0,
      "verified": true,
      "author": "Monument",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "great product",
      "text": "these are my fav and cheaper than buying in store",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Variety Pack Favorites",
      "text": "favorites were the caramel chocolate, chocolate hazlenut , and maple almond.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Lee",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Everything to like. Moist",
      "text": "Everything to like. Moist, flavorful, not grainy. Best part good source of protein with little fat and sugar. Dislike?- bar is small. What it lack in size it makes up in flavor",
      "rating": 5.0,
      "verified": true,
      "author": "ole doc sarge",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Good but small for the price!",
      "text": "I was lucky enough to try some samples of these before purchasing and YUM!! I also love the chocolate peanut butter ones. WARNING: they are smaller than the package suggests - about 2/3 the size of a normal Clif bar. But I think that's how they get the calories to stay about the same.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161110
    },
    {
      "title": "Delicious",
      "text": "These are delicious and a great snack after a workout or lunch replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Delicious",
      "text": "Good for a snack or when I don’t want a large breakfast",
      "rating": 5.0,
      "verified": true,
      "author": "Alia",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "wow my new favorite bar LOVE the coconut",
      "text": "wow my new favorite bar LOVE the coconut .... chocolate peanut butter good to .... and yes they are full of creamy peanut butter ...yummy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Taste amazing",
      "text": "These taste amazing and are cheaper to buy here in bulk than at the grocery store.",
      "rating": 5.0,
      "verified": true,
      "author": "GTV4318",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Love it! I eat this for dessert",
      "text": "Love it ! I eat this for dessert !! great tasting and much healthier than candy or other sweets. Another fine Cliff product !!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Yum!",
      "text": "This is my favorite Cliff Bar and by far, the best flavor! These are terrific for a late night snack or a quick snack on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Chel Mare",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "These things are tiny",
      "text": "About half the size of a regular clif bar probably will not buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Game Changer",
      "text": "These are addicting! CLIF bar really stepped it up a notch with these bars. This flavor is my favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Good deal!",
      "text": "Being past the shelf life date meant nothing, tasted great!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "LOVE THESE!",
      "text": "This was exactly as described and it's cheaper than buying it in the store. This is my absolute favorite flavor. I would purchase this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Very good.",
      "text": "Good taste and texture. Make a good breakfast or quick snack.",
      "rating": 5.0,
      "verified": true,
      "author": "dvdjhll",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Same quality as grocery stores but cheaper!",
      "text": "Love theses bars. Can’t eat regular cliff bars anymore! Cheaper than the grocery store!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna white",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Really like these.",
      "text": "Really like this flavor. Make great mid afternoon energy hits.",
      "rating": 5.0,
      "verified": true,
      "author": "dvdjhll",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Good for on the run",
      "text": "I really like these. Cant taste to much coconut though",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "I need even more flavors",
      "text": "230 calories, very sweet. These are so delicious they are becoming a problem for me.",
      "rating": 5.0,
      "verified": true,
      "author": "S@HD",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "LOVE",
      "text": "High in carbs but all clif bars are. These are my fav clif bar of all time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy M.",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Yummy!",
      "text": "Very yummy and filling and actually cheaper than buying in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Aurora",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Great flavor",
      "text": "This is my favorite flavor of the nut butter bars. Smooth and delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Great snack bar!",
      "text": "My daughters love the smoothie filled CLIF bars. A great after school, between sports or any time snack.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "I eat these everyday",
      "text": "These are my favorite Clif bars of all time. They're delicious and the tart cherry flavor never gets old. I am a regular purchaser of these and they are my favorite Clif bar by far!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201015
    }
  ],
  "product_meta": {
    "title": "Clif Bar Nut Butter Filled - Organic Snack Bars - Coconut Almond Butter - (1.76 Ounce Protein Snack Bars, 12 Count)",
    "description": "Flavor Name:Coconut Almond ButterThere’s no shame in eating peanut butter straight from the jar (is there?), but when it comes to on-the-go satisfaction you just can’t beat the perfect portability of CLIF Nut Butter Filled Snack Bars. Made with delicious peanut butter, hazelnut butter, or almond butter filling and 6–7g of plant-based protein, they’re purposefully crafted to deliver a balanced mix of satisfying nutrients with a low-glycemic index. They’re even USDA organic and made from non-GMO ingredients, so they’re not just better for you, they’re better for the planet. With seven deliciously filling flavors to choose from, your cravings just don’t stand a chance.",
    "rating": 4.6,
    "feature_bullets": [
      "Contains twelve 1.76oz CLIF Nut Butter Filled Coconut Almond Butter Snack Bars. Each bar contains 6g of protein (10% DV) and is certified USDA organic.",
      "A richly satisfying organic snack bar with a delicious, coconuty outside and creamy almond butter inside.",
      "DELICIOUS FILLING: Organic snack bars with wholesome oats and real peanut butter, hazelnut butter, or almond butter inside. Available in craveable flavors like Chocolate Peanut Butter, Chocolate Hazelnut Butter, and Coconut Almond Butter.",
      "QUALITY INGREDIENTS: We use only plant-based protein from nut butters and pea protein, USDA organic and non-GMO ingredients, and no artificial flavors. Why? Because we care about the planet, and we’re committed to doing our part to Make It Good for future generations.",
      "PERFECT ANYTIME SNACK: A balanced mix of plant-based nutrients, including 6–7g of protein (9-10% DV), for a satisfying snack that’s perfectly portioned to help cure your cravings."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9 x 5 x 2 inches; 1.32 Pounds",
      "Item model number": "168002",
      "Department": "Unisex-adult",
      "Date First Available": "April 30, 2016",
      "Manufacturer": "Clif Bar",
      "ASIN": "B01F0FC8X6",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Nutrition Bars",
      "Sports Nutrition",
      "Endurance & Energy Bars",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 21.82
  }
}