{
  "website_summaries": [
    {
      "verdict": "The Gear Fit 2 is a great-looking feature-packed fitness band, but its design isn't always perfect for hardcore workout warriors.",
      "pros": [
        "The Gear Fit 2 has a slim design with a beautiful curved AMOLED display that can show smartphone notifications and weekly charts",
        "It also has GPS, heart-rate monitoring, onboard music storage for up to 1,000 songs, all-day fitness and sleep tracking, and automatic exercise detection"
      ],
      "cons": [
        "Short battery life",
        "The accuracy of the heart-rate sensor fluctuates during workouts",
        "You can't wear in the shower or while swimming",
        "No iPhone support",
        "Samsung's S Health app can be confusing"
      ],
      "aspects": {
        "Design": 8.0,
        "Battery": 6.0,
        "Performance": 7.0,
        "Software": 7.0,
        "Features": 9.0
      },
      "publication_date": 20160610,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Don't sweat on it!",
      "text": "Lasted a few months, then screen went out. Sent it into Samsung for warranty repair, they in turn sent it back disassembled and said it was un-repairable because of water damage. Although the watch had no physical damage and looked pristine, I guess the tech decided the screen stopped working because of moisture. I never even washed my hands with the watch on. The only moisture it was ever exposed too was sweat. So the folks at Samsung are pushing a wearable activity/sports watch that has no warranty or guarantee against sweat... Waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "MacDeth",
      "helpful_votes": 25,
      "publication_date": 20180327
    },
    {
      "title": "Known issues with charging/power, should have researched first.",
      "text": "Just opened the package to charge the watch before wrapping as a gift. Found out the unit does not charge and would not power on. It was new in box so it was not the fault of the seller. Upon further research I found many forums with people experiencing the same issue going back over a year. Amazon support was quick to handle the RMA process. I generally like Samsung, but they dropped the ball on this model. Going to try the newer pro version and see if it does any better. It's a shame as the unit feels premium and durable while handling it. Shame it wouldn't power on.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael A. Mast",
      "helpful_votes": 17,
      "publication_date": 20171217
    },
    {
      "title": "I love the Gear Fit2 and have suggested it to my ...",
      "text": "This is my second fitness tracker, I had the Fitbit Charge HR for about a year but the band started irritating my skin. I love the Gear Fit2 and have suggested it to my friends who also love theirs. I love that you can personalize the screen, use the \"find my phone\" feature, and that it has power savings option. If its on power savings mode, I get about 2 to 3 days wear before needing to charge. If I don't use the power savings, I have to charge it daily which is why I gave 4 stars. Overall very happy with the product and think it is well worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Dakota Blue",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Doesn't work at all as promised",
      "text": "Samsung and Spotify do NOT work on this product. Apparently according to hours with both helplines they are both very aware that their apps aren't currently compatible, but are still selling the product and service like they are. You can't even find the app on the Galaxy site. Complete waste of money and a HUGE waste of TIME. DON'T BUY THIS FOR SPOTIFY. Update - two months later and still they have not updated software to make Spotify available - both Spotify and Samsung entirely unhelpful, but at least Spotify responded..Samsung clearly doesn't intend to support this product.",
      "rating": 1.0,
      "verified": true,
      "author": "ALF",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Beautiful screen. Built in GPS",
      "text": "Beautiful screen. Built in GPS. Heart monitor. Wireless that automatically stays connect to the phone, even out of Bluetooth range, so at work I can still receive texts and alerts anywhere on the same wireless network. Responses to texts, can be simple messages preprogrammed ahead of time on the Samsung Software, but available on the watch when texts are received. After runs or walks, the watch syncs automatically when the software is launched. Heart rates, altitudes ect all noted by date, on line graphs. Also water resistant ( at least in the shower ) What I'm saying is that for this price point , it's a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Just what I wanted!",
      "text": "Runs great. Getting my texts on my watch has been wonderful and it even allows you to make simple replies.I love the feature that allows it to connect to my WiFi when I get out of range of my phone. It hops back and forth between Bluetooth and WiFi (seamlessly) as I move about my house. The colors are bright and the screen is very crisp and easy to read. It is very comfortable and easy to navigate to what I want. I am very happy with this purchase and the price was excellent too.",
      "rating": 5.0,
      "verified": true,
      "author": "Camerons",
      "helpful_votes": 2,
      "publication_date": 20170629
    },
    {
      "title": "Don't buy it, just don't!",
      "text": "I purchased this 1.5 years ago and immediately it fell off my wrist and broke (the band is terrible and I had to buy a gadget to keep the band from falling off). Got that fixed at $79 and a year and a half later the watch stops charging or the charger stops charging. I called Samsung and got no help at all. No troubleshooting. Was just told to go out and buy a new charger and then I'll know if it's the charger or the watch. Thanks, but no thanks. Samsung has the worst customer service. DO NOT BUY THIS PRODUCT!",
      "rating": 1.0,
      "verified": true,
      "author": "SD",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "DO NOT BUY!",
      "text": "This horrible smart watch won't keep a charge. I have contacted Samsung support for weeks with no success. At first it only happened once or twice a week, but then it got worse and worse until now it won't charge at all and is basically a black wrist band. I've researched this and it is a common issue with no real resolution. DO NOT BUY!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Trace",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Decent, some issues, great starter smart watch",
      "text": "After 18 months the screen died. I've had multiple ups & downs w/ this product. Ranging from battery issues, floor tracking, the connections that charge the watch give my skin a rash (fixed w/ a small piece of bandaid, annoying to replace after a charge, but worked). Over all, i have been happy w/ it. I wear it in the shower & bath, its held up to quite a bit of abuse, I've been swimming w/ it. I originally got it over the 2016 Xmas season so the price was reasonable (on sale) Upgrading to the Gear fit Pro. Hoping this product lasts longer.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Cherry",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Not turning on",
      "text": "I bought this for my mom today, I have one from a while back I've been using but when I got the watch, I tried charging it and the charger didn't work. No problem, I can use my other one for my watch. But it's not wanting to turn on. I looked up fixes and it seems to be common enough and easy to fix if you plug it up to a computer port first, then charge it on an outlet. I'll try and update this asap. 3 stars because I know how good they are without this problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob Hardin",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Nice features but is it tracking fitness accurately?",
      "text": "My fitbit gave up on me and I was going to order another one when I went to lunch with a friend who had this watch. I thought this would be better, to sync with my phone and get texts as well as track my fitness. I like the watch and a lot of its features, but it does not record stairs accurately. .I have hiked and have gone up and down the stairs at my house and the most it has recorded is 2 flights of stairs. I don't have time to call and talk with tech support about it, so I am just living with it for the time being.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy from Colorado",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "LIve Active.",
      "text": "Received and a month later the LED light had gone out, the item was still under warranty though so I was able to get it fixed for free through the manufacturer. This did take a while to get back though (about 2+ weeks) I haven't really added anyone for the support group because not many people have this model. Tracking seems semi- accurate. You can also adjust the settings to buzz you if you are sitting too long. all in all it is a good motivational tool. I love the music feature. I use it with my wireless headphones.",
      "rating": 3.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Connectivity issues",
      "text": "Having trouble with the device staying connected to phone. The step counter and other fitness counters lose their connection often. Feature says tap to try reconnecting. When you do, the screen goes black. Only way to reestablish connection is to perform soft restart on device. When you do this, you lose data on device, but data is backed up to phone. Read about this issue on several forums after I purchased. My bad. There have been several software upgrades since I got the device. Samsung usually quietly fixes issues in subsequent updates. Have not had a problem for a couple of days now. Maybe fixed, maybe I just jinxed it. Will see.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Fehrmann",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Dissatisfied so far!",
      "text": "First thing, its a great looking watch but it doesn't act like one. Why doesn't it want to charge, why does the face freeze? It doesn't always count my steps nor actual steps. It says water resistant but I wouldn't dare allow it near water, not going to risk it. I'm very disappointed so far, it makes no sense for something to cost so much and act so cheap!! I'll give it another week, if it continues to fail me its going back.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs. Rowsell",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Good device, bad app",
      "text": "This is a great product. Samsung has really bad app with the bracelet though. It doesn't track my workout automatically, and it also doesn't track right when i pre-select the workout (simply not enough types of workout built in, which is a pity since this has a heart rate monitor). I can do hiit for 50 minutes and it will say i burnt 100 calories.and the record of the activity level will remain \"light.\" If you want accurate calorie count and track workout intensity of various trainings, i suggest installing UA Record to the device. it works wonders.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "AWESOME!  Great quality product, thanks!",
      "text": "Just like new, came with the charger! Works great and functions like it should. No problems with battery life or anything. Lasts a couple of days, and charges really really fast. Good fit, not too big like a lot of the other watches. You can control your Spotify with it as well! Its pretty cool WAAAAY better than buying one through T-mobile for $300 or whatever they wanted to charge me in the same week.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey M. Gile",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "3 months? Cracked Sleeping? 90 Floors? HR OK.",
      "text": "Less than 90 days never swam with barely got wet no hard labor, watch Face Cracked Sleeping (which is also terribly wrong) & it continues, Floor Tracker is Ridiculously off. When You've went 20 it'll Say 90. HR Monitor seems pretty accurate, yippee I'm not 90. Steps Tend To Rip you off a bit, have a feeling it's how much you swing your Arms,which lets be honest No Tracker Can gauge distance proper or Step Count accurately even with Bluetooth. Can't return & it's $40 cheaper now. Sorry Samsung, I'll stick to Phones Under 7.",
      "rating": 2.0,
      "verified": true,
      "author": "hdfsjdfjfdckfj",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Dont waste your money",
      "text": "Worst Samsung item I have seen. Does not come with a clasp, so you can loose your $100 watch pretty easy. The charger does not come with the outlet box, so you either have to have a extra one or use your cell phone box to charge your watch. I have not have this watch for even a year and it is not working properly. It stopped counting my steps.. just contacted Samsung and sended to repair, but they are telling me the watch is an International watch and is not cover in the guarantee. So, now.I am stuck with a watch that does even work.. What a waste of money..",
      "rating": 1.0,
      "verified": true,
      "author": "Jorge Vidal",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Deserves 5 stars, just dont lime the \"floor\" tracking",
      "text": "My fiance got this tracker first and needed someone to compete against. So I naturally that meant I had to get one as well. I honestly couldn't be happier with a watch, or fitness tracker, it has auto sensor to track walks and bike rides after a while of activity and even let's me know when ive been inactive and gives me strething tips. It connects effortlessly with my samsung galaxy s5 and the Samsung Health app. I would give it five stars and it is very much deserving of all 5 but the \"floor\" measure gets off if it gets wet sometimes and really I just don't like the floor sensor which is why I'm rating as a 4",
      "rating": 4.0,
      "verified": true,
      "author": "HuntingOrange",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "I really loved this watch at first",
      "text": "I really loved this watch at first. It has a sleek design, fits comfortably, and the functions are great for the price! The compatibility with my Samsung smart phone is obviously seamless. The problems I've had with it are the charging of the battery. The charging dock is only designed to be plugged into a computer. I want to be able to charge it with a generic wall adapter!!! Also when I place it on the charging dock it won't charge more that 90% of the time. I have to get it positioned just perfectly on the dock for it to make electrical contact. Great watch if it will actually take a charge.",
      "rating": 3.0,
      "verified": true,
      "author": "TherinPML",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Poor quality. Mine broke within 3 weeks",
      "text": "Poor quality. Mine broke within 3 weeks. Samsung refused to fix it under warranty. They mandated that the receipt had the watches serial number included. This is something that the retailers do not do. Also, I had to charge the watch every day. I purchased a fitbit and it does the same things and lasts a week on a charge. Buy the fitbit.",
      "rating": 1.0,
      "verified": true,
      "author": "Bernie Wilburn",
      "helpful_votes": 3,
      "publication_date": 20170629
    },
    {
      "title": "Keeps disconnecting form phone and won't reconnect without factory reset.",
      "text": "At first it was very inaccurate. I would walk 100 steps and it would count around 142. So I went through the software and upgraded the firmware. Now it counts accurately but if I ever walk away from my phone it will disconnect and won't reconnect without a factory reset. Very annoying. I noticed that many people online have this same problem with the newest firmware and I can't find any acknowledgement from Samsung or plans to fix it.. Oh well, otherwise it seems like a great watch / fitness tracker.",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "perfect gift for preteen",
      "text": "gift for 12yr old daughter. she really liked mine. probably best thing we could have gotten for summer. easy for kids to become sedentary with all the gadgets around. we use google family Link for daily usage limits on her cell. linked her gear, and she views it more like a \"game\" with footstep challenges and the samsung workout trainer app. family calendar reminders and timer will be great for school year.",
      "rating": 5.0,
      "verified": true,
      "author": "Denver area",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Bracelet Quality.",
      "text": "I loved the watch however the bracelet's quality leaves a lot to be desired its honestly not the best, it comes off very easily and due to that I lost it yesterday. I have spoken with friends that also bought this watch and they have had the same issue with it. I tried buying other bracelets in the local Samsung store but they were all the same. Frankly, I wouldn't recommend this product at all, now I have to buy a new one and I'll take my business elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Cesar Moreno",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Liked that it synched with my Galaxy S8 but since ...",
      "text": "Liked that it synched with my Galaxy S8 but since day one its never really worked smoothly. Screen would often freeze and although it tracked milage and elevation well, I could never really trust the info 100%. Had it for a little over a year and it just died this morning. It won't hold a charge and the screen won't turn on. The warranty is 12 months and mine barely lasted that time frame. Disappointed because I'm a huge Samsung advocate. I love their phones so I thought the Gearfit would be of the same quality..",
      "rating": 2.0,
      "verified": true,
      "author": "Itzelp ",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "IM SO GLAD I BOUGHT GEAR FIT 2",
      "text": "***update my watch stopped working and no resolution yet **** really Love my Gear Fit 2, so glad i chose this over fit bit charge 2. the screen is BEAUTIFUL and love getting ALL of my notifications, even Facebook and my work email comes through. only 4 stars because getting it going was a pain...couldnt get it to charge on the cradle but keep putting it on and off and reconnecting (using my usb on laptop). i was on all the forums and one review siad its a safety feature on the battery to protect from malware. sooo dont let it go dead.",
      "rating": 4.0,
      "verified": true,
      "author": "Tammy M Bayless",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Just ok ,  battery life and clasps  hurt",
      "text": "Overall underwhelmed Pros Screen is beautiful, customized screen faces are nice Accurate for distances Cons Battery life is 1 day, hinders my use as a watch Band is very easy to knock off if you are doing anything in tight quarters , average several times a week when watch comes off on me. Is relatively high maintenance , need to change settings to optimize battery and turn screen and notifications on and off",
      "rating": 3.0,
      "verified": true,
      "author": "MReader",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "POOR PRODUCT INFORMATION",
      "text": "POOR PRODUCT INFORMATION.Purchased this watch in June. Had to send the watch to Samsung for repair because an update messed up the watch. Samsung claims they can't fix the watch because the watch is a Canada Model. Nowhere on this product information does it say anything about this. Also, was told by the Repair Center in Canada that the warranty for this watch has been expired for some time...I'm supposed to have 7 months left on my warranty. Pretty sure now that this was a \"used\" watch...Now I am out the watch and money. BE Careful!",
      "rating": 1.0,
      "verified": true,
      "author": "Tanya D.",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Great, While it Works (Dies after 1 year)",
      "text": "I actually love the product.... however, this is the second time I've ordered a Gear Fit from Amazon... and the second time it just DIED after 1 year. This time it was 1 year and 13 days. Samsung support was a joke. Their only advise was to talk to seller for replacement... Have you tried getting in contact with Amazon lately. Without the \"Return\" option, getting help from Amazon is next to impossible.",
      "rating": 3.0,
      "verified": true,
      "author": "MissDebi",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Stopped Charging ~100 Days After Purchase",
      "text": "I purchased this product on August 19th. It worked okay, though not always counting the stair elevations. The features were good overall, though sometimes it was hard to switch between exercises on the watch. Shortly after the 90 day return window, the watch stopped working. It no longer charges and won't turn on. I never wore it in the shower, and I never dropped it. I'm very disappointed in the short lifespan and inability to return.",
      "rating": 2.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "It's only been 6 months and I hasnt had any water damage or dropping/smashing or anything like that. Very frustrating",
      "text": "Inexplicably died on my wrist with normal wear for no reason. Won't charge, won't respond. It's only been 6 months and I hasnt had any water damage or dropping/smashing or anything like that. Very frustrating. I've tried fixes and ideas from several different forums and nothing seems to bring this watch back to life. It was an amazing watch until it decided to quit.",
      "rating": 1.0,
      "verified": true,
      "author": "NICK SANDOVAL",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Junk",
      "text": "I have to charge every night. Sometimes it doesn't even last a day. I have everything turned off except for messaging. So i cant even really use it. At least not what I purchased it for. Also does not work if you are shopping with a buggy",
      "rating": 1.0,
      "verified": true,
      "author": "kiera giarraputo",
      "helpful_votes": 3,
      "publication_date": 20170626
    },
    {
      "title": "Like it!",
      "text": "I purchased this to replace a fitbit that died after one year of use. I like this because it connects to my phone and I can see who is calling and can read emails on it. The fitness capabilities work well for measuring steps etc. I think the fitbit measured sleep much more accurately but I don't really need that. I do not like the band it comes with and find it difficult to get it to close and stay closed. It would be much better to have a buckle.",
      "rating": 4.0,
      "verified": true,
      "author": "Preschool teacher",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Perfect fittness/smart watch.",
      "text": "This is my 2nd gear fit. I loved the first and this one has some better features. You can purchase additional watch faces which is good because I didn't really care for any of the free ones available on the watch. It has a lot of good features like letting you know when you have a \"notice\", i, e., email, phone, Facebook, text etc. Easy to use .. but takes a little time figuring things out because there is so much available.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Great product,  only if it charges up!",
      "text": "Great product while it would charge up, but once the indents at the back would corrode(part which connects and charges) it's dead. Bought this back in Jan. 2017 here on Amazon, had it replaced by Samsung after three months use - for the same reason(wouldn't charge). They sent me this as a replacement, but only to last altogether 1 year and 5 months. Not a happy camper.😤😤 Read most reviews before I purchased it, but took a chance on it.",
      "rating": 3.0,
      "verified": true,
      "author": "Renkoz",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "No Customer Service.",
      "text": "I purchased this item and broke. It started going into a reboot loop. I sent it to Samsung and was told it came from the UK and they will not fix it. If I want it fixed I have to send to the UK. Bunch of crap. I am probably out my money. Will try calling Amazon. Make sure when you purchase from Amazon you confirm that your unit if from the USA if you need any repairs.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashlee Miller",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Does not track steps or movement very well. As ...",
      "text": "Does not track steps or movement very well. As this is supposed to be a fitness device I had hoped it would at least be somewhat accurate. Instead it will say we walked 1/4 mile after we have done 2 miles. It will get 1 flight of stairs after doing 4. Basically its just not accurate. But it has other uses so.... Just be aware of what you will expect from it.",
      "rating": 3.0,
      "verified": true,
      "author": "Hike/Fish",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Clean the contacts when you receive it.",
      "text": "I had trouble getting the product to start charging. At first I thought I may have gotten a defective product. Then after some research I tried rubbing the contacts of both the Fit2 and the charger with a pencil eraser. There may have been some sort of buildup on the contacts for shipping, but it charges fine now. The device itself has a lot of great features and not surprisingly integrates very easliy with samsung phones.",
      "rating": 4.0,
      "verified": true,
      "author": "FYI",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "SAMSUNG VOIDS WARRANTIES ON PRODUCTS PURCHASED THROUGH AMAZON",
      "text": "This watch stopped functioning about two weeks after I bought it. I contacted Samsung and after spending two hours on the phone trying to reset it they sent me a mailing label and told me I would get it back in a week to ten days. Finally after seven weeks they emailed me with an estimate of $226.73 to repair it, which is considerably more than I purchased it for. Samsung told me they would not honor the one year warranty even though it was purchased new because I purchased it through Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "James Gilmore",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Love it so far",
      "text": "Love it so far! Easy to setup and use, seems accurate, long battery life, and there are a lot of fun displays to download. The only issue I had was when I first tried to charge it after opening. I had to jiggle it around for a little bit on the charger before it first connected and started charging. So if yours won't charge right away, try moving it around, putting the charger upside down (that's actually what worked for mine), clean all the sensors, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Don't waste your money",
      "text": "After only having this product a couple months, the screen stopped working correctly. I returned it and got a new one. I've had this one less than a year, the band is cheaply made and broke soon after arrival. Now, it no longer charges properly or consistently turns on. Overall I would not buy again would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "NicoleTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Love the added functionalities that comes with pairing with my ...",
      "text": "I started wearing this after having back surgery so I could keep track of my activity/recovery. Step count is amazingly accurate. Except for the initial charging issue, it has worked flawlessly. The display is bright and clear. Love the added functionalities that comes with pairing with my phone - getting and replying to texts, answering or denying incoming calls, etc. Plus all the built-in features makes this a very nice fitness tracker.",
      "rating": 5.0,
      "verified": true,
      "author": "Homercles",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Amazing! Gear Fit2",
      "text": "I'm very impressed with this Samsung Gear Fit2. It is pretty easy to use and accurately tracks your steps and heart rate. For my fellow Samsung S Health users... yes, this Gear Fit Synchronizes with it, after you download the \"Samsung Gear\" app. You can also read your text and reply to them via this device. It will also allows you to select which apps you'll get notifications for. You can also customize the display, so it looks exactly how you want it to look.",
      "rating": 5.0,
      "verified": true,
      "author": "King D Mane",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Not accurate",
      "text": "Loved the features and the display was beautiful, but on day two it said I climbed two flights of stairs when I was barely out of bed. And when I wore it side by side with my old fitness tracker (Garmin Vivosmart) by the end of the day my step count differed by 2,500+ steps. By the third day I noticed it was counting the steps I got when I went for a walk, but not really catching the steps when I walked to the kitchen for a cup of coffee, etc. Something my Garmin always did. Very disappointing. I'm returning it for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "CarolF",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Works great! The reason for 4 stars instead of 5",
      "text": "Works great! The reason for 4 stars instead of 5: 1) the band clasp is not designed well and requires additional purchase of clasp bands (even with these the band still pops open from time to time; and 2) the step counter does not seem to be sensitive enough and is often off by 15% compared to my analog pedometer.",
      "rating": 4.0,
      "verified": true,
      "author": "John Magrino",
      "helpful_votes": 2,
      "publication_date": 20161116
    },
    {
      "title": "Fantastic tracker with decent software for a Samsung product",
      "text": "Fantastic tracker with decent software for a Samsung product, not too bloated. One glaring flaw though, IT WON'T CHARGE if the the battery runs completely out, or the first time out of the box unless you finesse it jin ust the right way over the course of several frustrating hours....I've had it two weeks and I just now let it run completely out of battery for the first time and basically ruined it apparently in doing so, would not recommend at this point. Every solution I can find online has not worked.",
      "rating": 2.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Recommended for people who need heart measurements periodically. My first smart watch,good experienc",
      "text": "Good silicone, strap lasted about a year and a half before one edge and clip disconnected, glued it back and replaced months after glue had been worn off. Battery started to give out about 2 years after daily use. One charge lasted about 2 days with regular use. Recommended for first time watch buyers.",
      "rating": 4.0,
      "verified": true,
      "author": "Shepherd Of Fire",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Great Tracker And So Much More!",
      "text": "I adore my Gear Fit. I had a Fitbit, but after a couple of years, it quit working. I can answer texts, answer phone calls (w/Bluetooth earbuds), plus I use S-Health and this syncs to it. The one feature I NEED is the stair climbing counter that the Fitbit had and the Gear Fit also has that. I also love the way it measures my heartbeat automatically. I can't say enough about how much I love this.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Allen Whitaker",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Not a quality product",
      "text": "I bought this product to simply track mileage while jogging. After almost 1 year after purchasing the product, my opinion is not good. Below are the reasons: 1. Watch freezes and has to be rebooted frequently and at inopportune times 2. GPS tracking is never complete (gaps in trip) and always differs form previous uses 3. Battery life lasts ~1hour, which is less than my time jogging The over all concept is great, but the product is not ready for prime time. A frustrating experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Step count off",
      "text": "I just received my Samsung gear fit 2 and I loved it at first. I've only wore it for two days and the step count is way off. I am very bummed because this is the main feature I wanted. I did some house work and stood and folded clothes and it said I did 5,000 steps for that. I also will just move my arms while standing in place and it counts numerous steps. I am very disappointed. I am trying to see if I can reset the watch to make it more accurate. Many reviews said this does not help and they also have the same problem. All the other features on the watch are great.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Works great, easy to setup",
      "text": "Works great, easy to setup, a lot of information only a swipe away. Its major fault is the wristband latch. The fitness tracker WILL fall off and you may not realize it. If you want to purchase this otherwise great fitness tracker you might want to look at the aftermarket \"rubber bands\" that keep the clasp closed and buy them at the same time. I bought MDW Security Fix Clasp for Gear Fit Band --... an inexpensive but slightly ugly way to keep from losing your $200 accessory!",
      "rating": 4.0,
      "verified": true,
      "author": "WildBill",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Samsung won't honor its warranty on this watch",
      "text": "Per Samsung, this is an \"International version.\" When parts fell off, and I sent it to Samsung under the warranty, they returned it unserviced saying it wasn't a US version. Amazon says it is. Too bad. I liked the watch. but I'm not in a position to resolve this. Be careful about whom you buy from, and what.",
      "rating": 1.0,
      "verified": true,
      "author": "rjg",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Disappointed",
      "text": "Do not believe the specifications promising battery life. I managed to go 12 hours on a full charge, and for eight of those I was asleep. Disappointed does not begin to cover how annoyed I am that this rather pricey gadget is useless. I wish I had gone with the regular Gear S2 instead, but now I am wary of returning this and purchasing another paperweight to wear around my wrist.",
      "rating": 1.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 2,
      "publication_date": 20170413
    },
    {
      "title": "Not for moms or dads who push strollers or carry kids often!",
      "text": "I'm disappointed in this product. I've had it now for over a month, and in that time, whenever I'm carrying one of my kids, or pushing a stroller (which is often) it won't register any of the steps. We went to Disneyland for 2 days, and I was pushing our toddler son in the stroller the majority of the time. After about 3 hours, the device only registered about 200 steps! This issue has been pretty consistent, and the only thing that makes it work properly is to one-handed push a stroller, and swing the arm with the Gear Fit2. Otherwise, the other functionality, is good. If you're a Samsung user, the integration is pretty seamless.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Exceeds expectations",
      "text": "I wanted a fitness tracker that counted steps, tracked workouts, and brought in notifications from my phone. This does all those things and it does them incredibly well. I can even reply to texts with pre-crafted replies. They don't always apply perfectly, but 9/10 times they do. Battery life is 2 days, could stretch to 3 with use of the battery saver mode. The fit is perfect. I would recommend this to anyone in the market for a fitness tracker. It has more than exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina S.",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Excellent fitness watch",
      "text": "This fitness watch is terrific. It allows me to monitor my heart rate, steps and calories at the gym, where I lift weights and work out on the elliptical. I like that it allows me to see and read email at a glance. It's especially nice that the watch syncs with the Samsung health app, allowing me to see trends over time. In the morning there is a slight lag in counting steps or flights of stairs, but after a few moments in catches up to what I am doing and records accurately.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernera",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "I like it but it dies quickly and stops counting steps",
      "text": "I really like this watch. After having it for a little while though there are some issues. The battery has to be charged every other day which seems very often. And it randomly stops counting steps which is the biggest annoyance. Calories and sleep seem to track well. Notifications work well. I like that you can reply from the watch even though it is only through preset responses. Although the battery dies quickly it does charge quickly too.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie Sullivan",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "You don't need more than this. Do you?",
      "text": "Never had a smart/fitness watch before and never thought I'd really need one until I bough the Gear Fit2. This thing is great with many updates and customization. It's easy to use and comfortable to keep on the whole day. Even the sleep tracker works great. I purchased this in April 2017 and it still feels brand new. No issues with the straps, buttons, software or connectivity.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Product is good but not from this vendor",
      "text": "I'm done purchasing products from A4C. The product would not even turn on. The product did not appear to be new and the box seemed to be reused. Returned this product and purchased a new unit from a different company and voila! It worked perfect.",
      "rating": 1.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "This is probably one of the best purchase I've made in a while",
      "text": "This is probably one of the best purchase I've made in a while. I use it every day and probably couldn't live without it now. I love being able to see who texted while in meetings at work without taking my phone out. I also use it to keep alarms to remind me to go to class on time. It doesn't say it's waterproof, but I use it in the shower all the time. I haven't gone swimming with it, I don't want to chance it breaking. I don't think the Pro version is worth it unless you go swimming a lot. I still get 2 days of charge comfortably with a bit leftover.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Kirby",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Wouldn't Work!",
      "text": "Wouldn't work. It came with 0 charge so I plugged it in. 4 hours later nothing. I went online and several people posted similar instances. They recommended plugging it into a laptop to get it to 5% and then charge it from a socket. Couldn't even get it to 5% on a laptop. Call Amazon, which gave me a discount. Called Samsung who were willing to repair it free of charge since it was still under its 14 day warrenty. Havent' gotten it back, yet, but I have never had to return a product that I bought on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Gayle",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "I loved this fitness band",
      "text": "I loved this fitness band. Unfortunately, I had to send it back. The alarm suddenly kept vibrating and would freeze in that mode. So, half asleep I would have to keep trying to turn it off and would end up having to reset the band to get it to stop. Then, it would not charge or recognize that I set it on the cradle. This is a great band and I could have just received the bad one in the bunch.",
      "rating": 4.0,
      "verified": true,
      "author": "Brenda K. Leon",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Wish I changed to this sooner.",
      "text": "This thing is amazing when you want to keep track of your exercise. How many steps, calories, etc. plus if you have a android phone being able to keep track of other things like messages and email is a plus. I had a Fitbit before but this is miles better.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Buyer beware",
      "text": "Never tracked stairs correctly. LASTED LESS THAN A YEAR!! a just stopped working...won’t turn on. Screen flashes but won’t turn on 😖",
      "rating": 1.0,
      "verified": true,
      "author": "Charlee Anne",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "I loved it for the first 3 months",
      "text": "I loved it for the first 3 months, eventhough my music never did sync. But then one after another all the widgets vanquished. After hours and days of research and attempting to get it working again I agrilly put it down accepting that samsung had sold me a product that proved to inferior to their competitors. Also the battery charger only worked for a few minutes at a time. I hade such high hopes for this product, but one star is truly too many.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryce Martz",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Battery life dropped off FAST!",
      "text": "I was, initially, very happy with my purchase. Several reviews I read stated that the battery needed to be charged daily. And I was fine with that. At first, my battery lasted for a full three days on a single charge. I was thrilled. Now, though, after only one month, the battery has gone from 3 days to only five hours! Not cool. I turned off every feature I could and then even tried keeping it in power saving mode. No use. I purchased two of these at the same time. One for myself and one for my girlfriend. Hers still works just fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim Rails",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Love Samsung, but not this time.",
      "text": "The first one I received wouldn't charge. The second one I received had an issue with the band not being secure and the screen shattered on the first day of wearing it. Frustrating, and even more frustrating that it will cost more than I paid for it to get the screen fixed. I am a fan of Samsung products (have phone, TV, refrigerator), but this product is not worth the money. Now I have to spend even more money to get a wearable device. My Fitbit lasted 4 years before any problems. For me, not worth the aggravation or money.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon Veatch",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "During Work-out  the unit freezes",
      "text": "Love my Gear fit2 when we first purchased. Everything was working great, loved to know when text messages came thru, monitored my work outs during zumba and bootcamp. For the past month the unit freezes during workouts, displays inaccurate data. Apparently this is a known issue with no fix. If you purchase, get the service contract!",
      "rating": 3.0,
      "verified": true,
      "author": "larry buckman",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Disappointed",
      "text": "Delivered March 9, 2017 Stone dead today 3/18/17. Band was not an issue for me although I changed bands because of difficulty in putting it on and latching the band. Some difficulty reading my pulse while on treadmill. But today stone dead. Reacts to nothing. No charge. No response. Unfortunately Amazon return has expired and I will have to see what Samsung will do. Under this condition cannot give it more than a 3. Will try another one just like it...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "... features that have been offered with the device are great. The display is gorgeous and the integration to ...",
      "text": "Gave the Samsung Gear Fit2 Smartwatch as a gift this past month for my mom and so far the features that have been offered with the device are great. The display is gorgeous and the integration to the Andriod OS has been seamless (the phone as a Samsung 7). Everything was solid about the watch except the wristband. It was incredibly flimsy and became the watch became unstrapped at even the slightest grazed touch. My mom has nearly lost the watch on multiple occasions because of the poorly thought-out strap. This watch would have easily gotten a 5-star rating, but having to be constantly worried about whether the watch is strapped on at all defeats the purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Nima",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "nice",
      "text": "The battery doesn't last very long but 24 hours is enough I can just charge it at night the band fell off the first day I wore it but this is a refurbished so I understand so I just bought a new band and snapped into place once that fell off other than that it's a really good buy it's accurate and I'm glad I bought it",
      "rating": 5.0,
      "verified": true,
      "author": "jamie",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great fitness tracker",
      "text": "Great fitness tracker. The watch is very light. I didn't have it for too long, as just like the other reviews say, the band comes un-clasped easily. I lost my watch the first week. I also have the Gear S2. In comparison, the screen on the Gear S2 is better in direct sunlight. If you are deciding between the Gear Fit 2 and a Fitbit, buy the Gear Fit 2. The Gear Fit 2 has a color screen. I do recommend purchasing a better replacement band so that you don't lose the watch. It's upsetting to lose that amount of money.",
      "rating": 4.0,
      "verified": true,
      "author": "Veronica Davis",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Could never experience the product.",
      "text": "Unboxed and kept on 1st charge and the band would not work. Tried on various plugs including Samsung S7 edge fast charger, tried on all sockets and same problem. Each time the band was very briefly flashing the lightning icon. Tried charging for intervals of 2 hours, 4 hours, 6 hours and even all night still wouldn't turn on. Amazon says they will refund and A4Conline seller says to contact Amazon. So frustrating as if refund resolves all the problem.",
      "rating": 1.0,
      "verified": true,
      "author": "vikas sarin",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Terrible Straps",
      "text": "While the watch itself it's okay, the straps are simply terrible they will open when you less expect them and the watch WILL FALL TO THE GROUD, Mine opened and fell just a month after i bought it and of course broke the screen .... I kinda would have expected more from the famous Gorilla Glass screen. If you buy this watch you will need to be check that the straps are secure very often or suffer the consequences.",
      "rating": 3.0,
      "verified": true,
      "author": "DanielQ",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Not worth the frustration",
      "text": "Cool watch and features, absolutely atrocious charging system design. Took several hours of cleaning and researching to get it to charge the first time, then it worked fine for about a week, then decided not to charge again. Several frustrating hours, a pissed off sleep, and a couple more frustrating hours later it magically charges again.... save yourself some heart ache and get a Garmin or Fitbit.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan Gatlin Lipp",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Love the product easy to use",
      "text": "Love the product easy to use, very comfortable and durable. Pro's> Good Battery Life, Hold about 500- 600 songs depending on file size, Various guided workouts built in through the S Health app, Health Nudge reminders and dynamic workout tracking Con's > Calories don't seem to track well when not in a workout setting, Example when I first wake up and put it on there already about a few hundred calories showing that have been burned. So it would be nice to reset calories per day.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "keeps up with sleep as good as any I' seen so far",
      "text": "Step counts are for the most part on the money. They are only off when I'm using a hammer or anything with that kind of movement. heart rate is spot on. set it on auto heart rate and keeps check all day. keeps up with sleep as good as any I' seen so far. Plenty of different downloads for the face and plenty of nice extras. Battery life is fair when not in power saving mode about 30 hr. Power saving mode id about 48 maybe more both depends on amount of calls and notifications you receive",
      "rating": 5.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Short lived",
      "text": "This is the 3rd Samsung gear fit smartwatch that I have owned in as many years. The first one lasted about a year, the second one about 6 mos., and the third one almost a year. Battery replacement did not work.",
      "rating": 3.0,
      "verified": true,
      "author": "Gina Vincent",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Samsung Gear Fit2 Band is cheap and fails quickly",
      "text": "The band is very cheap and the little rubber knob on the band broke off after 6 weeks usage. Called Samsung support and got the run around. After a 5 minute discussion they told me to visit Best Buy for a technical evaluation and there will be costs in involved repair. Repair, for a rubber knob that cracks off forget it. I did not abuse this in any way just normal wear. My expectations would be that they send me a new rubber band. The watch itself is great but you must expect to have to replace the band. This left me a bad first experience with Samsung customer support.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Short on functionality and a short lifespan.",
      "text": "This watch stopped charging in less than 1 year. The connectors are on the underside of the activity tracker and corrode after regular use. Additionally the app support and marketplace is not well thought out - predominantly populated with watch faces and no new functionality. I was optimistic, but the product falls short on execution.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Mattocks",
      "helpful_votes": 2,
      "publication_date": 20170613
    },
    {
      "title": "Great Fitness Tracker",
      "text": "LOVE it!!!! It does everything I want it to do!! It tells me to move if I have been inactive too long, monitors my sleep, calories, water etc I take in...calories burned, monitors my pulse frequently throughout the day and night and many other things. Also at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Schlosser",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Demo Live Unit",
      "text": "Please be careful when you buy this product. I received the watch with a \"demo live unit\". It took me more than 30 days to figure out why the watch was not \"pairing\" with my Samsung Phone or working independently, it had a demo live unit. This means that the seller sold me watch mean for retail display. Since I exceeded the 30 days period for returns, I'm stuck with a watch that I can't use, return or exchange. The supplier shared a video on how to remove the \"demo live unit\". I have not been successful to install the firmware required.",
      "rating": 1.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Awesome product!",
      "text": "This product exceeded my expectations. Not only did it track my heart rate and walking distance, but it has so many other features that allows me to maximize the number of calories I burn each day. It is like having my own personal trainer with the \"nudge\" tool that notifies me when I am slowing down or getting my heart rate in a not so healthy range. The product was delivered as expected and had all guides necessary to programming and setting it up pretty quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "David Beverly",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Very cool!",
      "text": "I bought this as gift for my husband and he loves it. The only time he takes it off is when he showers. It has a lot of features and a cool app. He uses it to record his steps, exercise, gets his text messages on it and as a watch. I’m sure there are a ton of other features that he has yet to use. The only issue he has is that it’s difficult to read in the sun.",
      "rating": 5.0,
      "verified": true,
      "author": "lilbug4apet",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Only a temporary watch, not going to last",
      "text": "Initially worked fine. Band broke a few months after purchasing it. Samsung does not offer a replacement band, Less than one year after purchase the top of the watch face is physically separating from the watch body itself. I went through the steps to try to have Samsung repair it but they are refusing to do so. As long as you don't mind replacing your watch every 12 months out of your own pocket, this watch would be fine to purchase. The band itself becomes unhooked very easily, so make sure to purchase a safety strap as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "If your looking at this for texting its not for you.",
      "text": "The major thing I dislike about this product is it says you can quick reply to texts. It means you makes a few quick messages in the settings in ur phone and those are the ones you can use, no writing it out like most watches do. Other then that this watch is amazing I bought it because my last watch would count steps when I moved my arms this one works great and u can do all different types of work outside with it! My favorite is levels!",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha Foley",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Just like it",
      "text": "Great for checking email and for calendar reminders. NOT ACCURATE for those really wanting to watch steps. I talk with my hands and it counts me standing still and talking as steps. Also the weather app pops up at least once an hour very annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Watch may be from a foreign vendor having foreign components!",
      "text": "Watch may be from a foreign vendor having foreign components. Watch display stopped working after 9 months while under 1 year warranty and Samsung USA refused to repair watch because it has foreign components. I gave this 3 stars because the vendor replaced the watch with a new one.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Great",
      "text": "This review is for Samsung Gear Fit2 Smartwatch Large, Black I bought two of these, mom and friend. They both love them. They are simple to use. Just dive in and start clicking around and learn how it all works. Light weight, can't even tell it's on your wrist. Love the different watch faces you can download.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Loved it for the short time it worked...",
      "text": "This worked great for approximately 6 months and I loved it. However, i then began having problems with it not charging. In the beginning I could keep taking it off the charger and putting it back on and after a few days of that it would miraculously start charging. I had 2 chargers with same results on both. Eventually it stopped altogether and no longer works.",
      "rating": 2.0,
      "verified": true,
      "author": "Amber White",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "I love it!",
      "text": "Some things make you feel/look so smart for having purchased them. This is one of those things. Syncs to my other devices. All of my notifications alert me via a buzz on the wrist. Nudges me to get up and get moving. A wonderful companion to my workouts. Etc! AND I got it at a great \"refurbished\" price. Yup...I'm a genius! : )",
      "rating": 5.0,
      "verified": true,
      "author": "Mz Patchouli",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Good mid priced smart fitness watch",
      "text": "This watch is exactly what I expected for the price and for what I needed it for. I can receive texts and calls and still track my basic fitness needs. I am not allowed to keep my phone on me at work, but my phone isn't far away. I don't miss calls from my kids school or text messages from my mom or husband when I am at work. The battery life isn't great but what do you expect with all the power draining that I use it for.I don't have a tone of money , this fit my budget and my needs wonderfully",
      "rating": 4.0,
      "verified": true,
      "author": "Brooke Cole",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "I love Samsung products",
      "text": "Awesome fitness tracker. I ordered this for my mom who has been wanting to get healthier and it was the perfect product for her. She uses it with her Samsung Galaxy S7 Edge and I can push her to be more active through the GearFit app. Great device and highly recommend it if you're looking for a cheaper but good quality fitness tracker.",
      "rating": 5.0,
      "verified": true,
      "author": "Kameron Green",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Watch Out Now...Great Product",
      "text": "Great Product. Arrived in like 3 days, not sure if it's because i'm living in Korea or not. The MP3 player is a bit misleading, you have to have a bluetooth enabled headphone to use it, I thought the music played directly from the watch. Overall, really nice product, I do like the band from the first watch better, but the band on this one seems more secure. Looks good, lots of improvements.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Worth the price and great features",
      "text": "It's been a few days since I'm using it and it's quite simple. Even after watching reviews, I wouldn't expect the interface to be smooth and easy to use. What a great surprise Samsung! A clean interface and partner apps like Spotify and mapmyrun makes running more convenient. Samsung Gear and Samsung Health are not so sharp though. The battery works fine for my use. I'm wearing it daily with HR frequent measuring, daily running 40 minutes, listening to music and with GPS on. At the end of the day I still have 50% of battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Gustavo Freitas",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Recomendation changed",
      "text": "I loved this watch... until it fell off four times and is now gone for good. I read a previous review and thought it was likely not accurate however I will say if you do not purchase a separate strap on band with a clasp this watch will fall off your wrist. It is a poor design for the stock band. Not your best work Samsung. The watch itself was fantastic.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathan R Larrabee",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Don't waste your money",
      "text": "It is a shame to give this even one star this is the second one I purchased because I lost one - it will not charge or turn on half the time it does not sync well with phone and Samsung apps. If I had a do over would purchase the Fitbit. First one had some issues but I thought I just may have gotten a bad one - wrong second one is crap also. This is a real piece of crap - unless they are giving it away and even the frustration is not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey M",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Very happy with this purchase",
      "text": "Very happy with this purchase, so convenient not to have my phone on my hand all the time but still know I wont be missing any calls or messages coming through, thanks to the alerts on this watch. The large size is not as large as I expected given that I have a small wrist, the watch perfectly fits. Very functional and easy to navigate through. One of my best purchase here online.",
      "rating": 5.0,
      "verified": true,
      "author": "GinSal6",
      "helpful_votes": 2,
      "publication_date": 20161207
    },
    {
      "title": "Very intuitive and sleek",
      "text": "The product is impressive. The screen and functionality are intuitive and consistent. Out of the box we were having issues getting it to charge/sync correctly. After reading other reviews, we lifted it on/off the charged 3 times and it started to work. Issue was resolved after this. Very happy with and result.",
      "rating": 5.0,
      "verified": true,
      "author": "louis",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "but it's also not like 400$ No chest straps required",
      "text": "Does everything you need and then some, sure its not a Garmin Forerunner 235, but it's also not like 400$ No chest straps required, pairs with any android phone, and looks great. Best Smart/Fit watch I've owned and I've even owned a Timex Data-Link ...",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Smith",
      "helpful_votes": 0,
      "publication_date": 20160729
    }
  ],
  "product_meta": {
    "title": "Samsung Gear Fit2 Smartwatch Large, Black",
    "description": "Color:Black| Size:LargeWhen you’re looking for motivation to stay at your best, the Samsung Gear fit2 keeps you in the zone. It automatically recognizes whatever you’re doing and starts monitoring steps, distance, Heart rate and more. You can even Map your run with the Accurate Built-in GPS. Receive and responds to notifications from your wrist and turn up the music that gets you moving. We all have goals. The Samsung Gear fit2 will help you achieve yours.",
    "rating": 3.6,
    "feature_bullets": [
      "Track your step count, calories burned, heart rate, sleep Quality and More",
      "Map your activity accurately with the built in GPS",
      "Auto tracking recognizes and starts Tracking multiple exercises when you move",
      "Strap Length : Large band fits wrist sizes 155mm 210mm : Small band fits wrist sizes 125mm 170mm",
      "Store your favorite music on the GearFit2 or connect with Spotify to access millions of songs",
      "Samsung Gear Fit2 is compatible with both Android and iOS smartphones"
    ],
    "specifications": {
      "Product Dimensions": "6.42 x 2.72 x 3.62 inches",
      "Item Weight": "3.04 ounces",
      "ASIN": "B01FDPVXZC",
      "Item model number": "SM-R3600DAAXAR",
      "Batteries": "1 CR2 batteries required.",
      "Customer Reviews": "3.6 out of 5 stars2,626 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#39,909 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android 4.4+ and 1.5GB RAM, Android",
      "Connectivity technologies": "GPS",
      "GPS": "True",
      "Other display features": "Wireless",
      "Colour": "Black",
      "Included Components": "Gear Fit2^Band Strap",
      "Department": "Smartwatches",
      "Manufacturer": "Samsung",
      "Date First Available": "June 3, 2016"
    },
    "categories": [
      "Electronics",
      "Wearable Technology",
      "Smartwatches",
      "All Departments"
    ],
    "price": 279.99
  }
}