{
  "website_summaries": [
    {
      "verdict": "Regardless of how you want to carry it or what you want to put in it, this stylish wallet is built to fit your needs with classy looks and generous space.",
      "pros": [
        "Not only is this wax finish leather wallet attractive and well made, but it has more pockets and slots than any other on our list, including 21 card slots",
        "Perfect as a wallet, but spacious and stylish enough to be carried as a clutch",
        "Has RFID blocking"
      ],
      "cons": [
        "The material is a bit stiff at first but may become more flexible with use",
        "If you fill it, it's on the bulky side",
        "Cell phone pocket won't fit larger models",
        "A few zipper issues reported"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Gorgeous Wallet! Very Happy With Purchase!",
      "text": "Absolutely gorgeous! Arrived on-time and beautifully boxed. Looks and feels rich and luxurious. Stunning color, very well made, lots of room for credit cards or anything else you choose, fits my iPhone 7-Plus comfortably with room to spare. I would happily buy as gifts and also for myself in different colors.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 192,
      "publication_date": 20170628
    },
    {
      "title": "BEST WALLET I'VE HAD",
      "text": "I absolutely LOVE this wallet! I am picky about wallets, I want them to be big enough to be useful, and yet somehow compact. This wallet is pretty, has plenty of room for lots of cards, cash & a phone, yet is still neat and compact. I have my LG G3 phone in the snap pocket, lots of credit cards and change in the wallet, yet it still snaps shut on the tighter snap without any problem. Not bulky at all. Very nice quality, as well. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Lelaine",
      "helpful_votes": 342,
      "publication_date": 20160722
    },
    {
      "title": "Love it, Gorgeous!💕💕💕",
      "text": "I love this nice wallet! Lots of space without making the wallet look too bulky and the color is super vibrant. Check my video review! (No I didn't get paid to video review... I honestly felt this purchase was worth it.)",
      "rating": 5.0,
      "verified": true,
      "author": "Jeeniejolie",
      "helpful_votes": 77,
      "publication_date": 20190323
    },
    {
      "title": "RFID wallet",
      "text": "Nice wallet. I love the color, there are a lot of pockets and the zipper pocket holds my phone perfectly. It came in an attractive box and included a cute owl necklace. I would describe the 'purple' as more of a wine color.",
      "rating": 5.0,
      "verified": true,
      "author": "PhoebeD",
      "helpful_votes": 234,
      "publication_date": 20170128
    },
    {
      "title": "Perfect Wallet, Beautiful Color",
      "text": "Love this wallet. All sections fold out so you have good access to all 21 card slots. Love that it's RFID protected. And, since I still carry around a checkbook for the rarely written check, the interior pocket that's protected with a fold-over snap is perfect for carrying a small stylus/pen as well as the checkbook. Then the zippered slot is perfect for change. Only thing I would change would be to make the zipper color-coordinated instead of gold. Also, they are right about the wallet becoming more flexible as it is used.",
      "rating": 5.0,
      "verified": true,
      "author": "LouiseM",
      "helpful_votes": 167,
      "publication_date": 20161209
    },
    {
      "title": "High End Quality RFID Wallet",
      "text": "While researching through several choices of ladies RFID wallets, I found the 'Itslife' brand. This wallet is 1/2 the price of the more 'name brand' leather RFID wallets. I am extremely pleased with the quality of this wallet -- the leather is very nice and soft. Usually leather wallets can be stiff, but I don't see any 'breaking in' issues in this wallet. I also could not help but notice the stitching on the inside is even and straight. These qualities give it a 'high end' look. Definitely recommend this wallet! Great variety of colors available too.",
      "rating": 5.0,
      "verified": true,
      "author": "Road Queen",
      "helpful_votes": 198,
      "publication_date": 20161122
    },
    {
      "title": "I bought this wallet because it said it is RFID ...",
      "text": "I bought this wallet because it said it is RFID blocking. It is not. I have to use a key-card at work to get in the building. It read the key-card through my purse and through the wallet. I tried different slots and it still read it.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy Waldrop",
      "helpful_votes": 45,
      "publication_date": 20171204
    },
    {
      "title": "Bad quality of product , doesn't worth the cost at all , very disappointed",
      "text": "Very bad quality of product , after 10 days the \"tic tac\" which close the wallet broke ... the wallet wasn't full and was treated carefully by my wife.",
      "rating": 1.0,
      "verified": true,
      "author": "Eran N.",
      "helpful_votes": 58,
      "publication_date": 20171014
    },
    {
      "title": "Didn’t even last 3 months",
      "text": "Initially I really liked. It was decent quality with lots of space. But now I regret even spending this much money. It’s completely worn out. It gets sticky. Starts looking dirty very quickly and the leather peels off. I would not buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Maha Jafary-Sheikh",
      "helpful_votes": 37,
      "publication_date": 20180118
    },
    {
      "title": "A piece of junk!",
      "text": "This wallet is a piece of junk. I am returning it ASAP. The claims this item was worth over $100 or more. No room for my check book and register which you claimed could hold. They go in but you can't close the wallet. This wallet is made of some sort of plastic covering, not leather per claim.",
      "rating": 1.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 38,
      "publication_date": 20171015
    },
    {
      "title": "Exceptional large wallet",
      "text": "I did a lot of research on large wallets before purchasing this one. I’m glad I took the chance on this over a $150 Coach wallet. I feel like I got comparable quality for a fraction of the price. I was looking for something with ample room for change, cash, receipts, and plenty of cards. With this wallet, I have an entire set of card slots unused. I like now having an overflow of card slots for the occasional gift card I have to carry. Overall this wallet perfectly suits my needs. The color (fuchsia) is gorgeous too!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 38,
      "publication_date": 20190109
    },
    {
      "title": "THREW THIS AWAY WHILE ON VACATION!!!",
      "text": "Noticed a slight oder when removed from package. Had to leave early following morning so did not pay as much attention as I should have. Liked the look and compartments so hurriedly transferred item from old to new. While in transit I reached inside purse for Kleenex and noticed my unscented kleenex had a strange oder, then I checked inside my purse and EVERYTHING SMELLED MOLDY! As soon as we arrived at destination I bought a new billfold and threw this one away. Leather does not naturally smell like mold, it does however take on surrounding oders. All I can say is this smelled like old books that had been stored in a wet basement!",
      "rating": 1.0,
      "verified": true,
      "author": "Grandy",
      "helpful_votes": 15,
      "publication_date": 20190124
    },
    {
      "title": "Five Stars",
      "text": "Beautiful wallet. Great leather. 10/10. Would buy again! Update: I've had this wallet for exactly 7 months now and it just keeps getting better and more beautiful as the months go by. My SO gave me a VERY beautiful, high-end (i.e, expensive), designer wallet for Christmas and I haven't changed over to it because I just can't bear the though of not using this one. It is my favorite wallet I have ever owned. I felt compelled to share this with anyone considering getting it. I do most of my shopping online and have become a bit dependent on product reviews so a genuine review is always appreciated.",
      "rating": 5.0,
      "verified": true,
      "author": "Tulier",
      "helpful_votes": 18,
      "publication_date": 20171125
    },
    {
      "title": "Freakin' BEAUTIFUL wallet!!!!",
      "text": "I fell in love with this wallet on sight. It's even more beautiful in person! And the seller sends the sweetest little lagniappe (New Orleans for \"a little something extra\") with it. I usually buy cheap little wallets but this one was calling my name. It is definitely beautiful and high quality. I can't imagine being as happy with any other purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dumestre",
      "helpful_votes": 21,
      "publication_date": 20161111
    },
    {
      "title": "Unattractive color and hard to use.",
      "text": "This was a gift for my wife and it was not what I was expecting. The leather did not look or feel like leather and the color in real life was not nice at all. It has a lot of room for credit cards but it was difficult to get them in or out. My wife was not impressed and ordered herself another leather wallet that was softer and has a beautiful color.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Sommerfeld",
      "helpful_votes": 18,
      "publication_date": 20180121
    },
    {
      "title": "Many \"plus\"es...with one \"minus\"",
      "text": "This wallet is very nice, real cowhide leather, and lightweight--with LOTS of pockets. 21 credit card slots, to be exact, and 7 other pockets (including full length pockets underneath the credit card flaps and two wider pockets for money or a cell phone). I WISH I LOVED IT, but... They chose a crinkly plastic for the inside of both of the bigger pockets--which feels cheap to me and isn't the \"tactile\" experience I want for a rather expensive leather wallet. I hope they will read this and change those inner liners to a ribbed, flexible, soft material that doesn't crinkle like plastic wrap.",
      "rating": 4.0,
      "verified": true,
      "author": "Aunt Jen-Jen",
      "helpful_votes": 5,
      "publication_date": 20191012
    },
    {
      "title": "BEAUTIFUL BUT DEFECTIVE",
      "text": "I love the wallet. The leather is beautiful and has plenty of compartments. However, the zipper stop broke off after two weeks of use and the cloth that surrounds the zipper is unraveling. This has never happened to me; not even with the cheapest wallets. It may be beautiful and quite functional but what good is this if you can only use the wallet for such a short time.?",
      "rating": 1.0,
      "verified": true,
      "author": "Alice Madrigal",
      "helpful_votes": 17,
      "publication_date": 20170704
    },
    {
      "title": "Wallet heaven",
      "text": "This wallet is awesome. My other wallet of 15 years just broke so I was forced to upgrade. This wallet has no smell, though I saw some questions/reviews about this. What I love is that this wallet is relatively compact, yet allows me to put in a couple dozen cards, license, cash, checkbook, receipts and of course, coins. I highly recommend it as it is very nice looking, very well made and holds all things. I can even slip my IPHONE 6 in a small snap button compartment (without the IPHONE case) if I was really feeling that I wanted to use this as a purse.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 12,
      "publication_date": 20160901
    },
    {
      "title": "Works great, but scratches easily",
      "text": "It's got lots of space and is great for keeping my items organized. My only disappointment is that the leather scratches fairly easily, especially near the clasp which gets lots of \"action.\"",
      "rating": 4.0,
      "verified": true,
      "author": "Myka",
      "helpful_votes": 12,
      "publication_date": 20170417
    },
    {
      "title": "Great wallet",
      "text": "Wether or not it indeed blocks scanners I do not know. However, the color, style, and size of the wallet make it completely worth the price. I haven't even filled it up half way when my previous wallet I was busting at seems (literally) as for the \"odor\" mine smells like a leather wallet...so I don't know what the other customers are referring to. I would definitely suggest this wallet to someone I know and everyone I ever meet if it indeed blocks scanners.",
      "rating": 5.0,
      "verified": true,
      "author": "rlhouchin",
      "helpful_votes": 8,
      "publication_date": 20170424
    },
    {
      "title": "Cheap and Tacky",
      "text": "Although, this wallet has tons of card holder etc, it is in no way stylish. It is plain and looks fairly cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Averbakh01",
      "helpful_votes": 13,
      "publication_date": 20170721
    },
    {
      "title": "Lovely Wallet, but...",
      "text": "Positive: This is a well made wallet with plenty of card slots and compartments. The stitching is great and my cards slid in and out of the slots effortlessly. It’s lightweight and pleasant to look at. Negative: It reeks of a strong chemical smell that I found nauseating. The leather is low quality and thin. I was concerned that with prolonged use the leather would bend and break. I really didn’t want to return this wallet. I thought that after much searching for a descent RFID wallet that I had found a keeper. But the smell and low quality leather were two factors that I just couldn’t ignore.",
      "rating": 3.0,
      "verified": true,
      "author": "Angeb68",
      "helpful_votes": 3,
      "publication_date": 20190130
    },
    {
      "title": "I love it and I am a wallet snob!",
      "text": "For years I had a brighten wallet that I loved. As it wore out I looked at other wallets and just couldn't find one I liked as much. I even had the zipper repaired. It finally got to a point that I had to replace my wallet, so the search began . upon finding this beautiful wallet I gave it a try. It is perfect ! It has smooth leather that looks great . The wallet has every feature that my old wallet had plus RFID blocking. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Verogal",
      "helpful_votes": 3,
      "publication_date": 20190404
    },
    {
      "title": "Great buy",
      "text": "So far very very pleased with it! Space available more than I thought , spacious and good size . My IPhone 6S fits perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 106,
      "publication_date": 20160224
    },
    {
      "title": "At first I thought it was perfect",
      "text": "At first I thought it was perfect -- it looks great (tan) and my credit cards fit in well. However, in the the two weeks I've used it, dollar bills have gotten caught (and ripped) in the zipper (coins in the bill compartment prevent the bills from slipping all the way in) and today the zipper pull dropped off. I was able to reattach the zipper pull, although I don't know how long it will remain. Except for these problems, I would rate it five stars.l",
      "rating": 2.0,
      "verified": true,
      "author": "80goingon18",
      "helpful_votes": 6,
      "publication_date": 20171130
    },
    {
      "title": "Oh my gosh the SMELL!",
      "text": "I absolutely love the style of this wallet. I love the soft leather. And I normally love the smell of leather. But this wallet doesn't smell like leather. It smells like chemicals or some type of gasoline or something. It is HORRIBLE! I am trying to air it out, hoping the smell goes away but I am not hopeful at this point. I am also having problems with the zipper being a bit hard to open. It catches like it isn't going to last too long. I got the natural black leather wallet. I am thinking perhaps the differently treated leather might smell better? I don't know if it's worth trying that or not.",
      "rating": 2.0,
      "verified": true,
      "author": "maggierose",
      "helpful_votes": 2,
      "publication_date": 20181222
    },
    {
      "title": "sleek and attractive",
      "text": "My experience with wallets advertised as having many slots for credit cards, etc.is that the wallet gets too bulky and won't close or won't close properly when those slots are filled. This is not the case with this wallet. I actually filled all the slots with membership cards, credit cards, etc. AND I put my checkbook and register in as well. Not only did the wallet close properly, but it stayed looking \"unstuffed\" . It is very attractive and stays surprisingly slim when filled, thus taking less room in my purse. I am very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "vicki nelson-briggs",
      "helpful_votes": 2,
      "publication_date": 20190918
    },
    {
      "title": "Great Wallet!",
      "text": "This wallet arrives nicely packaged, ready for gift wrapping. This wallet is made well, it's roomy, the color is amazing (easy to find inside the black lining of my purse) and has tons of storage for cards and coins! The only negative I've noticed is the closure for the entire wallet has some kind of adhesive where it attaches to the wallet and it is collecting dirt & dust, otherwise this would have been 5 stars. I wish they had an option for a silver zipper, but I can overlook that knowing how well made this item is. I would recommend this product!",
      "rating": 4.0,
      "verified": true,
      "author": "Anne H.",
      "helpful_votes": 10,
      "publication_date": 20160709
    },
    {
      "title": "A lot of compartments for cards, very good quality",
      "text": "I bought this product based in some reviews yet I was not 100% sure because there were some bad reviews too. Has been two months since I bought this and actually I love it and is exactly what I expected. pros: Fits all my cards perfectly Has many compartments to separate things Closes and remains closed even with all the cards, cash and some coins. Awesome look Fits phone on the outside pocket (Samsung Galaxy Note 8 without case) Cons: Not really any cons, the only thing I could say is do not use the outside phone pocket for coins, some may fall here and there. But there is another pocket you can use for coins inside the wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Lynch",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Attractive Wallet",
      "text": "This is an attractive wallet. It looks well made. The zipper is large and awkward to open and close while the fabric waves with the large zipper teeth. It is smaller than the large capacity stated. More like barely 7.5\" and less than 4 inches. I needed a large capacity wallet and it states that it is, but it isn't. If you try to return it you will pay about half the wallet value to ship. If disabled you will pay a driver to take you to Kohls. Think twice.",
      "rating": 2.0,
      "verified": true,
      "author": "sanne",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "I like it. It isn't quite as commodious as I ...",
      "text": "I like it. It isn't quite as commodious as I had hoped, but it does what I need and it looks nice. When I say \"commodious,\" I mean that my previous wallet (which was a bit larger and I was unable to replace) had more windows, more pockets, and looser card slots. This one does look quite handsome. It is lightweight and, being smaller than I was used to, fits more easily in my handbag. I'm still getting accustomed to it. If I get to like it better, I will update this review.",
      "rating": 4.0,
      "verified": true,
      "author": "Muriel Vasconcellos",
      "helpful_votes": 5,
      "publication_date": 20170325
    },
    {
      "title": "THE BEST WALLET I'VE EVER HAD!",
      "text": "When I pull out this gorgeous wallet it makes me look and feel RICH! My friends at work all want one and couldn't believe the price for such amazing quality. They all asked if it was real leather. Each noted the extra spaces for credit cards. I haven't been able to find a wallet that does EVERYTHING until now. I was able to donate my old wallets and now my purse is much lighter and much more organized. I love this wallet more everyday. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl L Ellis",
      "helpful_votes": 6,
      "publication_date": 20170427
    },
    {
      "title": "A wonderful wallet",
      "text": "I usually carry a coach wallet that much prefer this its life wallet which was three force the price. I feel much safer with an RFID blocking component to my wallet and no longer have to put the RFID sleeves on my credit cards. Also it holds my iPhone 7 Plus but the the fit is slightly tight with my phone cover. I would highly recommend this Wallet to others",
      "rating": 5.0,
      "verified": true,
      "author": "E. Carlson",
      "helpful_votes": 28,
      "publication_date": 20161122
    },
    {
      "title": "The wallet I received is a cheap, shabby, dingy bown that resembles a tvinil more that leather!",
      "text": "The wallet I received had some of the advertised compartments. But it is not that pretty. It is not khaki nor is the texture quality like the wallet in the photo. The wallet I received is a cheap vinil look i. A dull darker brown. I am very disappointed and feel I've been taken in a \"bait and switch\" operation. I missed the return cut off date. That's my fault. But I will not keep this wallet in use any longer than I need to do. I'll just lose the money by throwing it out.",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela S",
      "helpful_votes": 2,
      "publication_date": 20180730
    },
    {
      "title": "The Best Wallet",
      "text": "First Packaging is meticulous. Second Color is the same as shown. Third Plenty of room for cc’d, business cards, change, bills. Fourth Craftsmanship is perfect. Fifth RFID. What more can you ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Bottega",
      "helpful_votes": 2,
      "publication_date": 20200419
    },
    {
      "title": "really like this wallet",
      "text": "I waited to review until I had it for a while. I really, really like this wallet. I hate making a wallet change and decided to buy this one blind, having never seen or touched the brand before. I keep my wallets a long time and see this one lasting for years. High quality, tasteful, plenty of storage without being overly bulky. I'm tempted to buy another for when mine eventually shows wear!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie E. Baalman",
      "helpful_votes": 8,
      "publication_date": 20161010
    },
    {
      "title": "Love This Phone Wallet",
      "text": "I absolutely love this phone wallet. (Just received). Color is very rich. And appears to be of good quality. As advertised it had lots of space for credit cards, checkbook etc. And it holds the phone nicely and is NOT bulky. This made my life much simpler allowing me to store everything very neatly and organized. Now as long as the product holds up and doesn’t start to look worn or discolor in a short period of time I’m good to good. So for now I gladly give the 5 rating!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Zipper is a problem.",
      "text": "This wallet seemed like it would serve my purpose. But sadly, the zipper never opens. I have all my money and gift cards in this section and at the moment can't get to them. I think I may have to resort to scissors to cup the leather open. It's like the sipper gets pulled past the point where it should stop and then I can't get to it. This has happened over and over since the day I bought it and with enough brute strength I eventually get it open and always swear I'll never zip it closed again.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucille M. Zimmerman",
      "helpful_votes": 3,
      "publication_date": 20171018
    },
    {
      "title": "Disappointed",
      "text": "I was excited to receive this wallet and disappointed to have to return it. It looked and felt very cheap and had a horrible chemical smell to it. It was meant to be a gift and the actual product box was rather mangled, the shipping box was fine. The zippers and snap closures also seemed like they may not hold up. My Samsung Galaxy 6, in its Otterbox fit in the pocket inside, but the snap would not close.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Ball",
      "helpful_votes": 6,
      "publication_date": 20161228
    },
    {
      "title": "A nice wallet with great quality",
      "text": "Love this wallet. If I don't feel like taking a purse with me, it will hold my phone and a pen, in addition to all of my store loyalty cards, ID, bank cards, credit cards, cash, coins. I love the quality and the thickness is just right. I love the wrist strap, and I like the security of the zipped money side and snapped credit card side. The color is lovely and the quality very high. All the compartment just what I was looking for definitely will buy different color.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary khouchaba",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Sleek and practical!!!",
      "text": "It's lovely. I got the coffee color and it's very sleek and definitely practical. The packaging is very nice too. It came in a nice box with a little packet of dried flowers that smells wonderful, and bejeweled owl necklace. I'm very happy, I've been searching for a new wallet for months!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 128,
      "publication_date": 20160514
    },
    {
      "title": "Great wallet...  packaging, not so much.",
      "text": "I am VERY happy with my wallet. It is exactly as I expected. Quality is good. Like the color. Based on this, I would purchase ItsLife products again. Now, the bad news. Packaging was terrible. So glad it wasn't a Xmas gift as box had a crushed corner and would not look nice wrapped. THIS IS NOT ITSLIFE FAULT. This was packing by Amazon and late delivery and rough treatment by UPS SurePost. This is 2nd problem I've had with both of them in 2 wks. My last package was refused by local Post Office because it was destroyed because of the same thin bag packaging and rough handling. Again.. NOT ItsLife's fault. I rate them an A+",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Great wallet.  Very good quality",
      "text": "I was researching new wallets. I had a Coach for about 10 years. The only thing I liked about it was the style and how much I could get into it. However it was very bulky. Took up a lot of room in my purse. I had never heard of this brand but did lots of research on it and several others. I can get more in this wallet and not near as bulky as the one i already had and more room in purse. I saw where some had a problem with the leather odor. There was a slight leather odor but resolved. I also happen to like the new leather smell",
      "rating": 5.0,
      "verified": true,
      "author": "Radnurse",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "GREAT WALLET",
      "text": "I LOVE this wallet. The color is absolutley beautiful!! It is very spacious and has several pockets for credit cards. The only reason I gave it a 4 and not a 5 is that when I put cards in all of the slots it's a little harder to close but I would definitely buy another one. I am considering which color to buy. This wallet is great and it comes beautifully packed with an owl. Definitely a keeper!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170705
    },
    {
      "title": "EXCELLENT QUALITY, EXCELLENT DESIGN, EXCELLENT WORKMANSHIP, BUILT TO LAST",
      "text": "I hate all the items that state real leather when it is PU leather, which is plastic/vinyl. AMAZON should police this issue as I have returned many items stated real leather and it was real PU leather, which IS NOT LEATHER! Take care with authentic leather, it does not fray and it smells like leather. No smell or flat edges, means it is fake. Also, this so called \"vegan leather\" marketing ploy is a joke, You are paying premium prices for something that is not leather at all. Leather is out of animal hide, lasts a really long time and looks better with age.!",
      "rating": 5.0,
      "verified": true,
      "author": "Mz Nina, business consultant and aspiring artistTop Contributor: Coloring",
      "helpful_votes": 13,
      "publication_date": 20170322
    },
    {
      "title": "I don't recommend",
      "text": "This wallet is made of nice leather, but the whole set up feel \"backwards\" to me. Each layer face opposite way than is comfortably usable. I was hoping I'd get used to it, but it just isn't happening. A disappointing purchase for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Patti E.",
      "helpful_votes": 4,
      "publication_date": 20180701
    },
    {
      "title": "Wonderful, except for the zipper.",
      "text": "So I love this wallet, except that the change pouch has the biggest, ugliest, bright brass, cheap zipper. The zipper doesn't open easily and has rather sharp edges. If not for the terrible zipper this could easily be a $100 wallet. The color is rich. It has plenty of card pockets. It has stood up to daily use over the course of several months without any negative signs of wear. I keep telling myself I'll have the zipper replaced but I'm not really sure where to take it.",
      "rating": 3.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 3,
      "publication_date": 20171016
    },
    {
      "title": "It's so beautiful",
      "text": "I purchased the waxed coffee, it is gorgeous and has a lot of card holder slots. Unfortunately, I had to return it only because I bought a new handbag and I'm searching for a wallet that matches the color. It's a weird brown, like a cross between coffee, chocolate brown and mahogany. I'm sorta OCD, oh, who am I fooling, I'm OCD and if it doesn't match my handbag, it'll drive me crazy!!!! Other than that, I would definitely recommend this wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "Elle Mo",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Looks Amazing",
      "text": "So far it seems perfect. The color is gorgeous! The leather is gorgeous! It fits all my cards which is the first time I have find a wallet that does. I never thought I would find a wallet that would replace my red leather Levenger wallet but this one has, at least for now. Time will tell if it holds up to intense use but so far it appears to be everything I ever wanted in a wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "N.Haley",
      "helpful_votes": 5,
      "publication_date": 20170411
    },
    {
      "title": "Great wallet!",
      "text": "I love the color. The leather is super soft, which is what I wanted. It has plenty of slots for credit cards, business cards, etc., it also has room for a checkbook and a slot for cash and change. I'm very happy with it. It's a great purchase! I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia Wells",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Itslife Women's Large Capacity Luxury Wax Genuine Leather Cluth Wallet Card Holder(apricot)",
      "text": "My most important purpose for buying this for my wife is the RFID blocking for all her chipped cards. It also looks nice, is the right size that my wife likes, and will hold all that she has in her current wallet. Bought this for a Christmas gift, but I am planning to give it to her sooner because of the RFID protection. Interesting thing though, the wallet did not come with any notice, certification, or identification that it is RFID safe. It is advertised on Amazon as such, but nothing came with the wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "I'd buy another if I thought I'd live long enough to use it!",
      "text": "I'm so impressed with this wallet! It fits all my cards, checkbook, change and still there's room for more crap! The color is more subdued than what is shown online, it's more of a blue gray than lt blue. The leather is good quality, soft and I like the two snap options for closing the wallet. This is replacing the inherited, but brand new, Ralph Lauren checkbook wallet that only holds about six cards and a couple singles, and even then won't close...had to remove individual checks to keep with me because the checkbook wouldn't fit!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Sidlow",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "I’m picky and love it! Plenty of room for everything and is well made and pretty!",
      "text": "I like this wallet very much. I like to have a number of places to put bills and a checkbook and this holds everything nicely and it has an external zippered section for change which I like. I don’t have to snap open the wallet to get to change. It has lots of slots for for credit cards, insurance cards and business cards. You could use one section to put receipts if you’d like. I got the apricot, but it’s more brown. It’s pretty and looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "BEAUTIFUL WALLET",
      "text": "THERE ISN'T ANYTHING ABOUT THIS WALLET I DISLIKE. IT IS WELL MADE, PLENTY OF COMPARTMENTS AND SPACE FOR CREDIT CARDS. IT HAS A ZIPPER SECTION YOU COULD PUT YOUR PHONE IN OR A POCKET WITH SNAP YOU COULD ALSO PUT YOUR PHONE IN/OR CASH. GREAT WALLET FOR THE PRICE. THIS IS A BEAUTIFUL WALLET.",
      "rating": 5.0,
      "verified": true,
      "author": "BarbND",
      "helpful_votes": 2,
      "publication_date": 20190404
    },
    {
      "title": "absolutely love this wallet",
      "text": "absolutely love this wallet! I searched everywhere for a wallet that would hold all the store cards, credit card, pictures, etc., and not be so bulky and hard to locate items in it and never could find one that was easily accessible. This one is the best. It has lots of room for everything and you can find whatever you're looking for without any trouble. Plenty of room for change, dollars, and even your cell phone and it's still not bulky and doesn't take up a lot of room in your purse. Highly recommend this wallet - it's great!",
      "rating": 5.0,
      "verified": true,
      "author": "cmansour",
      "helpful_votes": 4,
      "publication_date": 20161203
    },
    {
      "title": "I love this wallet and you will too! Trust me!",
      "text": "This wallet is perfect, it is functional with a a lot of space for everything you need without being bulky. The leather is smooth and beautiful, I got coffee, it is in perfect condition with stellar packaging. I have no issues taking my cards and ID in and out, especially considering it is a brand new wallet. There is space for my store cards separate from my credit and bank cards and even another section for gift cards and insurance cards! There is so much room and it is so convenient to have everything visible and separated. The packaging was A+ and makes for a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Almost perfect",
      "text": "I really like the color and flexibility of this wallet. Only gave it four stars on craftmanship because I have to fight to get the inner change part of the wallet closed. Clasp does not close easily. Other than that, I really like this clutch purse.",
      "rating": 5.0,
      "verified": true,
      "author": "V's Cookn",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Cheap feel",
      "text": "First I have to say that my phone OnePlus 6 T fit perfectly in the pouch. However the wallet has a cheap feel. This one doesn't have the wrist band so you can safely carry it in your hands. I usually keep it under my armpit, not comfortable at all. This wallet is big! Bigger than most purses. I'll keep it for few more weeks then I'll get another one.",
      "rating": 3.0,
      "verified": true,
      "author": "Adar40",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Good wallet!",
      "text": "I like this wallet. I bought the cowhide one. It is soft and comes in a nice red colour. It has more card slots than I need, but it is ok with me. My phone fits inside the snap closed section and it's convenient. I hope it will last long. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Kom",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "LOVE!",
      "text": "My husband bought this for me for my birthday in November and I LOVE IT!!! It has held up incredibly well and still looks brand new. It takes a beating from my and my three kids digging through my purse multiple times a day and you can't even tell. I love having an organized wallet and this has a place for everything I need to store. The color is beautiful and the wallet itself is made very well. I have two purses that I switch between and this wallet matches both and looks like a very expensive designer wallet!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "great wallet!",
      "text": "I go through wallets pretty quickly, it seems. Replacing my last one, I decided I wanted something that would go with everything (since it's a lot easier to change purses than it is to change wallets) and I wanted it to last. This wallet is well made, and very stylish. Plenty of room for everything I need inside without being bulky at all. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Alvey Harris",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "High quality, great value",
      "text": "This wallet exceeded my expectations. The color is beautiful, it feels nice to the touch and looks high end for a low price. Tons of card slots, a cute little snapping pocket that fits dollar bills perfectly and a zippered pocket for coins. I saw a suggestion that the zippered pocket could be used for a phone, but for me, it was too tight of a fit. The only negative for me was the I.D. slot. It is very tight and if you need to remove the I.D. it is a struggle. I have some ideas to make it work for me so I still give this wallet 5 stars. Just go for it, you won't regret it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "What A Beautiful Wallet!  😍😍",
      "text": "This is a beautiful and wonderfully made ladies wallet that looks very very expensive and is durable, holds its shape well, and does not scratch easily! All of the snaps and zippers on it do stay closed-and do not have a tendency to pop open if stuffed too full. This is a wonderful find and an extremely good deal!! I would have paid three times the amount that I did on Amazon for this high-quality lovely wallet... it is that wonderful!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa D",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Colors don’t match...",
      "text": "The colors are really misleading. Overall the wallet is amazing and perfect in every way, and exactly what I was looking for. But I HATE the color... Like, I want to return it that’s how much I don’t like the color. I was expecting it to be more of a darker wine red, with a hint of purple if that makes sense. This looks more like Brick Red. Not at all for me. That’s the only reason I can’t give it 5 stars. I realize that sounds petty, but the colors on display are way off from what you actually get.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole M.",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Great Design",
      "text": "I love this wallet. There's no evidence of the technology that's suppose to blocked the invasion of my security and protect my credit card info from being shared. So, its hard to confirm if this wallet does what it says it does. But, the craftsmanship and design of this wallet makes this such a great item. And I can tell that it will last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "MPJ",
      "helpful_votes": 7,
      "publication_date": 20161105
    },
    {
      "title": "Beautiful and Spacious Wallet",
      "text": "I bought this wallet in dark fuchsia, and after I ordered it I started worrying about the color, and that it might look tacky. However, I was pleasantly surprised when I received it. The smooth waxed finish on the wallet is rich and beautiful, and the color is gorgeous. It's spacious, and there's plenty of room to hold all your cards, coins, and anything else you need. I'm happy that all my essentials are available to me, at any given time.",
      "rating": 5.0,
      "verified": true,
      "author": "SueGC",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Very nice wallet",
      "text": "This is an adorable and well made wallet. It arrived quickly and came in a cute box with a pack of seeds and a free necklace. The ONLY negative is that I wish the closure was a magnet instead of snaps. I recommend this wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "AngieShep",
      "helpful_votes": 22,
      "publication_date": 20161016
    },
    {
      "title": "Great quality, holds everything",
      "text": "My fiance bought this wallet for me as a Christmas present. My wallet was falling apart as it couldn't hold everything and Inwas always losing things at the bottom of my purse. I also didnt want some big chunky wallet either. This is perfect for all I need and I love all the slots and pockets. I can tell it is made of good quality and will last me a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen B",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Perfect addition",
      "text": "Traveling through Europe and even the USA one becames very aware of those people trying to scan your cards/phone/passport. So, to stay vigilant I wanted a RFID wallet. In the past I’d just use a separate holder for my cards and passport and then just a coin purse for money. This gem I’m covered..... No more carrying multiple wallets. I just got it and had MORE THAN ENOUGH slots for the few ID’s I carry. I have an area for my passport, coins, cash, and business cards I wanted to save. It looks great and no weird smells. I’m super stoked! Bonus, I got the cute little owl necklace with my wallet that I didn’t order.",
      "rating": 5.0,
      "verified": true,
      "author": "N. C. Ariens",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "finally QUALITY and attention to DETAIL -- soft leather, loads of pockets -- I'm in Love...",
      "text": "After SO many crappy purchases, FINALLY to find one that is just right. It could be a little longer but really, that's not saying much. First, the leather quality -- soft and speaks quality. Second point: metal zipper -- THANK YOU, God. What is it that almost everyone uses nylon? Third point: love that BIG snap pocket inside. It really make my life more manageable. Fourth point: WOW, how many slot for credit cards, etc? That is the biggest selling point, aside from the obvious QUALITY and CARE in craftsmanship. All I can say is...what took you so long to get to Amazon? I could have save HUNDREDS if I found you first. :o) See...I'm all smiles...",
      "rating": 5.0,
      "verified": true,
      "author": "C. Jack",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "It checks all my boxes.",
      "text": "It took me more than 6 months of looking for a wallet that looked great but would hold what I need. I saw the Itslife wallet online and thought it was probably not what was advertised but decided to take a chance. I am not disappointed at all. The craftsmanship is exquisite and the quality of materials is more than I had hoped for. Because of this great product I trust this company to produce other products to meet my needs. I am thrilled with this wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "avid reader",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Perfect size, function and price",
      "text": "Flexible wallet. I only needed slots for 12 credit cards but this wallet has 20. It allows me easier removal of cards as they’re needed. Large zippered coin opening. I can’t find anything wrong with this wallet. Nice leather. (I Initially purchased a pretty Mundi wallet at my local store but upon getting home and trying to put the credit card in the slots they wouldn’t go in). I don’t have time to go to multiple stores looking for a wallet when Amazon buyers have already done the walking and reviews for me. Glad I bought this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Rogolfer",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Love the wallet!",
      "text": "I love the color of the wallet. I also like that there are two snaps, so if I fill it too full, I can choose a looser snap. The only thing that I would improve is I would add a thumb hole in the drivers license window because it is difficult to remove my drivers license from that pocket. Also, I tested the RFID blocker by putting a hotel key in it. It didn't work with the key inside my wallet, so my thoughts are that the RFID block works.",
      "rating": 5.0,
      "verified": true,
      "author": "lovevolleyball",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "I really like this wallet",
      "text": "Really good wallet so far. Lots of places for shopping cards, credit cards, license, etc. There are two places for money. A zippered pocket accessible without opening the wallet, or a snap-open pocket when you open the wallet. I like the idea of the zippered pocket so I don't have to open the wallet and it keeps change in place, but putting change AND bills in the zippered part doesn't fit well. I end up having to fold the bills and stuff them in so the zipper doesn't run them over when closed.",
      "rating": 4.0,
      "verified": true,
      "author": "SLN",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Great value leather wallet for the price",
      "text": "This wallet it much nicer than I expected, particularly for the price. It has a lot of slots for credit cards. There is space for bills and change, and I like that I can keep it in my purse and access the money. The only slight negative is that there isn't a clear slot for the license, so that has to be removed, but it isn't a problem for me. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Propst",
      "helpful_votes": 6,
      "publication_date": 20160817
    },
    {
      "title": "Highly recommended",
      "text": "Beautifully presented with a little owl pendant. Would be a great gift. The wallet is crafted with care in a nice genuine leather. The color is true to picture and really lovely. Tons of cards pockets. I can finally have room for all my insurance cards. You can put your phone either in the center pouch or in the side zippered one. Although the phone with a case is a little too tight in the zippered pocket. I live this wallet. Beautiful, practical and not too bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "Tempo",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Quality plus",
      "text": "This my second wallet from this company, and you can’t beat the craftsmanship and quality. I still have my one I bought several years ago, and it still is in good condition. I was just ready for a change in color and style. I am keeping my older one for when I just want a change. The blue is my old one and the new is dark brown in the picture. It can also hold a lot of credit cards, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "I went with the waxed leather in coffee and the color is perfect! Browns are always tricky because the wrong shade ...",
      "text": "I am thrilled with the quality of this wallet! I went with the waxed leather in coffee and the color is perfect! Browns are always tricky because the wrong shade can make something look very cheap - that is definitely not the case with this wallet. It has more than enough card slots for all of my items and the slots aren't too tight on my cards that it takes me ten minutes to pull one out. I really like the built in pouch and the zippered area. I plan on purchasing this item in multiple colors to match all of my bags!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Hudson",
      "helpful_votes": 2,
      "publication_date": 20170729
    },
    {
      "title": "Beautiful wallet.",
      "text": "It arrived very fast, and was nicely boxed. Gorgeous color and it feels luxurious. There is lots of room for credit cards, pocket for a phone or change. It came with cute owl pendant. Love it already and I have it only about a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Ewa O.",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Not Purple",
      "text": "I like this wallet. All of my cards fit in it nicely. My I-phone 6S-plus fits in it too, but I don't prefer to keep it in the wallet. Even with the I-phone I could snap it closed. I only gave it a rating of 4 stars because of the color. It is not purple, it is a very different color than what is shown in the picture. It is more of a dusty plum color. It's okay, but not the purple I really wanted. I added a photo to show the color of this wallet compared to other leather items that I consider to be purple.",
      "rating": 4.0,
      "verified": true,
      "author": "Dart17",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Best Wallet I Have Ever Had",
      "text": "The wallet came beautifully packaged in a box and wrapping and included a scent bag, very posh! Excited to be able to protect my credit cards from outside electronic sources. Wallet has plenty of pockets for all of the, a zipper pocket for change that actually closes completely so no coins escape and plenty of extra pockets spaces to keep miscellany like stamps, appointment cards, etc. Large enough to hold everything but still able to fit into my smallish sized purse. I am finally organized! And the price was very reasonable. I am very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Really",
      "helpful_votes": 3,
      "publication_date": 20170117
    },
    {
      "title": "Beautifully made, holds mountains of stuff, very attractive",
      "text": "Not only is this an extremely well-made, attractive wallet, it has a whole bunch of card slots with room to spare. Holds a check book, loose change, slots for coupons, money, gift cards, and two snaps for when you really stuff it. Even when you really stuff it, you can still snap it closed on the first snap (you will see what I mean when you get the wallet). This is absolutely the best wallet for women on Amazon. It's relatively compact and holds the most stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Bird Person",
      "helpful_votes": 2,
      "publication_date": 20180109
    },
    {
      "title": "I've been very pleased with this wallet",
      "text": "I've been very pleased with this wallet. The blue color is nice and subtle and it looks just like the photo. Bills can lie flat in their own compartment, and there's also a nice zipper compartment that I use for stashing receipts. There's plenty of room for credit cards. If I have one criticism -- and this is very minor -- it is that the ID compartment is covered with fine mesh rather than being clear; that probably makes it more durable but you do have to remove your ID for it to be read. But definitely a 5 star product overall. I'm tempted to buy another just to have one for the future or for a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "emino",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Picture doesn’t do justice!",
      "text": "The picture for the waxed red just does not accurately show the deep rich beauty of this wallet. I have the pebbled purple and really like it but this rich red with contrasting black trim is off the chart gorgeous! The wallet felels good, is the perfect size for me, and has abundant areas for keeping everything organized. I noticed no smell. It was packaged beautifully and I am extremely happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Mae",
      "helpful_votes": 2,
      "publication_date": 20180207
    },
    {
      "title": "Better Than The Picture",
      "text": "I was very impressed with the quality of this wallet. I'm in no way compensated for my review and have nothing to gain by giving my review. But, I like to give credit where credit is due. And this purchase is, so far, one of my favorite in many years. The leather is not plastic feeling nor does the hardware (zipper/snap) give the impression that it won't last. The inner section of the wallet, where credit cards can be saved, does not remove, yet the wallet stays slim even with a full amount of cards inserted. I purchased the dark brown and it looks very classy!",
      "rating": 5.0,
      "verified": true,
      "author": "Speedracer Girl",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "tight credit card slits",
      "text": "I really like this wallet's appearance, and capacity for credit cards, etc. But - some of the sections for credit cards are very snug in each slot, making it difficult to remove the cards. I was tempted to only give it 3 stars, but I have been looking for a wallet with this amount and type of organization for quite a while, and the only ones I found had to be zipped and unzipped to use the wallet. Also, this item looks more expensive than it actually is.",
      "rating": 4.0,
      "verified": true,
      "author": "dina w.",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Great wallet",
      "text": "Nice wallet. It’s not cheap looking and I love that my iPhone XS Max fits well. I have the Otterbox Symmetry case on the phone and it’s snug but does go in. I don’t have a lot of credit cards but this has slots for at least a dozen of them. The one drawback I see is that there is no wrist strap. I love the convenience of having everything together but you still have to carry it instead of being able to slip it onto your wrist. Small price to pay for a wallet that fits an iPhone Max.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela M.",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "BEST WALLET EVER!!",
      "text": "Not only is the leather the most nice (slightly soft but supple) but the color is also very nice. And the credit card slots are so well arranged and large enough to fit most everything. I even have the giant snap pocket inside...EMPTY! It's awaiting its assignment! Such a beautiful wallet. I LOVE IT!! You WILL NOT be disappointed in this wallet!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Sue",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "I love this clutch/wallet",
      "text": "I love this clutch/wallet. It is big but I love having a separate pocket for each of my credit and health cards so I can get them out easily. It is very well made and looks like it cost a lot more than I paid for it. I would have given it five stars except I felt that the place for bills is a bit hard to access, and the clutch arrived with a very strong chemical smell which is dissipating as I use it. It is classy looking and I love it!",
      "rating": 4.0,
      "verified": true,
      "author": "Eleanor",
      "helpful_votes": 3,
      "publication_date": 20170418
    },
    {
      "title": "Worth the cost",
      "text": "It's a truly beautiful wallet. I have 12 cards in it and room for more. It is very soft to touch, smooth like butter. It first well in my small hands, and getting the cards out with one hand is not difficult. The zipper pocket will fit a check deck and register without any other covering ( such as a cover from the bank). The color is gorgeous (I got the Apricot) it's a deeper, slightly darker khaki color with a golden highlight to it. It arrived on time in a mailer type envelope. Came inside a sturdy box wrapped in a very nice polishing cloth. Would be more than awesome as a gift. I can recommend this wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "Miki Harmon",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Excellent quality",
      "text": "Excellent workmanship. Very nice design and nicely functional. Also, for those who think RFID protection would show in some way, it does not. Looks exactly like a very nice wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Seltzer",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "it smells so bad even with spray it could not get the order ...",
      "text": "it smells so bad even with spray it could not get the order out. its brand new pretty and gorgeous box but the smell is so bad Im scared to put it in my favorite bag, it may stink it up. its a strong chemical order awful.",
      "rating": 1.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 3,
      "publication_date": 20180716
    },
    {
      "title": "Strong chemical smell",
      "text": "I bought this because I was paranoid about someone reading my credit card information. I’ve had it for months now and it still gives off a very strong chemical smell. The wallet is supposed to be made of leather, but it feels like plastic to me and it definitely does not smell like leather.",
      "rating": 1.0,
      "verified": true,
      "author": "Annab",
      "helpful_votes": 4,
      "publication_date": 20180304
    },
    {
      "title": "Gorgeous",
      "text": "This is an awesome upgrade for me. I had been using a wallet that just fit my phone (Motorola Droid). It was cheap ($10) but an extremely tight fit. The last time I bought it , my phone wouldn't fit. Finding this wallet was a godsend. There is room for everything. It's perfect for when I don't want to carry my purse. Looks and feels good. Definitely worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Banks",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Great Leather, Love This Wallet, Zipper Iffy",
      "text": "Zipper on the side is a little iffy. I use that pocket for my phone, which works great, but the zipper separates if the wallet is too full. I'm a dude, and expected this wallet to be a little more deep red, and it's truly fuschia. That means it's got some purple in there too. Very brightly colored. Leather is beautiful, holds everything you need, etc... I'd definitely recommend. Again, zipper looks to be the only issue long-term.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary Rouse",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Exceptional Product.",
      "text": "The craftsmanship is beautiful. It's larger than I imagined with room for every card you have in your purse. Has a built-in compartments for a slim cell phone, change and bills. Can be carried as a clutch of within deep, wide pants/jeans pocket. The leather is smooth with a high gloss, durable. Should last for years if cared for. I recommend using a natural cleaning & preserving product like Saddlesoap. Best wallet I've bought in my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Nico",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Beautiful Wallet better than I expected!!",
      "text": "Love it is perfect. I always had issues with not enough space for my credit cards, store membership card and also cash. This wallet is the first in my search and buying different wallets for the last 2 years that I am able to fit everything and still have room for more if I want!!! Plus the color is beautiful and the feel is smooth soft and so very strong!! This is the best ladies wallet I ever had!!",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa3",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good Organization!",
      "text": "This wallet was every thing I was looking for in security. I plan on traveling this fall and needed a wallet to keep my credit cards secure and to keep people from being able to scan my information. It has a lot of storage and slots for my credit cards and phone. Also, love the double snap on the front to allow for more room. Quality is great! The only complaint I have is the zipper is a little flimsy, but other than that, everything is fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Capital One",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Bad zippers",
      "text": "I loved the wallet till I was in a store and the zipper malfunctioned and I couldn't get to my money to pay. I ended up having to cut down the side of where the zipper attaches to get to my things in the zippered pocket. And no, nothing was stuck in the zipper. Thst was my first thought. It was less than 2 months old when that happen. I will purchase something else from someone else.",
      "rating": 3.0,
      "verified": true,
      "author": "heidi turgeon",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Not at All what I expected",
      "text": "First of all, the color was not the kind of marbled finish I was expecting that was shown in the pictures. It is just a plain fuschia. The wallet is also very flimsy and thin and was already bent in spots. I have a hard time believing this is genuine leather. It is very roomy, and fits my phone and everything else I want to put in it. However, I can't see this wallet holding up for very long and for the price I was really expecting better quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190628
    }
  ],
  "product_meta": {
    "title": "Itslife Women's RFID Blocking Large Capacity Luxury Wax Genuine Leather Clutch Wallet Card Holder Organizer Ladies Purse",
    "rating": 4.6,
    "feature_bullets": [
      "The wallets for women is made of advanced and prime grained leather with wax finish, feels luxury and comfortable. The womens leather wallet looks even better after using for a long time",
      "Leather lining",
      "Snap closure",
      "RFID Blocking Wallets - The womes wallet is Far Superior to many alternatives in the market today made by using household aluminum foil being used inside a wallet. The Itslife womens rfid blocking wallet offers security and privacy at a premium. Features a unique military grade shielding technology & proprietary blocking material.",
      "Large Capacity Womens Wallets - The leather wallet is multifunctional with 21 card slots(including 1 id window),3 full-length bill compartments,1 snap cash pocket and 1 zipper phone case.Keep your credit cards, cash, coins, notes, receipts,checkbook and your cell phone well organized,Ultra Practical",
      "Dimensions: 7.56\"L x 4.13\"W x 1.57\"H(19 x 10 x 3 cm), Perfect as a wallet,but spacious and stylish enough to be carried as a clutch. FIT for iPhone 11(without phonecase) Pro Max X XR XS Max 7 8 Plus.",
      "Amazing gift for her - The womens wallet arrives in a lovely box which can be a wonderful gift on Birthday, Anniversary, Valentines Day,Mothers' Day, Thanksgiving, Christmas Day, and other holidays! Perfect for a dear friend or beloved family member.She will be very happy when receive it.",
      "1-YEAR MONEY-BACK GUARANTEE - If you are not delighted by our wallet return it within 12 months for a full refund of your purchase price."
    ],
    "categories": [
      "Accessories",
      "Women",
      "Clothing, Shoes & Jewelry",
      "Wallets, Card Cases & Money Organizers",
      "Wallets"
    ],
    "price": 32.99,
    "specifications": {}
  }
}