{
  "website_summaries": [
    {
      "verdict": "Sharp scissors designed to cut leather, art/craft materials, and carpet.",
      "pros": [
        "Suitable for dressmaking and upholstery",
        "Strong hinge",
        "Very reasonable price"
      ],
      "cons": [
        "Scissors aren't the highest quality, and a few owners find fault with them for heavy-duty jobs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great quality and cut",
      "text": "The scissor was big enough and easy to use. I read other reviews and went with middle Size for My project and it was perfect. I was cutting the leather tops Off a pair of boots- multiple thin layers of leather. Not one Knick! Cut was straight and sure! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 8,
      "publication_date": 20190330
    },
    {
      "title": "Everyone needs to own at least one pair of fine scissors in a lifetime",
      "text": "These are the finest scissors I have ever used. I cut the rug padding like it was soft butter. I also removed akll the labels off my nice towels and wanted it to be a really clean cut and it was. They are big and a bit intimidating at first... but just take them around the block once and you'll never let go.",
      "rating": 5.0,
      "verified": true,
      "author": "Egan",
      "helpful_votes": 6,
      "publication_date": 20180809
    },
    {
      "title": "Heavy duty comes to mind after using these pretty extensively for a couple of weeks",
      "text": "These are well designed and well made. Heavy duty comes to mind after using these pretty extensively for a couple of weeks. These were used to cut 20 ft rolls of insulation into 4 ft sections. Worked very well especially when stud wall areas were not at 16\" centers. After using to install around 800 sq ft of insulation, shears still very sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell J.",
      "helpful_votes": 9,
      "publication_date": 20180111
    },
    {
      "title": "Nice Shears",
      "text": "Very good size, heavy duty, very sharp and easy to use. Arrives in a nice storage box with plastic cover for the points. I used this to cut very heavy carpet padding.",
      "rating": 5.0,
      "verified": true,
      "author": "CS in Alabama",
      "helpful_votes": 13,
      "publication_date": 20170316
    },
    {
      "title": "Best pair of scissors I've ever owned!",
      "text": "These scissors really are incredible! I have used them to shorten the length of several pairs of jeans that I own that are just way too long for me. Denim can be a heavy, or thick type of material, and these scissors cut through with precision. They may, or could feel heavy for some hands, but they certainly get the job done. So very happy with them!",
      "rating": 5.0,
      "verified": true,
      "author": "Deirdre A Simon",
      "helpful_votes": 2,
      "publication_date": 20200827
    },
    {
      "title": "This product is awesome!!",
      "text": "This product is awesome!!! I needed to cut up an old carpet. I was pleasantly surprised at the ease of use. The scissors cut right through it like paper. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth H.",
      "helpful_votes": 6,
      "publication_date": 20170623
    },
    {
      "title": "Really excellent quality",
      "text": "These are fabulous scissors! Nice heft to them, smooth action, very sharp. I have been using them on everything from garment-weight leather to fabric to snipping thread when I can't find my thread snippers. Really happy with these. Astonished by the price! Much nicer than more expensive scissors I've had in the past. Also the gold handles look very classy, and when I've got a bunch of stuff on my workbench they are easy to spot!",
      "rating": 5.0,
      "verified": true,
      "author": "mms",
      "helpful_votes": 2,
      "publication_date": 20180108
    },
    {
      "title": "Great heavy {and pretty} scissors ❤️",
      "text": "This is a great pair of scissors, they have some weight to them which I like and they are very very sharp. If I had a complaint it would only be that the don’t open as wide as some other scissors do. Other than that they are great, I feel these will last for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "TG",
      "helpful_votes": 3,
      "publication_date": 20190407
    },
    {
      "title": "Surprisingly good!",
      "text": "These scissors came so quickly and they were beautiful and weighted. They looked exactly like the picture. Very heavy and feel so good quality. Beautiful in person. The box states that it comes from China but the box does not have an odor and shipped quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiwi W.",
      "helpful_votes": 4,
      "publication_date": 20180723
    },
    {
      "title": "Not for us",
      "text": "Bought these to cut and process soft crabs there too long for my need and are not solid, they're two piece put together with small Gap areas that leaves room for rust I'm sure they're fine for craft and indoor use but no good for what I'm using them for Went with solid stainless steel Fiskars. Much better for us",
      "rating": 1.0,
      "verified": true,
      "author": "D0L",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "I LIVE THESE!!!",
      "text": "I absolutely LOVE this set!!! I was concerned about the quality when I saw the pricing, but I’ve been using them all day, every day for over a month now and they’re still sharp and good to go. The small scissors are great to use while I’m sewing on a machine!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Hennemuth",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great shears",
      "text": "Great shears, high quality. I have cut cloth, gasket material and auto insulation.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Brillinger",
      "helpful_votes": 3,
      "publication_date": 20171223
    },
    {
      "title": "Not for delicate fabrics.",
      "text": "Heavy duty, it handles any fabric with no problem. the only problem was the metal it got rusty very quick, i handle lots of expensive fabrics for my Upholstery shop, and that can be a problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Raul Martin",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Nice scissors!",
      "text": "I wanted to get my husband some new fabric scissors and these worked out amazingly. We both love using them on our sewing projects. They cut all fabric (that we’ve used so far) so easily and clean. The scissors you use can really make or break your project and these are amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Snelso",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Beautiful",
      "text": "Beautiful gold color. Looks more expensive than it actually cost. The blades are sharp and the scissors them self feel heavy like they were made very well. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenni M.",
      "helpful_votes": 5,
      "publication_date": 20170219
    },
    {
      "title": "Not great for leather",
      "text": "I'm using this product to cut leather for a project I'm doing. The scissors are still hard to use and requires a lot of effort to cut the leather, which is about 0.093 inches thick. I don't recommend this product for leather greater that 3/32nd inches.",
      "rating": 4.0,
      "verified": true,
      "author": "Elkman",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Good Purchase",
      "text": "Not too heavy. Value for money. As described by vendor.",
      "rating": 5.0,
      "verified": true,
      "author": "theona knight",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Heavy duty",
      "text": "Liked it was heavy duty, didn't like or know if the plastic covering is suppose to stay over hinge nut/ bolt.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Heavy Duty Scissors",
      "text": "I have no complaints with these scissors. Besides they look awesome and elegant, they do their job very efficiently. I use them to cut mostly cardboard, and trust they exceed in that job! I never tried them in anything else, so I can give you a further review.",
      "rating": 5.0,
      "verified": true,
      "author": "carlos4nyc",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "If you would asked me, I would have said from germany...",
      "text": "Some of the best things to come out of China. Nice solid feel to them, balanced. I uqve huge hands and fingere and these had nice roomy holes to operate in. And share as sharp could be. Snipped 5-6 oz leather easily with little effort",
      "rating": 5.0,
      "verified": true,
      "author": "steve p.",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Clean cuts, sturdy construction. oiled blades.",
      "text": "Heavy duty, sharp, and they come oiled. These things are wonderful. I used them to clean cut some thick leather gloves and they cut clean lines with no fray. Awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian JK",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Very heavy duty shears",
      "text": "Perfect heavy duty shears for cutting leather upholstery for automotive. They cut heavy waxed canvas like paper. Stern and physically heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Very sharp",
      "text": "They might be bulky but they are very sharp and sturdy! I used them to cut jeans into shorts and had no problems. They don't snag at all. I am very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Perfect",
      "text": "Super scissors...excellent heavy duty construction....the finishing work on the scissors is beautiful. They feel great in the hand and cut with just the tip or in a full stroke. Passed my double thick canvas cut without any effort. These will last a lifetime of heavy work.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Kusto",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "These are some darn good shears. No one gets to borrow them.",
      "text": "These wouldbe whatmymom would have called her \"good shears\"... and were off limits to everyone else. These are awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike64",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Wonderful!!!",
      "text": "These are wonderful. They cut thru the 3 inch mattress toppers effortlessly. They are heavy but that makes them sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "3Ob1v7",
      "helpful_votes": 2,
      "publication_date": 20190611
    },
    {
      "title": "SATISFIED CUSTOMER...",
      "text": "They were true to size, sharp and with a screw that if I ever needed to sharpen them I could. I have no complaints..",
      "rating": 5.0,
      "verified": true,
      "author": "NELLIE WATTS",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "excellent scissors, well finished",
      "text": "excellent scissors, well finished, strong, beautiful, and serves all purposes. I recommend it, especially for those who work with tailoring.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "professional quality",
      "text": "had been looking for a heavy duty professional quality pair of scissors for a while. this is it. these are the kind that will last a lifetime. razor sharp and will get the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "thomas dimond",
      "helpful_votes": 2,
      "publication_date": 20190217
    },
    {
      "title": "Pretty and Sturdy!",
      "text": "Pretty and very sturdy! The best scissors in the house. Have had them for over a year now and the cut quality has not declined nor it's appearance.",
      "rating": 5.0,
      "verified": true,
      "author": "IleeC",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Great for the big jobs",
      "text": "I've really put them through the paces and they've worked perfectly. I wouldn't give them up or trade them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Sexton",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Nut include some kind of lubricant with the sheer.",
      "text": "It has gotten stiff and can hardly open and closed without hurting my fingers. I have in the past few days return to my old pair of scissors. I bought this pair because the blades are longer and could cut larger portion of fabric.",
      "rating": 3.0,
      "verified": true,
      "author": "Grace A.",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Decent, but not very comfortable",
      "text": "Had 2 defective pairs. They cut well, but overall they start to hurt my hand after using them. Typically used on cotton cord",
      "rating": 3.0,
      "verified": true,
      "author": "Tryer and DIYer",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Meh",
      "text": "It’s a good weight feels nice but the scissors are sharp towards the tip and towards the screw...the middle part was very dull and didn’t make a clean cut on my fabrics sadly",
      "rating": 3.0,
      "verified": true,
      "author": "Dominique Tuiza",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Sharp and stromg",
      "text": "I purchased it because I am fed up with breaking the handles of all the scissors I has an integrated metal handle and adjustable tightening screw. Good scissors!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Highly recommended.",
      "text": "Bought for cutting insulation. Works excellent, but be careful, very sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "David C. Crandall",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "One sturdy scissors",
      "text": "It seemed I'd go through a scissors every couple months until I got this bad boy. Sharp and well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy V.",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Good for fabric including denim.",
      "text": "Perfect for fabric. Good quality. Sharp blades and fit comfortably in my hand.",
      "rating": 5.0,
      "verified": true,
      "author": "shari",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Thrift shop uses it to cut up uniforms and it works wonderfully!",
      "text": "Its like the scissors my grandmother used when she was sewing. It cuts through cloth like butter!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Heavy, sharp, accurate",
      "text": "Bought these to cut 1/4\" foam tiles for flooring. Allowed me to make easy and straight cuts in that dense material. Very well built, worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "vectorizer",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Well made and cut very well.",
      "text": "Works great cutting a medium carpet. Would recommend them to family.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Hendrickson",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "I love them",
      "text": "I have tried them and the cut material super well. I have not used them a lot so , cant really say a whole lot, other than so far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "They are made for a gorilla",
      "text": "They are so heavy. If you have small hands and any kind of issue's like Arthritis or Trigger Finger. These are probably not the best choice for you. :(",
      "rating": 3.0,
      "verified": true,
      "author": "Toni C",
      "helpful_votes": 2,
      "publication_date": 20190106
    },
    {
      "title": "Awesome Scissors!",
      "text": "Awesome Scissors! They work better than any scissors I have ever used. They work excellent for cutting any fabric. I recommend buying this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "great product,well made",
      "text": "The old carpet didn't stand a chance. Well made and durable thanks",
      "rating": 5.0,
      "verified": true,
      "author": "char blose",
      "helpful_votes": 3,
      "publication_date": 20161018
    },
    {
      "title": "Their size and quality make it easy for older hands to use for domestic purposes.",
      "text": "They are comfortable to grasp and capable of cutting any thickness of cloth.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Cut great for less.",
      "text": "These are hard to beat for the price. I do leather work as a hobby, and couldn’t afford $100 scissors to use occasionally. These are sharp, they make precise cuts, and they are cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "Kennith Hill",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Work as advertise!",
      "text": "Best scissors ever, easily beat my last pair of high dollar scissors",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Great quality",
      "text": "These will cut through anything! Luv, bought for trimming, cutting fabric. I only wish i had gotten a smaller size as my hands arent that large, but at the time i was thinking go big or go home, so u may want to keep that in mind. But amazing scissors especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary rodriguez",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Scissors that don’t cut",
      "text": "The tiny snips are great, but the actual scissors suck. Been a tailor for 12 years and never have I encounter a pair brand new, freshly opened, unused, pair of blades that do not cut correctly. It’s as though The blades do not align so the fabric just slips between them which become difficult to cut.",
      "rating": 2.0,
      "verified": true,
      "author": "Rolend G.",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Smooth cutting action",
      "text": "I really like these scissors . Sharp and very smooth action . I think they’re very good for the price and at least look like they’ll last .",
      "rating": 5.0,
      "verified": true,
      "author": "mjh",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great for embroidery",
      "text": "My granddaughter loves them! She is learning to embroider and these two pair of scissors work great.",
      "rating": 5.0,
      "verified": true,
      "author": "janey",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "SUPER STRONG AND POWERFUL CUTTERS",
      "text": "SUPER STRONG AND POWERFUL CUTTERS - if you want powerful cutters - these will do it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "it is exactly what i need",
      "text": "i am using it for upholstery materials like fabric and leatheret ,and it is doing excelent",
      "rating": 5.0,
      "verified": true,
      "author": "Godfrey Solomon",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Mama for sure.",
      "text": "Love these! I named her mama. She is truly the mother of all scissors lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "The best scissors in the office!",
      "text": "When I received these, I knew I had to put my name on them. The quality is like WOW! I look forward to citing things with them... partially because I want to show them off! Haha They look like they cost so much more than they do. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel L.",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Great value for these incredible scissors!",
      "text": "These scissors surpassed my expectations. Given the price I assumed they'd be adequate but they are amazing! Sturdy yet not too bulky. Works like a charm.",
      "rating": 4.0,
      "verified": true,
      "author": "Cynthia L. Macias",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Strong and durable..",
      "text": "This is a amazing scissors. Cuts my leather the way I want it.. strong and reliable if you are into fabric or leather.. I would have one of these.. for small to large projects",
      "rating": 5.0,
      "verified": true,
      "author": "Mounika Krishna Kolla",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Great scissors just what I needed to finish a job",
      "text": "Great scissors just what I needed to finish a job,cutting material for bed headbands. They are great. Recommend thfm to my friends",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "A real scissor",
      "text": "Very substantial. Smooth operation. Longer than I expected, but that’s my error.",
      "rating": 5.0,
      "verified": true,
      "author": "Dancing",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Sharp.",
      "text": "Sharp, good grip and weight balance = good to work with.",
      "rating": 5.0,
      "verified": true,
      "author": "Ragnar  Traustason",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Large shears",
      "text": "My husband will use them to cut insulation.. he is very pleased with then....",
      "rating": 5.0,
      "verified": true,
      "author": "flyboyzmama",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Heavy Duty Scissors",
      "text": "I gave the overall product 4 stars because the scissors looked like they were used/returned. Overall nice heavy duty quality scissors. Cut through army fatigue fabric, will be tested on leather shortly.",
      "rating": 4.0,
      "verified": true,
      "author": "jeneen nicole",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Difficult to find shears this large in my area, ...",
      "text": "Difficult to find shears this large in my area, none of the home improvement or fabric stores carried anything this large. They are solid and sharp!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher R.",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Well designed with quality materials",
      "text": "Cuts through carpet, leather, heavy fabric stacks - like a hot knife through butter. Takes and holds a good edge - stays sharp. For a large scissors, is very accurate and maneuverable. Really well made.",
      "rating": 5.0,
      "verified": true,
      "author": "T.A.C.",
      "helpful_votes": 2,
      "publication_date": 20190706
    },
    {
      "title": "Heavy Duty and Sharp",
      "text": "These are nice, heavy-duty scissors. They seem well made and they’re very sharp. I also like how well they cut at their tips (for small, exact cutting).",
      "rating": 5.0,
      "verified": true,
      "author": "Never Give Up",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "huge",
      "text": "great big sharp all metal with rubberized coated handle cant be better",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Z",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Absolutely cute",
      "text": "So sleek and cute looking, works great. Cuts library/credit cards great",
      "rating": 5.0,
      "verified": true,
      "author": "DolceSmile",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "I loved them",
      "text": "Verry good nice and strong can cut anything with them",
      "rating": 5.0,
      "verified": true,
      "author": "Raul Guerra ",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Small finger holes",
      "text": "Sharp scissors, but can't get my fingers in the holes to use it. To small. For children?",
      "rating": 3.0,
      "verified": true,
      "author": "J Baldwin",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Great shears for upholstery",
      "text": "Very sharp and well built. Wiss design, great shears, can't even feel it cutting through vinyl.",
      "rating": 5.0,
      "verified": true,
      "author": "leroy",
      "helpful_votes": 2,
      "publication_date": 20191113
    },
    {
      "title": "a beautiful, very well made pair of scissors!",
      "text": "I am using them to cut everything around the house including some home repairs. these scissors are so sturdy I believe they would last a lifetime!",
      "rating": 5.0,
      "verified": true,
      "author": "brina",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "A really good value",
      "text": "These things are really nice. I didn't expect such a good product for the price. I use them to cut sail cloth, vinyl, plastic, rubber, all sorts of things. They are very sharp and seem to be holding their edge quite well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Cash",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Nice and Heavy",
      "text": "Awesome Shears. Needed them to cut zip ties off multiple mail bags everyday. They do the job well",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great value!",
      "text": "Amazing! The plastic handle is great because it doesn’t hurt your hand when you are cutting. It cuts very sharp. I’m definitely recommending them and buying another pair. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "carolina hernandez",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "These scissors are great! Really good especially for the price",
      "text": "These scissors are great! Really good especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin C",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Sturdy and Sharp",
      "text": "Nice sturdy, steel scissors beautiful gold, goes well with my accessories. They are a little heavy and sharp, not good to have around if you have children who can access them.",
      "rating": 5.0,
      "verified": true,
      "author": "MICHELLE HERNANDEZ",
      "helpful_votes": 2,
      "publication_date": 20170121
    },
    {
      "title": "5 stars",
      "text": "Love the gold color, and so nice and sharp, cuts leather with no problems",
      "rating": 5.0,
      "verified": true,
      "author": "rebecca r.",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "There is nothing that I didn't like about these scissors",
      "text": "They are easier to handle than I thought. There is nothing that I didn't like about these scissors. They does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Quality Well Constructed Scissors",
      "text": "Well satisfied with these heavy duty scissors. Reminds me of the way quality scissors were constructed years ago. Beautiful looking also.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorease",
      "helpful_votes": 4,
      "publication_date": 20170206
    },
    {
      "title": "Four Stars",
      "text": "These are very sharp and have some weight to them. Quality for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "TrykaTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Five Stars",
      "text": "Awesome, sharp, these are a great deal for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Saliunas",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Good quality, functional scissors",
      "text": "I bought the scissors to cut up a thick carpet They worked perfectly and solved the problem I had",
      "rating": 5.0,
      "verified": true,
      "author": "Humanist",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Five Stars",
      "text": "Just what I've been looking for, heavy, large and cuts....",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Taylor",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Would cut paper just fine,, but trying to cut thin leather",
      "text": "Piece of Junk!! Would cut paper just fine,, but trying to cut thin leather... forget it! :(",
      "rating": 1.0,
      "verified": true,
      "author": "Lori A.",
      "helpful_votes": 2,
      "publication_date": 20180719
    },
    {
      "title": "Definitely recommend.",
      "text": "Heavy duty and very nice looking. I used them often and they are still sharp. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Nicely made",
      "text": "I like the feel and the grip and the weight of the scissors and the cut is very sharp!",
      "rating": 5.0,
      "verified": true,
      "author": "thomas",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Five Stars",
      "text": "love it super sharp. Just mad someone moved it now I can't find it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170206
    },
    {
      "title": "Great shears!",
      "text": "Great shears for the price. I would purchase them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Shellie R.",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Heavy-duty",
      "text": "Haven't used the scissors yet, but they look very sturdy, heavy-duty. I am excited to try them out for my upcoming project.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Great Scissors",
      "text": "Great scissors at a good price. Everything I wanted and the scissor are as described",
      "rating": 5.0,
      "verified": true,
      "author": "gener86",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Works well for leather crafts",
      "text": "These cut leather like I was cutting paper. I love them and use them to cut out pieces for leather projects. Fits comfortably in my hand and has a smooth cut.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Cashman",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Sharp and easy to handle...",
      "text": "These scissors are perfect for cutting heavy upholstery material. They will be a staple in our shop.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony and Shelley",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "These scissors are great and just what I needed",
      "text": "These scissors are great and just what I needed. I highly recommend them. Arrived in timely manner and are just as described.",
      "rating": 5.0,
      "verified": true,
      "author": "John Dyson",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Five Stars",
      "text": "I like this scissors a lot they are truly heavy duty and extremely sharp. does excellent job.",
      "rating": 5.0,
      "verified": true,
      "author": "dianne",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Gift",
      "text": "It’s a Christmas gift for my grand daughter who has become excited about sewing",
      "rating": 5.0,
      "verified": true,
      "author": "mary gerster",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "good product",
      "text": "good quality shears. used for cutting carpet, cardboard and stacks of paper.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "They work",
      "text": "It is a bit heavy...but it does the job well.",
      "rating": 4.0,
      "verified": true,
      "author": "Shirley Swift",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Good Scissors",
      "text": "Pretty heavy duty. Fits tight to make cutting easy. No slop with my pair!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Avgerinos",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Great item",
      "text": "Nice and sharp pair of scissors, was a true shiny gold color. Looks great on my desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Yo",
      "helpful_votes": 0,
      "publication_date": 20181028
    }
  ],
  "product_meta": {
    "title": "eZthings 12\" Upholstery Shears Heavy Duty Scissors for Cutting Arts and Craft Fabrics, Carpets (12 Inch Leather Cutting)",
    "rating": 4.6,
    "feature_bullets": [
      "12\" Upholstery Shears Heavy Duty Scissors For Cutting Arts and Craft Fabrics, Carpets (12 Inch Leather Cutting)",
      "Dressmaking Upholstery Scissors for Cutting Fabric, Leather, and Raw Materials.",
      "Heavy Duty Industrial Shears for Upholstery, and Composite Materials.",
      "Tailoring Scissors for Altering, Sewing Fabric and Arts.",
      "Quality Work Shears for Hobby or Commercial Use."
    ],
    "specifications": {
      "Product Dimensions": "12.6 x 4.1 x 1 inches",
      "Item model number": "12 Inch Leather Cutting",
      "ASIN": "B01FVERJO4",
      "Customer Reviews": "4.6 out of 5 stars656 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#4,603 in Arts, Crafts & Sewing",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "1.17 pounds",
      "Manufacturer": "eZthings",
      "Date First Available": "May 19, 2016"
    },
    "categories": [
      "Cutting Tools",
      "Craft Supplies",
      "Craft Shears",
      "Arts, Crafts & Sewing",
      "Crafting"
    ],
    "price": 24.99
  }
}