{
  "website_summaries": [
    {
      "verdict": "Kreg is one of the best names in router tables. This precision-made benchtop kit will satisfy the most demanding woodworker.",
      "pros": [
        "Superbly made, sturdy, and durable",
        "Large working area with a multitude of fence and featherboard options allowing vertical as well as horizontal jointing"
      ],
      "cons": [
        "The Kreg is not cheap",
        "There’s no angle guide",
        "Some owners didn’t like having to drill mounting holes – though it does mean all routers fit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Another awesome product from Kreg",
      "text": "I ordered this as a birthday present from my wife and son. All I can say is wow. It was a pleasure to put it together as you will see how well the pieces are built. I ordered the complete set with gauge blocks, switch, inserts, and feather boards, every piece is solid and works excellent. If you are in the market for a bench top router table take a look at this Kreg, it will not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "David G. Riggs",
      "helpful_votes": 2,
      "publication_date": 20200327
    },
    {
      "title": "Kreg is great",
      "text": "This package came with the table and multiple accessories. Assembly was easy, but a bit time consuming as you have to drill the mounting holes. However, it gives you guide dots to help with the accuracy. I am very happy with this benchtop version of a routing table and hope to get lots of use from it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190228
    },
    {
      "title": "Poorly designed fence lock handle",
      "text": "The Kreg benchtop router table is well designed and well built EXCEPT for the 1/4 turn lock handles that come with this model. Other versions of this model (as seen on assembly videos, etc.) have lock handles that are knobs or clamps and both seem to be a better design than the small handles that came with this table. I contacted customer service at Kreg to see if I could order a different version of the handles, but they were less than helpful. I can definitely rig something up that will be better than what Kreg provided, but that shouldn't be necessary for a well-regarded brand such as Kreg.",
      "rating": 3.0,
      "verified": true,
      "author": "Dad5",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great router table",
      "text": "I really like this table, the only drawback is my drill press broke and I screwed up drilling the the top for my router. So I recommend buying an additional predrilled plate. Read the directions carefully and you won't have any issues.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonCustomer43",
      "helpful_votes": 2,
      "publication_date": 20181020
    },
    {
      "title": "Works very well",
      "text": "We are making our own molding, this table is working very well. Was missing a knob, have contacted the seller, will update if not helped. Otherwise, the table is great.",
      "rating": 4.0,
      "verified": true,
      "author": "grtgrn",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "A Good Router Table",
      "text": "I used the table for the first time while making some slatted cabinet doors that turned out great. Had a little issue leveling the table insert, but after that everything else fell into place. The accessories really make the package and made my project so much easier. Not disappointed with the purchase at this time.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Nice Table",
      "text": "Nice router table, fairly well made. Not too crazy about the fence though.",
      "rating": 4.0,
      "verified": true,
      "author": "William J. Bosse",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Should have bought it sooner",
      "text": "Bought this for my very busy husband and he’s used it many times now and couldn’t be more pleased with it. The package arrived fast and on time. New in the box. Assembled in an hour. Husband loves this and all the extras that came with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Billowitz",
      "helpful_votes": 2,
      "publication_date": 20180223
    },
    {
      "title": "Misleading product description",
      "text": "Missing three out of the five items. Set up bar set, twist-lock ring set, and the two feather boards are missing.",
      "rating": 1.0,
      "verified": true,
      "author": "Chase Headrick",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Very well built!",
      "text": "Some sort of built in measurement from the fence out would be nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Doesn't Matter",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "best portable router table on the market",
      "text": "I have owned one of Kreg's bench top router tables in the past. It is the best portable router table on the market. This particular package with the accessories is a good deal. The switch that is to be installed on the table frame is a handy extra. The feather boards are a must and would need to be purchased any way. The Kreg gauges for helping set the bit height are a nice time saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Love this thing!!!",
      "text": "This is a really nice table. I'm loving it more every time I use it. And Kreg customer service IS THE BEST!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Beanznrice1",
      "helpful_votes": 2,
      "publication_date": 20170312
    },
    {
      "title": "Came without mounting screws",
      "text": "It seems like it would be nice but I haven’t used it yet because it didn’t come with the 3 5mm screws for the track",
      "rating": 1.0,
      "verified": true,
      "author": "Scott P. Slattery",
      "helpful_votes": 0,
      "publication_date": 20201112
    }
  ],
  "product_meta": {
    "title": "Kreg PRS2100 Bench Top Router Table with Essential Accessories",
    "description": "Style:Router Table Kit\n\nTake true precision routing wherever you go with a Kreg Benchtop Router Table System. This special product bundle includes the Precision Benchtop Router Table PLUS popular Kreg Routing Accessories. Includes Router Table Switch, Featherboard Twin-Pack, Level-Loc Reducing Rings, and Precision Setup Bars.\n\nKreg PRS2100 Bench Top Router Table\n\nKreg's freshly redesigned Precision Bench top Router Table now offers even more features that give it the capability of a full-size, industrial router table in a portable package. Whether you want a router table to use on a job site or compact router table to use in the shop, the Precision Bench top Router Table is a perfect routing solution for you. This table was built to withstand years of use and abuse on the jobsite. It features a rugged stamped-steel foundation, four hard-wearing rubber feet, a professionally edge banded table-top with an impact resistant Micro-dot surface, and an incredibly rigid aluminum fence, all built with mobile professionals in mind. During development Kreg found the majority of noise produced by bench top router tables was caused by vibrations traveling through the body of the table, and that much of this noise could be stifled by using the proper design and materials. By combining a noise-absorbing MDF table top with a rigid steel base and vibration-dampening rubber feet, our Precision Bench top Router Table is incredibly quiet, and actually tests quieter than most enclosed router tables.\n\nBundle Includes:\n\n * Kreg PRS2100 Bench Top Router Table\n * Kreg PRS3020 True-FLEX Featherboard, Pack of 2\n * Kreg PRS3100 Multi Purpose Router Table Switch\n * Kreg PRS3400 Precision Router Table Set Up Bars, Set of 7\n * Kreg PRS3050 Twist-Loc Ring Set, 5-Piece",
    "rating": 4.4,
    "feature_bullets": [
      "FENCE: Industrial-quality fence containing adjustable faces, dust collection, vertical jointing and new cam clamps",
      "INSERT: Full-size router insert plate with precision plate levelers and new Level-Loc reducing rings",
      "XL: Extra-large 16\" x 24\" MDF table top with an Easy-Slide surface",
      "STAND: Wide stance heavy-duty steel stand for increased stability",
      "BUNDLE INCLUDES: Kreg PRS3020 True-FLEX Featherboard, Pack of 2; Kreg PRS3100 Multi Purpose Router Table Switch; Kreg PRS3400 Precision Router Table Set Up Bars, Set of 7; Kreg PRS3050 Twist-Loc Ring Set, 5-Piece; also includes MDF top, full-size insert place with 3 Level-Loc rings, insert plate levelers, extruded aluminum fence and heavy-duty steel stand"
    ],
    "specifications": {
      "Manufacturer": "Kreg",
      "Part Number": "PRS2100K1",
      "Item Weight": "32.5 pounds",
      "Product Dimensions": "9.1 x 9.1 x 9.1 inches",
      "Is Discontinued By Manufacturer": "No",
      "Style": "Router Table Kit",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B01FWONFTQ",
      "Customer Reviews": "4.4 out of 5 stars35 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#203,114 in Tools & Home Improvement",
      "Date First Available": "October 14, 2016"
    },
    "categories": [
      "Tables",
      "Power Tool Parts & Accessories",
      "Router Parts & Accessories",
      "Tools & Home Improvement",
      "Power & Hand Tools"
    ],
    "price": 369.0
  }
}