{
  "website_summaries": [
    {
      "verdict": "Another top-quality choice for customers seeking an electric pedicure set with more attachments.",
      "pros": [
        "10 attachment set offers tools to buff, shape, and shine nails",
        "Attachments also work to remove calluses and corns",
        "Includes a detachable LED light for precise viewing",
        "AC adapter allows you to simply plug in it and use"
      ],
      "cons": [
        "Electric attachments can be a little too strong for some",
        "Many buyers wish it was cheaper"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A must buy!",
      "text": "I tried the Beurer and purenails devices first but they only had 2 speeds and weren't that powerful. Honestly I was very disappointed but I decided to give this unit a try. This product has 10 speeds! I was so amazed by how quickly I was able to do my nails that I had to take a pic for you guys. I also like how it has touch control, so fancy! LOVE IT! A must buy.",
      "rating": 5.0,
      "verified": true,
      "author": "siroor",
      "helpful_votes": 180,
      "publication_date": 20161003
    },
    {
      "title": "Perfect Pedicure!",
      "text": "Amazing little device! Long overdue pedicure with awesome results in less than 30 minutes. Powerful and easy to use. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny V.",
      "helpful_votes": 43,
      "publication_date": 20190309
    },
    {
      "title": "EXCELLENT MANI/PEDI MANICURE SET",
      "text": "This is a professional and fine tooled instrument with multiple attachments for the purpose of manicures and pedicures. It is as described and enables you to do a professional job on hands and feet. Easy to use and fits well in hand and have a great storage case. The LED attachment is a great help. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "SUNDAYGOLFER",
      "helpful_votes": 51,
      "publication_date": 20180321
    },
    {
      "title": "Easy to use for even the manicure challenged",
      "text": "Handles thick nails, thin nails, and everything else. originally bought this to help tame my mom's nails, but now love it for me too. I have really terrible nails that tear easily, and this helps me keep them manicured and neat.",
      "rating": 5.0,
      "verified": true,
      "author": "K Griffee",
      "helpful_votes": 43,
      "publication_date": 20171101
    },
    {
      "title": "Fantastic. Was able to really shave calluses and remove ...",
      "text": "Fantastic. Was able to really shave calluses and remove a corn from the bottom of my foot. Motor is good. Works better than one I bought earlier with a recharable battery. Would definitely buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Wife of  Sasquatch",
      "helpful_votes": 39,
      "publication_date": 20180305
    },
    {
      "title": "Good product. Need to improve manual.",
      "text": "Just received this item. Have history of long standing toe nail fungus and have used a dremel tool for years. I am impressed that the standard heads that come with the Utilyze provide a significant amount precision, utility and saftey well beyond a dremel tool, toenail clippers , nail files etc. Using this unit does require some skill and the currently enclosed manual is not extremely helpful. I was able to find a some information on youtube and I’m sure my ability to use this device will improve with more practice. I would highly recommend Utilyze to ceate a more informative manual on using it’s product and if possible a basic video some point.",
      "rating": 4.0,
      "verified": true,
      "author": "Harold",
      "helpful_votes": 18,
      "publication_date": 20190315
    },
    {
      "title": "Efficient!",
      "text": "Love it! Very helpful with my manicures and pedicures. You get 10 speeds and an LED light with it. The functions have a very sophisticated tech touch for speed and light. The on/off button is smartly placed with a manual touch. Speeds up your mani/pedi time and very helpful to file off the top coat when removing gel polish before the soak off phase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 29,
      "publication_date": 20170727
    },
    {
      "title": "Excellent! Very powerful and gives you a professional pedicure",
      "text": "Excellent! Very powerful and gives you a professional pedicure! Very pleased with this item. It does everything you need and is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Zeros Pumpkinland",
      "helpful_votes": 39,
      "publication_date": 20170310
    },
    {
      "title": "Great pedi product!",
      "text": "I ordered this manicure set when I hurt a toenail and it was starting to grow out and come off. I knew the nail was fragile and I would need an electric file to keep it clipped until it came off. This product worked so much better than those tiny one or two battery ones. Its variable motor is Great! This set has all the accessories anyone could want for a manicure/pedicure. I'm happy I ordered it!",
      "rating": 5.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 59,
      "publication_date": 20161127
    },
    {
      "title": "Is not PROFESSIONAL set",
      "text": "Don't make the same mistake. If you need electric buffer this set is for you. But nothing else. I d not have problem nails. Not removing any cuticle at all! and drills poor quality metal(",
      "rating": 1.0,
      "verified": true,
      "author": "alex m.",
      "helpful_votes": 20,
      "publication_date": 20181001
    },
    {
      "title": "Piece of Junk!",
      "text": "Used 1 time. Barely did what I wanted it to do. Tried to turn in on a few days later and it went work. Just keeps blinking then shuts off. I want my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20180616
    },
    {
      "title": "This is very useful for my toenails",
      "text": "This is very useful for my toenails. It is not battery powered so it has enough power all the time. When it is hard to reach your toes to clip your nails, this set is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Bradway",
      "helpful_votes": 28,
      "publication_date": 20161231
    },
    {
      "title": "Why didn't I know about this sooner???",
      "text": "This machine makes doing a pedicure and manicure a breeze! I am over 65 and it is hard to file and trim my feet and hands by myself. I don't want to pay for a professional pedicure. The UTILYZE 10-in-1 Professional Electric Manicure and Pedicure Set is fantastic. It is powerful, just plug it in and it is ready for any job you request of it; hard nails, ingrown nails, chipped and breaking nails. Just hold the comfortable handle in your hand. Files down to perfection in seconds! I wish I had known about this machine a long time ago! Great for young and old alike. Great for Christmas gift! And it comes with a 3 year warranty!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190105
    },
    {
      "title": "Ideal For Me",
      "text": "This Kit Is Ideal for me as I am a type 2 diabetic.. The attachments are sturdy, snap and stayinto place and we'll made and the 10 speeds give me adiquit power in switching from my tough Diabetic toe nails and calloused feet to the easier to do fingers and nails with steady power and no halting or interference ... I also love the tools for cuticles And buffing/shining my nails for a complete Neat look afterwards.. So far so good :)",
      "rating": 5.0,
      "verified": true,
      "author": "Vonn Lee",
      "helpful_votes": 9,
      "publication_date": 20190405
    },
    {
      "title": "Good Value for a Useful Tool",
      "text": "This as a perfect set for personal use. The handle is comfortable and the tips are easily changeable. There are only two small shortcomings for me. First, the most abrasive grinder tool is not enough to easily remove heavy nail growth. That may be by design, so the average person doesn't damage their nailbed. Second, the flat nail shapers are difficult to use without contacting skin. I guess it just takes practice. Overall, this is a good value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "forensicqde",
      "helpful_votes": 7,
      "publication_date": 20181023
    },
    {
      "title": "Good, but beware of the documentation",
      "text": "The kit is fine but the documentation is scanty, and very hard to read in tiny pale print. No online version. If you, like me, are considering it for aged toenails, be warned that aged eyes may meet with frustration!",
      "rating": 4.0,
      "verified": true,
      "author": "Hagsrus",
      "helpful_votes": 16,
      "publication_date": 20170114
    },
    {
      "title": "Exactly what I’ve been looking for!",
      "text": "I’ve been having problems with a big toenail that was removed because of fungus. However, it grew back even worse looking, very thick and impossible to trim. I just tried my new manicure set and was able to grind down the thick yucky nail. The LED light made it so easy to see and I was glad I attached the clear protective guard because I made quite a mess when I ground down the nail. I highly recommend this product -- it’s exactly what I needed! My daughter has the same problem with her toenails and I’ll let her use this set as well. Thanks so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Patty from Poulsbo",
      "helpful_votes": 6,
      "publication_date": 20190702
    },
    {
      "title": "Lightweight and reasonably priced",
      "text": "I’m a nail Tech for 13 years and used a ProTouch 1000 by Medicool the Utilyze is so much lighter and easier to use the light and shield attachments are awesome too",
      "rating": 5.0,
      "verified": true,
      "author": "FoxyFred ",
      "helpful_votes": 11,
      "publication_date": 20181224
    },
    {
      "title": "Left my fingernails feeling smoother than ever before.",
      "text": "I used this for a manicure and pedicure. I have been traveling so I have only used it once, but my fingernails felt so smooth afterwards. The product was easy to use, and the cord was a good length. The case it stores in is good quality and good size to store the tools and to take when traveling. It would have been helpful if it had been easier to tell the difference between the fine and rough shaping disks. A little more instruction on how to get a good manicure using the tools in the set would also have been appreciated especially for someone just used to using a file and clippers.",
      "rating": 4.0,
      "verified": true,
      "author": "KayC",
      "helpful_votes": 3,
      "publication_date": 20190613
    },
    {
      "title": "Nailed it!",
      "text": "I love this Utilyze professional manicure & pedicure set! It has all the attachments I need. With the adjustable speed, I can change the speed so easily! No more stuck in 2 or 3 speeds, noooo... this thing has 10 speeds. I can care for my nails at home in just a few minutes, touching up what I need to quickly. The LED light is great! The adjustable power and the light are two of the reasons I bought this set, plus it's built to last. It does warm up after 20 minutes of solid use, but I'm usually done by then anyhow. Great professional set!!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Ashe",
      "helpful_votes": 2,
      "publication_date": 20200211
    },
    {
      "title": "Easy to use",
      "text": "Purchased this product for manicures. I have recently begun doing my own manicures and have never used an electronic filing/buffing product before. I found it extremely easy to use and love it. For me there is a bit of a learning curve figuring out which attachment is best to use for what I am trying to attain, but I know I will get more polished at it the more I do it. Some reviews complained about the placement of the speed and reverse buttons on the unit, but I had no issues with this. Like the fact that is a plug-in product and don't need to rely on batteries.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine Aune",
      "helpful_votes": 5,
      "publication_date": 20190305
    },
    {
      "title": "Satisfied with Utilyze set",
      "text": "I wish as a first time user, there was a better tutorial that shows what each drill bit does( complete steps with usage shown) I researched some YouTube videos about it and am able to use this set with ease but some detail instructions would be nice. I have used it twice now and am happy with how my nails look. I don't have rough nails to begin with and this set worked easily on mine. For a better result for rough and broken nails, I'd suggest go to salon first. I like to use my cuticle softener and orange stick to push back cuticles first and then use the tool .",
      "rating": 4.0,
      "verified": true,
      "author": "Jawad shafiq",
      "helpful_votes": 4,
      "publication_date": 20190526
    },
    {
      "title": "I like the shape of the tools and the light is terrific!",
      "text": "I ordered this new Utilyze Manicure and Pedicure set because my old set (not Utliyze) stopped working. I am very pleased with the ease of use of this new set! The tools are made at just the right angle and shape to use with my toes and callouses on my feet. I like the light because it makes it so much easier to use! The set comes with all the attachments that I would want and I like the variable speeds! I wish I didn't have to deal with callouses on my feet, but since I do this is an excellent tool to use for pedicures!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Thorud",
      "helpful_votes": 3,
      "publication_date": 20190915
    },
    {
      "title": "Worth the investment to save on salon visits.",
      "text": "I am a seasonal person who goes to the nail salon during the summer months to have my nails my wrapped and my pedicure done. After that, I have to work on getting my hands back to looking normal. I purchased the UTILYZE because I wanted to the same power nail salons use to prep your nails for the process except to do the opposite. This machine has been the best investment I have made this year. I have used to twice already to clean up and smoothen out the edges and start the process of having my hands looks great again. The photo shows my cuticles cleaned up and my nails smooth and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer: JC",
      "helpful_votes": 27,
      "publication_date": 20170721
    },
    {
      "title": "I wish I had purchased this long before now.  I no longer dread doing my husband's nails.",
      "text": "This equipment is so easy to use and it works perfectly on my husband's toenails. His feet never looked better! I was worried that we would have to start going to a specialist to get his heavy nails done. Not any more. In fact the equipment is already making his nails recover, including his ingrown toenail. The instructions are great. One suggestion - the numbering for the equipment parts is in pale blue. I took a black marker and wrote on the page next to each piece the number and then I also wrote the number on the part as well.",
      "rating": 5.0,
      "verified": true,
      "author": "DrWatson",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "Great item",
      "text": "Purchased item not to long ago. The trimmer lasted only 4-5 uses and not heavy uses when all of the sudden the motor ceased. I sent an email to the manufacturer about the defect and they send me a replacement right away with no issues. I'm giving a 5 stars for the prompt customer care.",
      "rating": 5.0,
      "verified": true,
      "author": "BoriMan",
      "helpful_votes": 6,
      "publication_date": 20190301
    },
    {
      "title": "Works Great!",
      "text": "So, was very scared it would vibrate, making it rough on my cuticles, but no shaking at all! And I'm able to go right against my cuticles and it doesn't damage them at all. I used to tear my cuticles up buffing and shaping my gel nails, but with this, no damage whatsoever! While it is NOT chargeable, it has an extra long cord, so you don't have to be sitting right by an outlet for it to work. And the LED light is very helpful. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Spell",
      "helpful_votes": 2,
      "publication_date": 20200421
    },
    {
      "title": "Easy to use",
      "text": "This product is nice but after using it a few times, I have found the controls are in an awkward place. It’s too easy to hit them while using it. It also did not come with the spiral cord shown. It has a regular, although very long, cord. They also offer a “free” set of replacement bits but they come with strings attached. They don’t send it until you until after you show them that you have written a review and then you have to pay shipping. I am not going to bother with that.",
      "rating": 3.0,
      "verified": true,
      "author": "Darlene",
      "helpful_votes": 2,
      "publication_date": 20200326
    },
    {
      "title": "Don’t bother.",
      "text": "This product has a very professional look but it doesn’t work for long. The manual states to not use longer than 20 minutes and let it sit for 15 to cool down. It hadn’t even been 10 minutes and it overheated. It’s been two hours and it won’t start again. It worked well while it worked... I’m sending it back and buying a Dremel.",
      "rating": 1.0,
      "verified": true,
      "author": "AvidReader",
      "helpful_votes": 3,
      "publication_date": 20200104
    },
    {
      "title": "Works Very Well",
      "text": "I bought this Mani/Pedi set for myself to keep my nails in shape. So far, I am very impressed with the ease of use and the outcome on my toenails. I have a couple of thick nails that I was able to smooth down with great success. I haven't used the cuticle attachment yet but I have to say, I'm looking forward to excellent results. I've purchased other battery operated manicure tools over the years. This Utilyze equipment is by far the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris in NV",
      "helpful_votes": 3,
      "publication_date": 20190731
    },
    {
      "title": "Worked 4 or 5x",
      "text": "I was able to use this product 4 or 5 times until it literally gave up on life.",
      "rating": 1.0,
      "verified": true,
      "author": "Hrafn Jónsson",
      "helpful_votes": 9,
      "publication_date": 20190122
    },
    {
      "title": "Did the trick",
      "text": "First time I have ever used a manicure set like this. watched a few videos on how to, which helped a great deal. For the first time only used a couple of the attachments and they worked very well. Always did my own manicures but the hands don't hold out as they use too. this made it a lot easier. I know will get more proficient the more I use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Babcock",
      "helpful_votes": 4,
      "publication_date": 20190323
    },
    {
      "title": "Utilyze Professional 10-in-1 Electric Manicure & Pedicure Set works as promised",
      "text": "Used my new Utilyze manicure set today to give myself a manicure and pedicure. It really works as promised. The hand held devise is easy to hold and manipulate around my toes and calluses as well a my fingernail beds and nails. My feet are nice and soft now and my fingernails and nail beds are clean and smooth after rubbing lotion on them They looked like a salon manicure and pedicure. For the prize of one manicure and pedicure I bought the Utilyze Professional Manicure & Pedicure Set and I am set for life. I would highly recommend this set.",
      "rating": 5.0,
      "verified": true,
      "author": "KAB",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "This manicure/pedicure set is so easy to use and it would be a most welcome gift!",
      "text": "Say it's 2 AM and you have an important meeting tomorrow, causing you to lose sleep; you can be sure your nails look perfect when you arrive for the meeting by giving yourself a great manicure at home with this Utilyze kit. You've just upped your personal assurance level and saved yourself about $100 at home! That's what I did this morning, and I'm feeling proud as a peacock. This kit also would make a great gift; no more waiting your turn while watching the clock. I wish I had ordered this set long before now.",
      "rating": 5.0,
      "verified": true,
      "author": "Hermes219",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Wish I had bought this sooner!",
      "text": "I have very thick nails and cuticles. I have been getting professional manicures and pedicures for a long time. Got so tired of paying high prices and spending a lot of time in the salon. I ordered the Utilyze and will be saving a ton of money and time. I gave myself a manicure in half the time at home and my cuticles and nails are perfect!. Pedicures are wonderful and my toes are well manicured. After the first manicure and pedicure, all it takes are quick touch ups once in a while. They have an attachment for everything. No more cracked and annoying cuticles! Nails are perfect! Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "Murphia",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Great price for what it’s intended to do.",
      "text": "It works great. I read many reviews and I have to agree with the buttons to switch rotation can be accidentally switched or the on and off button placement as well. It works as promised used it right away for a troubled mail and I am happy with the results. I eventually got around a way of holding it where I don’t accidentally touch the button. That is my only con. Would be nice if it had like a lock button to avoid that issue. Other than that I would recommend it to family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Zulma Santos",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Helped to \"clean up\" Mom's thickened toe nails",
      "text": "This home-use electric manicure & pedicure set was easy to use to thin down my 89 year old mother's thickened toe nails. The professional nail salon she used to go to no longer wanted to work on her pedicure so I researched online on YouTube and medical websites on the proper procedures for at-home pedicures. I used a toe nail clipper for thickened toe nails first, manually filed the thickened toe nails, then finished with this electric manicure/pedicure drill set. My mother didn't complain of any pain at all, and her toe nails were neatly trimmed. A good investment for senior pedicures.",
      "rating": 5.0,
      "verified": true,
      "author": "Seedler",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Does the job on my big, ugly toenail",
      "text": "After cutting away much of my big toenails that were growing vertically after years of abuse, my podiatrist told me to \"file, file, file!\" Hence this purchase. The unit seems well made and has the power required to file and shape my nails far more quickly and easily than hand filing. Add in the light, multiple speeds, and enough tools to handle almost any nail problem and I am a happy camper. My toenails no longer scare away small children at the beach! Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigchucks",
      "helpful_votes": 2,
      "publication_date": 20190909
    },
    {
      "title": "I love it.  Works great.  Gets the job done.",
      "text": "This manicure and pedicure set is great. I had tried a couple of battery operated ones and they didn't get much done. This works great. I'm using it once weekly and so is my mother. We just got different accessories for hygiene, since the care instructions state that you should clean with a soft damp cloth. It works great and we both love it. I'm getting additional accessories for my sister.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 5,
      "publication_date": 20180320
    },
    {
      "title": "Great pedicure device! Works wonders for calluses on feet",
      "text": "I love this! I have tried for years to find something like this to pedicure my toes and calluses. This has attachments to fit whatever it is you’re trying to do. I have calluses on my feet and was trying to file them down with this and that. This little tool is perfect and quick and easy. Looks very similar to the tool used by the podiatrist. After my first time using it, I thought”where have you been all my life?” It is great. You won’t be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Wright",
      "helpful_votes": 2,
      "publication_date": 20191212
    },
    {
      "title": "Works great",
      "text": "This worked great for what I needed it for, to get me by until they lift this corona virus quarantine! I can see myself using it in the future to stretch my nail appointments and to do my own toes with. I did not have any problem doing my right hand holding the tool in my left hand. I thought my hubby might have to help me but I was able to do it no problem. I had gel polish on my acrylics and this took the polish off and manicured my nails nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon D",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Looks well made",
      "text": "I have not used the product yet, but it looks well made.. I will update when I use it Update: This worked exactly as I hoped it would.. it made it so much easier to remove my powder nails and when it’s time to buff them before last coat it worked wonderfully.. my nails shined.. I also used it on trimming my nails and my cuticles and it was wonderful. Utilyze has exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "KRISTEN RAKERS",
      "helpful_votes": 3,
      "publication_date": 20190204
    },
    {
      "title": "Did the job",
      "text": "The product did the job. I gave it 4 star rating because I felt the attachments could have been a little smaller for better precision during use. I'm guessing the manufacturer didn't do that in order to prevent people from hurting themselves at home. It has several speeds. Also a must know the light is efficient but falls off often during use depending on how you're holding the device.",
      "rating": 4.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 3,
      "publication_date": 20190529
    },
    {
      "title": "Great set and incredible price!",
      "text": "I have never had the need or the products necessary to take care of my own acrylic nails at home. With the current COVID-19 situation and closure of nail salons, I knew it would be at least another month before they would open again. I chose to purchase this set to keep my nails trimmed and healthy in the interim. I was truly impressed with how easy this was to accomplish. They are now trimmed nicely and able to stay strong for a few weeks longer, with no fear of the longer length breaking or snagging on something. Highly recommend this product - a nail saver for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Monkey",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Great!",
      "text": "I've been using this product for about a month now and it has saved me so much money already. I have been using it to keep my SNS manis fresh between visits to the salon. It is high quality and I love the light attachment that helps you to see better as you are filing. 10/10 would recommend for at home use.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke Wilds",
      "helpful_votes": 3,
      "publication_date": 20190125
    },
    {
      "title": "Nice storage bag to keep everything together",
      "text": "Packaged nicely. Seems like a quality product that is well made. I like the storage bag so that I'm not losing parts in the drawer. The equipment size seems perfect for holding it comfortably. I will post an update once I use it. I just did my nails 2 days before it got here so if will be a couple weeks before I get to try it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen R.",
      "helpful_votes": 3,
      "publication_date": 20190328
    },
    {
      "title": "Saves me from going to the podiatrist",
      "text": "Because of an autoimmune disorder, my toenails are thick and hard to cut. This appliance is just what I needed. I love all the different attachments. It’s already paid for itself in saved co-pays.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia L. Mclendon",
      "helpful_votes": 3,
      "publication_date": 20190306
    },
    {
      "title": "Variable speed is a boon!",
      "text": "I've never used an electric manicure/pedicure set before and love that this set has the option of multiple rotating speeds for the file heads. I started out slow until I felt comfortable working on my cuticles and nails and then stepped up the speed gradually. Gently filing down the toughened skin around the tips and sides of some of my nails has made a world of difference in how well manicured my hands now look. You will not regret purchase of this set.",
      "rating": 5.0,
      "verified": true,
      "author": "wellheeled",
      "helpful_votes": 3,
      "publication_date": 20190220
    },
    {
      "title": "Wonderful product for seniors",
      "text": "With this manicure and pedicure set, it is easy to reach your toes in order to maintain a smooth, trim set of toe nails. Over the years I have \\accumulated several expensive, surgically sharp nail cutters and stainless steel implements .... all of which left toe nails jaggered and torn. With this set, it is so easy to file away tough toe nails to a nice straight line with no jaggered edges. The accessory set provides a choice of nail sanders, cutters and shaping disks. There's even an attachment for buffing as a finishing touch. I am so impressed with this set.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Mocha Latte",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Very satisfied!",
      "text": "I have issues with my nails since my feet were crushed when I was younger across my toes. No bone damage but it left my nails very stressed. This product is helping get them back to normal. The only thing I notice is at times my hand slips across the speed control so just be careful how you grip the Utilyze. Highly recommend the product for nail maintenance and upkeep in addition to normal clipping etc of course.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Wenger",
      "helpful_votes": 8,
      "publication_date": 20170122
    },
    {
      "title": "Broke after second use...",
      "text": "This broke the second time I used this. I would definitely not recommend. I contacted the supplier and they said that if I want a replacement, I have to pay to ship it to them for them to look at it. I’m 100% fine shipping it to them, but making me pay for it when it was their product that broke doesn’t sit well with me. Terrible customer service!",
      "rating": 1.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 2,
      "publication_date": 20200423
    },
    {
      "title": "Excellent, very easy to use and quite a powerful little motor",
      "text": "I have purchased manicure and pedicure electronic hand pieces before but have always been disappointed with the power of the motor. This hand piece is nice to use, does not give up on hard surfaces but keeps on going. The different tools are nicely designed and the booklet clearly describes which attachment to use for which purpose I am very pleased and would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "deb",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Manicure/Pedicure Kit",
      "text": "I received this kit yesterday and have already used it on a couple of weird toenails that I have. Very powerful little drill. It is comfortable to hold and after I registered the product they offered to send an extra set of attachments. The light works well and the electrical chord is a comfortable length and the attachment drill heads appear to be of high quality material. This kit comes with a zippered case to keep track of its parts! I would recommend this kit over less powerful ones or ones that are rechargeable.",
      "rating": 5.0,
      "verified": true,
      "author": "Slane0414",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Easy to use and makes your nails look great in a very short time.",
      "text": "This gizmo made filing, shaping and thinning both my finger and toe nails so much easier. I am a male with very thick nails especially my toe nails and I must trim and file them every two weeks. Not something that I look forward to very much. But this machine made it much easier and quicker for me. Works great for grinding down dead skin around the nails and calluses on the hands and feet. Highly recommend this product for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Everything I’ve been looking for, great product!",
      "text": "This is everything I’ve been looking for and it works great! It’s so compact and perfect for traveling. Now my nails can look like I had them professionally done from home, especially now with the social distancing. I couldn’t have ordered this product at a more perfect time. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Mendi S. Brooks",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Manicuring set",
      "text": "I bought this item thinking I can remove dip nail polish from my fingernails, but it didn't work. The product packaging is very nice. It's easy to use, the different gadget's are definitely useful and the company is willing to provide additional gadgets for free. It works well on your regular nails, but it didn't work in removing the dip nail polish. A disappointment was that I thought It was a chargeable unit and lefted plugged over night (lol) is NOT.",
      "rating": 4.0,
      "verified": true,
      "author": "ccross",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Easy to use, replacement attachments available",
      "text": "I was pleasantly surprised at how easy it was to use this. I got it the other day, and I really like this product. I was especially happy that replacement attachments are available, so if I need new ones, I won't have trouble finding them. I've gone through many \"disposable\" manicure sets and this was definitely worth the price for me. It's not too expensive relatively speaking, and so far, I'm very happy with it even though I've only had it a few days.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri Brown",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "A most have to save money",
      "text": "Well yes I’m a man. I used to go to get a manicure once a week because I’m in the service industry. Your fingers are the first thing people see. This item is the best to offer ease of use and no more driving out to get a manicure. I can do it with ease at home. It works great. Thank you",
      "rating": 4.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Nice unit",
      "text": "I am pleased with this unit. It seems a bit fragile, but it is powerful. I would recommend taking care when using it with regard to applying pressure and pushing the drill into the nail and how long the attachment is left in one place. Otherwise, it is a nice unit and does the job!",
      "rating": 5.0,
      "verified": true,
      "author": "ABart",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Perfect Product!",
      "text": "I absolutely love this Manicure/Pedicure Set! It's so easy to use. My husband is partially disabled and I've had a difficult times in the past doing his nails. Now, time goes by quickly and both of our nails look great, just like a professional manicure/pedicure. I am extremely p;leased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great just Great",
      "text": "I got this yesterday. I took out of the box and started to use it. Very easy to use. The attachments very easy to put in and to take out! Had my toenails done in about 5 minutes, it always takes me a least 2 hours to do. Great will always do my toes with this, not to short just perfect. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "dkr",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Easy to use",
      "text": "Going to my natural nails, and wanted an easy to use device at home. With the separate attachments, everything I need is close at hand. Update 7/29/2019 With The purchase of the Utilyze Manicure set, was an offer to receive free replacement attachments once a review was submitted, and the product was registered. After several emails with the company, the tools were to be mailed. It has been a month if correspondence, and no email stating they had been mailed. All in all, the product serves it’s purpose, but obviously the promise of replacement tools is not sincere.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Very easy to use even for a beginner like me",
      "text": "It was so easy to use. I used it to trim my toenails. I am so glad I bought this product. My toenails have always been difficult to trim. Used it for the first time today and was surprised how easy it was. I highly recommend it, maybe I will see if my husband will let me take care of his nails. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Linda S",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great Nail Grooming!",
      "text": "I've used a battery-powered rotary file for years. When mine finally died, I looked for a new one that had a flat disc file, similar to what I had. I found this one and was not sure about getting an electric one, but now that I have it, I wonder why I didn't do this sooner! My battery one was always running out of steam. I love the electric version that just goes and goes without slowing down. The variable speeds are great! I use a lower speed because my nails are very thin, I did a manicure in probably half the time it used to take and with better results!",
      "rating": 5.0,
      "verified": true,
      "author": "Edwards",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Easy to use, many options, free replacements require a review",
      "text": "This product is nice and I like the many variable speeds. What I don't like is they offer a free replacement attachments when you register your product. After registering, they add another restriction to the free replacement. You must leave a review. It is a fine product, not sure why they add another restriction to the free replacement. \"Thank you for choosing our Professional 10-in 1 Electric Manicure & Pedicure Set. Register your product today and receive a set of replacement attachments for free.\" No mention that you must leave a review. Transparency is always the best practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Works! Good quality",
      "text": "Works well! I have terrible callus on my left foot, I use the sapphire cone attachment and it smooths it out. I like the fact that it’s not battery operated so it’s powerful. I like that you can adjust the speed and even the rotation of the attachment.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Why didn't I get this years ago...",
      "text": "So far have used only for my feet. I have callouses and nail build up deposits on one foot. The various attachments are making short work of both! Also thinning out excess skin on heels. Much safer than razor blade device I have used forever. The adjustable speed is really nice. I mostly use lower speed and take my time. Great product so far. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "tpo",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "THE MANICURE AND PEDICURE SET",
      "text": "The quality of the product, and its accessories, exceeded my expectations. I ordered the set from Amazon and was concerned about it’s quality until it was delivered. That was because am on the high side of 70 and have become totally disabled. I purchased the manicure & pedicure set in order facilitate my personal grooming without having to depend on other members of my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Butler",
      "helpful_votes": 2,
      "publication_date": 20190613
    },
    {
      "title": "How much power it has.",
      "text": "I liked the strong power it has. I had another one years ago from another company and used it for years. After it finally wouldn't work any more I was lost. I was having a hard time finding another one that was electric. I kept going on line and all I found was cheap or expensive ones that were for salon use. Then some how Amazon came up and I had never been on it before I found what I wanted right away , a Utilyze. I read the comments and decided to give it a try. It came in 2 days. I really like the results and all the different heads for everything. I am very satisfied with everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Annette ",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Should have bought this a long time ago",
      "text": "As I live in the south and go barefoot or wear sandals for much of the year my feet get dry and calloused easily. I have given up on salon pedicures as they barely work on thickened skin and cuticles spending the most time on applying the polish, thus I have been doing my own feet. Very recently I bought this device and I love it as it makes quick work of smoothing the callouses on my feet and filing down the toe nails. The attachments can be changed easily and it seems powerful enough to work efficiently. Next I will try it for a manicure.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Kirson",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "A Great Alternative to Clipping Your Nails",
      "text": "Using a rotary tool to shorten and shape your nails greatly reduces the chance of clipping them too short and causing tearing or ingrown nails. It takes a little longer however the results are worth it. The compact nature of this product makes it easy to pack when travelling.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Kennedy",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Solid all the way around",
      "text": "I bought this set because I'm a busy mom and don’t have time to get my nails/toes professionally done. So, I cannot wait to try this. The set looks and feels solid. I haven’t used it yet but I’ll do an update when I do.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Gets hot in ten minutes",
      "text": "I had the same drill for ten years before the casing came apart. I looked for a new but similar one and set on this one. I was really excited when it came in the mail and the first ten minutes of using it to clean my nails, I was extatic with the results. However, then the drill piece started stinging my nail and skin because of how hot it was getting, and I freaked out. It cools down after ten mins but unless you can get your manicure done in ten mins, you have to put it down and wait for it to cool before it becomes usable again. Sad",
      "rating": 2.0,
      "verified": true,
      "author": "Irina ",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Misleading description",
      "text": "I’m completely disappointed with this product, is not what it promises. The description tells you that it is suitable for acrylic nails however its attachments don’t work on them. What’s more the machine it’s not compatible with other attachments (I asked the seller) I tried to return the product but the shipping is more expensive, so I have no option but to keep it.",
      "rating": 1.0,
      "verified": true,
      "author": "Erika Sotelo",
      "helpful_votes": 3,
      "publication_date": 20190924
    },
    {
      "title": "This is a great little manicure set.",
      "text": "I received my manicure set in good condition two days after I ordered it. The instructions are easy to understand and the appliance is light weight and easy to use. You do not have to be a professional to understand and use this device. The led light attachment is a great help.",
      "rating": 5.0,
      "verified": true,
      "author": "kim morley",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Home manicure must",
      "text": "Forced to abstain from my manicure habit due to the pandemic, I purchased this kit. It has already impressed me and frankly I may not go back to my Bi-weekly salon ever again. My nails seem healthier and look better even in this short few weeks. The kit is easy to use and great for pedicures as well. Very glad I purchased this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ellen",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Seems like a well built piece of equipment!",
      "text": "Impressed with ease of use; love the very long cord! At 72 I have difficulty doing my toenails but this helps with the reach when done and removes all my jagged, sharp edges. In fact I may do away with cutting and just keep them well trimmed with this. Looked at lots of manicure/pedicure sets and this seemed the best value for the money. Plan on using it for my 97 year old father's toenails after a refreshing foot soak. I am new at this and would have appreciated a little more information. on using each bit. Is there a tutorial online I missed perhaps?",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Pleasantly surprised",
      "text": "It took me a few minutes to figure out how to use this correctly. The directions were clear but the font was too small to read clearly at times. But the product itself was fantastic. I have arthritis in my hands and recently had hip surgery that decreased my hip range of motion. With this device I was able to safely reach all my toes and do a nice trim, etc. very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "chaikikombe",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Ok",
      "text": "Not great for artificial nails but would be great for real nails. Attachments wear out pretty quick, but great on first few uses.",
      "rating": 3.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 2,
      "publication_date": 20190701
    },
    {
      "title": "Best investment made for my hands and feet",
      "text": "Received the manicure and pedicure set as a gift from my husband.... I love it ... there are so many different file attachments that make taking caring for your hands and feet so easy. Being a plug in it keeps the power on at a steady speed to get the job done. It was the perfect gift",
      "rating": 5.0,
      "verified": true,
      "author": "Atlanta1776",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Great set so happy",
      "text": "I am so glad I found this set, I was so unhappy with the first one I bought. It didn't have much speed, but was good to use for a child. This set takes care of my pedicure wonderfully. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruby",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Salon quality",
      "text": "Being in a pandemic , my nails were horrible. Took a chance with this kit and I may never go back to the nail bar. Easy to use and it comes in a handy pouch for all attachments. I've recommended to 3 friends and they all bought. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "seajay",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Easy to use",
      "text": "I primarily use this product for my feet due to hard dry skin on toes. It easily removes without injuring the tissue and works much better than the cuticle scissors I was using. I am extremely pleased with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Crap",
      "text": "This work for 2 months, and now it doesn’t even turn on, and the return policy has expired.",
      "rating": 1.0,
      "verified": true,
      "author": "janet baca",
      "helpful_votes": 3,
      "publication_date": 20190812
    },
    {
      "title": "Great Product",
      "text": "Just got my Utilyze product and I'm thrilled. Small detail but I actually really liked the packaging experience. It came with little waste and kind of reminds me of the feeling I get when I buy something from Apple. The actual product is also very nice and easy to operate. Lots of great features and settings to get the job done. Feeling more confident about my feet situation at the rock gym. Amazonians, Utilyze this product and get yours!",
      "rating": 5.0,
      "verified": true,
      "author": "Naimah Music",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Great",
      "text": "I have just received the manicure and pedicure set. The product got here when expected and everything looks very nice. This would even be a great gift for someone. Works well and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "No comparison to others",
      "text": "I bought this item for my wife,she loved it right from the start.There was no comparison to any of the sets she had before.Most of all she loved the many speeds.Great set and great price.",
      "rating": 5.0,
      "verified": true,
      "author": "B. H. Weiss",
      "helpful_votes": 4,
      "publication_date": 20170112
    },
    {
      "title": "Nice, lightweight, easy to turn on.",
      "text": "Gets the job done, sometimes mine goes off for a few seconds then comes back on but other than that it works. The light for the most part doesn’t work. I wish it had a tip that did a better job of getting the dip polish off. There are a few that will take it off but it takes a while. Have used it several times and glad I got it before they sold out. Hope to get my free set of tips, I registered online and it said once I did the amazon review I would receive the set.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "SURPRISE, SURPRISE !",
      "text": "I like everything about it . I am 79 yrs. old and cannot get out of the house. Now I can have my hands and feet looking good. It takes some practice to do my own finger nails, but I am doing better every time I use it. But I now have great looking toes. It is very easy to use and change tips. VERY SATISFIED",
      "rating": 5.0,
      "verified": true,
      "author": "teddybear",
      "helpful_votes": 2,
      "publication_date": 20181105
    },
    {
      "title": "JUST WHAT I'VE BEEN LOOKING FOR",
      "text": "After spending $50 for a professional pedicure this product was a welcome sight. It didn't take me long to get used to each attachment. I do have one suggestion: provide an add-on magnifying glass. Professional podiatrist EAT YOUR HEARTS OUT competition has arrived.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve ",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Works Well",
      "text": "I got this product so I could do my own manicures now that we are all quarantined. This nail drill has helped shaped my nails in addition to taking off my old acrylic nails. I look forward to many uses. Directions could be a little easier to understand for a beginner \"manicurist\" but other than that, it is working well so far.",
      "rating": 4.0,
      "verified": true,
      "author": "DanaD",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Uncomplicated Use and Great Results",
      "text": "I couldn't wait to get my Professional Manicure and Pedicure Set. I got it today and was already prepped to use it. The system is easy to use and I had great results. I highly recommend this product. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "CCT",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Great investment",
      "text": "Used this product to do my nails after salons were closed due to the Coronavirus. Great investment! Cost amour the same as one visit to the salon and I will be able to use it over and over.",
      "rating": 5.0,
      "verified": true,
      "author": "GG Judy",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "read instructions carefully.",
      "text": "yesterday my wife gave me a pedicure.I am diabetic and it is imperative that I keep my toenails in good shape.She used to use clippers and I got pinched often.The \" UTILYZE \" did a great job.NO pinch no fear no problem.It is probably the best my feet have looked in twenty years.I highly suggest that this product is all it is advertised to be.Get one.",
      "rating": 5.0,
      "verified": true,
      "author": "jon murphy",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Effective",
      "text": "This is my first time using an electric drill. I like it very much so far. I have always had very bad cuticles and use a cuticle nipper probably way too often and sometimes with bloody results. After using this last night, no blood! I’m sure I will become more adept the more I use it. My fingers feel soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Product Princess",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Nice manicure/pedicure set",
      "text": "Multiple tips for fine tuning manicure/pedicure needs. Easy to use. Design easy to hold. Have toenail that hard to clip/shape. This does the trick much easier than handheld tools and files. Downside - has to be plugged in to use so tied near electrical outlet; wish could be used cordless since outlets sometjmes not conveniently located.",
      "rating": 5.0,
      "verified": true,
      "author": "RE",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great for manicures and pedicures!",
      "text": "This is a really great set for both manicures and pedicures. Originally, I purchased it to use on my feet because my manual tools were not doing a good job. I love the way I can file down and shape my toenails so quickly! I also began using this on my fingernails, and now I would not go back to using manual tools. I absolutely recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Big Rog",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Vital Item When You Cannot Go To Nail Salon",
      "text": "I am used to having someone else give me a pedicure. Now that I am homebound, I needed another method. This handy device is that method. It is so much better than trying to cute those tough toe nails.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Johnston",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Very nice set with variable speeds",
      "text": "Works very well to grind away thick toenails caused by fungus. Does not damage surrounding skin if used carefully",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Wilson",
      "helpful_votes": 6,
      "publication_date": 20170926
    },
    {
      "title": "Easy to use right out of the box",
      "text": "I'm not a direction reader and had no problem using this tool right out of the box. It has everything I need to keep my finger and toe nails looking great when I am too busy (or in quarantine) to make it to the salon. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "klheather",
      "helpful_votes": 0,
      "publication_date": 20200422
    }
  ],
  "product_meta": {
    "title": "UTILYZE 10-in-1 Professional Electric Manicure & Pedicure Set, Powerful Nail Drill Kit, 10-Speed System, Innovative Touch Control, Tools to File, Buff, Smooth, Shine Nails, Remove Cuticles & Callus",
    "rating": 4.6,
    "feature_bullets": [
      "Complete 10-in-1 set that offers professional results. Shape, buff, file, and shine nails, remove excess cuticles, smooth corns and calluses.",
      "Innovative touch control makes it super easy to operate. A full manicure and pedicure tools kit right at home.",
      "Tired of products that only offer one or two speeds? This product is built with a progressive 10-Speed motor so you can choose a speed that works best for you.",
      "Detachable LED light for highlighted view during use and carrying case for easy storage.",
      "Powered by a 100-240V AC Adapter that offers much more consistent power than battery operated devices."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "8.1 x 5.1 x 3.2 inches; 15 Pounds",
      "Item model number": "Paubea123",
      "UPC": "749357601996",
      "Manufacturer": "UTILYZE",
      "ASIN": "B01F4KCK5I",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tools & Accessories",
      "Sets & Kits",
      "Beauty & Personal Care",
      "Foot, Hand & Nail Care"
    ],
    "price": 49.99
  }
}