{
  "website_summaries": [
    {
      "verdict": "The Blu R1 HD is an unlocked Android phone with a good balance of performance for the price, making it a fantastic value for Amazon Prime users and regular customers alike.",
      "pros": [
        "Inexpensive",
        "Sturdy build",
        "Solid battery life",
        "Latest Android software",
        "Dual SIM card slots and expandable storage"
      ],
      "cons": [
        "Prime-subsidized phone includes Amazon bloatware and advertising",
        "Lackluster camera"
      ],
      "aspects": {},
      "publication_date": 20170808,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Probably no better phone for the price",
      "text": "Surprisingly good performance for the price. Screen is bright and crisp, very zippy when browsing the web or playing HD videos. The ads don't really bother me (yet), but knowing you can always upgrade I'd strongly recommend the ad version first. Even at $100, this would still be a good phone. At $50, it's a killer. To be honest, I don't like is the heavy handed 'BLU' on the front of the phone. I really wish they'd take their deign cues from Motorola. Simple face, brand the case. It seemed to me that the phone ran a tiny bit hot while playing Pokemon Go, but that's full brightness, GPS, Wifi and all 4 processor cores running, so it's understandable.",
      "rating": 4.0,
      "verified": true,
      "author": "Blaine Christian",
      "helpful_votes": 3,
      "publication_date": 20160724
    },
    {
      "title": "Freezes, can't transfer to flash drive",
      "text": "Not a bad phone. Good looking, sturdy (get a case because if you drop screen cracks easily). Cons: internet freezes or there is a delay in movement. Have flash drive, there is no option to manually move pics and music to flash drive to create more space for apps. It always tells me I don't have enough storage when I try to download apps. Bought my daughter same phone and resets/reboots on occasion. Same origins as above. No settings for a password -protected private folder.",
      "rating": 3.0,
      "verified": true,
      "author": "Wandusa",
      "helpful_votes": 2,
      "publication_date": 20161218
    },
    {
      "title": "A Good cellphone but with a bit of mix up in purchase....",
      "text": "I have just received this cellphone a day ago and so far it looks and works good. Im sure my son will like it. It's camera produces good photos, almost as good as my Sumsung galaxy S7 edge does. However I think there was a mix up with the purchase of this item. I joined the Prime membership club and paid for it, with the hope that the prime membership price would be applied to this item. But that was not the case. I hope our reputed Amazon will look at this and sort it out as soon as possible. I am very likely to recommend it to anyone looking for a good cellphone at that cheap price.",
      "rating": 4.0,
      "verified": true,
      "author": "Volleny",
      "helpful_votes": 0,
      "publication_date": 20160925
    },
    {
      "title": "I regret buying this phone",
      "text": "I bought this phone because I had the same exact phone but it was getting old. I have been using this newer phone for a month and have decided to buy a different phone after being thoroughly disgusted. This phone is worse than my old one. I had to reinstall almost everything from my old phone because most information did not carry over, the battery is dead after half a day, phone screen freezes, calls are dropped. I am unable to access most features because of the time it takes to load. I'm very frustrated. I am going to buy a Samsung today.",
      "rating": 1.0,
      "verified": true,
      "author": "Joyce ",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Great smart phone for a great price.",
      "text": "Wanted a decent smartphone but without the high cost and this BLU phone has not disappointed. It takes great photos, with the bonus of a flash and flashlight which is a rarity with the less expensive phones. Comes with the latest Android OS and can accept micro SD. The fact that it displays Amazon ads as the screen saver surprisingly doesn't bother me at all. Love this phone so much, we bought another so we each have one",
      "rating": 5.0,
      "verified": true,
      "author": "Eric and Sherrell",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "Good kids phone",
      "text": "Good kids phone. Love that it is integrated with the Kindle app store. Ultimately ended up going up to the 16gb one though. We put a 128gb micro SD in it and it hols hours of Amazon prime video offline for free! Great for long car rides and little kids.",
      "rating": 4.0,
      "verified": true,
      "author": ".",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Screen brightness is awesome. Haven't dropped it so I can't attest to ...",
      "text": "I've had this phone for a few months. Haven't had to take it overseas yet (will do so in a few weeks), but the reception has been decent. 8GB isn't a lot of space, so I bought an SD card. Screen brightness is awesome. Haven't dropped it so I can't attest to its sturdiness yet, but I got a wallet case for it. It's a steal at $50! Edit: I've taken it overseas to use in a England and Wales with an EE Mobile SIM card. Calls, texts, Facebook, and web browser works great. Camera is so-so...I used my iPhone for pics instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Amara",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Pretty amazing",
      "text": "I needed a phone to hold me off till my iPhone 7 plus comes in. I sold my iPhone 6 plus on eBay. I am kind of a apple geek, really love my apple. Saw some of reviews of this phone nd i thought, no way i would enjoy this, but hey its 50 bucks, its only going to be a a week or so, why not? I am impressed. Its snappy, its bright, running 6.0 on android, i mean I'm starting to wonder, why am i paying so much, LOL. Great purchase, definitely going to keep this around in case of emergencies or even traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "N.York",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Very slow but okay for price.",
      "text": "If you are a Snapchat person. Do not get this phone! It's doesn't work well at all. Constantly closing running slow and such. It doesn't have any memory at all. Because of all the extra stuff you cant install. I even got a micro SD card and it didn't help at all. Social media apps are constantly closing and the camera quality isn't the best. I would have preferred paying twenty bucks more and getting something with more RAM. It isn't the worst phone. I just enjoy taking pictures and sharing them. It's just really slow.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrea Rose Acosta",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Good for the price",
      "text": "For a budget phone I don’t think anyone can go wrong with the price point. I’ve bought two Blu phones and this one definitely out performs the other one. This isn’t a daily driver for me so haven’t been put through heavy usage but for the most part haven’t failed in any of the tasks I threw at it. Great for web surfing and not power intensive gaming.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Great phone at an amazing price!  Used on Cricket Wireless.",
      "text": "We decided to switch from Verizon to Cricket Wireless. I bought two of these because the run on 4g LTE networks. One discounted version with the Amazon software on it and one without at full price. These phones are absolutely amazing. The run smooth and have plenty of storage for apps. They are light and the displays are sharp. Can't say enough about them really. Glad I stumbled across them. I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Cryptologic",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Great value for a no-nonsense basic Android phone",
      "text": "For the price this is an amazing phone. Works great, will do the job. However, there are 2 points. 1. Look at the specs and realize that it is a low-horsepower phone. It isn't going to operate as speedily as your $500 phone. If you load it up with a ton of apps running, it will run pretty sluggish. 2. It has 1GB of RAM and 8GB total memory. To be functional, you will need to install a Micro SD card as well. This is a must if you want to install apps. Just install, configure the SD card as the primary save location and you will be good to go.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Craddock",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "An Awesome Phone",
      "text": "Bought this phone for my wife to replace an older phone. We don't use the data feature much, primarily used to make and answer phone calls. Very happy with the quality of the phone - the display is very bold and crisp. I highly recommend this phone to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Neupert",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Truly the best bang for your buck!",
      "text": "I bought this phone because the screen on my Galaxy S6 was completely cracked and the digitizer was damaged and I did not want to spend $175 on the insurance or $350 to get a new phone. I was not expecting much, I did some research about BLU and read a whole bunch of reviews and I took a leap of faith. Let me tell you that if you have a good data plan and you do the latest android marshmallow update this is a great phone! the camera take really good pictures and the battery life (streaming most of the day) is truly amazing! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170629
    },
    {
      "title": "Perfect for Developing!",
      "text": "The perfect phone for development. I had to develop an Android app this semester and purchased this phone since I already had an iPhone. It's amazing for the price. Out of all the phones we tested the app on, this had the least bugs and worked as good if not better as the much more expensive phones my team members had. I would recommend maybe getting the 16GB if you plan to install a lot of apps though since the Amazon content takes up space. Other than a subpar camera, this phone is excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Sachs",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "This is a nicely designed phone",
      "text": "This is a nicely designed phone. The phone works great, the browsing working great, the pre-installed apps work good. The Volume and Ringtones are bit on the quiet side. Even turned on the outside setting and it still is hard to hear. Seems like the apps that I install work sometimes and not other times. Not sure if this is the phone or the app. Although I have tried several apps that are in the same category as I was wanting. For a the price this is a good phone over all. Would recommend to others.",
      "rating": 4.0,
      "verified": true,
      "author": "Tamara Parker",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Happy",
      "text": "I'm pleased with my purchase of this phone. It looks and feels like a more expensive phone. I had no problems setting it up. The ads aren't too obtrusive. The only complaint I have is that the speaker volume isn't very good.I have it set on the outdoor setting and at the highest level and it still is just barely adequate.",
      "rating": 5.0,
      "verified": true,
      "author": "dsaxophone",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "High quality low price.",
      "text": "I just recieved my Blu, for the price you can't beat it. The only thing i have a problem with is the speaker. the sound sucks, if you use head phone it's so much better. Also hate the location of the speaker, they could have picked a better spot for it. Like i said for the price of this phone who can complaiin. I give it two thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Cal",
      "helpful_votes": 2,
      "publication_date": 20160815
    },
    {
      "title": "Good phone for the $",
      "text": "Really nice phone for the $! Nice to be able to dump & switch carriers if you are unhappy with your current one.",
      "rating": 5.0,
      "verified": true,
      "author": "Coultergeist",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Great phone! It's the second that I've got as ...",
      "text": "Great phone! It's the second that I've got as a gift for some family members to use overseas and this is an amazing budget phone. Adds are not that annoying and they only show up on locked screen so it's not a biggie, specially when you're saving 50 bucks. So far I can say this is a great phone at an unbeatable price!",
      "rating": 5.0,
      "verified": true,
      "author": "Ggaby",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Three BLU R1 HD failed on me...Buyer beware...",
      "text": "Really wanted to like this phone because of the price and the specs. However, I had to return the first one after the touch screen stopped working. The replacement worked for several months but then that phone had the same issue. While the other one was working, I bought another one (same model) which worked for several months too. But it went into some permanent reboot loop to a recovery menu. I do not trust BLU anymore. Sorry....",
      "rating": 2.0,
      "verified": true,
      "author": "PAUL  J",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "I love this phone",
      "text": "The only thing I don't like about this phone is that you have to sign in to with a pin number to use the phone and I have searched every where in this phone to turn that fixture off and have not find it, the reason I don't want that pin is that if I have an emergency I will probably forget that pin numbers, and the fact that it has only 8 GB, but I can always buy more memory, other than that I love this phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Fantastic phone. Will give a tough competition to expensive smart phones.",
      "text": "Received it on July 13th a day after the release. Transferring the SIM from old phone was easy and it turned on nice. Very responsive phone and all functionalities seems to be working fine. Tested camera, messaging, phone call quality etc. all working fantastic. For $50 this phone seems to be as good as any highly expensive phones.",
      "rating": 5.0,
      "verified": true,
      "author": "Vbhal",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Nice Phone!",
      "text": "I am surprised how nice this phone is. Even with the Amazon ads, I can do things on my phone my other one couldn't/wouldn't. The pictures are nice and even the pictures off my SD card from my other phone look good. I was skeptical about the phone because it was only $50, but all in all, I can't complain. It runs smooth.",
      "rating": 4.0,
      "verified": true,
      "author": "LadyOphelia1988",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Ok as a secondary or kids phone only!",
      "text": "The phone and screen seem to be durable. But either because of all the overloaded Amazon apps or a defect with the phone itself the phone will reboot itself without warning. I'd say it's a good phone to give your kids to use but as a primary business phone which is what I needed I'm not impressed. Even with 1Gb of ram it lags and with all the apps that come loaded on it you lose almost 4 GB of storage.",
      "rating": 1.0,
      "verified": true,
      "author": "Gypsy Wolf",
      "helpful_votes": 2,
      "publication_date": 20161010
    },
    {
      "title": "Battery life is good Screen looks good to me Feels like a mid ...",
      "text": "How they are making money by selling this for $49 is beyond me. I bought this phone after my Galaxy S7 Edge had a meltdown and the warranty claim was taking several months and now I'm contemplating just selling the Samsung and keeping this thing. Pros: Battery life is good Screen looks good to me Feels like a mid range smartphone to hold Removable storage Camera is good for daytime shots Cons: Camera is poor at low light photos Battery is non removable Will struggle to play high end 3d games but is fine with stuff like Pokemon Go (but really what do you expect for $49)",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Budd",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "but it's been a very good phone. Connects to wifi no problems",
      "text": "Ordered this phone after I dropped mine in the water. I wasnt sure at first, but it's been a very good phone. Connects to wifi no problems. Service is good, camera is OK. Some of the pictures are a little grainy if you zoom in. The speaker is fair, could be louder when playing video. But over-all good functioning phone",
      "rating": 4.0,
      "verified": true,
      "author": "Carrie B.",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "reheats battery",
      "text": "Its screen is very good, but the materials with which it is designed is of poor quality. Your battery keeps the phone very hot.",
      "rating": 1.0,
      "verified": true,
      "author": "Ronald Marin",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Buy it.",
      "text": "Great phone only problem is finding a replacement plug, universal plugs don't last long.",
      "rating": 5.0,
      "verified": true,
      "author": "poetic",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Has a flaw that needs to be fixed",
      "text": "The phone has functioned properly BUT the charger does not work properly. When you plug it in it wobbles and sometimes shows it is charging but if you move it even slightly the contact between phone and charger suddenly is not working and not charging. So you wake up in the morning and your phone is dead because the charger connection did not work. I've had the phone about 5 months and this has been going on the last two. Because of this flaw I cannot recommend this phone. I don't know how to contact anyone at Amazon about this. It's a flaw that I should not be seeing.",
      "rating": 2.0,
      "verified": true,
      "author": "Eryn",
      "helpful_votes": 5,
      "publication_date": 20170420
    },
    {
      "title": "Which is annoying. I use hyper links on the home screen ...",
      "text": "BUY the 2 ram, this needs more space, it has the amazon stuff and the google stuff....... which neither can be removed. I can only use a few apps. Which is annoying. I use hyper links on the home screen to get around this issue. But I will buy another with more RAM.",
      "rating": 4.0,
      "verified": true,
      "author": "Kiwi",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "crap",
      "text": "I would give it less then a 1 like 0/5 stars. Its a good throw away phone but shpuld be 10 dollars. Freezes all the time. Slow. Closes apps. If you dont have a sd card you can only download like 2 apps there is no space because of all the useless apps that come with it that you cant remove. I believe it should be dropped to 10 dollars. Phone is perfect of you use it for 3 days.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Bought for my mom.",
      "text": "Own for few months. So far so good. No drop calls. Great price. I use a memory card but if you have lots of downloads that uses internal storage. Eg apps/ games...go up to 16GB. For a few $ more its worth it. The phone already comes with its own set of apps taking up enough space.",
      "rating": 5.0,
      "verified": true,
      "author": "Bre Reviews",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Overall I am pleased with this phone and BLU needs more recognition for ...",
      "text": "Lovely phone, specially for the price! There are some minor hiccups when unlocking the phone. That might be because of the 1G ram.. Maybe I should have went with the 2G.. Once it is going i dont have any problems with apps or videos. No problems over heating. Overall I am pleased with this phone and BLU needs more recognition for the products they offer. What a great company..",
      "rating": 5.0,
      "verified": true,
      "author": "Jay504702",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Great phone",
      "text": "I bought this phone for my teenage son who had lost an expensive iPhone in the past. I read the reviews prior and they were spot on. It's a great phone at a great price. My son couldn't be happier and I can rest better knowing he has a good product and I didn't have to invest a large amount. The picture is sharp and it functions very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Luvparis",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Bursts into flames",
      "text": "Do not buy this product or anything from the same company. The manufacturer is CT Miami LLC. Thankfully we were home when it burst into flames otherwise our house would have burned down. There is no recall but there should be. If you have this phone get rid of it!",
      "rating": 1.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "and it's pretty! The ads that are displayed when you turn ...",
      "text": "I have no complaints; this phone works flawlessly...and it's pretty! The ads that are displayed when you turn the phone on disappear with that first swipe...totally non-obtrusive in my opinion. My only regret is that I didn't get the 16 GB version.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Hyatt",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Great phone for the money!",
      "text": "I have had this phone for over a year and I have definitely gotten my money out of it! I purchased the 16gb model in August of last year and have since taken with it me to Europe as my primary travel tool. I used it as a map and my camera. The camera held up well and worked better than I was expecting! In short this phone is not perfect and may not be worth the nearly $100 it costs now but if you can get it on sale you won't be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Noah",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "almost perfect, amazing price",
      "text": "Most of what has been written already makes this review a little redundant. Just wanted to add my two cents Pros: Almost everything Cons: I use an app that monitors the temp of the phone and every day or two the phone seems to be overheating. I use the app to power down other open apps and it is fine. Although related before, it is amazing that such a nice phone has a VERY soft speaker. I am using a speaker booster app which helps a little but still, it is annoying.",
      "rating": 5.0,
      "verified": true,
      "author": "happy ipad user",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Great great value!",
      "text": "The first one we bought fell from short distance and despite having a glass protector, broke. Amazon was kind enough to replace it and my daughter loves it. Does everything a expensive android does, but it is lighter and super way cheaper. Ill will purchase one for my son when he is old enough for sure!!",
      "rating": 5.0,
      "verified": true,
      "author": "PPalomera",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "The king of quality price!",
      "text": "The best for its price in battery, design and performance, you can not ask for more. It has certainly been one of my favorite low-end phones, its pretty screen, its good camera, it's dual sim. This device has it all.",
      "rating": 4.0,
      "verified": true,
      "author": "Andres Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Nice hardware for $50",
      "text": "Nice hardware for $50. I bought this to use as an Android device to connect to my car via an OBD dongle thus cant comment on how it works as a phone. It wont get much more use than that unless the kids want to play a game or two on road trips perhaps.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Brown",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Does not power on after few months",
      "text": "Purchased this in July, worked fine until now but it refused to power on now. Tried everything but it will not power on. Contacted Blu support but I need to send this to them using my own shipping!",
      "rating": 1.0,
      "verified": true,
      "author": "Abhijeet Magdum",
      "helpful_votes": 5,
      "publication_date": 20161129
    },
    {
      "title": "Good",
      "text": "Broke my iPhone and had to find a quick replacement for the mean time. Don't like android but this phone actually surprised me and for the price it does the job. After I was done using it I send it away to another country for some relatives to use. They love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Awsome Cell Phone for the Price",
      "text": "Absolutely works like a US$150 Cell Phone. I am a happy customer. The product is Far Better than advertised. No problems with the supplier. Arrived a little bit delayed, But no complaints at all.",
      "rating": 5.0,
      "verified": true,
      "author": "AJMV",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Good for the price",
      "text": "This is a good phone for its price. If you don't pay much you shouldn't expect much. I have had a BLU phone for 3 years now and will probably continue with them as long as they continue to advance",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Awesome budget phone!!!",
      "text": "This is a breeze to use. No carrier setting to input. Just pop in your sim and your good to go. Camera is good and the front facing camera with flash is really cool. Very nice overall feel only negative is the back is kinda of sticky (hard to get off and on)",
      "rating": 5.0,
      "verified": true,
      "author": "Haley L Randolph",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Good value. Still using this phone for 2 years ...",
      "text": "Good value. Still using this phone for 2 years with no slow downs or issues",
      "rating": 5.0,
      "verified": true,
      "author": "Eshenro",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Got is at great deal. Now free from contracts",
      "text": "Got is at great deal. Now free from contracts! Works like android and a fire phone. Can do almost anything. Better than the last iphone I bought for 500$ Nothing wrong with this phone at all! Totally love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "timothy",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Great phone, I would recommend spending the extra $10 for the 16GB model",
      "text": "Great phone for my son to play Pokemon. I only bought the 8GB because I failed to see that the 16GB for $10 more has 2GB of ram compared to the 1GB in the 8GB version. It still works great but if you get a lot of apps open you notice that the ram is filled up. Overall great phone",
      "rating": 4.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Love this phone!",
      "text": "Love this phone! Would buy it again! No problems at all with this phone!",
      "rating": 5.0,
      "verified": true,
      "author": "laurel chase",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "I do recommend the 16 GB",
      "text": "I have had this phone for months and no problems. I do recommend the 16 GB, 8 GB just isn't enough. The sound and the resolution is good for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Prim n Whimsy Creations",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Much better than the G4",
      "text": "Love it! I finally give up on the G4 after many problems. I was worried about the slower processor but I haven't noticed with my apps. Camera is much better than the G4. With a 32g SD card storage isn't a issue.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Cadenhead",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Very good phone for the price",
      "text": "Very good phone for the price, not the fastest or the one with the newest features, but excellent for the price point. Also comes with Android Marshmallow from the box, this was a gift for a family member, very happy so far, recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Alejovet",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Best low cost unlocked phone",
      "text": "Fantastic for the price. Quick, reliable, good battery. Solid quality construction. Love the soft touch backing. Easy to use. The ads are non intrusive, so it's worth the price. And really, dual SIM in a $50 phone? Worldwide use. Good phone good pick.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Y",
      "helpful_votes": 2,
      "publication_date": 20161007
    },
    {
      "title": "Otherwise seems to be a good phone.",
      "text": "It's a little quirky. Likes to reset itself at odd times. Otherwise seems to be a good phone. Update after a few months. Headphone jack does not work. Bluetooth will not pair. Locks up a lot requiring restart. Going to get a MOTO G4 play. Screw BLU lol",
      "rating": 2.0,
      "verified": true,
      "author": "Dirtman",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Worked in Canada",
      "text": "I had to get a new phone when I went to Canada for school. It worked right away with a card from Telus, and they said it was the only android that had worked so quickly. It's been over a year, and I've never had a problem. I paid extra for the ad-free version. The only thing I want to add is extra storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Excellent product, it works very well and it is ...",
      "text": "Excellent product, it works very well and it is very fast, the bad thing is that it heats a little in use, that's why my 4 stars. It works well with bands in LatinAmerica and the Caribbean and in the rest of the world.",
      "rating": 4.0,
      "verified": true,
      "author": "Roberto Ochoa",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Oops",
      "text": "I wrote to the people who supplied the case and informed them that the USB plug is bigger then the opening you people need to get together and fix it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Can't miss",
      "text": "This phone saved me a lot of money. This phone will do everything I need it to do and something I don't. I said I would try it for the price, I will keep using it for the service it gives me.",
      "rating": 4.0,
      "verified": true,
      "author": "Hoop 4",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Nice cellphone for 50usd with Amazon adds",
      "text": "Nice cellphone for 50usd with Amazon adds; I gave it to my father and he is very happy with it.. I recommend it for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Silvio",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Cheap phone that works well",
      "text": "I purchased this phone to use as a hotspot for sharing my cell phone data to my 8inch tablet when I am on bus. It worked really well. I am very happy with my purchase. For under $50, I have no complain about anything. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "J Seal",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Not good !!!",
      "text": "Screen froze and wouldn’t shut off right out the box",
      "rating": 2.0,
      "verified": true,
      "author": "Johnny Mac1969",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Surpassed my expectation.",
      "text": "This was a great phone. It lasted me over 18 months. Has lots of great features. The camera takes good quality pictures. Good memory capacity.",
      "rating": 5.0,
      "verified": true,
      "author": "Dongor",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "A really nice phone and a fantastic price.",
      "text": "I bought this for my wife. She really likes it. I like it's look, feel and operation better than my much more expensive phone. I would get one myself except my phone takes slightly better pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Daytona Dave",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "do not waste your money",
      "text": "I was excited when I saw all the included apps. BUT darn, the phone never shut up. It was always noisily informing me of an update or something else. What a waste of money. I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customers",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Good inexpensive phone which was dual sim",
      "text": "Good inexpensive phone which was dual sim. I added a 16 gb micro card with no problem. Fast shipping! Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Octavio Madrid",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Great phone, but......",
      "text": "This phone is great for someone who doesn't use social media. The apps for Facebook, Twitter, Pinterest, etc all crash or don't even start up. Can't eve play Pokemon go. But it is a great phone other than that.",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa Mendoza",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Memory space is a problem. The built-in Amazon apps take a lot of space and cannot be uninstalled",
      "text": "Phone works well. Initial setup is long but otherwise I like this phone. Sleek look.",
      "rating": 4.0,
      "verified": true,
      "author": "Natasha P.",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Everything else is fine.",
      "text": "8gb memory fills up very quickly. The speaker isn't very loud. Camera is only okay. Everything else is fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Good screen, build quality and battery life but 1 ...",
      "text": "Good screen , build quality and battery life but 1 gb ram model slows down fast",
      "rating": 4.0,
      "verified": true,
      "author": "R till",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Can't beat it for the price.",
      "text": "It's a very good burner phone,nice feel keys are very responsive,it's not my everyday phone no reason it couldn't be.I paid like 700 for my Galaxy 7 Edge no way it's 7 times better I can't come up with one thing wrong with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert McGowan",
      "helpful_votes": 0,
      "publication_date": 20161001
    },
    {
      "title": "Great phone and party trick",
      "text": "Great bargain. Excellent phone. One peeve. Why is the glass on the phone polarized? When I have my polarized (prescription) sunglasses on, I lose my display. If I turn the phone (or glasses) 90-degrees then the display reappears. Not found glass perform like this on other smartphones. Sounds a bit over-engineered in this area. Do have a party trick that gets people scratching their heads though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Wonderul Phone!!",
      "text": "Excellent phone! So many features, great quality, and wonderful altogether! You get all the Prime Deals flashing on the screen, but that is worth it to get the great price and all of the Amazon features built in.",
      "rating": 5.0,
      "verified": true,
      "author": "Dani K.",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Best value tablet",
      "text": "An excellent tablet relative to the cost. What's more, occasionally Amazon will run a special sale which makes them almost too good to pass up. I have given many as gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward A Logan",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Four Stars",
      "text": "Looks great. Works great. Would have liked a built in offline radio application though.",
      "rating": 4.0,
      "verified": true,
      "author": "Lexi",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Bought it for my mom!",
      "text": "So I purchased this for my 70 year old mother and this was her first introduction to a smartphone. Now after I purchased this I noticed it came with adds, I immediately thought ot would be an issue, it was not my mom barely notices the adds and is adapting fairly well to the smartphone. For the price it is an excellent buy.",
      "rating": 5.0,
      "verified": true,
      "author": "GabrielHuertas",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Have had it for a week and really like it. I have had people tell me to ...",
      "text": "Have had it for a week and really like it. I have had people tell me to be careful about the battery overheating and possible damaging explosive battery. I have noticed a couple times the phone got hot and I ceased using it to cool it but the features and phone have been great so far for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Cuma Renee",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Overall phone quality decline over time",
      "text": "What at first seemed as a steal, quickly turned to a regret. I purchased this phone around early march for my fathers birthday. It worked great for the first couple of months, however, now the phone loses its charge way too fast, and it also takes a very long time to charge. The phone itself has become extremely laggy and at times completely unresponsive; but I guess, you get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph Larios",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "This is a Christmas gift for my son. He ...",
      "text": "This is a Christmas gift for my son. He loves it. I feel it is capable to do what other $300 phone can do. The only thing is, the photo quality is not that superb, but considering with the price and value, this is an outstanding product!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Fung",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Broken after just a few weeks...",
      "text": "It just shut down on me. I can appreciate that it's not expensive to begin with, but I certainly expected it to last longer than it did.",
      "rating": 3.0,
      "verified": true,
      "author": "gph",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Best Blu ever made",
      "text": "Best Blu device in history in my opinion. Just needs updates",
      "rating": 4.0,
      "verified": true,
      "author": "Raccoon's Sports Bar",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Okay for the price, but bluetooth functionality is bad.",
      "text": "Definitely not bad for the price, but the bluetooth functionality is subpar at best and very unreliable. The UI can also be very slow to respond and sometimes you'll have to tap the screen multiple times before it will register.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Roach",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "If you don't mind so much about speaker buy it.",
      "text": "Good value. Bad speaker. Nice and smooth design. Recommend it",
      "rating": 4.0,
      "verified": true,
      "author": "Oscar Jimenez Mena",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Five Stars",
      "text": "Already the product arrived, and it is as advertised, thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio Vele",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Best phone ever...",
      "text": "This phone is amazing.. Absolutely love it one of the best phones I ever had ...and the strongest ..when it survive the compactor at work comes out still working like new not a scratch on it you know you got a good phone ...would recommend this phone to everyone...great deal!! great phone!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "If you get this phone I highly recommend getting a memory card for it and keep customization ...",
      "text": "It does the job, it struggles while at it, lags, crashes while at it but it does. If you get this phone I highly recommend getting a memory card for it and keep customization to a bare minimum. The screen is beautiful though. If you can go for the higher tier with 2gb of ram or the Motorola",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Worth it for travelers",
      "text": "This phone was worth every penny. I've been using it for my international travels and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Fantastic unlocked $50 phone",
      "text": "Fantastic unlocked $50 phone. I was skeptical about buying it with advertisements on the lock screen, but it's really non-obtrusive. You do have the Amazon Apps installed, but there's nothing pushy or gimmicky and it feels like a cheap Nexus phone. The screen is sharp and great for reading text. The BLU R1 also supports the 2,4,7 and 17 LTE bands with 12 on its way, so it works well with LTE on both AT&T and T-Mobile. I set this up with theso that I now have a relatively inexpensive world phone, though FreedomPop sadly doesn't support LTE.",
      "rating": 5.0,
      "verified": true,
      "author": "William Reading",
      "helpful_votes": 3,
      "publication_date": 20160714
    },
    {
      "title": "The look and size is great. Great replacement phone if you had a iPhone ...",
      "text": "Just got the phone yesterday. The look and size is great. Great replacement phone if you had a iPhone or Galaxy. Easy to use set up has a iPhone look from the side. With the Galaxy feel. Overall I would recommend this phone. Totally worth the price",
      "rating": 5.0,
      "verified": true,
      "author": "Shahid Fecunda",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "A general review for the general user",
      "text": "The Good: -really fast -good storage -really low price -almost pure android 6.0 The average: -camera only is good during the day, during the night its bad quality -the speaker is on the back and is a single one -screen may be prone to cracks if droped The bad: -blue never honors their warranties, and ignores users -the packagins is kinda bad, only comes with charger -it wont get android 7 or any meaningfull update probably, blu sucks in updates",
      "rating": 4.0,
      "verified": true,
      "author": "EdVer",
      "helpful_votes": 3,
      "publication_date": 20161225
    },
    {
      "title": "Frustrating",
      "text": "This I thought was an amazing deal now I see why it's a nice phone but extremely slow, 1/2 the memory was already taken up with the insane amount of apps and it will not connect the to the sd memory",
      "rating": 3.0,
      "verified": true,
      "author": "Ericka H",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "its a good phone but a slow assistant",
      "text": "works well as a phone, wish I could take advantage of the dual sim. 8gb is very small given the bloat. the phone gets slow with a couple of apps open. It does work well as a phone",
      "rating": 3.0,
      "verified": true,
      "author": "brandon",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Blu phone with ads",
      "text": "Here it is. You can't get a better phone for the money, period. The ads are unobtrusive, the phone is fast. Picture is great. I didn't get a thing for this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Weems",
      "helpful_votes": 0,
      "publication_date": 20160721
    },
    {
      "title": "Amazing phone on amazon",
      "text": "I bought this phone just a month ago. It still works perfectly, for me this phone is the best phone at this price ($ 49.99 or $ 50.99 for prime member and $ 99.99 or $ 100.99 if you do not have prime membership) . I still love this phone. It works perfectly in Haiti.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnson G.",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Great promotion!",
      "text": "What a nice phone, very good for the price an excellent to have it as 2nd phone when you travel abroad and it is not safe",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Alejandra Rincon",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Great Buy for a great price...",
      "text": "Very good basic phone. It just does all the stuff a basic smart phone supposed to do. And you can't beat the price. Great buy...",
      "rating": 5.0,
      "verified": true,
      "author": "Nutty104",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "i love it, it has been delivered on time good ...",
      "text": "i love it, it has been delivered on time good pic quality, the phone works prety good with local SIM card, i recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Dias",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Awesome phone!",
      "text": "Awesome phone!! So sick want to buy another one and need a case as well but super cool holds two Sims easy carry over and easy Amazon apps to make use of all you prime experience",
      "rating": 5.0,
      "verified": true,
      "author": "Skyler",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Worth the price, do yourself a favor though and buy a memory card.",
      "text": "For the price and overall functionality it's worth the price. My only issue with the Amazon Prime 8GB version is that although it may technically have that total memory, it's so loaded up that you need to buy a memory card if you want to add more than a few apps :(",
      "rating": 3.0,
      "verified": true,
      "author": "Jared Wolf",
      "helpful_votes": 0,
      "publication_date": 20160809
    }
  ],
  "product_meta": {
    "price": "",
    "specifications": {}
  }
}