{
  "website_summaries": [
    {
      "verdict": "The Mudclaw 300 from Inov-8 is a trail shoe that’s made for hard terrain and hardened trail enthusiasts who want to experience a solid option when adventuring. It’s sturdy, durable and comfortable to wear for neutral runners.",
      "pros": [
        "The upper unit of the Mudclaw 300 is flexible and durable, allowing for a reliable coverage to the foot, remarked some runners",
        "Most reviewers appreciated the mesh lining and the water repellent coating that keeps the foot clean and dry",
        "A large number of runners welcomed the protective components, such as the Gusseted Tongue, which keeps dirt from entering the shoe",
        "EVA makes up the mid-sole layer and it’s coupled with the Meta-Shank groove design on the forefoot for more natural foot movement",
        "The Dual-C outsole is made up of sticky rubber for more durability and grip on the surfaces"
      ],
      "cons": [
        "Others thought that it was greatly missing the arch support needed for many runners who need such a feature",
        "The testers noticed that the outsole wasn’t able to offer much traction on wet surfaces"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.2,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Reassuring grip and traction",
      "text": "I am writing this after my first use on a 3 hours run in mostly muddy fields They felt really comfy and the grip on the mud was really good, I had to cross some roads and run on a dirt track, to be fair didn’t expect them to be brilliant there but to be honest they were a little bit ok. Mud And wet grounds is where they belong and they did s good job.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Another good pair of Mudclaws",
      "text": "Well, this is my third pair of Mudclaws so you can guess that I like them, and this pair is no exception. I slightly preferred the higher heel support on this version to the lower heel back of the newer style.",
      "rating": 5.0,
      "verified": true,
      "author": "Fender Jazz",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "This shoe re-opens wet, muddy trails!",
      "text": "A fantastic shoe that lives up to its name! I enjoy the hills around Sheffield but my Pearl Izumi and Brook 9, whilst great shoes, just can’t cope with wet, muddy trails during the winter! I found the size 10 Mudclaw a snug fit, but this proved ideal, particularly on steep, challenging mud/rock slopes. And better still - after a muddy run - incredibly quick and easy to wash/ clean! Strongly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "S ROBINSON",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Looks like wear damage",
      "text": "A number of stitching faults with fraying around joins. I have purchased Inov8 products before and never seen a pair like this.",
      "rating": 1.0,
      "verified": true,
      "author": "Avid reader",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good off road shoe",
      "text": "I've had several pairs of Mudclaws over the years. Good in terrain, supportive. Good grip - particularly on grass and soft surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "navman47",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great traction in very sticky mud on a trail 7k ...",
      "text": "Great traction in very sticky mud on a trail 7k today after a lot of rain. Very impressed. I did not slip and slide at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Nigel Field",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Amazing trail shoes!!",
      "text": "Amazing trail shoes!! great fit, so much grip for muddy UK winter conditions. Also seemed really water resistant despite some serious deep mud my feet stayed dry. The tread did not clog with mud either... I love them! new fav running shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Rainbow",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Don't use till broken in",
      "text": "I used them for trail running and had to break them. In for a few days because they cut the heels of me but now they are fine",
      "rating": 5.0,
      "verified": true,
      "author": "Gareth Dempsey",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "The grip on these is great though.",
      "text": "Bought a half size bigger after reading customer feedback. Still a bit on the small size the heel is loose and doesn't grip right, the sole is very rigid and as a result made my feet sore after only two miles! The grip on these is great though.",
      "rating": 2.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "My first outdoor running shoes",
      "text": "Awesome shoes. Lovely tight fit, which loosened a little on my first run but staid in place. Very happy with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Radishjack",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "... of Innov-8 trail shoes and they really are the perfect shoes for OCR racing",
      "text": "This is my third pair of Innov-8 trail shoes and they really are the perfect shoes for OCR racing.",
      "rating": 5.0,
      "verified": true,
      "author": "m",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "10/10 for tough mudders",
      "text": "Use theses first time for 5 k tough mudder in london 23/03/2018 .The grip was amazing trying get over the walls and running up drain pipe 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Ian W.",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Five Stars",
      "text": "Fantastic service, arrived 2 days ahead of schedule! Product, as expected, is perfect! Many thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Danky",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Perfect for running through the mud!",
      "text": "From reading other reviews I knew that this would be a little small compared to usual. I typically wear a UK size 12 but ordered a size 13 and they fit great. The shoes are incredible to say the least. I knew the grip would be good on mud but was surprised by how good the grip was on slippy concrete as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick WDJ",
      "helpful_votes": 0,
      "publication_date": 20201212
    },
    {
      "title": "Bad design unlike the other midclaws",
      "text": "I was so looking forward to getting these after borrowing a pair of mudclaw 330 for a race from a friend. But these one have cut into the back of my feet after just 6 miles so total waste of money. If you look at the picture you can see the back of the show (behind the back of you foot) goes up and isn't flat like most of their other shoes and it's hard and just digs and cuts in to my foot every step I take. Wasted £80 and really upset about it",
      "rating": 2.0,
      "verified": false,
      "author": "Mrs Sharon J Anderson",
      "helpful_votes": 0,
      "publication_date": 20180222
    }
  ],
  "product_meta": {
    "title": "inov-8 Men's Mudclaw 300 Trail Running Shoe",
    "description": "Propels fell and mountain runners over the muddiest of terrains by delivering the ultimate grip in mud through an aggressive outsole. A unique stud design releases mud as quickly and efficiently as it grips to it. Perfect for running in the fells and mountains when the terrain is muddy and the ultimate in grip is needed. Weighs 300G and the full rand delivers increased protection.",
    "rating": 4.4,
    "feature_bullets": [
      "For running on soft and muddy terrain.",
      "Unrivalled grip: The most aggressive outsole in the inov-8 range boasts 8mm studs that deliver the best grip possible over muddy terrain.",
      "Outer Material: Synthetic",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Material Composition: Synthetic",
      "Shoe Width: Medium",
      "Beat the mud: The multi directional stud pattern ensures mud is released quickly from the outsole, so the studs are always able to deliver maximum grip with every step.",
      "Durability: A Dual-C combination of medium sticky and hard sticky rubbers ensure the studs stay strong over time and continue to deliver.",
      "Increased protection: The rand that wraps around the shoe's upper and toe bumper ensure outstanding protection against stones and other debris."
    ],
    "specifications": {
      "Item Weight": "300.5 Grams",
      "Date First Available": "8 Feb. 2017",
      "Manufacturer": "Inov-8, LLC",
      "ASIN": "B01IFSGGLA",
      "Item model number": "000558-BKBLRD-P-01",
      "Department": "Men’s"
    },
    "categories": [
      "Trail Running Shoes",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 106.39
  }
}