{
  "website_summaries": [
    {
      "verdict": "An attractive shoe with a flexible upper that conforms to your foot.",
      "pros": [
        "Flexible upper keeps your feet cool",
        "Lightweight but they have a firm sole that reduces foot fatigue",
        "Cushioning makes them feel good while you run"
      ],
      "cons": [
        "Run small so you might need to order a half size up"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Women's Shoes, not Men's",
      "text": "These shoes are definitely women's shoes.... On the product landing page for these shoes the title is \"Under Armour Women's Threadborne Slingflex\" but in the shopping cart, receipt and order history the title is \"Under Armour Men's Threadborne Slingflex Sneaker Black (001)/Anthracite\". I was concerned when I placed the order but thankfully what I received is women's shoes. Other than that discrepancy, these shoes are great. They fit perfectly and are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "LEUT",
      "helpful_votes": 4,
      "publication_date": 20190308
    },
    {
      "title": "Highly recommend",
      "text": "I LOVE these shoes! I am very picky about shoes because of how my feet are. I have slightly wider feet, but they aren’t wide enough for a wide shoe. I got these as gym shoes because my Nikes were beginning to hurt my feet. I got the same size that I wear in Nike shoes and the fit is amazing. I love the flexibility of these, they are so so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "LaRissa",
      "helpful_votes": 9,
      "publication_date": 20171221
    },
    {
      "title": "Best athletic shoes I own",
      "text": "I don't care that these shoes cost me 100$. I wear them in dirt when I'm hiking, running, casual, work. I love these shoes. So comfortable and look amazing. Accurate fit. When you see them in person at first it will look different than the pictures shown on amazon. The pictures on amazon don't show the flecks of white all over the shoe intertwined with the vibrant color you see. I wasn't crazy about that at first but I got past it and really appreciate the shoe in its entirety. I bought the shoe in the black current and midinight navy. Will most likely buy another color :)",
      "rating": 5.0,
      "verified": true,
      "author": "TimetoBuy",
      "helpful_votes": 2,
      "publication_date": 20181230
    },
    {
      "title": "Pretty satisfied, but have some issues with size",
      "text": "I like these shoes a lot, but I can’t find a reasonable fit- the 7.5 is slightly big, the 7, slightly tight in the front. I would nevertheless give them five stars were it not for the fact that I’ve had the perfect Under Armour sneaker and it was discontinued: Under Armour Women's UA SpeedForm® Apollo Graphic Running Shoe. I wish they brought this model back.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Romero",
      "helpful_votes": 3,
      "publication_date": 20180103
    },
    {
      "title": "They are really nice shoes but ppl are right they run small",
      "text": "They are really nice shoes but ppl are right they run small. I got my usual size and I should've ordered a half size up...I would've but the next size up was like 25$ more so I thought maybe they'd strech eventually....the material is really stretchy though so they're not really uncomfortable my toe is just at the very top of the shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica H.",
      "helpful_votes": 5,
      "publication_date": 20180301
    },
    {
      "title": "Comfortable.",
      "text": "Normally size 11 but went with a 12. Glad I did. These run small. Snug fit. Elastic band inside of the shoe that connects the sole to the top of the shoe so the don't slide. Light weight, firm sole, flexible shoe, and mesh like material.",
      "rating": 5.0,
      "verified": true,
      "author": "Joeleen",
      "helpful_votes": 5,
      "publication_date": 20180212
    },
    {
      "title": "One of the most comfortable running shoes",
      "text": "One of the most comfortable running shoes! I have plantar faciatis and have to be picky about the shoes I put on my feet. These feel like walking on pillows and yet supportive enough for my arch. I use them for just casual walking or when I go running and my feet are never sore afterwards unlike other sneakers",
      "rating": 5.0,
      "verified": true,
      "author": "hide",
      "helpful_votes": 2,
      "publication_date": 20180630
    },
    {
      "title": "THESE ARE MY 2ND PAIR OF U/A SNEAKERS-THEY ARE FANTASTIC-LIGHT AND GREAT SUPPORT FOR THOSE WHO ROLL WHEN THEY WALK OR ...",
      "text": "I USUALLY WEAR ASIC BECAUSE OF THE STABILITY AROUND THE ANKLES. THESE ARE MY 2ND PAIR OF U/A SNEAKERS-THEY ARE FANTASTIC-LIGHT AND GREAT SUPPORT FOR THOSE WHO ROLL WHEN THEY WALK OR RUN. GREAT BUY!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 5,
      "publication_date": 20170828
    },
    {
      "title": "Stylish and Super Comfortable",
      "text": "Best tennis shoes I’ve ever purchased! These shoes are lightweight, well made and sharp looking. If u do a lot of walking or go to the gym, don’t hesitate in buying these.",
      "rating": 5.0,
      "verified": true,
      "author": "CutEpie",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Sadly runs small",
      "text": "I absolutely love, love, love this shoe!!! I would give it 5 stars except it runs 1/2 size too small. Dark navy is perfect! Light blue soles perfect! Lightweight perfect! I have always been a perfect 9 in all my shoes. Had to return for a 9 1/2.",
      "rating": 4.0,
      "verified": true,
      "author": "hngio",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "these are not only too small but are just for show",
      "text": "these are not only too small but are just for show. If you are looking for a real walking or running shoe that's actually functional, I would not recommend these at all. If you want to wear with casual outfit, these are great. But I need better made materials and shoes than this. I was disappointed based off of other reviews.",
      "rating": 2.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Love them.",
      "text": "Love them... so comfortable. And great for a nurse who’s on their feet all day. The white is ok for Dr. office setting. Probably not an ER love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Four Stars",
      "text": "Cute shoes but run a little small Should have bought half size bigger",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 2,
      "publication_date": 20171106
    },
    {
      "title": "Tight fit",
      "text": "Love the sneakers and take a size 10 in most shoes. These fit somewhat tight. If you’re ordering your regular size, I suggest you get them a half size or size bigger than normal.",
      "rating": 4.0,
      "verified": true,
      "author": "Country1",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Awesome shoes for those with plantar fasciitis",
      "text": "I absolutely love these shoes. They fit perfectly, are great to work out in, and effectively help to relieve the plantar fasciitis in my left foot. They do exactly what I need them to!",
      "rating": 5.0,
      "verified": true,
      "author": "K. BARKER",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "My new favorite shoes",
      "text": "I’ve always been impressed with Under Armour shoes, but I think these are my favorite so far. They’re form fitting yet not tight. They have ample cushion for running or just every day use. I love them! Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms Morgan",
      "helpful_votes": 2,
      "publication_date": 20180206
    },
    {
      "title": "Treat yourself and buy a pair.",
      "text": "I love them. I didn’t realize the bottom is baby blue. So comfortable!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara W.",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Very comfortable!",
      "text": "These shoes are lightweight and very comfortable. The support is great. Since wearing them, my back has felt better.",
      "rating": 5.0,
      "verified": true,
      "author": "Vic",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Pretty color, comfortable and flexible but run a bit ...",
      "text": "Pretty color, comfortable and flexible but run a bit small! All my UA are my true size Not this one, fit a little bit snug, but because of the flexibility and material I’ll be able to wear them!",
      "rating": 4.0,
      "verified": true,
      "author": "LISSY",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Great shoes",
      "text": "This is my first purchase of Under Armour shoes. I love them! I have had to wear inserts the past couple of years due to a bad back and with these I don’t even need them.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Haddock",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Perfect shoe",
      "text": "Love these shoes. I am a size 9 in Nikes but ordered a 9.5 on these after reading some reviews. It fits perfectly. A size 9 would've been too small. So if you want to order these shoes, order a size larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Koster",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Look great, small toebox",
      "text": "I had tried this sneaker in a smaller size and thought the larger size would have a more generous toebox , but it was still uncomfortable for my foot shape. Great looking sneakers, but I have to return them.",
      "rating": 3.0,
      "verified": true,
      "author": "Fussygirl",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Wife loves them",
      "text": "Bought theses for my wife and she loves them. The color is such a subtle purple so it's not tooo \"flashy\". Comfort is amazing, one of her favorite sneakers.",
      "rating": 5.0,
      "verified": true,
      "author": "kasie",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Five Stars",
      "text": "BEST SHOES EVER!! LOVE UA GYM SHOES!!! SO SO COMFORTABLE!",
      "rating": 5.0,
      "verified": true,
      "author": "HLK23",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "Nice shoes!",
      "text": "These shoes are light weight, true to size and just what I wanted. Would order again!",
      "rating": 5.0,
      "verified": true,
      "author": "AKR,Bella2",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "These are comfortable although they feel like they need to be broken ...",
      "text": "These are comfortable although they feel like they need to be broken in a little bit, I order my usual size and they are a little tight so there's no room for insoles inserts. Hopefully they'll be more comfortable after i wear them for a days.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Good shoe",
      "text": "Loved the color! The heel area scrunches down and stays whenever I put my foot in. That part of the shoe is stuck That way as much as I try to flatten it out. But other than that it’s a nice shoe!",
      "rating": 4.0,
      "verified": true,
      "author": "Kellsey F",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Fit nice",
      "text": "Product arrived early which was a nice surprise. Very comfortable. I normally wear a size 10 so after reading other reviews that’s the size I ordered. They fit nice, the sneaker is a form fit so if you don’t like it then order a half size up.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonia",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Lightning speed",
      "text": "I bought these shoes for my wife and she loves them. She is very picky on shoes and is not disappointed at all with these. And they make her run really fast like when you were 4 years old with new shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Prater",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "... a half size up based on previous reviews and glad I did",
      "text": "I ordered a half size up based on previous reviews and glad I did. The shoe is snug fitting but comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda B.",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Stylish shoes",
      "text": "They are a little smaller than expected, they are a good length just a little snug. I am usually a 7 in Nikes. I love the way the shoes look they are very stylish!",
      "rating": 4.0,
      "verified": true,
      "author": "Pat S.",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Super comfy!",
      "text": "Got the white ones first but had my eye on the maroon/ magenta ones too! Love these shoes! The white ones run slightly larger than the maroon but I think it is due to the different laces. I’m tempted to get a third pair in another color.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Four Stars",
      "text": "Very comfortable; however, the color was not what I was expecting ... more purple than burgundy.",
      "rating": 4.0,
      "verified": true,
      "author": "Bobbie E.",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Go a size up",
      "text": "Usually I am a 5.5 or a 6. I got a 6 but they barely fit. I think all the cushion makes it a tight fit.",
      "rating": 3.0,
      "verified": true,
      "author": "Jsimons",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Great shoe!",
      "text": "This is the best shoe I've had in a long time. Very supportive for HIIT workouts and breathable. Absorbs shock. Doesn't have the memory foam insole.",
      "rating": 5.0,
      "verified": true,
      "author": "sherry leeks",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "So comfy!",
      "text": "I am in love with these shoes! They are so comfortable! Will definitely buy more!",
      "rating": 5.0,
      "verified": true,
      "author": "Shauntel",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Five Stars",
      "text": "LOVE THESE SHOES, THEY FIT GREAT AND ARE SUPER LIGHTWEIGHT. SOMETIMES I FORGET I'M EVEN WEARING SHOES.",
      "rating": 5.0,
      "verified": true,
      "author": "Myrts",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Five Stars",
      "text": "My favorite shoes so far. Very comfortable and I walk 4 miles a day.",
      "rating": 5.0,
      "verified": true,
      "author": "Scudstud",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Great shoe for the",
      "text": "Get an extra 1/2 inch. I got a size 9 and could have used a 9 and 1/2. Great shoe for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Louella E",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Mislabeled",
      "text": "The size was mislabeled . The USA size was 9 which should be 42.5 euro .. it listed USA 9 and euro 40.5 . I was wondering why they were killing my feet .. there goes a wasted 100 $",
      "rating": 2.0,
      "verified": true,
      "author": "Ian G.",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Five Stars",
      "text": "I bought these for my mom and she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcella Mack",
      "helpful_votes": 2,
      "publication_date": 20170422
    },
    {
      "title": "Poor Quality Contril",
      "text": "I ordered Women’s size 10. Men’s 10 were in box. I sent back. Was told hold up for refund is due to shoes in box don’t match what’s it says on box. NOT happy!",
      "rating": 1.0,
      "verified": true,
      "author": "Karen21001",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Run a whole size too small.",
      "text": "I swapped these twice and they are still too tight.",
      "rating": 3.0,
      "verified": true,
      "author": "Glenn Ferron",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Five Stars",
      "text": "Love, Love, Love these shoes, so comfortable. My toes have room to breath. I would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Three Stars",
      "text": "Good price but they hurt my feet and gave me blisters at first.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrea Endicott",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Five Stars",
      "text": "Love these shoes wish they would continue to make them more colors baby blue,sky blue,red, very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Skervin",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Not true to size",
      "text": "I would send them back if I hadn't already wire them. They are tight across the toe and run small",
      "rating": 2.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Expectation not met for this brand name.",
      "text": "Poor gluing and heal support on one shoe was crumpled and makes them uncomfortable to wear.",
      "rating": 1.0,
      "verified": true,
      "author": "john flesness",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Very comfortable but runs small",
      "text": "I love Under Armour shoes, but for some reason, this particular design runs small.",
      "rating": 3.0,
      "verified": true,
      "author": "Judy Martinez",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Ok",
      "text": "So I love the style of the shoe. I wore around the house for a couple of hours to see if they were a keeper. I am extremely picky. I wear no show socks and after about 30 minutes it started rubbing on my ankle. They also kind of lack cushion in my eyes compared to another that I have. I had to return.",
      "rating": 4.0,
      "verified": true,
      "author": "Nurse1112",
      "helpful_votes": 4,
      "publication_date": 20170507
    },
    {
      "title": "Five Stars",
      "text": "These shoes are great! Fit as expected, look is great, and they are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal B.",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Four Stars",
      "text": "To be a light weight school they have good support.",
      "rating": 4.0,
      "verified": true,
      "author": "Louisa Johnson",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Fit, soft, and comfortable.",
      "text": "The shoes fit me perfectly. Soft and comfortable. I plan to begin my running plan this weekend:)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Squeaky!!!  Noisy!",
      "text": "Squeaky Shoes. Noisy with every step. Size is somewhat smaller than expected.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Best tennis shoes for the price",
      "text": "I work 12 hours shifts at a hospital and these shoes are fantastic. Great support",
      "rating": 5.0,
      "verified": true,
      "author": "Marion D. Nesbitt",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Another good shoe",
      "text": "I do like this shoe, only gave it 4 star because i can always use more arch support.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170325
    },
    {
      "title": "SUPER COMFORTABLE",
      "text": "These are the best athletic shoes I have bought in a while. Super comfortable. Wish I could get every color at the same great price I would get them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Ava Paul",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Comfortable, flexible, good support, stylish shoe!",
      "text": "Super comfy shoes. They take the shape of your foot. Upper material fits somewhat \"sock-like\" but plenty of support on sides and bottom. Have become favorite everyday tennis shoes. Be careful buying lighter colors because material does collect dirt. I wear 8.5 in Nike but Size 9 in this UA shoe. Wonderful shoes and buy!",
      "rating": 5.0,
      "verified": true,
      "author": "TexasGirlsRock",
      "helpful_votes": 0,
      "publication_date": 20190207
    }
  ],
  "product_meta": {
    "title": "Under Armour Women's Threadborne Slingflex",
    "description": "Threadborne upper for a breathable, compression-like fit that delivers lightweight directional strength .Knit construction features woven in Dyneema, the world's strongest fiber, for the ultimate in durable flexibility .Internal heel counter built with soft padding to provide lightweight protection & structure .Padded mesh tongue attached to the footbed by stretchable support wings to increase support & maintain a snug fit throughout the foot .Removable, molded Micro G sockliner takes the shape of your foot, offering great cushioning & fit .Two-piece Charged Cushioning system pairs a soft, plush layer of foam on top of a layer of dense, harder foam for the ultimate blend of support & comfort .Solid rubber outsole covers high impact zones for greater durability with less weight .Offset: 10 mm .Weight: 8.1 oz. .",
    "rating": 4.4,
    "feature_bullets": [
      "100% Textile",
      "Imported",
      "Rubber sole",
      "NEUTRAL: For runners who need a balance of flexibility & cushioning",
      "Threadborne upper for a breathable, compression like fit that delivers lightweight directional strength",
      "Knit construction features woven in Dyneema, the world's strongest fiber, for the ultimate in durable flexibility",
      "Internal heel counter built with soft padding to provide lightweight protection & structure",
      "Padded mesh tongue attached to the footbed by stretchable support wings to increas"
    ],
    "categories": [
      "Athletic",
      "Women",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Running",
      "Road Running"
    ],
    "price": 85.0,
    "specifications": {}
  }
}