{
  "website_summaries": [
    {
      "verdict": "Made specifically for chinchillas, this spacious exercise wheel delivers superior safety and unrivaled durability.",
      "pros": [
        "Metal and wood construction is sturdy enough to handle years of use",
        "Generous size allows chinchillas to spread out and maintain a natural range of motion",
        "Open sides reduce the risk of overheating",
        "Dual ball bearings make for smooth and silent operation",
        "Easy to install"
      ],
      "cons": [
        "Expensive",
        "Its heavy and the extra weight can cause lightweight cages to shake and rattle"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "If you love your chinch, get this wheel!!!",
      "text": "I was hesitant to get this wheel both for the price and for the fact that this is the 4th wheel I've tried in the past 2 years. Before I had a 12\" wheel when my chinchilla was smaller, and once he was full grown I could tell he was having a harder time using his wheel. He used to just hop, now he can actually RUN in this 15\" wheel. Never again will he have to use such a small wheel. Heres a pic to show size comparison to him. Long rambling short: GET THIS WHEEL.",
      "rating": 5.0,
      "verified": true,
      "author": "Apricat",
      "helpful_votes": 18,
      "publication_date": 20170809
    },
    {
      "title": "The best thing you will ever buy your chin!",
      "text": "The only wheel you need for your chinchilla! We held off and tried other wheels since this one was pricey. Pet store wheels were too small for our chin and she couldn't really run/hop in them. They were also super noisy and I'd find myself taking them down at night to get sleep! The chin spin looks great and my chinchilla can actually run naturally. It took her a day but now she loves it and we can barely here it! The only thing I hear is the sound of her feet hitting the metal and I have to listen closely. Makes me feel so much better when I have days where she can't get out of her cage!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20160926
    },
    {
      "title": "Heaven sent!",
      "text": "This wheel is the best! It is larger than the all metal one I had but oh my goodness it is awesome! My old wheel (not a chin spin) was so noisy and actually breaking the side of my critter nation cage.. any by noisy I mean when the chinchilla jumped off it was so loud it actually was quite jarring if you were standing near the cage....anyhow, this one is so quite that all I can hear is my chins tiny feet on the metal..saved me from some serious headaches! This chin spin although heavier seems to be better supported by the braces so it's not tearing up my cage...so all in all this thing is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany c",
      "helpful_votes": 8,
      "publication_date": 20170813
    },
    {
      "title": "Stop. Buy this wheel.",
      "text": "Don't even bother with the plastic wheels you'll find at Petco and the like, this is the only wheel your chin will ever need. It's sturdy, it's huge, and surprisingly, it's almost silent. My chin used to run on her plastic \"silent spinner\" wheel, and it would bang against the side of the cage and make a ton of noise. This thing mounts with a big X bracket, and no matter how hard she's running, all I hear is the sound of her little feet on the metal. She absolutely loves this thing, it gives her plenty of room to run as fast as she wants, and it's actually become her favorite spot to just hang out.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 10,
      "publication_date": 20170413
    },
    {
      "title": "Must have for chinchillas",
      "text": "The chins love this wheel so much. Thank you for making a nice chinchilla wheel that is of good quality, durable and safe. Best one we have found on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Willis",
      "helpful_votes": 15,
      "publication_date": 20170215
    },
    {
      "title": "Incredible, worth every penny. My chinchilla is living her best life now.",
      "text": "Omg this wheel just made my chins whole life. I rescued her from the animal shelter last week and today she got her new wheel. She has not stopped running on it. She takes a break and keeps going back. She loves it!!!!! I can not say enough about this wheel. To be honest I thought it was bit pricey for a chinchilla wheel but after seeing the quality and construction I was blown away. It's worth every penny. It's super sturdy, quiet and more important safe for the chin. I highly recommend this for anyone who wants a happy chinchilla. Thank you for making such a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "MissCali",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Amazing wheel..BUT....",
      "text": "As I DO think this is one of the best top 2 wheels on the market, sadly..it falls short in two areas for us. 1. Definitely NOT silent on our critter nation. 2. Our Chin runs so fast that she flies off of it and slams into the sides of the cage or VIOLENTLY lands on her back. Unfortunately..this was a waste of money for us. :(",
      "rating": 2.0,
      "verified": true,
      "author": "Goddess Shakespeare",
      "helpful_votes": 2,
      "publication_date": 20190422
    },
    {
      "title": "Best wheels on the market",
      "text": "These are by far the best wheels on the market, Yes they cost an arm and maybe a leg but they are 100% worth it. we have about 6 go the, now, one is nearly 5 years old and I still haven't had to change the bearing. Now, We did try to buy a little bit cheaper, aluminum wheel that's on the market, but it ended up being loud and had a poor design, ended up just buying another one of these here Chin Spin wheels. Their cages are the same story, Just buy them, Top notch, consistent quality and they really make other options feel cheap and full of hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "The best American Made silent wheel.",
      "text": "Great quality. Made in America. Chinchillas love these. They are completely quiet. He never uses the plastic one, while supervised outside his cage, at playtime. He watched me put it in his cage, and was extra excited about it. He never gets tired of his new wheel. I feel great since there is no more plastic wheel in his cage. It is very sturdy on a Critter Nation cage. It was quick to put in the cage. I was being rushed by my chinchilla. It will last a long time. It is large, but there is still plenty of room in the cage, and it would be easy to cleen. It is well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Not Public",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "High quality and super quiet! Worth the price for a good sleep!",
      "text": "This wheel is the best! It's so quiet, I can finally sleep! I bought this for my hedgehog. If anyone is wondering, a hedgehog is big enough to turn this wheel. All I can hear is his little footsteps, he loves it! Due to the shape of the cage, I had to add a couple more washers as spacers on the bottom wheel connections to make sure the wheel didn't rub against the side of the cage on the bottom when the hedgehog is in there weighing it down. Any other reviewers who are saying the wheel isn't quiet, try adding additional washers to space the bottom of the wheel farther from the cage.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 2,
      "publication_date": 20180320
    },
    {
      "title": "Not only Large but Extremely Heavy!!",
      "text": "Buyer Be Warned... The wheel seems too heavy for my chin to enjoy, but he does use it- unfortunately it was so heavy that his running caused the entire back wall of his cage to break where it was sodered... I now have to purchase a brand new cage. But the wheel will not be installed again.",
      "rating": 3.0,
      "verified": true,
      "author": "Christine L. Loh",
      "helpful_votes": 3,
      "publication_date": 20180723
    },
    {
      "title": "Promotes Health and Entertainment for your Chins!",
      "text": "the best by far. I had two others wheels that my chinchillas chewed through or had no interest in using. The minute the chin spin was installed in their cage, the BOTH (I emphasis this because one never had any interest whatsoever) were fighting for it and they still do. I might have to buy a second. I'm so happy to see them get some entertainment and exercise. This is thing is solid and quiet (outside of them going so fast they move the cage a bit). I've even noticed healthier poo pellets in the couple weeks after (no change in food). I definitely recommend not just for entertainment but for their health.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynnette Camacho",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "The perfect size",
      "text": "I thought this wheel might be too big and it almost was for the cage, but it was the perfect size for our chinchilla. She was trying to get in it while I was installing it she was so excited. The chinchilla loves to really get going so she looks like she is flying.",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Unsafe cuts Chinchillas paws",
      "text": "Stay away from this company and all their products. I’ve had order fulfillment issues earlier this year when I ordered from them direct and now this. I never thought that my Chins paws would get cut from running on this. Apparently theres metal that’s not smooth inside the wheel. Keep yours chins safe and do not order!!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "angrypirate",
      "helpful_votes": 2,
      "publication_date": 20200901
    },
    {
      "title": "Excellent quality and good size match for an adult chin",
      "text": "Construction quality is exceptional. Good balance, bearing working well (3 weeks of use so far). With time, noted deformation of metal edge (not a perfect circle anymore but rather an ellipsoid) which creates some vibration. Could it be from chin sitting in the wheel for prolonged time? The deformation does not add a lot to noise but it definitely increased. Overall, the chin loves it and excercises a lot, became less aggressive and sleeps better. Perhaps a bit overpriced but that's uncommon for handmade items.",
      "rating": 5.0,
      "verified": true,
      "author": "Artem",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Just buy it already!",
      "text": "Throw away those cheap plastic wheels and INVEST in one of these bad boys. This is a game changer. I have two chinchillas and my female use to love the plastic one but I never seen my Male get on to run. Today I put this in and he has been running non stop for 30 minutes lol. Its HUGE and slightly heavy but durable. I'm very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashlynn",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Smooth, very quiet.  Great quality!!",
      "text": "We have 2 chinchillas and it took the first one a few days to try the wheel and a couple weeks for the second one to try. But both are loving the wheel now! Super smooth and quiet. This wheel can get going really fast so the chinchillas took a bit to figure out how fast they could go. We have our cage on a stand so put some rubber carpet padding underneath to keep the cage from rattling while they used the wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "katwittmer",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Worth the price for the safety",
      "text": "We got the 15” - whoa is it big! - but it’s perfect for our Buster! He had zero issues figuring out how to use it, and it’s a major part of his nighttime cage parties! It’s quiet and most importantly safe. The woman who we got our chin from told us a horror story about one of her rescue chin’s breaking his leg in a cheap plastic wheel not made for chinchillas. It’s a bit pricey, but considering the 20-year lifespan of a chin, it’s a sound and worthwhile investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronda Dorsey",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Great Quality",
      "text": "I got this for my two young chinchillas (3 months old). I haven’t put it in their cage yet bc I was told to wait until they turn 5 months, but the quality is great and I love that it came with an extra bearing. I got the teal color and it is so pretty!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Best wheel",
      "text": "He loves his wheel! He can run so fast it almost need brakes. He runs and runs the stops and sometimes he stops so fast that he falls out of the wheel. He loves the wheel very much. The wheel is sturdy and quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Selina",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "This is the best wheel ever",
      "text": "This is the best wheel ever. My chinchilla can really stretch out when running. Its construction is excellent. Very quiet in comparison to the average wheel you get at a pet store",
      "rating": 5.0,
      "verified": true,
      "author": "D Gradeless",
      "helpful_votes": 10,
      "publication_date": 20160809
    },
    {
      "title": "My chin absolutely loves this!",
      "text": "So quiet it is incredible! Super well made. Because of the way my cage is made I had to mount this on the wooden dividing wall. It's perfect and well worth every penny! Thanks for the fast safe shipping too! ❤️❤️❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Pattie R. Deville",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "The wheel is built very well and is incredibly quiet ...",
      "text": "The wheel is built very well and is incredibly quiet. I purchased this for my 10 year old chinchilla, however, she doesn't know how to \"make it work\" since she's so use to her smaller wire based wheel. Just from my personal experience be wary of introducing new wheels for older animals.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Make the investment",
      "text": "I'd been thinking about getting this for awhile. Initially I was hesitant because of the cost, but as my chinchilla got bigger I found the 12 inch wheels didn't give him enough room to stretch out. This wheel gives him the size he needs and the durability I want. This will be the last wheel I own, and worse case scenario is I replace the axle. Oh yeah, you can replace the axle too. Do yourself a favor and get this sooner rather than later.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl Scott",
      "helpful_votes": 4,
      "publication_date": 20161104
    },
    {
      "title": "Great product",
      "text": "My chin figured it out pretty quick and he loves it. It's a great way for him to burn energy and get exercise. He looked awkward running on it at first and it his cage started shaking a lot. This is because the wheel would get moving too fast for him, but I adjusted the resistance by tightening the nut on the inside and now he has a nice rhythm down and its pretty quiet. It seems to be good quality and being able to adjust how fast he can run as he grows bigger is a huge plus",
      "rating": 5.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Quiet wheel",
      "text": "I honestly don't understand why some of the reviews were complaining about the noise. When my chins are running on it, the wheel rotates very smoothly with almost no noise. Nice quality and durable too!",
      "rating": 5.0,
      "verified": true,
      "author": "czx85",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Awesome!  Worth the money!",
      "text": "Works great for my chinchilla. He runs on this one all the time with no difficulties......not like the store bought ones we tried that he always had troubles with. This one is the perfect size for a chinchilla.",
      "rating": 5.0,
      "verified": true,
      "author": "FreedomLifeSolutions2016",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "The Chin Spin is the best toy for any floof.",
      "text": "It should be a crime to get your chinchilla anything other than the Chin Spin. When I originally purchased it, I thought my chins might not know how to use it, or may hurt themselves trying. After setting it up (took just a few minutes), I went to the bathroom. Heard them zooming on it already. The chins run on this thing endlessly and have a blast doing so. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah",
      "helpful_votes": 2,
      "publication_date": 20180505
    },
    {
      "title": "Perfect",
      "text": "Such a greatly crafted wheel! My chinchilla uses this wheel every single day and it doesn’t make any noises, no squeaks or anything from the wheel. The only noise is that chinchilla runs super fast and shakes the whole cage. I’d definitely recommend this to anyone with a chinchilla. It’s the perfect size and fits like a glove in the critter nation cage.",
      "rating": 5.0,
      "verified": true,
      "author": "Mwimi",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Not Silent",
      "text": "Very noisy. I only paid so much because they say it’s silent. My chinchilla was able to chew on the metal and scratch off paint. Doesn’t seem safe. Very HEAVY. It’s actually more annoying than you think especially when you have to move it on install it. Especially because it’s noisy I can’t keep it in at night.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Perfect Product but...",
      "text": "This is the Cadillac Escalade of small animal wheels, hands down. My problem with this is that it carrries too much inertia for a chinchilla. I see my chinchilla try to slow down and goes for a loop and thrown into side of cage all of the time. Bilbo is a champ but I still rattled him when it happens. Other than that, Bilbo probably runs a further distance in one night than I walk in a day 😂",
      "rating": 4.0,
      "verified": true,
      "author": "Product Designer",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "-) We've made our little chin very happy: -)",
      "text": "Our chinchilla, Gracie, LOVES this thing:-) It took her 2 to 3 weeks to figure out how to use it, but now she absolutely loves it. She runs on it over and over at night, then sleeps next to it during the day. If she gets frightened, she jumps on it and waits to see if she needs to run away from whatever startled her. Also since we got this wheel, Gracie doesn't repetitively chew and shake her cage bars. I think she gets all the exercise she needs by running:-) We've made our little chin very happy:-)",
      "rating": 5.0,
      "verified": true,
      "author": "Marie E. Cassel",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Do it! Just buy it!",
      "text": "This has to be the best investment ever! Honestly here's what's up. I bought two of those plastic ones that are so squeaky and annoying that I'm glad they broke it or basically at through it. This one is so quiet and although it took them a couple weeks to warm up to it, they are now addicted. I always see them running on it. Barely any noise. Just the sound of their feet hitting the wheel. Highly recommend! Don't spend your money on the other crap.",
      "rating": 5.0,
      "verified": true,
      "author": "MARYAM",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Very happy with this wheel!",
      "text": "Love this wheel for the chinchillas! Great communication from seller and fast shipping! I even ordered a second one!",
      "rating": 5.0,
      "verified": true,
      "author": "A L",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Best chinchilla wheel ever",
      "text": "I’ve owned all types of wheels and they are so loud, squeak, and always break. This is the absolute best wheel ever. It is so worth the extra money. It’s bigger than the standard chinchilla wheel, but it’s perfect for my pets!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "and a very nice size! They no longer fall off when they're ...",
      "text": "The price almost scared me off, but it is worth every penny! I don't think my chins have stopped running on it since I installed it 24 hours ago! Completely quiet, and a very nice size! They no longer fall off when they're running. I wish I could find other things for their cage that they like this much! Takes up a lot of room, but by far their favorite thing!",
      "rating": 5.0,
      "verified": true,
      "author": "Juliet Messmer",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Quiet as it promises",
      "text": "I bought this for my son. He had reviewed and decided it was worth a try. His Chinchilla has been through several wheels. It is very sturdy, took on a few minutes to install. The Chinchilla used it almost immediately and my son was pleased with lack of noise. I will say this is heavy, so think about that when purchasing, will your cage support it.",
      "rating": 5.0,
      "verified": true,
      "author": "Val",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Nice wheel, NOT silent!",
      "text": "Arrived well packed, but bent. We straightened it out, though were a bit annoyed that it was packed and shipped out in less than perfect condition at this price. Absolutely NOT silent, even tried to replace the bearings, still makes a high pitched squeal. Raichu the chinchilla enjoys it, at least!",
      "rating": 3.0,
      "verified": true,
      "author": "Xera",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "My chinchillas seem to enjoy running on the wheel",
      "text": "My chinchillas seem to enjoy running on the wheel. I was afraid they wouldn’t know what to do but I saw them using it 2 days after I installed it. The construction of the wheel appear to be sturdy and it was easy to install. I was also pleasantly surprised it was quiet. I tried the cheap ones and my chinchillas would not use them. I wish the price was under $100 but you pay for quality. It is a big wheel so does take up a bit of space. All in all I would buy more for my other chinchilla cages.",
      "rating": 4.0,
      "verified": true,
      "author": "Lu Ho",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Great quality!",
      "text": "The wheel is very well made. It is heavy because it’s made of high quality materials so I wouldn’t recommend it for use in a flimsy cage. My chinchilla takes time to adjust to new things, and hasn’t tried to run in it since we installed it last night, so I cannot comment on the wheel’s functionality yet. But so far I am happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn G.",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Tried the 15\" plastic wheels for our chinchilla .  This is far superior",
      "text": "We have a chinchilla and have gone through numerous plastic 15\" wheels as they are too small for our chinchilla and will break after about 4-5 months. So we decided to plop some money down on this wheel and our chinchilla couldn't be happier. Firstly very solid construction. Also extremely quiet. Our chinchilla can run easily at full speed now without have to bend over backwards. Don't waste your money on those cheap plastic wheels. Just buy a wheel like this that will last a chinchillas lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "James R Johnson",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "A silent wheel? Yes.",
      "text": "If you're looking for a wheel that is 100% quiet, this is it. It spins smooth and my chin can run all day/night long and doesn't bother anyone. I had to double check that he was actually using it, it's so quiet. Definitely worth the price and wait time!",
      "rating": 5.0,
      "verified": true,
      "author": "Gideon Lee",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Wow!  Well Built and Worth Every penny!!",
      "text": "First, WOW. I'm impressed. This is very sturdy and well built. I'm getting my chinchilla cage ready for my baby chins I'm getting in a month. I can already tell this will last and they will get lots of use and fun out of this. It is huge and will accommodate the biggest chin out there I imagine. It was easy to set up in my Chin cage, although I had to put it in from the top as it would not fit through the cage front door. A little pricey but worth every penny. I would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A.G.",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Best wheel for your Chin!",
      "text": "I can't say enough good things about this wheel. Its large but perfect for my crazy Chin who took to it immediately. The fact that he has enough room to run vs hop while keeping his back straight was worth every penny. This wheel is very well made and very quiet. I love that extra bearings were included as well. You will not be disappointed with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "jceder",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great wheel and worth every penny. A must have for your chins!",
      "text": "Purchased two months ago. Still in great shape and our chinchilla loves it. We were worried that it wouldn't fasten well to our cage since the gaps are kind of large, but it is fine and very sturdy! The wheel is well made and of high quality.. we are very satisfied! And thank you for the dust!",
      "rating": 5.0,
      "verified": true,
      "author": "tree give oxygen",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Excellent Wheel. Worth it.",
      "text": "Holy cow this thing is huge! ...And that's not a bad thing. The pictures don't do it justice, and you really see how big it is once it's in the cage. It's sturdy, expertly crafted, and 100% silent. Worth every penny, especially when you know you're going to have it for a long, long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Em Bee",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Don't buy any other wheel for your pets!",
      "text": "So much bigger than I thought! It's very strong and sturdy. My chinchillas never had a wheel in their whole life, so they're sort of sniffing it and exploring around the new wheel. At the very end of the night, one managed to figure out how it works and off he goes! This is very good material and will definitely last for a long time! Happy purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristy",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Works Very Well!",
      "text": "I have two of these wheels and they have worked amazingly for my chinchillas. I'm thinking of getting a third one for my two chins who live together and both continuously use it! very quite, great quality. Only wish they were more affordable!",
      "rating": 5.0,
      "verified": true,
      "author": "C Remer",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Would have been great.",
      "text": "Attempted to mount on 4 commercially and widely used cages and had zero success. (Critter Nation, Ferret Nation, Kaytee Double, and Chin Nation. Good build, but ultimately ended up returning due to failing mounts.",
      "rating": 3.0,
      "verified": true,
      "author": "Bruce The Goose",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Totally worth it.",
      "text": "I had a full metal wheel previously that I had purchased because it was cheaper than the Chin Spin. Guys. The Chin Spin is SO worth the money! It's basically silent, and my chinnys love running in it so much more than their last one. I love that I can have the chins in the same room as me while I sleep and it doesn't wake me up at all in the night! And my girls love to run ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Cate",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Great Buy!!!",
      "text": "This thing is massive!!! My 2 y/o Chinchilla absolutely loves it though! It’s very sturdy, has never gotten loose, & is super quiet! The only noise I hear when he runs is the cage moving from him running so fast. Definitely a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren R. Crider",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Just do it! Well worth investment",
      "text": "Bought this for our chinchilla. Put this off for the longest time because I couldn't see investing that much in a wheel. So after many trial and errors with varies wheels we cracked and bought this one. Wish I would've done it sooner. This thing is huge and it's so quiet he doesn't wake us up anymore running on his wheel. Although we haven't had it for very long we already love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "The best of the best",
      "text": "Really great wheel. Silent as can be. Went thru many different wheels, including the Exotic Nutrition Sprint, Fido & Felix, as well as the cheaper cake pan wheels and an acrylic wheel. Nothing compares in quality to this wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "Flower22",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Great product, fast shipping!",
      "text": "Never bought a wheel this big before but I'm impressed! The product was made very well and the metal is smooth and safe for my chinchilla! He's a heavy chewer and has since made his mark all along the sides, but its quiet and still works like magic!",
      "rating": 5.0,
      "verified": true,
      "author": "Chance Morgan",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "At first my chinchilla was unable to use this.",
      "text": "He’s pretty young and was unsure about using this, and when he’d get on it he wouldn’t last for long - he’d either go flying off or would come to a halt. But after a day and a half he seems to be a natural. When he’s on this he’s very comfortable. I also appreciate that this wheel lacks a center protrusion to help protect his spine!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis Pena",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "My chin Loves nothing..but this wheel",
      "text": "This wheel is study af my chinchilla Cinnamon-Bacon runs on it none stop i believe i purchased this in august and he hasn't stopped running.",
      "rating": 5.0,
      "verified": true,
      "author": "XxPoptart PunkrockxX",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "So perfect I ordered a second one!",
      "text": "I bought one of these for my chinchilla. I ended up getting a second chinchilla and the first thing I did was order him his own wheel. Wow! I was so elated to get the first one, it’s made so nicely with high quality materials. I was a little iffy on the price until I received the product in the mail. I can’t wait to get the second one. If you love your chinchillas get them this wheel!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nina Justice",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Expensive but quieter than the plastic wheels",
      "text": "It is a full 15\", easy to bolt to the side of the cage with the four wing nuts. It is so quite, you don't know when your chin is running on it! Because the metal outer running ring is not perfectly round, it appears to wobble a little, not side to side, but because the running circle is not perfectly round. It is simply too early for me to rate durability and value for the money since we have only had it installed for less than a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Whisper Quiet",
      "text": "Received our chin spun a day earlier than expected and it has been a huge hit with our Dante. He is constantly running on it and we love the whisper quiet motion as he has a habit of running when we our watching movies and with his old wheel he was quite good at drowning out the sound. It’s definitely pricey so o hope it holds up well.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa H",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Worth the Money",
      "text": "Built solidly, attaches securely, spins as fast as the chins can run without making much racket. This is the best version of a wheel you can buy for your chinchilla.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Bertles",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "he loved it. took him a couple of tries to ...",
      "text": "bought for a chinchilla. at first it was to large for his cage so bought a larger cage. after able to put it up for him , he loved it. took him a couple of tries to get used to the size of the wheel but once he did he ran fast, hard and often. it is easy to install, quieter than the plastic one. At first I was worried about the price but it is well worth it. sturdy!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Worth the price",
      "text": "Wow this wheel goes beyond all expectations. The quality is amazing and it’s a very large. I was shocked when my chinchilla jump right in and ran on it. It is quiet also. Though it is a bit on the expensive side, it’s worth every penny. So happy with this.",
      "rating": 5.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "So fun!",
      "text": "My 18 yo chin was getting a little bored, having outlived all his friends. Splurged on this wheel. It was so worth it! He is having fun trying out different ways to play with it, and we love watching him. It was very easy to install and seems well made.",
      "rating": 5.0,
      "verified": true,
      "author": "RR",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Built to last forever!",
      "text": "I purchased for two pet rats and the girls love it! I installed the wheel in a Critter Nation cage and it was a perfect fit. It is large though, so be sure to measure. It is completely silent in use and came with extra bearings. Safe design for the rats with no chance of injury. High quality and made in the USA!!! Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny ",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Best Chinchilla Wheel!!!",
      "text": "This Chin Spin is pricey, but completely worth it! We started our Chinchilla's with the saucer wheel, but they wouldn't run on it. I decided to upgrade to this wheel and our Chinchilla's LOVE it!!! They use it several times a day! It is quiet and sturdy and hasn't caused any strain on the bars of our two-story Critter Nation cage.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Prince",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "The Bentley of Chinchilla Wheels",
      "text": "I'm convinced this is the best chinchilla wheel on the market. It's well-built, sturdy, and, most importantly, SILENT(ish). I know it's expensive, but this wheel will last you a long time and your chinchilla can not only run on it, but also sleep AND poop. It's multi functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Aly",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Worth every penny-",
      "text": "Excellent product- my chinchilla Dusty has broken a saucer, a silent spinner and three homemade wheels- I finally bought the chin spin and was a bit nervous at the price tag. So far it’s worth every penny!! Really durable and so quiet. Plus she loves it and has been running like crazy! I was a little worried she would gnaw on the back but so far so good. I’m very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "saphfire",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Sturdy and wide",
      "text": "I LOVE this product. I was using the plastic flying saucer wheel before that would keep us up at night...in another room! This chinspin is quiet, very sturdy and well worth the money as a first time chinny owner :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Wonderful wheel.",
      "text": "Wonderful wheel! My chinchilla loves it! I'm so happy she has it for days I can't let her out of her cage. I find her playing/exercising on it daily, morning and night. She's much more active, drinking more water and overall healthier! The wheel is made of high quality materials. Very easy to install. Excellent customer support and made in the USA too! I'll always support businesses who are still able to be manufacturing in America! Thank you! To me, the price is worth it for my chinchilla to be happy and healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "This wheel is the best one out there",
      "text": "This wheel is the best one out there. It’s a little big and you may have to re arrange your cage a little bit but it is totally worth it. All I ever hear is the little “pat” of my chinchillas feet hitting the wheel. Wheel came faster than the anticipated ship date as well. Truly a product and service worthy of a five star rating.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Most durable chinchilla spin wheel",
      "text": "We have had issues with past wheels from other vendors not holding up. This wheel is the most durable I have seen. Based on how many wheels we have went through in the past, I am anticipating that this will be a good investment in the long run.",
      "rating": 5.0,
      "verified": true,
      "author": "Toby Barrus",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "NOT PLASTIC",
      "text": "We had been looking for a good sized wheel that was not made out of plastic material. This is very well made and such a great size compared to all the crappy small plastic wheels sold in the pet stores. Our chin loves it. I cannot say enough about the quality of this wheel. Would recommend to any chin owner.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ Moreno",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Absolutely the best Chinchilla wheel",
      "text": "I have tried half a dozen of the common types of Chinchilla wheels, and all of them were flimsy pieces of junk compared to this wheel. I was hesitant about the price, but it has been so worth it! It is large, feels very durable, and it easily attaches VERY securely to the cage so that it doesn't bounce around at all (big issue for all other wheels I've tried).",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Miller",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Quietest wheel I've never heard!",
      "text": "The wheel is so quiet, I never know when my Chinchilla is on it. It was easy to install too. I would recommend it to anybody that has a Chinchilla.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Bauer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Our chins love this wheel!",
      "text": "There aren't a whole lot of chinchilla wheels out there. Some are plastic which is out of the question for our chins, who would chew them up in an afternoon. This wheel is big enough for our chins to use it safely. They all love it. It is well made and very easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Ren",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Chins love it.",
      "text": "I have two chins that we got over the summer. Both 6 years and probably never had a wheel better judging from the cage they had before we got them. I was a bit hesitant buying the chin spin as I wasn't sure if they'd like it or even would use it. It took them two days before they started using and a a week later they're pros. I love and would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Really great wheel!",
      "text": "Was excited to get this wheel cause the previous one I had was making so much noise, I couldn't sleep. This one was silent for the first week & now it's a little loud. I'm trying to figure out a way to silence it. Other then that it's a VERY well made wheel. I love it & so does my chinchilla!",
      "rating": 4.0,
      "verified": true,
      "author": "colleen",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Best Chinchilla Wheel There Is",
      "text": "This is the second Chin Spin I've bought. My first one I've owned for about a year now and my chinchilla loves it. It lets him go as fast as he wants and gives him a lot of room so it doesn't hurt his back. I just bought my second Chin his own chin spin. Not sure there is a better wheel for chins out there. Would always recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "the perfect wheel",
      "text": "absolutely love it! it is almost silent and safe for chinnies! it’s also big enough to not bend their spine and cause injury. it also came with two other bearings for when i want to replace them. best wheel out there for chinchillas!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli Winkler",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Great Wheel!! They love it!!!",
      "text": "The first 10 minutes they were scared of it being in their cage. Now they both wont get off it they love it so much! One tries to go one way and the other tries to go the other way!! Hahah!! I think they will have it mastered in no time! Thank you!! Great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brendon Post",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "He doesn't stop!",
      "text": "Chinichilla goes goes goes!!! He even sleeps on it. He loves this thing! Well worth the money!~",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Best investment EVER!!!",
      "text": "I had been eyeing this wheel for months to get for my chinchillas, the cost is what kept me at bay. Let me tell you, this is SO WORTH the price!!!! My chinchillas LOVE it, and so do I! ZERO noise!!!! Fits perfectly!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Silent, sturdy, good size",
      "text": "Excellent wheel. Silent, smooth, and a good size. My two chinchillas were already running on it as I installed it. Before everything was tightened. I'm excited to receive the other one i ordered for my two other chinchillas.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Excellent chin wheel!",
      "text": "My boys are in love with this wheel! They could run on it all day! It’s very sturdy, looks great, and is a lot quieter than many other wheels!",
      "rating": 5.0,
      "verified": true,
      "author": "Alanna",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Easy to install",
      "text": "Just received the Chin wheel today. Easy to install. Bigger than what I expected. Looks well made no sharp edges. She hopped on it for a minute to see what it was.Will see tonight how she likes it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ruben Sutton",
      "helpful_votes": 2,
      "publication_date": 20170428
    },
    {
      "title": "Cut my chinchilla’s feet",
      "text": "Cut my chinchilla’s feet when he ran. The metal is not flush inside and it kept making my chinchilla bleed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly Chinchilla",
      "helpful_votes": 2,
      "publication_date": 20200115
    },
    {
      "title": "Momo loves it",
      "text": "I have a chinchilla named Momo. He broke his spin wheel that had a plastic base. This one is all metal so I don't have to worry about him breaking it. Also, because it is larger, it accommodates him better. I can tell he loves it because he spins his wheel all night and as long as he is spinning I know he is doing great. I love Momo and he loves his spin wheel, made in the US of A.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Robert",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "15” chin spin",
      "text": "Nice product made in USA! My chin loves it and I love it too bcs it’s SILENT!!!! The only small comment about this product is the weight of the product, its on a heavy side.. my chins cage wires are thin and not really heavy duty...im not sure this chin spin will last on it for long. I have to figure out how to install it not on wires but on the entire frame for stability without braking those brital wires of the cage...",
      "rating": 5.0,
      "verified": true,
      "author": "ARIUNZAYA D.",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "This wheel is amazing! Sturdy",
      "text": "This wheel is amazing! Sturdy, quiet, big enough for a chinchilla's full stride. Our chinchilla Cinder runs constantly, all night long. You can barely hear a thing with this wheel, and I'm not concerned about it falling off as I was with the plastic wheel we had (which was also incredibly noisy). It's easy to put up, too. Cinder actually has a habit of chilling on top of her wheel, and this wheel is great for that! She manages to balance on top and the wheel doesn't shift or move, so she doesn't fall off. And fits very well in her cage! We have Quality's Chinchilla Mansion.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Herrin",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Chinchilla Loves It!",
      "text": "My chinchilla loves this wheel!! I love it because I can't hear him using it :). Very well made & quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Very Quiet",
      "text": "Great quality. Extremely durable, but most importantly it is very quiet. I can only slightly hear it spin at night when my chinchilla runs full speed and the cage isn’t far from the bed. So it is a very faint noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Reome",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Our prairie dogs love it!",
      "text": "Our prairie dogs love it!! They could only walk on their old wheel and now they can actually run! It's a nice size and very sturdy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161008
    },
    {
      "title": "love my wheel",
      "text": "Great Wheel I love it and so does my chinchilla!! Just make sure you have room in your cage. Its perfect for my two story critter nation",
      "rating": 5.0,
      "verified": true,
      "author": "Julzmagulz",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Worth it! Yes!",
      "text": "Worth the $119 ppl! It’s so much quieter than her last wheel. Perfect for chins for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Amazing Wheel! Worth every cent",
      "text": "My Chinchilla LOVES his wheel so much! We sleep in the same room as the chin. There is no squealing of the wheel and easily drowned out with fan. Best wheel ever purchased!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Price is worth every penny!",
      "text": "I love this wheel! I have been on the fence about the price, but after buying 6 cheap ones from the store, I decided to take the plunge and buy this one! Totally worth the money!! And my chinchillas have been going non-stop on their new wheel, they absolutely love it. The noise level is also very minimal, so that's a plus!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Worth the Wait and the Price!",
      "text": "It's the perfect size for my chinchillas, they absolutely love it. Finding a wheel that would attach to their habitat was harder to find than I thought, and this one fits perfectly. This thing is so smooth and quiet, unless I'm watching them run i wouldn't know they were. It may seem a high price, but the quality is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "but it's the best spin/wheel you can find",
      "text": "A bit heavy and not exactly quiet, but it's the best spin/wheel you can find.",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Nice large exercise wheel",
      "text": "Got this for my prairie dogs. They use it every day. Very nice and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "N H",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Well worth the price",
      "text": "Well worth the price. Don’t hesitate to buy this wheel. It is very sturdy and large enough for my full grown chinchilla. It is also very quiet. I can’t even hear when she is on it. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia M. Rossi",
      "helpful_votes": 0,
      "publication_date": 20190317
    }
  ],
  "product_meta": {
    "title": "Quality Cage Crafters 15\" Chin Spin Chinchilla Wheel - Handmade in USA - Quietest Wheel You Will Find - Prairie Dog Wheel - Built to Last",
    "description": "Color:Silver-VeinChinchillas need their exercise but can hurt themselves on standard wire or spoked wheels. This open-wheel design is made with a quality wood backing inserted into a 15\" Diameter sheet metal ring. The ring is coated with a silver vein powder coating which serves as a grip for the chins 6-1/4\" running surface. Easily mounted to most cages with supplied hardware. We recommend the bottom of the wheel is 2\" above the cage floor. It extends 8\" from the wall of the cage. Comes with photo-illustrated installation instructions and an extra set of bearings, for long-term durability. SATISFACTION 100% GUARANTEED - If you don’t absolutely love your 15\" Chin Spin Chinchilla Exercise Wheel or if there are any issues with it at all. We will replace or refund your purchase. Every genuine 15\" Chin Spin comes with a one-year replacement warranty and friendly customer service provided by Quality Cage Crafters, a U.S. manufactured product by a U.S. company. QUALITY CAGE CRAFTERS is not the cheapest chinchilla cages and chinchilla wheels, but it is the best. Quality Cage Crafters - \"Animal Focused, Human Centered\"",
    "rating": 4.8,
    "feature_bullets": [
      "BUILT TO LAST A LIFETIME All metal/wood construction, keeping you chinchilla safe for years to come!",
      "SAFE OPEN WHEEL DESIGN with a wide running surface. Dual ball bearings for long lasting performance.",
      "GREAT VALUE & PEACE OF MIND Mounts to all wire cages. Its BIG so make sure it will fit in your cage!",
      "SATISFACTION GUARANTEED - If you don’t love your Spin, We will replace or refund your purchase.",
      "QUALITY CAGE CRAFTERS is not the cheapest chinchilla cage and chinchilla wheels, but it is the best."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "15 x 7.99 x 15 inches; 8 Pounds",
      "Date First Available": "June 2, 2016",
      "Manufacturer": "Quality Cage Crafters",
      "ASIN": "B01GJ6SDBQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Pet Supplies"
    ],
    "price": 119.99
  }
}