{
  "website_summaries": [
    {
      "verdict": "An incredibly versatile soother that will meet the needs of just about any baby. Unbeatable value for money, especially if you need an option that can run all night.",
      "pros": [
        "Boasts six audio options, including lullabies, white noise, and natural sounds",
        "Can be plugged into an outlet or used with batteries, making it perfect for both at home or travel use",
        "Optional timer can be set for 15, 30, or 60 minutes",
        "Affordable"
      ],
      "cons": [
        "Buttons make a clicking sound when pressed",
        "Some feel the lullaby audio quality is a bit tinny"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Compact and Useful!",
      "text": "After my other sound machine stopped working, I found this on Amazon. Having never heard of the brand, I was skeptical. After reading all the positive reviews, I figured I'd give this a chance. I'm glad I did. It works very well, without all the unnecessary bells and whistles. I love the compact size! It doesn't take up a lot of room, which is a big plus for me. The volume is easily adjusted, and offers a variety of options.",
      "rating": 5.0,
      "verified": true,
      "author": "April S.",
      "helpful_votes": 55,
      "publication_date": 20160930
    },
    {
      "title": "Baby loves this machine",
      "text": "My daughter loves this! The ocean sound puts her to sleep for over 5 hours straight..which is a blessing at 4 months. Volume is great, and its small enough to stick in the corner without taking up much space.",
      "rating": 5.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 22,
      "publication_date": 20161215
    },
    {
      "title": "It is a nice product.",
      "text": "We got this sound machine for my daughter and it works really well. It can be set of a specific amount of time (15, 30 or 60 min.) or continue the soothing sounds until it is turned off. It is a nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan H.",
      "helpful_votes": 32,
      "publication_date": 20170407
    },
    {
      "title": "These are GREAT!",
      "text": "We purchased these for a small mental health clinic - we need sound machines by counseling offices to maintain privacy, and there are no power outlets in the halls so we needed something small and battery-operated. These are GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Shulman",
      "helpful_votes": 11,
      "publication_date": 20170221
    },
    {
      "title": "Runs on both batteries and plugs in PLUS has an \"always on\" option!",
      "text": "This thing is awesome. My granddaughter always slept through the night at my house and when she went home she had a tough time staying down. We finally figured out it was because I have a noise machine. I bought this one for its battery option, portability, and the option to have it stay on instead of turning off after a while. The effect was instantaneous. My granddaughter now goes down at home as easily as she does at my house and stays asleep for the entire night. The battery option lets it move from room to room with the baby so she always has her wonderful white noise.",
      "rating": 5.0,
      "verified": true,
      "author": "The Redhead",
      "helpful_votes": 11,
      "publication_date": 20180211
    },
    {
      "title": "Love the realistic sound and the volume is just right",
      "text": "Love the realistic sound and the volume is just right. I wanted it loud enough to drown out extra noise and it does just that! We love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Juls",
      "helpful_votes": 27,
      "publication_date": 20170314
    },
    {
      "title": "Continuous play!",
      "text": "Love it! It has the option for continuous play which a lot of the other noise machines do not. Product came promptly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20161222
    },
    {
      "title": "The sounds could be better.",
      "text": "I like this sound machine because it can be left on instead of turning off like a majority of products out there. The only thing I don't like about this is the nursery rhyme sounds are too \"chimey\" sounding. It reminds me of those old jewelry boxes and you wind the key and it is all high pitch and chimey. So I have it on the ocean sound but sad that is the only sound that can be used. I use this along with a sleep elephant that has a good lullaby but turns off after 45 min and it projects stars onto the ceiling which my son looks at every time before falling asleep.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 5,
      "publication_date": 20170131
    },
    {
      "title": "Our third one bc it’s that good!",
      "text": "We absolutely love this sound machine, we love it so much, that we have 3 now. One stays plugged in our middle son’s room, one plugged in our room for the baby, and we use one with the battery downstairs for the baby’s naps. I love that it has ocean waves that don’t sound annoying and the fact that it’s small enough to move around when we have the batteries in it. This is probably one of my best baby purchases, save your money on the “fancy” machines, this one does the job much better and you don’t need an app to control it.",
      "rating": 5.0,
      "verified": true,
      "author": "Yasi",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "It’s ok, but buttons are so loud.",
      "text": "I don’t like the fact that the buttons are loud when you press on them; especially, when changing the volume. I’m always afraid it’s goimg to wake my baby up. She does move when I try to adjust the volume or set the timer. I wish the volume was a turn knob and the buttons weren’t so loud. Twice already, the machine turned off on its own, and I didn’t even set the timer. The only useful noise for us is the white noise. My baby doesn’t care for lullabies and other noises. Hopefully, it doesn’t die on us because we turn it on during her naps and all night long until she wakes up in the morning.",
      "rating": 3.0,
      "verified": true,
      "author": "ricegirl",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Bad design there",
      "text": "So the white noise definitely works and puts my baby to sleep, HOWEVER the buttons are so loud! To turn on the machine, to turn the volume up or down, to set a timer, to change from white noise to a lullaby, etc, pushing the button in the quiet of the night makes such a loud noise. Bad design there. Also, if you can't use the wall outlet, expect to go through boxes of batteries weekly.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Good product at a good price",
      "text": "We use this in baby's room to aide with sleeping. It has been used every night on continuous play for almost one year and it is still going strong. We used the heartbeat when babe was little. Now we use the ocean sound as background noise. We sometimes use the lullaby for winding down before sleeping. You can definitely tell when the sounds loop, but that isn't a bother to me or my little guy. I initially bought because it has options for continuous play or timer, multiple sound recordings, and can be used with an ac adapter. It has met all my expectations and is a good product at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 3,
      "publication_date": 20170810
    },
    {
      "title": "Not impressed with sounds",
      "text": "I did not realize I had ordered the \"Baby\" sound machine which has 3 lullabies and 3 sounds. As it is, the lullabies are very tin sounding. The heart beat sounds really doesnt block any outside noise. The only sounds I really like are the white noise and the ocean. Volume control offers a good range. But I'm going to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 3,
      "publication_date": 20171206
    },
    {
      "title": "This is a good basic sound machine for a baby room",
      "text": "This is a good basic sound machine for a baby room. We got it for the white noise setting but I find the static sound sort of stressful, so we use the ocean waves instead. The volume has good variation options and it does really add to a nice calm environment. Not sure that this product is singularly responsible, but since switching into his crib (out of my bed but in the same room) and having this going, baby has slept all night four nights in a row! I actually kind of enjoy the relaxing waves as well - maybe I'll keep it when he gets his own room!",
      "rating": 5.0,
      "verified": true,
      "author": "South Asia Reader",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Does the job",
      "text": "I bought this when my second baby was about a week old to use in the nursery. I like the different sound options. We originally started out using the heartbeat sound but it kept my husband awake at night because he thought it sounded like a horse instead (which it wasn’t as close as our womb sounds bear for the heartbeat sound). Since then I have used the wave and white noise sounds and they both work well for all 3 of us seeing as we hear it through the monitor at night. It is very lightweight and easy to travel with, I take it to visit family too so there is consistency at bed time.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiffany Ash",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Cheap and effective",
      "text": "We are using this for our baby but just traveled and the whole family benefitted from it in the hotel room. There was partying going on in the hallway and not. One of us was disturbed thanks to the white noise. We have put one set of batteries in and use it all night every night and it is still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "ambam",
      "helpful_votes": 4,
      "publication_date": 20170402
    },
    {
      "title": "Would recommend.",
      "text": "This was a gift for my son and daughter-in-law. It replaced a sound machine (different brand) they had. They are very happy with it and like it better than the previous one. One of the big pluses is that it can run continuously and is not limited by a timer. You can also choose to run for a set period. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 4,
      "publication_date": 20170401
    },
    {
      "title": "Buttons are noisy, but machine as a whole works great.",
      "text": "I LOVE that this sound machine has 6 different settings (allthough the white noise and the ocean are pretty similar) and that it can be powered both by a plug-in or bateries. It has multiple volume settings and a timer, both super useful. The only thing I have to complain about is that the buttons are pretty noisy. When being pressed they make a very loud click. I would have preferred some sort of soft button. Besides that, everything works as advertised!",
      "rating": 5.0,
      "verified": true,
      "author": "Miriah",
      "helpful_votes": 2,
      "publication_date": 20180220
    },
    {
      "title": "The ocean sound is the best. Surprisingly good quality for such a small device",
      "text": "Had to go with only 4 stars because the first one I ordered stopped working with the DC plug after the 1st night. I've had the second unit for 2 nights now and it's still working plugged in. The ocean sound is the best. Surprisingly good quality for such a small device. Don't care much for the white noise sound. It's irritating, not soothing. Volume can fill a large room for sure. At $20, you can't beat it even if you only use the ocean setting. The timer is a great feature too and works fine on all settings.",
      "rating": 4.0,
      "verified": true,
      "author": "johnny",
      "helpful_votes": 2,
      "publication_date": 20170209
    },
    {
      "title": "Shuts off randomly now-Buttons are loud but does the job",
      "text": "Update: changing from 4 stars to 2. We've had it for about 3 months and it has started shutting off randomly :( it's plugged in to the wall. I've seen some reviews that also said it stopped working. The buttons are really loud to click. The loop between tracks isn't very smooth. The lullaby sounds like a wind up toy dying. But it looks nice, is light weight and plugs in/battery operates which is what we wanted.",
      "rating": 2.0,
      "verified": true,
      "author": "Jordan Smallwood",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Loudest setting when you turn in/ Loud clicks to turn it down",
      "text": "Easy to use, yes. Low quality sound, but not too big a deal. But why in the world would you produce a product meant to soothe a child to sleep that is on the damn near loudest setting when you turn it on?! And then the loud “click” every time you have to press the button to turn it down....and it takes FIFTY loud clicks to get it to a reasonable volume. This machine has woken my son up more times than it has soothes him to sleep :(",
      "rating": 1.0,
      "verified": true,
      "author": "Heather Hamlin",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Buttons are extremely loud",
      "text": "I think the songs are great. The design flaw with this is when you click to change the song. When you have a baby monitor and you want to change the song to the ocean noise. Yes we can use the timer but we found out once the noise is off our baby wakes up. So when we sleep we would rather hear the ocean other than the songs. So we would sneak in there to change it. The buttons are SO LOUD!!! CLICK!!! Baby wakes up. It needs to be a soft key instead of a click plastic button. Now our baby is a light sleeper but if others have babies like that this isn’t that great just ok",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel Shepherd",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Love it!",
      "text": "Love, love, love this one! We’ve used other sounds machines and this is by far our favorite. It will play sounds as long as it’s on (no 60 minute shut off which was what we didn’t like about some other sound machines). If it’s plugged in to an outlet (which we do), no batteries are required. It’s lightweight and portable for those times when baby will be taking a nap or going to bed somewhere other than home. The real clincher for us was that it was reasonably priced, didn’t have an automatic shut off, and had multiple sounds. I’d buy this a hundred times over.",
      "rating": 5.0,
      "verified": true,
      "author": "GRH",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Worked great, then it stopped working at all",
      "text": "Edited to add: Brian, the owner, made things right for us and provided a full refund without a hassle. He was very quick to respond and help. We loved this machine in our baby's nursery. But I have owned this sound machine for a little over two months and for some reason the AC power adapter stopped working and now it only works using batteries. That wouldn't be a problem if the batteries lasted for more than 3 days. I bought this machine to replace my battery operated machine, so this is much less than ideal.",
      "rating": 2.0,
      "verified": true,
      "author": "Jolene Saks",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Compact yet loud.",
      "text": "Compact but loud. Our only bathroom is directly across from our nursery. Our daughter was waking up non-stop. Now she easily sleeps through the night. She even sleeps through her three year old sister running down the hallway. We mainly use the white house setting but all of the sounds are nice. I wish we would have bought it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170315
    },
    {
      "title": "Great product for the price",
      "text": "Doesn't have the depth of sound that some of th more expensive ones do BUT it does still block noise pretty well, I got 2 for our rather large master bedroom for my husband who works nights and they worked well to keep out the daytime noise while he is sleeping. Will be getting at least one more for the nursery",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel H.",
      "helpful_votes": 2,
      "publication_date": 20170914
    },
    {
      "title": "Needs better sound options",
      "text": "This sound machine is pretty small which is great for travel, small spaces, etc., but the sound selection is not good. There is only one option for white noise. The others are lullabies, a very choppy ocean sound, and heart beat which are not helpful when comforting a baby or blocking out noise. However, the machine is very easy to use because each sound has its own button. If this exact machine had maybe a brown noise, and a fan option it would be unbeatable!",
      "rating": 3.0,
      "verified": true,
      "author": "Leeanna",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "I have bought two now, and would recommend this sound machine",
      "text": "I bought this for my daughter when she was born and she is 18 months old now and we still use it every night. She knows when we turn it on its bedtime and if we forget to turn it on it takes her longer to go to bed. It is still working great after 18 months of use so we bought a second one for our little one on the way. It seems like good value for money and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Great for newborn/toddler sleep",
      "text": "After having our second child, we needed to get another white noise machine. With our first, we were using an app on an old phone, but for this one, we decided to just get a machine that provides continuous noise all night. We love this product. The volume goes pretty loud, which is what I wanted for my newborn. It's compact, lightweight, can be used with 3 AA batteries, and has options for a timer. We love it so much, we ended up buying another one for our toddler as well.",
      "rating": 5.0,
      "verified": true,
      "author": "gkj121",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Great sound machine, can use with plug or batteries!",
      "text": "Great sound machine. I like that it has various sounds and can operate on batteries, which is a huge plus when your power goes out! Only negative is that when you first turn in it, it's really loud and needs to be turned down. I've unplugged and plugged it back in several times and it happened every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lana G.",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Great noise maker for the cost!",
      "text": "We really this noise maker. We have had one for two years it works as good as ever and we travel with it very often! We also just purchased 3 more (one for every room!) The only thing I don’t care for is that the buttons are kind of loud when you press them. They just “click”. But it’s never disturbed any of my kids... just worries me ;)",
      "rating": 4.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great find!!",
      "text": "We have purchased the of these for our kids rooms. It helps them sleep sounder and longer when it's on. I love the different sounds you can switch between and volume levels. The price is great and it's small enough to take with us when we travel. I have purchased again and will continue to if I may need another. It was shipped to us quickly and in great condition.",
      "rating": 5.0,
      "verified": true,
      "author": "bobbiejlewis",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Pretty good sound machine",
      "text": "I've only had this sound machine for about a week, but so far so good. We got it to help our 4 month old sleep a little better and fall back asleep if he wakes up. So far, it seems to be helping with that. The only sound we use is the ocean sound, which is nice and relaxing. The white noise sound is a little too jarring. It feels a little cheaply made but has held up well so far, so hopefully it will last us a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Ceejay_42",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "Very pleased with my purchase",
      "text": "We use a fan for white noise, to drown out the neighbor's dogOoooos. My baby's room would get a little cooler in the winter, so no fan. I got this just to try, inexpensive was my main goal. It was reasonably priced, it's super easy to operate, and the ocean sounds are the least annoying. The lullabye sounds tinny/clinky, and I find it the worst option. I think that's why it's my daughter's favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "T. L. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Great sound machine.",
      "text": "This is a great sound machine. I was happy to find one that doesn’t have a light since my toddler likes things dark. The sound is nice & loud and sounds pretty clear. The only thing I don’t like about this is how loud the buttons are. And usually my toddler turns it on himself and the buttons are a little hard to press for him. Nothing super problematic, but worth mentioning.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey Oldham",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Simple and effective",
      "text": "Good sound machine. We've used it for almost a year at this point with no issue. We have it next to our baby's crib. The only reason for 4 stars: almost all the sound effects drive us crazy except the ocean noise. They become repetitive and very annoying. The ocean sound is not too bad.",
      "rating": 4.0,
      "verified": true,
      "author": "K. O'Meara",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Affordable must have for your baby!",
      "text": "I have both this and the portable monkey baby sound machine. We love them both and so happy we purchased them for our son. He loves the sounds and they definitely seem to soothe and calm him. I love that there is an auto shut off and it gives you the option for different settings.",
      "rating": 5.0,
      "verified": true,
      "author": "ik",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Pretty Decent",
      "text": "Overall, this noise machine is pretty good. It does what it is supposed to and it’s fairly inexpensive. Some of the things I don’t care for are that the machine itself feels inexpensive. It is lightweight plastic and the buttons make noise when pressed. I know it’s a noise machine but my son loves the white noise sound and if i need to adjust the volume, it sometimes can disturb him. I do agree with other reviewers that the lullaby sounds are a bit repetitive and sound pretty basic. Since I’m using this for a baby that’s pretty much the norm anyways.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Works great as a white noise machine",
      "text": "This machine feels very cheap mostly because it is. It's very light, and the speaker isn't anything to write home about. But since it's almost always going to be on the white noise setting it doesn't matter that the speaker is utter crap and distorts if you turn it up. Overall it works well and is just what we were looking for at a very good price. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "UFeng",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Works, travels well, and is a great price",
      "text": "Ive used this sound machine since my baby girl was born. She wakes up easily to outside noise, so this helps drown out outside noise so she sleeps through me vacuuming and other normal househokd noise. I like that its small enough to travel with too. My daughter is 19 months and still uses it. She even turns it on herself to the ocean setting when she's ready for bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Tori Thomas",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "I love the timer so I can play it the whole ...",
      "text": "Arrived quick. Small and has enough volume to drown out my other 5 kids while baby is sleeping. I love the timer so I can play it the whole time or just 15, 30, or 60 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "AnnDee Nadauld",
      "helpful_votes": 6,
      "publication_date": 20161211
    },
    {
      "title": "Did not work in power outage even with batteries",
      "text": "I purchased this sound machine following a power outage. I wanted a machine that plugged into the wall but also held batteries. I used this product a handful of times (mostly while traveling) for 6 months. Each time I had plugged it in. Yesterday we had another power outage and when I tried to turn it on, it didn't work. I changed the batteries and still it did not work. For me this was a total waste of money. I'm extremely disappointed in this product. I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie H.",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Excellent sound quality",
      "text": "Purchased this item for our granddaughter. Excellent sound quality. Would recommend purchase to anyone looking for a baby sound machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim S.",
      "helpful_votes": 4,
      "publication_date": 20161219
    },
    {
      "title": "Highly recommend!",
      "text": "The first night we used the white noise on this product, our 7 month old twins slept through the night. I should buy another one for back up! We use this when we travel and our babies always have a great nights sleep! The speaker on it is amazing. It's really loud and it drowns out the kids playing in the playroom right outside the twins room. We bought some hippo soother before that everyone raved about. Well, this by far is the best little box ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Boymom",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Get what you pay for.",
      "text": "Price is what you get. It sounds fairly cheap. I mostly wanted a white noise part of it and it basically sounds like static, but I have it in my sons room and he doesn’t mind. It serves its purpose, I could never have it in my room tho. It feels sorta cheap, and the buttons are loud but so far that has had no effect on use. We’ve had over 2 months, used nightly.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexis S",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Best machine ever !!!!",
      "text": "Im so happy about this purchase- the price is perfect and does the job . I used if every night with my six month baby - he falls sleeps really well and sounds around the house doesn’t affecting at all . The best example was for Fourth of July weekend . We sleep fabulous",
      "rating": 5.0,
      "verified": true,
      "author": "Evel14",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "No batteries!",
      "text": "I love that I don't have to use batteries. I like to plug in and don't want to put a device in the crib that contains batteries, not to mention how many times I would have to change them out. It is small, compact and white in color. Goes anywhere in the room provided a plug is nearby.",
      "rating": 5.0,
      "verified": true,
      "author": "Annemarie ",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great, sleek, sound machine!",
      "text": "I really like this thing, it's very nice and sleek looking, it's about the size of the palm of my hand, maybe just a little bigger, I love that I can plug it in or take it with us with batteries! Hopefully baby girl will love the sounds too when she comes in July! The only thing is the buttons are SO LOUD when you push them! It is a very loud clicking noise. But once it's on its on, so it's not a big deal really.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Awesome little sound machine.",
      "text": "I wish it would last longer when using batteries. But other than that, I really have no complaints. I don’t use the timer function but that’s just my personal preference. It can be turned up very loud which is great. I love the small size, it doesn’t take up much room at all. And the best part is my baby sleeps so much better after buying and using this.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Benfield",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Wrong purchase",
      "text": "I ordered the wrong one as I should have ordered the one not meant for babies. I did play each mode for my friend for whom I ordered it in the first place. She was not impressed with the sounds of the baby one and requested that I not order the other one for her. Both of us felt that the quality of sounds was very minimal",
      "rating": 3.0,
      "verified": true,
      "author": "William K. Gaylord",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Works great",
      "text": "I love this machine! It has several different options of sounds it makes and a large range of volume control. I use it every night in the room that has a 6 year old and a baby and it really helps them sleep better. It’s small so it doesn’t take up much room on the shelf. I definitely recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Mama",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Sound quality is horrible",
      "text": "I was excited to get this for our 5 month old baby's nursery since he is just now starting to sleep in his crib in there by himself. When I plugged it in the sound quality was awful, it sounds like some cheap little $5 kids radio. The White Noise sound was so bad that I would never leave that on in my baby's room. The lullabies were horrible 20-second melodies on repeat. I cannot honestly explain why are there so many good reviews on this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Gonzalez Family",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Great little machine",
      "text": "Great little machine! First one I recieved seemed to have an issue with the volume. I contacted the seller and within minutes recieved a reply. He immediately sent out a replacement and I had it in 2 days! Works great! The best part is it also takes batteries and let me tell you that’s a lifesaver when your toddler needs this to sleep. Saved us just 2 days ago when our power went out! Great customer service and a great little machine! Traveling with this will be awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle W",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "And it is so easy to use",
      "text": "Miracle worker!! The white noise option was a godsend with our newborn. And it is so easy to use, lightweight and love that it can work on batteries, too. We bought two for the house and my parents' also have one at their house for when they watch the baby. :) Even we like it at night when sleeping. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy T.",
      "helpful_votes": 4,
      "publication_date": 20170224
    },
    {
      "title": "Perfect for our intended use",
      "text": "We needed to replace the crib music mobile that was in my daughter's room. It no longer lit up and I was constantly frustrated that the batteries would die so frequently. I LOVE the fact that my daughter can pick from 6 different sounds, easily turn it on by herself, and that the machine has three pre-set timers. But the best part, is that it plugs in! No more running out of batteries in the middle of the night. (It can also run on batteries, which will be great for travel.) I also like the fact that it doesn't glow, which would be a distraction at bed time. (The on button lights up, but it's not distracting).",
      "rating": 5.0,
      "verified": true,
      "author": "Bietz",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Love this sound machine!!!",
      "text": "Best thing ever for my toddlers!! I have a 1 year old and a 3 year old. I needed a sound machine that played all night to help them sleep. This is perfect! It's small and doesn't take up a lot of space but the sound is powerful. My toddlers love it! They wake up happy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Roberts",
      "helpful_votes": 4,
      "publication_date": 20170226
    },
    {
      "title": "Just Okay...",
      "text": "Just okay. We have another white noise sound machine that we absolutely love for our kids! The white noise on our other machine is relaxing whereas this machine's white noise is more disturbing/creepy. I didn't think the songs were very calming either. This sound machine also felt quit flimsy compared to our other machine. If I had to purchase another sound machine it wouldn't be this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Great little machine!",
      "text": "I purchased the baby white noise machine for the grandbabies, 4 years old and 10 months old. We have used it the last 2 days for naptime and all night. It does exactly what I need if too, mask other noises in the house and soothe the kids. I love the ocean setting! Very relaxing. I plan to use it when we travel too.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "so easy to keep in room or take on travel *several ...",
      "text": "Pros: *compact, so easy to keep in room or take on travel *several sound options (we always use the lullaby) *good volume Con: My only complaint is that the buttons are not quiet when you push them. They click pretty loudly when pushed. So, if I'm trying to turn the sound down when my little one is asleep, the clicking sound is not what I was hoping for. Overall, a great little sound machine and we are for the most part happy with the product.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Briggs",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "THIS IS GREAT",
      "text": "I thought about using Alexa (I have 2 in the house), but went with this for my grand daughter's naps. It was a great choice, and I use the \"white noise\" setting. Sometimes it soothes me to sleep when I hear it through the monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Memaw in Cali",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Finally found the perfect sound machine for my baby",
      "text": "Love this product! 1. The volume gets low enough that it doesn't feel like it's disturbing the baby. 2. The songs and sounds are mellow and soothing. 3. Has timer settings for auto shut off or can leave it on all night. 4. You can plug it in. 5. It's small.",
      "rating": 5.0,
      "verified": true,
      "author": "jkespd",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "serves well",
      "text": "This product serves it purpose and nothing beyond. My son likesthw ocean option and thankfully it worked with him. The timer option is an added bonus as well. The only thing that would have been above and beyond is if instead an abrupt stop to the noise is if it dimmed out the last five minute or whatever it may be. Works well for my home and for my sons daycare. Would recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "Silvia",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Great for getting a tired baby to finally sleep",
      "text": "Works like a charm for getting our 9 month old to sleep through the random creaks in an old house as well as two noisy siblings. Definitely worth every penny. Nice big buttons that I can tap with my foot (we've got it down on the floor for now) when my hands are full with a fussy baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Chitownmom",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "BEST sound machine",
      "text": "easy to use, small and portable for traveling, no time limit, no batteries needed, volume can be adjusted to very soft or really loud. We use the white noise in our nursery 24/7. we bought a second one for baby #2. and we use one for our DOGs during storms to drown out thunder. Happy house.... :) happy momma",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Simons",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Small and effective, buy 2!",
      "text": "Perfect for for home or daycare! It has great sounds, takes batteries or can plug in. We keep one with batteries at daycare on the crib to help our baby feel more at home (he has one in his crib at home too). It helps drown out the other kids and noises to get him his naps :)",
      "rating": 5.0,
      "verified": true,
      "author": "Momof2",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "The lullabies sound terrible - very tinny",
      "text": "So far, a few weeks in, this product is all I need it to be. I only bought it for the ocean sound. The lullabies sound terrible - very tinny. The buttons are hard plastic and very loud when pressed. Those two are my only complaints. For the price, I'm happy. Fingers crossed it keeps working.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave and Beth Schmitz",
      "helpful_votes": 4,
      "publication_date": 20170404
    },
    {
      "title": "We really liked this sound soother at first",
      "text": "We really liked this sound soother at first. It's lightweight, It's loud, It certainly gets the job done. We use it for our baby and it's hard to adjust once she's asleep. The buttons are so loud that she wakes up frequently if we need to adjust the volume level. If I had a do-over I would buy a more expensive sound soother geared towards infants.",
      "rating": 3.0,
      "verified": true,
      "author": "Oscar Godson",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Overall good quality for a great price",
      "text": "I really like this product. Volume is very loud ifnyou need it to be which for us was a ideal. We have twins and their room is big. I like that it let's you keep it on all night. Overall a great product. Reasons for not 5 stars: -This is the second time we have purchased this product. It just recently stopped working. But for the price point I am okay with it lasting a year and then needing to be replaced. - I like that it is battery operated or plugged in. However, if a power outage happens we have to manually turn it back on to use batteries.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great little sound machine",
      "text": "I chose this particular sound machine because it's inexpensive and will play continuously if you don't want to set a timer. There are 5 sounds + the white noise. And while 1 of those sounds does sound a little cheap and tinny, I use the white noise or ocean sounds anyway so it's a month issue. I like the large buttons and the small size of the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Really happy with this machine - just ordered a second one!",
      "text": "We just ordered a second one, as we're expecting another baby in August! It's been great for our daughter. We started using it around 6 months to help her sleep and still use it now (she's 2 and a half). It's simple, affordable, and easy to use...and the size makes it great for traveling!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "This sound machine is great! It was perfect for our baby's room",
      "text": "This sound machine is great! It was perfect for our baby's room. The white noise is actually one of the best I've heard and the ocean one actually sounds like an ocean not static. Highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 3,
      "publication_date": 20170128
    },
    {
      "title": "Kept turning off...?",
      "text": "Really frustrated--this particular one kept turning off randomly/throughout the night and during naps. I understand this one could be a lemon and not all are the same, but my baby would keep waking up whenever it turned off while I was trying to sleep train him--which we all know is a nightmare in itself. This didn't make it any easier. Ugh.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Didnt like the sounds",
      "text": "I did not like the sounds on this noise machine. 3 of the options were music which wasnt going to work for my baby. The white noise option was a very high pitched annoying sound. Hard to describe but if you have ever heard a white noise sound that put you on edge, this was probably it. The waves were a bit better but my baby didn't sleep well like he did with his old noise machine that we were replacing. Sadly, this will be returned.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "SO glad we own this thing!",
      "text": "White noise machine that does it all and has battery backup. Works great at home or while traveling. We even bring this thing camping and it works great. Can have our tent close enough to hear the baby but keep the campfire conversation noise from waking her up. It's taken a beating too as our toddler LOVES to play with it and push the buttons over and over again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "John Belanger",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "... the room and turn them back on that really sucks. I would not have bought them if that ...",
      "text": "I thought since these are battery operated to that if the electricity went out in the house they would stay on but that is wrong they go off to you have to go back in the room and turn them back on that really sucks. I would not have bought them if that was the case.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Kept confidential info confidential",
      "text": "We use this for white noise so that people wouldn’t hear confidential conversations that occurred throughout the office. The doors were closed but sometimes the walls were thin. Highly recommend as it did just that!",
      "rating": 5.0,
      "verified": true,
      "author": "Kale",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Cheap and creepy sound",
      "text": "The sound quality is a tinny and cheap. The lullabies sound super creepy and I can't imagine them being useful to anyone. The ocean sound is the only one serviceable, so that's all we use. It's definitely over priced, should be like $5. The only other reason we kept it is the option for battery or plug in when traveling.",
      "rating": 2.0,
      "verified": true,
      "author": "dste",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "I recommend you find a better machine because this thing didn't ...",
      "text": "We received the sound machine and or first thought was this is made so cheap. After plugging it up and using it for the first night or thought was correct. It worked for about an hour and completely stopped working. Because of this we have returned the machine. I recommend you find a better machine because this thing didn't even work for more than an hour. Cheaply made and not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "JessieS",
      "helpful_votes": 3,
      "publication_date": 20170318
    },
    {
      "title": "Helps my son",
      "text": "We got this for my 6 year old son who can't sleep all night long. It has helped him a lot. The white noise setting is a little rough in my opinion but he prefers the ocean noise anyway. I love the timer option.",
      "rating": 4.0,
      "verified": true,
      "author": "Paula Pellegrino",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Great quality",
      "text": "I was looking for a white noise machine for awhile when I came across this one . I couldn’t be more pleased with the quality of the product and that it helped sooth my baby . This one is easy to take with when traveling so you and your baby can get a great night sleep :)",
      "rating": 4.0,
      "verified": true,
      "author": "Mindy Shirey",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Okay but cheaply made",
      "text": "Definitely has high volume options. My 3 star review is because it is cheaply made and after less than a year of use and it just randomly shuts off which wakes my baby. Super annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "I got this for my granddaughter because she is fussy ...",
      "text": "I got this for my granddaughter because she is fussy...My daughter had a sound machine that did not have the heartbeat or the white noise. It turns out that that is just what my granddaughter needed to hear. I did a little research and found some advice that revealed that the womb is a noisy place and that babies get used to that, thereby missing it when they are born. My granddaughter is only a month old and this device pleases her...makes her feel contented. I am relieved for my daughter because she is sleep deprived.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Awesome!",
      "text": "When I first purchased this it felt cheap to me and I was a bit disappointed but after using this for over a year it does an amazing job at what I need it to do. I use the ocean white noise sounds and it goes pretty loud or quiet however your baby likes.",
      "rating": 5.0,
      "verified": true,
      "author": "Sammi",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Low quality manufacturing and sounds",
      "text": "The sounds are not calming, the lullaby is awful, and the white noise sound is really obnoxious. The unit itself is low quality and weighs about what feels like an ounce. The buttons are quite loud when you press them and could wake up your baby if they're a light sleeper. The only pro is that the unit is pretty, small, and looks good in the nursery. I'm not sure if I will keep this item.",
      "rating": 2.0,
      "verified": true,
      "author": "Kara White",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Real ocean sounds",
      "text": "Easy, small and great sound. We use it for the baby's room. The ocean sound is very real and lovely, not just louder and softer white noise like some. We mostly use that. I don't even remember what the others sound like except the white noise is a little harsh for my taste. We use the ocean sound instead and it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily B",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Could be battery operated",
      "text": "I bought this to use on a camping trip for my grandson. He uses a white noise machine at home and I needed something that could be battery operated. It worked great. The batteries lasted all weekend. He also liked playing with it while he was awake.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "THIS IS THE ONE!",
      "text": "This sound machine is THE ONE! I tried 6 different ones including the homedics and Rohm sound machine and this one really wins! The sound quality is amazing! The volume is perfect and it works great for my newborn!",
      "rating": 5.0,
      "verified": true,
      "author": "Olga Dimens",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "You get what you pay for.",
      "text": "I will be returning this item. The sound quality is terrible and the white noise option is way way to high pitched. Actually painful to listen to. I'm going buy another Lectrofan.",
      "rating": 3.0,
      "verified": true,
      "author": "J-Rod1983",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Great product",
      "text": "So easy to use and great sound quality. Small enough to be portable. It's been helping so much with our newborn baby. Carrying it from the nursery to livingroom then to dinning area. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "BG",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Fantastic",
      "text": "Awesome!!! Works great. We plugged it in and it works just fine. (I saw some reviews that said it didn't work while plugged in). Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161218
    },
    {
      "title": "Not soothing",
      "text": "I got this to use as a white noise machine for my daughter’s nursery. I couldn’t be more disappointed in the “white noise” sound. It sounds like high pitched TV static. Not comforting or soothing in the least. I am worried it could potentially damage my daughter’s hearing or cause tinnitus if used long term. Ended up throwing it in the garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Katy",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Dont buy, just dont.",
      "text": "Bought two for my Montessori school. The sounds are just heinous. The ‘white noise’ sounds like the tv on Poltergeist. All of them are ao awful. I tri d to give one away, and the family returned it to me because it was terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Paige G.",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "We purchased another sound machine for only a few dollars more and the other sound machine is of much better quality. The sound quality is lacking with poor ...",
      "text": "Returning this item. We purchased another sound machine for only a few dollars more and the other sound machine is of much better quality. The sound quality is lacking with poor product design. The buttons are difficult to press and hard to turn on or off at times. If you are looking to save a few dollars and just get a basic sound machine, it is functional. However, we want more for our buck.",
      "rating": 3.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Great sound! Clear and not harsh.",
      "text": "Great sound options, volume levels, and timer. My twins LOVE the ocean sound - it is not too harsh, the waves sound just like being at the beach. I give 4 stars only because if it is bumped or moved it sometimes turns off. However, that is only the case if you use the cord as the battery option does not have this problem. Also, this has only happened a couple of times and it easily turns back on by pressing the power button. Great for its price!",
      "rating": 4.0,
      "verified": true,
      "author": "Arianna",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Would not recommend",
      "text": "Sound quality is good, but all the buttons \"CLACK\" so loud when you press them, it wakes the baby up. If you want to turn the volume down (or turn it off, set the auto off timer, or press any button) you have to press the button numerous times until you get the volume level you want. So, in an attempt to make it quieter, you first have to hear, \"CLACK, CLACK, CLACK, CLACK, CLACK etc....\" on the volume button. It's pretty irritating and poor execution on the designers part.",
      "rating": 2.0,
      "verified": true,
      "author": "California Pilot",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Does the job!",
      "text": "This little device does exactly what it says it's going to do. I've been using it 24-7 for 8 months and it functions perfectly. There are a number of different sounds, but I only use the white noise sound. Just a note that for babies you don't need to use the highest volume. It's loud and may hurt their ears. Just a suggestion - turn it down! Buy this if you need a simple, easy to use sound machine. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaya",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Ok but there are better out there.",
      "text": "I like the sound options but my main complaint is that once you select the sound you like, and then turn it off in the morning, the machine does not default to your choice when you turn it back on the next night. Instead you have to re-select your sound preference every time you turn the machine off and then on again.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert G.",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Love these things",
      "text": "Buy one for all the new moms you know. It helps to keep those babies from being awakened from noises around the house. You don't have to tiptoe around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl L. Tyburski",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Baby Must Have",
      "text": "I swear by a sound machine. Our 8 month old has had one since she came home and is a phenomenal sleeper. It drowns out all the noise without having to replace the batteries. I love it. Update: I couldnt be happier. We've used this sound machine for our second child as well and I bought a third for the sitter.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole S.",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Stopped working just under a year",
      "text": "It was a good little sound machine while it lasted. It felt a little cheaply made, but worked well for several months. It started to lose sound volume about 8 months in and stopped working around 11 months. I would spend my money else where next time.",
      "rating": 1.0,
      "verified": true,
      "author": "AP",
      "helpful_votes": 0,
      "publication_date": 20190127
    }
  ],
  "product_meta": {
    "title": "Big Red Rooster Baby White Noise Machine | 6 Sleep Sounds | Sound Machine for Kids, Toddler Or Infant | Plug in Or Battery Powered | Portable Soother with Lullaby is Perfect for Travel",
    "rating": 4.2,
    "feature_bullets": [
      "6 high quality lullabies and sleep sounds: heartbeat, lullaby, ocean, rock-a-bye, twinkle, white noise",
      "Soothing sounds mask background noises to create an ideal sleeping environment for baby, infant or toddler. Baby will fall asleep easier, sleep better and wake-up refreshed",
      "Leave the sound on all night or use the optional timer that can be set for 15, 30 or 60 minutes",
      "Portable soother with lullaby is perfect for home or travel. Perfect for new baby gifts",
      "Powered by an AC adaptor (included) or 3 AA batteries"
    ],
    "specifications": {
      "Product Dimensions": "4 x 4.4 x 2.63 inches",
      "Item model number": "BRRC129",
      "Batteries": "AA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Number Of Items": "1",
      "Batteries required": "Yes",
      "Item Weight": "5.9 ounces",
      "ASIN": "B01GVEH844",
      "Customer Reviews": "4.2 out of 5 stars1,488 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#12,699 in Health & Household"
    },
    "categories": [
      "Health Care",
      "Sleep Sound Machines",
      "Health & Household",
      "Baby",
      "Sleep & Snoring"
    ],
    "price": 19.99
  }
}