{
  "website_summaries": [
    {
      "verdict": "This 3-in-1 press makes patties, stuffed burgers, and sliders. It also comes with a smartphone-friendly recipe eBook.",
      "pros": [
        "Constructed from high-quality ABS plastic",
        "BPA-free",
        "Press makes 4-inch patties or stuffed burgers, or 2 1/2-inch sliders",
        "Easy cleanup",
        "Comes with 60 stacking patty papers and a recipe eBook that works for smartphones and tablets"
      ],
      "cons": [
        "Reports that this press isn't durable enough, and breaks easily",
        "Some felt that the burgers came out too thick"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Fun",
      "text": "I love this Patty Buddy because it is so easy to use and clean. It makes perfect shaped burgers every time plus the fact you can stuff your burgers with cheese if you want to jazz them up a bit. My family loves burger night because they can gather in the kitchen and help make the burger they like best with the cheese or veggies they chose. I would say this to anyone thinking about buying one is what are you waiting for buy one and jazz up burger night with the family.",
      "rating": 5.0,
      "verified": true,
      "author": "Poppy Santa",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Paid for itself already after using it just once",
      "text": "We needed 20 plain hamburger patties. Instead of buying the pre-formed patties, we thought it might be more fun to make them ourselves. We thoroughly enjoyed the process. In addition, the combined cost of the burger press and the ground beef was much less than what we would have to pay for the pre-formed patties.",
      "rating": 5.0,
      "verified": true,
      "author": "shu lin",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Nice product",
      "text": "Making stuffed burgers is so much fun. Who knew how creative it can be until you try it out. We had so much fun exploring flavors and trying things as fillers and the burgers freeze perfectly. Great for kids to help make.",
      "rating": 5.0,
      "verified": true,
      "author": "S C",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great Gadget",
      "text": "Love this gadget just need to press down to make indent for stuffing and practiced enough to not have to use too much meat for each patty. I make gourmet burgers now lol ground turkey works great too",
      "rating": 5.0,
      "verified": true,
      "author": "yvonne hernandez",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "More trouble than it's worth, sorry!",
      "text": "If the meat is cold, it requires a lot of force to make many patties with this gadget. If the meat is warmer, it sticks all over the parts and makes a greasy mess! I'd rather spend the money and get frozen, pre-made patties, thanks!",
      "rating": 3.0,
      "verified": true,
      "author": "J. Lody",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Perfect burglets",
      "text": "Easy to use, and makes the perfect sizes. Was great to make many burgers, and put the wax paper between and freeze. Burgers are made any way you like them spice wise. You can even stuff them with anything",
      "rating": 5.0,
      "verified": true,
      "author": "TJW",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Try it",
      "text": "Just got it yestetday, like a child wanted to try it out fast, and just using logic , I made two hamburgers ,made out of ground turkey and they Came out real nice and took seconds, its great , do recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Myrin",
      "helpful_votes": 2,
      "publication_date": 20170312
    },
    {
      "title": "Makes a perfect sized hamburger",
      "text": "My husband always complained that my homemade hamburgers were too thick. He complains no more! Now my hamburgers are the right size and round! As a bonus this is easy to use and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Riggs",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Nice convenient press",
      "text": "Needs to make 6\" patties to make up for shrinkage of burger.",
      "rating": 4.0,
      "verified": true,
      "author": "hombre243Top Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Worth the Money!",
      "text": "Makes the perfect size patties so when cooking a batch of burgers they all cook even with one another. Stuffing the burger is super simple and easy to do. Well worth the money to make the perfect patties.",
      "rating": 5.0,
      "verified": true,
      "author": "Chance Giddens",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Awesome burger press!",
      "text": "Absolutely love this burger press! It does an amazing job in making perfect burgers every single time. It is easy to clean, with very little moving parts, which makes it perfect. Trust me i am VERY concerned about contamination and food hazard, and you want to be extra careful when handling raw meat. A durable burger press that is easy to clean is just awesome! Definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Malvika B.",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Easy to use, but too small",
      "text": "I like how easy it is to form a hamburger, unfortunately, they are too small. That's the only reason I rated it a 4 instead of 5. Many people will like the size I assume.",
      "rating": 4.0,
      "verified": true,
      "author": "Lou G",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "The Best Burger stuffer ever",
      "text": "Before using the burger stuffer my burgers were flat too big or too small......NOW my burgers are perfect!!! Patty burger stuffer is thee ideal product to make the perfect best delicious burger ever...Great for cook outs,parties,and dinner parties. I wouldn't just take my word for it folks you gotta try it.....PLUS it comes with a cookBook for more ideas...what a great gift",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn Lewis",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Works really well even not using it to stuffp",
      "text": "I purchased item for Christmas gift. I wish i had a video to see how it is used. I am very pleased anyway",
      "rating": 4.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "I love it, I can't wait to try stuffed burgers",
      "text": "I love it, I can't wait to try stuffed burgers!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann Roche",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Makes too thick burgers.",
      "text": "I found this to be hard to use. It does work, but not as easy as I would like. The burgers are so thick. Would be nice if it was bigger around and the burgers could be flatter.",
      "rating": 3.0,
      "verified": true,
      "author": "greatshopper2",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Perfect Patties EVERYTIME",
      "text": "Absolutely love the Deluxe Stuffed Burger Press. Prior to this I was making them all by hand. Resulted in inconsistency in the patties. No more! Perfect size, shape and the process was a breeze!",
      "rating": 5.0,
      "verified": true,
      "author": "JEStasulli",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "use it for my ground turkey burgers.",
      "text": "makes the same size burger so all my turkey is done at same time. wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "I really love this thing",
      "text": "I really love this thing, I put some jalapenos and various cheeses in the middle of my burgers and they are amazing. Excellent for those who buy 10 pound tubes of beef and want to make patties to store in the freezer.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Op",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Easy to put together and use",
      "text": "It came as described.. easy instructions and very easy to clean!! I tested it before I gave it to my hubby for our anniversary.. cant wait for his stuffed burgers",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Dosher",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Made a awesome gift, they loved it!!",
      "text": "If you don't know what to get a guy these work great, all of the guys loved it and they even called me up personally to thank me for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan K Pickett",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Great product, saves time and mess.",
      "text": "Used it the day it arrived, loved the results. Easy and perfect every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Wilbur Scott",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Deluxe Stuffed Burger Press",
      "text": "Bought this cause I like stuffed burgers and I wanted to try making my own. This device made it very easy to do so and they turned out amazing (Bacon and Cheddar) Will definitely be making more with this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Simple, Easy and Yummy",
      "text": "It was simple and easy to use. Makes the perfect size burger and I loved the ebook!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandee Carlisle",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Love this burger press!",
      "text": "The price is great and the press is fantastic! Ordering was easy and shipment fast. Finally can make a decent stuffed burger. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Great Product",
      "text": "Easy to use, very little clean up, and my sliders were a huuuuge hit at our Super Bowl party!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary B",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Presses burgers exact!",
      "text": "Works great. Easy to use and high quality. Definitely makes patting out hamburgers easier. There's even a smaller one for sliders.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Cool product! Making stuffed burgers is super easy and ...",
      "text": "Cool product! Making stuffed burgers is super easy and the recipe book that it came with had some good stuff in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Spencer",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Hamburger patter",
      "text": "Looks great. Just received today. Haven't had a chance to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Cox",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Easy, inexpensive and it works!",
      "text": "Love this for making uniform burgers now that grilling season is here!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime Harla",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Sliders too!",
      "text": "It is super easy, an option to stuff burgers, an option for sliders, and has a nice price!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Make your cookout easy on yourself !",
      "text": "Loved stuffed burgers and this tool will do it. Came complete and safe and nicely packaged",
      "rating": 5.0,
      "verified": true,
      "author": "DAVE",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "I made my mom happy.",
      "text": "I bought this for my mom and she loves it. Do you sell just the papers?",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Willis",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "The kit has some nice features.",
      "text": "This is my first burger press. It's OK. The kit has some nice features.",
      "rating": 3.0,
      "verified": true,
      "author": "Sidekkick",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Love it!",
      "text": "Bought for my husband bc he loves to bbq but hates the chore of making patties this cut the chore all together! We love this product and would recommend to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Neat burger maker",
      "text": "I'm so glad found this neat little gadget. My burgers turn out perfect everytime. Best money I've ever spent. You should give it a try you will not be disappointed,",
      "rating": 5.0,
      "verified": true,
      "author": "Toya F",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Good quality and easy to use.",
      "text": "Good quality and easy to make home-made burger. Like it.",
      "rating": 5.0,
      "verified": true,
      "author": "ernie_tung",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great for any type of burger!",
      "text": "Very easy to use great for making any type of burgers!",
      "rating": 4.0,
      "verified": true,
      "author": "P. SANTIAGO",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Love my Burger Press!",
      "text": "This sure helps take out the problems of stuffing the burgers. Makes life so much easier! Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "KML",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Great product",
      "text": "It seems like it's gonna work, most likely will fine an update",
      "rating": 4.0,
      "verified": true,
      "author": "Reiko Harris",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Seems sturdy",
      "text": "I like that it has some weight to it, its easy to clean too",
      "rating": 4.0,
      "verified": true,
      "author": "Alyha Ali",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "... hit any papers or recipe book but press works great.",
      "text": "Never hit any papers or recipe book but press works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck Johnson",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Five Stars",
      "text": "great, i liked the first one got 2 more for grandkids",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Willman",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Five Stars",
      "text": "Great kitchen tool. Easy and fun to use. Cleans up well. Stores just as easily.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Four Stars",
      "text": "Easy to use, and the burgers come out consistently. It makes my hubby happy, so there you go.",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Yum! Stuffed burgers!",
      "text": "The Patty Buddy is sturdy and has a great recipe ebook! Can't wait to make some mac and cheese stuffed burgers!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Darr",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Great product!!!!!",
      "text": "I got this in one day and I am truly impressed at how great this is for stuffed burgers! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Modesta Grizzle",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Good burger",
      "text": "This burger maker is pretty good, it's very sturdy and make a good size burger. I love the way how you can make stuffed burgers, pretty much put anything in the center of the patty. So this thing can make beef, lamb, pork very easily, but when it comes to chicken or Turkey, it sticks and does not release that easily. I tried oiling the surface, the top press comes off easily but the bottom part really sticks, I guess the only way to solve this problem is to use patty paper, then it would be perfect. All said and done it's an awesome patty maker, take the leap you won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "zac60",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "This is the one you need. All features you are looking for,",
      "text": "Just received and made 3 pretty dukey burgers. Will take a little more practice to get it right. I put shredded cheddar and Muffeletta (olive salad) inside. Could've used less chop meat and more stuffing. I think the burgers are big enough for your standard store brand hamburger bun. Mine were max thick though with stuff inside. This has the removable bottom (can't see how you could manage without that), it's the right size, and includes a slider size just in case. Nonstick surface was fairly easy to clean. Can't wait to buy my chop meat that is on sale at Shoprite and make my burgers to freeze!",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Tagliavia",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Gourmet hamburgers the easy way!",
      "text": "This Patty Buddy helps you make perfectly formed hamburger patties and is a great tool to make stuffed hamburgers. The Ebook is easy to follow and has excellent recipes. Definitely a great buy that I will use for years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Marty T",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Excited for future burgers!",
      "text": "My bf scoffed at the idea of needing a burger press until I made us bacon and cheese stuffed burgers. It super easy to use and the burgers are a great size. The meat stuck a little, but nothing a quick spray of oil wont fix. I'm super excited this came with a slider press too! Such a great bargain and it feels super sturdy. My bf is now a big fan too.",
      "rating": 4.0,
      "verified": true,
      "author": "Alaina Maldonado",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Easily make great stuffed burgers",
      "text": "My wife and I just purchased this burger press and wanted to give a try right away. We made cheddar stuffed burgers that turned out great. The only unfortunate thing was the ebook that should be on the website doesn't work. Edit: After contacting their customer service about the website issue they very quickly resolved the issue and sent me the ebook. Very impressed with their timely customer service.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian Lewis",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Outstanding",
      "text": "Outstanding, great for making the perfectly uniformed burger without getting my hands dirty. Easy to size the thickness of each burger. Sturdy well made material easy to clean and store.",
      "rating": 5.0,
      "verified": true,
      "author": "TSO",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "... they wouldn't have had as much meat as I like. Still getting used to using it though",
      "text": "Worked well to make my burgers although I think if I had actually used it for stuffed burgers they wouldn't have had as much meat as I like. Still getting used to using it though.",
      "rating": 4.0,
      "verified": true,
      "author": "The GreyOne",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Glad I bought this.",
      "text": "Almost perfect. I was looking for a press to form burgers LARGER than the buns. This was the largest (standard size) I could find. Bun sized. So I now just form the burgers in the press, put them on a plate and smoosh them down by hand. Oh well, it wasn't like I could really avoid handling the meat and still make the pattys anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Purchase you will love it!",
      "text": "This is an awesome burger press! I made 24 burgers out of five pounds of ground beef. I even made some stuffed with cheddar and pepper jack cheese. I put them in the freezer and use them when I need them. I will be making more for my family cookout on Memorial day! It is also easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Gospelmusiclady",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "Just got them",
      "text": "can't wait to put these to use maybe this weekend. Work OK for the price. Like being able to stuff even better comes with a slider mold to use for the small hamburgers...... pretty neat.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S. McCraw",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Fun to Use.",
      "text": "We cooked up 6# of stuffed hamburger....Amazed at how tasty they are. Will get few more Patty Buddy machines for birthday gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita A",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Nice little unit.",
      "text": "I like it but, you must still seal the edges by hand or the stuffings will leak out. Over all, Really nice unit, comes apart easily and is completely dishwasher safe.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey Jeffords",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "sturdy, easy to use",
      "text": "bought it for my son for Christmas and he loves it, sturdy, easy to use......",
      "rating": 5.0,
      "verified": true,
      "author": "JB Clark",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Five Stars",
      "text": "Great product. Takes the worry out of odd shaped burgers.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy F",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "quick easy way to make burger patties.",
      "text": "burger press is awesome. A little smaller than i like but defiantly a great press.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron D.",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "One Star",
      "text": "didnt like it didnt hold up for me they all fell apart ill stick to my hands",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Five Stars",
      "text": "Awesome!!!! Easiest way to make stuffed hamburgers and sliders!! Can't wait to see what combos we can come up with.",
      "rating": 5.0,
      "verified": true,
      "author": "RM Clark",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Master the art of the \"Stuffed Burger\".",
      "text": "Crafting stuffed burgers by hand is messy and hit-and-miss. With Master Yeti, you master the art of the Stuffed Burger.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Cheap plastic",
      "text": "Broke after two uses. Cheaply made do not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "EA",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Four Stars",
      "text": "works alright- use the wax paper top and bottom or it will stick",
      "rating": 4.0,
      "verified": true,
      "author": "J Jordi",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Five Stars",
      "text": "Only uses it once so far but turns out perfect burgers",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "but looks like high quality product",
      "text": "Haven't used it yet, but looks like high quality product. Everything feels very sturdy and good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Making me A Master Chef",
      "text": "Great Burger Maker! It has been a HUGE HIT at home.",
      "rating": 5.0,
      "verified": true,
      "author": "VinnienJersey",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "No sticking, quick and easy.",
      "text": "Best burger press I've tried. I get a perfect burger each time and it slides right off with no sticking. Gotta love it. Thanks for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "sgtfish",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "coburns",
      "text": "It works as advertised. We have it at the lake and it gets used weekly",
      "rating": 5.0,
      "verified": true,
      "author": "Clayton Coburn",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Five Stars",
      "text": "Now much to say. It is a simple device that does what it supposed to do. Highly recommneded.",
      "rating": 5.0,
      "verified": true,
      "author": "Gill Cornell",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Mexican burguer",
      "text": "I made a grate hamburguer stuffed with a Mexican touch: cheese, poblano pepper and corn. Everybody loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente de Kindle",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Five Stars",
      "text": "tried for the first time had the Grandkids make their own.",
      "rating": 5.0,
      "verified": true,
      "author": "PaPaGrizz",
      "helpful_votes": 0,
      "publication_date": 20170601
    }
  ],
  "product_meta": {
    "title": "New! Deluxe Stuffed Burger Press with 60 Free Burger Papers & Exclusive Downloadable Recipe eBook, All in One Burger Maker, Slider & Hamburger Patty Press, BBQ Grilling & Gourmet Kitchen Tool",
    "rating": 4.6,
    "feature_bullets": [
      "✓ PERFECTION WITH EACH PRESS - Say goodbye to tedious and messy patty molding and easily MAKE MULTIPLE PATTIES CONSISTENTLY and without worrying about the shape whilst MINIMISING WASTE. Now you can avoid expensive visits to diners and eateries by enjoy freshly made gourmet meals, that you can CUSTOMIZE and HEALTHIFY - All in the luxury and comfort of your home!",
      "✓ SUPERIOR VERSATILITY – Whether it’s regular patties, stuffed burgers, sliders or minibugers, Patty Buddy is the ultimate kit in your kitchen. It’s simply the PERFECT GIFT for any food lover, whether they're into meat, fish or veggies, or even GLUTEN-FREE confectionery (Yes, you can make desserts too!)",
      "✓ FOLLOW OUR RECIPES ON YOUR SMARTPHONE OR TABLET – Our enchanting eBook contains OVER 20 HAND-PICKED RECIPES ranging from continental classics to healthy & contemporary masterpieces and exotic gourmets, for inspiring new and seasoned cooks alike! An in depth Patty Buddy tutorial and guide will ensure that you are ready to start making mouth-watering hamburgers! The eBook is optimized for you to follow on your smartphone & tablet while you prepare and cook patties!",
      "✓ PARTY READY – Patty Buddy is also ideal for gatherings all year round, from summer barbecue parties to festive feasts! Get ready to have fun sharing and impressing your family & friends with your SUPREME PATTIES!",
      "✓ PREMIUM QUALITY & SAFE –Patty Buddy is manufactured using the HIGHEST QUALITY ABS plastic that is both DURABLE AND ROBUST. We have also ensured it is BPA-Free so you can have a peace of mind whilst making succulent patties."
    ],
    "specifications": {
      "Product Dimensions": "5.12 x 5.12 x 2.64 inches",
      "Item Weight": "6.4 ounces",
      "Manufacturer": "Master Yeti",
      "ASIN": "B01GVQWEE6",
      "Item model number": "8541977341",
      "Customer Reviews": "4.6 out of 5 stars1,043 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#180,206 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Home & Kitchen",
      "Outdoor Cooking Tools & Accessories",
      "Grills & Outdoor Cooking",
      "Grill Presses & Irons",
      "Grilling & Barbecue Utensils"
    ],
    "price": ""
  }
}