{
  "website_summaries": [
    {
      "verdict": "A plush, yet supportive, choice that's a good value for the cost.",
      "pros": [
        "Users noted the softness, comfort, and value of this option",
        "Some felt it helped ease back and joint pain, and most felt it kept them cool during sleep",
        "We also like it lacks the chemical odor some toppers have"
      ],
      "cons": [
        "A few felt it wasn't soft enough",
        "didn't keep all customers cool enough"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Exceptional topper",
      "text": "I was torn between this and a 4\" topper like one I've had in the past but settled on this and so happy I did. Far exceeds past experience and is a dream to sleep on. I have some disability from severe injury and am now able to sleep on my side for the first time in six years which speaks volumes for me. I highly recommend this product and received NO discounts or anything free so this review is from the heart (and back and hip and shoulder and head :). Don't hesitate based on the 2\" thickness, it provides a wonderful nights sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Artlyn",
      "helpful_votes": 425,
      "publication_date": 20160809
    },
    {
      "title": "Memory foam topper",
      "text": "My memory foam pad is wonderful!!!! It's very comfortable and best of all it doesn't have a foamy chemical smell at all. Also I don't get hot while sleeping on this foam pad like I was very leery of. I can now easily sleep through the night for the first time in decades in comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "donna",
      "helpful_votes": 109,
      "publication_date": 20160825
    },
    {
      "title": "Nightmarish.",
      "text": "It showed up well beyond the original ship date. I was not impressed. The unboxing instructions weren’t accurate as it states the topper comes vacuumed sealed. It was actually wrapped in the shipping Saran Wrap so it was a nightmare finding the end. It also led me to believe that this item was actually used and my fears were solidified when unfolding it there was a gash in the topper. The gash is no longer visible being it has expanded. I’d say it’s probably 2”. It doesn’t actually keep us cool and my toddler sweats even more so when he sleeps on it. Comfortable enough but with the headaches of dealing with this order, I wouldn’t buy had I known.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20181217
    },
    {
      "title": "Perfect Topper",
      "text": "This is our 3rd one. Bought the 1st one for our 13year old mattress to give it new life for a few years. The second one for our RV mattress. Then bought a new mattress six months ago and put the original topper on the guest bed . After six months on the new mattress we decided we needed the topper to make it even better. We love this topper. It gives us a great nights sleep. Made in USA makes it even better. No offgassing or smell. Received it in two days slept like babies the very first night .",
      "rating": 5.0,
      "verified": true,
      "author": "NVLance ",
      "helpful_votes": 7,
      "publication_date": 20181213
    },
    {
      "title": "Not A Cooling Topper",
      "text": "Don't get me wrong, the topper is very, very comfortable. The problem is that it does exactly OPPOSITE of what it claims to. The thing is a heater. I have an AC unit blowing 64 degrees all night and if I put my arms or legs out of the covers they freeze. If I keep them in, I sweat all night. If you want a COOLING topper, look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "John Doe",
      "helpful_votes": 7,
      "publication_date": 20180523
    },
    {
      "title": "Nice topper for a day or two",
      "text": "So far so good. It has a slight smell of glue but nothing really noticeable unless you hold it up to your face. But its comfortable and its cool to the touch. Will update after I have slept on it. Update: Have had this for one week and it is horrible. The cooling gel does not feel cool at all anymore. This topper actually makes the bed fill hotter. I expected something a little better since the reviews were positive.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis Martin",
      "helpful_votes": 4,
      "publication_date": 20190402
    },
    {
      "title": "Nice improvement over my lumpy fiberfill topper",
      "text": "Nice improvement over my lumpy fiberfill topper! The seller even reached out to me before I received the product to make sure I was aware to contact them if there were any concerns with the product. They wanted to be sure everything was to my liking. Impressed! Additionally I haven't experienced any issues with the temperature of the topper which I had some concerns about.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki O",
      "helpful_votes": 8,
      "publication_date": 20170316
    },
    {
      "title": "Comfortable..Cooling",
      "text": "I bought this to replace my old egg crate style mattress topper that had just worn out. My 2 year old mattress is still rock hard- so I had to find something new. I wanted something that was more cooling because I tend to sleep hot. This gel foam topper really did the trick. I am still using it over a year later- and it is still in good condition. It sleeps cool and is very comfortable. I will definitely buy this again when I need a new one- the price is so much more reasonable than similar products. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sixtus",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "HEATS UP LIKE ALL THE REST",
      "text": "Heats up like all the rest, unfortunately. I bought this because it said it was a \"cooling\" topper. By that I mean I wanted a topper that doesn't retain and amplify my body heat. This one does just that. I wake up every few moments needing to find a cool part of the bed to move to. Oh well. It's a good topper, worth the money. Just don't buy it for it's cooling properties.",
      "rating": 3.0,
      "verified": true,
      "author": "Big D",
      "helpful_votes": 4,
      "publication_date": 20180421
    },
    {
      "title": "Comfortable but NOT Cooling",
      "text": "I bought this mattress pad after searching specifically for pads that said they are \"cooling.\" I had been waking up every night for years being overheated because the egg-crate pad I was using was capturing and radiating heat back to me. This pad was purported to have \"cooling\" technology incorporated into it, so I bought it. Unfortunately, while it is very comfortable and it doesn't radiate as much heat as my old egg crate pad, it really is not at all \"cooling.\" Simply doesn't live up to its advertising. I'm giving it 3 starts because overall, it is very comfortable. But if it had been truly cooling like its marketing claimed, I would have given it 5 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "EscherFan",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "I felt like the princess and the pea and when I tried ...",
      "text": "I bought this bed topper for our RV bed as it was a mattress on a flat board. I felt like the princess and the pea and when I tried to sleep on it, felt as though I could feel the board. I purchased this right before a 2 month RV trip we took down south. It helped my sleep immensely plus had the additional advantage of the cooling gel on top, which really helped in the hotter weather. I am very pleased with my purchase and slept great because of it. I would definitely recommend it to anyone who needs a more comfy night's sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Austin",
      "helpful_votes": 8,
      "publication_date": 20161114
    },
    {
      "title": "Loving it!",
      "text": "I love this topper. I use it in a company provided apartment so buying a new bed is not an option. The provided matresses are wicked firm, like a blanket over a tile floor. Ok, maybe a dirt floor😎. Regardless, this topper helps me sleep well and deep. I'm thinking of doing something similar at home. Buy a 'lasts forever firm mattress' then add a topper like this one. Then just replace the topper every 3-5 years. Great ROI for your money. Hope you enjoy it as much as I do. Cheers",
      "rating": 5.0,
      "verified": true,
      "author": "Helo53Driver",
      "helpful_votes": 4,
      "publication_date": 20170311
    },
    {
      "title": "This is the best Gel topper on the market today!",
      "text": "probably one of the best purchases I made this year! I have a comfortable pillow top mattress but when I added this topper it feels like I am sleeping on a cloud! The gel keeps the topper from feeling too hot in the summer..and there is no oder at all. This topper had made my bed turn into the best place in my house. I recommended it to a couple of my friends who also purchased one and absolutely love it! I have tried other \"memory foam\" toppers but this is by far the best one yet...you will not be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "matrix058",
      "helpful_votes": 3,
      "publication_date": 20170113
    },
    {
      "title": "This mattress topper saved me hundreds of dollars.",
      "text": "This mattress topper is great because I was getting ready to replace my terrible \"bed in a box\" mattress that was only 2 years old, but was so uncomfortable I couldn't even sleep through the night. I ordered this topper as a last ditch effort to save me from buying a new bed. The topper worked like a dream! I love it and am now loving my bed and sleeping through the night and waking up more refreshed. I plan on buying toppers for all my children's beds, and maybe even for my dad as a gift for his bed. It is wonderful and so comfortable. I would highly recommend this topper.",
      "rating": 5.0,
      "verified": true,
      "author": "having fun iz ezy",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Get something else",
      "text": "The topper came sloppily wrapped in saran wrap. The foam had prominant tears/gashes. It was ok for about 6 months. Still woke up in pain, no support. Topper is not \"cool\" as stated. It was no different that a regular piece of foam. Still woke up sweaty. Dont bother with this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicola",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Very comfortable mattress topper",
      "text": "Very comfortable mattress topper. We bought the one with 3 inches before but it was too high for both of us. We then returned it and switched to this 2 inches. It was so comfy and slept until sunrise. My mom had the sleeping problem and I bought one for her. She was very delighted.",
      "rating": 5.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 12,
      "publication_date": 20180202
    },
    {
      "title": "NOT COOLING",
      "text": "Nope. Bought this because of all the reviews stating that it helped disperse the body heat. It's just has heat retentive as my mattress. The only thing I can give the two stars for is the support for my joints. I'm still looking for some relief from the heat.",
      "rating": 2.0,
      "verified": true,
      "author": "MrsDagnabit",
      "helpful_votes": 3,
      "publication_date": 20180614
    },
    {
      "title": "Highly recommend",
      "text": "I bought this for my son who was visiting me from Florida. He said he couldn't sleep because the mattress was to hard. I purchased this to see if it made a difference. He absolutely loved it. He said he slept great and it was comfortable. I will purchase this product again for the other beds in my house.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Lee",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Less Snoring - What a BONUS!",
      "text": "This was a little hard to get used to - at first it felt like I was laying in a sand pile - not hardness - but weirdly like I didn't want to move- another person described it like laying in mud. Now that I have been sleeping in it for a while - that feeling is gone AND the snoring has been reduced by about 3/4! What an unexpected bonus. I like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Healthy Living",
      "helpful_votes": 2,
      "publication_date": 20180413
    },
    {
      "title": "Great buy !!!",
      "text": "Our old bed was just dead ..... everyday we woke up with back and hip pain. I could tell right away it's much more comfy now. We both wake up somewhat well rested but mainly just bc we can't sleep on any bed. Overrall I feel as if it keeps me cool at night and I wake up much in a much better mood. It didn't have any weird smells that some people speak of and I would highly recommend this to anyone who doesn't have a huge chunk of money to drop on a new mattress at the moment.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Marenger",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Smaller and Discolered",
      "text": "The topper is about 4\" on the side and 2 1/2\" shorter than the actual size of our QN mattress. Although color does not affect the sleeping condition of the topper, it is discolored with white areas thru-out the topper, which I would think a new topper should not be discolored. I understand a slight difference in size for proper fitting sheets, but this is excessive and will not be comfortable. Amazon has made it good, but I suggest going with another company and avoiding the trouble.",
      "rating": 1.0,
      "verified": true,
      "author": "brenjohn",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Awesome.",
      "text": "Tried one of these from kohl’s and hated it. Bought this one because I needed something to keep me cool. This thing is so comfortable. My girlfriend loves it too. Can’t get her to get out of bed now.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorkimoe",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "Like sleeping in quicksand",
      "text": "First let me admit I prefer a firm mattress, so what I was looking for in a topper was just a bit of cushion that wouldn't lead to overheating for use on a guest bed. Unfortunately, this one didn't work out. Lying on it feels like being trapped in quicksand with foam walls rising up around me. We've had 4 people sleep on it and nobody felt they had a comfortable night, so I'll be off searching for a replacement. Probably fine if you like a cushy, spongy mattress.",
      "rating": 2.0,
      "verified": true,
      "author": "Hyacinth",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Soft",
      "text": "I've had this for 2 years. I usually sleep hot, this does not add to my heat. I had bought a firm mattress, but too uncomfortable. First I bought a cotton mattress pad which was nice but then I discovered this pad. It's perfect. I feel like I'm sleeping on a cloud. I'm 5'7\" and 205 pounds, I do not sink into this mattress. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "VIVIAN CARR",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Heat and packaging",
      "text": "Well mine arrived in a box wrapped in Cellophane.. wasn’t sure if it was a used one . Paid full price for it .. all he others I have seen online and from customers it was covered in a nice wrapping . Anyway so far it’s dry comfortable and back didn’t hurt as much .. Only thing I have noticed is that my back gets warm .. I brought it with the intent it keeps you cool .. from the reviews that I read .. :(",
      "rating": 4.0,
      "verified": true,
      "author": "karen L fudge",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Wish i had bought it sooner !!",
      "text": "I have been sleeping on this 2 inch mattress topper since August and it's now November. It has been great. All my joint pains are gone and i look forward to sleeping every evening. Prior to using the topper every night's sleep was painful , my hips and shoulders, elbows would ached and i would toss and turn waking up unrested . I only wish i had bought it sooner",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Don’t waste your money if you’re looking for a topper to relieve pressure points.",
      "text": "Soo disappointed. We are side sleepers and have a mattress made just for side sleepers that is awesome in our primary home. Ordered this topper as it stated it would relieve pressure points suffered by side sleepers. It does not. Hips hurt within a couple of hours.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda Jackson",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Finally a good night's sleep",
      "text": "I was skeptical after reading all of the paid endorsements of this product. However, I decided to try it. I love this topper!!!! I sleep well and don't wake up with hip or shoulder pain anymore. It saved me from replacing a mattress and it has retained its shape. It does run a bit warm in that I no longer need flannel sheets in the winter, but it is comfortable. I plan to purchase another one for my daughter's bed soon. (I did NOT receive anything for reviewing this product. It is purely based on my my experience.)",
      "rating": 5.0,
      "verified": true,
      "author": "DJC",
      "helpful_votes": 3,
      "publication_date": 20170110
    },
    {
      "title": "No more hot nights!",
      "text": "My girlfriend is a furnace! I've had this for a few weeks now, we're sleeping cool as a cucumber. I definitely purchased this for the cooling factor, but the memory foam topper is a nice bonus! It fits my queen mattress perfectly after letting it expand for a few hours. If you share your bed with a hot one, buy this and cuddle away!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Fo",
      "helpful_votes": 2,
      "publication_date": 20190116
    },
    {
      "title": "Medium Rare Please",
      "text": "As a memory foam topper, this is great. However, the cooling properties of this topper fail miserably. I literally roast myself to sleep nightly regardless of the temperature outside, Sad to report, but i purchased this solely on the idea it would provide some cooling comfort to my already warm bed, it did not...",
      "rating": 2.0,
      "verified": true,
      "author": "BDLOPEZ",
      "helpful_votes": 3,
      "publication_date": 20170910
    },
    {
      "title": "So far a great Topper choice",
      "text": "They all lie. These things DO ware out. I realized that I needed to replace my last one when there seemed to be a pit in the middle of my bed even though inspection did not show it. I decided to try this Gel topper this time. So far I like it. Unfortunate initials for Advanced Sleep Solutions - or deliberate? I will look for this one when it is time to replace it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Petrosino",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "mattress is 30 years old and in good shape but became very lumpy",
      "text": "Wanted to wait a bit before reviewing. Bought this in May of 17. Have a queen size bed, mattress is 30 years old and in good shape but became very lumpy. Since I put this topper on I feel like I'm sleeping in a cloud. And during the summer, I do not sweat. Am actually thinking about getting a second one to add on top of this one. The price is great for the product and after 9 months of using it have had no problems at all. Feels as good today as when I first started using it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Kastens",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "LOVE this topper",
      "text": "I used to sleep on a Temperpedic, and this is the closest I've come to that mattress (without spending the money)! The best part, however, is the gel helps regulate my temperature, and finally I sleep in the hot Texas summers without being hot and cold all night. My boyfriend used to complain my mattress was too hard, and he loves it as well. Highly recommend to everyone!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ali P.",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Very comfortable",
      "text": "We bought it for an Ikea day bed we bought (friheten) as the \"mattress\" it =comes with is not overly comfy and one can feel where the split in the couch is, thus needed a topper. Only person to sleep on it thus far is the mother n law and she loves it. Said it is super comfy and she doesnt feel the split (or bar) beneath her. It comes in a smaller box, you open the packaging and it slowly expands. Ours was sully expanded in a very short time, maybe like an hour and didn't really notice an overpowering smell that some report. Very happy thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "flames9",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Comfortable but not the answer for sleepless nights and a bad back.",
      "text": "This gel memory foam mattress topper is very comfortable and it feels like what I would imagine a cloud would feel like sleeping on. However for whatever reason it didn't help me to sleep any better like the manufacturer claims it to and my back doesn't feel any different either. Thats why I only gave it 4 stars instead of 5. Is it worth the $99 price tag uhh probably not you can practically get the same exact topper for less. All in all, a decent topper.",
      "rating": 4.0,
      "verified": true,
      "author": "DoctaLuke",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "I Recommend This",
      "text": "This topper really does what it claims. Every summer I sweltered at night as I do not use air conditioning in my home. Fans helped but not entirely. Since I now use the Gel Memory Foam Topper I feel no body heat at all from the pad as it is more neutral in temperature but never warm. My fans are all I need now to feel comfortable as long as I also use the mattress topper. I'd surely buy this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorfy",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "You Need It",
      "text": "I got this to help keep me cool (hot flashes... sigh), and make my older memory foam mattress more comfy. It works! Came in a surprisingly small, light-weight box, and I followed the included instructions upon opening. It fluffed up immediately, no odor at all. I let it sit out for a few hours, then used it that night. It is *wonderful*. It doesn't move out of place, but I also bought a breathable mattress cover thingy just in case. I sleep so much better that I wake myself up giggling instead of stiff & cranky.",
      "rating": 5.0,
      "verified": true,
      "author": "Assimilated",
      "helpful_votes": 2,
      "publication_date": 20160820
    },
    {
      "title": "A Great Mattress Topper!",
      "text": "This is a very good topper! It arrived quickly and in good condition. When I opened the box and unwrapped the topper it looked just like the picture on Amazon and seemed to be at full size. I laid it on the bed and left it for 24 hours to let it expand and air out. There was no noticeable odor! The topper feels great and makes even a firm mattress more comfortable. It helps to relieve pressure on hips and other sensitive body parts while providing support for my back and upper body. I can get a good nights sleep w/o the expense of a new mattress! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Barry K. Shafer",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "My husband and I have both been sleeping better with considerably less back and joint pain since we've ...",
      "text": "My husband and I have both been sleeping better with considerably less back and joint pain since we've started using this topper. Definitely recommend it! It is important, however, to follow the directions for setting it up which are sent via e-mail after the purchase is made.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Smith",
      "helpful_votes": 5,
      "publication_date": 20170314
    },
    {
      "title": "Adds a Lot of Comfort",
      "text": "I had a lot of trouble sleeping on my new mattress. It was a high quality mattress, but it was apparently a bit too firm for me. My shoulders and back hurt almost every night after getting it back in December. This topper solved the problem. I can't say it sleeps cooler, but it definitely relieves the pain in my joints. I would certainly recommend this product to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Di",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Great product for the price!  Served our short term needs quite well.  Read review for details.",
      "text": "Great band-aid product until two people with differing opinions on can decide on a happy median for a new matress. Slept on for roughly 3 weeks and thought highly enough of the product that we used it to supplement the existing memory foam matress on our cabin cruiser on the boat. Durable over the short haul of regular use and likely to have a long life span considering the low frequency of use in current capacity.",
      "rating": 4.0,
      "verified": true,
      "author": "David Illanne",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Absolutely love it it took our $600 bed and made it ...",
      "text": "Absolutely love it it took our $600 bed and made it a $2,000 bed we sleep better wake up more rested it's just flat-out and night and day and that it's made in America you can't beat that you know it top quality material",
      "rating": 5.0,
      "verified": true,
      "author": "Tex",
      "helpful_votes": 4,
      "publication_date": 20170327
    },
    {
      "title": "A little disappointed because I thought it would be much more comfortable ...",
      "text": "I didn’t feel much of a change when it was placed on top of my queen matress. A little disappointed because I thought it would be much more comfortable and foamy based on the reviews on here. It came in a box rolled up and once i unrolled it onto the bed it took about two weeks for the lump towards the end to go down. Material could have been better and i didn’t feel much of a difference, so not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "J&V",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Everyone needs a mattress topper!",
      "text": "I have one from a different company and my mother in law wanted one. We got her this one and let me tell you its awesome. So comfy so soft helps with her back issues. And my daughter loves to nap on it in grandmas room. I think every bed needs a mattress topper now!",
      "rating": 5.0,
      "verified": true,
      "author": "Kassiani",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "It's soft but traps heat",
      "text": "The topper is very soft and is pleasant to the touch but the only thing about memory foam is the fact that it gets hot. If you run hot at night, this is something you do not want to get. Unless you're able to come up with a solution to use this and keep your bed cool, this would be very uncomfortable. My wife runs hot and I'm sort of in the middle but this was uncomfortable for the both of us. Can be great for tents though!",
      "rating": 3.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "I sleep better with this",
      "text": "Very comfortable. Slept in it and its so comfortable. It makes me sleep better at night and wake up feeling more relaxed. It has a smell at 1st but just leave it to air out and you'll be fine. Its well worth the purchase and im supprised on how they fit it into the box they do",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda & Desiree",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "I've never slept better, night after night",
      "text": "I've never slept better, night after night. No more tossing and adjusting pillows to make sleeping comfortable. This fixed my restless, inconsistent sleep pattern. Would buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 5,
      "publication_date": 20170308
    },
    {
      "title": "Quality Product AND Service After the Sale",
      "text": "Kudos to Advanced Sleep Solutions! Great product and when I did have an issue with the topper, they were right there to address and ensure I was satisfied. Really impressed with your product AND your customer service. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "DMidd",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Best night's sleep",
      "text": "We purchased a sleep,number bed and it nedded a bit more cushion on top. We let this set this out flat for about 2 days. It really is 2 inches thick. No order whatsoever.This is the most comfortable bed that I have slept on. It does not leave an imprint of where you slept. It bounces back. Love this. Excellent price too",
      "rating": 5.0,
      "verified": true,
      "author": "turkey man",
      "helpful_votes": 2,
      "publication_date": 20170416
    },
    {
      "title": "It did not help me keep cool.",
      "text": "I only bought this topper to keep me cooler. It is comfortable, but it did not seemed like it made me cooler at all. I looked at some photos and those look like they were packaged nicely. Mine looked like it had been used. It has some dirty spots on it. It was wrapped partially, but the top part was uncovered.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "This topper is amazing and the seller was so courteous and reached out ...",
      "text": "My husband and I have been experiencing back pain from our mattress for months. We've had this topper for nearly a month and it has made such a difference in the quality of our sleep. This topper is amazing and the seller was so courteous and reached out to me through e-mail to make sure everything met our standards. I highly recommend this seller and product.",
      "rating": 5.0,
      "verified": true,
      "author": "C. McCullough",
      "helpful_votes": 3,
      "publication_date": 20170307
    },
    {
      "title": "Well made product",
      "text": "It is a little early to give a full review. I shipped promptly & I received it & it unfolded without a glitch. I let it air for a few days before sleeping on it, as recommended. I have slept on it only 3 nights. My main purpose in ordering this product was to avoid waking several times a night because I am overheated. The weather has cooled & so I haven't fully evaluated that feature. It is very comfortable & appears well made. Appreciate made in USA. I will give an update IF our weather returns to temps over 100.",
      "rating": 5.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Saved me buying a new mattress I couldn't afford.",
      "text": "While my mattress wasn't ready for the ash heap, it needed help. I also needed something to help keep me cool at night. Honestly, this delivered more than I expected. It's incredibly comfortable without being too soft. I've had it 7.5 months and it shows absolutely no wear, springing back with no residual indentations from use. There was no odor either. I do think it's kept me cooler but for the record, I do have it covered with a breathable bamboo mattress cover. It's a good value for the money and I can honestly recommend it without reservation.",
      "rating": 5.0,
      "verified": true,
      "author": "Sushiboo",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Not cooling and too soft",
      "text": "Not cooling at all!! Also it is too soft for me and has no support whatsoever. I wish i could return this. I had to get rid of it, because it was getting way too hot and uncomfortable when sleeping. My bed feel so much better without this topper.",
      "rating": 1.0,
      "verified": true,
      "author": "Shiny11",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Very comfortable",
      "text": "We bought this for our RV camper queen bed. I like it but I wish I had gone with the 4 inch instead because RV mattresses are not the thickest most comfortable on the market. When this wears out and needs replacing, I will buy another one but get the thicker model instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim D",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Not firm enough.",
      "text": "It’s not firm enough. I have 2 memory foam mattresses. The guest bedroom mattress is very, very comfortable. You don’t sink into it and it doesn’t get hot. The memory foam mattress on my bed is too soft and it gets hot. I bought this topper to keep my bed cool and to add firmness. This topper is not firm enough. I have to return it",
      "rating": 1.0,
      "verified": true,
      "author": "jodi",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Worth the price!",
      "text": "This was a great replacement to my old one. I bought new one for BF bed a different brand thAt I like better. I will be passing along to my son this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Cincybeckyboop69",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Definitely worth the money.",
      "text": "I let it breathe for 8 hours outside of it’s wrapping then I put it on top of my mattress. Feels wonderful. I have a great Temperpedic Mattress. With that and now this also. Feels really nice. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "10 Stars for this Memory Foam Topper!!!!!",
      "text": "The Gel Memory Foam Topper has allowed my husband to sleep so much better! He is doing much less tossing and turning due to aching hip joints. I do not have sleeping problems but am amazed at the comfort. I am sleeping much more comfortably also. We love it!! Our improved sleeping plus the super price at Amazon earns this product 10 stars ;) It did have a little bit of an odor when we received it and let it air a few hours. It was not an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "ama x 4",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Very Comfortable",
      "text": "So far so good! The first night I woke up with a sore back, but that was likely just my back adjusting to the new pad design. I'm sleeping much better now. I have a Sleep Number bed. This product more than meets the bill. Way cheaper than SN's solution and does the same thing. I'd recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Great sleep",
      "text": "I replaced a 3.5” foam topper with this 2” gel topper and I am so glad I did. My body aches are gone and turn and toss a lot less during my sleep",
      "rating": 5.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Excellent Value! Give it some time to air out.",
      "text": "This is a great product for the price. It really does make the bed more comfortable and cooler. I bought this for a bed at a vacation rental we were renting. It was very hot and the bed was terrible. This topper made it so much more tolerable and I was able to sleep. You will need to give the item about a day to air out. It does have an off putting smell but quickly goes away. After the summer my brother took this for his bed. He loves it too. His mattress was very uncomfortable and he said it's cozy now.",
      "rating": 5.0,
      "verified": true,
      "author": "amyloo",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Gave it as a gift, and that person loves it.",
      "text": "I bought this as a gift for a friend with back and hip pain who couldn't afford to buy a new bed. I called to ask him his thoughts/opinion after having used this for the past two years. He told me, \"I love it!\", and said since he started using this, he has slept comfortably, and sleeps through the night.",
      "rating": 5.0,
      "verified": true,
      "author": "M. L.",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Worth every penny",
      "text": "I would pay more for it, although I’m glad I don’t have to. This is my third time purchasing this topper. My husband had one when he was deployed, we put one in my daughters room and one in the guest room. My husband and I have a memory foam mattress that we paid a fortune for, but this topper would have been just as good.",
      "rating": 5.0,
      "verified": true,
      "author": "DMarie",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Cooler",
      "text": "only had a couple of weeks, keeps me cooler than without. But the summer is on it's way, hoping for the best End of September, helped but not as much as expected. Still woke up sweaty. Most important is the fact my husbands back feels better, this foam adds the comfort he needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Sinclair",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "If you sleep hot, this is not for you",
      "text": "I’ve had this for two years. It’s comfortable and I have it on a top of a sleep number bed. Problem is I am constantly waking up in the middle of the night hot because it retains body heat. I’ve tried sleeping with ice packs and fan going. Unfortunately looks like I’m gonna have to buy another topper of different material. I originally brought this to help with sciatic pain. It definitely helps but in process I am waking up hot.",
      "rating": 3.0,
      "verified": true,
      "author": "Maryleen Johnson",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Comfortable, but WARM.",
      "text": "I purchased this because of the promise of “no odor” upon first opening. As promised there was no odor at all! It’s very comfortable, but it’s really retaining heat. The previous pad I had stayed cool all night. Four stars for comfort, 0 stars for heat retention.",
      "rating": 2.0,
      "verified": true,
      "author": "A Yankee In Atlanta",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Buy this for a more restful sleep!",
      "text": "This mattress topper has changed my life. I've had chronic pain in my neck, back, and hips that has limited my ability to complete daily tasks. Since sleeping on this topper, I have been feeling great! I've had very minimal pain. My husband also loves it, and said he feels more rested when he wakes up in the morning. We're very happy customers.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "Very pleased with my purchase",
      "text": "Love this topper. A little firmer than expected, but I literally sink into it's loving hold. It's amazing! I've been sleeping so well. I put it on top of my Zinus Ultima 12\" memory foam mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Clark",
      "helpful_votes": 3,
      "publication_date": 20170301
    },
    {
      "title": "Cooled things down!",
      "text": "Bought a very expensive foam mattress. It was comfortable but hot. This topper has really cooled things down and now I get a great nights sleep and can enjoy my pricey memory foam mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "scubadown",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Super product!",
      "text": "This really upped the game for our bed! I thought our mattress was already comfortable but hubby urged me to buy as he was not as comfortable. It’s AMAZING!! I no longer roll from side to side or wake up numerous times a night. It’s like sleeping on a cloud!",
      "rating": 5.0,
      "verified": true,
      "author": "ALN",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Wonderful sleep",
      "text": "I can hardly believe how much better I slept. I have a very hard memory foam mattress (China) which was making my joints hurt. After only one night using this gel 2\" memory foam topper, I woke up without any pain!",
      "rating": 5.0,
      "verified": true,
      "author": "annajo",
      "helpful_votes": 2,
      "publication_date": 20170630
    },
    {
      "title": "WOW - this really cooled the bed down!",
      "text": "We have a memory foam bed that is SO comfortable but SO hot - both my husband and I were burning up at night without any covers at all. Bought this gel foam topper and what a difference! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Comfortable bed topper",
      "text": "This topper was very easy to set up. It quickly expanded to its full height within a few hours, even though the instructions say to allow for 12. I did not notice an odor that can be typical with these products. It's cool to the touch, though adding a mattress protector and fitted sheet did minimize the coolness you feel. Even so, I am so much more comfortable and cool since adding this topper.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy L.",
      "helpful_votes": 0,
      "publication_date": 20161001
    },
    {
      "title": "Couldn't get past the smell!",
      "text": "The memory top issue that we had was the smell, we did everything and still it smelled like rubber. We tried sleeping on it and it's nothing like a memory foam topper, this one dudnt bounce back as quick as it should. The customer support was great and maybe we just got a bad one but we had to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Nor'easter",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Back pain gone!",
      "text": "Weeks of back and shoulder pain are gone. No oder. Opened the package and within half an hour had it on the bed. While it is not cool to the touch, it is only slightly warm. Slept on both of my sides and my back. Extremely comfortable. Packaged well. I’ll buy another for the guest bed. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "GREAT PRODUCT!!!!",
      "text": "This is a great mattress topper! I used to manage a specially back store and we sold a similar topper but it was more expensive. We needed a new one so I bought one from a Large Department store on SALE for $300. We promptly returned it. It was too soft and we were sloping towards each other after a week. This topper provides great support, not too soft, and will hold up over time. I love this product!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna S. Clifton",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Did not help with heat",
      "text": "Not comfortable to me, and did not help at all with heat dispersion. Return policy was great and hassle free (handled by Amazon). This is a very soft mattress topper",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Rumsch",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Outstanding gel mattress topper!Best Christmas gift ever",
      "text": "I Bought this gel mattress topper for my adult grandson for Christmas 2018 and it has been incredible! . He has absolutely loved it from the moment he put it on his bed. Now 2 yrs later It is still comfortable and like new . If you are looking for a great gift for CHRISTMAS this is one I would highly recommend...PRACTICABLE and DURABLE ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "william smith",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Not any cooler",
      "text": "Its comfy for sure...but it does NOT provide noticeable cooling.",
      "rating": 2.0,
      "verified": true,
      "author": "The Robinette's",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "I am very pleased with my item",
      "text": "I am very pleased with my item. I have been a hot sleeper for years. I've tried other solutions and this topper is working well for me. I've used it for about 2 weeks and have noticed that I am sleeping for longer stretches without waking in a sweat.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheril Geist",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Game changer",
      "text": "Seriously - I had no idea how much I needed this product- until one night I truly couldn't sleep through the night. I did a random search on Google - and this item showed up. I believe strongly in the value of reviews- I wouldn't have written in otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid reader",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Used for a Sailboat V-berth",
      "text": "Ordered the queen to cut to fit over an existing V-berth mattress on our sailboat. Easy to cut with an electric knife. Didn't notice any smell. It also didn't slip and slide over the mattress which was very nice when making up the bed. The 2\" thickness was perfect since it still allowed us access to our storage cupboards. It was also pretty easy to transport. Just rolled it up, tied it with a rope and not heavy to lift and transport.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorene K.",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Hubs likes it",
      "text": "This thing really is like having a cloud around you while sleeping. My husband likes it. I was hoping this might help me with my inability to sleep, Unfortunately that wasn't the case but it's not for lack of comfort. I'd say it's great if your looking for a nice soft topper.",
      "rating": 4.0,
      "verified": true,
      "author": "Festr06",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Adding onto my review with an extra note...",
      "text": "This is a great topper! The only problem is I have to order another one. Once this top or get any kind of humidity you can say hello to your allergies. So if you have humidity in your area I suggest putting a cover on the topper before using it or storing it. Other than that it's an exceptional topper that I would not say anything else negative about. This is my second review for this topper and I still give it five stars. Just please be aware of the humidity factor. Other than that, it's a very comfy and comforting topper!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 7,
      "publication_date": 20170328
    },
    {
      "title": "Great Customer Service",
      "text": "I gave this a five star because the product was exactly as described. From the vacuum packing it quickly returned to it's original size and was very plush, no odors either. Although my husband liked it I did not find the memory foam comfortable to sleep on. They did an amazing job with resolving the question of how to work out the return. I was extremely satisfied with their excellent customer service which was very timely and efficient.",
      "rating": 5.0,
      "verified": true,
      "author": "RGibs",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "Wonderful topper!",
      "text": "I received the topper on the day promised. I purchased it for my parents. My Mom has a bedsore on her tailbone and this topper greatly relieves the pressure. Although she's not able to give me any feedback on how comfortable it is for her, she's getting a good night's sleep and is more alert during the daytime. I followed the instructions on how to carefully unpack it. I wasn't able to lay it completely flat, but no worries because the topper expanded in less than half an hour and with no noticeable odor! Thank you for a great product! I will be ordering one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Galeano",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Comfy, but definitely NOT COOLING",
      "text": "I sleep warm, and staying cool for the wee hours of the morning is really hard for me. This product made promises to be cooling that are NOT TRUE. It's very comfy, yes. But definitely not cooling. For this reason, I only give it 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Its good, when a plan comes together.",
      "text": "Ingredients for a great sleep.One Sleep by number bed , one Gel Memory Foam Topper,one mattress protector(optional)......... there goes the alarm!",
      "rating": 5.0,
      "verified": true,
      "author": "BOBTEK",
      "helpful_votes": 3,
      "publication_date": 20170417
    },
    {
      "title": "Heaven",
      "text": "Topper arrived last night, days ahead of scheduled arrival. Last night was the best nights rest thst I've had in years! It is as described, off-gassing was simple and quick. The only problem is, I do not want to get out of bed! I would recommend this product to anyone. Customer Service reached out to me twice, once with instructions for its arrival and 2nd just to follow up. Kudos!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy Geyer",
      "helpful_votes": 3,
      "publication_date": 20170307
    },
    {
      "title": "Very good educational materials, very minor initial odor",
      "text": "I've purchased memory foam toppers before. This one has less odor than any I have previously purchased. The Seller has been very diligent about emailing instructions on how to set it up and follow up email to be sure everything went OK. Very impressed with product, educational materials, and customer outreach. We'll see how it wears.",
      "rating": 5.0,
      "verified": true,
      "author": "AngelBuyer",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Two years and still loves it",
      "text": "I bought this topper for my mom as a Christmas present in 2016 she loved it said it helps with her back . It is now 2019 and she is still loving her mattress topper . My mom is 66 years old so she likes to take a few naps a day and just like to sit in bed to watch tv. Over two years and lots of use the topper is still in perfect condition ,money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "lauranichole",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "It feels great and will solve any reasons you have... to want to purchase it.",
      "text": "I wanted a mattress top that would help absorb heat. My husband and I sleep intertwined, off and on, all night. I love this product. It feels fabulous on my body..that \"ahhhhhhh\" feeling as soon as you lay down and it does absorb heat and cushions our bodies all night long.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Cardinell",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Gets better over time...",
      "text": "Updating prior review: It seems to have loosened up a bit over time. It doesn't feel like sleeping on a cloud, but the foam is pretty comfortable now and doesn't feel like a cement slab anymore. It has helped my back and hip aches. *** It feels like sleeping on a cement slab. This is night number two. I didn't have back pain last night, which is good, but this pad is so firm (not soft at all) and gets hot.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Susskind",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Very comfortable fit perfectly",
      "text": "I bought the 2\" queen to fold in half to fit an antique chaise lounge as a 4\" twin was to big and I did not want to cut it down. The queen folded in half was perfect as the lounge is only 30\" and the queen 60\" not only did it fit but so comfortable that when my husband and I lay on it we do not want to get back up.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Isenberg",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Looking for a mattress topper for a mattress purchased just ...",
      "text": "Looking for a mattress topper for a mattress purchased just a couple years ago. It has developed some changes in the surface that were affecting my back and \"new\" knees. I looked at many toppers before settling on Health Plus Prime. After receiving I allowed the topper to warm up and expand. I then put it on my bed and immediately felt positive results. Met all objectives.",
      "rating": 5.0,
      "verified": true,
      "author": "William B. Jones",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "Well Worth the Money!",
      "text": "After sleeping on it for two nights, it's heavenly. Shipping was SUPER vast, and I had no problem expanding the topper (just a few hours left alone on top of my bed did the trick). The topper does not get hot as the gel effectively disperses the heat. The topper provides an awesome amount of padding/cushion, and really is a great value for the price-- similar items go for $200+.",
      "rating": 5.0,
      "verified": true,
      "author": "Dakotah Hogan",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Not good",
      "text": "It did not meet the expectation. It is just a memory foam topper. I am so disappointed i thought it will be good in hot summer days but its totally not worth it. Its not even a month and its sagging. I don't know how to return this product",
      "rating": 1.0,
      "verified": true,
      "author": "Nadia",
      "helpful_votes": 2,
      "publication_date": 20180703
    },
    {
      "title": "Just what we needed to get a few more years ...",
      "text": "Just what we needed to get a few more years of our mattress, which is too hard for our liking. This topper is totally worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "VickyP",
      "helpful_votes": 3,
      "publication_date": 20170324
    },
    {
      "title": "I do not recommend.. sorry 🥺",
      "text": "I have tried it for more than a month... Not a fan. I have wasted my money on getting two of these. I do not recommend",
      "rating": 2.0,
      "verified": true,
      "author": "Dori",
      "helpful_votes": 0,
      "publication_date": 20190911
    }
  ],
  "product_meta": {
    "title": "Gel Memory Foam Mattress Topper, Plush Queen Size 2 Inch Thick, Premium Gel-Infused Memory Foam Mattress/Bed Topper/Pad for a Cool, Conforming, and Comfortable Sleep. Made in The USA",
    "description": "Size:2 Inch| Color:BlueMADE IN THE USA. Looking for a better nights rest? Tired of your old worn out mattress causing you to toss and turn? Want to add comfort without the expense of a brand new mattress? We know the feeling. That's why we developed a gel infused memory foam mattress topper so comfortable, you'll forget you ever had sleeping issues in the first place. Our memory foam gel topper ships in a box directly to your door eliminating the need to deal with the hassle of crowded stores and pushy sales people. Our toppers are 100% made in the USA using eco-friendly materials designed to provide you with years of superior sleep comfort.\n\nTHE PERFECT SLEEP TEMPERATURE. Traditional toppers have a bad reputation for holding body heat. We all like to sleep in a warm and cozy bed, but too much trapped body heat can make you very uncomfortable. Our innovative gel technology features an open cell structure design that sleeps cooler than a regular memory foam topper, minimizes stiffness, improves air flow and dissipates unnecessary heat providing you with the perfect mixture of warmth & cool comfort.\n\nSUPPORT. Our unique blend of memory foam gel offers just the right amount of support. Relieve pressure points & revitalize your muscles, joints and spine alignment with our anti sinking design. Enjoy a peaceful night's sleep with minimal disturbance from tossing & turning significant others, kids, or pets. Our memory foam support design absorbs movement providing anyone or anything in your bed the perfect amount of support & softness.\n\nWARRANTY AND MONEY BACK GUARANTEE. Made in the USA, we stand by the quality of our products. We offer a 60 Day Money Back Guarantee & a 3 Year Manufacturers Warranty. If you have a problem or want to provide us with feedback, feel free to reach out & connect with us. \n\nPlease Read Before Purchasing\nThis product isn't for hot sleepers and will not help with night sweats or hot flashes.",
    "rating": 4.3,
    "feature_bullets": [
      "COMFORTABLY PERFECT. You deserve a better night's rest. Add an extra level of comfort to your existing mattress with our plush medium-soft 2 inch Gel Memory Foam Mattress Topper. Our innovative gel foam mattress topper queen helps to relieve pressure points, relax muscles, help spinal alignment and enjoy minimized motion transfer (for those of you with restless sleeping partners, pets and/or kids).",
      "MEDIUM SOFT, COMFORTABLE & THE PERFECT FIT. Our open cell structure design includes an innovative gel mixture helping to prevent heat accumulation and provide a cooler sleep experience compared to conventional memory foam toppers. Our Gel Memory Foam Mattress Topper Queen Size measures 79 x 59 x 2 and  is sized slightly narrower than your mattress, in order to accommodate snug placement of your fitted sheet.",
      "USA MADE CertiPUR-US CERTIFIED FOAM - Our Gel Mattress Topper is produced right here in the United States in accordance with CertiPUR-US.  You can rest easy knowing our gel memory foam is safe, non toxic and environmental friendly. It’s also odorless. It’s a complicated process, but our toppers don’t have a lingering, off putting smell. Simply allow the compressed topper to fully expand for 24 hours allowing the new foam smell to dissipate.",
      "PRESSURE RELIEF. Our gel topper distributes weight evenly, perfectly molds to your body and conforms to curves relieving pressure points and ads the perfect amount of medium range softness and plush support to your existing mattress. It's designed to soften any sleep surface and built to last. Save money, prolong your mattress life and get the quality sleep you deserve",
      "WARRANTY AND MONEY BACK GUARANTEE. Made in the USA. We stand by the quality of our luxurious products. We offer a 60 Day Money Back Comfortably Perfect Guarantee and a 3 Year Manufacturers Warranty. Our customer service representatives happily take care of all of our customer's needs. We’re here to help you do one thing, experience a better night’s sleep, contact us anytime!"
    ],
    "specifications": {
      "Item Weight": "13.67 pounds",
      "Product Dimensions": "79 x 59 x 2 inches",
      "Item model number": "COMINHKPR111457",
      "Is Discontinued By Manufacturer": "No",
      "ASIN": "B01GICXD9I",
      "Customer Reviews": "4.3 out of 5 stars1,449 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#16,705 in Home & Kitchen",
      "Date First Available": "June 2, 2016"
    },
    "categories": [
      "Home & Kitchen",
      "Bedding",
      "Mattress Pads & Toppers",
      "Mattress Toppers"
    ],
    "price": 79.95
  }
}