{
  "website_summaries": [
    {
      "verdict": "A compact and portable option for pet’s water needs during trips or long walks, these sturdy silicone bowls are very convenient at their price point.",
      "pros": [
        "Simple to open and close, and compact enough to carry along on dog walks",
        "Holds its shape when open",
        "Easy to clean"
      ],
      "cons": [
        "Gap between rim and plastic is hard to clean",
        "Bowls are smaller than some owners expect",
        "A few reports of bowls or carabiner clips breaking after a few uses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "What is this??? A bowl for ants???",
      "text": "This is a set comically small cat bowls. Do not buy for any dog not considered small/toy sized. Cheap, smelly product from china.",
      "rating": 1.0,
      "verified": true,
      "author": "DebT",
      "helpful_votes": 7,
      "publication_date": 20180709
    },
    {
      "title": "Wonderful!",
      "text": "LOVE the bowls! Smaller than I expected BUT still perfect for my 6lb pup & my 20lb pup.They are just big enough to give your fur baby some water/food on the go! Heaven sent for walks! We took one with us on our walk yesterday and they easily clip on to my pants or whatever leash I have! Real easy to stop and give the babies a quick sip ! Not heavy at all.. easy to collapse.. nice material! Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Coco H.",
      "helpful_votes": 4,
      "publication_date": 20171030
    },
    {
      "title": "Really handy to have for dog walks",
      "text": "Such a simple idea but these are great to have. I love these and how easy they are to carry around. I drink a lot of bottled water so its easy to just pop one up and pour some into it so my dog can drink too. Then just dump out the water when done and pop it back down. I keep one in the car and the other in my dog-walk bag. Nice and sturdy plastic with no odd smell.",
      "rating": 5.0,
      "verified": true,
      "author": "ImBradWTop Contributor: Pets",
      "helpful_votes": 6,
      "publication_date": 20170505
    },
    {
      "title": "Perfect for travel",
      "text": "We just got a new puppy after several years of not having a dog. We got rid of most of the dog items from the past. So shopping for new items was very interesting to see what new things are available. These are very easy to use, they hold up well, and make it very easy to travel. They are a perfect size and come with a nice bag to keep them clean and organized. We love them. And the colors are fun. The clip has been very handy to attach them to a belt-loop, leash, or backpack. Great item!",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Simonson",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "they still smell like rancid plastic and chemicals",
      "text": "They are much larger than I had hoped, and smell AWFUL. Even after taking them out of the package for a week, they still smell like rancid plastic and chemicals.",
      "rating": 1.0,
      "verified": true,
      "author": "Hanna Danecker",
      "helpful_votes": 6,
      "publication_date": 20170522
    },
    {
      "title": "Wonderful product",
      "text": "This is perfect for when I walk/jog with my dog. I clip it to the chained section of her leash and it doesn't seem to bother her. She weighs about 40 lbs, and in one outing we typically jog 2-3 miles. If I fill this halfway, it is enough water to satisfy her when we take a break. I used to let her catch the water from the bottle or try to let her drink from my hands, but this is much more convenient. The second one will be for the new puppy once she has had all her shots and can go for walks.",
      "rating": 5.0,
      "verified": true,
      "author": "VanessaF",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Great travel bowls",
      "text": "Bought these when I was flying with my dog recently to give her food and water during our layovers. These worked out very well. I was able to keep them in a pocket on the end of her soft sided carrier inside the small nylon bag they came in. Right size to give a small dog water or food, and I could adjust the size I wanted. I also used them when we were moving from one state to another to give my dog water when we had rest stops and didn't have to pull out the larger water dish.",
      "rating": 5.0,
      "verified": true,
      "author": "ScubaReader",
      "helpful_votes": 2,
      "publication_date": 20180105
    },
    {
      "title": "Great Traveling Bowls for Medium-Sized Dogs!",
      "text": "This is my second set of these little bowls. Gave my first set away to someone who liked them. The fact that they fold flat makes them so handy to keep in the car when traveling with my 25# dog. On long-distance treks, I ask for a cup of water whenever I stop at fast food places along the way, then empty it into one of the bowls so my pup can have a nice cold drink. Stopping at motels, it's very easy to dump his food in the other bowl so he can eat with ease. A quick rinse afterwards, back in the luggage, and we're set to roll the next morning. Fast and efficient transaction with vendor.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Frisco",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Great for on the go",
      "text": "Great for on the go! We got the two pack and keep one up in the master bath and just refill every night before bed in case Bella (a 4yr old GSD) gets a little thirsty. The second is clipped to our day pack for long walks or days out and about with her. It's just big enough for her to be able to comfortably drink and we carry a 20oz water bottle to fill and refill it. Anything she doesn't drink we pour back into the water bottle until we either get home or get the chance to refill it from a safe source.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat-Lynn",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Great Bowls!",
      "text": "I have (7) dogs.. I know but don't judge me! Anyway we do take them places and these bowls are extremely convenient! We've had the small metal bowls and the downside to those is the rubber on the bottom wears off and they keep food very cold especially from the frig. We make our own dog food so it is healthier for them so naturally we store it in the frig. Dogs don't like cold tasting food and it takes so long for the food to warm up in the those bowls. This is another good point for using these silicone bowls instead! LUV them",
      "rating": 5.0,
      "verified": true,
      "author": "KCee The Animal LoverTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Great for Chihuahua",
      "text": "I use these for so many things. I keep one in my car so when I take my dog anywhere, I always have a water bowl for her. I also use them when traveling as they can be packed so easy for both food and water wherever I'm staying. I hike and backpack a lot and my chihuahua goes with me. I can easily attach one to my backpack and stop to give my dog water easily.",
      "rating": 5.0,
      "verified": true,
      "author": "booklover",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "perfect size for keeping in car",
      "text": "Love the set of bowls that flatten easily into a packet and slide most anywhere in the car for easy access to feed and water our beagle mix. Large enough to fit the 3/4 c food we feed her twice a day, and great for keeping water in the car while she waits for us or when we go to the park or in a room when visiting other places. We really like them",
      "rating": 5.0,
      "verified": true,
      "author": "Dianna Douglass",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Folds flat and easy to pack, great size for a cat",
      "text": "These bowls are perfect to put in my cat’s fire evacuation bag. I hope not to have to use them but glad to have them and the pouch is nice. The two clips aren’t necessary for me but I showed them because the green one has a very sharp piece of metal sticking out. So inspect them carefully if you plan to use them. It is actually broken so I will toss it. I would buy these again anyway. Perfect size for my kitty. Priced well! Pet store was outrageously priced. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "LALady",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Beware- can’t return",
      "text": "These bowls are so small we laughed when we opened the package. They won’t work for my 60 lb lab, and unfortunately Amazon won’t let me return. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Hilary",
      "helpful_votes": 2,
      "publication_date": 20190202
    },
    {
      "title": "Perfect size!",
      "text": "Bought this with the intention of using it this summer. One of my puppers had surgery and was having some difficulty in moving. Was able to keep him hydrated with using these. Not so big that he would stumble into it, but large enough to get a good drink. Really the perfect dimensions! Came in a pouch for transport. Our veterinarian gave us one of lesser quality upon joining a care club that was shallower but larger in diameter. It was a mess every time we used it. I think they'll get good use of it when we go for longer walks as the weather improves.",
      "rating": 5.0,
      "verified": true,
      "author": "Jinxie",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "My Big Dog is Happy to Drink Out of This",
      "text": "I needed an easy to carry bowl for my GSD on our walks. I use a backpack water system for myself, and I carry a bottle of water for my dog. He's a big dog, but doesn't need a big bowl. I hook the bowl on the belt that holds the water bottle and my phone and ID, and it doesn't get in the way. I'm thinking of putting the second bowl in my purse when I go to movies with my husband. I like to limit my popcorn intake, and this bowl is about the right size.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Spencer",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Great for a really small dog",
      "text": "We have a large breed dog, she can empty the water bowl with a few slurps. Her food won't even fit. Picture is deceiving these are tiny! Haven't even used them. However, if your Chihuahua or toy breed needs collapsible bowls these are perfect.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. MomTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Great value --- good product.",
      "text": "I live in a really hot part of California and I got these bowls to take along with me on walks that I take with my dog. (Of course I also bring along a bottle of water --- and I only need one of the bowls.) I latch the bowl onto my fanny pack and it's really no weight at all and not cumbersome. I can then expand it when my dogs gets thirsty. Comparing prices to Petco, this is a great buy and good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Bridgewinger",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Nice for tiny dogs",
      "text": "Tiny cups actully. Will work for travel in stroller or travel carrier for tiny pup. You might want to keep a hand on them while feeding. They seem sturdy, fold nicely, and come with travel bag. All nice pluses. I've not tried them with my dog yet. She is a medium size hefty girl and these will hold one bite for her. But, I put them in her stroller's basket for emergency and convenience use.",
      "rating": 5.0,
      "verified": true,
      "author": "CrazyBird",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Very travel friendly and quiet",
      "text": "Quite stable and not easily knocked over. Can be adjusted to have 2 different bowl depths. It has been useful because my cat has seizures triggered by certain noises, and this silicone bowl has definitely minimized the noises of his kibble rattling around in his bowl compared to his old glass/metal bowls in the past. Very travel friendly as well, even comes with its own little carrying pouch and clip",
      "rating": 5.0,
      "verified": true,
      "author": "Vi",
      "helpful_votes": 2,
      "publication_date": 20171223
    },
    {
      "title": "The material is very sturdy, and my cat already loves them",
      "text": "Just got these today, and they are really handy. They fold up completely flat, but bump out to be nice-sized dishes for a small cat or dog. The material is very sturdy, and my cat already loves them. It did have a very faint plastic smell when you first open them, but as soon as I washed them, it was completely gone. I'm ordering another set to keep in the car, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Good in theory, low quality product",
      "text": "The inside of the pink bowl started changing color and I'm not sure why.. The rim came off as well. Without the rim the travel feature doesn't work and the bowl is no longer sturdy. Was good for a couple months and that is it. Wouldn't buy again, better products out there.",
      "rating": 2.0,
      "verified": true,
      "author": "Sleeplesshachi",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Awesome little travel set of bowls!",
      "text": "Love this little travel set of dog bowls! Besides packing flat and being easy on the wallet..there were some very nice touches.... 1. The hole where the carabines hook into is a liitle heart! So cute! 2. The carrying bag is a perfect fit...with a little extra room. Great product that completes my travel bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Big Dog",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "easy to carry around, great product",
      "text": "we use it all the time when taking our dog to the trails or to the beach. instead of carrying a bottle for the dog, and wasting a lot of water feeding her, this collapsible bowl is so much better! it's also very sturdy, we are still using the first one, not touching the second one in the same package yet. only complaint is that the little hanger that comes with it isn't in good quality, broke after 2 uses. the bowl itself is perfect. recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherrie H.",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Good Water Bowls",
      "text": "I love these water bowls. The little bag they come in is really handy too. We just attach it to the leash on walks/hikes/etc. One of them broke pretty quickly, but that probably was our fault. They're sturdy enough and hold a decent amount of water. They're super lightweight too.",
      "rating": 4.0,
      "verified": true,
      "author": "Luke Spiker",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "TOO SMALL!",
      "text": "I ordered a large and received a large but they are very small They are okay for a quick trip to the doggie park for 1 gulp if you have a dog that's over 35 pounds. Not worth sending them back and I do like the collapsible Bowl and the material but I am now searching for a large flexible Bowl! I do not recommend... there wasn't an option to order an extra large!",
      "rating": 2.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Great product.",
      "text": "This work fantastic for portable water bowls for your pup when walking/traveling, etc. Can expand and de expand as needed. Easy to clip onto your dogs leash for easy travel when walking, or fit into a pouch/bag when traveling to use as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly A. Krow",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great quality and easy to use",
      "text": "Great quality and easy to use. My dog is small (about 10-11 lbs) and its perfect size. I usually don't expand them all the way out and its perfect size. It would also work for a medium sized dog too. I have brought these with me traveling and to walk around my neighborhood. I love that they collapse, so they're easy to pack in any bag and they come with two clips- which makes it easy to put on my dogs leash when he head out for long walks. Worth the investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Rayell Grayson",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Durable",
      "text": "Bought two sets to have one everywhere. We actually used these fir almost a year before buying real dog dishes .. so that tells you how durable they are ! Easy to clean , pops up to 3 adjustable heights . 5”wise and can adjust from a 1” height almost to 3” height . stores flat , clips to anything in a walk or for storage . Great product",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Perfect!",
      "text": "We toss them in our cars and have instant water bowls for wherever we are. Use at the football park, hiking, etc. Our girl goes everywhere with us so having slim collapsible bowls are quick and easy to take, set up and store.",
      "rating": 5.0,
      "verified": true,
      "author": "WestEastWest",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Convenient and colorful",
      "text": "Easy to clean but love the overall easy collapsible bowl and easy way to carry or have extra . We travel alot with our pets and this is very easy to pack away or just latch to they're crateand not forget it . Have used it for water only since food smell might tend to stay sometimes but over all Like it :) and the colors help to know what bowl belongs to who .",
      "rating": 5.0,
      "verified": true,
      "author": "Drey",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Perfect for the car",
      "text": "I bought a new car that's a lot smaller than my last one. In my old car, I kept a regular bowl in the back where the spare tire goes, but I simply didn't have enough space for it in the back of my new car. This is perfect since it takes up almost no space, but still allows me to have a food and water bowl for my dog!",
      "rating": 5.0,
      "verified": true,
      "author": "ND Marshall",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Love these!",
      "text": "Our 20 pound basenji mix goes everywhere with us. These bowls are the easiest and most convenient option for giving him a drink that we've found so far. The soft-sided collapsible water bowl was too deep for him and he didn't like having to stick his nose in so far, and the squeezable water bottle with the attached water bowl on top tended to leak in the car. These are lightweight and fold compactly. I ordered extras for several of my dog park friends and have had no problems with any of the clips or any odor. I think they're great!",
      "rating": 5.0,
      "verified": true,
      "author": "Liise E",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Perfect for on the go",
      "text": "These bowls are so handy for when you're on the go. I used it several times over the weekend for my own dogs and some rescue dogs at an event. At first I was a little concerned because they are on the smaller side but honestly it was perfect, I even clipped it on my purse and was able to go without it bothering me. Its absolutely perfect and takes us such little space that you forget its there.",
      "rating": 5.0,
      "verified": true,
      "author": "svs",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Does what it should.",
      "text": "I got these for my service dog. Mainly for water. I left it on the end of the leash for awhile until it kept breaking. Now I carry it In my pocket. Used for dog water in public places. Sure wish it was made with tin instead of plastic. I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Kare R.N.",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "great protable bowl",
      "text": "I needed a way to provide my best friend a drink during our long runs in the warmer months. These bowls work perfect. I just slide one into my running belt and off we go. Take it out and pop it open when she needs a drink and then off we go again. works great and pretty durable. However lost the clips that came with both....",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Good product!",
      "text": "This was a good buy for traveling with my puppy and will still be useful even when he gets bigger. I was surprised by how sturdy these bowls are! The silicone cups are fairly thick and have a hard plastic rim. Easy to use and came with an unexpected storage pouch that is also SUPER handy! Love it!!!! :))",
      "rating": 5.0,
      "verified": true,
      "author": "Surfergurl",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Easiest way to get your dog a drink on the go",
      "text": "This dish folds almost completely flat, making it really easy to stuff in a backpack or even a fanny pack. It comes with a hook so that you could clip it to a belt. It's not very big--holds maybe two cups of water, but the convenience makes it worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "4.5 Stars",
      "text": "great little bowls for smaller dog or cat. The clip that comes with them was broken for one of the bowls and is cheap; would use the clip to hang on back as they are cheap - but the bowl lays flat and fits just fine in even just a water pack. Also comes with a little bag to put the bowl in. Would totally buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "zarllc73",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Works well.",
      "text": "The two bowls work exactly as they are supposed to. They fold flat and when opened they become a sturdy, if a little light, bowl for water. I personally will use it as a travelling shaving mug for which it works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Saul Nathanson",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "I take those everywhere",
      "text": "I keep the green one in the car, and the purple one in my hiking bag. It is made of good quality material, easy to use, comes with one nylon carrying case (convenient to throw in my purse when we go to a restaurant). I run it through the dishwasher a couple times a week and we're ready to go again!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurence L.",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Great for traveling",
      "text": "These bowls are great for traveling with my dog. The pop to small size of little bigger. Once they are closed they don’t take up any space in my bag. The bowls aren’t that sturdy but for traveling they work great",
      "rating": 5.0,
      "verified": true,
      "author": "Tyann Woodall",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "These are great. Compact",
      "text": "I hike with my dog a lot. These are great. Compact, lightweight, and they come with 2 carabeaners, so you can clip them to your belt/backpack while outdoors. They also come with a great little drawstring bag. Perfect for taking quick breaks while on a hike or car ride! The only con is that you can't choose the color (they come as purple and green).",
      "rating": 5.0,
      "verified": true,
      "author": "GJ",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Skip the overpriced pet store bowl, get this",
      "text": "I got ONE collapsible bowl at Petsmart for double the price and half the size. Needed it in a pinch as we were taking the dog to the beach. I bought this set a few weeks later so that she could have a food bowl for camping, and am highly satisfied. Comes with 2 bowls and 2 D-rings so you can hang off your backpack (or in your pantry as I do lol). Cannot remember if they are marked as dishwasher safe, but I have been washing in the top rack with no issues. Shipping was very fast--could be because I live a couple of hours from a fulfillment center, but definitely arrived a day early.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Little",
      "helpful_votes": 7,
      "publication_date": 20170425
    },
    {
      "title": "Practical if you don't mind refilling often",
      "text": "Got these because my dog no longer want to drink from the bowl other dog use at the dog park. Light weight and practical to carry around, It's a very small but if used for water is not a problem as long as get refilled when the dog needs more water. I haven't use it for food.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Great Water Bowls for my Dog!",
      "text": "Great Water Bowls for my Dog! I bought 2 when I first got my puppy 3 years ago, but needed more because I lost one. There is always at least one bowl in my Jeep and one in my doggie pack for picnics. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy C.",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Very durable",
      "text": "We use these as water bowls almost every weekend. They collapse all the way closed. The carabineer allows us to hook it on the outside of our hiking bags so we can grab it quickly instead of dig around for it. We've had them for about a year and they look brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Perfect for travel!",
      "text": "I go between houses for work and I take my little guy with me, so these are essential. The clip did break randomly on one of the bowls but that doesn’t really matter. These are really nice and fold up pretty flat. The baggie they come with is great too. In summer they’re good for bringing in my bag on walks so I can give him water too.",
      "rating": 5.0,
      "verified": true,
      "author": "sammfak",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Great for travel",
      "text": "We drove cross-country non-stop for 2-1/2 days and brought poor kitty with us. Using a pair of these for her food and water made the logistics simpler. We still use them at home. A couple of answers to unrelated questions: --Yes, she was sedated (vet prescribed her something to alleviate anxiety). --The cat box was located on the floor behind the passenger front seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Greenwell",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "a little stiffer than expected for silicon",
      "text": "These are great dishes for hiking with our 9 pound dog. I like that you can clip them onto a backpack, belt loop, crate, etc. These are a good value but they are not as soft and as flexible as a previous collapsible bowl that I lost. Seem to have more of a plastic and silicone feel than a the soft silicone I expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Handy for travel",
      "text": "I keep these in my car for when we bring our puppy out with us. It's great that they fold up so nicely and have a carrying bag. However, the only downside is that they are easily knocked over since they are smaller on the bottom. Many water spills have occurred due to this.",
      "rating": 4.0,
      "verified": true,
      "author": "EVALSWA01",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Keep in the car, for emergencies!",
      "text": "Great to keep in the car, for emergencies, as you can get bottled water anywhere, but you can’t always easily get your dog to drink it, without wasting it. I also gave as gifts. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "YM",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great buy, great cost, great colors",
      "text": "Purchased for my puppy to take when we travel. She's now a year & a half. We still use these bowls. I love the colors! They're great to pop out at the airport or to take to her sitter when I have to board her.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. TiTi",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "I like them so far.",
      "text": "These just arrived and have a slight odor. I'll have to see if it goes away after they are washed. They open and close easily. I had thought the photo that included the folded bowls indicated that lids were enclosed as they look like different colors, so I was mildly disappointed.",
      "rating": 4.0,
      "verified": true,
      "author": "PRBC",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "and could better control quantity than I could with tupperware or some ...",
      "text": "These bowls made traveling by plane and car with my dog a dream. I never had to worry about food or water spilling, and could better control quantity than I could with tupperware or some other sort of vessel. The silicone made them easy to clean, and the carabiner that comes with each bowl made it easy to latch onto our travel bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra K.",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Smelly",
      "text": "These have a really strong chemical smell. Not like a normal silicon smell but something much more abrasive. I have them opened up and am trying to see if the smell will dissipate. Not going to use them if the smell stays. They smell toxic.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Cute collapsible bowls",
      "text": "These are great little travel bowls. They are the perfect size for food for my dog. The bowl is small for water, but only if it was for home use. As travel bowls, they are just fine. They fold flat and even come with a little drawstring carry bag.",
      "rating": 5.0,
      "verified": true,
      "author": "WickedCanuck",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Skid Proof and Holds Water Well",
      "text": "I thought these would be a little bigger, hence only 4 stars. But these are great as they fold up nicely for traveling. They have skid proof bottoms, and hold water very well. Plus the price was nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Beth H Malbon",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Bad Customer Service",
      "text": "Product is great. The included storage bag is a great addition, and makes for a good value. The seller unfortunately was not helpful. A price decrease occurred after placing an order, and the seller would not credit the difference.",
      "rating": 1.0,
      "verified": true,
      "author": "Freddie",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Teeny!",
      "text": "I was shocked at how small these were (my fault, as the measurements are given). They are 5 inches in diameter from the outside edge (so really just 4.5 inches for a dog's face). Any animal bigger than 20-30 lbs is going to need a bigger bowl.",
      "rating": 3.0,
      "verified": true,
      "author": "Neal Corkery",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Portable and handy!",
      "text": "Came in handy during a trip to Utah (from Cali). Portable, well-made and comes with clips that I clipped in the car or my backpack. Easy to clean. No complaints! Size is perfect for 7lb Chi/JRT mix and can even expand to a larger maybe 30-50 lb dog. Bottom is slip resistant.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris S.",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Functional, effective. Durable",
      "text": "Excellent little bowls for adventures w my corgi. Nothing to fancy. Fold down somewhat compact . I imagined them to be lighter more flexible and more compact when I ordered them. But they work perfectly and I would reccomemd them to people who brig their dogs everywhere. I would get a larger size for a bigger dog such as my mothers labs",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua B.",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Great travel/outdoor fun bowl set!",
      "text": "These bowls are wonderful! We took our beagle to the beach and brought along some bottled water and a baggie of food. When they're hooked together, they stay surprisingly stable - even on the sand. They collapse easily and almost completely flat so they fit into the little carrybag easily. I highly recommend this bowl set!",
      "rating": 5.0,
      "verified": true,
      "author": "Dondi",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Works Great 👍 very convenient!",
      "text": "Love these bowls... I clip one on me every time we go for a walk, park, river or the beach. Now if I can just find a place to put the water bottle, I'll be good to go...My doggy loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivy",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Perfect for little dogs on the go!",
      "text": "These are great when you take your dogs everywhere. Don't take up much space and always have something available for water or snacks for the babies. I have Italian Greyhounds, you may want to purchase a larger one if you have big dogs. It's perfect for little dogs",
      "rating": 5.0,
      "verified": true,
      "author": "LilSoph",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "These travel bowls are great",
      "text": "I have an 80 pound German Shepherd and Siberian Husky and while the bowls were smaller than I anticipated, they work great for my dogs due to the fact that I throw their water out right after drinking because of their slobber. I love the colors, I have a boy and a girl so the light purple and green are perfect. I also like the portable bag that protects the bowls so they’re not exposed while hanging on our water bag. My dogs have no issue drinking, but I wouldn’t recommend for food for large dogs like them.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica ",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Perfect for travel!",
      "text": "Love love love these collapsible bowels! I used them while moving across the country and they were easy to pack and cleaned very well, even with wet food. I though my cats may be a bit picky with eating/drinking out of a bowel with this texture vs. the metal eating and drinking bowels they are used to but they didn't have a problem with it at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarahbish",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Happy with my order",
      "text": "Perfect! My expectations are always lowered buying online but this came as described with everything it was suppose to. 2 bowls and 2 clips. This is perfect to keep in the car in glove compartment while not having to travel with a standard bowl taking up space. Would purchase again. definitely a must have for any pet owner!",
      "rating": 5.0,
      "verified": true,
      "author": "Ely",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Perfect for runs with my girl",
      "text": "Got these for my 55 lb little girl. It is convenient to attach one to her leash for our runs. Very cool how it pops up into a bowl and big enough for her to drink out of. She gets excited when she sees me grab it before walking out the door (she knows what that means 😉).",
      "rating": 5.0,
      "verified": true,
      "author": "RG",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "small, portable and hold up well.",
      "text": "This is the 2nd set of these I've bought. They're inexpensive and hold up quite well. They fold down so seamlessly and then I clip them onto the leash, my key chain or my backpack. They come with a cute little drawstring bag as well. I keep the spares in my car in the little bags that come with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Neruda",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Works perfect for me",
      "text": "A lot of people here say these bowels are to small but for me there perfect! I run with my two dogs(a husky and a shiba/husky mix) and I just attached these to my water backpack and give them some water two or three times during our 3/4 miles. Been using them for about two weeks, no sign of breaking or tearing. I read a comment that the carabiner broke on someone, mine are fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah S.",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Love these",
      "text": "These are so convenient! I use them every single time I take my dog to the beach or hike or anywhere really. It's nice to be able to just bring this and fill it with my water bottle as needed. Also there's two so you can use one for food!",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Very convenient",
      "text": "I keep one in my car and one in my dogs backpack. It always comes in handy on those days we're off running errands. I can always give her water without trying to hold a huge McDonalds cup at an angle for her. I just put it in the middle cup holder and it sort of fits. She hasn't knocked it over yet but I'm not driving when I do it.",
      "rating": 5.0,
      "verified": true,
      "author": "Evan M.",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Gulp gulp lol",
      "text": "Great product, will but again...kinda need to, she lost both her bowls due to the caribeanors not holding up to hiking. I have no complaints though, except the company needs to get better caribeanors or just swap out w better ones when you receive it.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "These are really small",
      "text": "These little bowls might be perfect for a chihuahua, but they don't work for a big dog. I should have dug deeper and found the diameter. I'm giving them away.",
      "rating": 2.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Perfect for my small dog",
      "text": "When I opened their package I knew they were perfect for traveling with my little Maggie. They came with hooks so I could hook them to her carrier and even a little pouch I can carry them in if I want to.",
      "rating": 5.0,
      "verified": true,
      "author": "Lo",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Pet travelers convenience",
      "text": "These are so convenient to have for traveling especially where there are hooks on them so you won’t loose them. They collapse right down when done and have a bag to keep them together in when not using them...I’m planning on another set for my cat 🐈😊🌟🌟🌟🌟🌟",
      "rating": 5.0,
      "verified": true,
      "author": "IR",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Cute Travel Bowl",
      "text": "This bowl is good for a traveling pet or camping. I would not suggest this for a large breed dog though as it is a small-medium size. But for smaller dogs and even cats it's great!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephiecat",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Perfect for keeping in the car",
      "text": "Works great. I keep one in each of our vehicles. They are a little smaller than I was imagining but they take up less room that way. But they work great for my golden retriever! Can’t beat the price either!",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Perfect for travel",
      "text": "They function well. You could use this for a thing you need a small bowl for, but it's great as a dog food/ water bowl combo. We've been on so many road trips with these already and it's so convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikyj",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Perfect size!",
      "text": "I was worried these might not be big enough, but they are perfect for walks with your dog. Easy to smoosh flat, clip on and carry, and pretty sturdy when popped out and set down. Happy dog mom!",
      "rating": 5.0,
      "verified": true,
      "author": "BoyMom",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Great for travel",
      "text": "These work really well for hiking with the dogs. Easy to clean and light weight. We did have to replace the carabiners after a few uses, but other then that, they have held up great.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie H",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Another hit",
      "text": "One of many items that I have purchase for my favorite two for legged neighbors, Baxter (a Catahoula Cur) and his brother Oliver (Jack Russell Terrier) while at the dog park or just out for a walk in the neighbor hood to help them beat this VA heat.",
      "rating": 5.0,
      "verified": true,
      "author": "T BABY N VA",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "small collapsable dog bowls",
      "text": "These are perfect for what we wanted. They clip either on the dogs collar or my belt loop. They are sized right for our small (14 lbs) dogs for water or food. They are light but sturdy. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "P. shiman",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Love!!!",
      "text": "Love to take the dogs to the park, this made it even easier. It clips onto the leash and folds flat so you dont have to carry more items. Dirt rinses right off of it and it's pretty sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Bri Wiley",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Agua on the go",
      "text": "Great for the car and on the go. Got one for each car. Love that it came with a bag. Would’ve been nice if it had two for each bowl. It works and the pups use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Andeland",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Good bowls, crappy carabiners.",
      "text": "4 stars for the bowls, minus 2 stars for the crappy carabiners. I know the bowls are the main thing you are buying, but if they are going to include carabiners at least include ones that work. Both carabiners broke the first time I tried to attach the bowls to something.",
      "rating": 2.0,
      "verified": true,
      "author": "SurfinSD",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Perfect Pet Travel Bowls!",
      "text": "These collapsible pet bowls are perfect for traveling with our dog! They are so handy with their included carabiners which allow one to clip them to the kennel or crate and not lose them. They are easy to clean and are a great size for food or water. They seem to be of good quality, and were the perfect solution for us.",
      "rating": 5.0,
      "verified": true,
      "author": "will_annie",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Very small but handy.",
      "text": "Work great but are VERY TINY. not really for full size dogs. I have a boxer and he can drink all the water in seconds out of this bowl. I guess it would be good for little dogs or a quick drink for bigger dogs if your jogging or hiking etc.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Powell",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "A dog parent must need!",
      "text": "These are SO great for travel! We love to hike, and with the little clip it's easy to attach to a belt loop or your dog's harness. I bring one for water and another for kibble. I keep a few in all of our vehicles, too, just in case!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan maxwell",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Great deal fast shipping perfect size",
      "text": "Awesome price even came with a bag to put them in and a fab to attach bag to your keys or such. Dog travel approved by my chiweenie",
      "rating": 5.0,
      "verified": true,
      "author": "C.",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Perfect for travel.",
      "text": "Bought the small one for my Boston Terrier when we went on summer vacation. I loved the ease and the small space it took.",
      "rating": 5.0,
      "verified": true,
      "author": "Ace81",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Poor quality",
      "text": "The keychain piece broke on our very first outing. I've had these before, but forgot one when we were out once and had to repurchase. Definitely made a mistake in purchasing this brand.",
      "rating": 2.0,
      "verified": true,
      "author": "c-bert",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Cute!",
      "text": "Cute, useful, durable, and I love the clip!!!! I can keep this in my purse when I travel with my dog. It folds up small and flat. I also can put in my pocket or on my belt clip while out on a long walk. Great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer LAN",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Nice little bowls for traveling",
      "text": "So far have only used for watering puppy on road trips but I think they'll come in handy for camping and other travels",
      "rating": 5.0,
      "verified": true,
      "author": "LVAkker",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Great little bowls! Good value",
      "text": "These are perfect collapsible bowls! I have one for in my doggy's car seat and one in her stroller. Love the little clips that came with them too! I haven't gotten a photo of her with the bowls. Will soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Brain_Sick_Monkey",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Great for camping/traveling with my dog.",
      "text": "Bought and used these for my dog for a recent camping trip. I didn't want to pay $10 for one at the pet store and found this deal for two. Very easy to use, wash and store. Worked perfect. Love the clip each one comes with to attach to backpack etc...",
      "rating": 5.0,
      "verified": true,
      "author": "NaturalGinger",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "I totally recommend these...",
      "text": "These bowls are perfect. I like the way they flat pack for use in my dog's \"to the park\" small tote. We also keep one in our other vehicle, just in case. I hand wash them when needed - only because I want them handy. These are great gifts for family and friends with animals. I am buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "KAREN K.",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Excellent value",
      "text": "I've now been using these regularly for more than a year. My dog and I travel alot and these are perfect. I will also clip one to her carry tote or pop one in my purse for daily excursions so she has a drinking bowl. The quality is excellent. I wash them by hand or in the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie A. Pelletier",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Great product for a great price",
      "text": "Great product for a great price! These are super convenient when we take the pupper outside for long periods of time to the kids events, baseball, football, etc. Nice that they have the hook that pops right onto the leash and they break down so I can easily pop them into a purse or bag too.",
      "rating": 5.0,
      "verified": true,
      "author": "JTHB",
      "helpful_votes": 0,
      "publication_date": 20180731
    }
  ],
  "product_meta": {
    "title": "IDEGG Portable Collapsible Silicone Pet Dog Bowl, Foldable Expandable Water Feeding Travel Bowl Cup Dish for Pet Dog Cat",
    "description": "Size:Set of 2| Color:Purple+GreenProduct description:\nOur pack have two colorful portable bowls making traveling with your pet an enjoyable experience!\n\nFeatures:\n* Handy for food or water on any adventure.\n* Dishwasher safe - Simply hand wash or top shelf it in the dishwasher.\n* Clip it or collapse it - Always on-the-go\n* Pop-Up and fold away.\n* Perfect for your for journeys, hiking, kennels & camping\n\n* Our pack of 2 pet travel bowls come in various colors each measuring 5 inches in diameter (13cm) and 0.5 inches (1.27cm) thick when collapsed.\nWhen you Pop-Up, the height will increase to 2 inches (5.2cm).\n\nPackage Include:\n2 of IDEGG Portable Cat/Dog Bowls \n2 of IDEGG Carabiners \n1 of IDEGG IDEGG Storage Nylon Bag",
    "rating": 4.7,
    "feature_bullets": [
      "Foldable & Convenient: Foldable pet bowl is 5 inches wide, 2.1 inches height, each bowl holds up to 12 fluid ounces of water or 1.5 cups of pet food - 0.5 inches when collapsed - simply Pop-Up and fold away.",
      "Safe materials: Made with high quality flexible Food-Grade silicone,100% Lead-free, BPA Free.Easy for storage and transportation: The Bowls include color-matching carabiners.A great Christmas and new year gift for relative and friends. You can clip it or collapse it to your backpack, purse, dog travel crate, dog training leash or collapse flat for your pocket, stroller, glove box and more! Terrific pet supplies for pet water bowl or pet travel bowl.",
      "Package Include:2 * IDEGG Foldable Cat/Dog Bowl .2 * IDEGG Carabiner .1* IDEGG IDEGG Storage Nylon Bag",
      "Proud supporters of animal rescues: Our products have brightness colors that can provide enough warning for your pet's rescue, if you clip the bowl on your pet's leash during your adventure.",
      "Dishwasher Safe(Top rack): For proper hygiene, always wash pet products after each use. For stability, please hold filled bowl with both hands underneath the rim."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "6.5 x 5 x 0.5 inches; 3.99 Ounces",
      "Item model number": "IDEGG-CBL-001",
      "Date First Available": "June 11, 2016",
      "Manufacturer": "IDEGG",
      "ASIN": "B01GY6OIBU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Bowls",
      "Pet Supplies",
      "Feeding & Watering Supplies",
      "Small Animals"
    ],
    "price": ""
  }
}