{
  "website_summaries": [
    {
      "verdict": "A set of cups available in sets of 2 or 4 that will retain heat longer than other models.",
      "pros": [
        "We love how each package comes with a handwritten note from the company owner",
        "The double-walled construction works as an effective insulator and users report stellar customer service"
      ],
      "cons": [
        "Their delicate construction sometimes impacts the final product, resulting in flawed merchandise"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "good espresso cups",
      "text": "I've used Bodum insulated espresso cups for years. They've gradually diminished in numbers as thin glass cups are wont to do. I was delighted to find that Kitchables had a variety that was more cost-effective than Bodum, and every bit as good in performance. They're comfortable in the hand, the double wall makes them adequately heat resistant, and the quality is good. Nick at Kitchables is doing a good job in his marketing (though the website sorely needs the upgrade it is currently going through). Handwritten notes accompany purchases, and Kitchables tries to reach out to ensure their products have arrived and fit the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Cane Questions",
      "helpful_votes": 7,
      "publication_date": 20180412
    },
    {
      "title": "Keeps my espresso warm!!!",
      "text": "I love these! They are great for keeping my espresso warm. I must admit though, I thought these would hold 2 shots. I’m sure they have larger ones and I will be ordering them ASAP. The packaging was really good. The box was inside an Amazon box. The box that contained the glasses was very sturdy and I don’t think me dropping the from 100 feet would have broken them. Thank you Nick, you will be seeing my next order soon.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 3,
      "publication_date": 20190119
    },
    {
      "title": "Must have for Espresso lovers!",
      "text": "These espresso cups are great! They keep your hand cool and the espresso hot, (other cups dissipate heat quickly leaving your espresso cold). Also very stylish and fit perfectly under my Nespresso machine. Getting a lot of comments in the office from visitors and coworkers. Everyone loves them. I will defiantly buy more for the house. Good product and good seller. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dwightisite",
      "helpful_votes": 6,
      "publication_date": 20180620
    },
    {
      "title": "Inexpensive so I took a chance, great bang for the buck",
      "text": "Honestly i felt like i was taking a chance on these since they're so inexpensive but it turned out well, really great bang for to buck. These feel pretty sturdy and work well for espresso. They are slightly large for restretto, I pull 28-30g shots and only fills just about half way. Double walled is ideal for two main reasons: thin glass means no need to warm up the cup and plus i can see the crema build as i pull the shot. I can't speak to durability as i dont drop things often but i never warm them up and they get hot espresso crema 1st thing in the mornings without any drama so i gave it 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Chang",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Great product and service!",
      "text": "I bought these as a replacement for a similar product that was broken in an accident. The price for the 4 pack was similar to a 2 pack of the glasses I had before. When I received them, one had a production flaw and quickly broke. I wasn't that concerned as even 3 were a good value for the price, and put two of these glasses into rotation. Without any prompting, I received a follow-up email from Kitchables customer service. When I told them about the flawed glass, they immediately sent two replacement glasses. I am super-satisfied with both Kitchables and their customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "David Small",
      "helpful_votes": 5,
      "publication_date": 20170509
    },
    {
      "title": "Good espresso  glasses",
      "text": "I bought these glasses to use with my breville 870 espresso machine and they work well, a little less than i would have liked though. Their shape makes them unable to be put super close together, so i have to position them perfectly to catch the coffee on the very sides. The actual construction of them feels nice, the heat retention seems to work well. I love the actual look of them, just wish they were slightly less bulbous so it would fit under the espresso spouts just a bit better, but it still works for its purpose and compared to other dual wall espresso glasses I have used they feel better in the hand.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory M. Hirsch",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Poor design",
      "text": "I was looking fwd to using these cups but I am disappointed. They are too large to sit next to each other under double portafilters which causes spilled liquid. Another issues is pouring the espresso. The design of the cups causes the espresso to pour down the side of the cup no matter how fast you pour. Simply a terrible design. I gave two stars only due to the excellent packaging and shipping. The cups themselves deserve only one star.",
      "rating": 2.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Meh-customer service no response to issue",
      "text": "Loved the cups but noticed black specks on one out of the 4. They were permanent and possibly between the double wall. I emailed nick@kitchables as the card in the box mentioned if I had an issue, and it’s been a week with no response. For this and the price for customer service, I take off stars. I can purchase anywhere but I had chose kitchables. To get 75% of my order great, that’s unfortunate",
      "rating": 2.0,
      "verified": true,
      "author": "The Brutally Honest",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great cups",
      "text": "Been using these for a few months now and they are great. Haven't had any of the breaking issues that other users have had. Sometimes I even put a cube of ice in the glass and then put hot espresso in it so I can drink it immediately and have never had one crack or break on me. I always run them in the dish washer with no issues. They look really nice. So if you're looking for a good looking double walled espresso cup definitely get these. You'll enjoy them",
      "rating": 5.0,
      "verified": true,
      "author": "Kody F.",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Beyond satisfied!",
      "text": "I just received my glasses and was excited to open the box. My excitement was met with a very satisfying WOW! I bought these for a gift basket, but I will be ordering more for myself. They are BEAUTIFUL! Very well made, they feel like silk in your hands. They were very well packaged to prevent shipping damage and there was a nice little note and business card in the box as well. A very nice personal touch. I wish they had more products to choose from, but I think that will come with time. Great Job Kitchables!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Kelleher",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Very happy with these cups!",
      "text": "We recently set up a nice espresso station at home, and I ordered these cups to go with it. My husband and I love that they are simple, modern, double-walled and no-nonsense. They look great with our machine, and hubby loves them (and he doesn't love much...). You can't go wrong, I highly recommend, and I am not a frequent reviewer. Engineer-approved!",
      "rating": 5.0,
      "verified": true,
      "author": "Nellies Mommy",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Love this!",
      "text": "The product does not disappoint! It is tasteful and unique. Not only is the product great but so is the customer service. In the package we received a handwritten note telling us to review and let the seller know if we received them and liked them. Will be buying from this seller again!",
      "rating": 5.0,
      "verified": true,
      "author": "Renaa",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Stylish design...the seller is fantastic",
      "text": "These are lot lighter than I thought they'd be (not a problem, just an observation). I love the styling. I've had no issues with them at all yet, though admittedly I haven't used them much. The seller is fantastic. They clearly care about their products and their customers. I wouldn't hesitate at all to buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerritte Couture",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Great Purchase!",
      "text": "We love these double walled insulated espresso shot glasses. They are cool to the touch and they let us see the beauty of the shot with the crema on top. They were a gift to my husband and he uses them everyday. He loves them. They'd also be cute to hold a single blossom, without getting a water ring on your table. We are happy!",
      "rating": 5.0,
      "verified": true,
      "author": "HeartofAvalon",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Great espresso cups, with exceptional customer service!",
      "text": "Great espresso cups, with exceptional customer service! I was so excited when I received my espresso cups. I couldn't wait to get them home and use them. However I had the inside bottom of 1 of my 4 cups break (No fingers were harmed in the process) while hand washing them... I should have waited for my cold cups to become room temp since I had them in my cold car. However I sent them an email explaining my situation, and they were more then happy to send me a replacement!! Thank you for your exceptional customer service!! I know I will be ordering more products from you in the future!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn G",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Very very very nice product",
      "text": "Fast shipping. Well protected. As a big fan of coffee I was looking for a nice espresso set. I have several ones but this is my favorite. I was amazed by the packaging and all the attention inside. I felt like a bought a very expensive piece of jewelry. Great product . I never see so many attention from an online seller. My shot almost taste better. Will recommend this product 10000000%",
      "rating": 5.0,
      "verified": true,
      "author": "Cheikh Tidiane Seck",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Great Quality - Be sure it will work for you.",
      "text": "These are well made espresso glasses. The quality is very good. They are vacuum sealed so are well insulated. My only problem is that they aren't quite large enough for the Nespresso Double Espresso. I think the glasses are exactly 2.7 oz and the typical Double Espresso is 2.7 oz PLUS a bit of crema, so these overflow sometimes with the Double. They're fine for a single espresso. I'm also not a huge fan of the rounded shape. While they look great, I always feel like they're going to slip out of my hand when I wash or dry them.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Cantor",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Excellent Design and Packaging",
      "text": "Well crafted. These cups have a beautiful, modern look, and they feel great in your hands. The insulation is no joke either. I needed some additional espresso cups for when I make my morning mochas, and these work great. No burning fingers here! The packaging gave a great first impression with a handwritten card and a coaster that I was not expecting. I only see room for improvement in two ways: 1) Fill lines for single and double shot. 2) Better flow features for transferring from one of these to a mug. I still give this review 5 stars because these cups are intended for those who drink straight espresso, and they still perform quite well when making espresso-based drinks.",
      "rating": 5.0,
      "verified": true,
      "author": "D Reed",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "This cup popped and shot coffee and glass all over ...",
      "text": "This cup popped and shot coffee and glass all over. Used the cups at least 3 times prior without issues. I was in shock for a few seconds trying to understand what had just happened.",
      "rating": 1.0,
      "verified": true,
      "author": "Casais1",
      "helpful_votes": 5,
      "publication_date": 20180110
    },
    {
      "title": "Beautiful and comfortable to hold",
      "text": "These espresso glasses are beautiful and well made. They feel great to hold and clean easily. They are glass after all so dropping them may result in breaking them so as long as you don’t spike them like a football after a touchdown even though you nailed your espresso that dead on, you should be good. Cheers.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew L.",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Hot Espresso is Kept Hot",
      "text": "This came securely and attractively packaged. They are quite light, but don't seem to be fragile. We use them every day. With the intense flavor of good espresso it is a delight being able to sip it over time while it remains warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Agun",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Borosilicate glass is superior. So are these Espresso Shot Glasses!",
      "text": "Why did I purchase them? They are made of borosilicate glass, these wonderful Espresso Cups Shot Glasses are hypoallergenic, lead-free and unlike a plastic straw, they are BPA-free. Easy to hold, their shape reminds me to that of a tulip. Over the moon and truly enjoying my purchase,",
      "rating": 5.0,
      "verified": true,
      "author": "Florenzo",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Form & Function",
      "text": "One arrived broken and the company quickly sent a replacement and we've had no problems since. They feel very fragile but they've been through the dishwasher at least 20 times and no other issues. I love the design.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "False advertising-it shatters!",
      "text": "I have had this product now for several months, but today I felt very motivated to write a review because of my disappointment with its false advertising. In the picture, there are claims that the espresso cups are shatter proof. This is completely false. I dropped the espresso cup on my kitchen tile and it shattered in so many tiny pieces that I spent 20 minutes vacuuming for one tiny glass. The pieces were everywhere--in the carpet, stuck between wood, and in tiny crevices--posing danger to my child. I'm very disappointed at the false claim made.",
      "rating": 2.0,
      "verified": true,
      "author": "Earlbert Cabellon",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Amazing tea cups double wall imo worth it",
      "text": "Very nice cups originally I had thought the size was the one I wanted but serves good for Turkish coffee in it I will be ordering a different types of cup for coffee and tea, overall very good and yes I can hold it with my bare hands won’t be hot Not even complain I wanted this for a long time,Overall I have no complaints I am very happy with what I have received and will be ordering more overtime thank you very much for such a great kitchen product",
      "rating": 5.0,
      "verified": true,
      "author": "Nad",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Don't waste your money.",
      "text": "Complete garbage. Does not hold up. Two of the four have already broken on me. The bottoms are the first to go. Ended up wasting a perfectly good shot of espresso when the cup broke while brewing and no the glass was not cold, it had been tempered with hot TAP water prior to brewing.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim the Destroyer",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Really nice cups... as long as you don’t set them down together - they’re of different heights.",
      "text": "Great cups. They keep the espresso warm for long and are nice to hold. Only 4 stars are the cups are of significantly different heights. It’s disturbing when they’re set down together. Update: customer support is top notch. Kitchable sent me a new box of 4 which are of perfect height, even though I only asked to replace two. They only asked to see a picture, no need to go through the hassle of returning the defective cups. So now I have 6 good ones, and discarded 2. Thanks Nick.",
      "rating": 5.0,
      "verified": true,
      "author": "MacUser",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Perfect for the job.",
      "text": "Keeps espresso hot! A single shot of espresso used to be get cold by the time I carried it up the stairs. These solved that problem. I also like that I can see how well I've mixed the drink, and how the cream separates from the espresso. Perfect. I might even buy some to give as gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Huntley",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great buy!",
      "text": "These cups are the perfect size to sit and sip espresso with or to drink with a pot of tea. They look super high end and aesthetic. If you have a reason to buy these, do it. You won’t regret it. They only thing that’s not stellar is they don’t pour very well. If you’re pulling a shot into these cups to make some mixed coffee drink you have to dump it in, you can’t pour it. Not a big deal at all, but worth mentioning.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Superb quality and sturdiness",
      "text": "I own several double wall espresso cups and when I ordered more because some broke, I was so pleasantly surprised to find these to be much thicker and better quality than the ones I previously paid much more money for! Hopefully, my other old ones will break so I can replace them with these sturdy ones! And, oh, coffee stays hot much longer in these too. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "gabgab",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Awesome product!",
      "text": "The coffee cups are just awesome! They are made with the finest quality. They are packaged with extreme care in a nice box. I really enjoyed opening them and most importantly I enjoy using them! I most certainly will be purchasing more Kitchable products, not just because they are great, but because customer experience is also amazing. The only thing I can criticize is that it only comes with a coaster even if it's a 4-cups set.",
      "rating": 5.0,
      "verified": true,
      "author": "Axel Pardemann",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "The Best",
      "text": "The cups are fantastic. They keep espresso hot for a long time and are not too hot to hold. Easy clean as well and the company does follow up before and after delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Great cups for espresso",
      "text": "The cup is just a little bit small, where a few drops of the brewing espresso will drip over the side of the cup . Not a huge deal, but you really have to be careful to \"centre\" the cup dead on.",
      "rating": 5.0,
      "verified": true,
      "author": "BruceK",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "I LOVE these cups",
      "text": "I LOVE these cups!! Perfect for my Nespresso machine! The seller was very accessible with delivery and any questions I had. The cups actually looked better when they arrived that what I was expecting. They have a light design and I can't wait to show them off at my next dinner party. This seller also has an awesome online store, and I will make sure to shop with them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Hudson Valley kid",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Perfect for my Double Espresso!",
      "text": "Santa brought me a new Nespresso Machine and these really cool double walled cups are a perfect for Espresso! They're quality made and so attractive that I leave them out right next to the machine! IAs far as durability, they are blown glass and should be treated as such! I love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda A. Kosakowski",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Excellent quality!",
      "text": "Beautiful Espresso cups! They add a beautiful vibe to my fav beverage! Perfect in every way and excellent quality !",
      "rating": 5.0,
      "verified": true,
      "author": "SavyThinker",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Love these!! Although 1 was broken😥",
      "text": "I love these!! I bought 2 boxes (4 cups in each box) but I was very sad when opened the second box 1 of the glasses the base was shattered 😞. But honestly dont feel like or have the time to send back the whole box to get the one glass. So happy with the 7 cups I have. Packaging was really good i believe shattered when packed just by how bottom was shattered small crystals. Maybe just be alittle more careful packing !! Thank you! I am definitively a new customer.",
      "rating": 4.0,
      "verified": true,
      "author": "nancy porter",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Good quality and look great",
      "text": "Received the set of 4 and these glasses look good!! I found that they are slightly eneven either the top rim or the bottom but its barely noticeable. I only noticed when i went to slide the cup under my espresso machine the one side just slides under, if i spin the cup it slightly hit the bottom where espresso comes out. One sides slightly higher then other which again is not visually noticable unless you sit there and study them. They are balanced sitting them down as in they dont wobble. Good quality glasses and look good.",
      "rating": 5.0,
      "verified": true,
      "author": "christopher stallings",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Beautiful and functional.",
      "text": "Wouldn't get these normally but I broke all my Uncle's double walled glass cups on accident so I replaced them. They hold the temp nicely and you can see the crema of the espresso, making the coffee experience that much better by adding a visual element to the taste and scent of that addictive bast*rd. They also appeased my uncle, thereby bringing harmony to the universe. Thank you <3",
      "rating": 5.0,
      "verified": true,
      "author": "BCurtains",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Been great",
      "text": "I have had these for over six months. Have not had an issue. Have bumped them around a little to the point of recoiling and expectimg to hear a break, and have not broken one yet",
      "rating": 5.0,
      "verified": true,
      "author": "Ski-ball",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "looks cool",
      "text": "these look cool, and look great. i can line up 4 of them alone the top of my jura e8 without covering the power button which is perfect. easy to clean too. fits a double espresso with froth nicely, so that you can carry it around without it spilling",
      "rating": 5.0,
      "verified": true,
      "author": "AN",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "great espresso shot glasses",
      "text": "very nice and easy to clean, also can throw them in the dishwasher. great because they keep your shot hotter for longer and keep you from scalding your hand. good size and quality. would recommend 10/10 for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt H.",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Really cute coffee cups",
      "text": "I really liked them because the double walls isolate the coffee keeping it warm inside and don't hurt when you hold the cup. They are very light and clean well. Can't speak about durability since I got them recently but I am thinking about buying another set to use when hosting a larger party.",
      "rating": 5.0,
      "verified": true,
      "author": "Silvia",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Beautiful shot glasses",
      "text": "Beautiful shot glasses, got them on sale. Maybe not the best for just general use if you're just throwing the shots in a latte? Impossible to get it not to run down the side haha",
      "rating": 5.0,
      "verified": true,
      "author": "steven & kristen rader",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Great quality at a great price!",
      "text": "These are amazing quality shot glasses at a great price. I bought them as a Father’s Day gift for my husband over a year ago and we use them every other day for making espresso. The outside of the cup stays cool and the espresso stays piping hot inside. They are the perfect size for a single or double shot. Recently one of the glasses interior glass broke after a year of use and kitchables replaced the product immediately after I contacted them. I will definitely be buying more amazing products from them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "LOVE THESE LITTLE GUYS",
      "text": "I KICK MYSELF FOR NOT BUYING THEM in 5 OZ. I NOW NEED TO BUY THE AND THEY SEEM TO BE A BIT OVERPRIZED COMPARED TO ALL OTHERS FROM KITCHABLES. AT A WHAPPING 54.00 WHEN I PAY 20.00 FOR MY SHOT ONES...",
      "rating": 5.0,
      "verified": true,
      "author": "Mei-Ling",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Highly Recommend",
      "text": "These are GORGEOUS. Beautifully crafted. Great quality. Easy to clean in the dishwasher. Keeps espresso warm but cool to the touch. I love the presentation they came in too... very luxe! Even a hand-written note from the owner (I held it up to see if there were ball-point pen pressure marks and there were!). Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Beautiful espresso cups!",
      "text": "Amazing cups for your espressos! Perfect packing and safe. I received them and from the box to the cups, every details was perfect. I will buy here without thinking twice.",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandro",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Love these espresso cups!",
      "text": "I am a first time buyer from this store: the cups are perfect for espresso shots (they hold the right amount), are beautiful and insulate the drink as described. Easy to hold, dishwasher safe and a great price. Love them and might get some more :)",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Great espresso shot glass at a great price!",
      "text": "I am very pleased with these espresso cups. They are a nice weight, and they keep the espresso good and hot. Prompt delivery from the seller was appreciated, as I had broken my last cup and was having to manage without until these nice glasses arrived. I heartily recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Gisele F. Dubson",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Great quality cups!",
      "text": "Love these espresso cups a lot. They keep the espresso nice and hot and are really pretty to serve to guests. One tiny downside is that when I am making a double espresso, I have to tilt the cups inward so it can catch the espresso. But not a big deal since I usually make Americanos and use this brands bigger cups to make it in.",
      "rating": 5.0,
      "verified": true,
      "author": "Shameen Miller",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Nice espresso cups",
      "text": "These espresso cups are double walled to prevent outside from being too hot. They are durable, I dropped one on the granite counter and did not break. Seller contacted me to ensure that I was happy with the purchase and see if I had any issues or questions.",
      "rating": 5.0,
      "verified": true,
      "author": "rewells4395",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "You will love this product",
      "text": "I sow this expreso cups at my friends house and I really like it and of course I ordered it for my self too , I got them in few days and I’m very happy about purchase, thanking about to get the capuchino and late ones too",
      "rating": 5.0,
      "verified": true,
      "author": "kalina",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Great espresso glasses and even better customer service",
      "text": "The perfect espresso cups that are both functional and classy. There are a number of similar glasses on Amazon that go for about the same price, but I can guarantee that none of the venders provide the spectacular, bend over backwards service the folks from Kitchables provides. Will be doing business wither again for sure!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Wirth",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "sturdy and comfortable",
      "text": "you know, i just love these! i've used similar ones with handles for a while now. but they tend to break easily. not so with these cups! i've already dropped one and it's just fine. they are nicely fitting in my hand; keep the espresso warm much longer than ceramic cups; and seem to be quite sturdy. what more could one ask?",
      "rating": 5.0,
      "verified": true,
      "author": "jmb",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "They hold the perfect amount of caffeine rush",
      "text": "They hold the perfect amount of caffeine rush. They double wall insulates and keeps the espresso hot longer than a ceramic cup. And they look classy!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Aponzi",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Super-nice cups, and Kitchables has great customer service",
      "text": "Love these cups. Very nicely made and stable. Cool to the touch on the outside, and keeps the espresso hot on the inside. Also very nice to see the crema on top. Nick from Kitchables emailed me to follow up and make sure I was happy. Great customer service! Thanks, Nick. I'll recommend to my friends and be very comfortable buying from you guys again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carey D",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Insulates Well",
      "text": "They do their job. Insulate well. Fit nicely in the hand. Hold a double shot with room for a little foam or whatever. Clean up well in the dish washer. Two thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "W.E.",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Highly recommended",
      "text": "Ordered these for a house guest who came to visit - he loves his espresso. having hot coffee without burning your hands is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Delighted with this purchase.",
      "text": "Absolutely adore these. They lend a modern feel to my coffee stand. I have a tiny, tiny espresso machine, and they still just fit underneath the double shot nozzle. The double wall protects my hands from hot liquids. Would absolutely buy again, and will be buying for gifts for my coffee-oriented friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Silverman ",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Just as advertised",
      "text": "The double-walled espresso shot glasses came well packaged and without damage. They are exactly as described. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "DrAtomic",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Love these Little Cups",
      "text": "They are almost too light! But they are a nice size for espresso and insulate your hand from the heat. They look nice, are easy to wash and I haven't had any problem with breakage.",
      "rating": 5.0,
      "verified": true,
      "author": "Omaha Reader",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Great company to order from!",
      "text": "I love these cups. I needed to find espresso cups the were short and these were perfect. The quality was great and I love the look of them. The company owner even included a personal note thanking me for ordering with a gift card for my next purchase. Now I am sure that the owner himself does not have time to hand write these thank you notes and others in the company help with that however it was a really nice touch. I will order from this company again and you should also!",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Musgrave",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Your espresso will look better than ever",
      "text": "What's the point of having and expensive espresso machine if when you serve it doesn't look good? This cups will enhance the looks of your coffee. The material has a layer of air within it, so it never feels to hot when you grab it, it is dishwasher safe. Great product overall.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniela Z",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Great quality!",
      "text": "Packaging and presentation of these glasses were a great experience. Glasses came nicely protected, not a single blemish on them. They are wider than a standard shot glass but is to be expected. Can easily hold a standard double shot. I haven't experienced any of my glasses breaking, I'm very careful with them but accidents do happen and manufacturer defects are possible. So far my glasses are in tact and couldn't be happier with the look and feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Rivera",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "cheap glass shatters after heated",
      "text": "After a cycle in the dishwasher, the bottom of one glass shattered completely onto the floor, endangering my dog.",
      "rating": 1.0,
      "verified": true,
      "author": "Joey Jay",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Enjoying my expresso!",
      "text": "Quality is excellent ! Easy to hold .. and would definitely recommend your product to friends and relatives ..not normally a online shopper but for items like this but I am glad I did! Thank you for your great service and quality.. please continue !",
      "rating": 5.0,
      "verified": true,
      "author": "Trishied",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Fragile",
      "text": "Started well, but after light use for month, one of the cup’s bottom broke off for no apparent reason during hand washing it.",
      "rating": 3.0,
      "verified": true,
      "author": "Eyal Yurman",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Superb craftsmanship.",
      "text": "The double insulation glass is nice, cool, and smooth to the touch while keeping my beverages nice and hot!",
      "rating": 5.0,
      "verified": true,
      "author": "Ambrose P. Marbury",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Really pretty, really practical",
      "text": "These espresso cups are very pretty and they fit nicely side by side in my Rok espresso maker. The packaging they arrived in also felt very secure. They a breeze to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney L.",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "they are just as good. The glass seems to be of good quality ...",
      "text": "I originally bought these thinking they were Bodum products, however, they are just as good. The glass seems to be of good quality and doesn't have any kind of taste to it. I've been using them for a bit now and not had any trouble with chipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Hatt",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Good cups, great company.",
      "text": "These espresso cups are the real deal. They hold heat well and because they are double blown you can hold it forever and not burn your fingers/hands. And Kitchables really stands by their product. One of my cups broke while washing it and I emailed them. They sent me another one free of charge. Great product and great company!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Becker",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Perfect double espresso shot glass",
      "text": "Product came packaged beautifully! Would happily give these as a gift to someone. They are the perfect size for a double shot with extra space for the crema. You can pull the shot directly into these glasses without making a mess. They keep the espresso hot and the outside of the glass cool to the touch. Great deal on a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Hagarman",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Functional and beautiful from a wonderful seller",
      "text": "Got this during Prime day for a great deal! The cups while fragile, as with any fine glassware, Is very functional and does an outstanding job keeping the cup cool to the touch! In fact, when I made my girlfriend and a double shot, the glass was not hot so she thought the espresso had come out cold and she was sure surprised when she tried to take a big sip! Nick is a great seller who is very communicative, I will be looking to him for other products in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Amazing Expresso Glasses, Amazing Company!",
      "text": "Perfect!!! I am so happy with this purchase! Not only are these glasses better than I expected, but the owner took the time to write a personalized note! For me, this was such a meaningful act. Specially since we live in such impersonal times. I will definitely buy more products from this company. Thank you Nick!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vee130629",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great customer service!",
      "text": "These cups are perfect for the Delonghi EC155 espresso maker. This maker does not allow much clearance, and these cups fit perfectly underneath the dispenser. There is a nice handwritten note from the owner of Kitchables thanking you for your purchase and encouraging you to reach out if you have any problems with your order. When they arrived, one of the glasses had a defect on the inner wall. I contacted the owner of Kitchables directly, and he promptly responded to my email. A week later, I had a replacement order sent to my house hassle free!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Colon",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "I received four perfectly shaped cups, exactly as described ...",
      "text": "I received four perfectly shaped cups, exactly as described. The cup holds a double shot of espresso as measured in my Brikka stovetop espresso pot. I give five stars for getting exactly what I ordered a high-quality product at a very reasonable price, with Prime's fast delivery. Product is Made in China.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Ellis",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "These glasses do a fine job of insulating your drink",
      "text": "These glasses are very light and feel fragile, but so far they have held up well. These glasses do a fine job of insulating your drink, maybe better than a porcelain or ceramic cup. I also like how it looks like your drink is floating.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon P",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "love them",
      "text": "very cute and even though a little big for expresso they have a nice presentation",
      "rating": 5.0,
      "verified": true,
      "author": "Davidmichael Schmidt",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "So cute!",
      "text": "I first used these espresso cups at my sister's house. She loves them. I then decided to start drinking espresso at my own home and had to purchase these same cups. They are durable and stylish. This cup has no handle, but it is easy to hold and the double wall insulation protects my fingers from the heat. They come in a very cute box with a note from the business owner, which was a nice touch.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer C.",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "robust double wall espresso cups",
      "text": "I bought another set of glass espresso cups and both eventually broke. These feel way more robust then the other ones. I am very happy with the product and price.",
      "rating": 5.0,
      "verified": true,
      "author": "deltaman",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Shows off a double shot of espresso!",
      "text": "Nice cups that hold a double shot of espresso. I don’t know how durable they are yet but will update if I find them lacking in that department.",
      "rating": 5.0,
      "verified": true,
      "author": "Rad5030",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "the best espresso cups",
      "text": "We received our new espresso cups within a day of ordering. WE LOVE THEM. They are the perfect size and easy to hold. The double insulted keeps the espresso hot and the outside cool to handle. Would recommend and have told our friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Preston",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Well made",
      "text": "Perfect for espresso shots, dropped one 3’ onto my hardwood floor and it bounced with no damage. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Best way to enjoy espresso",
      "text": "Perfect size, excellent weight. Feels good in your hand and really insulated.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Amazing cup, but handle with care!",
      "text": "These espresso shot glasses are extremely good looking but paper thin. I received em today and already got minus one. When tried to place one of em on the counter after I washed it, it slips and hit the counter from no more than 10 inches....it broke to hundreds lil pieces. I doubt i am going to have them for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Todor Jelev",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Best espresso cups ever",
      "text": "These things are amazing, and they're shockingly durable considering they're glass. They are the perfect size for a home espresso machine and they keep things nice and hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Mulling It Over",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "As described",
      "text": "I bought these as a gift. My friends love them. The double wall keeps hot espresso from marring surfaces. They’ve even used them to hold cold after-dinner drinks. I don’t know if they’re durable; they’re new.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Supercute expresso cups",
      "text": "I like them very much! Only 1 thing, try considering more green packaging. For lower co2 emission. The cups are very very nice! I will probably order more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "cyrille vachaudez",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Cute and functional",
      "text": "These little espresso cups are so cute and they work like a charm! I can hold the cup without burning my fingers and it stays hot until I’m finished drinking my coffee. Easy to clean, and easy to store.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Dean",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Cool & Stylish",
      "text": "The cups came in a well packed box with a personal hand written note from Nick. Rinsed them & used one of them immediately as my Nespresso machine came earlier that day. The double walled glass kept the heat & it enhanced the espresso drinking experience to see the crema peek through the clear glass. They looked cool & stylish sitting on a black ceramic tray on my office table next to my lime green Nespresso machine. I have been using them almost every week day & am loving it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pin",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Love it",
      "text": "It’s fancy. It’s beautiful. It’s easy to hold. Love it. I will buy some more and give them as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "LivZ",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Good value, good quality",
      "text": "The product, matches the expected characteristics and the details provided in the listing, with Kitchables following up on the purchase. The cups are light and while there are some compromises on the finishing, they feel sturdy and look good overall. They insulate the coffee well and my espresso stays hot, while my fingers stay protected from heat.",
      "rating": 5.0,
      "verified": true,
      "author": "bakedbread",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "They came on time & in good condition. I have always wanted fancy espresso cups ...",
      "text": "They came on time & in good condition. I have always wanted fancy espresso cups like these and I am so happy I ordered them! The double-walled insulation (while still being entirely made of glass) is super cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "The product is wonderful, just perfect for a shot of espresso to start the morning off right.",
      "text": "I love my new insulated espresso cups! Not only do they look elegant, they are the perfect fit to your hand and no worry about burning a finger trying to hold a little coffee cup. And the customer service from Kitchables is unheard-of-these-days and lovely -- I received a personal welcoming note from the owner, Nick Coe. I love Amazon but have yet to hear from Jeff Bezos. And you must visit their website - more lively things!! Just a really wonderful company.",
      "rating": 5.0,
      "verified": true,
      "author": "Meadows Gal",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Have to manually raise them to work with Breville Barista...",
      "text": "Bought them to use with Breville Barista. Although they look good and do their job (the exterior does not get hot), I have to manually raise them close to the extractors while the machine pours out the espresso. If I put them together below the extractors the espresso will pour out of the cups because the height of the extractors will make the drip go down vertically and the cups construction does not work with this particular pour and their mouth is not wide enough to use one cup instead of two.",
      "rating": 2.0,
      "verified": true,
      "author": "MGL",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Insulating is great.",
      "text": "Only used them a few time. Insulating barrier of glass is great, however, be careful, you cant tell how hot your coffee is its that good. Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Damien K Robinson",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Perfect espresso cups!",
      "text": "I just got a Nespresso and I specifically wanted clear espresso cups so I could ogle my favorite hot beverage in all its glory. These 4 wee cups arrived safely nestled in a cute box along with a kind note from their caretaker. Love these cups for how they feel in my hand, how the espresso looks and also because they are the perfect size for my caffeine-addicted cat.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Hansen",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Satisfied all around :)",
      "text": "Beautiful glasses, and equally beautiful packaging! Not one was broken. I love the thickness of the double walls (not the thickness of the glass, but the space between the two layers) and how the cups curve inwards. Feels great in your hands! Personally, I prefer this glass to some of the other designs out there. I enjoy using these for serving higher-quality green/Jasmine/herbal teas etc., and for having miniature servings of ice cream, haha. The order also came with a handwritten thank-you note from the owner, a scratch-off discount code, and a cork coaster ^_^ Don't want to slam these down onto a glass table!",
      "rating": 5.0,
      "verified": true,
      "author": "ChocoKoronet",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Cute cup but it has an odd rim",
      "text": "The product is as expected. They are cute cups as advertised. However, when you put it in your lips you the felling is odd as the rim is wider than expected. Though, I don't know if it is something that all double wall cups have or it is just this design. As long as this wide rim does not cause leaks from your lips I am a happy buyer.",
      "rating": 4.0,
      "verified": true,
      "author": "JORGE MALDONADO",
      "helpful_votes": 0,
      "publication_date": 20191221
    }
  ],
  "product_meta": {
    "title": "Espresso Cups Shot Glass Coffee Set of 4 - Double Wall Thermo Insulated",
    "rating": 4.8,
    "feature_bullets": [
      "NEVER BURN YOUR FINGERS AGAIN. Our special double wall thermo insulated design prevents side heat transfer, maintaining the ideal temperature",
      "EASY TO CLEAN, BUILT TO LAST. Constructed from the highest quality borosilicate glass - dishwasher, microwave and freezer safe",
      "FOR ALL OCCASIONS. Multi-use cups to serve the perfect espresso, spirits, lungo, latte, cappuccino, tea or dessert",
      "FITS UNDER MOST ESPRESSO MACHINES. Small enough to fit under the portafilter yet large enough to hold a double shot of coffee - 2.7 oz capacity to the rim",
      "TRUSTED BY COFFEE LOVERS WORLDWIDE. Buying from Kitchables gets you a lifetime 100% manufacturer's warranty, no kidding. If you're not satisfied, you get your money back"
    ],
    "specifications": {
      "Package Dimensions": "7.5 x 7.2 x 4.1 inches",
      "Item Weight": "16 ounces",
      "Manufacturer": "Kitchables",
      "ASIN": "B01GK2TSKO",
      "Item model number": "SYNCHKG128834",
      "Customer Reviews": "4.8 out of 5 stars1,557 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#20,872 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 3, 2016"
    },
    "categories": [
      "Espresso Cups",
      "Cups, Mugs, & Saucers",
      "Home & Kitchen",
      "Dining & Entertaining",
      "Dinnerware",
      "Kitchen & Dining"
    ],
    "price": 23.95
  }
}