{
  "website_summaries": [
    {
      "verdict": "An affordable line of organic baby food but with inconsistent results.",
      "pros": [
        "A 6-pack of affordable pouches",
        "Non-GMO",
        "Appropriate for babies ages 9 months and up",
        "Comes in resealable pouches",
        "Other recipes also available"
      ],
      "cons": [
        "Some buyers experienced extra runny baby food, and some babies seem to be lukewarm on the taste"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This food helped me through cancer treatment",
      "text": "This food saved my life during throat cancer treatment. I could not eat anything except this food because it did not burn, it was easy to swallow and tasted pretty good too. If not.for this food I would have had to be put on a feeding tube.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle G.",
      "helpful_votes": 4,
      "publication_date": 20200223
    },
    {
      "title": "Botulism(?)",
      "text": "For starters, I read but RARELY write reviews. The cheesy pasta with veggies was very watery and not a ‘solid’ food for 9+ month babies. In regards to the inflation package, we never took it to elevation, didn’t store it in refrigerator back to room temperature, etc.. This being said, we have been happy with other Earths Best products but extremely disappointed with this product. ‘Organic cheesy pasta w veggies’",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan M. Lopossa",
      "helpful_votes": 3,
      "publication_date": 20180723
    },
    {
      "title": "Subpar & unpleasant",
      "text": "So my baby will eat almost anything but he HATES this particular baby food: Earth's Best Cheesy Pasta w Veggies. Amd since I taste all of his baby foods, I agree with him. This flavor mix is bmand and bitter and overall unpleasant. I do not recommend it. I haven't tried any other Earth's Best, so I can't speak for the whole brand, but I won't be trying any of the rest of their baby foods.",
      "rating": 2.0,
      "verified": true,
      "author": "Rebah V",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "My son doesn't seem to like this brand",
      "text": "We bought a couple different flavors from this brand of baby food. I think the other was chicken pot pie. He hasn't liked any of them so far. He much prefers the Sprout brand pouches. Haven't found one of those yet that he doesn't like.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley Lobeda",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Good texture with plenty of protein.",
      "text": "My nine month old loves this one. I like that it has 3 grams of protein per pouch. It has a nice, thick texture, perfect for when they are ready for something more substantial.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Workes for us",
      "text": "Was one of the 1st foods my son ate lot.",
      "rating": 5.0,
      "verified": true,
      "author": "David K.",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Son loves it!",
      "text": "My son loves this & it smells like cheddar broccoli soup!",
      "rating": 5.0,
      "verified": true,
      "author": "jshubert",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "First time I got a replacement abs thought it was just a bad batch but nope I tasted it my self and ...",
      "text": "Second time I've ordered this and it was rancid. First time I got a replacement abs thought it was just a bad batch but nope I tasted it my self and it was clumpy and disgusting.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin and Cory Houdmann",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Don't order in winter/freezing temps.",
      "text": "Little one likes this one a lot. Only drawback was the consistency was messed up in winter shipments. It became clumpy or pure water. Some pouches we had to pitch even though we had tried shaking and manually mixing by pressing pouch. Disappointing.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "I was dissappointed as i thought he would love them.",
      "text": "This flavor has a really strong broccoli smell to it, and my 1 yr old who eats everything will not eat this. I was dissappointed as i thought he would love them.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Stinks",
      "text": "Awful. I just throw all of them in garbage. It's smells awful.",
      "rating": 2.0,
      "verified": true,
      "author": "Samir G",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Good",
      "text": "My granddaughter enjoyed eating this brand. They have good selections.",
      "rating": 5.0,
      "verified": true,
      "author": "mommyjo",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Was ok",
      "text": "I found that these were really watery but my kid still ate them.",
      "rating": 3.0,
      "verified": true,
      "author": "Leaping Frogs 1031",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "I have NEVER smelled anything so awful!",
      "text": "This is the absolute WORST baby food I have ever purchased! If your child is prone to spitting up or puking, DO NOT BUY THIS! It is 10:30 at night and I am currently washing sheets, two blankets, three sets of pajamas, three burp cloths, and two of my shirts that my son spit up on because it is so absolutely RANCID! He has thrown up 9 times and now has diarrhea from this. Horrible, horrible stuff.",
      "rating": 1.0,
      "verified": false,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Why This Price Tag?",
      "text": "Why this price tag? My son who is now 3 used to love this, it was his favorite packet. We would buy it in a grocery store for a regular price (about $2 or $3), but then it just disappeared from all the grocery stores. Now that we have another baby (9 months) I wanted to see if he would like it just as much as his older brother and I find it online for this ridiculous price. Definitely not worth it!",
      "rating": 1.0,
      "verified": false,
      "author": "Fil",
      "helpful_votes": 0,
      "publication_date": 20190505
    }
  ],
  "product_meta": {
    "title": "Earth's Best Organic Stage 3 Baby Food, Cheesy Pasta with Veggies, 3.5 oz. Pouch (Pack of 6)",
    "description": "Flavor:Cheesy Pasta with VeggiesEarth’s Best Organic Baby Food Pouches feature yummy combinations of pureed fruits, veggies, meat and whole grains that your little one is sure to love. With multiple stages of purees available for different ages, there's an Earth's Best baby food for every step along the way. Simply choose the appropriate puree based on your baby's age: Stage 2 is for little ones 6 months and older, and Stage 3 is for 9 months and older. Packaged in BPA-free resealable pouches, Earth's Best baby food is perfect for on-the-go families. All Earth’s Best baby food pouches are USDA-Certified Organic, made with non-GMO ingredients, and contain no artificial flavors, or colors. They are also unsweetened, unsalted, and have no added modified starches. From the day that Earth’s Best was founded in 1985, we’ve been recognized as a brand dedicated to offering wholesome, safe products for little ones. We believe that babies deserve nutritious fruits handpicked from organic orchards, vegetables grown in nature’s soil, and foods that are made without genetically engineered ingredients. Offering a wide range of safe and gentle baby care products as well as nourishing foods, Earth's Best products are created with care, using simple ingredients found in nature. Made with love from the ground up, you can trust Earth’s Best products to be safe for your baby.",
    "rating": 4.2,
    "feature_bullets": [
      "Six 3.5 oz. pouch of Earth's Best Organic Stage 3 Cheesy Pasta with Veggies Baby Food",
      "For babies 9 months and older",
      "Packaged in BPA-free resealable pouches",
      "No artificial flavors or colors",
      "USDA-Certified Organic and made with non-GMO ingredients"
    ],
    "specifications": {
      "Package Dimensions": "7.36 x 6.57 x 3.58 inches; 3.5 Ounces",
      "UPC": "023923345621",
      "Manufacturer": "Hain Group (Earth's Best)",
      "ASIN": "B01GTO92G8",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Grocery & Gourmet Food",
      "Baby Products",
      "Meals",
      "Baby Foods",
      "Feeding"
    ],
    "price": 15.25
  }
}