{
  "website_summaries": [
    {
      "verdict": "Lightweight and secure, this high-quality, four-wheeled suitcase is revered for its durability.",
      "pros": [
        "Large suitcase with a secure lock",
        "Plenty of protected storage space for clothes, electronics, and documents"
      ],
      "cons": [
        "Larger dimensions push airline regulations to the limit",
        "An expensive contender"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bad Zipper = Bad start to trip",
      "text": "I am sitting at the airport using my brand new suitcase. Big problem. The zipper has already split open like a cheap jacket. Zipped on either end but teeth of zipper in mid area have split. Swell. Cannot return as have had 1 month past deadline for return. Thankfully always travel with 2 luggage belts...saved the day. Hell of a way to begin a 3 week overseas trip",
      "rating": 1.0,
      "verified": true,
      "author": "vieuxcarre",
      "helpful_votes": 19,
      "publication_date": 20170701
    },
    {
      "title": "Should have done more research",
      "text": "I was so excited to get new luggage. I did a ton of research on what type of set that I wanted to get. The bad thing about this is that it falls over pretty easily. It's easily packable and the spinners work great and it's easy to move around until you let go of the handle and then the front is on the ground. Slightly irritating.",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda L.",
      "helpful_votes": 16,
      "publication_date": 20171023
    },
    {
      "title": "Zippers not conducive for flying",
      "text": "The zipper pull tabs have large openings in the middle of them which cause the zippers to get stuck on things when being handled by airline baggage equipment. The zippers on the front zipper pockets of both my 25 inch bag and 30 inch bag completely ripped off and apparently repairing the zippers and what I lost because the pockets were then open are not covered by Airlines.",
      "rating": 1.0,
      "verified": true,
      "author": "lynoln",
      "helpful_votes": 25,
      "publication_date": 20170326
    },
    {
      "title": "Fantastic carry-on suitcase!",
      "text": "Fantastic carry-on suitcase! It is very lightweight and looks just like the pictures. The way that the carrying handle is mounted is the side is perpendicular to the way that most such handles are mounted, but it is still possible to carry it with the handle. I ordered it from Amazon Warehouse Deals, and it arrived with no problem or damage. It rolls very easily, and the handle deploys and retracts very easily. It fits in the overhead compartment of an airplane with no problem. The inside has 2 pockets for shoes, one visible in the pictures above and one on the other side. I highly recommend this suitcase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. T",
      "helpful_votes": 11,
      "publication_date": 20170421
    },
    {
      "title": "Great little carry on",
      "text": "Just right for a carry on that will roll down the aisle of the plane even with an underseater on top. Getting to the age where I can't lift my 21\" carry on into the overhead bin any longer and needed something lighter and slightly smaller to be able to handle it. I loved my 21\", but will be taking this on many of my adventures now.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Burton",
      "helpful_votes": 15,
      "publication_date": 20170124
    },
    {
      "title": "Poor quality, very dissappointed",
      "text": "I love Samsonite luggage but don't waste your money on this set. I've used both the small and medium roller on three trips and both are ripping. The medium doesn't roll correctly and the zipper area has torn. The smaller roller rolls ok but the stitching is coming lose and there are tears despite its light use. Hoping I can get Amazon to replace these items.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20170809
    },
    {
      "title": "DO NOT buy this suitcase",
      "text": "Made the mistake of buying 2 of these suitcases in May 2018. The condition was supposed to have been \"like new\" and just the original packaging might have some damage. Not true. They haven't been abused by baggage handlers; they haven't made it onto an airplane yet. They were only used on 2 short road trips and, already, both have defective zippers. Samsonite refuses to honor the warranty because they were not purchased \"new.\" We were screwed twice - by Amazon for representing the suitcases as \"like new\" (they admittedly did look new) and by Samsonite for refusing to warrantee the defective zippers. We have purchased Samsonite luggage for many years but no more.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam G.",
      "helpful_votes": 3,
      "publication_date": 20190205
    },
    {
      "title": "Perfect bag for air travel",
      "text": "This suitcase is perfect as a carry-on. Sturdy and well made, it also survived with no issues once it had to be gate checked due to a full flight. I was able to get about a weeks worth of clothes and shoes in there along with toiletries. Admittedly, they were spring and summery type clothes, bulkier clothes like sweaters will obviously be a bit less. The four spinners are a must and work well when rushing through a crowded airport. I plan on making this my go-to bag for all travel. I'd definitely get this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Megs",
      "helpful_votes": 5,
      "publication_date": 20170731
    },
    {
      "title": "Does not roll straight",
      "text": "This suitcase does not have a strong enough frame to support the wheels when you pack it with clothes the frame does not stay Square and the wheels do not stay flat at the frame this causes the wheels to slightly misaligned and they are not level so they do not stay on access thus the suitcase does not roll straight ever it's a terrible design flaw I hope I can get my money back because we bought the suitcase a long time ago and did not use it until just this month",
      "rating": 1.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 4,
      "publication_date": 20180610
    },
    {
      "title": "Sad",
      "text": "After 4th flight most zipper pulls gone. Complete zipper gone on front pocket. Now it just hangs open. Nice as long as it never travels.",
      "rating": 2.0,
      "verified": true,
      "author": "JDV",
      "helpful_votes": 14,
      "publication_date": 20160914
    },
    {
      "title": "Failed on very first trip!",
      "text": "While I love the size and efficiency of this Spinner, on the very 1st trip the material above one wheel raised over the plastic piece so white plastic shows where it is no longer covered . So disappointed as I purchased 3 pieces. Other pieces - the Mightlight 2 Softside Vertical and Mightlight 2 wheeled boarding bag are great and no issues.",
      "rating": 2.0,
      "verified": true,
      "author": "LBP",
      "helpful_votes": 5,
      "publication_date": 20171008
    },
    {
      "title": "Split zipper",
      "text": "This luggage shouldn’t be labeled Samsonite! Even though we didn’t pack it fully (as it would have passed the weight limit) the zipper on the front is split. I chose this luggage because it was a Samsonite and used many other Samsonite luggages through my 20+ years of travelling, but looks like I won’t be buying this one again.",
      "rating": 1.0,
      "verified": true,
      "author": "ceylan sahin",
      "helpful_votes": 3,
      "publication_date": 20181228
    },
    {
      "title": "Not suitable for airline travel - poor durability",
      "text": "Suitcase has been used fewer than 10 times in airport travel since it was purchased in mid 2018. Outside zipper has completely come off and thus made the outside pocket unusable since it will no longer close. The samsonite metal logo has come off the front. And one of the main zipper pulls (metal) has bent in half. This is from 1 year of airport normal wear and tear. Highly disappointed with this product. None of my other samsonite luggage has ever had this many issues with durability. Don’t recommend purchasing. I’ve submitted multiple customer service inquiries to Samsonite about whether it’s covered under warranty but never received any response back.",
      "rating": 1.0,
      "verified": true,
      "author": "Blair McCauley",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Beautiful, light weight and durable",
      "text": "Not only is the color and style gorgeous but the pocket quantity and placement are abundant without being cumbersome. My wheels do NOT make any clicking noises, they roll easily and change direction without hassle. The fabric, zippers and lining all seem to be of durable quality. It fits more items than I would have guessed it could. Overall I'm already loving this piece and can't wait til my next flight out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170410
    },
    {
      "title": "It is a bit on the large side so it is not something easily lifted for older/smaller people but with the 4 spinning ...",
      "text": "Bought this for my mother for mothers day gift and she loves it. It is a bit on the large side so it is not something easily lifted for older/smaller people but with the 4 spinning casters for wheels it glides along nicely. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "toddinnv",
      "helpful_votes": 4,
      "publication_date": 20170620
    },
    {
      "title": "Expect to last...",
      "text": "Lightweight...holds a lot...very maneuverable...spinners are the way to go! On two recent domestic flights, this along w many other passengers’ spinners could not fit in the overhead bin. They were placed in the belly of the plane and were there for retrieving at end of flight.",
      "rating": 5.0,
      "verified": true,
      "author": "An Educated Consumer",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Zippers mot conducive to flying",
      "text": "The zipper pull tabs have large openings in the middle of them which cause the zippers to get stuck on things when being handled by airline baggage equipment. The zippers on the front zipper pockets of both my 25 inch bag and 30 inch bag completely ripped off and apparently repairing the zippers and what I lost because the pockets were then open are not covered by Airlines.",
      "rating": 1.0,
      "verified": true,
      "author": "lynoln",
      "helpful_votes": 16,
      "publication_date": 20170326
    },
    {
      "title": "LIght and Sturdy",
      "text": "You cannot beat Samsonite Mightlight luggage for strength and light weight. This has become my main bag for air travel.",
      "rating": 5.0,
      "verified": true,
      "author": "TXanalyst",
      "helpful_votes": 4,
      "publication_date": 20180110
    },
    {
      "title": "Excellent choice for carryon",
      "text": "This is exactly what I needed for short trips! I already have the Premier II 27\" Spinner and Premier II 4-Wheel Spinner Garment Bag by Samsonite. These are great pieces of luggage! So happy with them!",
      "rating": 5.0,
      "verified": true,
      "author": "Nadine",
      "helpful_votes": 2,
      "publication_date": 20180602
    },
    {
      "title": "and I love them. They are truly lightweight",
      "text": "Finally got to use our new suitcases a couple of weeks ago, and I love them. They are truly lightweight, well made, and easy to get thru the airport. I definitely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Bdcnkeno",
      "helpful_votes": 4,
      "publication_date": 20170605
    },
    {
      "title": "The spinners are bulbous and maneuver easily in all directions",
      "text": "Purchased for my husband, who frequently travels. This size will get him through a full week domestic flight and meets international standards as well. The spinners are bulbous and maneuver easily in all directions.We've had longevity with this brand and hope this case does too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20161227
    },
    {
      "title": "I really like this suitcase",
      "text": "I really like this suitcase. The color is great and it is very roomy. Not too many people have this color suitcase, so it was easy to spot on the luggage carousel at the airport. This was a replacement purchase for an earlier version of the Samsonite with the spinner wheels. They improved the handle. Now, it won't be able to break because it's all one piece. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Love this. Same size as my older Samsonite 25 ...",
      "text": "Love this. Same size as my older Samsonite 25 Spinner pullman but LIGHTWEIGHT in comparison. I will def replace my older Spinner with this version. It holds the same amount inside and almost 10 pounds lighter. It holds up well to the rough airline luggage \"gorilla\". I travel across country often and I am well pleased with this item.",
      "rating": 5.0,
      "verified": true,
      "author": "IrishEyes55",
      "helpful_votes": 4,
      "publication_date": 20170518
    },
    {
      "title": "Fine, prefer the Silhouette Sphere.",
      "text": "This bag is okay. I like the color, seems like it should hold up well. We have a Samsonite silhouette sphere which we much prefer. The sphere glides through the airport, where this one (mightlight) seems to track weird and has a mind of its own. I ordered this one because I needed it quickly and the sphere was like a week to ship.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Lessard",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Samsonite Mightlight - 19\" Suitcase",
      "text": "I have admittedly only use the suitcase once but it fit 3 days' and nights' worth of clothes and toiletries perfectly. Very light to maneuver around the airport. Very pleased with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ctsoxfan",
      "helpful_votes": 3,
      "publication_date": 20170525
    },
    {
      "title": "Good Quality Construction and Roomy Compartments",
      "text": "Excellent quality construction and very light weight. Plenty of space inside the main compartment and also three (3) separate zippered pockets on the outside provides adequate space for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "azcasualtraveler",
      "helpful_votes": 15,
      "publication_date": 20161009
    },
    {
      "title": "Super durable luggage",
      "text": "Super durable luggage. I have a carryon in the Mightlight 1 line and it is used so often and has help up really nicely so purchased the two larger spinners in the Mightlight 2 line. I've used the 25 in and I love it. Again, very durable and great material.",
      "rating": 5.0,
      "verified": true,
      "author": "Reta Mourad",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Love it. Great Quality.",
      "text": "I love this bag. I do a lot of international travel for work, and this particular carry-on is the best I've ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "Tosha",
      "helpful_votes": 2,
      "publication_date": 20180924
    },
    {
      "title": "Edges showing wear after one trip.",
      "text": "I have only traveled once with this piece. It already shows wear on the corners. The materials is starting to fray. Extremely disappointed. I used it to fly to Vancouver and take a cruise of Alaska. After one trip, it should not be freeing at corners.",
      "rating": 2.0,
      "verified": true,
      "author": "REMJ",
      "helpful_votes": 3,
      "publication_date": 20170906
    },
    {
      "title": "Great rolling bag",
      "text": "This case is roomy, light-weight and rolls easily. It is exactly what I hoped for.",
      "rating": 5.0,
      "verified": true,
      "author": "G Riles",
      "helpful_votes": 7,
      "publication_date": 20170103
    },
    {
      "title": "Large Travel Suitcase.",
      "text": "Larger than I expected but light and relatively easy to manuever for its size. Zippers do protrude out as a design flaw. Still, it's been on a few flights with no major problem.",
      "rating": 5.0,
      "verified": true,
      "author": "charles8642",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Perfect for my travels",
      "text": "I really like this carryon. Has several external pockets that are really convenient when traveling. There is a side pocket that is hard to see in the photos but it is perfect for boarding passes or a long walkers.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "High quality!",
      "text": "High quality and light weight! So far I cannot say anything about durability because I’ve just used once.",
      "rating": 5.0,
      "verified": true,
      "author": "Cacau",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great for business travel.",
      "text": "Perfect size for business travel. i have been using this for a couple weeks. I can easily pack 2-3 days of clothing, shoe, and necessities in this bag. Easy movement, handling, and I can add a laptop bag on top.",
      "rating": 5.0,
      "verified": true,
      "author": "Oceandiva",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "I just love the color",
      "text": "I just love the color, very unique. It is a very large suitcase, so if you are needing room for more than one, this is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "perfect size! wheels are great",
      "text": "perfect size! wheels are great. we have used back and forth from the midwest to west coast and even to hawaii and had no problems. great material and samsonite products last forever!",
      "rating": 5.0,
      "verified": true,
      "author": "LED",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Great size, durable luggage",
      "text": "Great suitcase. Love the size and it is super light. It was pretty easy to navigate with one hand and two toddlers. Durable. All my luggages are Samsonite and haven't been disappointed yet",
      "rating": 5.0,
      "verified": true,
      "author": "SooMin Troy",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Five Stars",
      "text": "Awesome suitcase got more things in it than I thought wouldn't fit. Going to buy the large one next.",
      "rating": 5.0,
      "verified": true,
      "author": "ms darla carlson",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "I pretty much love everything about this suitcase",
      "text": "I pretty much love everything about this suitcase. Needed a BIG one for longer trips, and this bag successfully allowed me to over-pack (ha!). Great quality, rolls like a dream, space and pockets for everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy F",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Excellent quality, fits in overhead compartment",
      "text": "Perfect for an airlines employee who flies weekly! Fits in overhead.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy A. Brown",
      "helpful_votes": 2,
      "publication_date": 20180208
    },
    {
      "title": "Excellent Product",
      "text": "Survived 2 week trip to Europe without any issues. Large enough to pack for entire trip. Well made.",
      "rating": 5.0,
      "verified": true,
      "author": "BB52",
      "helpful_votes": 2,
      "publication_date": 20170921
    },
    {
      "title": "Very Nice Piece of Luggage",
      "text": "Light weight and very durable. This is my third one that I have purchased. The other two have survived many flights quite well.",
      "rating": 5.0,
      "verified": true,
      "author": "BH",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Wonderful carry on piece of luggage",
      "text": "All I can say about this produce is that it has met every expectation I had. I have used it more than a dozen times in the past 2 years and it has fulfilled my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Very nice piece of luggage.",
      "text": "The only downside is the front tends to tip over instead of sitting upright on all four wheels, when packed. Otherwise, it is a very nice piece of luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Martin",
      "helpful_votes": 2,
      "publication_date": 20180106
    },
    {
      "title": "Great size for air travel",
      "text": "Great size for air travel. Keeps you under the 50 pound limit almost automatically. Pack for a 2 week trip with room to spare!",
      "rating": 5.0,
      "verified": true,
      "author": "Trudi",
      "helpful_votes": 2,
      "publication_date": 20170608
    },
    {
      "title": "Light weight and easy to roll!",
      "text": "My husband and i both use this suit case when we travel. Super light weight and easy to roll. Great quality. I would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Reynolds",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Great size and weight for plane travel",
      "text": "Easy to maneuver and can pack just what I need for a long trip for 2 of us. Lightweight so I can travel on planes within the limits set.",
      "rating": 5.0,
      "verified": true,
      "author": "Floinnc",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Love the color and quality",
      "text": "This is a beautiful and well made piece of luggage. I wish Samsonite made a rolling garment bag in this color that I could hang my formal wear in when I cruise.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia A. Roy",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Very good suitcase, I have used it for one trip ...",
      "text": "Very good suitcase, I have used it for one trip to Europe so far, and it still looks brand new. Would recommend .",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Highly recommended! Lightweight & durable",
      "text": "I just spent 4 weeks doing planes, trains & automobiles in Europe & this suitcase was terrific! It is very lightweight & held up fantastic. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Luggage",
      "text": "My granddaughter is in Spain and says this is a great piece of luggage",
      "rating": 5.0,
      "verified": true,
      "author": "maddy09",
      "helpful_votes": 2,
      "publication_date": 20170530
    },
    {
      "title": "great suitcase",
      "text": "I travel a lot so this has seen some serious use! Im even able to cram more stuff in it than my last bag (that was the same size). It maneuvers really well too. I would purchase this again.",
      "rating": 5.0,
      "verified": true,
      "author": "William Phelan",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Perfect 👌 size",
      "text": "I’m so use to taking a bigger piece of luggage when traveling, for five days, that now, I only take this & everything fits, including my umbrella 🌂.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Mathis",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Vacation ready!",
      "text": "This is a huge suitcase but so light! You can get everything in this suitcase and then some!",
      "rating": 5.0,
      "verified": true,
      "author": "Angmj23",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Nice medium-small bag.",
      "text": "I thought I was getting a 25\" bag but I was sent a 21\" bag which I like even better. Fun grape color.",
      "rating": 5.0,
      "verified": true,
      "author": "SaraM",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Love it!",
      "text": "Love it!!! Very functional yet simple. Super light weight and the four wheels give multiple ways to move it. Great buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan E Healy",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Good quality",
      "text": "Well designed and rolls very nicely. Lots of pockets and storage. Great value",
      "rating": 5.0,
      "verified": true,
      "author": "BK",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Poor quality, very disappointed",
      "text": "After one light use the wheels do not work right. There is a quality issue here because the zipper and stitching are ripping. I love samsonite but the two rollers I bought (medium and small) are both deteriorating after 2-3 light uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170809
    },
    {
      "title": "Light-weight medium-small bag",
      "text": "I got the grape for myself and the blue for my travel companion. I like the 21\" size.",
      "rating": 5.0,
      "verified": true,
      "author": "SaraM",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "This suitcase was just what I wanted",
      "text": "This is a great suitcase. Light and easy to push",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Williams",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Great",
      "text": "Fulfilled all my expecrations. Performed well and survived rigorous foreign travel and allowed me to organize carry-on packing.",
      "rating": 5.0,
      "verified": true,
      "author": "Buck",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Five Stars",
      "text": "Very Easy to roll, nice storage pockets, decent space, and nice looking. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "K Holla",
      "helpful_votes": 2,
      "publication_date": 20171018
    },
    {
      "title": "Great Purchase",
      "text": "Reliable, sizeable and fits into every cabin luggage bin so far. The four wheels make it easy to handle. Definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161204
    },
    {
      "title": "Light and sturdy",
      "text": "Superbly made suitcase, it’s the lightest I could find and it’s very sturdy. I travel a lot and this suitcase proves itself repeatedly. It’s easy to role as you walk in airports and and the extra light weight, allows me to take more items when I go abroad. I highly recommend this suitcase.",
      "rating": 5.0,
      "verified": true,
      "author": "OB100",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Five Stars",
      "text": "Durable and maneuvers very well...just wished it is slimmer & lighter for international use.",
      "rating": 5.0,
      "verified": true,
      "author": "MClynn",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "easy to pull",
      "text": "Light, easy to pull, and carry on acceptable for airlines",
      "rating": 5.0,
      "verified": true,
      "author": "Penelope0108",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Five Stars",
      "text": "Awesome piece of luggage. Great value buying from the Amazon warehouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy C.",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "More room than I had hoped and looks great and is easy to carry/rolls well",
      "text": "Exactly what I was looking for. More room than I had hoped and looks great and is easy to carry/rolls well. Spacious and great organization. Comes with two TSA approved locks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Five Stars",
      "text": "Great luggage! I bought it for my husband because mine has held up beautifully",
      "rating": 5.0,
      "verified": true,
      "author": "Milka",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Great for business travel",
      "text": "My wife travels frequently and she loves it. Great quality and easy handling",
      "rating": 5.0,
      "verified": true,
      "author": "Mark007",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Durable and rolls nice.",
      "text": "Very sturdy and light! Rolls nicely with huge wheels and easy to open.",
      "rating": 4.0,
      "verified": true,
      "author": "Shark",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Broke almost immediately",
      "text": "The handle stopped popping down after the first trip. One of the pipes inside must be misaligned. I haven’t got the time to take it to a repair shop or send it back. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Nice carry-on bag",
      "text": "Gift for my daughter. She loves it...lightweight, spins and walks easily and plenty of room inside.",
      "rating": 5.0,
      "verified": true,
      "author": "MiMi",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Loved it - took it on a three week trip ...",
      "text": "Everything it said it would be. Loved it - took it on a three week trip to Europe and it worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Houghton",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Great business bag",
      "text": "I searched for a professional business carry on luggage and read a few atlrticles about the good ones under $100. This was didn’t appear so frequently and I was debating between another Samsonite case but it didn’t look as business savvy. I traveled with this one this week and it was great, large wheels, spin great, bag is small but could pack everything I needed. It is missing a special case for shirts which I had in my previous one and while this bag is for sale on amazon, it says it is not for sale on the Samsonite site as it’s from an older collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Amir Halevy",
      "helpful_votes": 2,
      "publication_date": 20171118
    },
    {
      "title": "very happy with this purchase",
      "text": "Very, very happy with this purchase. I use the case to carry samples. Buying two more today!",
      "rating": 5.0,
      "verified": true,
      "author": "Towelman",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Really like this bag.",
      "text": "Really like this bag. The front storage compartments could be a bit more flexible. Perfect size and wheels are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Annice bender",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Nice color, holds up well",
      "text": "Nice bag exactly as described and pictured. Holding up nicely for about a year now through multiple trips for work and holiday.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Dolan",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Well made albeit huge.",
      "text": "This suitcase is huge. When full of women's clothes for a Study Abroad program it weighed 68 lbs. So, if you're not flying business+ class be prepared to pay a heavy baggage fee. If you're not traveling by air, then this will hold everything you could possibly need. Well made and easy to manage.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeberama",
      "helpful_votes": 4,
      "publication_date": 20170820
    },
    {
      "title": "Great item",
      "text": "Holds a lot , great size and color, spinner wherls are great",
      "rating": 5.0,
      "verified": true,
      "author": "MariB",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Five Stars",
      "text": "Just like i expect....we will see if is also resistant in traveling...",
      "rating": 5.0,
      "verified": true,
      "author": "Stefano Patteri",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Well constructed",
      "text": "As advertised. Well constructed. Worth the extra money for quality brand/product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Great piece of luggage!",
      "text": "It’s quite roomy, lightweight and offers very good organization. Easy to maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Small but plenty of room for carry on items. ...",
      "text": "Small but plenty of room for carry on items. Light weight and wheels roll really well. Delivered on time with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Kela Johnson",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "It’s the Bomb! (Not literally)",
      "text": "Great product for the $! Love the 4 wheels! Best money spent in whenever I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio H",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "One Star",
      "text": "Only used twice and main front zipper broke off and main zipper broke while traveling.",
      "rating": 1.0,
      "verified": true,
      "author": "shadestoolate",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Great Carry-on Bag That Fits in the Overhead Compartment",
      "text": "Roomy, smooth-operating handle, sturdy zippers, smooth-action rollers in all directions and lightweight. Everything I’ve been looking for in a carry-on bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Great size and functionality!",
      "text": "Great size and easily fits clothes for week long trips. One pair of shoes, toiletries, and clothes fit well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark R Sardina",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Samsonite",
      "text": "Much lighter than my other Samsonite luggage and easier for me to use on trips",
      "rating": 5.0,
      "verified": true,
      "author": "Nora S Stephens",
      "helpful_votes": 0,
      "publication_date": 20170218
    },
    {
      "title": "Great small suitcase!",
      "text": "Great bag, plenty of room inside. Rolls very nicely. Feels sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Gkap",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Good for the price.",
      "text": "As expected. Handle seemed a little wobbly but worked fine for my first trip.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacey ",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "The perfect small carryon.",
      "text": "Love the rotating wheels. Very roomy, Carrie's more than you would expect. Lightweight.wellmade.",
      "rating": 5.0,
      "verified": true,
      "author": "Clarence R. Walton",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "... I decided to get a new one and II love it! it's exactly as I expected",
      "text": "I have the same exact suitcase and used it 20 to 30 times a year for travel and it was looking old and one so I decided to get a new one and II love it! it's exactly as I expected!",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 3,
      "publication_date": 20161121
    },
    {
      "title": "Best Carryon",
      "text": "This bag is everything I was looking for. Light weight, roomy inside, and sturdy. It doesn't fall forward when unattended. Love the spinner wheels as well. Perfect for 1-2 night trips. Maybe even 3 in the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "LINDA",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Nice for world travel!",
      "text": "Nice and lite and seems sturdy too. We travel to Asia a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Patterson",
      "helpful_votes": 3,
      "publication_date": 20170105
    },
    {
      "title": "Superb value",
      "text": "Lightweight, sturdy, and very easy to maneuver through crowded airports and long lines.",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Walt",
      "helpful_votes": 4,
      "publication_date": 20170203
    },
    {
      "title": "Great size and quality.",
      "text": "Great quality suitcase. Wheels work perfect - love the size.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 3,
      "publication_date": 20170220
    },
    {
      "title": "It's advertised as being 21\" tall but really measures around ...",
      "text": "It's advertised as being 21\" tall but really measures around 26\". I bought it to be a carry on but have to return it since it's probably too large to be allowed as a carry on. Just letting you all know so you don't make the same mistake I did (especially if you have to pay for return shipping too).",
      "rating": 1.0,
      "verified": true,
      "author": "PB",
      "helpful_votes": 9,
      "publication_date": 20171201
    },
    {
      "title": "Five Stars",
      "text": "This is so lightweight and easy to roll around. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Heinrich",
      "helpful_votes": 3,
      "publication_date": 20170117
    },
    {
      "title": "Very well made",
      "text": "I haven't used it yet, but the it arrived on time and in good condition. The suitcase is beautiful and very well made. It looks perfect for a long weekend.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20171122
    }
  ],
  "product_meta": {
    "title": "Samsonite Mightlight 2 Softside Luggage with Spinner Wheels, Black, Checked-Large 30-Inch",
    "description": "Size:Checked-Large 30-Inch| Color:BlackSamsonite is reinventing lightweight once more Might light 2 combines a lightweight, sturdy frame with consumer preferred travel features. With a sleek design and spherical spinner wheels, you will turn heads as you easily maneuver through your travels. Body dimension: 30.5 x 20 x 11 inches, Overall Dimension: 33.5 x 20.25 x 12.5 inches.",
    "rating": 4.4,
    "feature_bullets": [
      "Four multi-directional spherical spinner wheels for easy mobility",
      "Constructed of ultra lightweight nylon fabric with samguard water-resistant coating for strength and durability",
      "Integrated carry-handles provide comfort when lifting a fully packed case",
      "Ultra lightweight beveled alloy pull handle. Carry On Sized - Luggage designed to fit in most airlines overhead compartments. May not conform to some airlines carry-on standards",
      "Body Dimensions: 30.5 x 20.0 x 11.0 (inches). Overall Dimensions: 33.5 x 20.25 x 12.5 (inches)"
    ],
    "specifications": {
      "Product Dimensions": "30 x 20 x 11 inches",
      "Item Weight": "8.8 pounds",
      "Department": "Unisex-adult",
      "Manufacturer": "Samsonite Corporation",
      "ASIN": "B01HD7S0KY",
      "Item model number": "75861-1041",
      "Customer Reviews": "4.4 out of 5 stars219 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#503,524 in Clothing, Shoes & Jewelry",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Luggage",
      "Clothing, Shoes & Jewelry",
      "Luggage & Travel Gear",
      "All Departments"
    ],
    "price": 173.93
  }
}