{
  "website_summaries": [
    {
      "verdict": "The moderately priced ViewSonic VP2468 is a 24-inch monitor that delivers solid performance and offers a generous assortment of ports, settings, and ergonomic adjustment options.",
      "pros": [
        "Accurate colors",
        "Solid grayscale performance",
        "Robust feature set",
        "Energy efficient"
      ],
      "cons": [
        "Lacks speakers",
        "Resolution tops out at 1080p"
      ],
      "aspects": {},
      "publication_date": 20170119,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is a great monitor. I'm a professional photographer and I needed ...",
      "text": "This is a great monitor. I'm a professional photographer and I needed another monitor since I has having serious troubles color matching on my old one. Since I shoot a lot of models, and since most of the models and photographic professionals are on Instagram, I really wanted what was on the screen to match what the models would see on their phones. I know, right? The times we live in.... Anyway, I took the monitor out, plugged it into my MacBook Pro, edited a photo, and uploaded it to my phone. Without any callibration, the photos matched perfectly. All of the extra USB slots in the back and the ability to daisy chain monitors is also great. Thanks ViewSonic!",
      "rating": 5.0,
      "verified": true,
      "author": "M. crislip",
      "helpful_votes": 47,
      "publication_date": 20180413
    },
    {
      "title": "2015 Macbook Pro 15\" via dual Thunderbolt Ports",
      "text": "I could not be happier. I have two of these hooked to a 2015 Macbook Pro 15\" via the Thunderbolt ports. Work perfectly. The large size and SUPER SHARP image quality is impressive. I could not be happier with these ecept it would be nice to have a lightning hub built into them and there seems to be some issues with things like wireless mice plugged into the USB hub built in. Many other USB items work fine.",
      "rating": 5.0,
      "verified": true,
      "author": "2manytoyz",
      "helpful_votes": 35,
      "publication_date": 20180703
    },
    {
      "title": "Beautiful accurate 4k monitor",
      "text": "Beautiful monitor, vivid accurate colors, great size, excellent off angle viewing, stable and flexible stand. Best 4k monitor I have gotten to use thus far, great for photo and video editing along with photo and video consumption, everything looks great. Haven't been able to identify a single dead or stuck pixel which is also definitely a plus. There are cheaper 4k monitors out there but they're just not this good, well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilfurbal",
      "helpful_votes": 15,
      "publication_date": 20180326
    },
    {
      "title": "after 6 months my monitor has vertical lines",
      "text": "Overall I liked the monitor. Unfortunately, I started my day with vertical lines so I cannot really recommened purchasing this item.",
      "rating": 1.0,
      "verified": true,
      "author": "M.vim",
      "helpful_votes": 17,
      "publication_date": 20181012
    },
    {
      "title": "fantastic picture and well worth the investment",
      "text": "Based on extensive web research, I purchased this monitor for photo/video editing work. Right out of the box, I was amazed by this monitor. The construction is very solid and the picture is fantastic. The color, contrast and clarity of this monitor are stellar, easily making this the best monitor I have ever used... all with factory settings. The ability to rotate the monitor to portrait orientation will be very handy from time to time.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt S",
      "helpful_votes": 9,
      "publication_date": 20180423
    },
    {
      "title": "Nice monitor - get a different stand",
      "text": "This monitor's very good in most every respect, but the stand has a significant limitation: its lower height limit. At best, it holds the top of the monitor 20 inches above the desktop. Unless you plan to saw some length off the legs of your desk, prepare to have an aching neck at the end of a workday, because you'll be craning it up perpetually to take in in the top of this enormous screen. We're ditching the supplied stands for something that will enable holding the monitor with its bottom edge touching the desktop and angled slightly up, a much better ergonomic position for extended use.",
      "rating": 4.0,
      "verified": true,
      "author": "qwerty",
      "helpful_votes": 3,
      "publication_date": 20200328
    },
    {
      "title": "Annoying pop up will not go away",
      "text": "Bought this monitor with the intent of photo editing. I have it set at 4096x2160p. Due to this, view sonic put some pop up dead center of the screen telling me to put the monitor to 3840 instead for \"best resolution\". I don't want to, and every time I turn on my monitor its stuck there and cannot be removed. Very annoying, wish i could get a refund on this item. Renders the monitor useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew ",
      "helpful_votes": 5,
      "publication_date": 20191220
    },
    {
      "title": "This monitor Just stoppped working less than three months form purchase.",
      "text": "When I got this monitor in June is was great. I use it as a second monitor to edit video but a week ago (September), it just stopped connecting to my computer. It still comes on but says there is no connections and the computer will not recognize that it is even plugged in. I changed the cables but it still will not connect. I have contacted ViewSonic as the Amazon return time is over. I sure hope they honor their warranty. I'll let you know if they do.....",
      "rating": 1.0,
      "verified": true,
      "author": "S. H. ",
      "helpful_votes": 5,
      "publication_date": 20190916
    },
    {
      "title": "Impressive.",
      "text": "Great so far, no dead pixels and the usb ports are a great bonus. I have not tested the auto-rotate feature because I have it connected to my notebook and this feature will not work as a secondary display. Will update after I have finished my pc build. P.S. go to the viewsonic support page for the latest drivers for the added features. June 2019 A year and a half later and still no complaints, the auto rotate works great. It comes in handy when editing pictures or reading pdf documents. I am about to buy another one for a dual monitor setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Blue",
      "helpful_votes": 6,
      "publication_date": 20171125
    },
    {
      "title": "Purchased Twice: Received Damaged/Defective Monitors Twice",
      "text": "I purchased this twin-pack from Amazon twice. The first time the monitors arrived, one was DOA -- wouldn't turn on. The second time, the monitors worked twice for around a week. Unfortunately, one of the monitors developed vertical pixel lines and needed to be returned. Picture quality (and color features) were nice while they lasted, but the monitors have real quality control problems.",
      "rating": 1.0,
      "verified": true,
      "author": "Cuckoowasp",
      "helpful_votes": 4,
      "publication_date": 20200509
    },
    {
      "title": "Excellent Commercial grade Monitor",
      "text": "I prefer monitors with DisplayPort and USB hubs built-in. This fits the bill and works great when using optional hardware to mount an Intel NUC to the VESA mount. It does require some modification to the stand to make it work with the ViVo NUC VESA Mount. All you have to do is break off the tabs on the top of the stand and mount the bracket with a set of spacers. This monitor has a very thin bezel and sharp image with great color. Highly recommended, even over Dell Ultrasharp. I do wish there was a soundbar available for this monitor. Otherwise you cant go wrong!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Crews",
      "helpful_votes": 7,
      "publication_date": 20181105
    },
    {
      "title": "Fabulous",
      "text": "I am an advanced amateur photographer. I wanted a monitor designed for photo editing. I had a Ben Q monitor in mind but it was not released when I ordered ViewSonic. I thought I will check it out and if not pleased return it and wait for Ben Q. After I set up the monitor, I was so impressed that I decided to keep it. I do not know how good it is for gaming, but for photo editing, I am sure a monitor does not get better than this. It has taken my editing to a new level. I have an LG 4K monitor too but there is no comparison in performance and picture. Very happy with my decision.",
      "rating": 5.0,
      "verified": true,
      "author": "salman rashid",
      "helpful_votes": 2,
      "publication_date": 20190722
    },
    {
      "title": "Premium quality 4k Monitor",
      "text": "I have a few 4k monitors, displays ranging from 24 inch to 28 inch, LG, Acer, Samsung, and finally this ViewSonic VP2768-4K PRO Professional 27\" 4K Monitor with 100% sRGB Rec709 14-bit 3D LUT. Obviously, the ViewSonic is the most expensive among them, but it's really worth my money. The packaging was secure. Settings are acceptable to me out of the box. I've watched a few 4k movies on this monitor. The color and image quality rivals my Sony XBR55A8F 55 inch OLED television.",
      "rating": 5.0,
      "verified": true,
      "author": "DiCaprio",
      "helpful_votes": 4,
      "publication_date": 20190620
    },
    {
      "title": "Great monitor. Beautifully high resolution and fantastic color saturation",
      "text": "Great monitor. Beautifully high resolution and fantastic color saturation. I haven't calibrated the color... it looked great right out of the box. I was impressed with how well packaged the monitor came. Packaging designed to get the monitor to its destination without damage almost without regard to how the external box is treated.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Pitt",
      "helpful_votes": 4,
      "publication_date": 20180323
    },
    {
      "title": "Truly a bargain",
      "text": "I LOVE this monitor. The color and vibrancy is amazing, especially at this price. Last year I bought the VP2785-4K 27\" 4K for $866. I wanted a pro quality monitor for Photoshop and video editing. The 14-bit was a plus, along with the fact that it was factory calibrated. Now this VP2768 is available at a much lower cost and it comes with a printout of the calibration also. Couldn't resist so I bought it and ended up putting the VP2785 on my right side and only use it when I need the extra real estate. I find the VP2768 to have a significantly better look.",
      "rating": 5.0,
      "verified": true,
      "author": "Luv Am A Zon",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Amazing Monitores !!!!",
      "text": "For the price you cannot ask for a better video editing or photo editing monitors. I am extremely happy with them and use them on a day today basis. They come out of the box very well calibrated even though I did use the spider checker calibrator to get them perfectly calibrated.",
      "rating": 5.0,
      "verified": true,
      "author": "David D",
      "helpful_votes": 4,
      "publication_date": 20190305
    },
    {
      "title": "Photo and video editing",
      "text": "Good color accuracy right out of the box. I was amazed at the difference when comparing the same photo side-by-side with my LG monitor. The IPS viewing angle along with anti glare screen helps with reviewing every corner of my photos. I love that I will now be able to edit and view my 4K video edits on the same screen. Primary use is photo and video editing.",
      "rating": 5.0,
      "verified": true,
      "author": "Drake McLemore",
      "helpful_votes": 2,
      "publication_date": 20200330
    },
    {
      "title": "Amazing monitor for design",
      "text": "I’ve had this monitor for a few months now, and I’ve been using it everyday for multiple hours at a time. This has been my favorite monitor I’ve ever used. I use it primarily for motion graphic design work, so a lot of Adobe Photoshop and After Effects work. I really don’t have any complains about the quality of the monitor itself. Color is spectacular. The only con that I can think of is it is 60hz which is not bad for design, but not ideal for gaming. Don’t get me wrong, I can still game fine with this monitor, but having a higher refresh rate would be awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Washed out colors on a 13\" MB Pro Retina.",
      "text": "I bought this to connect to a 13\" MacBook Pro Retina. The connectivity options on the monitor are good but the screen quality just isn't there. My MB Pro's Retina screen is more vivid than this monitor. The VP 2768 looks washed out and there's not much you can do to change it. It's basically pre-tuned and the controls give you little flexibility. It's OK but disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "West LA Guy",
      "helpful_votes": 2,
      "publication_date": 20200526
    },
    {
      "title": "Great Monitor for an Outstanding Price",
      "text": "This is an excellent monitor, as a photographer who often sells his work I need to be able to depend on the accuracy of its color rendition. I have calibrated it and am very happy with the results, I know that what I send to the printer or print at home will be exactly what I see on the monitor's screen. I highly recommend this monitor for both its quality and price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180914
    },
    {
      "title": "Professional monitor",
      "text": "First monitor had dead pixels, but they exchanged it without any problems and the new one is perfect. I love the color profiles and the built-in USB hub, but remember if you turn the monitor off you're turning the hub off too. I have the monitor in my music studio and I sometimes turn it off and control the computer from the house via Splashtop, so I have all my USB drives plugged directly into the computer. It's not really an issue. As far as screen quality and color profiles go, you can't get any better for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Lungbutter",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "Highly reviewed for a good reason",
      "text": "Insanely clear calibration out of the box -- each monitor calibrated at factory before shipping. Colors are extremely true and screens can get very bright. Build is very sturdy, attractive, and easy to setup. I'd agree with others that the daisy chaining is a bit tricky and could've come with clearer instructions though. Overall would buy again, especially at a <$400 price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 6,
      "publication_date": 20180711
    },
    {
      "title": "Defective monitor",
      "text": "I bought this monitor but it came with failures. On the right side there are 4 vertical colored stripes. Usually red but may change depending on the background color to yellow or blue. It's not a video card problem, I tried connecting only the monitor and the lines are still there.",
      "rating": 1.0,
      "verified": true,
      "author": "Fernando O.",
      "helpful_votes": 17,
      "publication_date": 20180920
    },
    {
      "title": "Solid Choice in Its Price Range",
      "text": "I'm no monitor expert, but as a prosumer level user, it seems reasonably well-built and full-featured. There are no obtrusively distracting manufacturer logos, buttons or wide bezels in your field of view which is considerate of Viewsonic (looking at you Philips and just about everyone else - cut the ads already!). The panel itself seems marginally above average for a typical IPS panel circa 2019-2020 though it still exhibits usual characteristics of IPS panels in general. I doubt IPS panels will get much better and it's going to take radically better technology like OLED to make an appreciable difference with black level and vibrancy no matter how much you're willing to spend.",
      "rating": 5.0,
      "verified": true,
      "author": "Am_Buyer",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Was Really Happy...but then",
      "text": "Ok received my monitor did exactly as directions said for my MacBook pro...looked great! but then flickered for a min then went blank🙁.... Amazon replaced ( never calling in again 10 min took 1 hr, could have been 2 min with the computer) I write review again with \"new \" monitor replacement",
      "rating": 1.0,
      "verified": true,
      "author": "Louis",
      "helpful_votes": 3,
      "publication_date": 20191214
    },
    {
      "title": "Gorgeous monitors!",
      "text": "Bought 2 for an 7-monitor setup (2 workstations). About to replace 3 more in that setup with these 2K monitors. That will make all graphic design/primary/secondary monitors 2K while leaving 1 monitor on each station for gaming (1080P 144hz gaming monitor).",
      "rating": 5.0,
      "verified": true,
      "author": "GlennHD",
      "helpful_votes": 3,
      "publication_date": 20190307
    },
    {
      "title": "I absolutely love this monitor",
      "text": "I absolutely love this monitor! The colors are vibrant, and there are no dark areas. My husband is using a basic HP monitor. As soon as he saw mine, he said that when his monitor dies, he wants a ViewSonic. I am using it with an older MacBook Pro, and had no problem getting the two to sync together. I have read that some people have had trouble getting their Mac to recognize the monitor, but I think that happens if the monitor is actually turned off. I believe the monitor needs to be turned on first, then the Mac. The best part of this monitor is the stand. It adds to the price, but it's well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Gal",
      "helpful_votes": 2,
      "publication_date": 20180309
    },
    {
      "title": "SERIOUS DESIGN FLAW! Vertical scan lines when playing video.",
      "text": "The monitor looks great for non-motion graphics but for video editing it sucks! The vertical scan lines faintly appear as soon as you play a video but disappear when you stop. I'm a video editor and fairly technical, also I have a Mac Pro (trash can) with very good video cards. My old Apple monitor never had these issues. Regardless, I tested both Display Port and HDMI inputs and get the same results. Also, it has no speakers. I called tech support but it's been over an hour and no callback, so that sucks too! Overall it would be an awesome monitor if not for these issues.",
      "rating": 3.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "It's a beautiful monitor in every respect",
      "text": "I don't use it for gaming so can't comment about that, but I love this monitor. It has beautiful image quality, of course. And loads of convenience features: it has a built-in USB hub with 4 inputs that's handy, as well as an audio output that you can use to plug in to speakers so you don't have to run a separate cord all the way back to the computer. The included stand works great - you can easily adjust height or forward/backward tilt or rotate the display to vertical or horizontal. I have used ViewSonic products for I think 20 years, and they're still awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve P",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Extremely well calibrated right out of the box",
      "text": "I bought 2 of these and theyre great! I didn't have to do any calibration of either of the monitors when I used a displayport cable! I experienced some added warmth to the color of the picture using an HDMI cable. Picture quality and contrast are fantastic. I'm a photographer and this gets a massive stamp of approval when it comes to color accuracy! My only complaint is some ghosting and tearing when playing video games but nothing that completely ruins the experience. I'm not a hardcore gamer but I play almost daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 2,
      "publication_date": 20200304
    },
    {
      "title": "Excellent Monitor, It's Like a New Experience",
      "text": "This monitor was an excellent replacement for 2 HD monitors. I had a 4 monitor set up, and replaced two of those HD monitors with this one. At first, I felt like I was at a loss of the 4th monitor, but with the virtual and physical reclamation of desktop real estate, I feel like I've gained. I purchased this monitor for editing and reviewing 4K video and for giving me more desktop space to use and view Adobe apps. As a graphic designer and video editor, I can see how I've gotten along without a 4K monitor. Certainly worth the purchase. No complaints. ViewSonic makes great monitors.",
      "rating": 5.0,
      "verified": true,
      "author": "Shank Shizank",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "You are not worthy",
      "text": "As of this purchase, I only talk to people with 4K IPS screens since now I am a member of the luxury elite. There are zero bad pixels. I have no complaints of any kind. My old 1080TI runs it fine, though I use it for art rather than gaming. The luxury stand intrudes forward on my desk a bit, but the alternative is having it fall over or buying a luxury floating arm mount and bolting it into the desk. It did not come with bars of gold like I was hoping, so even though I am now a member of the elite, I may be driving my old 99 Lexus with 300K miles for a while longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Herbert F.",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "good value",
      "text": "the color on this monitor is amazing. my purchase was an open box item from the manufacturer. I would say the price of 350 or less is a good value. some merchants try to charge a lot more at a price point of near 500 dollars but I would not buy it at that price. overall have used it for work for a few months and i am very happy. no headaches or flickering issues. The word documents have a lot more clarity since it is a 2k monitor. I stayed away 4k monitors since you really need the best kind of software to run the 4k. 2k is a great improvement over the normal 1080 /1200 monitors.",
      "rating": 5.0,
      "verified": true,
      "author": "mihail34",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Fantastic monitor",
      "text": "I have been using this monitor for a couple of weeks now and no problems. Color and clarity is great and I like the big screen. What I like most is how easy you can adjust the monitor - up, down, left to right and vice versa. There many great, professional reviews below, so I will not bother.",
      "rating": 5.0,
      "verified": true,
      "author": "commuterguy",
      "helpful_votes": 5,
      "publication_date": 20170320
    },
    {
      "title": "Large, minimal border display but faulty USB hub",
      "text": "This 32\" monitor is gorgeous. The border is thin without any branding which only makes it look better. It works with Macs using Thunderbolt (or HDMI) However, the USB hub has issues. If I connect my wireless mouse (USB dongle) to the monitor, the mouse movement becomes erratic and pauses frequently. Moving it back to my MacBook Pro fixes it. Furthermore, there is NO firmware updater for this monitor for macOS. It's Windows only. Hello? It's 2019. Most people own Macs.",
      "rating": 4.0,
      "verified": true,
      "author": "ROBERT L.",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Like every feature of this monitor",
      "text": "Like every feature of this monitor. The base is rather large, but of course that makes it more stable, and I simply place other items on top of the base, so essentially it doesn't take up much desk space. I like the adjustments, especially that you can swivel it without moving the base. It'll tilt, swivel and raise or lower to any position you may want. It's just the right size for my photo editing without being too large for my desk. Previously had Viewsonic monitors that gave me many years of service.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Bruce Good",
      "helpful_votes": 4,
      "publication_date": 20170307
    },
    {
      "title": "Excellent Computer Monitor",
      "text": "I have always relied on dual monitors. I use this monitor connected to a MacBook Pro and it is far superior to the dual monitor system. I have a magnificently large working area on the screen and can comfortably work with four windows open simultaneously. This was a huge productivity booster for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "It started out great but started going black.",
      "text": "I'm not sure why. My Macbook Air is only two years old...I bought a newer gold plated HDMI cable...I bought a new adapter for my mini-port to HDMI...all to no avail. I switched back to my old second monitor and that one does not go black or even flicker. My ViewSonic started out great but started going black about one month into use. It started acting like the power would turn off for a second. Then gradually it started repeating the blackness more and more...occasionally up to 3 seconds then come back to life. I'll be getting in touch with ViewSonic soon. Busy with life. Hopefully the 3yr warranty works for me.",
      "rating": 2.0,
      "verified": true,
      "author": "jdog",
      "helpful_votes": 2,
      "publication_date": 20190322
    },
    {
      "title": "Great Clear Accurate Color Good Price",
      "text": "Starting using ViewSonic monitors a few years ago when I required more accurate color comparison for packaging material inspection. I would use the monitor for the inspection standard and compared the image to the physical part. I also used it to review images sent from suppliers to compare colors visually. Now I also use them for my own personal monitors as they hold up well and have great color when looking at photos and watching videos. I highly suggest you consider this level of color accuracy as it makes a difference. This is more or less an entry level color accurate monitor but, if that makes a difference to you this is a great monitor at a great price.",
      "rating": 4.0,
      "verified": true,
      "author": "Robin G.",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Incredible Colors",
      "text": "I needed a large monitor to attach to my laptop. The external monitor I had was only half the resolution of the laptop resolution. I was stunned by the colors of this monitor. Only drawbacks for this monitor is no built-in camera (something needed during the pandemic shelter-at-home time and having online meetings), and, it does not have built-in speakersm so can attach this monitor to a DVD player. If you can live without the camera and speakers, then this monitor is a great buy!",
      "rating": 4.0,
      "verified": true,
      "author": "L. Wilson",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Always ON cluster of red after 6 months",
      "text": "After just 6 months I it developed cluster of 'always on' red pixels in the top left corner. Also the black is true black only if you look straight from 90 degrees, which, considering that the monitor is 32\" means that you see true black only in the middle and not towards the edges.",
      "rating": 3.0,
      "verified": true,
      "author": "BluCat",
      "helpful_votes": 2,
      "publication_date": 20191006
    },
    {
      "title": "Poor quality",
      "text": "Could not get my computer to recognize the monitors. Tech support were clueless. Very flimsy plastic",
      "rating": 1.0,
      "verified": true,
      "author": "SIMON M HINCHLIFFE",
      "helpful_votes": 4,
      "publication_date": 20190808
    },
    {
      "title": "My previous Viewsonic has been running for over 13 years!",
      "text": "I wanted a larger, brighter monitor (I'm a photographer / graphic designer). My old one was starting to fade a wee bit and I wanted a sharper image. This one fits the bill. Colors are fantastic and text is tack sharp. I've owned 2 other Viewsonic monitors and have never had a problem with them so I decided to stick with that brand. I especially appreciate the ease of adjusting the height of the monitor and the fact that this one swivels which makes it easy to work with a client sitting in my office. Haven't had it long enough to rate the durability and haven't needed any tech support.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "27-inch 4K is fantastic!",
      "text": "Very impressed with this monitor. Definitely worth the money and very happy with it. Words to the wise - it is easy to get screen burn when working with graphics programs. I think this is because of how awesomely bright it is and how static the menus and windows of Adobe products are while you are working away for hours. My recommendation if you are an artist is to just be aware that this is an IPS panel and screen burn is a reality. Don't leave your screen on full blast for more than 10 minutes unattended. Get a moving screensaver or just have it shut off after being idle for 10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "kuro",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Excellent monitor - but who came up with the UI",
      "text": "Picture quality etc. are all very good and adequate for the price. My only issue with it is the User interface and the localization of the buttons. They are at the backside, while their function is indicated on the screen. So its tough to really intuitively find the correct button. Why they were not on the side is beyond me, probably to preserve the thin bezel but this is suboptimal. Otherwise great device.",
      "rating": 4.0,
      "verified": true,
      "author": "jg",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Very good picture",
      "text": "This is a very nice monitor. Easy to set up and works well with my much older computer. I did need to get a newer , more expensive cable for the connection because the newer models have different connections than the older video cards. (My card is only 2 years old but this last year has brought lots of changes in video connections and the types of ports used)",
      "rating": 5.0,
      "verified": true,
      "author": "Judi F",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Nice new 27 inch monitor for photo editing",
      "text": "The monitor worked as stated right out of the box (easy assembly). Default is 2560 x 1440 upon connecting to MacBook Pro (mid-2012) using mini-DisplayPort to mini-DisplayPort cable (purchased separately). Monitor on included stand fits right behind the MBP with easy viewing of the entire 27\" monitor. One only needs to learn the location of connection ports and control buttons. Will update if any issues arise.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric C. Niederhoffer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Excellent monitor, but then again, I am no expert.",
      "text": "I probably paid for features that I will never use, so I might not be the best reviewer here. This replaces a less expensive, different brand 24 inch screen that came DOA and was sent back. I'm driving ViewSonic VP2468 with a laptop that has a default of 1920x1080 at 60Hz, which is the sweet spot for this monitor. I'm connecting with a USB-C to HDMI cable and have had no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill in Schaumburg, IL",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Gorgeous 32inch professional monitor",
      "text": "I purchased this monitor for photo and video editing. I researched options extensively, and found this to be the best features for the value. Full srgb color space. Easy setup. Fast and responsive with beautiful color rendition. Lots of screen real estate. People complain about the lack of front buttons for the on-screen menus and, it's true it takes some time to get used to using the buttons blind with your right hand. However, there's also software (vDisplay) to accomplish the task.",
      "rating": 5.0,
      "verified": true,
      "author": "BillM-Raleigh",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Very nice",
      "text": "The monitor does a nice job for my photography...Very little adjustments needed. What I see on screen is what I see in print. My printer is an Epson 3880 so that will make a difference from a low priced printer",
      "rating": 5.0,
      "verified": true,
      "author": "The Perfect Image",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Excellent quality sRGB Color Calibrated monitor",
      "text": "I do a lot of photo processing. I needed two color calibrated monitors. Based on the reviews and descriptions, I ordered two of them. They even came with certificate of color calibration. So far, I love them. If anything, brightness is a little high. But love the colors and it makes my photo processing easier.",
      "rating": 5.0,
      "verified": true,
      "author": "SeattleGuy",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Beautiful screen",
      "text": "My 2012 Mac Mini can't drive a 4k display, but it can go up to the resolution of this 2650x1440 display - and it looks great! Bright without being blinding, and the anti-glare coating works even better than the Dell U2412 it replaced. Also has the most connectivity options of all the monitors I looked at. Very quick to assemble and set up. Only minor drawback is the awkward placement of the adjustment buttons on the back side - but you'll only need to do that one time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Patterson",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "was expecting a better quality",
      "text": "Not happy with the monitor, was expecting a better quality but there is a brightness deviation on the left and the right side. The left side is so much brighter and it is noticeable on any solid color. I paid the extra price for a better quality pre-calibrated monitor but QC is not there on this monitor. They just send you a test reports that everything is excellent with 99.6% luminance variation and 0.70 average delta E but in real experience I see a a bad quality IPS monitor with not a pleased view.",
      "rating": 2.0,
      "verified": true,
      "author": "bcsK",
      "helpful_votes": 10,
      "publication_date": 20180605
    },
    {
      "title": "I don't need glasses anymore",
      "text": "I am a professional photographer, I need vibrant saturated colors. As soon as I changed the setting on this monitor to Photography mode. All Colors Popped and I was speechless !! I've never in my life seen color so realistic, true to life. When I print my images they are SPECTACULAR . This is a \"frameless\" monitor, I want 3 more to make one huge monitor !!",
      "rating": 5.0,
      "verified": true,
      "author": "Majik Imaje",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Almost perfect monitor",
      "text": "Excellent monitor for multi tasking and graphic design. Colors are pretty accurate out of the box. I plan on using Spyder 5 for further color adjustment but doubt it will make a noticeable difference. I deducted 1 star because it pivots too easily and does not click or lock when perfectly horizontal. I find myself keeping adjusting the pivot and not being sure if it's perfectly horizontal.",
      "rating": 4.0,
      "verified": true,
      "author": "Fashion Talk",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great monitors. Precalibrated for uniformity with a dual setup.",
      "text": "I’ve been wanted a pair of 4K monitors for a while. I liked these because they were precalibrated. I have the two monitors side by side and the color and brightness uniformity are very close. At some point, I’ll recalibrate then as the age but they’re fine for now. Resolution is great and the thin bezel work well for a dual setup.",
      "rating": 5.0,
      "verified": true,
      "author": "average consumer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Amazing, while they worked",
      "text": "I purchased two of these monitors, and when they work, they're amazing. Only minor complaint is that one of the monitors wouldn't persist a blue-light filter setting between power-cycles. That said, within 6 months one has problems with backlight strobing affecting about half the screen (8 alternating vertical stripes of strobe/no-strobe). I've reached out to ViewSonic support, and will update this post if I get a response.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric Collins",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Excellent value for design monitor",
      "text": "I bought this after accidentally cracking the screen on my 24” LG, and am actually glad it happened—this is a huge improvement in picture and build quality. I use it for professional graphic design paired to my MacBook Pro. The only drawbacks I’ve found is it’s difficult to tweak adjustments, because 1) tiny buttons on the back and 2) adjustment UI is not intuitive in making choices. Haven’t found a decent online guide yet. Overall, for the money this is a great value.",
      "rating": 4.0,
      "verified": true,
      "author": "Silo",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Wow ViewSonic is back!",
      "text": "I used to buy ViewSonic back in the day - more bang for the buck for a monitor for my Mac. This monitor is stunning, the anti-glare coating is perfect for our studio work. We do broadcast design and mograph for TV shows. I hope ViewSonic makes a 5k or 6k version of this monitor, and perhaps in 34\"+ size. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "CJWA 805",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Quality control issues",
      "text": "Decent monitor as far as color and brightness go, it seems fairly accurate with a calibration. But there are several blemishes that are noticeable on my monitor, including some weird blemishes under the screen. It doesn't really look like a dead pixel, but it is under the glass so I can't really do much about it.",
      "rating": 3.0,
      "verified": true,
      "author": "BobBob",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Excellent picture quality.",
      "text": "A really excellent monitor so far only had it for a few hours but it is way ahead of my generic type monitor I had for over four years. I am only sorry now that I did not upgrade sooner. One small issue the mounting screws do not seem to sit flush when attached which I find odd. Comes with all the required cables and a print out of the DE values from the factory calibration.",
      "rating": 4.0,
      "verified": true,
      "author": "Ozzy B.",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Overpriced for what you get, but alas, a very pretty looking monitor.",
      "text": "If the monitor was working properly it would be very nice, but I had two dead pixels upon arrival. Also, the button layout is counter intuitive and a pain to access. I returned this one. Save your money and go with the BenQ PD3200U, they have some great deals on refurbished ones on eBay. I know the reviews are mixed for that one, but I went with it and I'm very happy I did!",
      "rating": 2.0,
      "verified": true,
      "author": "Peters",
      "helpful_votes": 2,
      "publication_date": 20191225
    },
    {
      "title": "Perfect size and color is great",
      "text": "I mainly do video editing and marketing. I needed something I could mount on an arm on my small desk along with my older square 1600x1200 dell. It's awesome. Color is spot on. I mainly use the second monitor for bins and file management so this works out. I have not run any calibration software, but in PS and PR the whites are close enough as is the blacks. This was a really good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "TIMOTHY M MILLER",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "GREAT IMAGE CLARITY - for a fair price",
      "text": "Great clarity, easy to set up - a good value for the money from a reliable brand. I sell on Etsy and Ebay and needed better quality image that my older lap top could provided - so hooked this monitor up and voila - much easier on these older eyes! And allows me to more precisely edit my photos. I was not compensated for this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "An amazing IPS monitor at an unbeatable price",
      "text": "The monitor is well built and comes with a high quality stand that allows for tilt, sviwel and height adjustment. Color reproduction is excellent and very accurate. Great for anything from movie watching to gaming and editing. Overall, I am very impressed for the money! I wish Viewsonic was available in Europe too as it'd be much simpler to buy then.",
      "rating": 5.0,
      "verified": true,
      "author": "Lukas Vokrinek",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Great display and ability to rotate to portrait is key.",
      "text": "Picked this up for portrait display next to regular monitor. Really nice monitor. People that stop by are always commenting on it. The ability to rotate to portrait without buying installing a monitor-arm is the reason I bought it. Sturdy and great display.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluesman",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Outstanding monitor for those who do photographic work",
      "text": "The color calibration of this monitor--out of the box--is perfect. I use it to edit photos for on-line work as well as print products. It is excellent for both. It's an excellent solution for anyone doing serious photo work. The only problem with it is that if you use it in a two-monitor setup, it will make your second monitor look really drab.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen C. Blagg",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Great for images but not text",
      "text": "Photos look amazing on this screen. Text not so much. It’s hard to fine tune this display to get decent quality text. The overall design is very attractive without the frame around the screen. Just a minimal trim that’s flush with the screen. Very nice looking.",
      "rating": 4.0,
      "verified": true,
      "author": "MyPrime",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great",
      "text": "There is virtually nothing to complain about this 1440p monitor. I use it as an auxiliary monitor I will probably buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "jonathan greene",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Excellent high quality screen",
      "text": "I use this monitor for graphics and web design. The color accuracy is fantastic. The custom settings are helpful and the height adjustment with swivel base is perfect. I plugged it in with HDMI and disn't have to do much with the settings. The clarity because of the pixel depth makes crisp edges around shapes and text. I would certainly recommend this to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Olive Stone",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Viewsonic monitors 2-pack",
      "text": "I bought these for my graphics setup and they are awesome. Very nice price point and they are working beautiful together. I was in the market for 2 monitors for a long time and trying to find 2 monitors for zoom meetings and some graphics work, but I could not find ones that were not $400 dollars or so. Then these showed up on my recommendations and yes...bought them and I am very pleased with them. They look great, have a usb 3.0 hub built in and multiple ways to configure. Awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirk Knudsen",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Great computer screen",
      "text": "It's crazy how quickly I'm used to the size of this screen. I use it for programming/ Sketch/ Adobe. The text is very clear. Colors are amazing too. I hooked it up to my MacBook Pro with a USB-C to HDMI cable I bought separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerrit",
      "helpful_votes": 2,
      "publication_date": 20190304
    },
    {
      "title": "Fantastic picture quality...but power supply?",
      "text": "Bought this monitor in early April and have been enjoying its outstanding picture quality for 4 months. A couple of weeks ago, it seemed like the monitor was going into sleep mode too soon, before the power management settings I had set up. But this wasn't the issue because the laptop this is connected to still had the desktop showing. It had been darkening after 10-25 minutes of inactivity, but now it's turning off as I'm using the PC! The power button in back is blue while in use and amber when in sleep mode. Five star performance, less one star for this issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruno Passacantando",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Excellent monitors for video and photography",
      "text": "Viewsonic has long been the standard for monitors in the professional video world. I'm ecstatic to have a new 4k set (I bought 2!). Easy to callibrate and I love the ability to move them up and down and turn in/out as I need to.",
      "rating": 5.0,
      "verified": true,
      "author": "T. L. Clay",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Great monitor!",
      "text": "I like to have a bigger screen to work with when I\"m on my laptop, so I shut the lid on it, use a Bluetooth keyboard and trackpad, and most importantly, hook up to a larger monitor. The Viewsonic gives me great resolution, more real estate to work with when I have multiple files open, and is particularly useful when I'm doing photo editing or hi-res image work. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Steele",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Nice display with missleading advertising.",
      "text": "This is an 8-Bit display. it is extremely sharp with a decent color. I was disappointed to realize that despite all the advertising this monitor was not posting full sRGB.",
      "rating": 3.0,
      "verified": true,
      "author": "I. Fraser",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Unbelievably bad quality control",
      "text": "I ordered 3 of these monitors. One has significant light bleed, one developed a line of stuck pixels after about a week of use, and the 3rd has picture discoloration around the edges.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 2,
      "publication_date": 20190715
    },
    {
      "title": "Reliable and great quality monitors",
      "text": "I’m a Digital marketing admin, graphic designer and digital photographer. These monitors output awesome clarity and color. Super simple to set up. Bought two a few months ago to work with my portable laptop workstation. Used USB-C cable to “daisy chain” with workstation. I’d by a third monitor if i had the desk space!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri Russell",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Excellent choice for video editing",
      "text": "Fantastic color and sharpness. I am using this for editing with Avid and FCP X. Assembles easy and has a great number of inputs and outputs. Fantastic monitor with a fantastic price. I am recommending it to all my editor friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Davis",
      "helpful_votes": 2,
      "publication_date": 20161113
    },
    {
      "title": "Awesome monitor.",
      "text": "Purchased 3 of these. They have been a great product. Color saturation is great. Calibration out of the box is almost perfect. First monitors I have purchased that out of the box, all three looked the same.",
      "rating": 5.0,
      "verified": true,
      "author": "MichelleP",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Exactly what I needed!",
      "text": "Shipped quickly. Easy setup. Beautiful display. User friendly. Love. My old gateway monitor crashed. I wasn’t excited about the unexpected expense but I am loving the upgrade!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shea",
      "helpful_votes": 2,
      "publication_date": 20190303
    },
    {
      "title": "Second monitor just for photos.",
      "text": "Bought it for photos only and very happy that I did.",
      "rating": 5.0,
      "verified": true,
      "author": "RLS",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Great monitor",
      "text": "My Apple Cinema Display died and I really needed a replacement. I paid $1000 for the Apple and for a fraction of the price, this monitor really performs well. Plus this is 27\" and my Cinema Display was 23\". Very happy with this purchase. I've been using it for a while before writing this review. Wanted to make sure I liked it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Smull",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Worked perfect for me",
      "text": "I really like this monitor. It’s super clear and has a great image. Also it’s a great size. I have not experienced the problems other people have mentioned in the reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Echorus",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Nice stand and good for office",
      "text": "The stand is very nice for the price. Only caveat is you can't adjust brightness when it's set to \"RGB\" mode. But there are several other modes you can. My only complaint is using the menu to switch between modes is cumbersome.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff O.",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Outstanding Monitor",
      "text": "I use this monitor for photo editing. The colors and detail on the photos are outstanding. Using the larger screen allowed me to see things in my photos that I have missed in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "G Nicholson",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Awesome Monitor",
      "text": "So far this monitor is awesome. The color is accurate and its bright and crystal clear. It is noticeably superior to the cheaper HP monitor I was using and still have setup as a second monitor. In fact the difference is so drastic that I am buying a second ViewSonic VP2468 to run side by side as a matching desktop extension. Highly recommend View Sonic products in general.",
      "rating": 5.0,
      "verified": true,
      "author": "gregg",
      "helpful_votes": 3,
      "publication_date": 20170104
    },
    {
      "title": "Awesome Product!",
      "text": "If you have existing dual monitor stands...this purchase is an easy solution. Two monitors in a box, ready to go. They look good and they perform even better. I especially like the auto rotate feature for the monitors. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Nichols",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Warranty replacement fixes backlight bleed and color distortion at screen edges and corners",
      "text": "Previously: Backlight bleed and color distortion at screen edges and corners after about a year and a half. Effectively this is a 30\" monitor due to the visual defects. ViewSonic noticed my negative review and suggested contacting customer service, which I did. Long story short, my monitor was still in the warranty period and was replaced. I'm not sure if the replacement was a new unit or a refurbished unit, but the replacement looks immaculate (no cosmetic damage) and is working fine now.",
      "rating": 5.0,
      "verified": true,
      "author": "bite me social networking",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Great for figure art",
      "text": "The tilting or rotating screen id great when doing full figure drawing and painting. Picture quality is really good compared to my other standard monitors. Balance is good , never had it want to tip over. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "eagleman1968",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Solid Monitor - Nice upgrade from 1080p",
      "text": "Great 2k monitor for the $. Viewsonic one of the best, have owned a few for photography and graphic design. Im impressed again with the quality of this one. If you absolutely need 4k then spend the $ for the 32 4k one, but this is a really nice 2k monitor for 1/2 the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "GolfShooter",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Monitor/laptop syncing issues",
      "text": "The screen is great for editing as I am a photographer but I am having issues with syncing my laptop. It works the first day I got it and woke up the next day and the monitor would not detect my laptop. Both of attached with the right chord. Definitely feel like this was refurbished.",
      "rating": 2.0,
      "verified": true,
      "author": "Unknown ",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Very good product Does not have speakers built in",
      "text": "I use them mainly for productivity, I.E. davinci resolve, indesign, music software etc, and for that its great, I dont play much videogames, but the ones I own on steam work pretty great with the resolution, But couldnt really say something about shooters or competitive gaming",
      "rating": 4.0,
      "verified": true,
      "author": "Fabio J. S",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "TN panel sucks",
      "text": "I'm connecting this to my XPS 15 9560 and color looks really washed compare to the DELL's infinity display and it even get worse if you use HDMI instead of DP. The brightness control doesn't seems do much and change to warm color doesn't seems to do much. I should've bought IPS panel display",
      "rating": 3.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Brilliant display",
      "text": "I use this to write code and it's an amazing display. Uniformity is perfect. I can keep resolution at 100% at my normal distance from my screen. So. Much. Real Estate! I'll never go back to anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Horton",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Decent 1080 monitor that rotates",
      "text": "This is just a decent monitor that met my needs of rotating into portrait mode. I do like the ability to use the Thunderbolt port on my MBP. Wish the slightly larger versions that are 2k/4K were a bit less expensive. Would have bought one of those if so.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin A Lawrence",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "That my prints look like what I had edited on my screen",
      "text": "This is a great monitor. I'm a photographer and I needed another monitor since I has having serious troubles color matching on my old one and matching what was on my screen to what was printed. This monitor did both, now my prints are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "vvalente",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Good solid monitors for multi-setup",
      "text": "I had two VP2468_H2 PRO 24\" monitors a couple of years ago and bought another set for my home office. Excellent color rendition, good controls, slim bevels perfect for dual-mount stands, anti-glare coating. Comes with two DisplayPort cables and two USB3 cables. A solid choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart Dalessandro",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Display tends to be on the warmer side",
      "text": "This display is certainly a good bang for the buck. The viewing angles are insane and the bezels are almost seamless. I think my favorite part about it is how versatile it is when it comes to adjusting the angle, hight and orientation. Good monitor for starting out. It does tend to be on the warmer side of things but you can always adjust the temperature in the settings. Overall, excellent investment in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Excellent Monitor for Money",
      "text": "This monitor stands up to even the most detailed designers who are looking for an outstanding monitor. Love how it swivels, too!!!",
      "rating": 5.0,
      "verified": true,
      "author": "TEKnight Rider",
      "helpful_votes": 0,
      "publication_date": 20200308
    }
  ],
  "product_meta": {
    "title": "ViewSonic VP2468 Professional 24 inch 1080p Monitor 100% sRGB Rec 709 14-bit 3D LUT Color Calibration for Photography and Graphic Design,Black",
    "description": "Style:24-Inch| Pattern Name:SingleThe ViewSonic VP2468 is a 24'' (23.8” Viewable) full HD monitor that delivers unmatched Color accuracy crucial for professional applications. With an Edge-to-Edge super clear IPS panel and one of the world's thinnest bezels, the VP2468 provides a sleek and frameless viewing experience ideal for multi-monitor setups. For simple, single-cable daisy chaining of multiple monitors, the VP2468 is equipped with future-proof DisplayPort technology, in addition to HDMI ports. What's more, with advanced ergonomic tilt, swivel, pivot, and height adjust features, this monitor provides a comfortable viewing experience and vivid images no matter your vantage point. To ensure precise, uniform Color, each of our monitors is Factory calibrated to deliver an amazing delta e≤2 value for superior Color accuracy. An integrated Color uniformity function ensures consistent chromaticity across the screen, while a 14-bit 3D look-up table generates a stunningly smooth palette of 4.39 trillion colors. Add to that 6-axis Color adjustment functionality, and this monitor provides the ultimate Color processing capability for professional applications. Hardware calibration is available with the optional ViewSonic Color br at I on kit, which allows you to quickly and easily calibrate the monitor for photography, graphic design, content Creation, and other color-critical applications. Have peace of mind in the quality and reliability of your ViewSonic monitor—backed by one of the industry’s best pixel performance policies and a 3-year limited warranty. With advanced ergonomic features, ViewSonic monitors are designed to provide a greater range of adjustment for increased productivity and comfort. Users can reduce eyestrain and physical fatigue by adjusting the monitor via swivel, pivot, tilt, and height adjust options. Compatibility PC Up to 1920 x 1080 Non-interlaced, Macintosh Power Macintosh up to 1920 x 1080 (Supported by limited graphic cards) Note: Macintosh computers may require a ViewSonic Macintosh adapter. To order an adapter, contact ViewSonic.Do not set the graphics card in your computer to exceed these timing mode; doing so may result in permanent damage to the display. The brightness is 250 cd/m2",
    "rating": 4.4,
    "feature_bullets": [
      "Professional monitor: full HD (1920x1080p) 60Hz Super clear IPS monitor deliver lifelike colors Perfect for graphic designers, photographers, video Editors and more",
      "Ultimate color accuracy: screen wide sRGB, EBU, smpte c, Rec. 709, dicom sim color uniformity, Delta e<2 accuracy, and a smooth palette of 4.39 trillion colors deliver precise, lifelike images",
      "Frameless digital canvas: A four sided ultra thin bezel shows off more of your masterpiece, and less of the monitor",
      "Hardware calibration: quick and Easy calibration ensures that the color displayed perfectly matches the original file",
      "Flexible connectivity: The VP2468 supports laptops, PCs, and Apple/Mac operating systems with HDMI 1.4, USB, DisplayPort (Daisy chain enabled), and Mini DisplayPort inputs",
      "Industry leading warranty: 3 year coverage with access to our US based customer service team",
      "Included in the box: LCD monitor, power Cable, Mini DP to DP cable, and USB 3.0 cable"
    ],
    "specifications": {
      "Standing screen display size": "24 Inches",
      "Max Screen Resolution": "1920 x 1080 Pixels",
      "Number of USB 3.0 Ports": "5",
      "Brand": "ViewSonic",
      "Series": "VP2468",
      "Item model number": "VP2468",
      "Item Weight": "7 pounds",
      "Product Dimensions": "1.9 x 21.2 x 12.2 inches",
      "Item Dimensions  LxWxH": "1.9 x 21.2 x 12.2 inches",
      "Color": "Black",
      "Processor Count": "1",
      "Computer Memory Type": "DDR4 SDRAM",
      "Manufacturer": "ViewSonic",
      "ASIN": "B01HSABSGE",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 30, 2016",
      "Customer Reviews": "4.4 out of 5 stars548 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#25,231 in Electronics"
    },
    "categories": [
      "Monitors",
      "Computers & Accessories",
      "Electronics"
    ],
    "price": 229.99
  }
}