{
  "website_summaries": [
    {
      "verdict": "Sammy Suckerpunch has the appeal of a plush dog toy, combined with sinister fun. We recommend it for older children and adults, since the effect can be very intense for younger children.",
      "pros": [
        "Strong appeal among dog lovers",
        "Includes personalized name tag with likes and dislikes",
        "Great shock value"
      ],
      "cons": [
        "Some mechanical damage reported",
        "Seams can rip under moderate play",
        "Smaller than expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A fluffy pup with a ferocious twist. Perfect for pint-sized pranksters and kids with a well-developed sense of humor.",
      "pros": [
        "Fun and unique, this puppy goes from sweet to savage at a squeeze of his head",
        "Children (and adults) won't tire of shocking unsuspecting family and friends",
        "Adorable when neutral, still allowing for bedtime cuddles"
      ],
      "cons": [
        "Fun and unique, but definitely not for everyone"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A total hit",
      "text": "I won’t lie - I bought this on a whim. I saw an ad and they were so adorable that I had to buy these for my kids. I bought this one for my son and the unicorn version for my daughter. We’re a month in and they are still going strong with the kids. They love the little angry faces - and use them for pretend play. I’d say it’s pretty durable and worth the buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Flower Chica",
      "helpful_votes": 5,
      "publication_date": 20171229
    },
    {
      "title": "Scared so many people with this. Worth every penny ...",
      "text": "Scared so many people with this. Worth every penny. OOOhhh and really weird thing, people kept thinking i colored the ears blue. they swore they weren't that color when they first saw it. It was several people that said the same thing that dont know each other! I even thought the same thing. Weird right?",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 4,
      "publication_date": 20171208
    },
    {
      "title": "GOTTA HAVE THIS BADBOY/GOODBOY/BADBOY",
      "text": "Super fun pranking people with this.. their reactions are priceless. Took it on a road trip and pretended not to be paying attention ( I was the passenger) but when cars passed on the right or were driving along side I would slowly make it change face.. People followed us for miles and it was HILARIOUS!",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Of Twin Cuties",
      "helpful_votes": 5,
      "publication_date": 20170302
    },
    {
      "title": "A toy without batteries",
      "text": "It is nice for a change to find a toy without batteries and which doesn’t make irritating sounds. I hadn’t really read the specifics on this before buying it for my daughter but was happy to discover that it works by squeezing the back of the head. She loves it! I worry a bit about how long it will last, since the eyebrows do stick a bit when you move them. Not a soft, cuddly and huggable toy really but I don’t think that is what it was meant to be. I think it is a good toy for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Eagle",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Threads were unraveling from the moment the item was placed in the shipping box",
      "text": "The product seemed to be not sewn very well at the seams, threads were unraveling from the moment the package was placed in the shipping box. For a $ 30.00 stuff animal I was not very happy with the quality of the item at all, I feel the Seller should have noticed product issues prior to mailing out a defective item.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20171227
    },
    {
      "title": "Great for Halloween",
      "text": "Very cool stuffed animal for sure. My son hasn't put it down since we got it a week ago. Brought it in to his class, scared the Starbucks barista, and is still finding new uses for Sammy everyday. My concern is that the face changing mechanism sticks a little and eventually this may fail. At that point you still have a great stuffed animal, just not a bi-polar one.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Johnson",
      "helpful_votes": 32,
      "publication_date": 20161020
    },
    {
      "title": "This little guy is so fun. Every person",
      "text": "A D O R A B L E! This little guy is so fun. Every person, young or old, loves him. Feisty Pets made a guaranteed to smile toy for anyone to enjoy. Babies would not be a good choice to snuggle with tho. It has mechanical components to make it change the features so not sure about the harder pieces inside. Overall, a great toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Melisa K",
      "helpful_votes": 5,
      "publication_date": 20161122
    },
    {
      "title": "Perfect workplace \"pet\"",
      "text": "I saw these on social media and knew I had to get one! I bought the dog and took it to my office. Whenever my boss stops by, ostensibly for a casual conversation, I gesture to the dog and tell him that the dog hates it when people beat around the bush. If the boss has a secret tasker, the dog bares his teeth. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Sauter",
      "helpful_votes": 4,
      "publication_date": 20161024
    },
    {
      "title": "Absolutely love! Fun and adorable",
      "text": "I received this as a Christmas gift from my bf. I'm a grown adult but I felt like a happy little kid when I opened the package! Check the measurements, it states 8.5 inches. My bf thought it was supposed to be bigger, but I think it's perfect. The idea is super cute and the mini story on the tag is hilarious. He chose Sammy because it looks like out Husky puppy. It has a place of honor on our bed, and I can't wait to put a leash on it and freak out our pets lol. 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Bats",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Must have in my opinion 😂😂😂",
      "text": "I have wanted one of these for quite some time and finally decided I would treat myself I am an adult but complete kid at heart 💜 Now I’d like a few more as I think they’re fun and cute and catch people and animals off guard which I love!! listen I may have to grow old but I don’t have to grow up😂💜",
      "rating": 5.0,
      "verified": true,
      "author": "Seleste",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Feisty Pets: Sammy Suckerpunch - HIGHLY RECOMMENDED!",
      "text": "As much as I wanted to buy/collect every single one of these Feisty Pets for myself, I figured [as being 'That Uncle'] that they'd make hilarious gifts for my little niece and nephew.. They both received them, and I can't even begin to describe how much fun they've been! The two that I received were flawless in function and quality, I definitely plan on getting more. Sam -",
      "rating": 5.0,
      "verified": true,
      "author": "DIRTY DOVI",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Breaks easily",
      "text": "The mechanism that you squeeze on back of head and neck stopped working after a few weeks of minimal play. When squeezing the back of the head/neck it turns the cute dog into a fierce looking dog.... well when releasing the head/neck mechanism it s stuck and Wong turn the fog back into it cute face.",
      "rating": 1.0,
      "verified": true,
      "author": "Manda",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Funniest stuffy I've ever seen.",
      "text": "Buy one you will not regret it. It is one of the funniest things i have ever seen. I am 57 and bought one for my girlfriend. She has not stopped playing with it and laughing hysterically since see opened it. Well done.",
      "rating": 5.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 2,
      "publication_date": 20170503
    },
    {
      "title": "... gift for my little sister (age 11) and she loved it! When she unwrapped it she thought it ...",
      "text": "Got it as a gift for my little sister (age 11) and she loved it! When she unwrapped it she thought it was cute, then I squeezed the toy's head and scared the garbage out of her. Her horror game loving ass fell in love with it. Every time someone new comes over she shows them, and laughs evilly at their reactions. She said she doesn't think it's a wolf though, and insists it's a cat. Bonus: if you only partially squeeze it, it makes a very unamused \"shut up you're dumb\" kind of face.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170227
    },
    {
      "title": "Days, weeks heck probably years of fun!!",
      "text": "This is a fun toy!! Bought as a gift for my 6 year old son who was asking for one and he loves it! It never gets old to have someone pet it and then make it scary and attack someone!! We have honestly all had a pretty good time playing with this! Definitely recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "CNos",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Nephew Loved",
      "text": "I bought the Sammy-Sucketpunch Fiesty Pet for my nine year old nephew for Christmas. This is something he had on his Christmas list. When he opened it, he LOVED it! After he showed everyone that it went from sweet looking to fiesty, everyone laughed and thought it was a neat gift. I have to admit that I thought it was pretty cool, too. The only reason I'm giving it four stars is because these are a little pricey for the size of the item. I thought it would be a little bigger than it was, but what do I know? Overall, this makes a GREAT gift!",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Amazing gift, scary but not to scary",
      "text": "Amazing gift, scary but not to scary, my 5year old uses the dog to scare monsters when going to bed, it has helped him with being afraid at night. Item arrived on time and in good condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Fort",
      "helpful_votes": 4,
      "publication_date": 20170117
    },
    {
      "title": "Cute. I end up giving them out as gifts",
      "text": "Everybody that has seen mine has loved it, so I get them as gifts. They are very cute and even the evil face is charming. They aren't that soft because of the mechanical head. More of a novelty than a cuddle buddy.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Sollenberger",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Happy little Boy",
      "text": "Update: He still has this toy and he still loves it, other than being a little dirty nothing is wrong with it. So my 10 year old son wants this so bad, he has been begging for it, so much so he put it front and center on his Christmas list. So this is what he is getting. Feels cheaply made, but for $20 I can not complain, and it will make him so happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa H",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Cute and fun",
      "text": "These things are cute and fun. Looks like cute cuddly stuffed animal but with attitude. Love the little name tag that came with each one and tells what they like and don't like. Kids will have fun with these for awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Funny, Cute and Scary all in one fuzzy package.",
      "text": "Hilarious. Funny, cute and scary all in one. It is fun to shock people when you are holding a cute stuffed animal and it snarls at them when they reach for it. Fun for all ages. My 50+ Year old uncle loves his as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie D.",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Even more fun than I expected",
      "text": "One of the best Christmas presents of the year. The kids (age 5-7-10) all loved it. Huge laughs. I was truly surprised just how much this evil little thing startles people! Hilarious. Our little dog HATES it and freaks out when the face changes. The kids have used it to scare all the neighbor kids. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Husker Red",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Sammy not so scary suckerpunch!",
      "text": "Ive had this for awhile now so I'm super late on a review but my daughter doesnt find it scary at all. She's almost 2 and just laughs so hard. She makes little angry faces at it. Which wouldnt scare anyone lol but are so adorable!! I love how soft it is. I bought it for my boyfriend for his birthday because we both really like wolves, but to kinda make him laugh at the whole cute to scary ratio. Its fun and cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey Tate",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "An extremely fun gift to give! A real hit!!!",
      "text": "I bought this for my 58 year old sister for Christmas! She loved it just thinking it was a stuffed animal. As she was admiring it, I told her to look at it & squeeze the back of it's head! She cracked up big time! Says she has had so much fun with it! She has 7 indoor wiener dogs! She says they all want it too! Of course they aren't getting it! This has been one of the most fun gifts I have given!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anita Weigel Manis",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Perfect for my wild little boy.",
      "text": "So cute and funny. My wild little boy (4) loves him. Named him fluffy. He doesn't play with stuffed animals but this fit her personality perfectly and he just loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "jen d",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "My kids (12 & 8) love these! They love to show these to their ...",
      "text": "My kids (12 & 8) love these! They love to show these to their cousins when they come over! They've also been pretty rough with them and they seem to be holding up fine so far. Had them for about 2 months now.",
      "rating": 5.0,
      "verified": true,
      "author": "BadAndy",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Totally worth buying",
      "text": "If you are looking at this, chances are you have seen the commercial. And if you have not, go look for it on youtube. And when you are done, buy one. Totally worth the laugh. My daughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "James R. Davis",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Good for imaginative kids",
      "text": "Nephew loves these feisty pets. So cute watching him play with these and letting his imagination run wild. If your kid has a good imagination, these should be a good fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric S",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "My dogs don't know what to make of it",
      "text": "Cute and funny toy, when I make the angry face towards my dogs, one growls and gets mad back, one looks and walks away with a side eye, and our third dog has no response. But he's blind. Very funny and cute toy.",
      "rating": 5.0,
      "verified": true,
      "author": "I. Finn",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Santa should of left it at Amazon!",
      "text": "My son requested this Feisty Pet and so “Santa” brought him one, but if Santa had known how small and poorly made I doubt it would have made it in his sleigh! Definitely not worth $20!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Angela Knight",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Falls over",
      "text": "Waste of money. Purchased for great granddaughter but it wouldn’t sit up! Mechanism in head to heavy for body. I had to purchase another style. Had to long to return by the time her birthday rolled around",
      "rating": 1.0,
      "verified": true,
      "author": "Gail Wallace",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "I believe that my son will love scaring people with it",
      "text": "This is so cute! I believe that my son will love scaring people with it! It was smaller than expected but I didn't pull out a ruler and draw out the dimensions given either. It didn't come with any real packaging but a bag and tissue paper for Christmas wrapping will work",
      "rating": 5.0,
      "verified": true,
      "author": "S.B.",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "She has had a lot of fun scaring friends",
      "text": "Fast shipping. This feisty pet is hilarious! My 6 year old daughter had this on her wish list to Santa and squealed when she opened it. She has had a lot of fun scaring friends, family and strangers with her \"evil dog\". Very happy little girl!",
      "rating": 5.0,
      "verified": true,
      "author": "Caryn R McGinley",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Missing the box",
      "text": "Cute but mine did not even come shipped in a box. I had to buy a box to put it in . I bought it as a gift.",
      "rating": 4.0,
      "verified": true,
      "author": "Cathleen Daum",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "So cute and funny!",
      "text": "My daughter loves this stuffy and I love the funny faces it makes! It seriously cracks me up.",
      "rating": 5.0,
      "verified": true,
      "author": "Ima Good Student",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Funniest toy ever",
      "text": "This is seriously the funniest toy ever! We cannot stop laughing. I bought this for my 6 yr old son for Christmas. This was a hit! His favorite present. He took it everywhere with him to show people. Lots of laughter from everyone",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Very Nice",
      "text": "I love scaring my niece. I bought this for her to scare the crap out of her. hahahahaha",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Hickman",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Poorly Made",
      "text": "LOVED my feisty pet at first. Was hardly played with and after only a couple months the leg seam came apart. Too late to exchange according to Amazon. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "MrsMacy",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "Good buy",
      "text": "Love that it changes back an forth so easy no battery’s to deal with it’s soft an scary",
      "rating": 5.0,
      "verified": true,
      "author": "Houston",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Feisty Pet Fun",
      "text": "The sweet looking faces of these stuffed animals turn instantly into fierce and scary expressions when their head is squeezed. Pretty hilarious and entertaining for kids of all ages. After getting this one we ended up getting the unicorn and the cat for our other daughters because it was such a hit.",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Interactive Fun",
      "text": "This was a gift for white elephant gift exchange and the kids loved it. While most stuffed animals just get to sit around, this one gets passed around and handled a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Grace",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Too funny!",
      "text": "Bought this for my 3 year old nephew and he loved it! He loves going up to people and saying he's sad then scares them. LOL.",
      "rating": 5.0,
      "verified": true,
      "author": "Roe",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Cute",
      "text": "Cute dog, daughter liked it. Does what it says, seems of decent quality. Only complaint is the price.",
      "rating": 4.0,
      "verified": true,
      "author": "J.",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "The best teddy",
      "text": "Literally the best thing I’ve seen on amazon. Super soft and just a really good idea for kids or just a fun gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Izaiah",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "So much fun",
      "text": "I bought this for my 1.5 year old nephew. He absolutely loves this dog and the little surprise of the snarling face. He grabs it and brings it to us to scare him with. The dog works great and the teeth look very realistic when they pop out. This is a really fun gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "I think they would be even better if they made noise",
      "text": "My six year old absolutely loves his feisty pet. He sleeps with it every night. I think they would be even better if they made noise, but he loves it and that is what matters.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Fun",
      "text": "I've had a lot of fun with this thing, but the cloth around the mouth started to tear very easily",
      "rating": 3.0,
      "verified": true,
      "author": "John Schulz",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Kids love them",
      "text": "My kids love these. We had to buy more than one because all of the cousins needed one Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Beckwith",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Great Gag Gift!",
      "text": "Great gift for my 3 year old nephew! After scaring him, I showed him how it works and he loved it! When first showing my sister she screamed and immediately started laughing. Definitely worth the purchase and I will most likely purchase the other animals for my other nieces and nephews.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Menzies",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Great gift for your sick and twisted friends!",
      "text": "This is my third fiesty pet purchase. This one was a gift for my boyfriend's birthday. He has two Siberian huskies so this was a natural humorous choice. He loved the fiesty part!",
      "rating": 5.0,
      "verified": true,
      "author": "Lara A. Sciaraffa",
      "helpful_votes": 2,
      "publication_date": 20161118
    },
    {
      "title": "Grrr....",
      "text": "This was a gift from my son to me & I love it (my dogs hate it) but it's a lot of fun to show people for the first time. It always gets a smile.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Eckols",
      "helpful_votes": 2,
      "publication_date": 20170810
    },
    {
      "title": "High quality toy",
      "text": "These pets are so well constructed- No batteries needed and is still keeping my kids entertained weeks later... I really like that the pets are cuddly yet sturdy. These pets are wonderful for feisty kids!",
      "rating": 5.0,
      "verified": true,
      "author": "FoxJewelryBox",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Cuddly and Funny!",
      "text": "Bought this for my little sister to cheer her up. It made her laugh and smile the moment she held it. Not only does it make you laugh, but it is also well made and super soft! Definitely a fun and unique stuff toy!",
      "rating": 5.0,
      "verified": true,
      "author": "MG Hart",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "SUPER FUN!",
      "text": "They are just as funny now as when they first came out!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Scary Cute",
      "text": "Best gift ever! So funny. My kids thought they were BeanieBoos (Not sure what those are) until my husband squeezed the head and brought out the angry fangs, making my girls jump and scream. They couldn't wait to show everyone they met. Took their Feisty Pets EVERYWHERE for 2 weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "E.conqueso",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Awesome",
      "text": "These things are awesome. My daughter has had this over a year now and still looks as good as the day we bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great gift.",
      "text": "Bought it for a gift sent far away and they recipient loved it made them smile and was a success.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa A. McConnell",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Was a hit for Christmas!",
      "text": "We found out about these on a you tube video and I immediately went on amazon and bought for christmas. They are so funny! We haven't had any mechanical problems with the mouth and they have already taken a beating. The tag that comes on the stuffed animal is also really funny to read!! It tells you about the pets likes and dislikes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica McC",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Scary funny",
      "text": "My two year old son thinks this wolf is hilarious. It came as expected and in new condition. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ta2dFrog",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Kids love them",
      "text": "These things are awesome. Saw them on FB, ordered them, they were at my doorstep in 2days!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 4,
      "publication_date": 20161221
    },
    {
      "title": "Gag gift / White Elephant Gift",
      "text": "This thing is adorable and feisty. It got some good laughs from the children and spooked our puppy too!",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Reviews",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Got this for a friend who broke her leg and ...",
      "text": "Got this for a friend who broke her leg and the way her face lit up when she saw it change was priceless.",
      "rating": 5.0,
      "verified": true,
      "author": "Aly D",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Super fun",
      "text": "This little dog is going to be so much fun this Christmas. It's very easy to operate. He is the perfect size for snuggling with until you see his razor sharp teeth. Probably going to scare my 5 year old niece into tears.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Albin",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Clever",
      "text": "A lot smaller than what I expected but you cant really go wrong with the price anyway",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "So funny",
      "text": "I bought this as something to make me laugh. It is hilarious and my husband and I love playing with it. Yes, we're children at heart.",
      "rating": 5.0,
      "verified": true,
      "author": "Bunny",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Cute, funny, fun!",
      "text": "Such fun. We have all had a blast with feisty pets this year. Great quality. Fun to share and play together. Easy to push.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin W.",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "... saw it online while scrolling and thought it was funny, I though it would be bigger but other ...",
      "text": "Only bought this cause I saw it online while scrolling and thought it was funny, I though it would be bigger but other then that worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "zaira",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "It was an easy fix with some glue but annoying none the less ...",
      "text": "Very cute pets, I bought 3 of them, except 2/3 had one of the eyes popped out. It was an easy fix with some glue but annoying none the less because they were brand new still in the package and these animals are not cheap!",
      "rating": 4.0,
      "verified": true,
      "author": "Katrina Gloudeman",
      "helpful_votes": 10,
      "publication_date": 20161101
    },
    {
      "title": "Very cute!",
      "text": "Bought this for a seven year old boy and he loves it. Very cuddly and the feisty face is great and easy to make it look feisty. I am going to buy one of the cats next.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy camper",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Too cute!",
      "text": "These are great! Amazon has them cheaper than the store I saw them in! So funny when you make it angry!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "My ten year old son's absolute most favorite toy ever",
      "text": "My ten year old son's absolute most favorite toy ever! He carries it with him everywhere even after having it for six months. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "PapaKOA",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Laughed at this funny toy",
      "text": "I gave this at Christmas to my son as stocking gift. Will get a laugh when puts on his desk at work.",
      "rating": 4.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Tremendous fun, just as advertised.",
      "text": "This product is the delight of a 7 year old. The irony of the mean face sparks surprise and hilarity. Easy to use and still cuddly.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Lawrence",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "unique",
      "text": "My niece is just like me feisty. She will see it for christmas",
      "rating": 5.0,
      "verified": true,
      "author": "pam n",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Fun",
      "text": "my 7 year old niece loved it and the family did too! The dog did not like it at all with the evil face mode.",
      "rating": 4.0,
      "verified": true,
      "author": "Rain",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Adorable and 'feisty'",
      "text": "So cute. My child will love it. My co-workers got a kick out of it as well when it was delivered. Still soft to the touch even though the head is a little harder due to the 'feisty' side. Kids would still be able to cuddle with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Northwest PDX",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "LOVE it!!",
      "text": "I bought this for my son for Christmas he likes to tease and prank people so I thought this would be perfect. can't wait to give it to him!",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Dean Simmons",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "cool",
      "text": "my 92 year old grandma is in love. Till i scared her.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher S.",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "I love scaring my younger family members with it",
      "text": "This toy is hilarious. I love scaring my younger family members with it! You have to squeeze the head to make it do the scary face.",
      "rating": 4.0,
      "verified": true,
      "author": "Tabetha Sandberg",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "FUN",
      "text": "I bought this for my wolf and he thinks the face is challenging him. Its a cute toy and works well too.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Love it. Should have bought two.",
      "text": "Lots of fun for kids and adults, I do not know who had more fun playing with this me or the kid. should have bought two. one for me one for the boy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Ken",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "She absolutely loved it. She had seen the video and was ...",
      "text": "Bought this for my son's girlfriend's 18th birthday. She absolutely loved it. She had seen the video and was so excited to receive this as a gift. It's so great – you can't help but laugh when you see it. She shows it to everyone that comes over!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Fun gift",
      "text": "Cute and comical at the same time. My niece loves it",
      "rating": 5.0,
      "verified": true,
      "author": "E. Mielke",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "I love it",
      "text": "I love it it's so cute it's for my Nephews birthday in September",
      "rating": 5.0,
      "verified": true,
      "author": "mamabear24",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Adorable and Fierce",
      "text": "Saw these on a video on FB AND couldn't help but get myself one. Came on time and almost as expected. Almost because it's so much more adorable in person!",
      "rating": 5.0,
      "verified": true,
      "author": "Bao-ngoc",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "So funny!",
      "text": "Hilarious. I can't wait to give this as a gift. I think the recipient will really get a kick out of it. Only didn't give 5 stars because its slightly smaller than I expected. Even with that, I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Shopper C",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "So much fun",
      "text": "This toy made a 7 years old boy so happy! It’s well made and soft enough you can sleep with it. Loving it.",
      "rating": 5.0,
      "verified": true,
      "author": "chiara b",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Stuffed creepy dolls",
      "text": "Great gifts for kids with a sense of humor .Not for the timid. I wouldn't recommend these for a three year old . Maybe a fiesty five . Pretty cool.",
      "rating": 5.0,
      "verified": true,
      "author": "BJC",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "I Love this item",
      "text": "I Love this item! I teach and we are the Huskies. If my students are having a bad day they pick it up off my desk and sit with it at theirs (I see them making it grawl at different times- they are high schoolers).",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Could add noise!",
      "text": "works really well, looks really cute and looks just like the large beanie baby TY stuffed animals you get elsewhere. I just wish it made noise when you changed the face to scary.",
      "rating": 4.0,
      "verified": true,
      "author": "Richie",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Nice toy dog",
      "text": "Cute dog toy bot 1 eye fell off in less then 30 min after receiving it",
      "rating": 3.0,
      "verified": true,
      "author": "Lucian",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "great concept",
      "text": "its a great concept. My son loves to try to scare people with it. I feel like the face is starting to stick after about 5 uses though. So you have to manually put the eyebrows back in place and close the mouth. But it is still cute.",
      "rating": 4.0,
      "verified": true,
      "author": "angelclark",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Funny toy",
      "text": "I got this for my 14 year old son as a stocking stuffer. He likes it a lot and his friends do too. He scared his grandmother with it and we all had a good laugh.",
      "rating": 5.0,
      "verified": true,
      "author": "TexasBecks",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Fun product",
      "text": "My son had small version and wanted the actual size and ita great",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Hernandez",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Absolutely Adorable!",
      "text": "I couldn't be happier with this little guy. He looks so sweet and loving and then turns into a ferocious-looking bundle of fluff! I swear, it looks so much like my aging mixed breed dog - TOTALLY bipolar just like her and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lannie",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Cute little bugger",
      "text": "I purchased this for myself, but then realized I still had another person to buy a gift for. I look forward to purchasing another one in the future for ~$20.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Neill",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Smaller than expected but still great!",
      "text": "These are a tad small considering the price you pay for them. Wish they were a little bigger, other than that they are good quality and kids like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Jstegs",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Cute, funny, but a little pricey",
      "text": "My son wanted only this for his 7th birthday. While I think its overpriced, it is really neat and quite funny.",
      "rating": 4.0,
      "verified": true,
      "author": "Barb P",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "Very Cool",
      "text": "These things are so cool. Kids (even little ones that scare easily) absolutely love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul J. Martin",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "This is an awesome stuffed animal",
      "text": "This is an awesome stuffed animal. We purchased this for our grandson at Christmas. He really likes it. He especially likes everyone's reaction when the animal shows its alter ego. Lots of fun...",
      "rating": 5.0,
      "verified": true,
      "author": "James Southard",
      "helpful_votes": 0,
      "publication_date": 20170109
    }
  ],
  "product_meta": {
    "title": "Feisty Pets: Sammy Suckerpunch- Adorable 8.5\" Plush Stuffed Dog That Turns Feisty With A Squeeze",
    "rating": 4.7,
    "feature_bullets": [
      "This precious pooch is only 8.5\" tall- but don't let Sammy know that- unless you wanna see the feisty side of this pet",
      "Turn your sweet and innocent looking stuffed animal into a feisty pet by giving it a little squeeze behind the ears",
      "These pets have an endearing resting face and are great for cuddle time-and their animated alter ego is fun for play and to give your friends",
      "Stuffed with polyester fibers and is surface washable",
      "Collect them all stuffed attitude"
    ],
    "specifications": {
      "Manufacturer": "WILLIAM MARK",
      "Part Number": "0072",
      "Item Weight": "8 ounces",
      "Product Dimensions": "12 x 8 x 6 inches",
      "Item model number": "0072",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Multi-colored",
      "Material": "Polyester, Plush",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B01H7Q0Q8K",
      "Customer Reviews": "4.7 out of 5 stars1,306 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#24,372 in Toys & Games",
      "Date First Available": "June 17, 2016"
    },
    "categories": [
      "Toys & Games",
      "Stuffed Animals & Plush Toys",
      "Stuffed Animals & Teddy Bears"
    ],
    "price": 19.99
  }
}