{
  "website_summaries": [
    {
      "verdict": "Lower price than other models with limited differences in quality.",
      "pros": [
        "5.5-quart capacity mixer",
        "Comes with chef's whisk, dough hook, flat mixing paddle",
        "500 watts of power",
        "All the quality of the more expensive models at a fraction of the cost"
      ],
      "cons": [
        "Heavy and shakes while on the counter"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I was amazed at how awesome this mixer is",
      "text": "WOW! I was amazed at how awesome this mixer is. I had been looking online for some time before I finally decided on this one. I compared this one to some of those really expensive ones (400.00- 600.00). Let me tell you, this mixer is as good , if not better than those over priced one. It's heavy duty. Will tackle even the toughest mixing conditions. I love it! I've made bread, cookies, cakes and whipped up all kinds of goodies. It works great. Would definitely recommend this mixer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 271,
      "publication_date": 20180115
    },
    {
      "title": "Buy it.",
      "text": "Excellent powerfull, I made bread, cakes, heavy cream. The mixer is BIG, excellent capacity. For me this machine is better than Kithchen Aid, more powerfull, but the only disadvantage is that it has fewer accessories. The accessories it brings are metal and look strong and durable. Due to its high capacity it can be difficult to prepare small quantities, but I do not regret buying it, it is very sturdy and the quality in the finishes are impeccable.",
      "rating": 5.0,
      "verified": true,
      "author": "Hector Rodriguez",
      "helpful_votes": 171,
      "publication_date": 20170717
    },
    {
      "title": "Great Buy",
      "text": "Great buy at a real reasonable price. I was originally looking into purchasing a kitchenaid, but after reading several reviews. I opted for this one. I absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "_Natasha_",
      "helpful_votes": 69,
      "publication_date": 20180719
    },
    {
      "title": "Doesn't mix well",
      "text": "The paddle attachment has too much space from the bowl and it does not mix well. I am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Yumiko Kamo",
      "helpful_votes": 42,
      "publication_date": 20181015
    },
    {
      "title": "Had to return it.",
      "text": "I wanted to love this but I couldn’t. First day I got it and turned it on I immediately smelled this burnt rubber or wire scent. I thought perhaps it was because it was new but the smell was present each time I used it (used it twice). I didn’t want to risk anything catching fire therefore I boxed it and sent it back. The value was great and the machine itself is beautiful but it just didn’t work out for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 34,
      "publication_date": 20181010
    },
    {
      "title": "Dough hook does not reach wide enough",
      "text": "The die cast metallic body felt solid, quite heavy though. The cup is large and the dough hook does not reach well near the wall and the bottom area if the flour is less than 3 cups. I have to collect the flour from the edge and near the bottom using a spoon, somewhat disappointed. .",
      "rating": 4.0,
      "verified": true,
      "author": "Deep Breath - Fast Run",
      "helpful_votes": 14,
      "publication_date": 20190529
    },
    {
      "title": "Great machine. Makes holiday baking a breeze and for ...",
      "text": "Great machine. Makes holiday baking a breeze and for the money you can’t beat it. No pun intended... I would recommend buying this mixer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 23,
      "publication_date": 20171219
    },
    {
      "title": "It's ok but just doesn't get the job done.",
      "text": "Good - don't have to hold it. Bad - leaves dry ingredients on the side. Doesn't make any contact with the side like it should.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Patterson",
      "helpful_votes": 16,
      "publication_date": 20180907
    },
    {
      "title": "Piece of junk",
      "text": "Horrible the mixer broke after a few months piece of junk my cheaper one work better",
      "rating": 1.0,
      "verified": true,
      "author": "ericka g",
      "helpful_votes": 12,
      "publication_date": 20190707
    },
    {
      "title": "Easy to use. Great value!",
      "text": "All the negative reviews were wrong. I like this stand mixer. The machine runs smoothly and there is no vibration that one or two two reviews mentioned. It works well, the price is right and it fits my needs. I recommend The Cuisinart 50-5.5.",
      "rating": 5.0,
      "verified": true,
      "author": "Give me the ratings",
      "helpful_votes": 9,
      "publication_date": 20181108
    },
    {
      "title": "Absolutely Perfect!",
      "text": "I wanted a kitchen aid, after using a friends, but didn't want to pay the price. This is just as good, of not better, because its easier to change the attachments. Ive made cake, bread and cookies already and haven't had a single problem. Comes with 3 basic attachments and the logo on the front is removable so you can add other things like a meat grinder attachment (just like Kitchen aid)",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Thomas",
      "helpful_votes": 6,
      "publication_date": 20190312
    },
    {
      "title": "Made my task super easy and quick.",
      "text": "I use this stand mixer every alternate day for making roti dough. It's very easy to use and makes really good dough. It made my task super easy and quick. Even 5.5qt stand mixer is not that big, as in we can also use it for lesser quantities. I make dough only out of 2 cups of flour.",
      "rating": 5.0,
      "verified": true,
      "author": "JASMIN NARVEKAR",
      "helpful_votes": 5,
      "publication_date": 20200527
    },
    {
      "title": "You would love this mixer to death!!!",
      "text": "I had an old mixer and it was broken and I bought a piece to fix it but it still wasn't working so at the end I finally decided to buy this mixer and lo and behold this came up I love how the meat grinder is hidden and how the contents of the mixer are super shiny and metallic-like and the cover on the bowl helps keep the mixer of cake, pudding, etc.. inside and not splash out all over you or your kitchen, you must buy if you're a cook lover like me.",
      "rating": 5.0,
      "verified": true,
      "author": "love14",
      "helpful_votes": 2,
      "publication_date": 20200529
    },
    {
      "title": "Five Stars",
      "text": "Works great! Priced right for the quality and motor size compared to the well known kitchen aid.",
      "rating": 5.0,
      "verified": true,
      "author": "Justine",
      "helpful_votes": 14,
      "publication_date": 20170611
    },
    {
      "title": "Great stand mixer!",
      "text": "I really love this mixer. I had a sunbeam for decades and it finally gave up on me. I really wanted another but they are not made the same these days, so I tried this one after doing research. It is very easy to use, has a handy spout to pour ingredients in without making a mess, and is heavy enough not to travel on the counter! Comes with a lot of attachments and a handy booklet with instructions and recipes. So far, very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "luvreading",
      "helpful_votes": 3,
      "publication_date": 20181230
    },
    {
      "title": "It works as well, if not better, as a Kitchenaid.",
      "text": "Love this appliance!! Everything I’ve used it for worked perfectly. The only drawback (such as it is) is that it’s heavy. I move it to a storage area when not in use. Sometimes I have to enlist my husbands help. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Linda F.",
      "helpful_votes": 8,
      "publication_date": 20180218
    },
    {
      "title": "The Cuisinart, a Trusted Brand",
      "text": "Enjoyed using my Cuisinart 5.5 qt stand mixer. It's my first stand mixer and cut my work in half. It has a very strong motor and the attachments are easy to clean. It blended my soft dough in just a few minutes. Love the white color as my counter tops and backsplash is white. Very importantly it is all metal, no plastic parts to break. I think that is what die cast means. So, for half the price of the leading brand, and with a stronger motor, I believe it is a bargain! It holds a lot of dough or batter! And, in the end, I decided to go with Cuisinart, a brand I knew I could trust!",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 3,
      "publication_date": 20190506
    },
    {
      "title": "Best machine",
      "text": "Just maid pizza dough from the food net work two 14 inch pizzas and woh this machine is great and it has the spring on the head.I also got the ice cream machine and that is great too.This Cuisinart is way better then that other brand you know what one iam talking about.Very happy with everything you can even get a flex edge beater you just need to know what one works.",
      "rating": 5.0,
      "verified": true,
      "author": "Camper",
      "helpful_votes": 2,
      "publication_date": 20200215
    },
    {
      "title": "Great product!",
      "text": "I like that the white Cuisinart was $20 less than my regular online furniture outlet' sale price!! I have not had any problem with mixing the contents on the bottom of the bowl!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 6,
      "publication_date": 20180621
    },
    {
      "title": "Perfect for gluten free baking and whipping cream/egg whites!",
      "text": "Love this! I grew up with a Kitchenaid in the house, but it was always so heavy, and couldn’t get through thicker batches...this is not only lighter, but it works with super thick doughs. I bake gluten free foods, and this is perfect for getting them fully aerated. It’s also great for no churn ice cream. I make half recipes and smaller batches sometimes, and this easily gets everything in the bowl. I may have to help it a little with a silicone spatula, but it’s minor, and well worth it! Super easy to clean!",
      "rating": 5.0,
      "verified": true,
      "author": "California Sunshine",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Does not mix everything in the bottom of bowl",
      "text": "This is a good mixer and worked well. Just disappointed because the mixer does not mix everything in the bottom of the bowl. I have to continually stop and scrape the bottom of the bowl.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190724
    },
    {
      "title": "Handles a double batch of bread dough",
      "text": "So far so good - I chose this over the KitchenAid for the higher powered motor and 3 year warranty. Haven't done much with it yet, other than to test it with a double batch of bread dough and it worked fine. Looks beautiful, seems well-designed and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "A Real Person",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Poor Quality",
      "text": "This is a poorly made product. It is going back. The release button was jammed. The paddle release barely worked. Do not buy this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Szafranski",
      "helpful_votes": 4,
      "publication_date": 20191127
    },
    {
      "title": "works fine",
      "text": "Works fine. The fake chrome bit on the front? Just throw it away before it falls into whatever you're mixing. It's strong enough to make meatballs. It's my first mixer. Do they all have a problem mixing stuff at the very bottom of the bowl? It's not a big deal, you just have to take the bowl out and hand mix it a little to get it going. It's a good deal.",
      "rating": 4.0,
      "verified": true,
      "author": "popechunk",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Good deal",
      "text": "Impressed with this purchase- for $200 it was a good alternative to kitchen Aid’s $200 refurbished unit. I’d prefer to have brand new and I’ve owned Cuisine Art products previously and had much success- hope this mixer lasts just as long",
      "rating": 5.0,
      "verified": true,
      "author": "FARRAH DUFRENE",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Pretty, powerful and quiet!",
      "text": "I’m in love with my purchase. The classy white design compliments very well my kitchen, it’s quiet and DOES the job!!! The only star missing is because the mixer bounces off the counter when you have to knead big batches of dough.",
      "rating": 4.0,
      "verified": true,
      "author": "Soreya ",
      "helpful_votes": 4,
      "publication_date": 20190518
    },
    {
      "title": "GREAT MIXER!",
      "text": "I am so happy with this mixer! It replaced a Kitchen Aid which was very heavy and noisy. The Cuisinart is great mixer is a little workhorse that is not too loud. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Vargas",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Love this mixer!!",
      "text": "I love this mixer and wish I had bought it sooner. I made so many cookies this Christmas. It is so easy and fast to mix up sausage balls. It's the best purchase I've made in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Best Decision",
      "text": "I went to YouTube to get a review on this mixter but I saw non instead all I saw was the most expensive popular band you all know( won’t mention name) and it sounds like a tapioca grinding machine. I had to go with my guts since I use cuisinart cookware which I love. Best decision I made.",
      "rating": 5.0,
      "verified": true,
      "author": "Gee",
      "helpful_votes": 2,
      "publication_date": 20190924
    },
    {
      "title": "Love it!",
      "text": "Why did I wait so long to order this? It’s life changing! Quality is outstanding and so easy to use! I love it and highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "dianaj",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Best for the money",
      "text": "Love it.. it's a beautiful machine it's quiet and it's less money than the KitchenAid. You have to buy the KitchenAid with the chrome lever to get the DC motor which is quieter otherwise the whine will drive you insane.. this machine has just a quiet whurl.. 5.5 liter mixing bowl is bigger also",
      "rating": 5.0,
      "verified": true,
      "author": "martin F",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Best mixer!",
      "text": "My wonderful husband got this for me to do my Christmas baking. I use it daily to mix everything and anything. So easy to switch out head pieces and easy clean up. I read on other reviews how it doesn't get the bottom of bowl. What mixer does ?? All you have to do is lift bowl while it's mixing and move around a bit easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ga mom ",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Just as good as pro models",
      "text": "Looking for a competitor to kitchen aide? This works just as well, and of almost better looks ...and equal quality to it's competitor. Price is the mark to key in on for this.",
      "rating": 5.0,
      "verified": true,
      "author": "Alpa Chino",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Love it",
      "text": "My wife and daughter love it. They like to bake and like using it. My only negative feedback is that I can make dough quicker in my ninja dough maker attachment than this but other than that it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "HI",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Great design, great price",
      "text": "Outstanding new design at an unbelieveable price. Sleek design, quiet, powerful, easy to control and change beaters. I recommend this unit for all bakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan morton",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Great machine, right price",
      "text": "Great machine, right price. We owned a lot of cheap mixers and that's what they were. Spend the money its worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180529
    },
    {
      "title": "Good",
      "text": "Works great. Also has the place to add attachments. But it doesn’t mix the bottom of the bowl well.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Don’t do it... go with kitchen aide",
      "text": "No replacement parts available for the whisk! So now it’s a useless decoration on my counter until they make the whisk available",
      "rating": 3.0,
      "verified": true,
      "author": "Jo Ann Sackett",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "Nice🤗",
      "text": "Love it... The only thing that i dont like so much is the pieces to blend are not stainless steel.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth G.",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Works very weml",
      "text": "This product is easy to use and easy to clean. Motor doesn't lag when making a high batch of bread.",
      "rating": 5.0,
      "verified": true,
      "author": "amberly costello",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "I love this stuff. It's great",
      "text": "I used to use products of another brand, but their quality is far from as good as yours. Your products are in line with the high-quality products advertised. I am very glad that I have changed brands, I love this stuff. It's great",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan Lee",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Works great",
      "text": "I’m glad I bought this mixer instead of the kitchen aide because it works perfectly for what I use it for. I make a double batch of cookies every week and it works as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great!",
      "text": "I borrowed an expensive kitchen aid before getting this one and honestly, everything about it this one is nicer",
      "rating": 5.0,
      "verified": true,
      "author": "farine",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Worth the money",
      "text": "I'm glad we went with this model, because it truly is easy to clean, operate and store. It does the job just fine, and wouldn't want to trade it for anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Easy to use!",
      "text": "I really like the weight of this mixer versus some other brands. Good quality and easy to use.. The only thing I didn’t like about it was how the package arrived to my home. It was on my porch in full view in it’s original box. Anyone could see it was a mixer! Llr",
      "rating": 5.0,
      "verified": true,
      "author": "Lpr",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Great!",
      "text": "I love this stand mixer, the only downside is the lack of attachments you can purchase separately.",
      "rating": 5.0,
      "verified": true,
      "author": "tony walker",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Amazing product at an amazing price",
      "text": "Gave this gift as a Christmas present for my parents. They both absolutely loved it! They both get everyday usage out of this product. This makes baking a breeze. Clean up is easy and I highly recommend giving this gift to anyone who enjoys being in the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Quigley",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Great mixer",
      "text": "It was a gift for my mom and she loved it. Easy to use a heavy duty",
      "rating": 5.0,
      "verified": true,
      "author": "scooter",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Very happy with the purchase",
      "text": "Quality product, durable and very easy to use. MY wife is very happy with it. Happy wife, happy living!",
      "rating": 5.0,
      "verified": true,
      "author": "Benedick Vicuna",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great product.",
      "text": "I bought this product for a friend (🇧🇯 )who is starting up a bakery store. She finds the product very useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Estelle H.",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Good machine",
      "text": "Love this machine. Looks nice and quiet when it works. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Stand-up mixer",
      "text": "Just wish they had a flex blade for this model so u would not have to scrap bowl,",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Perfect bowl size",
      "text": "Very heavy for the average person but it doesn't slide around on the counter when using.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Worth the money",
      "text": "Made making bread so much easier. Very easy to use and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Easy to use",
      "text": "Love this mixer! So far has done everything I wanted! Like it has 12 speeds",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquilyn",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "I'm in love!!!",
      "text": "LOVE LOVE LOVE IT!!!! Perfect if you want to make larger quantities of batter and frosting. So happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "I'm so glad that I purchased this mixer",
      "text": "I love this mixer it's easy to use Easy to clean. It's not very noisy I would recommend this to anybody.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Brawley",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Great buy",
      "text": "Bought it as a gift for my bestie and she loved it! Win Win!!",
      "rating": 5.0,
      "verified": true,
      "author": "iliana",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "In love",
      "text": "Love my mixer so much! It’s easy to use, easy to clean and very pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Skyler",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Broken Lid",
      "text": "Item arrived quickly and works well. However, the top lid was broken. Unhappy about that.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela Greene",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Okay for beginners.",
      "text": "It is overall a good mixer, and a great one for a novice baker. It doesn't quite have the power I had hoped for, and the attachments feel light and almost like plastic. It will do for now, but I will be upgrading soon.",
      "rating": 3.0,
      "verified": true,
      "author": "holleratchagirll",
      "helpful_votes": 10,
      "publication_date": 20170602
    },
    {
      "title": "Glad I Made A Change",
      "text": "I make about 60 muffins a day from April through October and for years I've been doing it with a 50-year-old Kitchenaid that is still running fine. But I needed more capacity and the reviews for the newer Kitchenaids weren't encouraging (nor was the price), so I took a chance on this Cuisinart. Boy, am I glad I did. Quiet and powerful. Holds a lot and has a great handle and pour spout to everything stays cleaner. And the price — at $163 — was so good. ------------ Today the price is almost $100 higher, but the machine is still wonderful. Best mixer I have ever had. But I'm glad I got it at a lower price.",
      "rating": 5.0,
      "verified": true,
      "author": "Utah",
      "helpful_votes": 27,
      "publication_date": 20170607
    },
    {
      "title": "High Performance Mixer",
      "text": "This mixer is all I had hoped it could be - and more. I did my \"homework\", reading many (even 1 star) reviews and this little mixer (which was among the least expensive, came out \"smelling like a rose\". The attachments are perfect and are very easily attached and detached - an important thing for arthritic hands! It doesn't take up a huge amount of counter space - another important consideration in smaller kitchens. I didn't realize that there was no revolving turntable, but that is my error. I am extremely happy with it and would definitely recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "mimiro",
      "helpful_votes": 10,
      "publication_date": 20180103
    },
    {
      "title": "Excellent Stand Mixer",
      "text": "I've used Kitchen aide mixers for decades but the prices are ridiculous these days so I bought this one. Its an excellent stand mixer and it might last longer than the kitchen aide mixers I've used. The contacts for the speed go out on the 5 kitchen aides I've owned so I gave the last one away with ALL the attachments and from the position and type of speed control on the Cuisinart it will certainly last longer and does an excellent job.",
      "rating": 5.0,
      "verified": true,
      "author": "Ammie Nelson",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great But Somewhat Small",
      "text": "This Cuisinart stand mixer is great, if only it was a bit bigger (it is of medium size). Since in my family we bake our own bread most of the time, this was a very needed addition to the kitchen. This has a 5.5 quart stainless steel mixing bowl, and works really well. This stand mixer is easy to operate and comes in handy when baking, and it is easy to clean. If this had a 7 or 8 quart mixing bowl instead of 5.5, I would've rated it 5 stars. This is a great stand mixer, and it would've been perfect if it was just a bit bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "Lovely D.M.",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "I LOVE THIS THING!",
      "text": "This is my first stand mixer and I am completely satisfied with it. I purchased around Christmas 2019 and got it for a steal ($150). It works fabulously and has held up over several baking projects and is my go-to for shredding massive amounts of chicken for weekly meal-prep. I am not a baker, nor do I use this every single day so if you're looking for something heavy-duty I can't realistically comment on this, but for someone using this a few times each week it will do the job credibly. It is heavy and will stand in place as expected. The bowl is a great size and the cover works as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "clangne",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Its defective",
      "text": "This item has a defect, the paddles do not go to the bottom of the bowl",
      "rating": 1.0,
      "verified": true,
      "author": "Carmen J. Agosto",
      "helpful_votes": 4,
      "publication_date": 20190608
    },
    {
      "title": "Works well but there is a little design flow.",
      "text": "I wish the head is narrower so I can pour the ingredients while the machine is at work. It is a bit of a pain to stop the machine and tilt the head in order to pour the ingredient or to scrap off the side or bottom of the bowl. So I wish either the machine's head is narrower or the bowl is wider.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 13,
      "publication_date": 20180126
    },
    {
      "title": "Paddles don't reach sides or bottom",
      "text": "I was excited to finally have a stand mixer. I have used it twice to cream butter. The first time, I thought that maybe my butter wasn't soft enough as the butter just stuck to the bottom and low sides. The beaters were just going round and round, not touching the butter. The second time I made sure the butter was very soft. Again, the paddle does not reach the butter. I had to keep using a spatula to stir it by hand. I am going to have to return it and continue to use my old hand mixer which actually works. I am surprised that this is acceptable to anybody.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "This is an excellent mixer at a great price",
      "text": "This is an excellent mixer at a great price. Nice and heavy with a big bowl and a relatively quiet motor. I did a good amount of research before settling on this model--it's a significant investment, after all--and am very happy with my choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Love2Read",
      "helpful_votes": 6,
      "publication_date": 20180503
    },
    {
      "title": "Recommended.",
      "text": "Bought this one over the more expensive and popular Kitchen aid one as I wasn't sure how much I would actually use it. (And warranty was longer) Used to make multiple bread doughs with it so far and could not be happier. Would not hesitate to recommend the item. See little difference between quality of this or Kitchen Aid offering (Had good look at sister in laws KA mixer for comparison)",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Bishop",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Gets the job done for the most part",
      "text": "I'm an avid baker and bought this mixer a few months ago. Wanted to save money from buying a Kitchenaid. This mixer has gotten the job done for the most part, but be prepared to stop your mixer very often to scrape the sides and the bottom. My mom owns a Kitchenaid and I didn't have to do this much scraping, so I'm currently shopping for one of those. But I'll still keep this one to have two mixers, like to beat egg whites or something.",
      "rating": 4.0,
      "verified": true,
      "author": "Moni Thoms",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Love this Mixer!!",
      "text": "I just received my new mixer yesterday. I made yeast rolls and a cake and WOW! Why did I wait so long to buy a new mixer. It’s sturdy, quiet and each accessory works great! I really wanted the chrome but the white one would be delivered sooner. Turns out the white was late!! But other than that I only have compliments on my new mixer! I hope it gives me many years of great service.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Mcduffey",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Cuisinart quality.",
      "text": "Wife has used it a few times and loves the way it works, I like the fact that it has about 70% more power than the leading competitor budget priced and cost less.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Chaparro",
      "helpful_votes": 2,
      "publication_date": 20180708
    },
    {
      "title": "Great appliance",
      "text": "This has been a great appliance, and was bought to replace a similar mixer from a different kitchen company. Works OK, although I don't care for the tilt head lock lever, which you must release every time you want to lift the mixer head. I use it occasionally, and it works fine for my needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Waldo",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Just okay",
      "text": "I really would love to like this mixer. It does an okay job. Not as strong as my kitchen aid, even when it is turned all the way to the highest setting, it loses power and drops it back to around 9-10.",
      "rating": 3.0,
      "verified": true,
      "author": "jmerbitz",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Excellent",
      "text": "My \"stand mixer\" died after 13 months so I decided to purchase this to make mashed potatoes........Well for Thanksgiving we made mashed potatoes (that came out creamy and fluffy) and my daughter made Pumpkin Pie and the pie tasted whipped instead of packed. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady in Red",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Good power for dough, good price for what you get",
      "text": "Made cinnamon rolls, took care of dough like a champ. Like tilt head and attachments that come with it. No complaints so far",
      "rating": 5.0,
      "verified": true,
      "author": "Son of Detroit",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Best Mixer on Amazon",
      "text": "This mixer is as good or better than the best KitchenAid mixers of yesteryear. If Cuisinart is on the name tag it is the real deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank D Rier",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Works great!",
      "text": "Bought this as a gift for my mom and she loves it! It looks so clean and sleek! Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "camille chavez",
      "helpful_votes": 4,
      "publication_date": 20171008
    },
    {
      "title": "as advertised",
      "text": "powerful motor !!!, good mixer.... not as many accessories/attachments as Kitchen-Aid but plenty for the average kitchen.... Spiralizer works as shown on their video",
      "rating": 5.0,
      "verified": true,
      "author": "rci",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Pleased as puddin",
      "text": "Beautiful ❤️ I absolutely love it. Just what I expected. Arrived immediately. Thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Johnson",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Wish the pour spout was deeper. Flour spilled all ...",
      "text": "Wish the pour spout was deeper. Flour spilled all over the top of the bowl cover no matter how carefully I poured it.",
      "rating": 3.0,
      "verified": true,
      "author": "Elaine M",
      "helpful_votes": 2,
      "publication_date": 20180602
    },
    {
      "title": "Great product",
      "text": "Great product saves me plenty of time every day no complaints whatsoever buy without any hesitation",
      "rating": 5.0,
      "verified": true,
      "author": "Wise One",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "I love her beautiful!!!",
      "text": "It is exactly what I needed, it is beautiful, I chose it white, it is of good material, nothing to envy the most famous, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Noemi Duran",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Excellent for the price",
      "text": "Like a kitchenaid but cheaper. It's sturdy and do the job. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Mixer",
      "text": "This was a gift for my mother, she absolutely loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine M. Williams",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Nice mixer",
      "text": "I got this for a great price, and it works very well. I like the looks - very stylish. This is my second go, as the first one I ordered had a faulty motor (made a hideous sound. This was most likely due to being totally beat up during shipping and/or at the warehouse. I sent the broken one back, and Amazon came through like a champ and IMMEDIATELY sent me another one (this time packaged with an outerbox for protection.) In any event, the mixer is wonderful. Would recommend. For the price, you cannot beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Discerning Eye",
      "helpful_votes": 7,
      "publication_date": 20170508
    },
    {
      "title": "and he does not like any of the gluten free breads on the market",
      "text": "My husband was diagnosed with celiac disease a year ago, and he does not like any of the gluten free breads on the market....so I have been trying recipes for homemade. I just used this mixer to make gluten free rye bread, and I was thrilled to be able to mix two loaves at once with no trouble at all. I had been using a cheap stand mixer and struggling with the weight of the dough for even one loaf. I also did it in half the time. This mixer was well worth the money....and the bread is delicious!",
      "rating": 5.0,
      "verified": true,
      "author": "jean austin",
      "helpful_votes": 2,
      "publication_date": 20171015
    },
    {
      "title": "Unhappy",
      "text": "The box was broken and I don't even think it work. I'm very unhappy with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 8,
      "publication_date": 20170516
    },
    {
      "title": "I need to contact the seller. As riduculous as ...",
      "text": "I need to contact the seller. As riduculous as this sounds, I can't unpack the item and can't find a way to contact anybody for help. There is styrafoam around the bowl and head of the mixer and can't get it off and no way to contact cuisinart or seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Connorslady",
      "helpful_votes": 24,
      "publication_date": 20161208
    }
  ],
  "product_meta": {
    "title": "Cuisinart SM-50 5.5 - Quart Stand Mixer, White",
    "description": "Color:White LinenCuisinart is changing the way the world mixes! This phenomenal new stand mixer delivers more power, more capacity, and more options - and it comes with the best name in the business! Features: 5.5-quart capacity polished stainless steel bowl|500-watt motor|Die-cast metal construction|12 speeds for precision mixing|Tilt-back head|One power outlet for optional attachments|Includes chef’s whisk dough hook flat mixing paddle and splash guard with pour spout|Instruction/Recipe book|Limited 3-year warranty|Colors: Silver Lining Onyx Periwinkle Blue Ruby Red White Linen Robin's Egg|Optional Attachments:|Pasta Extruder Pasta Roller & Cutters Ice Cream Maker Meat Grinder",
    "rating": 4.7,
    "feature_bullets": [
      "Large 5.5 - quart capacity, polished stainless steel bowl",
      "Powerful 500 watt motor, Die cast metal construction",
      "12 speeds for precision mixing & tilt back head allows easy access to bowl",
      "One Power outlet for optional attachments",
      "Chef's whisk, dough hook, and flat mixing paddle, splash guard w/pour spout"
    ],
    "specifications": {
      "Product Dimensions": "14.17 x 7.87 x 14.13 inches",
      "Item Weight": "18.35 pounds",
      "Manufacturer": "Cuisinart",
      "ASIN": "B01H7R1EJY",
      "Item model number": "SM-50",
      "Customer Reviews": "4.7 out of 5 stars1,299 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#4,665 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 17, 2016"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Mixers",
      "Kitchen & Dining",
      "Stand Mixers"
    ],
    "price": 199.58
  }
}