{
  "website_summaries": [
    {
      "verdict": "Once you clear the plastic film hurdle, you’ll find yourself with a high-quality chalkboard that is small enough to mount in tight spaces or use with an easel.",
      "pros": [
        "Great for those looking for a smaller chalkboard",
        "Comes as a complete set that includes an eraser, chalk, and magnets",
        "Nice quality and look for the money",
        "Writes and erases well"
      ],
      "cons": [
        "The board ships with a plastic film that can be very annoying to remove"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome!!!!!!",
      "text": "This chalkboard is wonderful. I don’t know why people gave such bad reviews on it! The clear plastic came off with no problem what so ever. I bought this to use for writing down my sons daily schedule when he is being babysat. I’m putting it on the wall. Then when he’s older I’ll give it to him. But this is perfect and I have zero complaints. I like the different color pieces of chalk that it comes with— very cute! I love it. Very happy!!!! *update. It is now hung! Super happy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Nicole",
      "helpful_votes": 11,
      "publication_date": 20180219
    },
    {
      "title": "Easy install. Chalk writes like my childhood detention punishment",
      "text": "This is my garage to do list. Writes and erases perfectly. It replaces a whiteboard that doesn't erase and markers dry out in 7 seconds. Easy install. Chalk writes like my childhood detention punishment, but with pretty colors. Easy erase. Chalk breaks when drunk husband tries to write \"Phillip is awesome.\" in all the different colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer N",
      "helpful_votes": 13,
      "publication_date": 20170404
    },
    {
      "title": "Excellent product",
      "text": "I bought two of these for my granddaughters for Christmas.They thoroughly enjoyed them and still are. The chalk boards arrived on time and extremely well packaged and are great value for money. In these days of digital toys the chalk boards are a traditional toy which will last and last",
      "rating": 5.0,
      "verified": true,
      "author": "Colin",
      "helpful_votes": 5,
      "publication_date": 20170102
    },
    {
      "title": "Perfect little chalkboard",
      "text": "I love my chalkboard! The eraser actually works and it came with so much chalk. It was easy to hang and all the magnets that come with it work well, and I also think it looks adorable on my wall! The only bad thing, and it’s pretty annoying, there’s this protective plastic on the blackboard part that they assembled the frame on top of, so you have to try to rip it out from between the frame and the chalkboard and it’s never going to fully be removed I don’t think.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Outstanding chalkboard and superior customer service!",
      "text": "Used it to affix to a child’s easel. Can mount to a wall as well. Lightweight. Super easy to mount. Just run a knife around edge of board to remove protective film. First one arrived damaged (footprint on the carton which bent the board. Seller sent free replacement immediately although it was delivery damage. My 3 year old is loving this! Comes with 2 sets multicolor chalk and a great eraser!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy S",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Great product and seller!!!",
      "text": "Excellent product! Chalkboard works great and love the magnetic eraser and blue smiley magnets! Seller is wonderful, if you have any issues let them know and they will take good care of you! IMPORTANT TIP: The thin film on the board removes easily IF you just take your time and do this: Score around inside edges of the board with a sharp blade and then lift a corner. Then continue to score around again as you are lifting that section of the film. Doing this gave me a nice clean removal all the way around. I absolutely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "paws413",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Love this board!!",
      "text": "Board is as described! Directions are very thorough. I contacted the seller about removing the tray and they responded with accurate instructions (wish I would have contacted them sooner instead of reading the Q&As that had inaccurate info). If anyone is looking to remove the tray - remove the screws on the 2 corners and remove carefully and replace the screws after. Easy peasy. Love the board!",
      "rating": 5.0,
      "verified": true,
      "author": "Moni",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Disappointing",
      "text": "At this price, for such a simple item, there shouldn't be disappointment with the basics. The blackboard itself is flimsy and the eraser is not very effective, that may be because the surface is such poor quality. I'm sorry I didn't open it and return before giving it to my grandson. I simply didn't expect \"disappointing\" for the price I paid for a simple item.",
      "rating": 1.0,
      "verified": true,
      "author": "JMcC",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Really nice quality blackboard",
      "text": "Our 6 year old grand daughter uses this to teach school. lol. It is a nice quality, erases well. The chalk is a little thin and breaks easily, but I will just pick up some thicker chalk. Like how the erases has a magnetic strip that keeps it on the board, so it is in easy reach.",
      "rating": 5.0,
      "verified": true,
      "author": "owlbert",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Would recommend!",
      "text": "Really liked this! Will definitely be purchasing again in the future but would really appreciate receiving a \"free\" one. This board blew me away I have to admit I was surprised. What I really, really liked are the adjustable hanging hooks! Very cool! I liked that they provided supplies and hope they will continue to do so. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Eve",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Exactly what I needed.",
      "text": "Love it! Am using it in conjunction with scrabble letters with added magnets. Looks great. Plastic film is annoying to remove... score the edge near the trim with scissors for a cleaner removal.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna S. Johnson",
      "helpful_votes": 4,
      "publication_date": 20170217
    },
    {
      "title": "Excellent chalkboard. This is a painted steel surface",
      "text": "Excellent chalkboard. This is a painted steel surface, that works great with liquid chalk markers. Erases perfectly with a damp cloth. Exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "John Mark",
      "helpful_votes": 6,
      "publication_date": 20170102
    },
    {
      "title": "A great seller with awesome products :)",
      "text": "I ordered this magnetic chalk board for homeschooling my daughter and it was a great purchase that is affordable Thank you for shipping it so fast to me and for making this transaction so pleasant it looks awesome in her homeschool room and is working out great it really has stepped up my homeschooling I will be ordering from you again soon :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Baxter",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Well built",
      "text": "I bought two of these as learning tools for my grand-kids, the chalk boards were well made, easy to mount and came with everything my gran-daughter's needed to enjoy right out of the box - they were well protected in the shipping box, no worries as far as damage, they came on time as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Good chalk board for the money",
      "text": "I purchased this product a month ago. I did a lot of on line research and decided on this product based on the reviews. I will say many of the reviews mentioned the difficultly in removing the chalkboard covering. I don't know if the design has been changed, but I had no problem removing the film. I have used both the provided chalk sticks and chalk markers on the board. Both of these can be erased though the chalk sticks provided with the chalk board are more prominent and easily erased than the chalk markers.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "This Chalkboard is great and light",
      "text": "This Chalkboard is great and light.... Everything from the chalkboard set came in the 2 magnets, the 2 packages of 7 piece chalk sticks, the eraser .. its also a great use for children...The plastic film is not difficult to take off but if its not taken off carefully little pieces of the plastic film stays but the chalkboard is still good for use its not much of a bother but I just thought I should let u know.... anyways is a great product and I am satisfy",
      "rating": 5.0,
      "verified": true,
      "author": "sandra",
      "helpful_votes": 2,
      "publication_date": 20160925
    },
    {
      "title": "Instant Hit!!",
      "text": "This was one of the best purchases ever. My husband wanted it for 2 yr old grand-dtr and it was an instant hit. As soon as she comes into our house, she heads straight to her chalkboard room. This board is very lightweight so don’t expect an old school blackboard. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "emohio",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "A great product and seller!!",
      "text": "This is exactly what I needed as I, like many, now work remotely until it is safe to return to work. The seller is honest and will work quickly to correct even the slightest issue. I will definitely purchase from this seller again!! Thank you Navy Penguin!!",
      "rating": 5.0,
      "verified": true,
      "author": "ReiKay",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "An excellent chalkboard",
      "text": "I love having a chalkboard in my kitchen so I can write menus. This one is from tonight. All vegetables are from our garden, the fish from wegmans. The accessories are fine and the company is headed by a real person. Buy this and you will enjoy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue K. Lyon",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "it hangs up nicely and it is very cute and handy",
      "text": "Just what I wanted, the chalk writes smoothly, it hangs up nicely and it is very cute and handy. My only feedback would be the plastic sealing that was over the board when it came, it was kind of a pain to get off and some of it is still stuck in the corners. I wonder if there is a different kind they could use.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachelle",
      "helpful_votes": 2,
      "publication_date": 20161217
    },
    {
      "title": "Great, inexpensive and good for years!",
      "text": "Purchased as a birthday gift for a two year old. She loves it. And it came with bright chalk and an eraser. We use a microfiber cloth for a cleaner erase, but the quality is great and the 8 year old brother is equally excited with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Aryn",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Works as it should",
      "text": "Sturdy, and it \"receives\" the chalk well: the chalk shows up brightly, and erases pretty well. So far, it's survived my little monster, and when she loves a toy, she really loves a toy. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Sturdy and durable",
      "text": "Got this for my kid who loves to draw and it's still going strong! Perfect size to hang for him to draw and write. He uses it daily and still going strong",
      "rating": 5.0,
      "verified": true,
      "author": "Clumsy introvert",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Great item",
      "text": "We just received the Chalkboard a few days ago. We used it to hold all of the magnets we have collected while traveling. It works great, however, the only problem we had was getting the plastic covering off. We read the information sent with the product, but it still a great way to show your magnets. Other than the plastic covering problem, I would still recommend this item.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Good product and well made.",
      "text": "Good product. I use for Darts scoring. Like shelf for eraser and chalk. I used double sided tape to put on block wall but there are two rings for attaching with nail etc. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Awesome chalkboard!",
      "text": "This chalkboard is great! I really like the surface - it cleans easily and is a good size. One word of advice. . . Like another person mentioned, take your time removing the protective plastic sheet. It takes a little patience but comes off so no worries.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny J.",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Would be a 5 star if I could hang it up",
      "text": "Great price, it is true to size and it arrived on time in a double box. Emailed shortly after I ordered with confirmation and shipping info which was nice. However after I unwrapped and attempted to hang it one of the sliding hooks wouldn't move. The box wasn't damaged so I'm not sure how the top left side got warped. Also no directions as to how to remove the removable tray without damage. I really needed this today and can't wait a week for a new one so I guess I'm stuck😕",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "My grandson loves this board",
      "text": "I've been teaching my grandson to read. We're using this as an additional tool to help him learn different words. He loves writing on this board and also erasing the words I ask him to identify. It seems to be a good quality product!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Renick",
      "helpful_votes": 2,
      "publication_date": 20170506
    },
    {
      "title": "Study but lightweight",
      "text": "I bought this Cali board because I have to have oral surgery & might not be able to talk. I picked this one because I thought it might be a good value as it comes with chalk & an eraser. It’s a great size plus it can be hung!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharen D.",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great Item",
      "text": "Very impressed ! Well made. Carefully packed. Quality item. I am extremely happy",
      "rating": 5.0,
      "verified": true,
      "author": "LMP",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Child’s chalkboard",
      "text": "My only complaint was that the chalk was broken in all the sets we received.",
      "rating": 4.0,
      "verified": true,
      "author": "LVgal",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Buy it!",
      "text": "Best investment! i hung up on wall and my kids use it all the time. everything included is value for the money spent",
      "rating": 5.0,
      "verified": true,
      "author": "CAITLIN D.",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "This item is a great gift for a child that likes to draw",
      "text": "This item is a great gift for a child that likes to draw. I purchased it for my two year old Grandson and he spends unless time with it. He enjoys that the board is big enough so that Mom or Dad or Gram can draw along with him. Great product, great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy J. Jones",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Sturdy. The only thing is we are using it ...",
      "text": "Exactly what I was looking for. A chalkboard that was completely magnetic. Well built. Sturdy. The only thing is we are using it horizontally and you cant move the chalk holder to the other side so it is a little inconvenient. If not for that I would have given them 5 stars",
      "rating": 4.0,
      "verified": true,
      "author": "Queencie",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Great for school",
      "text": "I love this board. My daughters love this board, easy to write on, see, and clean. I would definitely recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Porcha Cedano",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great value. Very lightweight.",
      "text": "This has been a great addition to my daughter’s art studio.",
      "rating": 5.0,
      "verified": true,
      "author": "DonB",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Forget no more",
      "text": "Helps me keep track of 11 shih tzu’s scheduled bathings. 👍💥",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Flanigan",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great Message Center",
      "text": "This is a great message center! I've hung it next to the kitchen phone to write messages with the chalk handy so everyone can see and never miss another message. The only thing is I had a heck of a time getting the protective plastic off the chalk board part. Maybe a handy pull tab in the corner? But other than that no issues. Would buy for a friend and highly recommend. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Poodle",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Great little chalk board!",
      "text": "Just as described, I am very happy with this purchase. Received it quicker than they indicated we would.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Davis",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Brought it as a Christmas gift for my little sister ...",
      "text": "Brought it as a Christmas gift for my little sister. She loves it but now I get to teach her math on it so maybe she has mixed felling.",
      "rating": 5.0,
      "verified": true,
      "author": "Darrel",
      "helpful_votes": 2,
      "publication_date": 20170117
    },
    {
      "title": "HATE the eraser",
      "text": "I can't stand the eraser. Have to push so hard and it still doesn't do the best job. Other than that, pretty decent chalk board.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Steele",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "A Gift for my 3 year old",
      "text": "My two brothers are in love with this! I love how it already comes with an eraser and different color chalk. So i don't have to spend more money to buy more. To take off the cover of the board was a little tricky, but i was able to take it off eventually.",
      "rating": 5.0,
      "verified": true,
      "author": "violet",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Chalk Board",
      "text": "Amazon delivery, great as usual. Board well worth the money, not so much the chalk. Only used chalk couple of times, and it has broken into about 5 pieces.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack D. Fallen",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Great Product for a four child!",
      "text": "My four year old great-grand-daughter is really enjoying this one X-mas present, Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "coyotehunter67",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great quality",
      "text": "I'm really happy with this purchase! We bought it for our toddler, who had shown an inclination to drawing/doodling, and we could barely tear her away from this. The build quality is great, so I know this will be something that she'll be able to grow up with.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "I love it and so does my granddaughter",
      "text": "I love it and so does my granddaughter. It has helped her to not be so nervous when she is asked by her teacher to complete a math problem or other class subject on the blackboard in her classroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Candy Jennings",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Packaging is nice",
      "text": "Great product and good quality. And the packaging is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby Bom",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Awesome board! Definitely worth its price!",
      "text": "Ordered this board for my toddler and he loves it! It’s the perfect size for him, & I love that it comes with chalks & the eraser! It also comes with two little magnets & you can hang it as well and that part is adjustable which is amazing! Everything about the board is awesome extremely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mayra",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Very Nice!",
      "text": "Arrived very quickly. The chalkboard is very nice and our grandkids just love it. Very sturdy and well made. The protective plastic was a little hard to get off, but it did protect the board. Very happy with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 4,
      "publication_date": 20161224
    },
    {
      "title": "Very Nice",
      "text": "My two year old great granddaughter loves this product. It keeps her busy for quite a while. We did not hang it. She sits on the couch, with it on her lap, with a towel underneath, and colors away. She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannie Nourse",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Really great product, I love it!",
      "text": "This chalkboard is amazing, it's very smooth to write on, and I absolutely love it! The plastic film is a breeze to remove.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Wonderful purchase! My little one loves writing with chalk ...",
      "text": "Wonderful purchase! My little one loves writing with chalk on a board, and this board serves its purpose so well! Comes with everything she needed to write to her heart's content. Super happy with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Jo",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Great purchase",
      "text": "Loved this chalkboard- perfect for what I needed and love that eraser was magnetic- I did not like the peel off film on the chalkboard because it was very hard to remove it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "LINDA DOUGHTEN",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "granddaughter loved it!",
      "text": "my granddaughter is always drawing something.She loves the chalkboard set.Now its easy for to express herself erase it and give another precious drawing!",
      "rating": 4.0,
      "verified": true,
      "author": "robert",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Great Buy",
      "text": "This was a gift for a friend. He says he likes it very much and that was the size he was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Wood",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Good slate chalkboard which can be hung.",
      "text": "I wanted slate, and this item provided that. Well made for the price which I thought was very reasonable. This board can be hung which for me was a necessary feature. The chalk, eraser, and magnets were a bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Happy with it",
      "text": "Nice chalkboard. It was a gift for my 7 year old. He’s happy with it. I like the chalk, eraser and magnets it came with, too. Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Htrou",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Chalkboard",
      "text": "It serves its purpose. I bought it for my 2 yr. old grandson. He loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "LINDA FRAZIER",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "More like a foam board with a chalkboard like surface",
      "text": "Not a \"real\" chalkboard. More like a foam board with a chalkboard like surface. Ok for the price but I wanted a bit better surface.",
      "rating": 3.0,
      "verified": true,
      "author": "Ann M",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Five Stars",
      "text": "perfect size for kitchen table math lessons with my 5 yr. old grandson",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma ND",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Easy to install",
      "text": "Arrived on time! Easy to install. Pls follow instructions. You need to use a sharp tool and trace it on the side to remove the film. I love that it's magnetic. I use it for work.",
      "rating": 4.0,
      "verified": true,
      "author": "Pooh9rfan",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Awesome product and customer service!",
      "text": "This chalkboard is the perfect size for quick notes. It is light and easy to hang but also very sturdy. I also have to rave about the customer service!!! My first board came in with a dent. And, with no questions asked, Navy Penguin shipped another one ASAP. Love this product and them!",
      "rating": 5.0,
      "verified": true,
      "author": "Lidia Lumovic",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "We pu6 it up for a few weeks but ended up throwing it away when I found another I liked better.",
      "text": "Seemed cheap to me. We pu6 it up for a few weeks but ended up throwing it away when I found another I liked better.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Five Stars",
      "text": "That minute my granddaughters saw this, all Christmas presents went to the side. Played with it all day.",
      "rating": 5.0,
      "verified": true,
      "author": "grandma",
      "helpful_votes": 2,
      "publication_date": 20161228
    },
    {
      "title": "Mad the plastic cover was sooo anbotibg to get off ...",
      "text": "Mad the plastic cover was sooo anbotibg to get off the board it messed this chalkboard up cause it 2as almost impossible to remove",
      "rating": 1.0,
      "verified": true,
      "author": "SexxcciiEve",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "This chalkboard is great. Just the right size and everything you need ...",
      "text": "This chalkboard is great. Just the right size and everything you need comes with it. I use mine as a reminder of chores I have to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Frye",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Five Stars",
      "text": "Easy to clean, helps to keep me on track with my errands and medications. Sleek design, looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "B.K.",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Great addition to our art room",
      "text": "I would highly recommend these chalkboards ! We purchased for use at our school and the kids just love them so far. Accessories that came with made it fun for the kids to hang things on them and also erase. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Cheney",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Great chalkboard set",
      "text": "This little chalkboard is perfect for at home learning. Not to big or heavy. With plenty of space to write on or use a magnet to hang paper assignments. Love the ledge to hold the eraser and chalk. Works well for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Bartolotta",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "chalk it..",
      "text": "Very happy with chalkboard....perfect for my needs. It is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "sue marshall",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Great Purchase",
      "text": "'The blackboard arrived and the kids love it. After only one day, we needed to buy more chalk. Thank you Navy Penguin.'",
      "rating": 5.0,
      "verified": true,
      "author": "HT",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Great product. You can hang it or put it ...",
      "text": "Great product. You can hang it or put it on a table easel. An easel will cost you $4. And you can put it on the counter.",
      "rating": 5.0,
      "verified": true,
      "author": "mary keaveny",
      "helpful_votes": 2,
      "publication_date": 20170418
    },
    {
      "title": "Waste of money",
      "text": "As you can see it arrived damage and it's very cheap looking. Will not buy again!",
      "rating": 1.0,
      "verified": true,
      "author": "Branda Schod",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "This is so fun and perfect for anything",
      "text": "This is so fun and perfect for anything; school, office, home, business. Can express creativity, post reminders, advertise, give directions, etc",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20160417
    },
    {
      "title": "Great Chalkboard for the price.",
      "text": "The only negative is the chalk that comes with board breaks easily, but my 5yr old grandson uses sidewalk chalk on it. We hung this in his wooden play set outside in the part that’s covered. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Waggoner",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Durability for child use. Good size.",
      "text": "'' O.k., I was looking for a chalk board to fit the needs of a 4 & 6/yr. Old. Something they could use for a homework tool. It was well designed and the items that accompanied the board were a bonus! ''",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Just as discribed.",
      "text": "Great item. Light, easy to use. I like the protective cover over it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Marvin Trice",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Five Stars",
      "text": "Love the chalk board. It is everything I expected and more.",
      "rating": 5.0,
      "verified": true,
      "author": "sweethree",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Made well, parent friendly",
      "text": "Made well made The tray attaches on easy to keep chalk on.",
      "rating": 5.0,
      "verified": true,
      "author": "K. J. Wyckoff",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "High quality/easy set up",
      "text": "This chalk board came with chalk and an eraser, which is nice. I’m also impressed with the quality of the board. It’s so nice and my little girl loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "This is a great board and it deserves 5 stars",
      "text": "This is a great board and it deserves 5 stars. However it came with a scratch already under the protective covering which is a little frustrating. Other than that I would order again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "The company Navy Penguin is the seller, great to work with!",
      "text": "My grandson is very artistic and he likes to paint, draw and create. He likes the chalkboard because he can change his design with a swipe of the eraser!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Good small chalk board",
      "text": "Good little chalk board. I just got this for our game room to keep track of the pool score. It's small, but decent quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Cal gal",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Five Stars",
      "text": "Perfect fit for a child's playroom. Nice to use chalk and be able to erase. Sturdy and great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "lynnmlowe",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Good product for price",
      "text": "Our 6 year grandaughter loves to play school with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Very well worth it",
      "text": "Great price, fast delivery, and great quality of goods. Very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "philip moore",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Perfect size to work with your kid",
      "text": "Perfect size , I bough it for my toodles since we are learning ABC’s is perfect size for her to use and to practice",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica G",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "the stand up board is also a good buy.",
      "text": "it is as described. the stand up board is also a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Objectivo",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Omg I’m in love with this blackboard",
      "text": "Omg I’m in love with this blackboard. I LOVE THE QUALITY 🙌🏼 Thank you ...I really like this product that’s why I am writing ✍️ my first review.",
      "rating": 5.0,
      "verified": true,
      "author": "pily",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "I would purchase again , and I recommend .",
      "text": "Got it for 4 yr old grandchild since not going into school. Easy to move around , small and just right size. Liked all the different chalks.",
      "rating": 5.0,
      "verified": true,
      "author": "jacqueline bennett",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Cost Worthy",
      "text": "Great for garage gyms. I use this product daily and it’s a perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN MYERS",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Good board especially for the price!!",
      "text": "Perfect for my daughter's room, she loves it. Great size!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy Godfrey",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Good purchase",
      "text": "Great way to keep a young child entertained during rainy Seattle days. My only gripe is that the metal shelf is kind of sharp and can potentially cut you.",
      "rating": 4.0,
      "verified": true,
      "author": "saranyaks",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "but overall a nice chalkboard. My 4 yr old loves it",
      "text": "Took forever to remove the plastic wrapping, but overall a nice chalkboard. My 4 yr old loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Evita",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "love mine it's in kitchen area",
      "text": "Needed a little help with seller and the helped me fast and 100% !love mine it's in kitchen area.",
      "rating": 5.0,
      "verified": true,
      "author": "MSKerri",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Solid product just as stated",
      "text": "Packaged with care. It arrived safely. Protective film on board once removed the board is great to write on. Good company to to business with.",
      "rating": 5.0,
      "verified": true,
      "author": "LauraT",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "As described. Bought for my 10 year old and ...",
      "text": "As described. Bought for my 10 year old and she loves using it. Small enough to carry around or hang up if you'd rather.",
      "rating": 4.0,
      "verified": true,
      "author": "NYMom",
      "helpful_votes": 0,
      "publication_date": 20160525
    },
    {
      "title": "The chalkboard is washable",
      "text": "The plastic film covering it was a bit hard to remove, otherwise great job",
      "rating": 5.0,
      "verified": true,
      "author": "Ashish S.",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Good value",
      "text": "Great value for the dollar! Horrible protective film over the chalkboard! Took me more time to remove it, then it did to attach it to the wall.",
      "rating": 4.0,
      "verified": true,
      "author": "john megas",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Chalk Board",
      "text": "Love my chalk board! The board has helped me to be more efficient in the kitchen for marking off daily chores and keeping a current shopping list. Thank you for the variety of colored chalks too! Rose Marie, San Diego",
      "rating": 5.0,
      "verified": true,
      "author": "Rose M. Spellman",
      "helpful_votes": 0,
      "publication_date": 20160306
    }
  ],
  "product_meta": {
    "title": "Chalkboard Set - Framed Black Board 24 x 18 inch + 1 Magnetic Eraser, 14 Chalk Sticks (7 Colors) and 2 Magnets - Small Wall Hanging Blackboard with Frame for Home, Kitchen and Kids (24x18\")",
    "description": "Size:24x18\" LandscapeChalkboard Set - Chalk Board + Accessories \n\n✔ Premium Pack - contains 1 black chalk board + 1 magnetic chalk eraser + 14 colored chalk sticks (7 colors in total, 2 pcs from each) + 2 magnets. \n✔ Easy to install - Movable hanging hooks allow to adjust hanging distance easily. Attachable chalk tray is also included to keep chalks, markers, erasers and other board accessories handy. \n✔ Multifunctionality - this personal chore chalkboard is perfect for presentation, education, to do lists, planning work schedules or kids learning. Suitable decor for outdoor, home, kitchen, fridge, office, cubicle, desk, class, school, kindergarten, college, dorm room, locker room, game sport room. Big help for managers, teachers, students and children. \n✔ Durable but lightweight - the blackboard has heavy duty aluminum frame. Resin-painted steel surface is easy for writing, painting, erasing, drawing pictures and signs. \n✔ Perfect Size - exact size of the board is 24\" x 18\". Portable, hangable, sturdy. \n\nREMINDER: The board's surface is covered by protective plastic film. Before use, cut along the board frame (using kitchen or stationery knife) and tear off the film using your fingers \nCHOKING HAZARD: The set contains small parts. To avoid choking hazard, keep the magnets and chalks away from kids and babies under 3 years. \n\nNavy Penguin - Lifetime Guarantee \nIf you for any reason are not happy with any product by The Navy Penguin, please do not hesitate to contact us and we will do our best to solve your problem asap! At The Navy Penguin we take full ownership and responsibility for the quality of our products.",
    "rating": 4.6,
    "feature_bullets": [
      "COMPLETE SET - this combo chalkboards set contains 1 black chalk board + 1 magnetic eraser + 14 colored crayons (7 colors) + 2 magnets (accessories).",
      "PORTABLE DESIGN AND SIZE - exact size of the chalk board is 24 x 18 in (medium, hangable in Landscape/Horizontal orientation only). Movable hooks allow to adjust a hanging distance easily (the board is wall mounted).",
      "STURDY BUT LIGHTWEIGHT - the blackboard has heavy duty aluminum frame. Resin-painted steel surface is easy for writing, paint, erasing, drawing pictures and signs.",
      "MULTI-FUNCTIONAL USE - this personal chore chalkboard is perfect for kids education, menu, to do list or planning schedules. Suitable decor for outdoor, home, kitchen, office, cubicle, classroom, school, kindergarten, college, dorm, locker and sport room. Useful tool for teachers, students and children.",
      "LIFETIME GUARANTEE - if you for any reason are not happy with the blackboard, please contact us, we'll send you a free replacement or refund your money."
    ],
    "specifications": {
      "Manufacturer": "Navy Penguin",
      "Brand": "Navy Penguin",
      "Item Weight": "2 pounds",
      "Product Dimensions": "24 x 1 x 18 inches",
      "Item model number": "Chalkboard NP38138128",
      "Is Discontinued By Manufacturer": "No",
      "Material Type": "Aluminum, Alloy Steel",
      "Size": "24x18\" Landscape",
      "Manufacturer Part Number": "Chalkboard NP38138128",
      "ASIN": "B01HMGMZWK",
      "Customer Reviews": "4.6 out of 5 stars313 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#21,332 in Office Products",
      "Date First Available": "October 9, 2016"
    },
    "categories": [
      "Office Products",
      "Presentation Boards",
      "Office & School Supplies",
      "Chalkboards"
    ],
    "price": 24.97
  }
}