{
  "website_summaries": [
    {
      "verdict": "Rust-proof and wear-proof set comes with all the vital knives.",
      "pros": [
        "Comes with 6 stainless steel cheese knives and an easy-to-read and understand guide for all cheeses"
      ],
      "cons": [
        "Does not come with any other accessories"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Made cutting cheese easier for our guests",
      "text": "This cheese cutting set allow our guests to help themselves with ease. We recently hosted a party in our apartment and had a huge cheese board. During previous parties, we just use regular utensils which caused a mess because some cheeses are more dense and in various shapes. Try cutting aged Grana Panago with a butter knife in one hand and a glass of wine in the other. The Lunar set just made it so much easier this time around. Completely satisfied with this purchase. Nothing like having the right tools for the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20161218
    },
    {
      "title": "This would make a great gift!",
      "text": "—Feel free to ask me any questions about my review!— I love these! I’m always making my fiancé and I little cheese boards. This set has a lot of variety and the handles are comfortable to hold and use. I do hand wash them, though. I hope my description was of use to you! —Follow @CassandraMercedes on Instagram for more amazing Amazon finds!—",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra Mercedes Hanes",
      "helpful_votes": 2,
      "publication_date": 20200918
    },
    {
      "title": "Lovely cheese knife set.",
      "text": "Very pretty and a shape and cutting blade for every type of cheese. These are dishwasher safe and very sharp. I would recommend them. I don't keep them in the box they came in but you could.",
      "rating": 5.0,
      "verified": true,
      "author": "SF Jan",
      "helpful_votes": 8,
      "publication_date": 20170906
    },
    {
      "title": "Perfect Cheese Knife Set",
      "text": "This 6 piece cheese knife set is absolutely perfect for what I wanted. I recently bought a new beach house and we entertain a lot doing many happy hours when we serve cheese and crackers. I looked for a cheese knife set everywhere and this set is not only one of the least expensive but also one of the only ones that comes with 6 pieces instead of 5. They all have a very nice weight to them and have a modern look to them. You cannot go wrong ordering this cheese knife set at this price or at any price.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcie Wolinsky",
      "helpful_votes": 3,
      "publication_date": 20180714
    },
    {
      "title": "Nice set of cheese knives - good value",
      "text": "Very nice set of knives, exactly as described and the stainless steel looks very nice and more expensive than they cost. I like the size and weight. Will probably hand wash and dry because of the potential rust spots that others have mentioned. Have only used once, but they washed nicely with soap and water and no spots at all.",
      "rating": 5.0,
      "verified": true,
      "author": "cathbarb",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "You Stay Classy San Diego",
      "text": "Bought this knife set after checking out similar options on amazon. Had a get-together with a few friends, and they were a big hit; maybe it was the wine :). Comes in a good variety for a number of different cheeses as well as a general guide for how to use and in which scenario. The set is elegant and definitely has a classy \"edge\" to it. The make quality is top notch. I would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Poozhikala",
      "helpful_votes": 7,
      "publication_date": 20161212
    },
    {
      "title": "Great knifes!!",
      "text": "I use these knifes all the time, no issue at all. They work as intended and I'm thankful for the cheat sheet to tell me which knife to use. I bought these in November of 2019 and even with weekly use there is no rust on any of the blades. I do hand wash and dry the knifes when I'm done using them. Thank you for a great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Lunar 6 piece Cheese Set, Great value and price!",
      "text": "Purchased the Lunar Premium 6 piece cheese knife set two days before my Christmas Party. Item arrived on time and in the morning, they were washed and ready to try out on my cheese platter. Nice quality and I received compliments on the matched set. Would definitely recommend this cheese set.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank R S",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "I love these small but mighty knives",
      "text": "I've used 3 of the knives so far. I love these small but mighty knives. I've sliced up these cheeses with ease: brie, cheddar, pepper jack, feta. They don't take up a lot of room in my kitchen drawers, thank goodness.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Kwong",
      "helpful_votes": 3,
      "publication_date": 20170529
    },
    {
      "title": "Fantastic",
      "text": "Excited about our 6-Piece Cheese Knife Set! Extremely Elegant! Can't wait to use it. We especially appreciated getting your email with the \"Cheese Wheel Guide - A complete guide for different cheeses!\" WOW that will be so helpful!",
      "rating": 5.0,
      "verified": true,
      "author": "DisneyButterfly32",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Awesome",
      "text": "This is a great little set and the seller provides a lot of information to help get you going on your cheese journey!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Crow",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great gift set!",
      "text": "Great quality. Nice feel and sharp blades. Am considering giving to niece for Christmas. My only comment is that I wish the set also had a cheese planet to slice thin even slices of hard cheese.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Very attractive",
      "text": "I was tired of mismatched cheese knives when I served a cheese board. These are attractive, a great size and very sharp so effective. Would be a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous female",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "My favorite Amazon purchase EVER!",
      "text": "This is set is absolutely one of my favorite Amazon purchases!! It complements all of my charcuterie boards. It is a perfect gift for someone who enjoys entertaining. It is boxed perfectly for gifting.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise ",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Great set!",
      "text": "I love the set. The set was incomplete. It is missing a fork tool. Instead I have 2 shaving tools. I would love it even more if the will send me the fork to complete the set.",
      "rating": 4.0,
      "verified": true,
      "author": "Peaceful Mist",
      "helpful_votes": 3,
      "publication_date": 20170823
    },
    {
      "title": "Great starter set for all cheese lovers",
      "text": "Knives have a good weight to them. I would encourage towel drying immediately after cleaning to avoid water marks/stains. Makes a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "piggy40285",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Wonderful product",
      "text": "We bought this as a gift for our daughter. It was delivered in a speedy manner. They look great and a proud to give this as a gift",
      "rating": 5.0,
      "verified": true,
      "author": "loreen m farmer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Great cheese knife set",
      "text": "Great cheese knife set. If you throw parties with a charcuterie board spread this is a must have. Dishwasher safe and looks just as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Conrad",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Appears sturdy. Packaged elegantly.",
      "text": "Seems nice so far. Have used once. Appears sturdy and well made. Hope the blades stay sharp. Packaged well from a marketing standpoint.",
      "rating": 5.0,
      "verified": true,
      "author": "christine neal",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Three Stars",
      "text": "Did not come with all 6 pieces. Missing a knife and had 2 forks instead.",
      "rating": 3.0,
      "verified": true,
      "author": "A. D.",
      "helpful_votes": 5,
      "publication_date": 20171212
    },
    {
      "title": "Nice selection!",
      "text": "Nice selection of cheese serving pieces! I am anxious to use them on next cheese board.",
      "rating": 5.0,
      "verified": true,
      "author": "Janis Thornton",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Nice quality.",
      "text": "Nice quality for a good price. Anyone who entertains would enjoy using these.",
      "rating": 5.0,
      "verified": true,
      "author": "CBB",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "They pair nicely with our slate cheese boards",
      "text": "Sharp looking set (no pun intended)! They pair nicely with our slate cheese boards.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "They are beautiful knives and look great when serving cheese",
      "text": "My husband has been wanting cheese knives so I bought these for him for Christmas. They are beautiful knives and look great when serving cheese.",
      "rating": 5.0,
      "verified": true,
      "author": "Janie C",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "loved it so much I bought it twice",
      "text": "I’ve actually ordered this item twice, both times for my mom! She loves charcuterie boards and one of her friends actually stole some of the knives cause she loved them so much so I had to buy a second set! They’re awesome, look amazing on the table and they’re great for the amount of money you spend!",
      "rating": 5.0,
      "verified": true,
      "author": "Gina Marinelli",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Good Buy",
      "text": "As this was ordered as a gift I have not experienced using it, but it is a handsome package and the quality seems excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "BD",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "VERY ATTRACTIVE!",
      "text": "Just got them and haven't used them yet - BUT - these knives are very attractive and look expensively made. I'll initiate them during Christmas entertaining. Love cheese appetizers!",
      "rating": 5.0,
      "verified": true,
      "author": "edrn",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Stainless steel",
      "text": "Great stainless steel. Easy to hold and use. Very sharp. Goes well with casual elegance",
      "rating": 5.0,
      "verified": true,
      "author": "Edward b",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Nice looking cheese knife set",
      "text": "I ordered these as a Christmas gift for my daughter, who wanted a set of cheese knives. While I haven't used them, they look great! They arrived on time and as described.",
      "rating": 5.0,
      "verified": true,
      "author": "W. E. Mckinney",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "good quality but missing pieces",
      "text": "when my packages arrived it was missing one of the items so i only received 5 not 6 cutting tools.",
      "rating": 2.0,
      "verified": true,
      "author": "Kali Piorro",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Perfect for entertaining guests",
      "text": "This product is exactly as described. It has a variety of useful cheese cutting and serving tools. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary L.",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "If you love cheeses this knife set is for you",
      "text": "If you love cheeses this knife set is for you. They are really classy and nice. They were a great present for someone.",
      "rating": 5.0,
      "verified": true,
      "author": "Teacher Climbing High",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Nice set",
      "text": "This is a great set. Purchased for a wedding gift and they loved it. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Smith",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Very happy, nice set",
      "text": "Very nice set - feels good (weight) in the hand, feels very fancy! I wish there was an option for a nice knife block or holder option to go with these.",
      "rating": 4.0,
      "verified": true,
      "author": "FaithFam",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Four Stars",
      "text": "great sit, they have worked well, now just need a cheese board",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda Duffy",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Best cheese knife set EVER!",
      "text": "Perfect cheese knife set. It has everything you need for serving all types of cheese, it looks very nice and has excellent quality. 100% satisfied with this purchase. Can’t wait to buy this item again as gifts for my family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Stanford",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Looks & feels nice",
      "text": "These are a classy looking set and I purchased them to use at my nieces wedding in November.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Five Stars",
      "text": "Amazing cheese knife set! High quality stainless steel. Absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. H. Hannen",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Great buy",
      "text": "Many compliments and food looking. They work pretty good and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Four Stars",
      "text": "Very good look and quality. Though one knife got some rusty stains in the dishwasher",
      "rating": 4.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Beautiful and very nicely packaged",
      "text": "These cheese knives are fantastic. They're beautiful and came very nicely packaged. I think they're great value so my partner and I were thinking of ordering more as gifts (would be great for house warming, hostess gift, secret santa, etc.) Looks a lot more expensive than they are. They go great with our marble and chalk cheese boards.",
      "rating": 5.0,
      "verified": true,
      "author": "JBL",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "This set looks more expensive than it is",
      "text": "These cheese knives look impressively sturdy and are nicely designed. The stainless steel goes well with any kind of cheese board and they feel nice in the hand. Overall a great value: I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "kkm129",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Exceptionally diverse set!",
      "text": "What a wonderful set! It is aesthetically beautiful, functional and durable. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Swift Pen",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Nice packaging. Good purchase",
      "text": "Much more Impressive set than the Freehawk 4 piece set",
      "rating": 5.0,
      "verified": true,
      "author": "discoduck",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "These knives made our party!!",
      "text": "Nice set of cheese knives. Lots of compliments. The handles fit nicely and are hefty in your hand without being too heavy. Ordered a second set already.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Cantu",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Just what I needed",
      "text": "I've been looking for an inexpensive cheese knife set that looks good and is highly functional. This arrived and fits the bill perfectly. I've already begun to use them. They have good weight and cut well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer ",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "6 piece cheese knife set",
      "text": "Bought this for my daughter for Christmas and she used them that day. Very good quality",
      "rating": 5.0,
      "verified": true,
      "author": "Chef T",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Quality set",
      "text": "I bought this product for a charcuterie board that I was putting together for a party. It offered a variety of uses and was very pretty. The set is sturdy and my friends commented on how nice they looked.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyk",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "These are a really nice, high quality set",
      "text": "These are a really nice, high quality set. Packaged nicely. These would make a great hostess gift .",
      "rating": 5.0,
      "verified": true,
      "author": "merle swan",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Very sturdy.",
      "text": "I have broken so many cheese knives over the years, until I found these. Great purchase and price.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "impressive",
      "text": "this was a gift for a friend. I was pleased with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia R Allen",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "I love the weight of these knives and the handles are ...",
      "text": "I love the weight of these knives and the handles are perfect. I don't think they're too small; they're for cheese. What do you expect?",
      "rating": 5.0,
      "verified": true,
      "author": "minseven",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Nice finish and design, poor quality",
      "text": "Nice design and finish, but quality turned out to be poor and not stainless steel as marketed. All 6 knifes rusted after the first use despite hand washing and drying them with extra care. Not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "ghays moujaes",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Excellent cheese knife set",
      "text": "Great set! Has every kind of blade you need for a variety of cheeses.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy P",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Quality set.  Great price.",
      "text": "I haven’t used the knives yet, so I can’t speak to their durability but they look great and arrived very quickly. Also much better priced than sets I saw in stores!",
      "rating": 5.0,
      "verified": true,
      "author": "NCMOM",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Fantastic",
      "text": "This was a gift for my Chef daughter, who is very particular. She was thrilled to get this and was amazed at the quality. Said she would get a lot of use with them.",
      "rating": 5.0,
      "verified": true,
      "author": "crystal k. martine",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Great set!",
      "text": "Great set to cover everything. Also, includes a descriptive guide on how to use them, which was very helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle B",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great buy!",
      "text": "Gorgeous and work great. I’ve used them for 3 parties already and everyone loves them. Solid and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Smith",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "... set is very high quality and well design and fine looking. It's a great chess knife set that ...",
      "text": "The Cheese Knife set is very high quality and well design and fine looking. It's a great chess knife set that I have ever purchased. It is great for gift as well for self use. I'm so happy to get such nice product from your company.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Hayama",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Handles are short",
      "text": "Attractive & hard cheese knife is sharp, but handles are quite short -- might be fine for small hands",
      "rating": 3.0,
      "verified": true,
      "author": "Pliny",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great quality for the price",
      "text": "I purchased this set for A gift. I was more than impressed with the packaging, the quality of the cheese knives and the price. Perfect gift would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "LIsa",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Very atteactive",
      "text": "Gave this as a gift to a cheese fanatic... they love it... very attractive on a cheese board...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Makes a great gift",
      "text": "Bought this as a gift. Exceeded expectations - a great set of knives with good design and excellent quality",
      "rating": 5.0,
      "verified": true,
      "author": "J. Tonkiss",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "but we looked at them and they seem very good. Thankb you for caring",
      "text": "Our daughter asked for your knives for her birthday. She has not received them.yet, but we looked at them and they seem very good. Thankb you for caring. K. Murray",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen H. Murray",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Great gift",
      "text": "It was given as a gift and they like it",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Sharp",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Professional look and handling.",
      "text": "I love the weight of the handle in my hand. The look of the knives is very professional. These knives are a perfect compliment to my charcuterie board.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn L. Schell",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "No box. Weird photo inside.",
      "text": "The picture shows exactly how my set came in. No box... just a styrofoam padding with this weird photo of a man’s messed up teeth. Wtf? Not sure what that has to do with cheese knives...?",
      "rating": 2.0,
      "verified": true,
      "author": "Christina M.",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Five Stars",
      "text": "For my daughter for Christmas. Beautfiul, perfectly sized for cheese plates galore!",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "A sturdy, practical & lovely set",
      "text": "It is a beautiful set. Would make a lovely gift, so much that I decided to keep it for myself. But it’s packaged beautifully which makes it a very nice gift.",
      "rating": 5.0,
      "verified": true,
      "author": "catherine wilkinson",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "lovely presentaton",
      "text": "I got two of these as Christmas gifts. They seem strong sturdy, and attractively packged",
      "rating": 5.0,
      "verified": true,
      "author": "sandra c olson",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Great housewarming gift!",
      "text": "Speedy delivery and the product is in a sturdy decorative box.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Great quality",
      "text": "Gift for my chef - he loves them! Sharp, work well, and look great on the board.",
      "rating": 5.0,
      "verified": true,
      "author": "Chels",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Christmas gift",
      "text": "This is a Christmas gift for someone. So I can’t give an opinion",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "EXCELLENT SET",
      "text": "This is a lovely set - can't wait to use. Got 2, giving one to my bestie!",
      "rating": 5.0,
      "verified": true,
      "author": "Anamarie M. Maltzman",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Happy with this set",
      "text": "Nice set. The knives are nice and sharp, and the set looks great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Hebard",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "nice gift",
      "text": "will make a nice gift, just what I wanted the to do",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Schuman",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Great knives!",
      "text": "These knives are amazing! For this price the value is incredible. This was exactly what we were looking for and we will be using these for all of our parties.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryant Hawthorne",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Quality cheese knife set",
      "text": "Simple, clean, quality product. Very happy and would recommend them",
      "rating": 5.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Perfect",
      "text": "This set is exactly what I was looking for. Very good quality and everything you need for a perfect cheeseboard.",
      "rating": 5.0,
      "verified": true,
      "author": "Joni",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "The seller sends a great follow message with cheese tips and information on the ...",
      "text": "These are extremely high quality and well balanced. The seller sends a great follow message with cheese tips and information on the product too! These are great for entertaining!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Five Stars",
      "text": "Got this for my wife for Christmas and she loved the set.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Estrada",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Wonderful Set!",
      "text": "Really Nice and very well made! So glad I ordered these! Can't wait to host a cheese party❣️",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie Burnside",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "High quality!",
      "text": "Excellent quality set, with nice packaging. Very happy with the purchase, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley C.",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Great for anyone who loves cheese.",
      "text": "The knives are well madr. The company enclosed a leaflet showing which knives worked best for different cheeses. Having several knives means I can have a different knives for each cheese on the board.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine E. Armiger",
      "helpful_votes": 4,
      "publication_date": 20191205
    },
    {
      "title": "Perfect for entertaining!",
      "text": "When I entertain, I always include a charcuterie/cheese board. I've always wanted a cheese knife set like this, and I finally got it for Christmas. I absolutely love it! I really like the fact that I can put out specific knives for certain cheeses, and people don't have to cross contaminate. Every entertainer who puts together cheese boards, should have this set!",
      "rating": 5.0,
      "verified": true,
      "author": "Bella12",
      "helpful_votes": 2,
      "publication_date": 20180309
    },
    {
      "title": "They rust quickly.",
      "text": "This is a cute knife set which should fit your needs for presentation and function however, they rust. I used my set quickly after getting them, hand washed them and I had rust spots on them. I’ve tried scrubbing the spots out and scraping them with my nail but I’m going to have to research a more aggressive way to get the rust spots out.",
      "rating": 1.0,
      "verified": true,
      "author": "Beba217",
      "helpful_votes": 2,
      "publication_date": 20181214
    },
    {
      "title": "Super classy set",
      "text": "Super classy set! It was purchased to replace expensive cheese knives that had handles that broke off. This looks really expensive and is really high quality. A must-have for anyone that entertains.",
      "rating": 5.0,
      "verified": true,
      "author": "Jezebel Marx",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Great buy!",
      "text": "I absolutely love this set. I frequently have a large cheese tray at parties but have not had the right utensils to make it easy for guests. This set solves the problem. Love the weight of the knives. They look more elegant than the cost would indicate. Totally satisfied with the purchase and will likely purchase a second set.",
      "rating": 5.0,
      "verified": true,
      "author": "ER",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "These are very well made and look great. So far I have used them on Brie",
      "text": "These are very well made and look great. So far I have used them on Brie, Gjetost and Cheddar. All that cheese sucessfully got in my mouth. I had a few friends over today and they all commented on how nice these knives were.",
      "rating": 5.0,
      "verified": true,
      "author": "Britni Alexander",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Beautiful set!!",
      "text": "Okay wow. First of all, this feels and looks way more expensive than the actual price point. The packaging is simple and sleek, which is true for the knives themselves as well. I love the modern design of this knife set, looks like something I picked up at an art gallery gift shop. Super fancy. I bought this for myself, but I'm going to order a few more. I think they make great housewarming or host/ess gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "Eva Tsang",
      "helpful_votes": 11,
      "publication_date": 20161206
    },
    {
      "title": "This is an amazing set.",
      "text": "I have been in a Cheese Board kick this year and delighting in presenting a variety of yummy and interesting cheeses paired with nuts, fruit, and crackers and toasts. I did not have any quality cheese knives or spreaders. I read the positive reviews and saw the pictures of this Lunar 6 piece set and was sold! I even paid overnight shipping so it would be here in time for Thanksgiving. This is an amazing set.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Cauley",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Look and work awesome. The only thing I don't like",
      "text": "Look and work awesome. The only thing I don't like: I cannot bring myself to store them in original case because there is no way to wash/sanitize it. Soi store them just in plain plastic bag :( wish there was a case or small wooden block to 'showcase' them.",
      "rating": 4.0,
      "verified": true,
      "author": "OlgaVlady",
      "helpful_votes": 2,
      "publication_date": 20170211
    },
    {
      "title": "He loved it!",
      "text": "Bought for my son to go with the cheese board I bought he and his fiancé for Christmas! He loved it!! It is very nice! Will order again in the future to give for wedding gifts! Great service!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanie S Robbins",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Beautiful and well made",
      "text": "I needed a good cheese knife set and liked the looks and ratings of this one. I ordered a second set for a friend for Christmas at the same time, and am so glad I did (so is she!). These are so nicely made and cut through any cheese I've tried. I'm very, very happy with this set!",
      "rating": 5.0,
      "verified": true,
      "author": "Barefootmom",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Great Cheese Plate Set for Parties",
      "text": "Great cheese plate set. Very nice presentation. Sturdy and works well with all types of cheese. I hand wash and dry so they stay nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great Cheese Knife Set",
      "text": "Love the feel and looks of the cheese knife set. Having an insert that describes which knife or spreader is best for a specific cheese, was extremely helpful. Would definitely buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "JoAnn",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Go buy now, totally worth it!",
      "text": "Such an awesome set of cheese knives! Can't wait to use them!!! Great price, great long King... A must buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "MelG",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "This is the one!",
      "text": "There's so many to choose from, right? Well this is it... gorgeously packaged and the highest quality... you'll feel it as soon as you take one out of the box. We couldn't have been happier with this purchase - thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Goings",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Sometimes knives will be heavy at the handle and fall off the serving tray easily but these will not",
      "text": "I ordered the knives for when I entertain. They are small and will fit well on a cheese board or tray. They are light weight which is something I was looking for when I purchased the knives. Sometimes knives will be heavy at the handle and fall off the serving tray easily but these will not. I would recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd E. Brown",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Spotty after washing but okay",
      "text": "Rusted and spotty after washing. But look good and are good value.",
      "rating": 4.0,
      "verified": true,
      "author": "Cat girl",
      "helpful_votes": 0,
      "publication_date": 20180714
    }
  ],
  "product_meta": {
    "title": "LUNAR Premium 6-Piece Cheese Knife Set - Complete Stainless Steel Cheese Knives Collection (Gift-Ready)",
    "rating": 4.8,
    "feature_bullets": [
      "▶ COMPLETE 6-PIECE COLLECTION: This full Cheese Knife Set includes 4 cheese knives, 1 cheese fork and 1 cheese spreader and is everything you need to serve all of your favorite cheeses.",
      "▶ IMPRESS YOUR GUESTS: Show off your beautiful set of stainless steel cheese knives at your next wine-tasting, potluck or backyard BBQ. They’ll be the new crowd favorites for any gathering.",
      "▶ PERFECT GIFT FOR ANY OCCASION: Who doesn’t love cheese? The LUNAR Cheese Knives comes delivered to your door in our elegantly designed box – packaged and ready for a wedding, bridal shower, housewarming or a just-because present!",
      "▶ PREMIUM FEEL AND SLEEK DESIGN: From the blade to the brushed handle, each knife in this set is crafted entirely from high-quality stainless steel.",
      "▶ EASY-TO-USE FOR EVERYONE: Whether you’re a cheese expert or an all-round foodie, the solid and ergonomic design allows for a balanced and confident edge for slicing, spreading and serving soft and hard cheeses."
    ],
    "specifications": {
      "Product Dimensions": "10.51 x 6.5 x 1.18 inches",
      "Item Weight": "15.2 ounces",
      "Manufacturer": "ICOSA Living",
      "ASIN": "B01HS7MW0I",
      "Item model number": "LUNAR",
      "Customer Reviews": "4.8 out of 5 stars382 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#11,378 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 11, 2016"
    },
    "categories": [
      "Cheese Knives",
      "Home & Kitchen",
      "Specialty Knives",
      "Cutlery & Knife Accessories",
      "Kitchen & Dining"
    ],
    "price": 21.37
  }
}