{
  "website_summaries": [
    {
      "verdict": "This neck pillow has a strap on the back to fit comfortably on your head rest for neck support.",
      "pros": [
        "Very soft material",
        "Elastic strap stays secure and makes pillows easy to place",
        "Ergonomic style helps support the neck well",
        "Good quality",
        "Comes as a 2 pack of pillows",
        "Arrives quickly",
        "Several styles"
      ],
      "cons": [
        "These pillows all have some kind of cartoon or kid-ish drawing on them"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great quality but was too small for my car seat",
      "text": "Such a cute neck support for a car. Extremely soft and I am sure for many cars it would be perfect for support. I have a BMW X5 and it was just too small I guess for that car seat. If it had been bigger it would have been perfect for me. I wish I could give it 5 stars because I am sure it works well for many car seats, however it did not work for mine.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon O",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Gave as aGift",
      "text": "I sent this to a friend as a gift, but she had a hard time fitting them to her car. But now she uses as display pillows in the living room so anyone can use it as a comfort pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "sigmond",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Comfy and quality",
      "text": "These are so fun to have and yes they are comfortable ! Love them so much ! Great quality as well:)!",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Hai",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Kind of small",
      "text": "Smaller than other neck pillows I got. But it works",
      "rating": 4.0,
      "verified": true,
      "author": "Rawr",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "they look good",
      "text": "They are comfortable for the neck, good quality, they are not uncomfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Damwx77",
      "helpful_votes": 2,
      "publication_date": 20180310
    },
    {
      "title": "Snoopy NExk Support Great Product & Comfortable!",
      "text": "Very comfortable in the car! I have received many compliments about the comfort. And they look great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Speedreader",
      "helpful_votes": 2,
      "publication_date": 20170324
    },
    {
      "title": "Totally worth it.",
      "text": "They are comfortable and look so cute! I love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Roxy",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Great product",
      "text": "Very fast shipping, and the item cam from China, the product is great quality, I am satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "EcuaBSC",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Super cute pillows I needed something for the traffic",
      "text": "Super cute pillows I needed something for the traffic. Not sure if its really worth 20$ I've seen cheaper options, smaller than I expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Karina Toscano",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable for those times when you have a bit of neck fatigue! Adjust to any height.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "Good Headset!",
      "text": "Good quality and Lovely Garfield but i will give 5 if the size could be 25% larger than now ~",
      "rating": 4.0,
      "verified": true,
      "author": "Bo Gu",
      "helpful_votes": 0,
      "publication_date": 20161220
    }
  ],
  "product_meta": {
    "title": "Tianmei 2PCS JFM Cartoon Styling Car Headrest Protect Neck Pillow Cute Fashion Travel Rest Pillow Cushion Pad (JFM - Gray Color 1 Pair)",
    "description": "Color:JFM - Gray Color 1 PairNeck Pillow was created to give you support and maintain your proper posture. Soft and lovely is decorated, in the protection of cars at the same time add beauty to the car. Applicable to a variety of models. Adopt super soft velvet fabrics, exquisite workmanship, soft and delicate, excellent durability. Use the popular design much favor protection cover, protection and decoration inside the car accessories, easy to install. Easy to clean, do not fade, do not shrink, do not fall off.",
    "rating": 4.5,
    "feature_bullets": [
      "Neck Pillow was created to give you support and maintain your proper posture.",
      "Soft and lovely is decorated, in the protection of cars at the same time add beauty to the car. Applicable to a variety of models.",
      "Adopt super soft velvet fabrics, exquisite workmanship, soft and delicate, excellent durability.",
      "Use the popular design much favor protection cover, protection and decoration inside the car accessories, easy to install.",
      "Easy to clean, do not fade, do not shrink, do not fall off."
    ],
    "specifications": {
      "Manufacturer": "Generic",
      "Brand": "Tianmei",
      "Model": "Generic",
      "Item Weight": "10.4 ounces",
      "Product Dimensions": "10.24 x 6.3 x 3.54 inches",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "Generic",
      "Folding": "No",
      "ASIN": "B01HJJMVN8",
      "Customer Reviews": "4.5 out of 5 stars51 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#31,041 in Automotive",
      "Date First Available": "June 25, 2016"
    },
    "categories": [
      "Accessories",
      "Interior Accessories",
      "Automotive Parts & Accessories",
      "Seat Covers & Accessories",
      "Automotive"
    ],
    "price": 20.99
  }
}