{
  "website_summaries": [
    {
      "verdict": "A mixer collectors will love, this Coca-Cola red machine is a memory maker.",
      "pros": [
        "Strong reviews for ease of use",
        "Kid-friendly design",
        "Machine is fun for adults who are nostalgic for the iconic brand",
        "2-speed mixer with 65W motor"
      ],
      "cons": [
        "Not as sophisticated as similar products"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product for home use.",
      "text": "What can I say. I bought it and then ate 1.2 gallons of ice cream that week. Had my neighbor over for a shake too! Gained 5 lbs and put it away for now. Except I took it out yesterday and made a fluffy omelet. Much healthier.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Carignan",
      "helpful_votes": 27,
      "publication_date": 20190526
    },
    {
      "title": "Love it.",
      "text": "Don't know how we made it this long without this. It gets used every night.My13 yr. Old loves out. He makes shakes,pancake mix, scrambled eggs mix,and malts.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne Scroghins",
      "helpful_votes": 9,
      "publication_date": 20190217
    },
    {
      "title": "Worth it!",
      "text": "Definitely worth it! I make like 3 milkshakes daily and it works great for how cheap it was. Easy to clean too",
      "rating": 5.0,
      "verified": true,
      "author": "Logan Forsyth",
      "helpful_votes": 8,
      "publication_date": 20181124
    },
    {
      "title": "It arrived broke!! Garbage.",
      "text": "Just opened it up as it was a gift. The return window is closed. It arrived with a broken switch that the metal cup clips into to start the blender. Little spring, plastic part and the piece it goes into is cracked and it won’t stay in. The item is useless. Not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "General Woody ",
      "helpful_votes": 3,
      "publication_date": 20200223
    },
    {
      "title": "poor construction",
      "text": "mixing wheel is smooth instead or serrated. doesn't mix even soft ice cream well",
      "rating": 2.0,
      "verified": true,
      "author": "Frito1955",
      "helpful_votes": 5,
      "publication_date": 20181201
    },
    {
      "title": "Nice little machine",
      "text": "It’s a nice little machine for what I use it for I got it to mix my husband’s flurry ice cream that he likes with candy and such and it does a pretty good job for such a little thing",
      "rating": 4.0,
      "verified": true,
      "author": "shirley",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Motor issues",
      "text": "Speed 1 sounds like the loudest grinding I have ever heard! It doesn’t do anything for milkshakes. Speed two started making the same grinding noise, Super disappointed. It’s being returned. Had high hopes",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Acceptable",
      "text": "Based on the price and comments i think is acceptable, is not for doing milkshakes for your whole family is a quick little machine for a couple of milkshakes sometimes. If you want something for daily use or 3 times per week this is not to you- if you want to do a couple of milkshakes some Saturdays this is pretty ok",
      "rating": 4.0,
      "verified": true,
      "author": "Yole",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Best mixer I have used in a long time no lumps or bumps and when I fix",
      "text": "I love Coca-Cola items to decorate my kitchen with in the blender is just perfect it fits right in",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M. Logan",
      "helpful_votes": 3,
      "publication_date": 20190403
    },
    {
      "title": "Not worth the money",
      "text": "We have used this 7 times and it broke . Do not waste your money if you are using this for shakes .",
      "rating": 1.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "not good",
      "text": "It does not work very well and the cup holder broke on the 1st day. It will not mix up anything. The shakes were thin.",
      "rating": 1.0,
      "verified": true,
      "author": "Leona Davis",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Birthday present",
      "text": "This was a birthday present for my Dad . He is a Coca-Cola collector . Overall looks are great . Product is hard plastic and lite weight . The mixing blade is not removable which makes cleaning an issues . That is the only problem with it . Bit pricey for what it is .",
      "rating": 4.0,
      "verified": true,
      "author": "Rchan",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Very unhappy",
      "text": "I would have given this 5 stars all around because I'm an avid Coca-Cola Collector, butwhen I finally decided that I would go ahead and see if it was a working Milkshake maker I found the thing inoperative. And now I'm out my money, my collection piece and I now have a milkshake machine that dont work. So I'm giving yall half star rating",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Barrows",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "surprisingly quick and easy to use.",
      "text": "Had no real expectations of the machine. I primarily bought it for decoration. Needed up actually using it at the party and it was a hit. It made shake quickly and perfectly. My 18 year old was able to whip up shakes for everybody at the party in no time. It was pretty easy to clean as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tezhina N. Actkins-Farris",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Milkshakes for everyone",
      "text": "Got this for my son for Christmas. He loved that it gave him instructions on how to make milkshakes. He made some for us that night. Very easy to clean up.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Burton",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Kids love milk shakes",
      "text": "Kids love making milk shakes - this is for milk and ice cream not ICE if your wanting it to chop ice, dont bother use your blender, it's not for smoothies or icies but for milk shakes it's great",
      "rating": 4.0,
      "verified": true,
      "author": "Mary L. Weber",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great Deal Here!",
      "text": "With a low price, I didn't expect much, but this mixer outperforms anything in the hundreds of dollars range! When it was delivered, we immediately washed out the cup, and used it! It worked perfectly. We love it. I'd for sure buy from this seller again! Very fast shipping also!",
      "rating": 5.0,
      "verified": true,
      "author": "Terry E. Henning",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Attractive  and powerful",
      "text": "As soon as it came I made a shake it works wonderfully! Great addition to my other cc collector items.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith Thompson",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Easy to use",
      "text": "Very simple to use, but you do have to remove the cup and stir it a few times if you're working with very cold ice cream. Your hands also get very cold while doing this. Don't be afraid to let it sit on its own for a bit, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Breanna",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Easy to use and fun",
      "text": "It works great! Reminds me of the milkshakes that my grandmother use to make when I was younger.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Not worth it",
      "text": "Not worth it- very low power motor, did not mix the milkshakes well at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Justine Beck",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Make A Shake 123",
      "text": "Making great milkshakes is easy with this nifty little maker. With two speeds, you can customize your shakes thickness. It's easy to clean and doesn't take up much room on the counter. Highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Will Stape",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Sucks",
      "text": "It sucks!! It does not mix the ice cream into a milkshake at all",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Not impressed",
      "text": "Honestly not impressed I expected more first it Emits a bad plastic Odor when in use and no matter how much ice cream you put just can’t get it thick real disappointing will be returning",
      "rating": 1.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "I wouldn't recommend unless you just want to see that coke name",
      "text": "Too many spilled and splattered messes in my kitchen. The cup won't stay in that little slot at the bottom.",
      "rating": 3.0,
      "verified": true,
      "author": "Navy",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Compact, lightweight and very durable milkshake maker.",
      "text": "My husband absolutely loves this item. He has been experimenting with different items in his milkshakes.",
      "rating": 5.0,
      "verified": true,
      "author": "mich",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great",
      "text": "Great for household use. I do not think it will take commercial work as the head heats up really fast. I have been using it for weeks now, almost every day, and no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lynn",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Cute, affordable and well liked",
      "text": "Bought as a Christmas gift for my adult son. My other 2 children were jealous so I guess I'll be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Marginally functional",
      "text": "This little machine looks great. Unfortunately, it doesn't work very well. The mixing head is most ineffective. Tried to do a milkshake but it wasn't up to it. Cannot recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "MICHAEL RANDALL",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Not worth it",
      "text": "Did go to bottom of metal cup to mix didn't mix milk and ice together",
      "rating": 2.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "I would like to have refund but there charging me for the shipping",
      "text": "It dosn’t do anything not worth a penny it’s like a toy",
      "rating": 1.0,
      "verified": true,
      "author": "tilma minas",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "I work at a icecream place. I am very satisfied.",
      "text": "The price was set right. And it works well. Be careful with it though all milkshake machines can overheat.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie Flowers",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Poor",
      "text": "I like the the design but it's poor quality Three stars for design",
      "rating": 3.0,
      "verified": true,
      "author": "Muhanna Alrawahi",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Completely ineffective device",
      "text": "This is a toy! Cannot find an effective process to make a milkshake",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170619
    },
    {
      "title": "Complete garbage. It didn't last 48 hours",
      "text": "Complete garbage. It didn't last 48 hours. The blade speed is not fast enough to mix the shake so it needed to be watered down. The blade itself cannot be removed making it difficult to clean.",
      "rating": 1.0,
      "verified": true,
      "author": "Love God Baby",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Junk",
      "text": "Its a piece of junk. Dont waste your money. Absolutely worthless.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Gall",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "don't waste your money",
      "text": "Nothing \"nostalgic \" about this item....don't waste your money. Not only is it completely made of cheap plastic (except for the cup) it's not powerful enough to mix the ice cream- even on the second speed. I would not have even given it one star if I didn't have to.",
      "rating": 1.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 4,
      "publication_date": 20170804
    },
    {
      "title": "Broke Quickly",
      "text": "When it worked, this little milkshake blender was great. We had it for only two weeks before the little blending piece (round circular metal piece) sheared off. We made maybe 6 total milkshakes. I bought it because the reviews were decent for the price and we were hoping for something to help lighten the mood, the kids had been begging for shakes for weeks. So needless to say, they were extremely disappointed when it broke after only a few uses. The motor still works fine, but we can't blend anything without the blending piece.",
      "rating": 2.0,
      "verified": true,
      "author": "Brianna Jennifer Hawkins",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Love the milkshakes",
      "text": "convienent and easy and I need something to help me gain weight very helpful and my kids and grandkids love the milkshakes too",
      "rating": 5.0,
      "verified": true,
      "author": "marrialee s.",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "perfect for movie now night",
      "text": "this looks so cute in my ted and white kitchen. Great little extra for movie night",
      "rating": 5.0,
      "verified": true,
      "author": "tami adams",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Motor is not strong enough and the mixing blade is ...",
      "text": "Motor is not strong enough and the mixing blade is small. Very hard for the blade to get through and mix the ice cream with the milk",
      "rating": 1.0,
      "verified": true,
      "author": "jack momeyer",
      "helpful_votes": 3,
      "publication_date": 20170829
    },
    {
      "title": "Excellent",
      "text": "Very nice. Good for the price. It’s good for shakes and floats.",
      "rating": 5.0,
      "verified": true,
      "author": "Tinkerbell",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Two Stars",
      "text": "Cute for decoration... the watts are so low on this it takes forever to make a milkshake!",
      "rating": 2.0,
      "verified": true,
      "author": "LaShella Carroll",
      "helpful_votes": 3,
      "publication_date": 20180331
    },
    {
      "title": "Fun, consistently good shakes",
      "text": "Works perfect for what it says- it makes great shakes.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Celis",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "very impressed",
      "text": "this little shake machine is perfect for my husband and I. works great",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Does not work very well",
      "text": "Looks good but did not work like it should taking forever to make a shake not impressed at all",
      "rating": 3.0,
      "verified": true,
      "author": "STEVE BELLINGER",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Love",
      "text": "Always wanted to make my own milkshakes. Now I can. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Meter",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "The look is great, just my expectation was higher for this product",
      "text": "The look is great, just my expectation was higher for this product, since it doesn't shake the ice cream all to well, even though it has two speeds. Still wonder if because it was new the motor is supposed to smell a little burned while being used.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexander Lopez",
      "helpful_votes": 2,
      "publication_date": 20170426
    }
  ],
  "product_meta": {
    "title": "Nostalgia Two-Speed Electric Coca-Cola Limited Edition Milkshake Maker and Drink Mixer, Includes 16-Ounce Stainless Steel Mixing Cup & Rod-Red, 16 oz",
    "description": "Make any Coke collector envious and brings the old time ice cream parlor right into the kitchen. It features a versatile two-speed mixer and 65-watt motor that allows for customizable milkshake thickness. The unit includes a durable stainless steel mixing cup and rod, while the weighted base adds stability.",
    "rating": 4.1,
    "feature_bullets": [
      "RETRO DRINK MAKER: Both fun and easy to use, it brings the old time ice cream parlor right the kitchen - perfect for making milkshakes, malted milks, soda fountain drinks and even health drinks!",
      "POWERFUL MIXER: Equipped with a 100-watt motor, this 2-speed mixer makes it easy to customize your milkshake thickness",
      "MIXING CUP & ROD: Unit is built with a durable 16-ounce stainless steel mixing cup and mixing rod, and has a weighted base for added stability",
      "EASY TO ACCESS & CLEAN: Tilt-back head and detaching spindle makes this easy to clean and easy to access",
      "VERSATILE: Does more than just make drinks! You can also use mixer to make pancake or waffle batters or beat eggs for delicious omelets",
      "Included Components: Milkshake Maker",
      "Mixing Cup"
    ],
    "specifications": {
      "Product Dimensions": "5.25 x 6.25 x 14 inches",
      "Item Weight": "2.35 pounds",
      "Manufacturer": "Nostalgia",
      "ASIN": "B01H1UXEPO",
      "Item model number": "MLKS100COKE",
      "Customer Reviews": "4.1 out of 5 stars287 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#11,766 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 14, 2016"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Countertop Blenders",
      "Blenders",
      "Kitchen & Dining"
    ],
    "price": 28.11
  }
}