{
  "website_summaries": [
    {
      "verdict": "Includes all the hardware you need for quick installation, and it will run maintenance-free all winter.",
      "pros": [
        "Made of weather-safe materials that can withstand all temperatures",
        "Offered in lengths of 20 feet to 200 feet",
        "Price is reasonable per foot for longer lengths",
        "Works with metal or plastic gutters and downspouts"
      ],
      "cons": [
        "Only works with asphalt shingles",
        "Not safe to use with slate, stone, or metal roofs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome results",
      "text": "Great product. Maintains a constant temperature the entire length of cable. I would guess 60 degrees or so. More than enough to melt. The installation kit sent with the cable was self explanatory and effective. My NE facing valley and gutter, which sees no sun for months, is now free and clear of ice and snow. Maybe the unhappy consumers forgot to power the cable or were expecting instant results. It is possible that they don't understand how the product is supposed to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 22,
      "publication_date": 20170125
    },
    {
      "title": "Seems to be working",
      "text": "This is the first time using this type of product and it seems to be working well. We got a lot of snow so far this year and you can see where it is melting it off the roof. It isn't real hot so it takes a while to melt through thick snow in which it keeps the ice build up to a minimum. But all in all it's doing it's job. I will buy a longer cable next time. It doesn't reach as far as you think it will due to the wavy pattern that it must be laid.",
      "rating": 5.0,
      "verified": true,
      "author": "pegasus9000",
      "helpful_votes": 10,
      "publication_date": 20180115
    },
    {
      "title": "Highly Recommended",
      "text": "Mother nature dumped a lot of snow around the Boise area this winter and it created lots of issues. A ice damn was starting to develop on my roof that caused concerns. Once I installed this product, the ice damn was no longer an issue. Great product. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Reed",
      "helpful_votes": 15,
      "publication_date": 20170309
    },
    {
      "title": "So far, so good",
      "text": "Delivery on time, as expected with Prime. Installation was easy, as I was replacing a cable of the same length, so I could use the same path and clips. I like the fact that this cable has a plug that blows when it is on so I know that it is functioning properly. It will be a while before I can comment on reliabikity, however. I average over 15 years in a cable installed on my home in Minnesota, but probably only run the cables less than 10 times a season when my roof and valleys have a concentration of wet, heavy snow and the potential of ice dams increases.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20191010
    },
    {
      "title": "Stopped my ice dams!",
      "text": "Had severe Ice dams, bought these to help stop them. Although we didn't have super heavy snow this year they worked perfectly! I hooked them up to my smart plugs and just tell Alexa to turn on Deicers and both sides of the house come on and keep the snow melted so it wouldn't create the ice dams I have suffered from in the past. Knowing what I know now I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory J Tucknies",
      "helpful_votes": 2,
      "publication_date": 20200209
    },
    {
      "title": "The size was exactly what was needed.",
      "text": "I like the cables as they were easy to install using your instructions. They are now in place and have not shifted as a result of the instructions provided. The place they were used at was my church and the are doing the job very well keeping a down spout and scupper free of ice. They are priced well too. I would recommend these cables to anyone needing to keep ice off their roof or out of gutters and downspouts.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald L. Jones",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "Read the specs very carefully, the picture is deceiving",
      "text": "Picture on the box, included in the item description, shows a slate roof. Item is incompatible with a slate roof. Paying to return something I would not have bought. Item description needs to be updated.",
      "rating": 1.0,
      "verified": true,
      "author": "Mags Dad",
      "helpful_votes": 4,
      "publication_date": 20181001
    },
    {
      "title": "Didn't really work for me.",
      "text": "I bought this to run inside a downspout and drain that likes to freeze up when snow is melting off the roof from the sun but the temperature is still below freezing. I have no idea why this one downspout freezes up, none of my other ones do. I doubled it up and ran it as far down into the drain as I could with about 5 feet of the wire running up the downspout, but it still freezes up. It's strange as the drain works fine in pouring rain and doesn't back up so there's nothing obstructing the flow. I don't get it, but this wasn't the solution for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Ranman",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Fairly easy to install",
      "text": "Just finished installing with thermostat. Can't write a full review because its only Fall. Just make sure you measure so you have enough cable. I did approx 12' of roof in the triangle config. they recommend and put it inside gutter and ran to bottom of downspout. This took all 100'... here's hoping that it will take care of ice dam over my kitchen and the thermostat works....There was more than enough supplied clips for this to.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Dud",
      "text": "Product was as described and arrived in a timely manner. I paid a handyman to install the wires and the timer/sensor which I purchased with it. I was very excited to finally have my ice dam issue solved. Alas, my hopes melted but the ice did not. It didn't work at all. I received a refund. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Tarsh",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Worthless Chinese junk",
      "text": "This cable burned out 2 weeks after it was powered on as my ice dams are building up now. This is the third replacement in 3 years. Absolute junk!!! I'll switch to an American made brand which is 4× the cost but it needs to work and will be more cost effective in the long run.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Easy installation",
      "text": "Easy installation on an aluminum sun room. The included adhesive backed anchors are staying put even though I installed them on a 40 degree day. Surface prep is important. I added a remote wireless outlet so I can use them when needed without going outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Livestock water warmer",
      "text": "I submerge it in a 5 gal live stock water bucket to keep it from freezing. Works great Edit: Doesn’t work great the coiled wire got to hot and started melting. Worries it would short in the water. Threw it away. Probably works great for what it’s intended for... but not for what I used it for",
      "rating": 5.0,
      "verified": true,
      "author": "JJohnst",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Works Great",
      "text": "Seems to be working as advertised. We haven't had a heavy snow since installation but I've noticed the areas covered by the cable are frost free in the morning. The included clips are shiny aluminum(I think) and appear to be covered in some sort of machine oil or light grease. It doesn't affect their function but is a little messy during installation...No big deal. I think this product should solve our roof icing problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Luther",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Worked really well, but not exactly perfectly for me",
      "text": "These worked really well. They will work really well for what they are designed to do. I needed something much more along the lines of the heating mats. I will eventually be buying those when I can afford it.",
      "rating": 5.0,
      "verified": true,
      "author": "Double A-Rod",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Thought they would be warmer.",
      "text": "Plenty of cable to do my roof, I thought the cable would get warmer. We've only had snow once this year, but the cable didn't really do what I expected them to do.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "No Ice Dam",
      "text": "Very useful size... I needed an additional 20 feet to manage part of the gutter subject to getting an ice dam. The kit appears well made, easy enough to install and no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "rickeitt",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "just right to melt ice and snow",
      "text": "because it is a short cable, I am using it to melt the snow that accumulates near the gaz furnace exhaust ..works perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky Luke",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Quality",
      "text": "I actually used this product to keep my gutters ice free. (just laid it in the gutter) Although I got a late start , it seems to be working very well. I also have one that I put in my garage drain which just empties to the outside, it also is working very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Trierweiler",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Do not hesitate",
      "text": "Works great and easy to install. Order longer than you think you need, it goes fast!",
      "rating": 5.0,
      "verified": true,
      "author": "Guy",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Works for my application.",
      "text": "Had it for 2 winters still works. But I'm using it as a under belly heater on a toy hauler. So it is out of the weather .",
      "rating": 5.0,
      "verified": true,
      "author": "Mat",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "So far it is working",
      "text": "Installed as per the directions, No ice dams and it is working as described.",
      "rating": 5.0,
      "verified": true,
      "author": "CHARLES HORSKEN",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Works perfectly",
      "text": "Works so well and very easy to use. Never worried at all last winter about that gutter",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Begam",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Worked like they should",
      "text": "I purchased these for an investment property, mobile home roof that had issues with ice damn on the north side. We have had a mild snow so far and the cables clearly melted the snow around them and helped run the water off the roof.",
      "rating": 5.0,
      "verified": true,
      "author": "John E.",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Ice Free",
      "text": "I strung it within the vertical gutter and it keeps it ice free.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "It works",
      "text": "I used it to keep a ditch open while the ice and snow were melting around my shop so as to not flood it. It worked as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Idaho Camper",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Easy to install and it works",
      "text": "Used it 3 times this winter in my north gutter it stops ice jams.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Raines",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Easy to install.. winter must",
      "text": "Came very quickly. Included all the hardware for an easy but proper install. Has kept my gutter free from ice build up and flowing well so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Gardner",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "mice",
      "text": "in the process of the install.- no snow as of yet, but I will be ready.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Does the job",
      "text": "Purchased this to go around our gazebo to keep the snow and ice from caving in the top...Worked great !",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Friges",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Heater",
      "text": "I needed a heater for an exposed pipe that I could turn on and off manually and not by sensor. I hooked the wire to a timer and it's working great. Exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Used in the green house",
      "text": "The cables were for our green house and they worked as promised.we are very satisfied with them. I can recommend them and I would purchase them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B. Elliott",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Don’t waste your money",
      "text": "Not very good. Did not melt snow or ice. Cable is barely warm. Wouldn’t recommend this brand",
      "rating": 1.0,
      "verified": true,
      "author": "Barman6573",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Really works!",
      "text": "I've used this for 2 winters now and its done it's intended job. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kili19341",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Used for gutters",
      "text": "We like that it is long enough to run the entire front gutter, put some up on the roof valley and run down the downspout.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia S.",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Works good!",
      "text": "Used along a gutter and shingles that dammed up with ice. So far so good. Had to get a thermo controlled outlet so it wasnt on all the time",
      "rating": 5.0,
      "verified": true,
      "author": "R.Dogg",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Heavy Duty Cable ..",
      "text": "Installed in downspout runout under my deck... working quite well at this time.....",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Works well",
      "text": "They were very easy to install and work great although we haven’t had a lot of snow yet, they have worked well on the couple of inches so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Works great",
      "text": "It works great for keeping the ice dams melting away",
      "rating": 5.0,
      "verified": true,
      "author": "JnH Conklin",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "gutter heating cable",
      "text": "Installation was easy, instructions were a bit vague,. Cable is a bit to stiff for looping on roof. Have not used it yet. No Snow or ice to melt. Need power outlet next to drop down.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Worked very well this winter with the bad winter we are having",
      "text": "Worked very well this winter with the bad winter we are having. Melted the ice so we had no leakage as did in previous years.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Winch",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "have really not had to use it yet",
      "text": "I had higher expectations but it does seem to work it has been pretty cold though.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "REPLACEMENT FOR ONE THAT GAVE OUT ON ME AFTER ABOUT ...",
      "text": "REPLACEMENT FOR ONE THAT GAVE OUT ON ME AFTER ABOUT 5 YRS(NOT THIS BRAND) WE WILL SEE IF IT STANDS UP SO FAR SO GOOD",
      "rating": 5.0,
      "verified": true,
      "author": "JAMES L.",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Easy Install",
      "text": "HEATIT roof deicing heating cable. Bought it as a gift to my pen pal in Chicago. He is not a pro but he completed the installation with easy. Instruction is clear. Nice package with metal accessories. He does not need worry his roof in winter anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Yang Zhang",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Easy to install works well",
      "text": "I live in Northwest Montana and we get a crap ton of snow this is my 2nd one and will be buying more . Very easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali Montana",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Good",
      "text": "So far so good. Haven't had any trouble with it and seems to do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Frampton",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Heats up nicely.",
      "text": "My old heater cable had gone bad and the downspout was iced up. Replaced with this one and when plugged in it heated up nicely and should keep the downspout running.",
      "rating": 5.0,
      "verified": true,
      "author": "John O.",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Five Stars",
      "text": "No problem, heated the snow so I could find the lid to my frozen septic tank.",
      "rating": 5.0,
      "verified": true,
      "author": "betty",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Options",
      "text": "I would be nice to have a way to selectively vary/select the temperature out put of the device. Or a temperature sensitive on/ off switch with a selectable feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Verdad",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "good delivery time and good product.",
      "text": "Exactly what I needed. We will see how it works when it snows. Hopefully, it will keep the ice away.",
      "rating": 5.0,
      "verified": true,
      "author": "davidl",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Works Great.",
      "text": "I bought two and they both work great. Ended up buying one more for the other side of the house. Cable warms up quickly to melt ice and snow, and has kept my downspouts from freezing while plugged in. I wish I would have bought them years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Four Stars",
      "text": "I recommend this product it is keeping my gutter open",
      "rating": 4.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great.",
      "text": "I used mine in a drainage tile that would freeze up under my driveway. Worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "howard caton",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Works perfect",
      "text": "Heats up and melts off the ice dam in my gutters.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph R",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Not as good as I expected it to be",
      "text": "It works ok. It can't handle ice build up. Have got just one snow fall ship far and didn't melt the snow as I thought it would. We'll see how it does in the dead of winter",
      "rating": 3.0,
      "verified": true,
      "author": "jerry castaneda",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Well worth the money!",
      "text": "There are plenty of roof/shingle clips and cord spacers. I should have purchased the next longer length.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael E Pfeiffer",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Very durable",
      "text": "This product worked perfect. What I liked was the length of the cord from the heat to the extention cord.",
      "rating": 5.0,
      "verified": true,
      "author": "TERESA MOSES",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "It works!",
      "text": "This cable has been in place for a month now and is working well.",
      "rating": 5.0,
      "verified": true,
      "author": "jk",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great Heater, Doubious Instructions",
      "text": "I liked it because it provided the right amount of heat to keep my gutter and down spout from freezing. The instructions for installation were written by some one who never actually tried to install a unit. There is no way you can install the cable in a down spout with several turns by pulling the cable through. I disassembled the down spout at key points and hand feed it thru to the exit. All the information about centering and doubling back in the gutter is just impossible and not needed.",
      "rating": 4.0,
      "verified": true,
      "author": "GT",
      "helpful_votes": 2,
      "publication_date": 20180129
    },
    {
      "title": "Fast delivery without even asking.",
      "text": "Only olace I found for selling gutter heating cable that works on tile roof homes.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert L McLaughlin",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "DOES NOT WORK!!! DON'T WASTE YOUR MONEY",
      "text": "The product doesnt work at all. Installed in the fall and check gutter from the first snowfall this year. Checked gutter and frozen solid.",
      "rating": 1.0,
      "verified": true,
      "author": "AP ",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Eighty foot gutter heat tape.",
      "text": "It works ok I guess. I'll know more about it after it snows. It does feel good and warm to the touch.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 2,
      "publication_date": 20170817
    },
    {
      "title": "Four Stars",
      "text": "I just wish it put out a few more watts per foot.",
      "rating": 4.0,
      "verified": true,
      "author": "-Seth, Columbia Gorge",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Good product.",
      "text": "It works flawlessly, just wish the metal clips were not as fragile.",
      "rating": 5.0,
      "verified": true,
      "author": "dan pelan",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "It is not effective to melt as i would like to see",
      "text": "I put roof in December and we got some snow during Jan and Feb but I was not impressed with result. it impact on the cord minimially .It is not effective to melt as i would like to see",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Gwynn",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Exchange",
      "text": "Did not heat up from day one. Return date pass before tempureture Drop and had freezing rain. I would like to return for product exchange or refund. Thanks",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Z.",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Just fine",
      "text": "We used these heat cords to replace heat cords in pur 100 ft roof drains on the this 3 story condominum.",
      "rating": 3.0,
      "verified": true,
      "author": "The Alameda Condos",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Doesn’t work",
      "text": "I wish I could give zero stars... first it was about twenty feet short and second it doesn’t even melt anything",
      "rating": 1.0,
      "verified": true,
      "author": "No name",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Melted within few hours",
      "text": "Plugged it in and a few hours later it melted.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "It works",
      "text": "It melted all the ice in our eves this winter!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Rose",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Was this a returned item? I finally got a ...",
      "text": "Was this a returned item? I finally got a warm day to install and when I opened it the cord seems to have been burned.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Grace",
      "helpful_votes": 5,
      "publication_date": 20180202
    },
    {
      "title": "cable seems to be of high quality. Mine was ...",
      "text": "cable seems to be of high quality. Mine was 85 feet 400 watts I checked with a meter it's right at 400 watts. Do not know about the deicing use as that not my use. I trying to keep a garden warm for this use I am not too sure it have enough heat.",
      "rating": 4.0,
      "verified": true,
      "author": "ROBWW@2016",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Great product!",
      "text": "This product has worked great for us. We have had our first snow and ice. It has kept our gutters from freezing and easy to drain out. Great problem solver. Thanks !",
      "rating": 5.0,
      "verified": true,
      "author": "Carla blevins",
      "helpful_votes": 3,
      "publication_date": 20161229
    },
    {
      "title": "Five Stars",
      "text": "the heat wire keeps my gutter from icing up - thanks",
      "rating": 5.0,
      "verified": true,
      "author": "tom ravo",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "Not happy with the heat tape",
      "text": "Not happy with the heat tape. I plunged into electric tester and 2rolls drawls 12.5amps and almost 1300watts put it on the roof and it won't even melt icicles that are hanging on it or snow. Junk!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "...",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Works as advertised. Placed in rain gutter and downspout ...",
      "text": "Works as advertised. Placed in rain gutter and downspout to prevent ice dams. The cable gets warm enough to melt enough ice to give the water a place to drain and prevent it from backing up and forming ice dams. The package didn't come with quite enough spacer clips. For the down spout, the instructions said to use a spacer clip every 6 inches to prevent the cable from touching / crossing over itself. There weren't enough clips and I had to space them 12 inches apart instead.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Port",
      "helpful_votes": 3,
      "publication_date": 20171216
    },
    {
      "title": "Trouble getting the 160ft cable delivered, keep getting wrong one.",
      "text": "The 120ft cable arrived on time and had more than enough clips to install. But I have now ordered the 160 ft cable for the 3rd time. The 1st order delivered a 20ft cable, and the 2nd order delivered a 30ft cable. I hope the order gets it right this time.",
      "rating": 3.0,
      "verified": true,
      "author": "Jim Cooke",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Cannot use with an extension cord.",
      "text": "Cheaply made. Difficult to instal. You cannot use it with an extension cord and need to have an outlet under the overhang up by the roof line which very few people do. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Good Price. Heats well.",
      "text": "Works well so far (I have had it for one month). Heating my gutter. Good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Useless",
      "text": "Used this around the chimney to prevent ice damming. Had it wired by an electrician. Didn't do a thing. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Gage",
      "helpful_votes": 2,
      "publication_date": 20170307
    },
    {
      "title": "Four Stars",
      "text": "So far so good, clearing ice in the gutter over the stairs. Maine winters.",
      "rating": 4.0,
      "verified": true,
      "author": "Jane Senior",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Received as advertised",
      "text": "Received as advertised. Will have to wait till I turn it on when we have ice in the eves.",
      "rating": 5.0,
      "verified": true,
      "author": "Dickiedoo",
      "helpful_votes": 0,
      "publication_date": 20170106
    }
  ],
  "product_meta": {
    "title": "Heat it HIRD 20 feet Roof Gutter De-Icing Cable",
    "rating": 4.5,
    "feature_bullets": [
      "Tough XLPE as inner insulation and weather resistant PVC (high-low temperature) as out jacket. 100% screen rate with the Aluminum foil and tinned copper braid. More safe and more healthy. Three year limited warranty- If you are not completely satisfied with HEATIT heating cable, please don't hesitate to contact us in any time.",
      "Both CSA and ETL approved. 6 ft 18/3 cold lead with plug . Pre-assembled, ready to install, no maintenance required. Easy instruction manual, clips and spacers are included.",
      "Designed to prevent ice build up, known as ice dams, from forming on roofs and in gutters and downspouts. Protect your roof from damage and leaking, keep the water flowing in gutter & downspouts.",
      "Used for Metal or plastic gutters/downspouts, Inclined roofs Roofs with noncombustible shingles (Ex.: asphalt shingles) that meet national building codes. Different lengths are available; Suitable for most roof and gutter configurations.",
      "Testing the cable before the installation.Uncoil the heat cable completely so it does not touch, cross over or overlap on itself. Do not plug in the cable until it has been completely uncoiled. Plug cable in, and in approximately 5 minutes, you should feel slightly warm to the touch. Then unplug the cable."
    ],
    "specifications": {
      "Package Dimensions": "10.5 x 8.5 x 3.1 inches",
      "Item Weight": "1.3 pounds",
      "Manufacturer": "HEATIT",
      "ASIN": "B01HM3BFMY",
      "Item model number": "FBA_6947881514568",
      "Customer Reviews": "4.5 out of 5 stars407 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#27,094 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Snow Removal",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "De-Icers & Salt Spreaders",
      "De-Icing Cables & Mats"
    ],
    "price": 29.99
  }
}