{
  "website_summaries": [
    {
      "verdict": "This teepee has a good height for the price and provides a durable play option.",
      "pros": [
        "Lightweight",
        "Includes a mesh window",
        "Wooden poles",
        "Comes with a carrying bag",
        "Made from a cotton canvas",
        "Does not cost a lot",
        "Raises to about 6 feet tall at center point",
        "Looks good",
        "Decent quality for the price"
      ],
      "cons": [
        "This is not waterproof",
        "It is made for indoor use",
        "You may have to go online to get instructions for putting it up"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Probably would not recommend this",
      "text": "I chose this product based on reviews that I read, but am disappointed in my choice. For one thing, the directions were vague and setup is awkward. But the biggest issue I have is that it tends to fall over or lose its shape. The legs don't stay in one place, they get moved around as my daughter plays, and eventually the entire thing topples over. On the positive side, the canvas does seem to be a strong material and there is a cute little window you can open. All in all I would probably not recommend this product and am currently searching for a playhouse that stays put.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeannine",
      "helpful_votes": 33,
      "publication_date": 20170102
    },
    {
      "title": "DO NOT BUY",
      "text": "This product is great, but turns out that it was shipped with BED BUGS in it. And guess who didn’t realize it till it was too late? Me. There was decal matter all over the tent, and a bed bug also. I had to throw the whole thing away in disgust.",
      "rating": 1.0,
      "verified": true,
      "author": "Karena Mendoza",
      "helpful_votes": 17,
      "publication_date": 20180626
    },
    {
      "title": "It is not white and won't hold shape.",
      "text": "It's sturdy and the canvas is thick. But it is not white. It's a cream canvas. I was wanting a true white one. Deceptive description is why I only gave it two stars. I would have ordered the white and grey one or from a different brand if I knew this one wasn't true white. Edit for 9 months later - this teepee will now not hold shape at all. We've taken it completely apart, retired and adjusted poles and no matter what we do after a few days it looks like the photo included. Don't waste your money. The poles don't sit correctly inside the canvas footings at the bottom so it won't hold.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Smith",
      "helpful_votes": 9,
      "publication_date": 20171225
    },
    {
      "title": "Not sturdy but cute and at a good price.",
      "text": "For the price, it’s an ok teepee. It’s very flimsy, I’m buying a teepee support ball because my son can very easily collapse this tent. Also, my instructions said there would be 1 cord, however I received two much shorter ones. I had to tie them together to be able to weave throughout all four poles. Also, there isn’t much to the instructions, basically pictures, and you’re left to figure it out yourself. However, this tent is very cute, and much larger than I had anticiapated. My son especially loves the window in it. He’s played in it all night, so it’s met it’s desired purposes.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily V.",
      "helpful_votes": 6,
      "publication_date": 20180227
    },
    {
      "title": "nice material makes it sturdy",
      "text": "Really cute TPee, nice material makes it sturdy, off white color, little window is a nice touch. Easy to take down or put up if need be. Pretty roomy, probably 3-4 toddlers comfortably. Or mom, dad (with legs out) and toddler fit fine too. :) Overall for the price would recommend don't over pay from the big box stores!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 3,
      "publication_date": 20180128
    },
    {
      "title": "Amazing tent, great quality",
      "text": "This is our second tent and I LOVE this tent (and so does my 6 year old). It's made of high quality canvas material, has all the right straps & velcro to close & open tent flaps & window cover, and was a breeze to put together. What's more, it stands up using tension, and not poles along the base, so moving it around the house is so easy -- just collapse, carry & pop it back open in the next room. My 6 year old can do it on her own. It's very spacious. And the blue color is a perfect, rich sky blue.",
      "rating": 5.0,
      "verified": true,
      "author": "krausspost",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "The string/shoe lace privided was way to short no matter ...",
      "text": "The string/shoe lace privided was way to short no matter what I did. I had to tie another one to it to make it loop through all of the holes. Otherwise, the teepee is cute and seems to be decent condition.",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 4,
      "publication_date": 20171128
    },
    {
      "title": "Love the idea, but quality is lacking",
      "text": "I purchased this to use for my son's second bday! It is the perfect size to use over a trim mattress on the floor. It really dressed his bed up - since we wanted a floor bed. The problem was more in the durability. The straps you tie to the top of the poles to get the canvas material to stay us - broke rather quickly. The rest of it seems to be ok, but we got rid of it because it wouldn't stay connected to the top of the poles.",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Durable and fun!",
      "text": "My kiddos like this tent a lot. Theres enough room for them to play house, read a book and fit about 3-4 kiddos in it, that are around age 3-5. The canvas is very durable, with poles that are made of solid wood. My only problem was tying the poles together at the top. I wonder if my string was to short. It was an easy fix as you can use any string to go through the holes at one end and then tie them together. Set up took 5 minutes 😊",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Williams",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Would order again",
      "text": "Great quality! Arrived as described and pictured. Only downside is the poles shift inward when being played in for awhile and we have to reposition them outward. We are going to make a big floor cushion to fit inside or order bean bags to put in the back 2 corners to help hold it all in place. It's not so bad that it's going to fall in on the kids but enough that it's noticeable. Would order again even with the shifting poles. The ties were a bit confusing on top and there werent any instructions, so we just did our own thing and tied it all the best we could. Hope this helps!",
      "rating": 5.0,
      "verified": true,
      "author": "Big Show Family",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Do not recommend",
      "text": "Just had a great time putting this together, not. Poles were way too long for the size of the canvas so I could hardly get the string to reach the holes in the poles and the slots in the canvas. Also the poles had slots in the part that attached to the connector that were pointless. Had to stretch the string so much I'm afraid the canvas will probably rip. Would not buy again, tent does no match the picture and the instructions were so way too simple and the pictures in them were clearly for a different tent.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela Marie Ridley",
      "helpful_votes": 3,
      "publication_date": 20170529
    },
    {
      "title": "Measure carefully!!! It’s bigger then expected!",
      "text": "We finally got around to reviewing this. We have had it setup for about 1 month and the kidos love it. The only issue is we need a bigger house for it. The tent is much larger then we thought. The kidos and dogs love playing in this and they have even had a sleep over when they slept in the tent. It’s easy to setup and fun to play with.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan Bahr",
      "helpful_votes": 2,
      "publication_date": 20180415
    },
    {
      "title": "Our grandson and mine play tent awesome",
      "text": "Awesome gift for Christmas and we use it every time our grandson comes over very sturdy high quality very satisfied very heavy duty you can even make it your own by painting designs on it we hang a battery operated light bulb from the top peek and it lights it all up I would highly recommend this tent highly no doubt one of the best gifts I ever bought",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Doesn't come with rods at base for support",
      "text": "Overall it a cute teepee, but I would not recommend it's purchase as it does Not have any support rods at the bottom and I'm constantly fighting to spread out the four legs to relieve my toddlers of the barricading cloth that ends up draping over their heads and faces. It highly recommend you find one that has rods at the bottom. It will save you from lots of headaches.",
      "rating": 2.0,
      "verified": true,
      "author": "Caticia L.",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Defective product and customer service",
      "text": "Due to the pandemic we were out of the area for a while and didn't get the chance to unbox this until after the 60- day warranty. When we opened it, we discovered one of the poles was broken. I contacted the seller only to be told about the warranty period. I responded that I understood and was willing to pay myself for the replacement pole. I received a response letting me know that they'd be happy to send me a replacement pole or product for free if it were in the 60-day time frame. Customer service was useless and now we have a brand new teepee that is also useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Toni D",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "not as advertised",
      "text": "It arrived without the string to thread through the poles. Also, the two parts of the poles don't easily fit into one another. I would need to hammer them in, and then not be able to get them out. It defeats the purpose of easy set-up, easy take-down for storage or portability. I like the way it looks so am very disappointed to not have it be ready to use right away. Tried to call customer service but so far no luck getting anyone to answer. Emailed them and got an auto response saying they would answer in up to 5 days.",
      "rating": 3.0,
      "verified": true,
      "author": "Zahava",
      "helpful_votes": 2,
      "publication_date": 20171208
    },
    {
      "title": "Missing pieces, cute tho",
      "text": "Got delivered faster than quoted and arrived the right color. But the instructions say there is flooring included and we didn't receive any flooring, just the teepee, poles, 2 short strings, and the carry bag. It was also kind of hard to string together because instead of 1 long string we got 2 short strings. It's cute and I like it enough that I will keep it and go out and buy foam flooring for it, but I'm giving it a 3 star because fast shipping doesn't make up for missing pieces.",
      "rating": 3.0,
      "verified": true,
      "author": "Veronica",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Cute and sturdy",
      "text": "Received product as described. Easy to assemble and is very sturdy if rope is tied tight. Kids couldn't wait to go inside and sleep in it. I bought 2- one for my 7 year old and the other for my 9 year old. They fit fine with plenty of space to move and sleep. Didn't consume too much space.",
      "rating": 5.0,
      "verified": true,
      "author": "Evermeeh",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Really great quality really great price easy to put together",
      "text": "this TV was excellent it was a great price compared to the others that I've seen and the girls love it it's bigger than I expected it was completely white unlike other review saying it had a off-white color and it was easy to put together my girls are very Rowdy and we have not had any problems with it ripping or tearing anywhere we've had it for almost a year now.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Chen",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "It's his little private world where he can have fun and relax",
      "text": "Bought as a gift for my 3 year old godson. It's his new hang out place and he just loves it. It's his little private world where he can have fun and relax. It's a perfect size for him and another young child can join in too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jolie C",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "This was this best gift",
      "text": "Bought it for my grand daughter last; Christmas she loves it. It was made very good; easy to set up; its in her bedroom; again made very good; not crap. This was the best gift; again and I cannot say it again; made very good. Who ever buys this; you won't be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "patricia Farrelly",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "The teepee is a hit for sure!!",
      "text": "Bought this teepee to use as a fun space to read during our \"stay-at-home\" orders and new homeschool arrangements during the Covid-19 pandemic. It far exceeded my expectations when it arrived. It was much larger than I expected. My kids love it. If you assemble it properly (it may take two people to tie it tightly at the top) it's very sturdy. The teepee is a hit for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim & Megs",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Well made cotton tent!",
      "text": "We got this tent for our 2.5 year old. It is very sturdy and great to put a mattress in to sleep. The fabric is very durable and can be washed! The bamboo poles are so much better than the plastic ones on the market. Set up was a breeze for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "This was a fantastic tee pee",
      "text": "This was a fantastic tee pee, great quality for very low cost, used a papasan cushion for the bottom, it was the perfect fit because it is rather large, had originally hoped to use a crib mattress but it did not fit correctly. My grandbaby loves it and plays in it every day. Make sure you have enough room for it because it is quite large but that's why I chose it. We can crawl inside and play with her very easily. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "MimiGrace",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "perfect for what I was looking for",
      "text": "I was looking for something easy to assemble, fairly big but not overwhelming, easy to fold, easy to store and sturdy. This has met all of those needs. I actually use this as a place to retreat and meditate. I am a grown adult woman and I can very easily fit inside this teepee. it would be a perfect playhouse for kids. My kids always get it out and play inside when I'm not using it. It is reasonably priced and well made. I definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "SKHughes",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Ehh. Read reviews",
      "text": "Missing the flooring which is why I purchased this one specifically in the first place. Don’t understand why they send two “shoelaces” instead of one cord. Also received wrong instructions for the product I got. It’s ok but I would recommend a different one. Seems like my 3 y/o would take this down easily and she’s tiny.",
      "rating": 1.0,
      "verified": true,
      "author": "aly gonzales",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great Teepee for kids",
      "text": "Our daughters are 8 and 6 and they love it. It is perfect for them they added pillows all inside and they made it there reading nook. It was pretty easy to put together had it put together in less than 30 min. Material is great and well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "sams mom",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Easy to put together",
      "text": "My toddler loves it, especially speaking through the side window. Easily put together, however it doesn't stay fully open. Since it is only being held by the string on top the legs can go every which way, so you dont always have a perfect 4x4 space.",
      "rating": 4.0,
      "verified": true,
      "author": "magaly rico",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "super cute...very pleased! granddaughter and Nana approved!",
      "text": "Very cute, great size for my 2 year d granddaughter and myself to sit inside and read books or play on tablet etc. She is in love with it! Easy to put together. She did spill her sippy of water in a spot and because its canvas, it left a yellow water stain....but this is washable so we'll fix that. Its great! I researched for the best buy and quality and I believe we chose the right one. Really happy!",
      "rating": 5.0,
      "verified": true,
      "author": "melissa J.",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Looks adorable in son’s playroom",
      "text": "It’s bigger than we thought. But that’s okay. We loved that all 3 of us could fit inside. Our son is only 5 months old, so we look forward to sitting in here, reading books, taking naps, and playing make believe with him as he gets older!",
      "rating": 5.0,
      "verified": true,
      "author": "KiAnna S. Speas",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Not super solid",
      "text": "My niece wanted it for her birthday. Struggled to get it to stay up and then eventually it fell on a kid. No injuries, very light and soft and odds are the kids were messing around.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Good for the price",
      "text": "I am sure there are better quality tenants out there but I did not want to spend $100 on one. This does slide all over my hardwood floor and doesn’t quite stay open causing me to have to pull the sides out frequently. But it was easy to put up and the kids are enjoying it.",
      "rating": 3.0,
      "verified": true,
      "author": "jena_21",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "but easy enough to improvise",
      "text": "Bought this for our toddler. She LOVES it. Did not come with the required string/rope to tie the top together, but easy enough to improvise. Tent is made out of a canvas type material and feels durable. Poles are smooth to the touch and stable. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave D",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "The directions suck! Good luck roping the top together",
      "text": "The directions suck! Good luck roping the top together. I thought I was missing the necessary rope needed but realized I had to tie 2 smaller ropes together and barely had enough to tie a knot. Otherwise it looks good and my son loves it!",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer K",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Exactly what we were looking for",
      "text": "Falls over easily and came with 2 shoelaces instead of a cord, but after we managed to put it together im in love. My son has been playing in it all day. Its pretty big too, almost 6ft tall fully assembled. All in all i would recommend it. But if youre looking for something sturdier, look into a leather cord for the top and some kind of heavy cushion for the bottom!",
      "rating": 4.0,
      "verified": true,
      "author": "jordan",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Great Teepee!  I have purchased more than one!",
      "text": "This teepee is great! Note: the teepee is not 6 feet tall, the poles are 6 feet when assembled. BUT this teepee is a good size! It is roomy enough to have A LOT of FUN! It is made with quality materials.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey Nix",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "This product is generally a good product. It was easy to put together however",
      "text": "This product is generally a good product. It was easy to put together however, it did not come with the cord to keep the Teepee together. I had some twine so I just used that but still, the thing that keeps it all together was missing.... It's also more of a tan canvas rather than white.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Granddaughter lives it",
      "text": "My granddaughter loved this. It gives her a little place to read, it's not to big, but big enough to let her siblings come in also. She loved it. It's like her own little hide away.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladybug Deb",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great play room addition",
      "text": "Very cute, cheaper than target and has a window. I only wish the string that it came with was a couple inches longer, After looping the string through all the poles there was barely enough at the end to tie a knot, would've save me a good 5 to 10 minutes if it just was a little longer",
      "rating": 5.0,
      "verified": true,
      "author": "JMG123",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Get creative with it!",
      "text": "Bought this for valentines day as part of my surprise for my husband for a little indoor picnic. It's quite small so we didn't eat in there, but I added some beach floor lounge chairs and decorated it with lights and balloons and we cozied on up in it to watch a movie after dinner. My husband loved the surprise!",
      "rating": 5.0,
      "verified": true,
      "author": "Makyla Coulombe",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Very cute but ripped already and not sturdy",
      "text": "It’s very cute and I love that it has a floor but my BABY had played in it less than a handful of times and it’s already ripped. And it is not very sturdy at all, baby can move it...",
      "rating": 2.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Line up a helper",
      "text": "Kids really enjoy the teepee. However it was not easy to put together. Took 2 people",
      "rating": 4.0,
      "verified": true,
      "author": "Duane Morris",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Sturdy and no surprises",
      "text": "Lately, I've been having trouble trusting the quality of online purchases, but this one is exactly as I expected: sturdy and easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Jalice",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Great tepee!",
      "text": "Great tepee. Wide enough to fit around my sons bed. The straps broke up top bc my son is 6 and who knows why but my husband was able to rig it! 👏🏻🙌🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Holland",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Great for all ages",
      "text": "My 18 month old along with my seven year old have enjoyed playing inside of this tent. I can even sit inside with one of them. It really is made for two kids maybe three max to fit inside. What I like most is how easily I can fold it up and put it in the closet when they are done. Easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Great Buy!",
      "text": "Love love love this teepee! It was perfect for my sons Wild One Pictures and is fun for him to play in!",
      "rating": 5.0,
      "verified": true,
      "author": "mermaid5",
      "helpful_votes": 5,
      "publication_date": 20170802
    },
    {
      "title": "Fabric bottom saved the day!",
      "text": "I shopped for the best priced blue TeePee I could find. Turns out the fabric bottom is way nicer for filling the TeePee with pillows and things. I am very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Runner",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Durable, easy setup, highly recommended.",
      "text": "Great purchase! My niece loves it! Easy to set up, seems strong and durable. Highly recommend it. It does have the window, so if you're looking for \"authentic\" that's a con, but my 18 month old niece doesn't know a teepee from a wigwam.",
      "rating": 5.0,
      "verified": true,
      "author": "AndrewPW",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "It was relatively easy to set up and doesn't take up too much ...",
      "text": "My toddler loves this tent! It was relatively easy to set up and doesn't take up too much space either. The material is great, it is very nicely made.",
      "rating": 5.0,
      "verified": true,
      "author": "corrin williams",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Very beautiful mini house in our appartment",
      "text": "It's used to be our kids home in our appartment, now it's a base for her toys. We loved everything, and can't complain.",
      "rating": 5.0,
      "verified": true,
      "author": "Emil",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "This is great! ♥️♥️♥️",
      "text": "Love this tent! My twin grandsons love this teepee ♥️ They are in it most of the time they are here visiting ♥️ They are 1&1/2 years old and so far best idea at my house yet ♥️ Delivered fast & easily assembled",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Santella",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "The small rope they give you is to tie the sticks at the top of tee pee",
      "text": "Bought for my grandson. Its exactly what i exspected and we love it. His little face just lite up when he saw it! Nicely made. Easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customerdeniseopink",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "An Ok Product",
      "text": "The item is canvas and appears to be as listed; however, the only complaints I have is the instructions did not properly describe/illustrate how to appropriately install the strings with the wooden poles. The wooden poles appear cheaply made. While it is listed as six feet, it appears shorter when assembled.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth Flood",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Huge!!",
      "text": "Nice and big!! It didn't come with a string to tie it at the top so my husband had to improvise with the string it came with that tied it together in the box. Otherwise, my son is happy and so that makes me happy!",
      "rating": 3.0,
      "verified": true,
      "author": "amanda smith",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "I have been using this for photo shoots (I am ...",
      "text": "I have been using this for photo shoots (I am a photographer) and it is a hit with the clients. Too big to put in my daughter's room but that's okay!",
      "rating": 5.0,
      "verified": true,
      "author": "Haddenkyle",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Nice quality,  size and easy to put up.",
      "text": "Not quite as sturdy on the base of the sides. Stays upright better on carpet than wood floor.",
      "rating": 5.0,
      "verified": true,
      "author": "ndfreshair2",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Perfect!",
      "text": "Absolutely love this item. Was exactly what I imagined. Thank you for making our Pinterest dreams come true with this one! She just loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Khloes Mom",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Portable and easy to build",
      "text": "Purchased this for my grandson, and he loves it. Great soft space for children to read, relax or hang out with a sibling. Nice durable material, easy to pack up and travel with.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Lucero",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Was so excited to receive this and set up a ...",
      "text": "Was so excited to receive this and set up a cozy little reading space for my child. Bummed to find pieces missing during setup.",
      "rating": 3.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Durable and beautiful",
      "text": "Our daughter's crib mattress fits great in there, with extra room on the longer sides for all her extra blankets and stuffed animals. She jumps around in there and it has held together.",
      "rating": 5.0,
      "verified": true,
      "author": "Labrie Family",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "Worth the price",
      "text": "This is so much bigger than i expected! My daughter absolutely loves it! Put it together in maybe 10 minutes (with no instructions). The tying was a little tricky, but it’s holding with no problem. Very sturdy and very thick fabric.",
      "rating": 5.0,
      "verified": true,
      "author": "David Esser",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Really good quality. My 7 year old daughter loves it",
      "text": "Really good quality. My 7 year old daughter loves it! Very easy to move, but it is pretty big if you don't have a lot of space to set it in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "easy to put together",
      "text": "Really well constructed, easy to put together, kids absolutely love it! Easy to fold together and store in a closet. We put tiny covered lights (battery operated) at the top so they have colored lights inside...it's magical!",
      "rating": 5.0,
      "verified": true,
      "author": "Callie Simons",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Fun prop",
      "text": "Super cute but it took two grown men to figure out how to assemble it.",
      "rating": 5.0,
      "verified": true,
      "author": "Meika",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Hours of Fun!!",
      "text": "My Grandsons love the tent. It's large enough for a 3 and 5 --year-old to sit and stand comfortably. Well made. Washable,(throw-up incident, involving cranberry juice- stain came out.) Great value for the price. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Nelson",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Pink tent",
      "text": "Three year old granddaughter really njoys playing in this tent. It looks cute in her room.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat W",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Roomy and Fun!",
      "text": "My grandkids (ages 3 & 4) love this! It's very roomy and easy to assemble/disassemble. It's large enough that my daughter gets in with them and they take turns telling spooky stories!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Great LARGE kids teepee!",
      "text": "Super easy to put together. Works like I’d expect it to. Honestly should have paid more attention when buying because it’s BIGGER than I thought! Takes up a large portion of my sons room. Overall pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Great TeePee!",
      "text": "My Grandson loves it! Good quality, easy to put up, fabric is not scratchy. It is strong, but soft.",
      "rating": 5.0,
      "verified": true,
      "author": "CR",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Quality teepee!",
      "text": "Huge teepee! Purchased for our nursery and even used it at the baby shower. Very easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Love it!",
      "text": "Love it, super cute. It was larger than expected I originally bought it to be used in my living room but it still makes a great addition to our deck!",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrinanicole",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Wonderful!",
      "text": "Love this! Great material! So cute. I use it for my photography. Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronda S.",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Not too good.",
      "text": "It keeps moving and have collapsed multiple times. Not advisable for rough kids.",
      "rating": 2.0,
      "verified": true,
      "author": "EfCeeGee",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Adorable and looks good",
      "text": "Adorable for the price. Perfect size to fit in my living room for my kids and still looks cute. Nice neural canvas color. Not sure why people are saying assembly was hard, it took me 5 minutes by myself with my kids sword fighting with the poles. Can't beat it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Great for kids who need a place to hide",
      "text": "My 4 and half foot tall son fits perfectly in this. He has sensory issues and likes to hide away in this to read books or just to have some alone time.",
      "rating": 5.0,
      "verified": true,
      "author": "Taitague-Jones",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Four Stars",
      "text": "hard to stand and put together. However, my daughter loves is. So it works.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa Smith",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Good quality.",
      "text": "Beautiful teepee. Great for a backdrop set up for kids photography. It attracks their attention. The fabric is very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Xianghai Sheng",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Product came with wrong directions.",
      "text": "Product came with wrong directions. Fabric is nice but stupid design.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "My kids loved this I have it set up in the living ...",
      "text": "My kids loved this I have it set up in the living room and my kids are 8,11,and 1 and even my childcare kids use it. Such a Nice touch to a playroom or play area. Picture is from when I first got it I’ll updat with a new picture later on",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Love one for myself.",
      "text": "Excellent tent for my 5 and 2 year old niece and nephew. They love it to death. I love one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Bushliewoo",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Perfect!",
      "text": "Love this! My grandson plays in this every time he comes to my house.",
      "rating": 5.0,
      "verified": true,
      "author": "Darla Barnett",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "so far so good; super easy to put together",
      "text": "so far so good;super easy to put together,took me maybe 10min; my son likes it already.it is not white but more beige color and thats what i expected anyway and im happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Cute and worth the price",
      "text": "Very cute. Once we set this up, my three year old son closed himself in with pillows and books and wouldn't come out! He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla Bennett",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Daughter loves it!",
      "text": "Got this for my daughter for her 1st birthday. She LOVES it! Little bigger than expected, so be mindful if you have a small room. Only took about 8 minutes to set it up. I did have my Fiancé help me. Would recommend, very nice quality for activity tent",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "... a bit tricky to put together but came out perfect",
      "text": "was a bit tricky to put together but came out perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Soudatt",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "So cute you could even decorate it!",
      "text": "What a cute teepee! I bought this as a gift for someone and it's so cute! Perfect for a playroom or child's room! The kids could also decorate it if they wanted to!",
      "rating": 5.0,
      "verified": true,
      "author": "SWEETNEWYORK",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Wrong description, decent quality, good size!",
      "text": "Like others state, my order came with two shoelaces but I made it work! The quality is OK, it came snagged in several spots. Other than that it's a great size! I hope my twin girls grow up to like this alot",
      "rating": 4.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Good quality",
      "text": "I shopped around looking for a good tent for a good price. This tent is really cute just wish the poles were more sturdy. My girls do love playing in it and it was a great Christmas present for them.",
      "rating": 4.0,
      "verified": true,
      "author": "Gris Garcia",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Great teepee",
      "text": "I got this teepee for my sons ages 4 and 2. And it’s been a hit. It’s much bigger than I expected it to be which is a plus. I love the wooden poles and the canvas material. Such great quality for an amazing price. Assembly was pretty easy once I figured out how to tie the ropes on the the top of the poles. I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ltankard",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "... the seam stitching was undone But other than that good sturdy poles",
      "text": "Some of the seam stitching was undone But other than that good sturdy poles",
      "rating": 3.0,
      "verified": true,
      "author": "Kellie Richetti",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Cute and fun",
      "text": "Bohemian look and my 4 year old daughter loves it. Only complaint is was missing a string to tie together. No big deal.",
      "rating": 4.0,
      "verified": true,
      "author": "joemac",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Excellent product",
      "text": "Large size. This Teepee is built great, nice fabric. Sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "ShannonD",
      "helpful_votes": 2,
      "publication_date": 20171023
    },
    {
      "title": "I use it for a lot and it is sturdy and simple",
      "text": "I can't say enough about this. I use it for a lot and it is sturdy and simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemarie Jordan",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "I love this Teepee for my Toddler!",
      "text": "I love this tent! It Exceeded my expectations and was extremely easy to put together. It is really spacious and my little one can’t stay out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lacey",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Super easy to set up.",
      "text": "My son LOVED this when I got it for him. It's like having a fort you can easily set up and take down without marking up your walls.",
      "rating": 5.0,
      "verified": true,
      "author": "Everglow94",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Great addition to a girls bedroom!",
      "text": "Very pretty. My daughter loves it and I like to get in it with her to read stories. I am so glad I chose this one, very spacious and well made!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Revilla",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Great tent!",
      "text": "A little tricky to tie at the top, but overall very pleased with it! Love the size and material.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Confusing directions",
      "text": "The directions say the tent comes with one cord but mine came with two short cords with made it very hard to put together",
      "rating": 2.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Nice size and quality",
      "text": "Nice basic teepee. I added fairy themed accents to create the fairy teepee my daughter wanted. Enough room for 2 little girls to sit and read.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Avino",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Great teepee for the price",
      "text": "Big and sturdy. My son loves to lay down inside it with all him plush toys and pillows.",
      "rating": 5.0,
      "verified": true,
      "author": "AnaT",
      "helpful_votes": 0,
      "publication_date": 20180803
    }
  ],
  "product_meta": {
    "title": "Best Choice Products 6ft Kids Cotton Canvas Teepee Playhouse Sleeping Dome Play Tent w/ Carrying Bag - White",
    "description": "Color:WhiteOh, the adventures you'll have! This cotton canvas kid's teepee tent offers a fantastic space for children to play, pretend, read, nap, and more! Inspire little dreamers to use their imaginations and visit far-off lands, all from the comfort of your backyard or living room!\n\nSpecifications:\nOverall Dimensions: 49\"(L) x 52\"(W) x 70.5\"(H)\nInterior Dimensions: 45\"(L) x 45\"(W) x 55\"(H)\nMesh Window: 14\"(L) x 13\"(W)\nCarrying Bag: 45\"(L) x 5\"(Dia)\nWeight: 7.7 lbs.\nIncludes: 1 tent body, 4 wooden poles, 1 carrying case\nMaterial: Cotton Canvas\nFrame Material: Wood\nCarrying Bag Material: Cotton Canvas\nColor: White\nIntended for indoor use only\nFlame-retardant, ASTM F963 safety standards\nFor children ages 4 and up\nAssembly required (instructions included)",
    "rating": 4.6,
    "feature_bullets": [
      "FUN WAY TO FOSTER GROWTH: This kids tent gives your child the perfect little getaway to channel their imagination and curiosity as they play",
      "KID AND PARENT FRIENDLY DESIGN: Tie-back flaps with self fasteners allow for easy entry, and a side mesh window with roll-up curtain lets parents keep an eye on little ones as they play inside",
      "SPACIOUS INTERIOR: 4 wood stick spread to create enough room for the tent to be filled with cushions, stuffed animals, pillows, blankets, toys, and more, giving your child plenty of fun and relaxation",
      "CARRYING CASE INCLUDED: Allows for easy storage to save space when not in use and to use outside in a backyard or park for outdoor playtime",
      "DURABLE COMPOSITION: Machine-washable cotton canvas and sturdy wooden poles create a stable structure that lasts through countless playtimes; OVERALL DIMENSIONS: 57\"(L) x 44.5\"(W) x 75\"(H)"
    ],
    "specifications": {
      "Product Dimensions": "49 x 52 x 72 inches",
      "Item Weight": "7 pounds",
      "ASIN": "B01I4C2V48",
      "Item model number": "SKY2590",
      "Manufacturer recommended age": "0 - 8 months",
      "Best Sellers Rank": "#154,637 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars367 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "0 - 8 months",
      "Manufacturer": "Best Choice Products"
    },
    "categories": [
      "Toys & Games",
      "Play Tents & Tunnels",
      "Sports & Outdoor Play"
    ],
    "price": 44.99
  }
}