{
  "website_summaries": [
    {
      "verdict": "The quality of this pad is exceptional, but it really stands out for its weighted, stake-free edges.",
      "pros": [
        "36-inch pad folds to 13 inches for storage",
        "High visibility orange fabric with weighted galvanized steel edges",
        "Easy to use",
        "Also available in a 60-inch size",
        "Comes with a case for carry and storage",
        "Good quality"
      ],
      "cons": [
        "Some found this option difficult to fold up",
        "Reports that the zipper on the storage bag breaks easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A must-have Accessory for the Drone Pilot",
      "text": "Excellent Product. I'd say a \"must have\" accessory for the Drone Pilot. Provides a nice clean surface from which to launch and recover your drone. It keeps dirt and debris from blowing back onto your Drone. Keeps the gritty dirt out of your motor and dusting your camera lens. Nice weight to it so that it doesn't blow away or flap around when taking off or landing. Also lets others around you know where you are taking off and landing which in turn keeps them a safe distance. Folds up nicely and has its own carry-bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Art",
      "helpful_votes": 6,
      "publication_date": 20160905
    },
    {
      "title": "Easy, no dust!",
      "text": "The fact that you just toss to this larger pad to a location you want it at, place your done and you're ready to go. I use this on dusty/dry land. When I drop this, the cable ring has enough weight to toss up a bit of dust away from the pad. I don't have to use any pegs to hold this in place. This is big enough to were you can still see it while at 300+ feet via the drone camera. This is a great land pad!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Woodcock",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Easy to setup, protects motors from kicked up dirt",
      "text": "This is a must for drone pilots. Protects motors from kicked up dust. Makes it easy to return to land by pivoting camera to point straight down, then home in on the orange circle. Lets passers-by know there is a drone flying. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Cantwell",
      "helpful_votes": 4,
      "publication_date": 20180214
    },
    {
      "title": "Exceeds expectations",
      "text": "The build quality on this is top notch. I like the weighted rim. it took me a few tries to figure out how to fold it back down quickly, but now that I've got it down it's very simple. I think this is an important tool to have for drone operations in busy areas, and it keeps the camera lens from getting debris blown on it during takeoffs and landings. No complaints about this product",
      "rating": 5.0,
      "verified": true,
      "author": "John Thain",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great for a takeoff pad here in Arizona",
      "text": "I use this to make sure I keep sand and dirt off the lenses and out of the props during takeoff here in Arizona. It is also nice to have a visible landing are as spectators gather so they know the general area to stay away from for a landing.",
      "rating": 5.0,
      "verified": true,
      "author": "Gears",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Heavy Duty",
      "text": "The product is as advertised. The ring is heavy, and doesn't blow away, and you don't need anything to hold it down in heavy winds. It's not rocket science, but it's not that simple to fold it up. PRACTICE!! GREAT PRODUCT!!",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Excellent construction",
      "text": "Our Sheriff Office SAR Drone team uses the 5 ft diameter landing pad and I wanted the 3 ft diameter pad for my personal drone fleet. Now I don't need to put stakes into the ground to prevent the pad from blowing away.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Tuttle",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "The Real Helipad for Professional Drone Pilots",
      "text": "For every drone pilot out there who really want to step up into the category of professional, the Hoodman Helipad has to be a “must have”. The product is of high quality and stands out nicely. I have some friends asking me about this product, so far everybody is very impressed. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Andres Delgado",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Heavy duty - Stays where you put it",
      "text": "The quality of construction and design are both top-notch. This is going to last for years and years even with heavy use. Solid stitching; heavy weights around the perimeter to hold it in place even in windy conditions - this is just what I needed for launching and landing my drone for photoshoots! Glad I spent the money!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Curzon",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Absolutely!",
      "text": "Must-have. Prevented sand from getting kicked up into the motor and scratching the lens while taking off and landing on the beach in Cabo. I am too accident prone to be hand catching my drone. This product protects the drone during take off/landing, PLUS serves as a nice, clean surface to set things down on while calibrating the compass or IMU (controler, bag, gimble clamp/covers).",
      "rating": 5.0,
      "verified": true,
      "author": "DSuz",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "The best landing pad",
      "text": "Although expensive, this is a great landing pad for a drone. It is heavy, which is great because it won't be blown away by the wind. Very high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great launch pad",
      "text": "Keep in mind while this is a rather heavy drone pad, its perfect for just that. No need to use stakes etc. Pad stays put in the wind etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Xair",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "The best drone, RC landing pad IMO",
      "text": "I have mine placed in a Burton 🎒 backpack, I use every time I go flying to keep dirt out of the motors and to allow for a good contrasting color for “precision landing” when using the DJI Mavic 2.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Perfect for Mavic Pro users",
      "text": "This is just the perfect size for my Mavic Pro. I only wish I purchased it sooner. It keeps rocks, sand and debris out of the way of your drone and also creates an easier mark for return to home landings. Yes, the learning curve on folding it back up is steep; For me it is analogous to that first time you took the training wheels off your bicycle: It is something that is awkward if you break it down into steps so, once it is treated as an intuitive, non-thinking action, it is a lot like learning how to ride a bicycle - you never forget.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Leedy",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "stays planted as advertised, slightly confusing to close up [but you'll figure it out]",
      "text": "Stays planted even on moderately uneven surfaces and when flying a heavylift 40 lb drone. A little difficult to close up as there's an extra fold you don't typically perform with a similar reflector folding procedure, but they offer a how-to video if you really get stuck. More so it works and keeps people from entering your LZ.",
      "rating": 5.0,
      "verified": true,
      "author": "Weylin Rose",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Must have for sUAS operators",
      "text": "Awesome landing pad. No more having to stake down or have blown away like the cheapie that I was using. Stays put even with the Inspire hovering over it. Only issue is that the zipper on the storage bag broke the first time I unzipped it. Need to hit Hoodman up for a replacement!",
      "rating": 5.0,
      "verified": true,
      "author": "jpavoncello",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "A portable landing pad.",
      "text": "PERFECT launch pad for your drone. You'll look like a real pro when using this amazing piece of kit. Easy to use and set-up. I am so glad I bought mine. It impresses my clients so much. Pretty cool to having my own landing pad that I can take with me anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Question everything.",
      "helpful_votes": 2,
      "publication_date": 20160904
    },
    {
      "title": "great landing pad",
      "text": "Study, wont move while copter is landing use it for Mavics and Inspires. Tough and heavy, takes a bit more effort to fold but with a little practice it works just fine would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Sturdy, easy to set up landing zone and launch pad.",
      "text": "This product is fantastic, An easy way to keep bystanders out of the take off and landing area and lend a professional look. It was tricky to fold up at first, but easy peasy after a few times of getting it out and putting it away. The outer ring is heavy enough that it won't blow away. Keeps rocks, grass and other debris from flipping up onto camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan_E",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Perfect for DJI Mavics and Phantoms",
      "text": "The weighted outer ring is the key. No stakes in the ground and won't fly away in higher winds. I use this almost every time I fly.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom E",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "It's worth the extra cost compared to the cheaper versions",
      "text": "As a new drone pilot selecting additional equipment or accessories can be hit or miss. This landing pad was a hit based on the quality of the unit itself. If you can cover the extra cost, in my estimation it's well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "mcriderinomaha",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "good",
      "text": "Crazy loop mind twister to wrap back up but is of excellent quality",
      "rating": 5.0,
      "verified": true,
      "author": "Bens Owner",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Works great!",
      "text": "Works very well and is resistant to wind relocation. A landing pad is essential to protect your drone, motors and very importantly, the camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Utdeere",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Hoodman  HDLP3 drone landing pad",
      "text": "Perfect size and weighted so it won’t be blown away.",
      "rating": 5.0,
      "verified": true,
      "author": "drobin3",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Easy to use",
      "text": "I use the landing pad for my Phantom 4 Pro and Advance. It is easy to deploy and does not have to be staked in to stay put. The 3 foot diameter offers a good target, especially in tall grass",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Jacobus",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Expensive, but worth it.",
      "text": "The weighted outer ring eliminates the need for steaks which makes setup fast. The landing pad material is thick and sturdy. This pad should last for years.",
      "rating": 5.0,
      "verified": true,
      "author": "masic",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Great landing pad",
      "text": "Works well, it's heavy and stays down on the grass. Using it for a Inspire 2 and Phantom, on a professional basis. One thing that's nice is at a scene with full scale aircraft, the orange helps them know where we are located.",
      "rating": 5.0,
      "verified": true,
      "author": "timl",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Well built!",
      "text": "Love the quality. Kinda hard to fold to store. Takes practice. Would buy again though.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "The Cadillac of landing pads.",
      "text": "Best landing pad money can buy. No stakes needed. Very very well made. Drones love landing on this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "sjmphoto com",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Good Product",
      "text": "It's a little on the heavy side due to the internal cable, but that is what keeps in in place on the ground so I'm okay with it. I am satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Broosie",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Heavy - No anchors required.",
      "text": "Products works better than described. Happy landings with no damage to your drone from dust, dirt, sand, or blades of grass.",
      "rating": 5.0,
      "verified": true,
      "author": "WDP",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "It’s perfect! Weighted and won’t fly away",
      "text": "It’s perfect! Weighted and won’t fly away, keeps dust and dirt out of props and motors! Folds quickly and easily, this is a no-brainer buy! Crazy not to buy. Everything else just flys away when the Drone takes off.",
      "rating": 5.0,
      "verified": true,
      "author": "David Nelson",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Reliable and worth the money!",
      "text": "It’s legit and made out of heavy material. Great size and worth the value!",
      "rating": 5.0,
      "verified": true,
      "author": "david cuevas",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "THIS IS A GREAT LANDING PAD USE IT EVERYDAY",
      "text": "THIS IS A GREAT LANDING PAD USE IT EVERYDAY. I ALSO HAVE THE 2 FT AND 5 FT AS WELL. MIGHT EVEN GET THE 8 FT IF THE PRICE COMES DOWN SOME MORE.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Great for serious drone",
      "text": "This sucker is seriously heavyweight. Sometimes have trouble folding it up. Trying to figure out what all the tabs are for.",
      "rating": 5.0,
      "verified": true,
      "author": "BabaDude",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "You get what you pay for, nice landing pad",
      "text": "Good quality, expecting many years of use and weight is perfect to not blow around!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerome Ferri",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "nice weight, doesn't move with the wind",
      "text": "Got this after landing my Mavic in grass and getting bindweed wrapped around one of the props. Does what it says, nice weight, doesn't move with the wind.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris L",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Fantastic launch pad.",
      "text": "I got the 3 foot model and love it but the 5 foot would be better for landing in the wind because of the larger area. And I have used it in some pretty heavy winds and it stays put.",
      "rating": 5.0,
      "verified": true,
      "author": "George Cayer",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Out of this world",
      "text": "So so love this , use it for my inspire 2 & my phantom 4 pro",
      "rating": 5.0,
      "verified": true,
      "author": "roger byrd",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Don’t skimp on size",
      "text": "Product is well made and quite heavy enough to stay in place when drone is taking off or landing. Little tricky to fold until you learn the proper procedure. I feel 3’-0 dia. Is the minimum size pad for any size drone.",
      "rating": 5.0,
      "verified": true,
      "author": "Budge",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Great landing pad...",
      "text": "Excellent quality and easy to use....I weighed it and found it actually weighs 3.75 lbs, heavier than what the specs show...",
      "rating": 5.0,
      "verified": true,
      "author": "David R",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Outstanding value for the money.",
      "text": "really love this thing, really helps while taking off and landing your drone. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Great quality!",
      "text": "Smartly packaged with convenient and sturdy nylon carrying pack. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "BrightEyes",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Great launchpad",
      "text": "Hoodman makes excellent products for photographers and this is yet another one. Heavy duty and stable.",
      "rating": 5.0,
      "verified": true,
      "author": "Markatekt",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Five Stars",
      "text": "Outstanding quality!! If your a big drone pilot this is worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "Airw6554",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Hood man is the best",
      "text": "Top quality best drone Launchpad for my DJI mavic. It was a little hard to fold back up until I looked at a YouTube video",
      "rating": 5.0,
      "verified": true,
      "author": "T. Kiraly",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Perfect and easy to use",
      "text": "Perfect and easy to use. Ideal for rough ground, so that you don't kick up particles into the camera. Weighted rim also ideal for windy days...",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "This is the one.",
      "text": "The perfect size and weight for Phantom 4 Pro launching and landing... and easy to spot from the air. Highly recommended! ~G",
      "rating": 5.0,
      "verified": true,
      "author": "glenn",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Very good product",
      "text": "A must have for safety for drone and bystanders; let's them know to stay clear.",
      "rating": 5.0,
      "verified": true,
      "author": "wolfric",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Clean landing zone.",
      "text": "A well made takeoff and landing zone for my Phantom 4 Pro. Keeps the dirt and grass off of my drones landing and taking off in the environment of ranch work in South Texas.",
      "rating": 5.0,
      "verified": true,
      "author": "ST Rancher",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Five Stars",
      "text": "This is great. Folds up small, and keeps dirt out of my quad copter.",
      "rating": 5.0,
      "verified": true,
      "author": "Wallace",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Drone landing pad",
      "text": "Bought it as gift thought it was a little pricey for what it does.",
      "rating": 5.0,
      "verified": true,
      "author": "dalenah",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Stays put and had drastically decreased the amount of dust ...",
      "text": "Stays put and had drastically decreased the amount of dust in the air in gravel or dirt areas of takeoff.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Otte",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Well built should last for a long time. Well ...",
      "text": "Well built should last for a long time. Well weighted so it wont blow away. Don't get rid of the folding directions, it takes some time to master.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerome B.",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Get it...worth it!!",
      "text": "This Launch is simple and works great. A bit pricey but you get what you pay for!",
      "rating": 5.0,
      "verified": true,
      "author": "Midnite",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "I definitely recommend it.",
      "text": "The bright color and the fact that it's weighted. No staking is necessary. It's very well built. I definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J. Ramus",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Awesome",
      "text": "Excellent product for your drone. Rugged, portable and fits a Phantom perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Texas scoutman",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Great landing pad",
      "text": "Just what I was looking for - has a nice weight to it so it doesn't fly away.",
      "rating": 5.0,
      "verified": true,
      "author": "Pablo Escobar",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Perfect size and stays in place",
      "text": "Well made product. Perfect size and stays in place. A great gift for the drone enthusiast.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Ghostlaw",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Five Stars",
      "text": "Nicely weighted and well made... tough to fold because of (necessary) thick wire",
      "rating": 5.0,
      "verified": true,
      "author": "Ludo",
      "helpful_votes": 0,
      "publication_date": 20170316
    }
  ],
  "product_meta": {
    "title": "Hoodman HDLP3 Drone Landing Pad Launch Accessory 3 Foot Diameter Fits DJI Phantom Size Smaller RC Quadcopter",
    "description": "The Hoodman HDLP3 Drone Landing Pad is a great accessory investment for your DJI Phantom and smaller RC Quadcopter adventure video endeavors. A Hoodman launch pad will keep your lens clean throughout takeoff and landing. Nothing worse than mowing the lawn with your rotors. Your launch pad will protect your rotors from tall grass and pebble strikes. Your first sandy beach takeoff and landing will pull sand through your motor bearings and blast your lens and gimbal with sand. Deploy the Hoodman landing/launch pad in seconds as it springs out of its compact 13 inch carry bag. No need to carry a hammer and stakes to keep your pad in place; Hoodman launch pads have weighted perimeters and stay put on the windiest of days. Safely and clearly mark your next takeoff and landing area with a Hoodman launch pad. Hoodman has been a trusted name in rugged, drone, camera and video accessories for over 33 years and offers a 1 year warranty: free from manufacturing defects.",
    "rating": 4.8,
    "feature_bullets": [
      "Easy set up springs into shape when released from 13 inch carry bag",
      "3.2 pound zinc coated perimeter cable keeps drone launch pad in place without stakes",
      "Keeps your camera lens clean during launch and landing",
      "Protects rotors from tall grass and pebble strikes",
      "Rustproof components clean up with a wet towel"
    ],
    "specifications": {
      "Product Dimensions": "15.3 x 15.2 x 3.7 inches",
      "Item Weight": "4.49 pounds",
      "ASIN": "B01I0E821G",
      "Item model number": "HDLP3",
      "Manufacturer recommended age": "12 months and up",
      "Best Sellers Rank": "#19,148 in Industrial & Scientific",
      "Customer Reviews": "4.8 out of 5 stars116 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "12 months and up",
      "Manufacturer": "Hoodman"
    },
    "categories": [
      "Robotics",
      "Industrial & Scientific",
      "Toys & Games",
      "Unmanned Aerial Vehicles (UAVs)"
    ],
    "price": 59.99
  }
}