{
  "website_summaries": [
    {
      "verdict": "The T-Mobile G2x's simple Android interface, blazingly fast speeds, and polished look make it the phone to beat in T-Mobile's lineup.",
      "pros": [
        "The T-Mobile G2x features a 1GHz Nvidia Tegra 2 dual-core processor that delivers great performance",
        "It also has a sharp design, plenty of multimedia features, and HSPA+ speeds"
      ],
      "cons": [
        "The T-Mobile G2x's photo quality did not meet our expectations",
        "The call quality could also be slightly better"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 9.0,
        "Performance": 9.0
      },
      "publication_date": 20110418,
      "rating": 8.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beautiful and functional, but handle with care!",
      "text": "This is my absolute favorite salad bowl by far. I eat a giant salad every day, and this is the perfect size. My only compliant is that this is the second one I've had to buy. The bowls are NOT chip resistant and I have three teens who often do dishes and stack them and twice now they have chipped one of my Mason Cash bowls. I plan on taking care of this one myself, because I want to keep it around for a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon F. Mcrae",
      "helpful_votes": 5,
      "publication_date": 20170604
    },
    {
      "title": "The best mixing bowls!",
      "text": "These bowls are a great combination of sturdy, well-insulated for proofing bread, strong enough to stay put, and light enough to move easily. I've had several larger bowls of this line for many years but wanted a smaller one, and the blue color goes well with the old standard white and bamboo. I see these are now made in Portugal instead of England, but there seems to be no difference in quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 3,
      "publication_date": 20160714
    },
    {
      "title": "Arrived in excellent condition. Very attractive and roomy for mixing bread ...",
      "text": "Arrived in excellent condition. Very attractive and roomy for mixing bread dough at our cabin which is why I got it. Lighter weight than I was expecting so maybe a little fragile but my wife especially likes lighter weight for ease in handling, washing, etc. outstanding quality overall and great price - I had been looking for a large mixing bowl for a couple years now but resisted due to higher price of other brands/deals and as it was for our lake cabin. I would definitely recommend this bowl. Just love it and hope to pass on to my kids (who also make bread) as it is heirloom worthy.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin M. Twohy",
      "helpful_votes": 4,
      "publication_date": 20160706
    },
    {
      "title": "Almost Exactly What I was Looking For!",
      "text": "This will be my bread-making bowl. I had one that was older than I am (64) that had been my mother's but it was broken during my last move. I was heartbroken! I couldn't find the same that she had but this one will work just fine. It's big enough and sturdy enough to last. Baking bread is one of my passions!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheri Dodson",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "This was a gift and the recipient was delighted. It came wrapped perfectly",
      "text": "This was a gift and the recipient was delighted. It came wrapped perfectly. Really good job. Thank you and Merry Christmas and Happy Holiday. Paula Campbell",
      "rating": 5.0,
      "verified": true,
      "author": "Paula E. Campbell",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Perfect",
      "text": "It's lightweight, seems durable so far and the perfect size for mixing larger quantities. I'm considering ordering a smaller size as well for display on my counter top.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymou$",
      "helpful_votes": 3,
      "publication_date": 20160509
    },
    {
      "title": "Great Mixing Bowl",
      "text": "This was a replacement for a much loved bowl (of the same kind) that I have used for over 40 years. Glad they are still being made.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Hogan",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Love, love, love",
      "text": "Love Mason Cash bowls! Great for mixing baking batters. The color of this bow SO pretty!",
      "rating": 5.0,
      "verified": true,
      "author": "marielarock",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Great bowls--good looking, too ;)",
      "text": "Beautiful bowl, easy to grip, good weight. Well wrapped in bubble wrap for shipping. Arrived quickly and in great condition. Very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "SN",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "This bowl is wonderful. I have one other Mason Cash bowl and ...",
      "text": "This bowl is wonderful. I have one other Mason Cash bowl and they are my favorite. I had never seen one in blue and I'm really happy that I got this one. If there are more sizes I would buy them all. Arrived quickly and in great shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Michelle Fox",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "Very well packed!",
      "text": "It came fast in these days, and very well packed. The bowl is beyond beautiful and a very good size for my sourdough bread baking ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "A great mixing bowl and very durable",
      "text": "I love these bowls just wish they weren't so expensive",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Gravelle",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Five Stars",
      "text": "I love this bowl, it is steady and sturdy, easy to clean and well designed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Chipped bowl",
      "text": "This bowl is chipped on the top edge. I didn't notice the chips until the return period was past. We are very careful with our things, and I think it may have been chipped when we received it.",
      "rating": 1.0,
      "verified": true,
      "author": "Judith Williams",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Unuseable",
      "text": "Couldn’t use because it was broken into a million pieces",
      "rating": 1.0,
      "verified": true,
      "author": "Tommie West",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Beautiful bowl",
      "text": "This is the first Mason Cash bowl I have purchased and it won't be the last. It's not too heavy and the color and design are beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley Mikula",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Stylish quality.",
      "text": "It’s just what I wanted. Love the color, love the size & love the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Nice Bowl",
      "text": "Wife really likes it... Nice product and timely shipping. Would buy again. Recommend it to anyone that I know !",
      "rating": 5.0,
      "verified": true,
      "author": "Xtreme Motors",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Just love this bowl",
      "text": "Just love this bowl. The color is just lovely and the size is just right for my cake baking needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Louvar",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "Beautiful but don't use metal utensils!",
      "text": "Gorgeous color. Nice bowl. I'm watching the Great British Baking Show ad they use Mason Cash a lot. That's why I ordered it! It's beautifula and I hope it will wear well over time. So... update: DO NOT USE A HANDHELD ELECTRIC MIXER! It will merk up the inside with ugly grey streaks! Bummed!",
      "rating": 3.0,
      "verified": true,
      "author": "Nancy Carlson",
      "helpful_votes": 4,
      "publication_date": 20170902
    },
    {
      "title": "Great looking bowl!",
      "text": "Just received this bowl yesterday so have not had an opportunity to use it yet. This is my first Mason and Cole bowl, and it looks great. As others have mentioned, it does appear to be lighter weight which may allow it to crack easier, so will be very careful in handling it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy - Olympia",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great for dough",
      "text": "Beautiful bowl at a great price. I like that there is a rim at the bottom, because I put it on a heating pad to let dough rise, and that creates a little space so it is not directly on the heat.",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline Moore",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Pretty bowl...",
      "text": "It's a bowl. A pretty bowl that works for what bowls are supposed to do. It feels good in the hand and the bright color makes me happy. I ordered more of the same brand because they're so darn cute! This one was made in Portugal. I just got it and used it once thus far so I'm not sure yet how it will hold up after multiple uses.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 3,
      "publication_date": 20150801
    },
    {
      "title": "Beautiful color.",
      "text": "I loved the color of this bowl but had to return as it was shattered during delivery and I had to return it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Shand",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "I Love the Mason Cash bowls",
      "text": "I Love the Mason Cash bowls. One was given to me for a Birthday Gift. I love it so much I purchased 2 more. I love the large size and wide open top. They are heavy duty but like weight in feel , easy to use and move around. Great colors to pick from too. My favorite Bowl and I have lots of dishes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Five Stars",
      "text": "I love these bowls though I wish they were made in England as they originally were.",
      "rating": 5.0,
      "verified": true,
      "author": "Doobie Do",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "It is the perfect size for mixing pancake batter or serving potatoe salad",
      "text": "I am very impressed with quality of this bowl. It is the perfect size for mixing pancake batter or serving potatoe salad. I would not hesitate to recommend it to my friends. It is a great bowl that will be used often.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Five Stars",
      "text": "I love the quality and size of the bowl. Perfect for bread making.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Smith",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Love Mason cash items",
      "text": "Love Mason cash items. Gorgeous blue color-really pops in the midst of other bowls. Thinking of getting the red one next...",
      "rating": 5.0,
      "verified": true,
      "author": "April A Hoskins",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "BAKER'S DELIGHT",
      "text": "I bake A LOT of bread and needed a big bowl This definitely fills the bill. It easily accommodates any loaf and and I love that I can proof in the same bowl and it's not too heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladyireland",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "great",
      "text": "item as described, I'm happy with my purchase and communication from seller",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah J.",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Lovely",
      "text": "Bowl is beautiful and will be a great addition to my collection!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Imken",
      "helpful_votes": 0,
      "publication_date": 20161218
    }
  ],
  "product_meta": {
    "title": "Mason Cash Color Mix S12 11.4\" Powder Blue Mixing Bowl",
    "description": "Stir some colour into your kitchen with the Mason Cash colour mix mixing bowl range. The Mason Cash S12 (29cm) mixing bowl retains the charm of Mason Cash classics whilst bringing a bright, vibrant palette to any kitchen. Made from chip resistant earthenware",
    "rating": 4.6,
    "feature_bullets": [
      "Chip resistant fine stoneware mixing bowl from Mason Cash, the bakeware experts",
      "Traditional, distinctive patterned exterior helps grip the bowl when mixing",
      "Bowl counters the tendency to move during manual mixing",
      "Bright, vibrant colour palette - stir some colour into your kitchen",
      "Dishwasher and microwave safe, bowl diameter: 29 cm, height: 14 cm"
    ],
    "specifications": {
      "Product Dimensions": "11.42 x 11.42 x 5.51 inches",
      "Item Weight": "1.32 pounds",
      "Manufacturer": "Mason Cash",
      "ASIN": "B01IHVCHKO",
      "Item model number": "2001.834",
      "Customer Reviews": "4.6 out of 5 stars137 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#56,356 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 2, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Bakeware",
      "Kitchen & Dining",
      "Mixing Bowls"
    ],
    "price": 39.95
  }
}