{
  "website_summaries": [
    {
      "verdict": "A decent wall-mounted set with endless configuration options and room for 2 cats to lounge. However, the included installation hardware leaves a lot to be desired.",
      "pros": [
        "Comes with a plush hammock, enclosed cat condo, and 2 floating posts",
        "Sisal covering satisfies scratching instincts",
        "Takes care of jumping, perching, and sleeping needs",
        "Versatile configuration option",
        "Attractive and stylish",
        "Affordably priced",
        "Easy to install with the right hardware"
      ],
      "cons": [
        "The overall quality isn't quite as good as our other picks",
        "Included screws are too small and flimsy to be useful"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Eh",
      "text": "Had to use my own screws which is no big deal. The ones it came with kept breaking under my impact drill. The hanging hamock type mount was by far the most time consuming one to mount. But it doesnt matter now because after about a week one anchor for the hamock broke off. It was the actual plywood frame that broke. Not the mounting portion.",
      "rating": 2.0,
      "verified": true,
      "author": "Levi",
      "helpful_votes": 144,
      "publication_date": 20170721
    },
    {
      "title": "Great product mount in the studs!!!",
      "text": "My advise—find the studs, drill holes for the screws, do not cut corners or it will not mount corrdtly or sturdy!! Don’t get frustrated and the finished product will be great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Claire C.",
      "helpful_votes": 88,
      "publication_date": 20171104
    },
    {
      "title": "Loves it/ but broke",
      "text": "My cat loves the top hammock, she sleeps in it every night and day🐯. It was very hard to hang, and would swing against the wall, despite us trying to prevent that , we were unable to get it to sit flush. unfortunately I noticed it starting to come off the wall, and the left “arm broke.” She’s very upset we took it down, we were afraid she would fall in the middle of night. Help! She’s yelling at me cause it’s not up there!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 51,
      "publication_date": 20171018
    },
    {
      "title": "Simply purrrrfect!",
      "text": "My cat loves this thing! We used other screws though, the ones that came with it broke off in the wall.... But with stronger screws it works purrrrfectly!(:",
      "rating": 5.0,
      "verified": true,
      "author": "Syn.foREVer.a7x",
      "helpful_votes": 38,
      "publication_date": 20170718
    },
    {
      "title": "Trixie has excellent customer service!",
      "text": "I had to get a handyman to install so didn't realize until after the return window closed that the hammock is broken. The side where you attach the arm is particle board and broke. However, I contact Trixie products direct and within minutes they responded and have a replacement coming! Great customer service!! I did get the other 3 pieces installed and my Mini loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "eileenlacosta",
      "helpful_votes": 34,
      "publication_date": 20170803
    },
    {
      "title": "My cats both love these!",
      "text": "Finding the studs in the wall is the hardest part of this. Took some time to assemble, spent a lot of time planning where to put it. My cats both love these!",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Edward Robinson",
      "helpful_votes": 22,
      "publication_date": 20170222
    },
    {
      "title": "Hard to use",
      "text": "More difficult to put onto walls and heavy. Need heavy anchors and into studs",
      "rating": 2.0,
      "verified": true,
      "author": "Krisryry",
      "helpful_votes": 21,
      "publication_date": 20170417
    },
    {
      "title": "Tremendously underwhelmed",
      "text": "Aside from dropping almost $10 within a week post-purchase, this is a product worth half of what it cost. Usable and disappointing poitning at the same time. The fabrics are cheap and did not properly line up (as pictured) and the scratching bits are plastic, not sisal, and already loose on the posts. The instructions for install leave A LOT to be desired. We installed, and used sturdier screws as my carpal-tunnel riddled hands were definitely able to bend the supplied screws. It is unfortunate because the space-friendly pet furniture department is sorely lacking in supply and variety. I was excited, and I am tremendously underwhelmed.",
      "rating": 2.0,
      "verified": true,
      "author": "Briar",
      "helpful_votes": 4,
      "publication_date": 20190103
    },
    {
      "title": "don't waste your money or time",
      "text": "flimsy, pain in the butt to install, smells like chemicals, and cats don't even like it. they went in it two times over the course of the month i had it up. i finally just took it down because it stunk and the cats weren't interested. there is nothing good to say about this thing at all. waste of time and money. oh, and the reason everyone keeps posting that the enclosed hardware breaks is not actually because the screws are flimsy - it's because the instructions tell you to drill way too small of a pilot hole.",
      "rating": 1.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 6,
      "publication_date": 20180430
    },
    {
      "title": "so I'll update in a few weeks based on how the kitties like it. Product is solid",
      "text": "I'm in the middle of hanging this up, so I'll update in a few weeks based on how the kitties like it. Product is solid, soft, and visually appealing. HOWEVER it lost a star for coming with the cheapest screws to hang this with that I've ever worked with. Make sure you have your own screws on hand, an entire afternoon, and patience. I now have 3 broken screws imbedded in my wall...guess that's a \"future me\" problem. Hopefully my cats don't find the hammock too unsteady, time will tell.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 7,
      "publication_date": 20170730
    },
    {
      "title": "If you hate legible directions this is for you.",
      "text": "I have no idea of the sturdiness of these wall cat ledges because i opened the box the instructions were almost incomprehensible. The instructions don’t give you enough information to set them up properly, and there isn’t enough information provided to know the best way to set them up (height, which wall, which direction they have to face, ect.). Maybe it was just me. But I was not at all satisfied with this product and returned it. I couldn’t get it to stay in the studs in my wall and my power drill almost broke one of the screws. I am sure there are better ones elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessi",
      "helpful_votes": 2,
      "publication_date": 20200302
    },
    {
      "title": "I'd buy it again!!!",
      "text": "Reviews are correct that it is a little difficult to put up. Grab some of your own anchors and screws, they broke when we used the screws they gave us. The price is great.. if you think it's expensive then you clearly have not shopped for cat furniture. This thing gets 5 stars because my cat LOVES it, and that fool is a picky. I love that he loves it and we all live in a happier home. It's less of an eyesore than I thought (I thought it was gonna be pretty hideous and was also unhappy there wasn't a black version). Compared to a huge cat tree or bulky cat house, I'll take this because it's less space.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 4,
      "publication_date": 20180302
    },
    {
      "title": "Screws are crap, hammock is crap, this is crap",
      "text": "After reading reviews, it seems that EVERYONE has had issues with the screws provided being cheap, breakable, CRAP. The only thing wrong with the product that I found was the hammock. In fact, I didn’t get to even check if the screws worked or not, because the hammock handle broke in my hands after being bumped with the slightest pressure (no, seriously, a pencil requires more pressure to snap than this piece of crap). The other items are fine as far as I can tell, but the hammock is cheap crap. Please fix your product or take it off the market so cats everywhere can be safe from falling off the freaking wall mid-nap.",
      "rating": 2.0,
      "verified": true,
      "author": "Caylie",
      "helpful_votes": 3,
      "publication_date": 20190518
    },
    {
      "title": "Great product for an exceptional price",
      "text": "My cats absolutely love their new wall furniture! It’s incredibly well made and the colors look very clean on my wall. I would have easily paid double for this. They love crawling in the cubby and jumping to the hammock. They’ve also stopped scratching my carpet and now strengthen their claws in the scratching parts of this furniture instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Nerissa E Jack",
      "helpful_votes": 6,
      "publication_date": 20171113
    },
    {
      "title": "The product itself was good other than the fact that you have to screw ...",
      "text": "The product itself was good other than the fact that you have to screw the mounts into the back of the hammock piece and since it's fabric, the pieces will rotate while you're drilling the holes in. Also, every single one of the screws that I tried to use that came with the product broke off either inside of my studs, or in the back of the hammock so unless you have your own stud screws, you're not gonna have a fun time putting this up.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 7,
      "publication_date": 20170717
    },
    {
      "title": "Worth the money",
      "text": "It was ok. Cat didn't like jumping on or standing on round ones thought, would of preferred flat ones. She liked the cave mostly. It's solid & sturdy & Installation fairly easy but be prepared for somewhat large holes in walls for screws. I recommend situating the hammock lower than the round jumping step as my mine (even though she loves heights) didn't want to jump up into a loose fabric that she couldn't see into. She didn't use it till I lowered it below other pieces. Don't space too far apart.",
      "rating": 3.0,
      "verified": true,
      "author": "Paula Bero",
      "helpful_votes": 8,
      "publication_date": 20170909
    },
    {
      "title": "Difficult to mount, but amazing once it's done!",
      "text": "As others have mentioned, this wall-mounted cat tree is a total pain to mount because of the detailed measurements that are required. What's more, you should definitely replace the provided screws with sturdier ones, as I also had some break in the wall studs. Some complained about the sturdiness of the hammock, so I opted to mount a perch leg almost at the same level as the hammock, so my cat wouldn't over-leverage one side of the hammock over the other. Basically, he can walk onto the hammock arms, rather than jump onto it. No issues so far with my ~9lb cat, and he still uses it every day! Love the design as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Rediculous \"Instructions\"",
      "text": "For anyone familiar with Ikea assembly instructions needing a bit of creative interpretation skills and an eye for detail, this is WAY worse. Not only are instructions for assembling the different items only ONE step, they sgould have included a drilling template but none are provided. I'm quite used to measuring to install wall art, shelves, etc, but this was so rediculous that my husband and I desided it wasn't worth the time or effort so we're returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Lil Wheeze loves her new play area!",
      "text": "The product was surprisingly sturdy but like most users had commented I ended up using some longer, stronger screws to mount the hardware. Since my home was built before code the studs were not 16\" spaced like the pre-drilled holes in the large \"dome\" piece so I drilled some of my own holes to run vertically instead of horizontally. It works just the same. The kitties love both the soft and \"rough\" carpet areas of the cat unit. Highly recommend for someone wanting to add new and exciting heights to their cat's play area. I have found that she has become a bit more relaxed and loves more often now, but maybe that's the catnip.",
      "rating": 5.0,
      "verified": true,
      "author": "Verified Prime Member",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Don't waste your money.",
      "text": "Creative designs, that were poorly executed on. Shoddy materials made this unable to support cats. Thankfully, I didn't have it high on the wall. Instructions are completely unhelpful. Now I have huge holes in my walls for a product that broke in an hour. Very disappointed in this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly HAYS",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "Exercise and Napping Spot- nice product",
      "text": "Great buy. My cat gets exercise jumping on it, and naps on it frequently. I put things on the top for him to knock down- like those little plastic springs he loves. He doesn’t go inside the little fort thought. Assembly wasn’t super easy - you have to find studs for big ones. For small ones I suggest using dry wall screws that have a plastic piece you can screw in with electric screwdriver. Then you drill screw into that.",
      "rating": 5.0,
      "verified": true,
      "author": "Nalts",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Incredible product with many customizable options",
      "text": "I cannot keep my two cats off of it also as a suggestion the hammock that comes with it, a suggestion the hammock that comes with this I made a slight little incision on the back end which is not visible and I took out a small heating pad that came with a window mount perch for a cat and I inserted it it in the hammock now the hammock is heated and both of them sleep on it and struggle who's going to get the most room wonderful product!",
      "rating": 5.0,
      "verified": true,
      "author": "TOM THUMB",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "All paws up!",
      "text": "We have 3 kitty cats and all three LOVE this set! Each piece in this set is study as hell and we had no issue with trusting it with them after we installed them (which was an initial concern since these are literally the only version of kitty wall jungles we found in this price range). If you've been looking for something like this you know most are 4-5 times more expensive than this set....I truly can't imagine they are any more durable or trustworthy than these are. Zero regrets....we all love them SO MUCH!",
      "rating": 5.0,
      "verified": true,
      "author": "Kitty Turner",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Sturdy and adorable..",
      "text": "This is soo cute. My cat loved it before I even had it on the wall.. seems VERY sturdy. After reading a few reviews and checking for wall studs I simply got an anchor kit from home depot for $7 and made install much easier.. i havent had it long enough for the hammock to break but even if the sides fall it sounds like the customer service is decent. I never used the screws given and only used the anchors and had 1 part of the install hit a stud and used my own drywall screws for that. Everything seems VERY sturdy..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Great cat shelves, bad screws.",
      "text": "My cats love these shelves to climb on, and they look nice on the walls. Good value for the price and I would recommend. Take heed of the product reviews though. The screws that come with it are very brittle. First one I tried to use snapped. You need to buy your own screws. After all, you want your precious kitties to be safe. The disappointing thing is that I would think Trixie Pet Products would want your cats to be safe too.",
      "rating": 3.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "easy to hang",
      "text": "Quality product, easy to hang, very reasonably priced! My sphynx cat loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Mundy",
      "helpful_votes": 9,
      "publication_date": 20170926
    },
    {
      "title": "amazing!!!",
      "text": "I have 5 inside cats, two of whom were playing on this set right away!",
      "rating": 5.0,
      "verified": true,
      "author": "C Evans",
      "helpful_votes": 6,
      "publication_date": 20170718
    },
    {
      "title": "Cheap cheap cheap cheap cheap!",
      "text": "First the screws that came with it are complete garbage! You need to buy your own quality screws. Then the hammock is so cheap if you barely put any pressure on it it the whole thing sags and will surely break. Do not waste your money on this or the screws.",
      "rating": 1.0,
      "verified": true,
      "author": "Qasim Badshah",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Very nice Wall Hammock and Wall Cubby with Wall Steps!",
      "text": "This product is a great value especially for this price. I have 2 adult cats. The kitty pictured is our heaviest around 18lbs and this hammock holds her very well! My husband did use more heavy duty screws than the ones that came with the set just to be safe and we have had no issues at all in the 3 months they have been up. Very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "BLC",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Cost Saving in the WRONG areas",
      "text": "All of the screws just broke in half while screwing it into the wall...so after we get our own, decent, screws it may be great. But currently it is sitting in the box because they sent the cheapest screws possible with it. Cute design and idea...hopefully it will be great when we do get it up.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20170509
    },
    {
      "title": "This might be one of my favorite things I have bought for my cat",
      "text": "This might be one of my favorite things I have bought for my cat! He loves the hammock especially and will nap in the enclosed pod when it's too bright out during the day. Very easy to install if you use the right tools (MEASURE). The carpet material has unraveled slightly from the posts, but that can just be cut off. This purchase was extremely worth it and super durable. Get it if you're even thinking about it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "Absolutly Fabulous! Kitties love it!",
      "text": "Great for the price takes a little skill to attach to wall. Our kitties love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170918
    },
    {
      "title": "Nice and Sturdy!",
      "text": "Would love to report that my kitties love them but they don't even climb on them! Little creeps just ignore the shelves and use their towers. Maybe someday they'll realize they are allowed to climb on these shelves but right now they're a no-go. They are well-made and sturdy and after a swear-fest went on the wall with hubby's help in a snap. I recommend these shelves for your little furry divas.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill H.",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Garbage. The screws broke under a basic household drill",
      "text": "Garbage. The screws broke under a basic household drill. The holes are very hard to line up and you have to get the brackets just right on the edges of the studs or it will fall off. Horrible design. Fabric felt comfy so I guess that's the only plus.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel BosticTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20171226
    },
    {
      "title": "Sturdy but not aligned with wall studs on condo section",
      "text": "Sturdy but not aligned with wall studs on condo section, to mount it safely, you will have to drill a hole closer to the other mounting holes to gain safe stud alignment. On the hammock portion, the direct wall mount has to be put in width wise to accept the hammock backboard, problem is that the wall stud is not wide enough to accept the two screws safely. You will have to use a template to the wall stud center and then put the direct wall mount to the template and use more screws. More work to install than you may originally think, but better to do it safely!",
      "rating": 3.0,
      "verified": true,
      "author": "techdudealltheway",
      "helpful_votes": 2,
      "publication_date": 20171120
    },
    {
      "title": "Take your time and do it right",
      "text": "If you use new screws, 2\" long #6 dry wall screws and 5/8\" long #6 to replace the screws that come in the package and screw everything into the studs, this is a great playground for your cat. If you cut corners, use the screws that come with it, don't attach the pieces to studs, you'll be like everyone else on this review list that's complaining. Do it the right way and you'll have a safe place for your cat to exercise and enjoy their time. My one concern is the longevity of the hammock. But Lucy is only 7 pounds, it will hold up for her and she has had a great time on all of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Good product, crappy instructions & screws",
      "text": "I bought this for my cat and as my husband and I were using the screws that came with the product in to the product itself and the wall and about every other screw broke. They were very cheaply made and broke by us jus using a screwdriver. The actual cat house that attaches to the wall seem to be built in good quality but the tools and instructions where not helpful. The instructions need to be more detailed and make sure you have a stud finder and that your studs are 16 inches apart. I ended up using heavy duty nails and it seems to work just as good.",
      "rating": 3.0,
      "verified": true,
      "author": "M & S Loyd",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Buy your own quality screwes",
      "text": "Ok the screws suck. They are not quality for installation into a stud! But otherwisemy cats have fun. And it hasn’t fallen in my head, although I did buy screws at Home Depot after two broke in the wall even after predriling! Only thing so wish I got it when the cats weren’t kittens. I got two sets and just left one hammock down. Other than the screws well built I was missing parts to a set for the wall mount the sent them right away.",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Awesome cat wall.",
      "text": "It is made very well and my kitties love it. It was a little challenging to put up, as the instructions were not written well. You definitely need a drill and to put it into the studs of the wall. After installed it is super sturdy and awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Smith",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Worth checking out!",
      "text": "I don’t know who liked it more... my cat or me. I’ve seen other reviews saying that the tools it came with and the hammock weren’t sturdy but I did not feel that way about them. I think you should order it and see for yourself. I believe there are free returns! I bought this because my mom won’t let me have my cat in the house so she’s always in my room and there’s not enough floor space to ’catify’ my room. This is a perfect solution for that! so she won’t get bored. The assembly is pretty straightforward I had no problem with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alondra Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "So far the best...feline review",
      "text": "My felines favorite. On my second hammock. Unfortunately I had to buy another entire set because my hammock broke. I did not contact the company. My cat is small and and active. The whole set is great. Very sturdy. Hopefully this hammock is more resilient as it’s the most loved.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole M",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Missing parts, screws they send with product are too small to safely use",
      "text": "Just opened this up to put it up and it’s missing parts to it. And the screws they sent won’t even hold up the items safely with a cat. Had to buy our own screws and anchors. And nobody had contacted me from this company about the missing parts.",
      "rating": 1.0,
      "verified": true,
      "author": "Rustell",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Don't buy, save your money!",
      "text": "I would give it zero stars but it doesn't let me. The hardware is not correct for wall mounting at all and the materials for the shelves is poorly made. I wish I took the bad reviews into consideration but I was happy to get my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Prince",
      "helpful_votes": 2,
      "publication_date": 20180802
    },
    {
      "title": "Share your home with your cats!",
      "text": "My cats love it. Got these to help get them get up to reclaim their territory after we brought a dog home, and also I've always wanted to \"catify\" my home. They're very comfortable up high and love jumping back and forth.",
      "rating": 5.0,
      "verified": true,
      "author": "ae102",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Cats LOVE the piece with the hole",
      "text": "Cats LOVE the piece with the hole,they don't love the sling, but overall I like how much less room these take up on the wall than the cat tree I had there in the corner. STRONGLY recommend using hardware that is from the store rather than what's included. My husband is a handy guy and made sure to use more reinforcements.",
      "rating": 4.0,
      "verified": true,
      "author": "Kai",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "The backing of the hammock stayed on the wall just fine, but the pole bent and broke",
      "text": "Arrived quickly. A little tricky to hang, especially the hammock and house but not impossible. We are actually on our second set because of the hammock breaking. The backing of the hammock stayed on the wall just fine, but the pole bent and broke; that being said our cats fight for the spot on it so my guess is that happened when the weight of two cats was on it. The other pieces have stayed up, and held up great. I wouldn't recommend the hammock for larger cats, but the other pieces work fine for our larger boy. They really love it and use it everyday. Its a good escape for them to get away from our dogs!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Wuebbenhorst",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Cheap hardwares",
      "text": "The screws that came with this are complete garbage! 3 of them snapped when I'm trying to install the first piece, with pre-drilled holes. The diagrams also think the studs are facing wide side towards the wall, when it's the narrow side of studs that are usually facing the wall in most US houses.",
      "rating": 2.0,
      "verified": true,
      "author": "YL",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "This is a great sturdy product",
      "text": "This is a great sturdy product..however the instructions are just pictures and dosnt lable all of the nuts and bolts so instead of taking 20 minutes it's been hours and I havnt even attached it to the damn wall yet. Meanwhile my cat is laying in the bed so she definetly likes it..and i cant wait till i figure out how tobget it put together",
      "rating": 2.0,
      "verified": true,
      "author": "jessie",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Poor quality. You get what you pay for.",
      "text": "You get what you pay for. The quality is poor. They won't last long. My cat loves the shelves though. The directions/instructions were missing, however, the equipment and pieces were all there. There is one small flyer that came with the package where they ask that you contact them in the event that the instructions are missing due to the numerous stages of packaging this product goes through, so I guess it's a common issue which has yet to be resolved. With that being said, it's not too difficult to hang. My husband was able to figure it out without the instructions.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Must find wall studs",
      "text": "Fairly simple to assemble, finding wall studs was the most difficult part. They attach firmly to the wall, enough for my cats to jump from one to another.",
      "rating": 5.0,
      "verified": true,
      "author": "Deadly Discord",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "the spacing on the mounting holes isn't quite perfect for mounting to a regular 16 inch off center ...",
      "text": "the spacing on the mounting holes isn't quite perfect for mounting to a regular 16 inch off center stud layout and required the use of drywall anchors (that weren't included), but overall the cats enjoy the lounging surfaces and use them regularly.",
      "rating": 4.0,
      "verified": true,
      "author": "J.Cyr",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Cats like it but buy your own hardware",
      "text": "Cat loves the finished product but the other reviews are correct- difficult to set up and the hardware this comes with is trash! We had to go buy our own anchors/screws after several broke in the wall and immediately had parts fall off the wall on 1st use. With better screws it works just fine, but I'm lowering my review since the cost to me was more because of this company's decision to cheap out on the hardware. Plus I had to put extra holes in my walls because of them. Not cool for an already $50 product! Should be $20 or less based on quality/ease to set up alone.",
      "rating": 2.0,
      "verified": true,
      "author": "Nick Arredondo",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "screws suck",
      "text": "the screws that come with the kit suck. one actually broke off in our wall and we've been having a hard time getting it out. we bought our own screws and they handle pretty well. now the only challenge is getting our cat to actually start using this item",
      "rating": 2.0,
      "verified": true,
      "author": "Nicholas Lee",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "So glad i decided to get this for my boys!",
      "text": "I love this set up it looks great with my home and both my cat's love it and so far after two weeks of having it up its holding very well. the hammock is nice and strong it holds both my boys when they are fighting over who gets to sleep their. on is 13 lbs and the other is 10 lbs so pretty satisfied with this. think the only complaint i have is it needs two hammocks instead of one for my house any ways.... oh and even my ferret loves it just a heads up for ppl with ferrets also..",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle Joyce",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Kitty love",
      "text": "My cat absolutely loves it I have yet to put the hammock up but everytime I try to put it up she already tries to jump into it",
      "rating": 5.0,
      "verified": true,
      "author": "Karma",
      "helpful_votes": 3,
      "publication_date": 20171109
    },
    {
      "title": "Excellent quality!",
      "text": "Nice quality, well made and my cat loves it. larger the I expected but in a good way. Ordered other things and it is had to tell the actual size fron the pic. This is as shown in pictures on Amazon. Very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "product is fine - installation parts are BAD",
      "text": "The product itself is fine - but it's not assembled well and the parts that were sent for mounting are VERY cheap. 2 screws have sheared off in the wall damaging the wall requiring my husband to hunt and find different ways of installing it for my son to have the cats in his room. He's been working 2 hours and has only 1 of the 4 pieces mounted because the others keep coming apart and my husband is generally a handy guy at these things",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Queens of the Wall Jungle",
      "text": "These wall mounted beds/jungle gym is so cute, and the girls took a liking to it immediately! I couldn’t get it put up fast enough before they were rubbing all over the soft fabric and hiding out inside the hut. The one piece that mounts to the wall for the hammock is designed in such a way that it’s a bit hard to install, however other than, instillation was straight forward and simple as could be! Super satisfied with this purchase and feel it was a great value for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori Goodwin",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Need better instructions.",
      "text": "I got this product and will definitely have to get help with the installation. I was trying to find more detailed instructions, (since the sheet that came with it is very basic). Under the description and details above, it states that the item NOW comes with more detailed instructions. Well, just saying, if the ones I received are detailed, I would hate to see the previous ones. I will update this review once I have it installed.",
      "rating": 4.0,
      "verified": true,
      "author": "Elaine Green",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Good for the money",
      "text": "Didn’t like the hooks on the back of the hammock. Difficult to install; in the end we just put up a 10x2 and nailed it to that and then screwed that into the studs which was much easier",
      "rating": 3.0,
      "verified": true,
      "author": "Marisha",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Made a tree dweller out of a bush dweller.",
      "text": "Our cats love it! The hammock was harder for us to install because we didn’t have the correct tools but we got it done 😊👍",
      "rating": 5.0,
      "verified": true,
      "author": "Kaydee and Angela",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "pretty good product. Cheap screws",
      "text": "doesn't use the screws it comes with they either snap when trying to put them in the wall or fall out from the pressure of the product. Had to use dry wall screws, and put extra screws through the cubby into the wall to make it stay due to its weight. The hammock and post were fine with just drywall screws.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex Barton",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Outstanding customer service",
      "text": "Milo our cat is a very active boy and this gives him something to do rather than cause trouble. We had trouble with one piece cracking on install but the customer service was very prompt and immediately shipped out a replacement for us. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Fender",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Instructions are poorly written",
      "text": "The instructions were horrible & felt more like a pictogram. It should be written more in detail especially distances to install them & explain the type of hardware you include & what type of hardware someone would need if they have something other than wallboard walls.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia C.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Too heavy",
      "text": "Too heavy for the wall - was impossible to even hold up long enough to screw it into the wall. Returned this item for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 2,
      "publication_date": 20171109
    },
    {
      "title": "I wouldn’t recommend to my family",
      "text": "Nice set up but takes a stud finder and a couple hours to hang. My cats had trouble navigating the posts, so I didn’t use them. The cats jump from a cat tower to the nearer large piece",
      "rating": 2.0,
      "verified": true,
      "author": "elle",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Hammack is Easily Breakable",
      "text": "The product itself is nice and sturdy but it's made out of press board so the hammack part breaks super easily. I'm going to have to fix it with some actual wood which is very disappointing because of how much it was.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlie ",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Quality product.",
      "text": "Instructions were really lousy. But I absolutely love the sturdiness of it all and how many options I had for setting it up. I know for a fact three of my friends have ordered the same unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Rhonda Brandon",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Pretty and functional",
      "text": "These are beautiful and well made. My cats, Daisy and Indy, love them. Daisy likes to sleep in the box and Indy uses the hammock. They provide excercise and a great place to scratch. They were slightly difficult to put together. The instructions could be much better, but all in all I like them and think they were worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Osoyani",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Cat loves it!",
      "text": "Bought two of these and installed them above the doorways, Kitty loves all parts of the system and stares down upon her dominion. Side note: You might want to buy your own drywall plugs though the ones that come with the kit are not the greatest.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Replace screws",
      "text": "I love the look of these wall mounts! They are really nicely made and my cat loves the felt. I did replace the screws after reading some reviews on them being weak and I agree because when I took them out of the bag, they were way too thin for it to be able to hold up the weight of my cat and the mounts. Looks beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Isabel",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Ok",
      "text": "Cute idea. Was so excited for this product. But my cats don't use it.",
      "rating": 2.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Great value",
      "text": "Very easy to put together and install. Use a stud finder or it will rip out, as anything would. This product was well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Know your tools!",
      "text": "This cat wall is amazing it looks good in the home, the quality of the pieces are good it’s safe. But assembling this thing is a nightmare. The directions aren’t really clear, but that’s ok because it’s getting it on the wall that’s the problem. It took more than 4 hours with two people. It’s worth the time but if you’re not handy it will sit on a shelf forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Get your own screws",
      "text": "You need to buy actual dry wall screws for this. And you need a stud finder. All screws that came with the product broke off in my wall upon installation.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura S.",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Love it",
      "text": "Works great and sturdy. Used the screws given and they did not break. My cats love it and play king of the hill. My female is 6 pounds and my male 10 pounds. Don't know what it's like for heavier cats but my cats are very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "rshel douga",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Great product, great value, bad mounting screws",
      "text": "This product is really great value compared to the other cat wall mounts. I would have given it a 5/5 if they provided real screws. You will have to go to home depot or your local hardware stores to buy screws that dont break while screwing into wall studs. The rest of the hardware works besides the screws.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Cunningham",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Really works.",
      "text": "My cats love it. Only problem is the sling is almost worn out after about a year.",
      "rating": 5.0,
      "verified": true,
      "author": "jeneane zant",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "cats love it",
      "text": "Great Price! Used anchors for a more sturdy mount, which I recommend. Ended up screwing through the hammock piece because it was not very sturdy. With a few modification its perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "loginix",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "So far so good!",
      "text": "Screws that came with my set seem very sturdy and of good quality. Straightforward installation and easy for my old fella to use! We are both very happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Newkirk",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "The product is pretty cheap, especially the hardware they send with it",
      "text": "The product is pretty cheap, especially the hardware they send with it. So cheap that they leave a note in the box saying that they may break. Once you get it up it looks cool, but it is mostly made of cardboard and is a little flimsy",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Likeable",
      "text": "My cats loved it at first but don't use it that much but it is still up on the wall in my Apartment and they get on it ever now and then.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce Howard",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "My cats love these climbers on the wall",
      "text": "My cats love these climbers on the wall, and it's a wonderful stimulation for them! Definitely use a stud finder though when mounting the wall brackets. The Instructions call for one, and I missed that the first time. Poor kitty took a small tumble, but all is well, and now that they are mounted properly, everything is purr-fect!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna Mueller",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "10/10",
      "text": "You can’t pass up. My cat not only love it. But I’ve got a wall I don’t have to decorate bc of this 😂 haha it’s amazing tho. The cats love the hammock and jump in the top cubby all the time. Would definitely recommend. My cats are both about 10 lbs and it holds just fine. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Felicia Eldridge",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Cats love it",
      "text": "the directions are kind of a joke but you can figure it out, I hired a handy man to put it up for me after I missed the first stud. The cats love it and that's what is important.",
      "rating": 4.0,
      "verified": true,
      "author": "C. hock",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Super awesome!",
      "text": "This is heavy duty and pretty durable! My cat LOVES the little hidey-hole portion. It is heavy so I would ensure its mounted into at least one stud. The hammock isnt super sturdy for heavier cats. But super cute and comfy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Kerr",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Product seems fine, a slight challenge to install",
      "text": "Product seems fine, a slight challenge to install, weight doesn’t seem to be an issue, we have a quite large cat, but he doesn’t like it for some reason. We also bought a cat tree for him, and he doesn’t like it either.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah F.",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Great fun for my kitten!",
      "text": "I absolutely love this thing. It wasn't hard to mount at all, my kitten took a minute to learn how to jump up on it, but once she did she went crazy running and jumping and climbing! And she loves hiding in the little cubby!",
      "rating": 5.0,
      "verified": true,
      "author": "Debi",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Wish my cats love it as much as I do",
      "text": "Product is nice, hammock kind of flimsy and my cats are scare of it. Other than that is a nice product.",
      "rating": 4.0,
      "verified": true,
      "author": "Ondina",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "My cat loves it",
      "text": "A little tricky mounting them since you need to make sure they are in a stud. But it was well worth it. My girl loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Shel",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Great product !",
      "text": "Great product ! We didn’t use the enclosed hardware - it took several hours to get it on the wall, but looks good, quality product , and my kitty loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindeee",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Cats love it",
      "text": "No instructions came with it but used the box as an idea. Seen that the hammock would fall apart and probably won’t if they sent the extra fasteners like everything else is put on the wall with instead of the hook on fasteners. Did not hang the hammock but the cats love it.",
      "rating": 4.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Invest in a stud finder and all is golden",
      "text": "My little Kitty Boy loves his set up! It’s his favorite place to be, Specifically the hammock. I wish there was a way to secure the hammock down. Sometimes my boy ends up missing his step into the hammock because it slides slightly to the front leaving a gap in the back",
      "rating": 5.0,
      "verified": true,
      "author": "Demi",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Great Product",
      "text": "Awesome cat wall items for a great price. Highly suggest.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Marlar",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Cats are not use to them yet",
      "text": "Just got these up the cat's are getting use to them. One of my cats is big and I'm not sure he likes it. He led it before we hung them lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Phillips",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "No instructions and no Hardware was included",
      "text": "I'm giving this product a one-star for now. The product looks like it's going to be great for my cats but there was no instructions or hardware in the box. So I'm not even sure how to mount it or put it together.",
      "rating": 1.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 2,
      "publication_date": 20171104
    },
    {
      "title": "Wall space",
      "text": "A lot larger than I thought. Make sure you have the wall space",
      "rating": 4.0,
      "verified": true,
      "author": "Kristin Taylor",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "When it arrived it the board was stripped and screws missing",
      "text": "I was so excited for this! Waited over a week for it to arrive then come to assemble and it’s missing screws and a completely stripped hammock pole. I’m frustrated and angry. This looked cute.",
      "rating": 1.0,
      "verified": true,
      "author": "Brianna M Carter",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Took some work but worth it.",
      "text": "The instructions were relatively easy to follow and all the pieces were provided. The studs for my wall were thinner then expected so that made it hard installing one of the pieces. Overall, a great product. My cats loved it even while I was installing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Clark",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "The floor likes it best",
      "text": "The contraption is to heavy for the hooks you receive, mine fell off the wall, and the screws wouldn't fit. Therefore, not able to use it.",
      "rating": 1.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20190317
    }
  ],
  "product_meta": {
    "title": "Trixie Pet Products Wall-Mounted Cat Lounging Set",
    "description": "Wall-mounted systems are the latest in cat tree design. This great space-saving lounging set is ideal for small or modern spaces. More importantly, cats will love the ability to explore new heights with two perches, a plush lined Condo and ultra-plush hammock. Each item is also wrapped with natural, durable sisal to engage your frisky feline. Mix and match to create the perfect solution. Plush lined Condo with removable cushion that can be machine wash, gentle cycle (16.5 x 11 x 11.25 inches). hammock (22.75 x 11 x 12.75 inches). step (7 x 7 x 8.5 inches). rear side of each item covered with plush. Assembly and installation required. All hardware included. Color: cream/Gray. Materials: plush, sisal, carb-certified mdf Wood, metal.",
    "rating": 4.3,
    "feature_bullets": [
      "Includes 2 steps, Condo and hammock",
      "Covered with plush",
      "Sisal scratching surfaces. Measurements: Step - 7 dia × 8.5 in. Condo - 18.75 × 11 × 11.25",
      "Mounts securely between 12\" and 16\" wall studs, hardware included",
      "Now with improved hardware set and extended instructions",
      "CARB Phase II Compliant"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "22.75 x 11 x 12.75 inches; 13.22 Pounds",
      "Item model number": "49923",
      "Date First Available": "July 16, 2016",
      "Manufacturer": "Trixie Pet Products",
      "ASIN": "B01IK50RLI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Cat Trees & Condos",
      "Pet Supplies",
      "Beds & Furniture",
      "Cat Houses & Condos",
      "Cats"
    ],
    "price": 59.66
  }
}