{
  "website_summaries": [
    {
      "verdict": "Minimalist shoe, low-top design, constructed of a canvas upper and rubber, skid-free sole.",
      "pros": [
        "Lightweight, and stylish for wearing during training or for more casual recreation",
        "The canvas upper lets feet breathe, along with interior cotton lining for further sweat absorption",
        "The sole is very flexible, made from non-chemical, non-oily material",
        "The bottom of shoe has flexible grooves to prevent skidding and increase stability",
        "All this at a dramatically lower price than most others!"
      ],
      "cons": [
        "Few complaints, but some buyers said they were sent the wrong size shoes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "He says they work great. For this price",
      "text": "I bought these for my 13 yr-old son who does parkour several times a week. He says they work great. For this price, I am going to buy a few more.",
      "rating": 5.0,
      "verified": true,
      "author": "HLSC",
      "helpful_votes": 10,
      "publication_date": 20180605
    },
    {
      "title": "True to size, and very comfortable!",
      "text": "Awesome pair of shoes. They fit true to size and very very comfortable. I'd be actually interested in maybe even ordering 2-3 more pairs just to have on hand when these wear out. I'm curious how long they will last... That's the last criteria I have for these before I jump on more, but I'm using them as minimal shoes to do workouts and walk around in, so I'm hoping to squeeze out at least 6 months. I remember buying the tiger claw shoes when I was younger maybe 10-15 years ago and these are miles better in initial feel. However, those grew on me in time so I'm hoping these will also continue to be awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "kman",
      "helpful_votes": 3,
      "publication_date": 20180409
    },
    {
      "title": "Perfect for marrtial arts, perfect for me...",
      "text": "Inexpensive and great fit with a wider toe box than some similar shoes I've tried. For martial arts, the soles are grippy and flexible with excellent groundfeel. I'm not particularly stylish, but these shoes have received several compliments. They look great to me as well and appear competently made. I can see owning many more pairs in the years ahead; these are some of the best I've found.",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn Harbor",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Perfect shoes for Tai Chi",
      "text": "I bought a pair of blue shoes to use during my Tai Chi classes. They are comfortable, have enough room for the toes, and the sole is very flexible. When I started using them, I noticed that the grip on the floor tiles was not too good. As time goes by it it better.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen B",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Awesome shoes , awesome look",
      "text": "I put 3 stars for support cause you don’t buy these shoes for support, they have zero support , that’s the whole point . But I absolutely love these shoes and they look nice as hell . Just don’t expect to walk around Disney world all day in these without feeling the effects .",
      "rating": 5.0,
      "verified": true,
      "author": "Kluntor Boogie",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Awesome lightweight shoe",
      "text": "Awesome lightweight shoes for summer and traveling! Look awesome with shorts or jeans. Fine for walking around the museum or farmer’s market. Not a lot of arch support (not what the show is meant for) so no hiking! Can easily fit a thin sole insert if needed. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "RYandNIN",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Better than I expected",
      "text": "I was looking for a cheap pair of shoes to just run to the store or casual use. These were a good choice. I have a very long foot, but I’m also flat footed so it hard to find shoes that fit well. These fit great. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Noexit",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "+.5 size esp if you have Morton's toe, very tight",
      "text": "I've worn around town a few times, and to the gym since I purchased a month ago. I like the \"barefoot but protected\" feeling they give. good traction wet and dry. If they end up lasting close to a year, I would buy again, but definitely go up half a size.",
      "rating": 4.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Ok",
      "text": "The shoes are OK, I need to give the a bit more testing opportunity but they Re just OK, I had to put in an Insole, and because of the making of the body of the shoe, I can't really make hard stops it feels like my foot will leave the shoe",
      "rating": 4.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great!",
      "text": "Very light and comfortable. Fits well *edit* I’ve had these for months now, and they’re still holding up great. I’ve even gone hiking and climbed a few trees with these and they’re still doing great.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Good for Dojo, Good for Casual Wear",
      "text": "These have always been a favorite of mine, in and out of the dojo. Not the most high end shoe in the world, but well made, lightweight, and gives great feedback to the floor of the dojo (nice grip on wooden and carpeted floors). Lately, been wearing them as casual shoes with a pair of jeans and I think the look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Larose",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Get a Pair",
      "text": "Great looking sneaker, very comfortable!!! People have asked if they are Vans or \"what brand are those?\"",
      "rating": 5.0,
      "verified": true,
      "author": "Harold Torres",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "One Star",
      "text": "If I wanted this poor of a quality product, I would have just made them myself.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "True to size",
      "text": "I was concerned that the fit would not be correct, but, no problem with thin silk socks. They have the right balance of grip and slip. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Warren Schrick",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Five Stars",
      "text": "cool shoes, and they don't stick to dojo mats like some other shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "joe miller",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "I was looking for a nice lightweight shoe to workout in that wouldn’t break the ...",
      "text": "I was looking for a nice lightweight shoe to workout in that wouldn’t break the bank, and that’s what these are! Actually they are nice enough that I’ve been wearing them everyday not just at the gym, would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary K. Blaisdell",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Great shoes but beware",
      "text": "Great shoes.. Liked the style. Had to return, however, because there was a rip on one of the heels. Return process was easy though. Took shoes to the nearest Kohls and return was surprisingly painless.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Good deal.",
      "text": "Adjusted to my wide foot very quickly despite feeling small first two times I wore them. I think they are a brighter blue then I anticipated.",
      "rating": 4.0,
      "verified": true,
      "author": "Anon User",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Comfortable minimal sole shoes",
      "text": "These shoes are comfortable and have a minimalistic sole. It helps that they were inexpensive. Just what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Crowell",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Going Ninja at the gym",
      "text": "Love them, agile and perfect for the gym. I suggest go half or one full size up though.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "My parkour kid loves them.",
      "text": "Real flexible and grippy. Good quality for the price Perfect for my 10yr old doing parkour",
      "rating": 5.0,
      "verified": true,
      "author": "greg",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Lace eyelet fell out immediately",
      "text": "Poor quality control. Very comfortable, though. I wish they were higher quality. I ended up getting New Balance Minimus for 2x the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Riely",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Surprisingly comfortable.",
      "text": "Find these both comfortable and some cushin in there! I took tape measure and measured my foot from big toe to heal rounding larger than smaller. Fit's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe joe",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Excellent would buy again.",
      "text": "Comfy shoes fits my 8\" American perfectly it's quite wide which I like. I use it for just waking about in addition to working out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Comfortable, stylish",
      "text": "Comfortable, stylish, minimal, and cheap. Received multiple compliments in the office I worked the first day I wore them, and I would tell anyone who listened, \"THEY WERE 19 BUCKS!\" Very comfy as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Rowland",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "Overall these are great for my kung fu training",
      "text": "I liked the cunstruction and the overall feel during training. The only issue I had was that when I recieved them the sole on the right shoe was detached. I had to glue it together.",
      "rating": 4.0,
      "verified": true,
      "author": "Gutiecutie",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Five Stars",
      "text": "great minimalist style shoes. Fit is exact, colors really pop, great for working out on a padded surface",
      "rating": 5.0,
      "verified": true,
      "author": "Brian E. Thompson",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Nice shoes",
      "text": "The size is correct and the shoes are comfortable. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "G.H.",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Excellent bang for the buck!",
      "text": "Nice training shoes, excellent price, well constructed and good looking as well. Can’t go wrong with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "It is nicely done anyways",
      "text": "It doesn't fit 43, it was around 41 instead. It didn't fit. It is nicely done anyways.",
      "rating": 3.0,
      "verified": true,
      "author": "Inknochen",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Five Stars",
      "text": "Love these shoes. Much like Feiyues but a sturdy sole.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam E Wentworth",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "They fit well and feel good!",
      "text": "Bought these for indoor training and now all of our students are buying them. They fit well and feel good!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Five Stars",
      "text": "Exactly what I thought I'd be getting, plus prompt service!",
      "rating": 5.0,
      "verified": true,
      "author": "James Douglas",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "smaller fit then expected.",
      "text": "flexible with great grip. I did not like how after a few days the logo was detached and the front of the shoe was slightly unglued. overall very comfortable for my movement training and martial arts",
      "rating": 4.0,
      "verified": true,
      "author": "Solomon Fitt",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Garbage product. They fit just fine",
      "text": "Garbage product. They fit just fine, but once I started using them something kept cutting into the top of my foot. I removed them time and again to inspect what ot could be and I can only conclude that it's the metal lace vents digging thru the tongue. Provided zero arch support and were painful after 20 mins of use.",
      "rating": 2.0,
      "verified": true,
      "author": "Dan F.",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "I mean yeah, they're great!",
      "text": "Better than i imagined!! I have wider feet so im skeptical of online ordering but these seem to fit pretty well! They're super comfy and very light weight. Im using them for weight training and stuff and these are more comfortable than my 120$ cross trainers. Ive only used these one day so far for working out so im not sure how long theyll last, but hey even if it's just a couple months i think it is worth it! Part of the adhesive on the toe isnt stuck all the way but it seems more cosmetic than anything. For sure recommend these though",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Weis",
      "helpful_votes": 2,
      "publication_date": 20170201
    }
  ],
  "product_meta": {
    "title": "DOUBLESTAR MR Rubber Sole Light Parkour Stylish Shoes for Men/Women/Children|Kung Fu|Martial Art|Tai Chi Jogging Training Sneaker",
    "description": "This model is the best choice for beginers who learn Kung Fu, Tai Chi, material art and Paukour trainning. \nAntiskid:These canvas shoes with top grade rubber soles are 100% antiskid, which could ensure your safety when trainning. \nLightwight: Less than 300g per shoe. the canvas are breathable, the shoes could help feel every step when practicing. \nHigh Quality: This is the most classical mode of Doublestar, we manufactured and sold thousands of these shoes, so the quality is verified by the market, so is the price. \nUltra 6 Series involes 6 new features of Doublestar sport shoes.You'll enjoy the soft lining and cushioned, memory-foam sole. Outsoles with our technology boast a flexible, lightweight design.\nThis sporty shoe features accents on the breathable mesh upper as well as on the sole for a fun and distinctive look.\n\nAbout Doublestar\nDoublestar is the earliest shoes manufacturer in China. Our first factory was founded in 1921 at Qingdao, Shandong, China. Over the years, Doublestar became known for making athletic footwear, with the demand of our shoes gone up, Doublestar became our dominate brand, and we are now one of the largest shoe manufacturers in China with more than 40 production lines.\n\nToday, we offer a variety of footwear choices,such as soccer shoes, casual sneaker, walking shoes and Kung Fu shoes.\n\nWith our revolutionary rubber processing technology, our shoes are popular among outdoors for the high quality soles.",
    "rating": 4.4,
    "feature_bullets": [
      "1.【PROFESSIONAL FEATURES SHOE】We choose the better shoe materials, especially on fiber and rubber sole, to make it more durable suitable, flexible and breathable while keeping its lightweight and slipper-less. It is excellent for it can give your feet a better sense of balance and shoeless feelings,bring excellent groundfeel and good grip offer you a great experience to make everything possible.",
      "2.【HANDCRAFT UPGRADE EXCELLENT DETAILS】A breathable upper has used the Durable woven canvas fabric,also bring good ductility for wide feet.An arch support insole provides sweat shock-absorbing,soft cotton shoe lining protect your foot better,reducing the risk of injury in training.",
      "3.【SIMPLIFIED YET BEYOND SIMPLICITY】We find that perfect point,at first the materials we have chosen have to ensure the comfortable and durable by the fully considered of the amount of exercise and we have used the unique technique of 2 times bonding during the process of the sole.the One-step synthesis technique has been used in the final process to ensure the shoe perfectly fit on your feet no matter what kind of movement.",
      "4.【SEE WHAT OUR CUSTOMER HAVE TO SAY】\"They are very light and flexibleThe construction is good....\" \"Awesome pair of shoes. They fit true to size and very very comfortable...\" \"All in all, that look cool, I definitely get a lot of compliments on them, and people asking where to find them. Another good point is the price very cheap...\" \"Inexpensive and great fit with a wider toe box than some similar shoes I've tried. For martial arts, the soles are grippy and flexible with excellent groundfeel",
      "5.【RREPLACEMENT GUARANTEED】 To how confidence we are in our Kung Fu shoes,we offer 3 months money back guarantee with every purchase!if you not satisfied with our productswe will refound your purchase with no exception!"
    ],
    "specifications": {
      "Department": "Womens",
      "Date First Available": "April 10, 2018",
      "Manufacturer": "DOUBLESTAR MR",
      "ASIN": "B07C2RQ128",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Martial Arts",
      "Sports & Outdoors",
      "Protective Gear",
      "Sports & Fitness",
      "Foot Gear"
    ],
    "price": 27.5
  }
}