{
  "website_summaries": [
    {
      "verdict": "A classic-style rotating waffle maker that's fun to flip and produces reliable, crisp, extra-deep waffles.",
      "pros": [
        "Crisp waffles with a timer light that tells you when they're done",
        "Produces large Belgian-style waffles with extra-deep pockets for toppings"
      ],
      "cons": [
        "Some users wish the waffle iron beeped when the waffles are ready",
        "Taller size takes up more space than a rectangle design"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "DEFECTIVE PRODUCT",
      "text": "On first use, the plate and teflon coating melted and attached to the waffle, creating a noxious, toxic odor.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle B.",
      "helpful_votes": 234,
      "publication_date": 20171001
    },
    {
      "title": "It didn't last a year",
      "text": "Well, for the first few months it made great waffles. You can adjust the temperature to make them as crispy as you like. We probably use it once or twice a month, so not exactly industrial use. Then it broke (literally fell apart during use) and now we are waffle-less. The plastic broke off at the hinge at the back where it attaches to the base, the bearing and spring fell out. I'm so disappointed because I thought for the money and the brand name it would last a long time.",
      "rating": 1.0,
      "verified": true,
      "author": "Natalie P.",
      "helpful_votes": 59,
      "publication_date": 20180924
    },
    {
      "title": "Great product for the money.",
      "text": "Works great on the first run, this waffle was done on 4.5 dial setting, probably go to 5.5 next time, it was done, but felt a little spongy, Used the Krusteaz Belgium waffle mix, I picked up at Walmart for about 3.00 a box 28oz size Next time I will fill the cup up that come with it all the way to the top, I was a couple tablespoons short. Wish it had an on off switch, otherwise works & cleans easy with wet paper towel.",
      "rating": 5.0,
      "verified": true,
      "author": "J. L. Byfield",
      "helpful_votes": 44,
      "publication_date": 20180914
    },
    {
      "title": "loveing it",
      "text": "THIS IS AMAZING !!!! Cheaper here than in the store. I bought this for my girlfriends father and he’s waffle crazy! He’s tried different type of waffle makers but he’s has always returned them. This one is super easy and really easy to clean. You can control how much you won’t it to heat and it works AMAZING!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 26,
      "publication_date": 20171015
    },
    {
      "title": "cuisinart waf-f10, not bad for price",
      "text": "Purchased this as a gift. My wife loves making waffles at hotels that have the flip style waffle makers. I thought she can now make them at home, and our old waffle maker stopped working. She likes it, it makes descent sized waffles and easy to use. I don't really like that it's kind of bulky and you can't remove griddles for cleaning, but most you can't. Not the easiest to clean, but as long as you spray non stick on it, it's not to bad to clean. Overall we are happy with it for the price we paid for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Btim3",
      "helpful_votes": 32,
      "publication_date": 20170507
    },
    {
      "title": "What you see is what you get",
      "text": "We love our new waffle maker! We have used it almost every other day since Christmas. Its super easy to use and makes the waffles perfectly every time. I like mine more fluffy where as my husband likes his with a little crisp and the machine does both quickly. We can have our waffles exactly how we like them and still sit down at the table together. It is big and bulky so you need room for storage but if you use it often like us then the counter space is just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna Beeson",
      "helpful_votes": 11,
      "publication_date": 20190103
    },
    {
      "title": "Made in CHINA and Said Made in America",
      "text": "Very disappointed because I searched Amazon for \"Waffle Makers Made in America\" and this one came up. Liked the product because we had one before, but never looked to see where it was made. Cuisinart products \"Use to be\" Made in America, but I guess not now... Won't be trusting Amazon's \"Made in America\" returns anymore. BTW: the Cuisinart website doesn't say where these products are made anymore. Guess they know were looking for \"Made in America\" too so their hiding where their products are really made... Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph W. Record",
      "helpful_votes": 6,
      "publication_date": 20200514
    },
    {
      "title": "Junk plastic construction",
      "text": "Used it 1x month for 12 months & worked great then it fell apart. Plastic broke and whole thing just fell apart. $45 for a years worth of good waffles? Meh. Would not buy again",
      "rating": 1.0,
      "verified": true,
      "author": "Nick & Sydney Grove",
      "helpful_votes": 11,
      "publication_date": 20190524
    },
    {
      "title": "Waffle Time Is All The Time",
      "text": "Got this for my Mother in laws birthday and she freaking loved it! She told me its really easy to use and easy to clean so that's a huge bonus. the only thing i would recommend is probably not putting butter directly on it to grease it because when she did the waffle fell apart, so the best thing to do would not to use anything on it before putting the mix in. It also comes with a spill tray for extra protection, which is also super handy and easy to clean as well. I've been hinting hard at my boyfriend to get us one for my birthday this year because it works so well!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole W.",
      "helpful_votes": 4,
      "publication_date": 20200406
    },
    {
      "title": "Works Well - Great Price Point",
      "text": "Nice the waffle maker flips just as higher end products do. Cooks evenly and cleans up easily. Not much more to say as it works as expected and is easy to use. Tip: use batter or recipes for Belgian Waffles rather than for plain waffles as they will not come out fluffy with crispy exterior.",
      "rating": 4.0,
      "verified": true,
      "author": "KateAtTheBeach",
      "helpful_votes": 20,
      "publication_date": 20180228
    },
    {
      "title": "Absolutely wonderful! Great quality!",
      "text": "Works flawlessly! Non stick coating works marvelously! Temp control works as it should. The only thing I would have changed is instead of watching for the light (when turned) to turn on. I would like an audible beep to indicate when the waffle is done. Other than that! Very much enjoy Saturday waffle day!",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Stevenson",
      "helpful_votes": 5,
      "publication_date": 20200217
    },
    {
      "title": "Cheaply made",
      "text": "This waffle maker was on the more expensive side, so I thought it would be more durable. I clean it and store it in all its packaging after every use. Somehow thought, a year later, with no blunt trama, the hinge plastic broke off. The wires are now exposed. Pretty disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 11,
      "publication_date": 20181113
    },
    {
      "title": "Light use only",
      "text": "2nd time using the waffle maker, the Handel cradle broke and the unit stopped heating up.",
      "rating": 1.0,
      "verified": true,
      "author": "Gerald Maxwell",
      "helpful_votes": 14,
      "publication_date": 20170907
    },
    {
      "title": "Why change a design for the worse?",
      "text": "My old waffle maker was great but died. I thought I was buying the same model but: 1) new one does not power off, you have to unplug 2) no beep! forget waffle and end up with a smoky ruin Will have to return, too much to do in the kitchen, can't afford to stay watching waffle until is done.",
      "rating": 3.0,
      "verified": true,
      "author": "Janele",
      "helpful_votes": 3,
      "publication_date": 20190303
    },
    {
      "title": "It works. Could be better.",
      "text": "Well, this model is ok, but seems like they cut a few corners. No bell or audible sound when it's ready, just a blue light. Also, no on/off switch. So, remember to unplug it when you're done. And, it seems to cook a bit uneven in spots. I've had other Cuisinart waffle makers that I would easily give 5 stars, but this is really a 3 and a half star product overall. It is priced less than other models, so if this is what's in your budget, go for it. It works... just beware of the points I mentioned above.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191025
    },
    {
      "title": "Wish the hot pads came out.",
      "text": "I wish the hot pads could come out for cleaning. It’s hard to clean and I have small fingered that can get into the crevices easily. It takes forever to get everything cleaned out of it. But the was of use in other places is wonderful. It heats up fast and it cooks fast too. The light is very accurate for everything I’ve tried so far which is frozen regular waffles to hash brown waffles. It browns the hash browns perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Chorrace",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Doesn't distribute the batter or cook evenly",
      "text": "Seemed like a nice design, but after using it several times now I'm not happy with it. The batter doesn't distribute evenly and it doesn't cook evenly, so you get 1/2 of the waffle cooked nicely, but the other half is not full and doesn't cook properly. I've used the included measuring cup and even added more batter to see if that helps. Batter will ooze out the sides instead of keeping a full waffle all around. It works, but there are much better units out there for the money. I'll be buying another brand to replace this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Wiseman",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Best Waffle maker We've Bought",
      "text": "So we're going on 40 years together which means 40 years of waffle making. This is not our first waffle by any means out will be out last (and not because we're old). I'm guessing it's our 6ht or 7th waffles maker and it's easily the best. Now that we have one that's works consistently and cooks an even waffle, we're using it far more than we ever did with the less good makers.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie & Rob",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Great waffle maker",
      "text": "Yummy waffles! This waffle maker is super easy to use. If you follow the directions, it makes a perfect waffle. I had to play with the temperature control a little to get them to the right level of brown for me (4.5). Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "dholc",
      "helpful_votes": 2,
      "publication_date": 20200107
    },
    {
      "title": "3 year warranty",
      "text": "3 year warranty with proof of purchase. It did not burn my waffles but I also didn't wait for the blue light. I think if I did, they would have burned....which means it gets hot. That is all I care about. Not hot means the waffles will stick and that is hard to clean. Waffles came out perfect! Advice from a waffle maker veteran...always use oil for every waffle...and waffle mix. Unless you want to be picking off stuck-on burnt waffle. Also, cooked bacon + waffle batter = Bacon waffles",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Fair to middlin'",
      "text": "Wanted a Black and Decker of the same type. It was half the price but unavailable from worthy sources. This one has a hot spot of about the middle 3 to 4 inches. I have only used once and perhaps if I ignor the \"ready to use\" idiot light and let it thoroughly warm through for say 15 minutes or more, it will even out. The Black and Decker did not have this problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Perry McCullough",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Cooks unevenly",
      "text": "I had a waffle maker by another brand that was discontinued so I bought this one when I moved. This one cooks the waffles really unevenly. Parts are burned while other parts are still not all the way cooked. I wish I'd returned it after the first time I used it.",
      "rating": 1.0,
      "verified": true,
      "author": "magpie",
      "helpful_votes": 6,
      "publication_date": 20180904
    },
    {
      "title": "Fun, well made waffle maker.",
      "text": "Who doesn’t want the experience of a hotel waffle maker in their home kitchen? Our kiddos love making waffles when we travel so we decided to order them own for home. This waffle maker has great temperature controls and a nice sized drip tray to making the cooking process a breeze. Our only setback is that the trays aren’t removable which makes cleaning the machine more difficult. The maker also comes with a measuring cup so you don’t have to risk over filling the maker. It’s a great buy and a fun appliance for our kitchen.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerszewski Family",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Not a Quality Product",
      "text": "I honestly didn't like it at all. It felt cheap out of the box. It does not have a solid foundation and you can't really tell if the temperature control actually works because it's so lose it nearly spins. So you have to keep checking to see if it's the right golden brown color. I gave it away and bought a much better one from Target.",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle Hargenrader",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great waffles",
      "text": "Great waffle maker, especially for those of us who have to make gluten free waffles. Flipping the waffle maker makes for a beautiful, well cooked waffle on both sides. I would have given it a 5 stars except that I have had to replace my waffle maker 2 times. Hopefully this third one will last more than 2-3 years. I got my first one when it was a Waring Waffle Maker. The second and now this third one are Cuisinart (Model # same as the Waring). Another unfortunate part is that none of them had an audible sound when the waffle is done, a light just lights when done.",
      "rating": 4.0,
      "verified": true,
      "author": "Naomi",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Teflon Grates, Very Janky.",
      "text": "I was excited to try this until I found that it has Teflon coated grates. Additionally, the overall build quality is very unrefined. It feels like a $7 waffle Iron that likely won't last a year. That's just a guess. We ended up purchasing one with Ceramic Grates and it makes the best waffles we've ever eaten.",
      "rating": 1.0,
      "verified": true,
      "author": "Ether",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Perfect waffle maker for any kitchen.",
      "text": "Glad I bought it, temp settings vary when using different ingredients. i.e. Almond flour vs White flour. But it's not a deal breaker. Glad I bought it. Makes perfect waffles. Not very easy to clean, but only residue was left over non-stick spray",
      "rating": 4.0,
      "verified": true,
      "author": "MikeWeezer",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Handle and turning hinge broken",
      "text": "This grill part of the waffle maker works fine. I like the drip tray that sits on the bottom. However, the handle broke off within a month of purchase and the back piece that contains the turning mechanism broke a couple of weeks later. In both cases it was the plastic surrounding the screws that hold it together that broke apart, rendering this machine useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel Konderla",
      "helpful_votes": 2,
      "publication_date": 20200707
    },
    {
      "title": "Very good waffle maker",
      "text": "I am impressed with this very affordable waffle maker. It is light weight, is easy to clean and due to the temperature control button the waffles come out perfectly. I had a much more expensive Waring before and this one works as well as the Waring did. I can wholeheartedly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Beate O.",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Great waffles every time",
      "text": "This is a great product especially for the price. Pretty easy to clean and stores well. It heats evenly and has so far stayed true to temp, haven’t burned anything. The only complaint I have is that the painted sides are all peeling and chipping. Like I only used it once and the black started crumbling off. I haven’t used any weird products on it to clean so that was kind of unexpected. It doesn’t hurt the integrity of the unit, but now it looks aged and I’ve only had it for (4) months. Used it about 5-6 times.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine Reding/Trevor Brown",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Very disappointed",
      "text": "Just a regular waffle maker, works like a $10 would. The waffles do not come out like describes. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "jonathan d. lonsdale",
      "helpful_votes": 2,
      "publication_date": 20191221
    },
    {
      "title": "Difficult to clean but delicious waffles and easy to use",
      "text": "Just bought this a few months ago. I've used it only for a few weekends- so take my opinion with a grain of salt. I cannot speak to how well this waffle maker holds up over time. Overall easy to use and cooks waffles well, consistently and symmetrically. however wish that it came with some sort of clean attachment or recommendations for cleaning. Don't like the thought of old oil sitting in the waffle maker and getting on my new fresh waffles (although I haven't noticed any issues with taste as I continue to make waffles).",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Great Waffle Maker!",
      "text": "We are a couple that just loves waffles! So we decided to start making them from scratch at home. We love this Cusiniart waffle maker. It is very easy tonise, makes a the waffle nicely crisp on the outside but soft and fluffy on the inside! The only downside is that the plates aren't removable so it can take a bit to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Buttercakies",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Decent for the price",
      "text": "Pros: Works Cons: Cheap plastic feel. No on/off switch; you have to plug/unplug the cord. No sound to alert you when it's done. You have to keep an eye out for a light.",
      "rating": 3.0,
      "verified": true,
      "author": "John H.",
      "helpful_votes": 2,
      "publication_date": 20191111
    },
    {
      "title": "poor quality",
      "text": "It's ok but not as described. It has no sound alarm to let you know when the waffle is done. and it seems to be cheaply made. I would not buy it abain",
      "rating": 3.0,
      "verified": true,
      "author": "Karen Adams",
      "helpful_votes": 6,
      "publication_date": 20171119
    },
    {
      "title": "Awesome Waffles!",
      "text": "This thing is legit. It makes waffle making very easy. Just turn it over and it lets you know when you’re done. The heat settings make it nice too because I like them semi crispy and my gf likes them very crispy. Would purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Stef",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Badass waffles",
      "text": "This is so badass! If you love waffles and are an idiot, this is the machine for you. Put the batter in, flip, wait for some light and your the house hero!",
      "rating": 5.0,
      "verified": true,
      "author": "DSD",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Great Belgian waffles!",
      "text": "I use the basic waffle recipe by Bisquik, and it works great in this unit. It's very easy to make lightly toasted waffles, but if you like very dark and very crispy waffles, this doesn't seem to get hot enough. Very easy to use, clean up is no problem, and I can make 8 waffles in ~10 minutes.",
      "rating": 4.0,
      "verified": true,
      "author": "chiquitita230",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Awesome Belgian waffle maker",
      "text": "This was a gift for our son and he mentioned how easy it was to clean. It wasn’t too large for his limited counter space. It makes the perfect Belgian waffles.",
      "rating": 5.0,
      "verified": true,
      "author": "Micheal HyNote Ranalla",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Makes great tasting crispy waffles, however!",
      "text": "Took longer to arrive than originally expected. Well packaged. The pre heat light and the done light do not work from the first use. Box already thrown away, so we decided to use a timer to time pre heat and 5 minutes baking time instead of dealing with the haste of trying to return the waffle iron.",
      "rating": 3.0,
      "verified": true,
      "author": "Mountain Person",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "The perfect waffle maker",
      "text": "The best waffle maker I have had. Very easy to clean, even on areas that are not “non-stick “. Being able to flip the waffle before you take it out makes it much easier to remove it does not stick. I have been using it for about a month and have not made a waffle that was Bert or undercooked. They come out perfect every time.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Wimberly",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Perfect waffle maker",
      "text": "Very easy to use and cleanup is super easy. As long as you don't overflow the waffle maker the top and bottom are practically clean when you are done. You will want to wash them just to be sure of course. Big and powerful enough to make large waffles, yet small enough to still fit in a cupboard when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Adams",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great waffle maker",
      "text": "We use this AL THE TIME. I got it for my fiancé for Christmas and we have waffle dinner nights every other week or so. It’s still working great and makes amazing waffles! The waffles are big with deep pockets and the indicator light makes it super simple to get the right temp.",
      "rating": 5.0,
      "verified": true,
      "author": "Mia bergstrom",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Stopped working after first batch of waffles.",
      "text": "I really wanted to like this item. But unfortunately, it stopped working after we made our first batch of waffles. We plugged it back in and the power light did not come kn and it did not try to heat. Will be returning this.",
      "rating": 1.0,
      "verified": true,
      "author": "ELStiko",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Easy to use, super easy cleanup",
      "text": "A+ purchase! Super easy clean up, we used it daily for a few months! “Until everyone was tired of waffles” great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Worst thing that I purchased for Christmas",
      "text": "Not recommended for anyone. Very bad product. We just used it to make one waffle and during the second one the power was off and the whole thing was not working. Waste us a lot of time to tried to figure out but it never turn on again. Stay away from this product if you don’t want to wast your time and money as well as energy . Now cannot return since I bought it in December and had no time to use it.",
      "rating": 1.0,
      "verified": true,
      "author": "Yan Ping zhao",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Very good product!",
      "text": "Very well packaged. Delivered on time. Is a very good quality and you can see it straight from the packaging. Looks nice, feels nice, easy to clean, get used to te temperature to get what you want and voila!! Fantastic waffles!",
      "rating": 5.0,
      "verified": true,
      "author": "pacapo23",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Help!!",
      "text": "The product description mislead me to believe it was a double waffle maker. I order a lot on Amazon and need to return this one. Please reconsider the 30 day return policy just this once!",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Wayland",
      "helpful_votes": 3,
      "publication_date": 20190423
    },
    {
      "title": "Great purchase",
      "text": "Easy for anyone to use. It's really cute, now I just have to find the prefect waffle mix that I actually like.",
      "rating": 5.0,
      "verified": true,
      "author": "KLMN",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Mic your batter accordingly it makes all the difference",
      "text": "Well built and easy to use, family of 6 and made everyone happy this morning. First time we used it and everything was perfect. I did let it pre-heat and burn off some of the non-stick chemical as some of the previous comments talked about a bad smell. But after it was burned off everything was perfect....",
      "rating": 5.0,
      "verified": true,
      "author": "javier c.",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Good quality- love it so far!",
      "text": "Great quality. Comes with a little scoop/measure cup so you don’t overfill and waste batter. My husband loves it and makes me waffles every Sunday morning (he’s the best!).",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 2,
      "publication_date": 20180717
    },
    {
      "title": "Solid brand, solid product",
      "text": "Love it, functions exactly as it is supposed to do. I purchased a less-known brand before that and it was not good at all. This is my second Cuisinart waffle maker (first one served 7 years) and it doesn’t disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Elman",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Great product",
      "text": "Great product, easy to use. I get great waffles every time. It easy to clean since it’s almost clean once you are done with cooking:-)",
      "rating": 5.0,
      "verified": true,
      "author": "Mateo471",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Lot's of fun. Happy with purchase!",
      "text": "Works great. Wife needed a life lesson in order to properly operate... She wasn't fully rotating the cooking irons into an inverted position and was instead leaving the irons stand vertical, at a 90 degree angle to the countertops. Surprisingly, the waffles still turned out great and there was no dripping. Laughs were abundant in the household that morning!",
      "rating": 5.0,
      "verified": true,
      "author": "andrew",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Highly recommended",
      "text": "If you like waffles, and don't need more than a few at a time, then I highly recommend this one. My previous waffle maker sucks in comparison. This one is much better! Like that you can rotate it so it's evenly cooked on both sides!",
      "rating": 5.0,
      "verified": true,
      "author": "Shahnawaz Hossain",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Works great. But does suck that it doesn’t have a ...",
      "text": "Works great. But does suck that it doesn’t have a ready Beep Indicator. I personally wish that the tray would not be detachable.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180429
    },
    {
      "title": "Makes the best waffles!",
      "text": "Makes the best waffles. Exactly what I was looking for to make large Belgium style waffles. Easy to use and clean. The measuring cup they provide is great. Really helps to ensure you get just the right amount of batter to avoid spill over.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "We love it",
      "text": "We’ve only used it twice and I can’t seem to figure out why others had issues stating it seemed cheap (plastic handle). It is beyond easy to use and clean. Makes great waffles that everyone, even the pups love.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura H",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Easiest Belgian Waffle Maker Ever!",
      "text": "I love this Belgian Waffle Maker. I have always wanted one but hesitated because I always figured it would be a labor intensive process and messy. Not the case at all. Cuisinart has made a great product with this waffle maker. It heats quickly, browns evenly, and makes perfect waffles every time. Clean up is a cinch and it is now my new favorite kitchen small appliance. Such a luxury to have a Belgian waffle on a weekday. Also great price for this product. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana M. Tyler",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Good waffles, cheap plastic.",
      "text": "Makes decent waffles, but the plastic casing broke after about a year of use.",
      "rating": 3.0,
      "verified": true,
      "author": "Stater",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Easy yet powerful!",
      "text": "Took it out of the box wiped it down. Followed the instructions and voila! Belgian protein waffle with shaved Brussels sprouts, grilled salmon flakes sharp cheddar and herbs. Perfect color, consistent cooking. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "MClay",
      "helpful_votes": 3,
      "publication_date": 20190421
    },
    {
      "title": "Good maker",
      "text": "This waffle maker works pretty good once a few test waffles for preferred Done-ness. The reason for the lowish score is because the tray for catching leftover batter was not included in the shipment. It is an extra $15 for the tray if you buy it from Cuisinart.",
      "rating": 3.0,
      "verified": true,
      "author": "Fred V.",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "It make really great waffles! LOVED IT!",
      "text": "I LOVED it... I used it the very first day that it arrived. I made waffles for the first time! They were amazing! It’s easy to clean. And it only takes a couple of minutes to heat up and as soon as it’s ready pour in the waffle mix the light turns on, you pour it in and flip it over and when it’s ready the light turns back on! I’m very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Yarisa Perez",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Mother’s Day Surprise",
      "text": "Every Mother’s Day I get my mother a hanging plant. With Covid going on I didn’t know if it was going to be possible so I needed a back up plan. My mom LOVES to make breakfast every weekend. My sister thought this would be a good idea and when I tell you she was happy she was like BEYOND HAPPY lol almost cried! She absolutely loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Cleaning isn't the easiest. Good quality.",
      "text": "We have been using this waffle maker regularly. Cleaning isn't always easy, but from the research I did before purchasing it's hard to find one that super easy to clean. This model isn't bad, but sometimes you have to work hard to get in the little nooks.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Clas",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "If I could eat waffles for every meal I would",
      "text": "Why don’t they have more nutritional value? I’ve never had a waffle maker before but I am pretty happy with this one! It is easy to use and supports all of the weird savory waffle recipes I’m trying including stuffing items in them. 👌🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Great gift!!",
      "text": "Bought for my daughter, her kids love the waffles, gave it to her in a large basket, with real maple syrup, butter, nutella, waffle mixes, kitchen towels, beautiful presentation.",
      "rating": 5.0,
      "verified": true,
      "author": "darlenefalardeau",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "The BEST!!!!",
      "text": "My waffle maker is amazing it’s restaurant style waffles all the time my kids love them and if you make too many and you can freeze them pop them back in the toaster! Best waffle maker EVER!",
      "rating": 5.0,
      "verified": true,
      "author": "RN79",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "So easy and so good!",
      "text": "We've had this for 2 weeks now, and let me say this: This waffle maker is amazing! Easy to use, easy to clean, wonderful waffles every time! We set ours to 5, that's the sort of crispy yet fluffy setting we've found works best. The waffles take only a couple of minutes to make and the clean up is amazingly easy, just a little wiping and you're good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Easy to use and sturdy",
      "text": "This waffle maker is super easy to use. The instructions were simple and the waffles turned out great. Just pour the batter in, flip it over, and wait for the light to come on. It’s that easy! The waffles came out perfectly browned and the waffle maker is heavy duty enough so it will not break easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Love this waffle maker",
      "text": "Heats up super fast, easy to clean and easy to use. The waffles are so good. You don't have to make Belgian waffles but those are good as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Prescott",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "All great except no sound",
      "text": "This is a great waffle maker don't get me wrong but expect to be right next to it at all times while your waffle is cooking. There is no sound or beep that lets you know when it is ready. If you are multitasking in the kitchen, it is easy to forget about with no beep which will make for some burnt waffles.",
      "rating": 4.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Easy and fun to use",
      "text": "How did I love without this? I love waffles. this is easy to use and makes perfect waffles every time. Heard up quickly! Also makes fabulous hash browns. Great to have this waffle maker for brunches.",
      "rating": 5.0,
      "verified": true,
      "author": "moorj",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Makes the best waffles",
      "text": "Love it. It makes the best waffles. My grandchildren love it. Be aware, it takes up a lot of space, However, if you eat waffles often, it is worth the space it takes up. My neighbor has two of them.",
      "rating": 5.0,
      "verified": true,
      "author": "John Simolike",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "MAkes the best waffles ever’",
      "text": "Easy to use’. MAkes great waffles that are fluffy and thick. Waffles do not stick to metal grates. Simple clean up. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "JESSICA ",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Great Appliance!!",
      "text": "This Belgian Waffle Maker is a really great! Easy to use! Easy to clean! Non-stick surfaces make it a wonderful addition to our food preparation devices.",
      "rating": 5.0,
      "verified": true,
      "author": "MarMex",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Fantastic!!",
      "text": "Love this waffle maker!! So easy that it basically won’t allow you to screw it up!! 😀. Cleans up with ease as well. So happy I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Abboud",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Never enough waffles",
      "text": "For son’s family. I love mine and they live theirs",
      "rating": 5.0,
      "verified": true,
      "author": "Do It Herself",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Garbage. Avoid. Spend more for something of higher construction quality.",
      "text": "Garbage. I’m possible to make a good waffle on. Heat setting is basically 0 to 100. Slop or brown crisp. The thing broke after five uses. The housing that holds the pivot arm broke. It still works but it’s a few twists away from falling apart. I just missed the window to return this heap to Amazon for a refund. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymouse",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Meh.  Hoped for more from Cuisinart",
      "text": "Easy to use, but inconsistent browning. I expected more from Cuisinart. I know it wouldn’t produce commercial results, but hoped for better browning. Maybe someone out there has suggestions for getting even results?",
      "rating": 3.0,
      "verified": true,
      "author": "Christy W.",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Belgian a",
      "text": "This gets used at least once a week. Live this waffle maker",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Our choice for replacement waffle iron, and we like our waffles.",
      "text": "Cooks well, has the flip function we like, and comes with a nice drip pan to keep the counter clean. Happy to have it.",
      "rating": 5.0,
      "verified": true,
      "author": "Keys Cuda",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Good waffle maker",
      "text": "Good waffle maker and easy to use. A little difficult to clean but worth it. Need the heat up pretty high to have a good crisp waffle. Worth the money in my opinion but still searching for the best setting.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer T Clouse",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Professional Quality",
      "text": "We unfortunately left our Belgium waffle maker in Alabama this summer at a family reunion. So we decided to replace the one left at the Lake house. Always count on Cuisinart for the best products!! They make the very best!! Makes perfect waffles!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara West",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Caution you can get burned by the handle",
      "text": "The back side of the handle has metal on it which it's very very hot. So be careful. This waffle iron is also very light weight so it doesn't feel real sturdy. The did cook the waffles just fine though.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Amazing!",
      "text": "We love our new waffle iron. I have made waffles every morning since it arrived. My kids love them and eat a ton. The waffles cook perfectly and are light and fluffy! Such a great way to start the morning or a yummy afternoon snack.",
      "rating": 5.0,
      "verified": true,
      "author": "k1728",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Was what I expected.",
      "text": "Was just as described, and showed up when expected. Would have been nice if it wasnt in the product box and had a separate box, was sitting on my porch letting the world know what it was.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhemarhart",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Works like a charm",
      "text": "Got it for my girlfriend as a birthday present, she said it's better than the one she wanted and has had waffles 3+ days in a row now. I'm going to say it's an all around good product!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "It makes great waffles",
      "text": "Arrived yesterday and cooked waffles this morning, worked great and Waffles came out perfect. easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "BRADLEY E.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Okay waffle maker",
      "text": "This waffle maker is easy to use and makes quick delicious waffles What i disklike is when the mix spill its a bit hard to clean the sides of the circle",
      "rating": 4.0,
      "verified": true,
      "author": "Raffy",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Product is of good quality",
      "text": "My children love this waffle they say it makes waffles Just like the hotels. So far very durable, and of good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Darrell Palmer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "A great product",
      "text": "Love this!!! We are making homemade waffles once a week now! And we can make gluten free also! Why didn’t I get this sooner?",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Peterson",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Best waffles ever!",
      "text": "This makes waffles like you just ordered them from a hotel! We use Trader Joe’s waffle mix and they come out golden brown and perfectly crispy every time! I recommend brushing on vegetable oil before the first waffle instead of using a cooking spray. The spray leaves a build up that can be difficult to get off.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica E.",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Easy and Fun",
      "text": "Super easy to learn how to use! We make waffles every day now. Absolutely love it, highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Hallie",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Perfect waffle maker",
      "text": "This is one of the kitchen tools we bought and very satisfied with. Everything works great and the kids love it too",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Best waffle maker!",
      "text": "I will forever continue to buy this brand of products, from this waffle maker to the oven to the pots and pans I LOVE the quality and durability! Worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Best, easy, worth the money.",
      "text": "I make waffles almost everyday. Makes quality yummy deep waffle perfect to keep syrup inside. Yum",
      "rating": 5.0,
      "verified": true,
      "author": "Reichart",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Easy to use and clean.  Perfect",
      "text": "My grandkids came for New Years. My husband cooked waffles every morning for a week. Kids loved them. After they left. We been eating blueberry waffles ever since!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Impossible to clean",
      "text": "This product is seriously disappointing. It's probably OK for regular waffles but for real Liege waffles with pearl sugar it is next to impossible to clean. It's feels cheaply made and I really wish I had not bought it. Makes a good waffle, but that's not of much use if you don't want to use it because it's a nightmare to clean.",
      "rating": 2.0,
      "verified": true,
      "author": "Wayne Campbell",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Nice waffle maker",
      "text": "Grandma loves to make waffles for the Grandsons. Would like to make two at once, but this one does rebound fast and is ready for another pour very quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Newk",
      "helpful_votes": 0,
      "publication_date": 20190403
    }
  ],
  "product_meta": {
    "title": "Cuisinart WAF-F10 Maker Waffle Iron, Single, Stainless steel",
    "description": "The Cuisinart Belgian Waffle Maker expertly bakes golden, delicious, deep-pocketed waffles in minutes. Just add syrup or fruit and enjoy a luxurious breakfast or special dessert right at home! The easy-to-handle rotary feature flips waffles 180 degrees to ensure even cooking on top and bottom. A 6-setting browning control knob ensures waffles are cooked perfectly, from light and fluffy to crisp and brown. LED lights and audio beep tones indicate when unit is ready to cook and when waffles are done. And the nonstick coating wipes clean for effortless food release, no mess, and easy cleanup. It's the perfect gift or perfect addition to any kitchen! Features: Extra-deep 1 inch restaurant-style waffle|Nonstick coated waffle grids easily release waffles and make cleaning effortless|Easy-to-handle rotary feature for even baking on top and bottom|1000 watts|Browning control knob for custom baking|Blue LED lights indicate when unit is ready for batter and when waffle is done|Brushed stainless steel housing with black base|Limited One Year Warranty",
    "rating": 4.7,
    "feature_bullets": [
      "Creates deep-pocket 1-inch Belgian waffles. Cord length : 36 Inches",
      "Included components: Measuring Cup,Waffle maker unit",
      "1000 watts of power",
      "Handle folds for easy storage"
    ],
    "specifications": {
      "Product Dimensions": "9.75 x 15.63 x 9.63 inches",
      "Item Weight": "7.6 pounds",
      "Manufacturer": "Cuisinart",
      "ASIN": "B01IU7JPT6",
      "Item model number": "WAF-F10P1",
      "Customer Reviews": "4.7 out of 5 stars1,757 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#1,820 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 21, 2016"
    },
    "categories": [
      "Home & Kitchen",
      "Waffle Irons",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": 59.95
  }
}