{
  "website_summaries": [
    {
      "verdict": "A solid board that can stand a lot of abuse at a very good price.",
      "pros": [
        "Low price point for a board that generally holds up well",
        "Quality construction",
        "Light",
        "Good strap",
        "Great customer service from the seller",
        "A good kids' board, but also works well for adults",
        "Fast and works well for a small person",
        "Comes in 4 color options"
      ],
      "cons": [
        "The bottom layer has a tendency to separate when the board goes bad"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "NOT WORTH THE PRICE",
      "text": "I bought this because of the good reviews it has but those must all be fake. The item i received was nowhere near worth the price. The reason I ordered this was because of the quality(turns out there is none). I have nothing against using a cheap body board from CVS ( that's what I ended up buying anyways because I returned this item) but when I am paying a substantial amount for a body board, I expect it to be better quality than the one I bought at the drug store. This material is so cheap. NOT WORTH THE PRICE. this is a great board to use if it was only $10, but not for anything more.",
      "rating": 1.0,
      "verified": true,
      "author": "Inge Frey",
      "helpful_votes": 59,
      "publication_date": 20180711
    },
    {
      "title": "The board held up nicely and the quality was great",
      "text": "I am a 215lb man and went to Daytona beach for 4 days and I rode waves everyday. Several hours at that. The board held up nicely and the quality was great.",
      "rating": 5.0,
      "verified": true,
      "author": "jason baker",
      "helpful_votes": 29,
      "publication_date": 20170614
    },
    {
      "title": "Even held our beverages",
      "text": "Paying as much as I did for the product, I had high expectation. Those expectations were met. This board is solid. It's made of good material and upheld well against much abuse. Took this thing on two beach vacations so far, and there is no sign of deterioration or excessive wear. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Morales",
      "helpful_votes": 21,
      "publication_date": 20170710
    },
    {
      "title": "So disappointed but it was such a pain to get in ...",
      "text": "It was a long and complicated delivery because the first one was \"lost\" somewhere, which I guess happens. Then we get it and bring it to the beach and the FIRST day the bottom plastic part is totally separated from the foam part. So disappointed but it was such a pain to get in the first place so don't even want to begin thinking about replacing it.",
      "rating": 2.0,
      "verified": true,
      "author": "jagfamily6",
      "helpful_votes": 33,
      "publication_date": 20170513
    },
    {
      "title": "Very low quality.",
      "text": "I purchased 2 body boards, one of each size for my son and daughter for a beach vacation. I thought I was purchasing a quality board that could be used for a few seasons as would be reflected in the price. My son used it literally one day and the back plastic veneer came off rendering the board worthless. In hindsight, I would buy the $15 boards at the beach and save the packing.",
      "rating": 1.0,
      "verified": true,
      "author": "Phillip Winglosky",
      "helpful_votes": 14,
      "publication_date": 20180829
    },
    {
      "title": "good quality",
      "text": "I bought this for my 14 year old before spending a week at the beach. This is better quality than a lot of boogie boards, the bottom has a plastic lining which is makes it last longer and seems to \"boogie\" better than the cheaper foam ones we used in the past. I purchased 3, one for each son, and they are all still one piece after 6 full days of use.",
      "rating": 4.0,
      "verified": true,
      "author": "Outdoor lover ",
      "helpful_votes": 11,
      "publication_date": 20180802
    },
    {
      "title": "Durable",
      "text": "Took these on my beach vacation and after a week of hard use and my kids dragging and sitting on them they are still intact. I wont have to purchase new one's for next year so I highly recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "melanie",
      "helpful_votes": 14,
      "publication_date": 20170809
    },
    {
      "title": "Don't wast your money!",
      "text": "This is a nice item but overly priced. I this for my grandson for our Florida vacation. I could have gotten one similar for $8.99. To expensive. Don't waste your money! Buy somewhere else!",
      "rating": 1.0,
      "verified": true,
      "author": "Marinemom",
      "helpful_votes": 5,
      "publication_date": 20190716
    },
    {
      "title": "Junk!",
      "text": "Such a disappointment. For the price I didnt expect it to last less than 4 months. Do NOT buy!",
      "rating": 1.0,
      "verified": true,
      "author": "LR",
      "helpful_votes": 8,
      "publication_date": 20180803
    },
    {
      "title": "PERFECT BOOGIES",
      "text": "FANTASTIC! My hubby and I took this to Zuma beach and had a blast. These boards are wonderful, light, good strap, handle really well on the water due to the smooth bottom. I expect they will last for years to come for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Maren E Haugen",
      "helpful_votes": 8,
      "publication_date": 20170828
    },
    {
      "title": "Didn’t last",
      "text": "Worked great until it fell apart after 2 and a half months with little use.",
      "rating": 1.0,
      "verified": true,
      "author": "emily rand",
      "helpful_votes": 6,
      "publication_date": 20181003
    },
    {
      "title": "lightweight light duty bodyboard for the little ones",
      "text": "Really light, enough so smaller younger kids can handle it. The stiffness is there but I doubt this would be suitable for an adult for regular use more than a season prob bc the foam material that I'm guessing is what ice boxes and cheap surfboards are made from. Kids should be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "CXK",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "NO LEASH!!! -- Very Dangerous! -- False Advertising!",
      "text": "I paid for TWO of these boogie boards, from Bo-Toys, that SAYS in print that it, \"comes with a leash to attach to your wrist\". But there IS NO LEASH WITH EITHER ONE. What kind of seller does this? You can't buy a boogie board, for a 12 year old's birthday present, without a leash. Especially in Hawaii. Leashes can prevent DROWNING. This is very dishonest and even more dangerous. I would not recommend this company, Bo-Toys, and their false advertising, whatsoever!",
      "rating": 1.0,
      "verified": true,
      "author": "VT Hawaii",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "As advertised",
      "text": "7 year old had a blast with it at the beach. Holding up very well so far!",
      "rating": 4.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 2,
      "publication_date": 20200904
    },
    {
      "title": "Solid board for solid fun",
      "text": "This was a purchase for my 6 year old son. He swan in the ocean for ours. Then drug it all over the beach and used it as a sled for collected treasures. The line and the wristband are flimsy. If I can replace that, I will. But he’s happy, so I’m happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Swan",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Careful if wearing a one piece suit.",
      "text": "Board was very functional and did it's job riding the waves on the beach. The only negative is the lime green paint rubbed off on the skin of our daughter. If she had a one piece, that would of been a bummer. The paint easily came off with make up remover.",
      "rating": 4.0,
      "verified": true,
      "author": "JRT lover",
      "helpful_votes": 3,
      "publication_date": 20180729
    },
    {
      "title": "Excellent if you aren't gigantically huge like me",
      "text": "Perfect for a beginner. Must note, if you're taller or heavy like me, you probably won't be catching waves with this model as I'm sitting way low in the water. My friends were able to catch some waves though. My kids also loved taking their turn riding on it. Not sure if it matters, I'm 6'7\" and 340lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Noir Daniels",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Durable plastic bottom-- seems well-built.",
      "text": "This one was much better than another brand I got for my son-- it has a hard plastic bottom that seems durable. The other one I bought for my son had a sticker for the bottom. This board is what I was expecting for the price-- so be careful for others that aren't durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse W",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "No strap",
      "text": "Very upset with this purchase. I promised my child I would get a board before we leave for the beach and specifically checked to make sure it comes with a strap for the board so it wouldn’t float away, upon arrival there was no strap. Extremely disappointing. Will be returning this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "S c ",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Board string ripped right through the board after 10 waves.",
      "text": "I was so excited on my way to the beach to use my new body board. It’s cool looking and seemed durable when I received it, but when I was riding on the board the waves pushed me off. The string ripped right through the board and sliced it almost in half. I only rode about about 10 waves until it did that. These waves were nothing huge, just your regular Venice Beach waves.",
      "rating": 1.0,
      "verified": true,
      "author": "Sterling Toth",
      "helpful_votes": 4,
      "publication_date": 20180729
    },
    {
      "title": "Faded and bad velcro",
      "text": "Updated: Velcro on the strap is not good and is already pretty useless after 4 beach trips. Also the red color has already faded to almost pink. Large bubble now starting on top. Bought a different brand board at the same time and it has no issues after same amount of use. This one was a waste of money sadly.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Hallett",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Bubble's up if left on the beach face up",
      "text": "I purchased 2 boards and both surfaces bubbled up under the heat of the sun. I turned them face down and put them back in the ocean to reduce the bubble, but this isn't something I should have to do if the board is made properly.... Fix your product!!! Buyer beware",
      "rating": 2.0,
      "verified": true,
      "author": "C. Moniz",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "It will dye you green",
      "text": "The green decal wore off on my skin and swim suit when I got it wet. My stomach and arms were green. It had to be scrubbed off and required acetone to finish. Also ruined my swim suit.",
      "rating": 1.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 2,
      "publication_date": 20190621
    },
    {
      "title": "Overpriced",
      "text": "Shortly after purchasing this body board (for $53), I found a VERY comparable one at Academy for $10. And the cheaper one worked great for out beach trip. I can’t speak to the durability or performance for this product because it was returned due to being overpriced.",
      "rating": 2.0,
      "verified": true,
      "author": "LM",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Board works well; strap is flimsy",
      "text": "The board is nice. The problem was that the wrist-strap/leash literally disintegrated after 3-4 uses. I alerted the seller and they were nice enough to send me another wrist-strap/leash. We'll see how long this one lasts.",
      "rating": 3.0,
      "verified": true,
      "author": "Hoonie Kang",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Sturdy, well-constructed board!",
      "text": "I bought this board so my six-year-old daughter could have some fun in the ocean during our recent beach trip. The other family we went with last year had a couple body boards then and I think my daughter felt left out. Well, my daughter didn't use this board much but everyone else did, and it held up much better than the overpriced ones sold at the stores near the beach. Great product! I might buy a bigger one for myself the next time we go to the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 2,
      "publication_date": 20170730
    },
    {
      "title": "DIDN'T LAST A DAY",
      "text": "We have had grocery store boogie boards before - but as our kids get older we were looking for something more solid. So we spend extra money for this body board. Unfortunately, after just a few hours the bottom slick layer separated from the board. Very disappointing. Better off spending $8 on a cheap board - it will last longer.",
      "rating": 1.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 3,
      "publication_date": 20180815
    },
    {
      "title": "Great for 6 year old",
      "text": "Bought this for my 6 year old grandson and he loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Works as expected",
      "text": "Fine for the kids or novices from a quality and performance perspective and reasonably priced.",
      "rating": 4.0,
      "verified": true,
      "author": "cjs",
      "helpful_votes": 2,
      "publication_date": 20190513
    },
    {
      "title": "The most popular pool toy",
      "text": "There is nothing that dissatified us with the board. The grandchildren were waiting day by day for it. They tore open the box, grabbed it and headed for the pool. It's been the most coveted item! It's sturdy and colorful. I only wish I'd ordered more than one. I have 10 grand kids!",
      "rating": 5.0,
      "verified": true,
      "author": "Denise R. Wagner",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Delaminated after only 2 months of occasional use",
      "text": "My son was excited to have a new board. Great looking product, however after 2 months of occasional use it delaminated. Very disappointing especially since we took care of it.",
      "rating": 1.0,
      "verified": true,
      "author": "Sonja T.",
      "helpful_votes": 3,
      "publication_date": 20180619
    },
    {
      "title": "Boogie board for kids",
      "text": "My kids loves using this board in the ocean. I don’t think they came out one time while we were there. I gave the item a 4 for sturdiness and durability because the wrist strap and string that attach to the board were pretty cheap and it ended up with a small chunk taken out of it; however, for the price I really can’t complain too much. It did the job and will be around for next summers beach trips!",
      "rating": 5.0,
      "verified": true,
      "author": "Melysa Fregoni",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Has held up so far",
      "text": "Have used it a bunch on Lake Michigan, so am not using it in salt water. Have definitely put it to use without any signs of deterioration this summer. I know other User experiences have been different, but so far, no signs of coming apart",
      "rating": 5.0,
      "verified": true,
      "author": "Orin",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Worked great for our family",
      "text": "My family took them boogie boarding and they held up nicely. Last year we had purchased generic ones and they all broke by the end of the first day. These were great",
      "rating": 5.0,
      "verified": true,
      "author": "Greg C.",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Beach bonus!!",
      "text": "My four year old is obsessed with his board!! He’s very rambunctious and the board is very sturdy and durable!! It’s so lightweight he can carry it all on his own. This made our beach adventure so much more fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Save your money not worth it",
      "text": "My son is 11 yrs old has only used this board 8-12 times and had it 7.5 months already falling apart. The sides are ripped and it already bent. Do not buy this board.",
      "rating": 1.0,
      "verified": true,
      "author": "MagPie",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Broke on first use",
      "text": "Broke on first use. 5 yr old daughter got about an hour of use out of it before the top half ripped off. She was not rough with it and did not misuse it, it came apart on a routine wave ride.",
      "rating": 1.0,
      "verified": true,
      "author": "pat heddendorf",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Not as durable as it should be for the price",
      "text": "Purchased two of these for our outer banks beach trip. Day 1 of use, 20 minutes in and already there’s a bend on one of them. Paid good money for what I thought seemed to be a good product. Shame.",
      "rating": 1.0,
      "verified": true,
      "author": "NICHOLE",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "This item wont disappoint",
      "text": "Good buy good value. Happy with product Purchased as an up grade to 5 yo who likes to boogie board. The right kind of board makes all the difference. This product filled rhat ticket",
      "rating": 5.0,
      "verified": true,
      "author": "Llara Weaver",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Floats well. Not well made.",
      "text": "It floats well and holds weight well. We’ve had it about a week and only been used 4 times and the wrap on the outside is already bubbling up :/",
      "rating": 3.0,
      "verified": true,
      "author": "Sueseiv",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Super bummed.",
      "text": "There were peeling and cracking within one use. Super bummed.",
      "rating": 1.0,
      "verified": true,
      "author": "P.G.",
      "helpful_votes": 2,
      "publication_date": 20180406
    },
    {
      "title": "Only used it a couple times, but so far, so good!",
      "text": "Great size (it's the pretty much the \"standard\" size for an adult board). Not too expensive. Worked great the 2 or 3 times I used it!",
      "rating": 5.0,
      "verified": true,
      "author": "Romain G.",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great for All Day Ocean Play!",
      "text": "Purchased for my 12 yo grandson for his first trip to the ocean. It was a huge hit for him and both his older sister and younger brother. Great memory maker.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Larck",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Terrible product",
      "text": "only used a couple of times and the backing and sides are peeling off! Tried to glue it back and the styrofoam is little balls so there is nothing solid to adhere it too.....",
      "rating": 1.0,
      "verified": true,
      "author": "Martha Willett",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Terrible Product",
      "text": "So disappointed in this product this was a gift for a 5 year old it lasted 3 used before covering of the styrofoam lifted rendering the board useless. Will never buy from this company again.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Lemieux",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Poorly made product",
      "text": "It is falling apart after 3 uses I bought it for my 7 year old son and the back came off and the sides also peeled off",
      "rating": 1.0,
      "verified": true,
      "author": "william j donohuemets1986",
      "helpful_votes": 2,
      "publication_date": 20190615
    },
    {
      "title": "Didn’t hold up",
      "text": "Just delivered today and within 15 mins at the beach, the strap broke.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Murphy",
      "helpful_votes": 2,
      "publication_date": 20190712
    },
    {
      "title": "The top is all bubbled after one use.",
      "text": "The board is a nice size for my 5 year old, however one week into having it and only one beach trip the top is all bubbles up.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin G Noss",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "The size and weight is great. The strap's velcro makes it easy to stay ...",
      "text": "The size and weight is great. The strap's velcro makes it easy to stay around wrist when in the water. We all used it from our 6-year-old to the adults and we all had fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Chen",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "Great!!",
      "text": "Great product! My kids love it and have so much fun in the water with this! Made very well and worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Dianna Brown",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Could be better",
      "text": "Board started to bubble after a couple of uses. Ended up returning. It was sturdy and fun otherwise.",
      "rating": 3.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Not worth the cost!",
      "text": "This product was definitely not the quality I was expecting! It is the same board that you can buy from Five Below.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Guidry",
      "helpful_votes": 2,
      "publication_date": 20190517
    },
    {
      "title": "Best board for the price",
      "text": "We purchased this board for a week long Family reunion vacation. At the end of the week this board was still in great shape, well after several other types of boards were broke in half. All the kids were rough on the boards, and we didn’t expect any to survive, but we ended up bringing this one home in good shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn R.",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "They love them!",
      "text": "Great body board! Bought 4 of them for Grandkids as Easter gifts...(the Easter Bunny brings them plenty of candy). We just moved to a private lake community and are at the beach several times a week. The boards have held up beautifully even under the 'pressure' of mud fights and general rough housing. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "RAV",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Cheap leash / Poor Quality",
      "text": "Very cheaply made. You can find other boards of higher quality for the same price. Leash is very short and looks like it would fit a 5 year olds wrist. We had to change out the leash and put on an old one from an older board just to be able to use this board.",
      "rating": 1.0,
      "verified": true,
      "author": "J. L. Miller",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Fell apart after 10-12 uses",
      "text": "The boogie board fell apart after about 12 uses. The sides started peeling off after the first week of use last year then the 2nd time we used it last week the top started peeing off. We only go to the beach 1 week per year and this did not even make it through the 2nd trip.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth Savage",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Cracked in half first day",
      "text": "Doesn't catch waves like it should. You should just get another board",
      "rating": 3.0,
      "verified": true,
      "author": "Living and Learning",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Had High Hopes",
      "text": "I had high hopes for this since it was so pricey. After just a few uses, the side strip came off. The board is still usable, I just fear that once the side completely comes off the rest of the board will start coming apart as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelli Sullivan",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Not very durable",
      "text": "My grandson used it less than two weeks and it broke in half.",
      "rating": 2.0,
      "verified": true,
      "author": "SheilaR",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "good product. poor packaging",
      "text": "dislike, I ordered this product bo toys bodyboard. when I received it. it wasn't packaged good at all and the board was damaged. very unsatisfied with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "dave becker",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Light",
      "text": "Nice size fun in the ocean. You do have to be careful where you store them because they will have dents.",
      "rating": 5.0,
      "verified": true,
      "author": "Mare",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Low quality board",
      "text": "Very cheap low-quality board. No handels it's short and it's overpriced. the leash was extremely thin and cheap and didn't survive the first week of waves. Too much hassle to send it back so I'm out $30.",
      "rating": 1.0,
      "verified": true,
      "author": "Rose_NAME_NOT_RETURNED",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Bottom peels away.",
      "text": "Don't bother!!! I bought 3 of these for my kids and after a few times in the ocean the bottom of 2 of them are peeling away.",
      "rating": 1.0,
      "verified": true,
      "author": "James M.",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Very durable!",
      "text": "This body board held up in the ocean for the entirety of our beach trip!",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi Bunch",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Made well but...",
      "text": "Well made but bleached in the sun so now our son who loves red but HATES PINK refuses to use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ethyrea Fan!",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Good size for smaller children K - 4",
      "text": "Solid. Attractive. Good size for smaller children K - 4. (from original 5 stars) Update The bottom of the boogie board peeled off after only 2 days in the ocean waves. Very disappointing since the size was perfect.",
      "rating": 2.0,
      "verified": true,
      "author": "looking for delight",
      "helpful_votes": 2,
      "publication_date": 20170826
    },
    {
      "title": "Fell apart in less than a year - junk",
      "text": "Fell apart in under a year :-( waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Greg ",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "My twin says it rocks around like a boat on the waves",
      "text": "Bought this boogie board for my twin. He loves it and says it rocks on waves like a boat going through water.",
      "rating": 5.0,
      "verified": true,
      "author": "kevin",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "lightweight foam board WAY overpriced",
      "text": "This board is lightweight foam that looks exactly like the cheap ones you get at the drug store. How are they charging so much for this basic board? Way overpriced.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Quality",
      "text": "Grandson used this on his Outer Banks vacation and loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Go",
      "text": "Avoid at all costs. After 7-10 rides in the river, the bottom laminate began to separate and now is fully off. The side laminate began separating at about the same time. It’s useless now. Go elsewhere. Buy another.",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler T. Moran",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Fun, quality, product",
      "text": "Decent price for a quality board. My kids and I love em. My daughter is only 50lbs and uses a 33 in, she can catch the tiniest wave and wide it all the way to the sand. Fun times",
      "rating": 4.0,
      "verified": true,
      "author": "Terrance J.",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Dont buy !",
      "text": "Came damaged dents all over, not in box just in foil so looks allready used before you take off the plastic ! Poor shipment service , paid to much for it. DONT BUY !",
      "rating": 1.0,
      "verified": true,
      "author": "kvh",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "they will come apart",
      "text": "the grandkids left them out in the sun for a couple of days and they came apart at the seams. will try some glue to see if that works.",
      "rating": 3.0,
      "verified": true,
      "author": "David P Zeigler",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Great",
      "text": "Made our trip to the beach great, my kiddo played with it entire time and she is 5'2",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Doesn't last",
      "text": "Do not order this board. It fell apart with one day use at the beach. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Hryb",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Disappointed",
      "text": "Board rides fine but the leash is very poor quality.....leash rendered totally useless after 2nd day at the beach.... wrist strap frayed first day and Velcro would not hold together...this board was a gift for my 4yr old granddaughter....",
      "rating": 2.0,
      "verified": true,
      "author": "FA",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Fun for the beach but the strap broke after 3x use",
      "text": "Fun for the beach but the strap broke after 3x use",
      "rating": 4.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Five Stars",
      "text": "It was actually more sturdy than I was expecting and really light weight. My daughter loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Candace",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Great purchase",
      "text": "Arrived on date stated, packaged securely (wasn't expecting that), color vibrant, sturdy, and held up perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Moore",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Quality for the $",
      "text": "Fast shipping and the product in person is even better in quality than the picture captures;) SoCal Mom (buys a lot of boards)",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin M.",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Don’t buy- paint foam!",
      "text": "Don’t buy!!!This wave board is cheap foam. It arrives with a sticker that says “ don’t place in direct sunlight”. That’s awful- this board is for the beach. It’s porous; it’s foam from a craft store that’s spray painted with a string.",
      "rating": 1.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Did not come with leash",
      "text": "This is a great boogie board but it did not come with a leash like pictured/listed. My kids have already used it otherwise I’d return it. Would be great if amazon or the manufacturer would send a leash.",
      "rating": 1.0,
      "verified": true,
      "author": "jessica anderson",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "junk",
      "text": "Absolute junk. I ordered 2 for my 2 boys age 4 and 6 and the completely fell apart the second time out.",
      "rating": 1.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Great firm board",
      "text": "Kids spent hours in the gulf on these boards having a great time with no flex and little wear.",
      "rating": 5.0,
      "verified": true,
      "author": "JT cos",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Quality",
      "text": "When this board was opened on my grandson’s birthday the Velcro strap was already fraying & we expect that we’ll have to improvise something so he’ll be able to continue to use it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Would buy again.",
      "text": "Bought for 8 year old girl. She loves it. Just what we have been looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "TAMMY ROMM",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Leash is not quality",
      "text": "The strap is not very durable at all. Just a string with Velcro strap very small. If you want quality this is not quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "packaged perfectly and in excellent condition! Thank you Boy-Toys",
      "text": "The boogie board was delivered as expected, packaged perfectly and in excellent condition! Thank you Boy-Toys!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170517
    },
    {
      "title": "Crappy quality.",
      "text": "Really unhappy with these boards. Just over a year with them and both 41” boards fell a part. We have them in Mexico sominky use them 3-4 times a year and kept them out of the sun. They really are crappy",
      "rating": 1.0,
      "verified": true,
      "author": "michael Gorenstein",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Leash came off after first swim, however my husband ...",
      "text": "Leash came off after first swim, however my husband was able to fix it for now. White paint coming off as well",
      "rating": 3.0,
      "verified": true,
      "author": "Olya",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Good board",
      "text": "Good solid board, my teen used it twice in the ocean and held up well. Packed well, happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "NJ Mom",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Great!",
      "text": "Perfect for my 6 year old. It is light weight and has the handy strap so it does not get lost. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "like it would fall apart after one use",
      "text": "Did not arrive w/ Leash, felt very cheap, like it would fall apart after one use. I returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Three Stars",
      "text": "Good price. Not very durable. The leash easily cut through the board.",
      "rating": 3.0,
      "verified": true,
      "author": "Sky Otter",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "These were for my grandchildren, and they were in ...",
      "text": "These were for my grandchildren, and they were in the warehouse, so they were delivered ASAP. They took them to Corpus Christi vacation and had a blast. \"They are beautiful\" was my granddaughter's comment when they opened the box!",
      "rating": 5.0,
      "verified": true,
      "author": "Francene",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Good prices, good company",
      "text": "Nice boards. I like the design. They didn't come with wrist leashes as advertised, but they sent them as soon as we asked, so all is good. Responsive & polite company to work with.",
      "rating": 4.0,
      "verified": true,
      "author": "Three Sisters",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "cheaply made",
      "text": "The rope was cheaply made. Very weak. Also their was a little hole already in the boogie board brand new",
      "rating": 3.0,
      "verified": true,
      "author": "Charissa Palacios",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Five Stars",
      "text": "2nd one I purchased good value, arrived in perfect condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R. Saramandich",
      "helpful_votes": 2,
      "publication_date": 20170312
    },
    {
      "title": "Leash is junk, board is not high quality.",
      "text": "I thought it would be a little better quality board but the leash is junk. I had to buy a different leash.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180720
    }
  ],
  "product_meta": {
    "title": "Bo-Toys Body Board Lightweight with EPS Core",
    "description": "Body Board Lightweight with EPS core, Heat lamination Technology, offers impact strength durability, Lightweight & Rigid. More maneuverability, and increased speeds and strength. DURABLE CONSTRUCTION : HDPE (High Density Polyethylene) super slick bottom with channels and a crescent tail. Compact feeling and water resistant for all wave conditions. 60/40 rails allow for more maneuverability and skills. Includes leash with wristband to keep board nearby. 41\" board, Stylish design, bright colors (red, blue and pink) for you to choose , offer best surfing fun. Ready for hours of fun at the beach, river, or water-park. TOTAL ASSURANCE - When you receive a Bo Toys product, if you are not 100% satisfied with your purchase, let us know. We will respond promptly and professionally in order to fix any problems the product may have, if you received a faulty item, we will replace it immediately.",
    "rating": 4.2,
    "feature_bullets": [
      "Body Board Lightweight with EPS core, Heat lamination Technology, offers impact strength durability, Lightweight & Rigid. More maneuverability, and increased speeds and strength.",
      "DURABLE CONSTRUCTION : HDPE (High Density Polyethylene) super slick bottom with channels and a crescent tail.",
      "Compact feeling and water resistant for all wave conditions. 60/40 rails allow for more maneuverability and skills.",
      "Include Pro Quality leash with wristband to keep board nearby.",
      "33\" board, Stylish design, bright colors (red, blue and pink) for you to choose , offer best surfing fun. Ready for hours of fun at the beach, river, or water-park. TOTAL ASSURANCE - When you receive a Bo Toys product, if you are not 100% satisfied with your purchase, let us know. We will respond promptly and professionally in order to fix any problems the product may have, if you received a faulty item, we will replace it immediately."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 22, 2016",
      "Manufacturer": "Bo-Toys",
      "ASIN": "B01IX0VPES",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Bodyboards",
      "Surfing",
      "Sports & Outdoors",
      "Water Sports"
    ],
    "price": 55.95
  }
}