{
  "website_summaries": [
    {
      "verdict": "This wok makes everything  without the mess and spillover as compared to cooking in regular shaped pans.",
      "pros": [
        "Cleanup is much easier than expected, thanks to the height and width of the wok",
        "You will like the wide handles, as well as the safe and secure grip",
        "Wide curved base offers stability while stir-frying",
        "Has modern rustic design that goes from stove or oven to table",
        "Comes pre-seasoned"
      ],
      "cons": [
        "Some woks may arrive with cracks (a manufacturing defect), so inspect when you receive it",
        "May leave a funky metallic odor in the food if not properly washed"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Super Wok... Works Great...!",
      "text": "Just love this wok. Wish I had bought it 20 years ago. Been through a lot of woks... the coating comes off, they get hard to clean, they're flimsy and slip and fall off the wok stand. This wok is as solid as a ROCK. It doesn't move as you stir fry, it heats evenly, it's easy to clean, and it's going to last me the rest of my life. It works superbly on my gas range.Flat bottom is nice - holds it real steady.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Chow",
      "helpful_votes": 23,
      "publication_date": 20171112
    },
    {
      "title": "A good buy!",
      "text": "Have had a similar cast iron work for over 35 years, works great, use it at our home at least once a week. The Bruntmor is almost identical and we bought it to take to our cabin. I'm sure we'll get great service out of it, too. Nothing even comes close to sticking and is so easy to clean with a chain mail scrubber or plastic scraper made for that purpose. We only use wooden or silicone utensils.",
      "rating": 5.0,
      "verified": true,
      "author": "HJDinAZ",
      "helpful_votes": 16,
      "publication_date": 20170311
    },
    {
      "title": "Needs wider base and better quality control",
      "text": "I also found a baked-in imperfection in my wok (see visible image) that might, or might not be a crack. Thermal imagery confirmed it as a manufacturing defect. Also, please note the extremely small heating area on the bottom of the wok. That small area can be a blessing and a curse; searing can only be done in small portions, but pushing veggies up onto the sides and steaming them with a lid on should be more effective. I will see if I can find a Lodge cast iron wok, due to their excellent quality reputation.",
      "rating": 1.0,
      "verified": true,
      "author": "Y. Fischer",
      "helpful_votes": 80,
      "publication_date": 20170225
    },
    {
      "title": "Weird sticky residue",
      "text": "Idk what’s going wrong with this but it’s super sticky and rusts way easy. I’ve had not trouble with my other cast irons but this one even after seasoning is having so many issues. It continues to have food stick which makes cleaning extremely hard. I have tried to “break it in” and it’s just not working. The same spot continue to get a weird sticky residue on it. It’s very heavy but that doesn’t seem to equate to quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Brantley D.",
      "helpful_votes": 5,
      "publication_date": 20190605
    },
    {
      "title": "Happy!",
      "text": "Oh, wow! This is one heavy piece of iron! And you know - the heavier is the skillet - the better! I love it! It is really perfectly round inside, as a wok supposed to be, but it has a flat and smooth foot - it keeps steady on the glass surface of my electric range.",
      "rating": 5.0,
      "verified": true,
      "author": "HaHa, Inc.",
      "helpful_votes": 22,
      "publication_date": 20160920
    },
    {
      "title": "Beautiful, well balanced, sturdy",
      "text": "This is a good quality wok. Very good price and big enough to cook for a large crowd in. It is not super heavy (which surprised me) for cast iron but I'm thinking that has something to do with what you will be cooking in it - quick, not high heat, steamed vegetables. I think I am going to love this pan for a long, long time. I haven't used it yet and am holding 1 star back because it's not as heavy as I am used to cast iron being but I do expect this is going to be an excellent pan.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon  M. Allen",
      "helpful_votes": 3,
      "publication_date": 20181124
    },
    {
      "title": "Don’t waste your money!!!! TERRIBLE",
      "text": "If it was possible I would give it zero stars. Absolutely Terrible!!! Worst cast iron pan I’ve ever had. Everything sticks when you cook even after it’s been re-seasoned. Don’t waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Sara Twarek",
      "helpful_votes": 5,
      "publication_date": 20180715
    },
    {
      "title": "I use this to roast coffee on the stove top and it's ideal.",
      "text": "Awesome piece of equipment. It'll last not only a lifetime, but it'll become an heirloom. It heats so evenly I am amazed. I have never had a piece of cast iron heat this evenly. I use it for roasting coffee, and it's perfect for stove-top roasting. I had been using a cast iron skillet since my Behmor's heating element started failing, but lost too many beans and it never roasted evenly. This is re-learning roasting all over again and it's a hell of a lot of fun now, not just a chore. Tap on it and it rings clearly like a bell--a sign of excellent make. I'm glad I decided not to to go the cheap route.",
      "rating": 5.0,
      "verified": true,
      "author": "DeppityBobDos",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Wok is awesome",
      "text": "Love the work. It said pre seasoned but it wasn't. Easy fix. I seasoned it myself. As good as my Lodge cast iron. Would recommend this to anyone. Try it out, it's a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnie",
      "helpful_votes": 6,
      "publication_date": 20170921
    },
    {
      "title": "Broken😔",
      "text": "I’ve been wanting a cast iron wok for easily 4-5 years and just haven’t found one that I decided on buying yet. I came across this one and finally bit the bullet and ordered one! I was excited when it got here and ripped the box open to find that mine is broken 😔 literally the equivalent to a heart break💔I’ve been waiting years for a cast iron wok.",
      "rating": 1.0,
      "verified": true,
      "author": "CupCake",
      "helpful_votes": 3,
      "publication_date": 20180825
    },
    {
      "title": "it is not preseasoned as it says.",
      "text": "I tried cooking some bacon in it first thing and it stuck. Cooking eggs in it after it's been oiled and they stick worse. You end up having to scrub the eggs out even after soaking. Am gong through the long process of reseasoning it and if that doesn't work, I'm sending it back!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190420
    },
    {
      "title": "Made aspiring cook very happy.",
      "text": "Bought this as a birthday gift for soon to be nephew n law. He absolutely was over the moon with it. I can't say anything about cleaning or cooking but it was a nice piece of equipment. Heavier than what I expected at the price point and it looks very well made. Can't wait for him to try it out! Update: Aspiring cook used it and loved it even more. He told me that it cooked very evenly and one of the best piece of cookware he's used.",
      "rating": 5.0,
      "verified": true,
      "author": "DaZook",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Make you feel like a Chef",
      "text": "Very nice wok for the price. I found the surface to be a bit rough. I spent some time sanding the inside much smoother and reseasoned it. My favorite go to kitchen tool. I even deep fry in it with great success at keeping the oil temp nice and hot. Even on the lowest temp on my stove, I can get sauces to simmer. My aluminum pan would only keep things warm at the lowest temp. Very sturdy on the stove, no worries of it tipping over.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Lundberg",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "I love this cast iron wok",
      "text": "This wok is heavy enough to stay in place while I stir. I love cast iron to begin with and if you follow the rules of cast iron this is a breeze to use. Let it heat up until it smokes. Add oil and your protein remembering that your protein cools down the iron which seizes onto the meat. Let the wok heat up enough to release the meat before stirring and you should not have any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "James Patrick",
      "helpful_votes": 2,
      "publication_date": 20170401
    },
    {
      "title": "It's just okay...",
      "text": "This wok is too dense to work properly. I know that sounds counterproductive to state, but it's true. The heat doesn't distribute correctly. I know cast iron is supposed to be heavy, but I think it's a just too thick. Also, the inside is not smooth at all, and food seems to stick quite often. Yes, I have seasoned it, but it is still an issue. If they sold this with a smoother cooking surface, it might possibly work a lot better.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "No more \"stare\" frying",
      "text": "Decent quality and does what it's supposed to do. I don't have a great stove and have issues with my wok staying hot, while stir frying. I decided to try this cast iron wok and it works great, so far. I stir fried beef with string beans and the wok kept its sizzle the entire time. I can't wait till I use it 100+ more times to give it a really good season/ \"wok hei\".",
      "rating": 4.0,
      "verified": true,
      "author": "charshew",
      "helpful_votes": 3,
      "publication_date": 20170831
    },
    {
      "title": "A quality cast iron wok.",
      "text": "At first I didn’t like the pebbly surface on the inside of this wok. I felt sure everything would stick to it, but I was very wrong! Nothing sticks and I use this wok to cook almost every meal! This WILL SCRATCH YOUR GLASS COOKTOP, but if you are careful it isn’t a problem. Just don’t slide it. Pick it up to move it!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Wilson",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "A seaoned kitchen asset",
      "text": "I own several casts iron pots and fry pans. The wok was preseasoned unlike my previous cast iron purchases, which negates having to initially slather it in oil. Cast iron is one of my favorites to utilize to prepare food. The wok is flat bottomed and quite spacious. I own a steel wok which when flipped, acts as a cover. Stir fry, frying, sautéing. This product is a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Maxie",
      "helpful_votes": 2,
      "publication_date": 20170219
    },
    {
      "title": "Very Happy",
      "text": "Cast Iron is like women, they keep getting better when they age if they’re maintained properly of course. I don’t understand why some people leave bad reviews about this piece. It’s solid, well made and comes in perfect size. It works fantastic on my gas stove. Update after several cooking sessions: I’ve used this wok for more than 10 times and it’s doing great. The last picture is the seasoned bad boy ready to rest in the storage",
      "rating": 5.0,
      "verified": true,
      "author": "MPower-Project",
      "helpful_votes": 9,
      "publication_date": 20180307
    },
    {
      "title": "Good, but not great.",
      "text": "Great for the price. Only complaint is the roughness of the casting, nothing half an hour with an angle grinder and flap wheel couldn't fix. After a good polish this is an excellent Wok.",
      "rating": 4.0,
      "verified": true,
      "author": "Kendall McCollough",
      "helpful_votes": 3,
      "publication_date": 20170222
    },
    {
      "title": "Best Wok Hands Down!",
      "text": "I never even knew they made cast iron woks, but I love to cook with cast iron so when I saw this I grabbed it. This wok is amazing! I have never had asian recipes come out as delicious. The heat it retains & the sear of the meat so quick is a game changer! Love, love, LOVE it!",
      "rating": 5.0,
      "verified": true,
      "author": "KATHLEEN",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "its absolutely beautiful wok. Pictures don't do justice",
      "text": "its absolutely beautiful wok. Pictures don't do justice. The seasoning had to be cleaned; and re-seasoned to my own liking. I wish there was a corresponding dome shaped lid for it too. Base is stable/flat; it does not rock on the grill/stove etc. I am tempted to get another one (in small size if possible). The black coloring kind of started wearing off; but thats probably because the seasoning wasnt thick enough... need to do more cooking on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Farhan A.",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Great wok at a great price!",
      "text": "I've had a few of those plug-in teflon-coated woks over the years and I've never been happy with their performance. I love how my trusty old cast iron skillet, handed down from my grandmother, performs, so when this wok popped up on the deal of the day I snatched it up. It works great! It heats quickly and evenly and it cleans up easily. I'm sure I'll be passing this wok on someday.",
      "rating": 5.0,
      "verified": true,
      "author": "stuartkearns",
      "helpful_votes": 3,
      "publication_date": 20170219
    },
    {
      "title": "Great weight and heat distribution.",
      "text": "This is the best home electric induction wok I have used. It is easy to maintain and clean and looks great just sitting on the stove top. It is a use every day kind of pot. The price is fantastic. What I like the most about it is it's even heat distribution and weight.",
      "rating": 5.0,
      "verified": true,
      "author": "perfectcoffeeseeker",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "food sticks to bottom despite seasoning it...",
      "text": "Seems solid and the included wooden lid is perfect for stir-frying vegetables. Meats still stick to the wok wich causes small fragments to burn during meal preparation. I think the porous ruface of the iron cast is to blame for this. I seasoned this twice with olive oil and then again with coconut oil.",
      "rating": 4.0,
      "verified": true,
      "author": "Ultraman",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great wok!! Great quality!",
      "text": "Arrived as promised: Was pleasantly surprised by the quality of this iron wok. I had ordered another one from another vendor that is not any where near as good quality as this. Would highly recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "NonnaC",
      "helpful_votes": 3,
      "publication_date": 20170219
    },
    {
      "title": "Great WOK!!!",
      "text": "I bought this wok because I use it with BBQ, weird, correct? I like the outdoor cooking! This one is slow to heat, but maintain the heat longer, which is great for outdoor. Easy to clean, and store. The wok is heavy one, which makes it durable. I love it and I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Issa Barmawi",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "A pre-seasoned cast iron Wok!",
      "text": "3 stars for easy to use portion because it’s heavy, but that’s because it Cast Iron. Still, they asked. On the flip side it doesn’t slide around because of the weight. We expect it to be durable and it is very easy to clean. A BIG plus is it came pre-seasoned.",
      "rating": 5.0,
      "verified": true,
      "author": "SlumLord",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Living my cast iron wok fantasy",
      "text": "This wok was such a great deal. It has a flat base, perfect for using on a flat top/electric stove. It's large, but not too heavy, and has nice handles to grip with.",
      "rating": 5.0,
      "verified": true,
      "author": "Alec K.",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "It was great! Perfect size for serving 6",
      "text": "Used my wok for first time last night - pad thai. It was great! Perfect size for serving 6, seasoned as described and cleaned up nicely. Love the flat bottom and the weight, doesn't rock on top of stove or try to slip off burner. A great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Burnhaven",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "It worked like a charm for the food and was easy cleanup",
      "text": "The wok is very weighty and balanced. It came pre-seonsoned, but decided to season as in booklet that came with it. Then we tested it. It worked like a charm for the food and was easy cleanup. Am getting one for my best friends birthday. She collects cast iron items. Would recommend...absolutely.",
      "rating": 5.0,
      "verified": true,
      "author": "MARLEEN C HIGGINBOTHAM",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Disappointed and luv stir fry",
      "text": "Don't recommend with gas stove. Does not get hot enough and a pain to take care. Tossed it out of frustration. Heavy and can damage your sink.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190420
    },
    {
      "title": "Wok this way.",
      "text": "Love this Wok, it's great for making stir fry for several people, it's on the heavy side, but that's to be expected. I also use it as a mixing bowl & (after warming in oven) to rise bread. Versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Bladow",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Awesome wok!",
      "text": "I love this wok. We have used it a few times already for stir fry! Heats evenly, and ai can fit so many veggies and meat in it. 4 stars on easy to clean, just because it is heavy! However I did expect that, given its size and the fact that it is cast iron. I definelty recommend this, especially for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "jamie p.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "A wok that means business.",
      "text": "Really a heavy duty wok. It's 14 inches in diameter and must weigh over 10 lbs. I haven't used it yet but as soon as I season the cast iron as recommended by the vendor I will be using the pan regularly. I have a wok burner on my stove so it will be easy to get even heating.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Wieneke",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Good value, cooks well",
      "text": "I have only used mine twice, but I can testify that it came well seasoned, and i have not found any flaws on it. It works admirably. It has been noted in other comments that the flat bottom is not large and the handles get hot, but these are both matters that are simple to deal with, and certainly would not prevent me from buying it. I will note thickness of the flat bottom means you have to heat it for a while to get it nicely hot, but it also means it retains the heat better while cooking. I'm glad I bought it",
      "rating": 5.0,
      "verified": true,
      "author": "Myles Toomey",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "It is extremely heavy.",
      "text": "If you are cooking a lot of food. This wok will get very heavy. If you are a girl that can't lift 10 lbs. I suggest you get something else. This will be even heavier when you have food in it.",
      "rating": 2.0,
      "verified": true,
      "author": "WillC",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Best Wok I've Ever Used",
      "text": "I love this wok. It heats up quickly and evenly. It's easy to whip up a healthy meal In minimal time. In the photo, I prepared that in under 15 minutes. And it cleans up in no time when I'm done. I would highly recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 3,
      "publication_date": 20170903
    },
    {
      "title": "My first wok",
      "text": "My first wok! I always wanted one and finally took the risk and bought it on Amazon. I saw the reviews and most were positive. I habe used it several times and still looks like new. Easy to clean and doesn’t seem to burn the food.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great product.",
      "text": "Great product... it feels sturdy and like it will last for a long time with proper care. Perhaps a wooden handle would be the only thing missing from this wok as it gets extremely hot, great for cooking but hard to manipulate.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerardo Z.",
      "helpful_votes": 2,
      "publication_date": 20170222
    },
    {
      "title": "The only bad part is it doesnt clean itself and he can ...",
      "text": "my son wanted a wok so we got him this one. He is actually gifted in his wok skills. The only bad part is it doesnt clean itself and he can cook but sucks at cleaning up after himself",
      "rating": 5.0,
      "verified": true,
      "author": "jim nolan",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Heavy duty and puts outs out great heat distribution.",
      "text": "Highly recommend, don't buy a thin steel traditional wok when you have this product. Once seasoned, food does not stick on it like some of the sheet metal woks I have had in the past. It cleans up easily and I hang it once cleansed to prevent rusting. It is a little heavy but is totally worth the effort to move it around.",
      "rating": 5.0,
      "verified": true,
      "author": "Quintin L. Oster",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Love my new Wok!",
      "text": "I wish I had known about cast iron woks sooner. I have purchase many hammered woks in the past, only to have them rust after the first use. My new cast iron wok is beautiful sitting on my stove and the care instructions are very clear on how to care for it.",
      "rating": 5.0,
      "verified": true,
      "author": "littler1",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Great buy.",
      "text": "Excellent product. We have been using this wok almost everyday since we received it. Very easily treated and cleaned.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss J",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "They are very happy to receive them",
      "text": "I bought these as gifts for relatives. They are very happy to receive them. They have jealously watched me use mine that I've had for years. So now they have their own. These can be used to cook anything. Use then in the oven as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Irma Grant Williams",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Very heavy!",
      "text": "Cooking is OK. Problem is weight. It is too heavy for me to use regularly. Unfortunately, I have another pot that is similarly heavy. I only use when my son is home to lift for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Good quality, nice looks too",
      "text": "I picked this one over others because it was a bit lighter weight. It feels a d looks nice. It said it’s preseasoned but I added 2 more coats and it has the shiny look I’m looking for. I’m happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete Marsden",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Great for cast iron lovers.",
      "text": "Best gift I could have given to my roommate who loves to cook spicy Asian style food and is infatuated with cast iron pans. He uses it more than anything now.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Dyer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Great product",
      "text": "Got these for my husband. Great quality. Food is so amazing when cooked in one of these. Easy to maintain. Overall great product.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ Melendez",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "The cast iron wok is great. Had to file down areas on bottom so ...",
      "text": "The cast iron wok is great. Had to file down areas on bottom so not to scratch ceramic stove top.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon R. Loesing",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "I love this wok",
      "text": "I love this wok!!!! It is heavy and big enough for my family if 3. I use it for a variety of meals on an electric stove with absolutely no problems heating up the wok and cooking food thoroughly. Impressive piece of cookware!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Wok to buy",
      "text": "Have used it 3 times now and it is great. As long as you clean right after dinner and don’t let it sit it is ease to clean. It hold temp well and seems to be well constructed but only time will tell for that. At this time I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "William Wiltse",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Just what I need it",
      "text": "I bought this to learn how to cook fried rice I cook so I cook so much more than I expected to be doing I love it Yea yea yea Love it love it love it",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Douglas",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "AMAAAZZZIIING!!",
      "text": "I absolutely love this! I’ve been searching for one for a while and didn’t want to pay the prices I was seeing. But I found this as a Prime Deal if the day and I jumped on it. I couldn’t be more happier! Easy to use and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Wonderful",
      "text": "Cooks to perfe from the wok.ction. Retains heat effectively keeping food warmer much longer so you can serve yourself right",
      "rating": 5.0,
      "verified": true,
      "author": "Pops",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Good, heavy, cast iron.",
      "text": "The seasoning is quite rough which makes cleaning a bit of a task. Works well for bread baking when covered with a stainless steel bowl.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Kafer",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Good Wok",
      "text": "Good and durable. My only complaint is that it takes a little bit longer to heat up.",
      "rating": 4.0,
      "verified": true,
      "author": "J Lin",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great cast iron wok",
      "text": "This is a great cast iron wok. It cooks food well and the flavor is really impressive when using gas.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Dizon",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "I love cooking in this wok",
      "text": "I love cooking in this wok. It's cast iron and heats up fast. It's easy to clean and I know that it will last for years to come. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Ray",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Exactly what we were looking for",
      "text": "We've used this a few times since purchasing and we are thrilled with it! The heat distributes evenly and the quality is very high. I would highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara R.",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Cast iron stir fry",
      "text": "Heavy duty, first cast iron so still getting used to it but so far works great, cleans easy, worth the $$",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Really nice!",
      "text": "Just what you’d expect with a cast iron. Nice large wok for all sorts of frying. It pretty much stays on the stove all the time. I use it almost exclusively for everything. It’s a little heavy but it’s nice because it stays in place on the stove as I’m working.",
      "rating": 5.0,
      "verified": true,
      "author": "PAUL",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Best wok at a great price!",
      "text": "Very good quality, a large Wok so can handle a lot of food. Nice even heat, stable on my gas stove, and wonderful to look at. I will get years of good use!",
      "rating": 5.0,
      "verified": true,
      "author": "preston maynard",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "the pot arrived quickly and with no damage. I ...",
      "text": "the pot arrived quickly and with no damage. I cant wait to start using it, just finished the initial cleaning and re-seasoning of the pan!",
      "rating": 5.0,
      "verified": true,
      "author": "Scooter74",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Great wok, made in China.",
      "text": "Awesome wok, never realized how useful a wok would actually be and I didn't want an aluminum one. Reason for the one star is it is made in China unlike lodge which is made in the US.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Big",
      "text": "Great size. Bigger then my aluminum wok, perfect since I’m a family of 6+ dinner parties. Thumbs up",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Robinson",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Yes.",
      "text": "I use this almost everyday! It's easy to clean, came as advertised. I seasoned it following the instructions it came with. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "woodzy",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Works As Advertised",
      "text": "Always wanted a cast iron wok. This thing is legit out of the box. First stir-fry, I tested it with frying up some pressed and extra firm tofu. Crisped right up. One thing to note is that the texture is rough, and it's by design. Old school cast iron is super smooth, so I was worried things would stick. Nope. Worked as advertising. Zero buyers remorse. And what a great price. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "David Mason",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "I did't  used it and returned to Amazon",
      "text": "If the other cast iron got rusted after one usage, why bother using this one. I don;t think I ever got my refund either. Bad product.",
      "rating": 1.0,
      "verified": true,
      "author": "CARL'S 2019",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Easy to use.",
      "text": "Love this Wok. Heats evenly, and do not have to use too much oil.",
      "rating": 5.0,
      "verified": true,
      "author": "TBL",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "easy to clean and works well for a few different ...",
      "text": "Came pre-seasoned, easy to clean and works well for a few different things. It is big and little awkward so storing it may be interesting, but if you need a wok this is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Russell",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Poor quality, completely rusted",
      "text": "I cleaned, dried, and stored this item exactly as instructed, and with no exposure to moisture it was completely rusted the next time I took it out of the cabinet. I have lots of cast iron and am experienced in caring for it, so I can only assume it is due to poor quality or craftsmanship.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Wish I bought it sooner",
      "text": "Used it twice so far fantastic. Nice and big easy to care for",
      "rating": 5.0,
      "verified": true,
      "author": "Amateurvegan",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "I would not recommend it.",
      "text": "This cast iron wok was not as expected. Due to the weight and cost of shipping I decided to keep it and try to season it into shape. It'll require a lot of seasoning since the finish is much rougher than most cast iron products. It was relatively inexpensive for cast; that's why I purchased it. I would not recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "rd",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Great wok! When properly seasoned it works better than ...",
      "text": "Great wok! When properly seasoned it works better than the non-stick one I have. The key is proper seasoning on any cast iron. I highly recommend this to any one thinking about purchasing. Great value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Heats evenly, easy to clean, perfect for fried rice",
      "text": "This is exactly what I was looking for. I needed a heavy, solid stir fry pan that I could use for making fried rice. This product heats up well and evenly, doesn't burn, stays hot and is naturally non stick. I am already a huge fan of cast iron pots and pans and this is a welcome and perfect addition to my kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Heavy, sturdy but a bit sticky",
      "text": "I thought this may replace my non-sticky pot but the result was not as good as expected. It is also very heavy and hard to pour the cooked dish into plates. It seems to last for a long time and can be less sticky if you use plenty of oil or water.",
      "rating": 3.0,
      "verified": true,
      "author": "GB",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Delivered fast. It heats well but not as smooth ...",
      "text": "Delivered fast. It heats well but not as smooth finish as my other cast iron cookware. Hopefully it will be ok.",
      "rating": 4.0,
      "verified": true,
      "author": "robert teeple",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Just what I was looking for",
      "text": "Needed a new wok. Threw out my old wok after having it for decades bc someone decided to take steel wool to it and it rusted horribly. I used this wok the day it arrived and I love it! It’s definitely heavy as hell but it’s cast iron lol",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "It is HUGE and truly amazing. He loves it",
      "text": "I bought this for my boyfriend who loves cooking Asian cuisine. It is HUGE and truly amazing. He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "ANO2178",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Can’t beat the price",
      "text": "Great cast iron wok for a really reasonable price. This is heavy and durable. It gets the job done. There is a slight coating. But most cast iron I’ve seen has varying types of coating. After a couple “practice” uses it settles in and cooks wonderfully. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Bex",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "My wok makes me so happy!",
      "text": "Just what I was looking for! This item cooks my food like a dream. I would highly recommend. Great product, fast shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Robinsonswife",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Impossible to clean",
      "text": "What a horrible product. After one use it already looks disgusting and rusted. And cleaning it is a nightmare",
      "rating": 1.0,
      "verified": true,
      "author": "blahlah",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Its a cast iron wok.",
      "text": "Its a cast iron wok. Seriously its made from cast iron, and definetly considered a wok. It works! Its a cast iron wok that works. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy Shultz",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "I purchased this wok as a gift for my wife ...",
      "text": "I purchased this wok as a gift for my wife. She LOVES it and recommends it to everyone! Although it is a little heavy, she has had no problems cooking delicious meals with it. It is well-worth the price I paid for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tito",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Cooks like a Han dynasty dream",
      "text": "My son says this is the coolest piece of cookware he's ever seen. For him to notice cookware at all is noteworthy in and of itself as he is a college student, and an old school one at that.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Great buy",
      "text": "Great product, heats evenly, great size easy holds 2 lbs of meat with room to spare makes taco night a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Hopkins",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Great Wak",
      "text": "So well made and does an outstand job. Holds heat very well. you will love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "So happy with this order",
      "text": "So happy with this order. The fact that it comes preseasoned allowed me to use it the night we received it. Very sturdy. Super easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey B Piper",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "had a crack near the handle",
      "text": "bought it but it has a crack near the handle.It looks like this has been noted by other people as well",
      "rating": 2.0,
      "verified": true,
      "author": "js",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "nice, heavy cast",
      "text": "exactly as advertised, nice, heavy cast, seasoned and a flat bottom to be used on any stove. love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "stefan",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "... run on my stir fry recipe and it performed great. I used it on my electric glass stove ...",
      "text": "Gave it a test run on my stir fry recipe and it performed great. I used it on my electric glass stove without any problems. It is heavy however, and must be handled with care.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Pratt",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "much better than non-stick; but bit too big and heavy for home use",
      "text": "The utensil quality is good. But the size is a little big for regular home use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bindu Mathew",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "The pitted nature of the cast iron makes this hard ...",
      "text": "The pitted nature of the cast iron makes this hard to clean. I have several old cast iron pans from my grandmother and the surface is smooth and solid and not pitted, and therefore much more user friendly. Perhaps these divots will lesson with more seasoning and use?",
      "rating": 3.0,
      "verified": true,
      "author": "cm",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Five Starshttps://www.amazon.com/Bruntmor-Pre-Seasoned-Black-14-inch-Handles/dp/B01IG67XDG/ref=pd_rhf_cr_p_img_1?_encoding=UTF8&",
      "text": "i just received the wok iam very satisfied with the quality i'am looking forward to using it.I just used the wok to make a nice stir fried diner.The wok works good no sticking holds the heat very well easy to clean.I will recommend this wok to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "ismael santiago",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "please have cs call me and I will explain. ...",
      "text": "please have cs call me and I will explain.. it appears as if product was damaged in manufacturing and quality control did not pick it up unless this was a second which I was not informed about. victor 7575723654.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Excellent Quality Iron Wok",
      "text": "Excellent wok with appropriate depth and width. Requires you to know how to care for and cook with cast iron.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Miranda",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Must have in the Kitchen.",
      "text": "This is the ONLY pan that I every cook in. Love the size, and must have with wooden tools - Great tasting food as the pan seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "William Donovan",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Very pleased with the product",
      "text": "Gets very hot and helps with stir frying at high temperature. Very pleased with the product. Only down side is when I go to clean, because its so hot and hard to handle without scorching fingers if I don't use pot holders.",
      "rating": 4.0,
      "verified": true,
      "author": "Heco Chen",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Five Stars",
      "text": "Love it cast iron is the only thing to cook on.",
      "rating": 5.0,
      "verified": true,
      "author": "Mathew Dance",
      "helpful_votes": 0,
      "publication_date": 20170201
    }
  ],
  "product_meta": {
    "title": "Bruntmor, Pre-Seasoned Cast Iron Wok, Black, 14-inch w/Large Loop Handles & Flat Base (14\" Wok)",
    "rating": 4.5,
    "feature_bullets": [
      "Sturdy base keeps the wok steady on the stovetop",
      "Pre-seasoned and ready for immediate use",
      "Can be used on any stovetop: electric, gas, induction; can also be used in the oven",
      "Large loop handles for easy handling",
      "Hand wash only"
    ],
    "specifications": {
      "Package Dimensions": "16 x 15 x 6 inches",
      "Item Weight": "11.88 pounds",
      "Manufacturer": "Bruntmor",
      "ASIN": "B01IG67XDG",
      "Item model number": "BRCIW14",
      "Customer Reviews": "4.5 out of 5 stars558 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#43,422 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 14, 2016"
    },
    "categories": [
      "Woks & Stir-Fry Pans",
      "Home & Kitchen",
      "Cookware",
      "Pots & Pans",
      "Kitchen & Dining"
    ],
    "price": 39.99
  }
}