{
  "website_summaries": [
    {
      "verdict": "A quality alarm to carry on you or set up with a trip wire to protect your property indoors or out.",
      "pros": [
        "The alarm's design allows you to turn it into a DIY trip wire to protect your property",
        "Made from durable, weather-resistant materials, it's small and easy to conceal",
        "Alarm volume is similar to a smoke alarm",
        "Alarm will sound continuously for 30 min",
        "or until manually shut off"
      ],
      "cons": [
        "While the battery is designed to last for up to 5 yrs., it isn't rechargeable or replaceable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great early warning device",
      "text": "My husband and I are getting older but still love to backpack. Our hearing is not what it used to be and we were looking for an alternative to a dog for perimeter security; bears and such. We now use one or two of these strung with fishing line about knee-high around our camp site. We filed the release pin to hair-trigger sensitivity. A little survey tape strategically place along the line reminds us not to trip it but we do and it works great. We call it our E-Dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Slorunr",
      "helpful_votes": 23,
      "publication_date": 20200222
    },
    {
      "title": "Not water proof",
      "text": "I had 2 of them hooked up as tripwire alarms in my back yard for about 3 weeks, we had a lot of rain yesterday and one of them started to sound without being tripped. it just keeps on chirping and it is annoying my neighbors. I put it inside the trunk of my car for now until I figure out a way to shut it off. I guess it is not really weather proof. Or water proof.",
      "rating": 2.0,
      "verified": true,
      "author": "Aldemar E.",
      "helpful_votes": 39,
      "publication_date": 20171030
    },
    {
      "title": "Unreliable",
      "text": "I really wanted to like this product, but one of the two units I received only works about half of the time when you pull the pin. Not reliable enough to use for a personal alarm. The other one works, but now I don't have a lot of confidence in it.",
      "rating": 2.0,
      "verified": true,
      "author": "JTH",
      "helpful_votes": 53,
      "publication_date": 20170406
    },
    {
      "title": "Detaches Easily/Alarm Very Loud",
      "text": "Very Loud...wish I had read the instructions before clipping it on my purse and heading out. I accidentally detached the two pieces and struggled to turn the alarm off in a store. Detaches a bit too easily. Alarm volume is great though!",
      "rating": 4.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 26,
      "publication_date": 20170121
    },
    {
      "title": "Multiple uses",
      "text": "Purchased this for my daughter because she works late shifts. Hope she wont have to use it. Viewed several YouTube videos on this product, has many uses. Glad I did because if you attach the alarm to a bag or purse, you would want to put the alarm side on the bag or purse, not the pull clip. If someone takes off with your bag you can hear which way they went and track the thief, also it might make them want to drop the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "LaDeDa",
      "helpful_votes": 5,
      "publication_date": 20181211
    },
    {
      "title": "The product that arrived was not branded as \"Robocopp\". ...",
      "text": "The product that arrived was not branded as \"Robocopp\". Instead it was branded as \"Robolarm\" and lists a website that doesn't exist. Returning as it is not the product advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "jkt",
      "helpful_votes": 92,
      "publication_date": 20170325
    },
    {
      "title": "Weak sound is not as advertised",
      "text": "This arrived yesterday. It is esily the most disappointing thing I have ever bought on Amazon. It looks pretty much as described and turns on and off as descibed. Unfortunately the sound it produces is not at all as described. The sound is not at all loud and is barely heard at 100 feet. It would in my opinion do little to discourage a criminal or attract attention.",
      "rating": 1.0,
      "verified": true,
      "author": "gerard geant",
      "helpful_votes": 7,
      "publication_date": 20180720
    },
    {
      "title": "It's loud and easy to carry with my keys",
      "text": "It's loud and easy to carry with my keys. I bought this device because i work on a college campus and wanted to carry something with me on my long walks to the parking lot that would be really easy to use. A gentleman from the fbi recommended i try this. The only problem is that it's easy to pull the pin out by accident and scare everyone around you. At least it works!!",
      "rating": 4.0,
      "verified": true,
      "author": "ME",
      "helpful_votes": 7,
      "publication_date": 20170526
    },
    {
      "title": "DO NOT BUY THIS PRODUC ITS A WASTE OF MONEY",
      "text": "I'm very dissatisfied there is no way the noise is 130 decibels because I pulled it and it's not loud at all! Don't buys this product it's a waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Joni Wilson",
      "helpful_votes": 22,
      "publication_date": 20170116
    },
    {
      "title": "Damn junk!!!!!",
      "text": "Well.....it worked for a month. I tested it twice for 2 to 3 seconds the first day it came. Worked very well. Gave it to my SO. It's been on her purse ever since. I went to test it today just for kicks......the damn thing's dead. No one peep. God forbid she actually needed it. I'm pissed. I bought this as an accessory to help her in those college parking lots in the evening. Well.......don't count on helping keep your loved ones a bit safer with this thing. Buy another brand. False security is worse than the money I waisted on this junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 2,
      "publication_date": 20191025
    },
    {
      "title": "This worked for about a month and I never even ...",
      "text": "This worked for about a month and I never even used it. Thankfully my boyfriend pulled it as a test and we realized it wasn’t working any longer.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20171214
    },
    {
      "title": "Loud Enough but Too Hard to Pull",
      "text": "I disagree with other reviews that think this is too easy to set off. I wanted something that a slight touch would set off the alarm. You need a very deliberate and firm pull to activate. I put some lubricant on the parts and it helped, but I still feel a lot of resistance on the pull pin. It met my expectations as far as how loud it is. I would want hearing protection in place when I test it!",
      "rating": 3.0,
      "verified": true,
      "author": "C.C",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "My only complain is that carabiner cannot be place on the trigger since the trigger is so sensitive and has to be placed on the back rubber portion which makes a somewhat annoying squeaking noise",
      "text": "Very loud! I purchased as a additional animal repellant and have not had the opportunity to use it aside from my initial test to make sure the product worked but I was impressed with the volume. I carry this on my pack for all hiking trips and when I walk my dog. My only complain is that carabiner cannot be place on the trigger since the trigger is so sensitive and has to be placed on the back rubber portion which makes a somewhat annoying squeaking noise.",
      "rating": 4.0,
      "verified": true,
      "author": "MIshy B",
      "helpful_votes": 2,
      "publication_date": 20170828
    },
    {
      "title": "alarm is not effective",
      "text": "I bought this for my 17 year old daughter. We tried it out and it sounds like a car with a bad belt squealing or a loud bird chirpping. We couldn't hear it inside of our house when it was set off in our driveway. I can't imagine it would scare away a predator or let anyone in the vicinity know that you were being assaulted and need help. Really disappointed!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200513
    },
    {
      "title": "Definitely worth it!",
      "text": "Have it rigged in my truck for the pesky thieves that have tried to break in! I have a club, but no alarm. This thing is loud enough for me to hear three floors up and across the parking lot!! Amazing!!",
      "rating": 5.0,
      "verified": true,
      "author": "brina",
      "helpful_votes": 2,
      "publication_date": 20190610
    },
    {
      "title": "Stiff",
      "text": "It's difficult to pull so setting it up as a tripwire is probably not going to work at least not without some sort of other mechanism like a spring pole or something else. It's fairly loud, but it can be silenced down to almost nothing by squeezing it tightly. I can't say that I'm very impressed with this unit at all. There's also no way to charge it, so once it's done, it's done you have to buy another. It's a neat idea but poor execution.",
      "rating": 2.0,
      "verified": true,
      "author": "Adam Bodford",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Battery Life on Package only gives me 8 months of standby!",
      "text": "I have just received mine (11-24-17) and the silicone casing feels great in the hand. I haven't tested it yet but I am worried about the battery life. With 1 year standby warranty and checking the date when the battery was made on the package, (7-2-17), that leaves me with 8 months of use, which I think is unacceptable. I will ask for an exchange for fresher unit.",
      "rating": 3.0,
      "verified": true,
      "author": "Queen Victoria",
      "helpful_votes": 2,
      "publication_date": 20171125
    },
    {
      "title": "LOUD!!!!",
      "text": "First I would like to say I ordered this to use while camping, the thought of setting up a tripwire using this is great. Although I haven't used it yet for that purpose I would like to provide some feedback on the item so far. For those complaining its not loud enough, this thing is super loud. Seems well built and durable. I've since ordered a second one for my wife to be used for personal safety.",
      "rating": 5.0,
      "verified": true,
      "author": "Taz",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "I would definitely recommend buying this for loved ones and their",
      "text": "I bought one of these for my sister and one for my mother. Instead of carrying mace or some other obvious item, these aren't quite obvious and are effective when used. I even bought one for one of my female friends that lives alone in a not-so-great neighborhood. She had a feeling she was being followed and when she saw an individual approach close enough she put it into action. The alarm made the individual run away. I would definitely recommend buying this for loved ones and their protection",
      "rating": 5.0,
      "verified": true,
      "author": "D8210",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Don't buy this.....Ripoff!",
      "text": "This is nowhere near 130 db. More like 30. I accidentally tripped it while camping and began hearing what I thought was a cricket chirping and it was this no good POS and it was only 10 ft or less away.",
      "rating": 1.0,
      "verified": true,
      "author": "Macdiver",
      "helpful_votes": 13,
      "publication_date": 20171017
    },
    {
      "title": "Surprisingly effective",
      "text": "This little sucker is LOUD. Fits nicely on my keychain without adding any noticeable weight and is small enough to avoid being an eyesore. I accidently unhinged it once as I was getting into my car and I couldn't figure out how to get the 2 pieces back together fast enough... Likely due to the fact that I was very flabbergasted and losing my wits with the alarm SCREAMING in my ear. I hope it has the same affect on any future potential muggers.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisSmith",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "It was small enough not to be seen and allowed me to rest better knowing I would be alerted if someone tried to ...",
      "text": "Was looking for something to attach to my laser Christmas lights (the expensive ones) to prevent them from being stolen, or at least alert me if someone tried to abscond with them. Using a ground screw, coated cable, and some small locks I was able to attach one end of this unit to the ground screw and one end to the light. Thankfully no one ever tired to steal them so it never alerted. It was small enough not to be seen and allowed me to rest better knowing I would be alerted if someone tried to wander off with my $300 Christmas light.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob D.",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Holy loud!! Great buy!",
      "text": "Just as described and shipped fast. I actually ended up putting this on my key chain so I am able to pull it if someone approaches me. Very great for safety and I believe every woman should have one just to be safe! Great buy and will definitely purchase more.",
      "rating": 5.0,
      "verified": true,
      "author": "PasqualeB",
      "helpful_votes": 13,
      "publication_date": 20170707
    },
    {
      "title": "SAFE!",
      "text": "I've bought so many of these for friends and myself. They're a non-lethal safety device that can't ever be used against the victim! I've had family members walking around with kitchen knives, wasp spray, and mace: all things that could easily be used against them in an emergency. Not this thing. It just screams and everybody runs.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "LOUD!",
      "text": "Surprising loud for its size. I'm going to use it on my kayak so as to scare away any thief when I'm camping. Don't need someone walking off with my kayak. I like how I can tie one end to the kayak and stake the other end to the ground. They lift my kayak and a loud alarm will go off. Nice product!",
      "rating": 5.0,
      "verified": true,
      "author": "Guitar Man",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Be prepared — it’s too loud",
      "text": "I wanted to test this out when I finally got it. I quickly unclipped ready to hear what it would sound like. It doesn’t sound like the video at all. It’s crazy loud. It was so loud I dropped the top piece and struggled to put the top back in. Whenever I think about it a month later my ears still hurt.",
      "rating": 2.0,
      "verified": true,
      "author": "Leslie Cox",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Definitely loud",
      "text": "This little guy is packing some major sound. I accidentally removed the top slightly when throwing my bag into the car (it's attached to the outside) I definitely got a headache... I'm small spaces this thing will work wonders. I'm unsure how effective it would be over long distances in large open spaces to notify people. But you would definitely know when you are getting closer to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tilikum",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Not SUPER loud but very loud",
      "text": "It's loud. Not SUPER loud but very loud. Loud enough to do its job. I intend to carry this with me when I go on hikes in addition to bear spray. I love how compact this alarm is and I love the fact that it can easily be setup as a tripwire. It's exactly what I have been looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris King",
      "helpful_votes": 2,
      "publication_date": 20171023
    },
    {
      "title": "Loud little safety instrument",
      "text": "My son comes home at 1am, so I'm worried about him at night. NYC doesn't allow stun gun, so I bought him this. He hooked it to his pant belt loop. He tried it, and darn it is loud. The whole point is if someone robs him, he can act like he is taking money out of his pocket and pull the pin. Loud siren may make them run away",
      "rating": 5.0,
      "verified": true,
      "author": "Sabina",
      "helpful_votes": 2,
      "publication_date": 20170614
    },
    {
      "title": "DAMNED LOUD!",
      "text": "Any other questions? Small and loud, looks just like a USB stick on your keychain. And did I mention, DAMNED LOUD!",
      "rating": 5.0,
      "verified": true,
      "author": "Some Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170510
    },
    {
      "title": "Great",
      "text": "I have this hooped to my purse with a carabiner on the other end. I hold the carabiner when I walk. That way, if some steals my purse, I will automatically pull the cord and the thief runs off with the purse AND the alarm.",
      "rating": 4.0,
      "verified": true,
      "author": "Denise Cook",
      "helpful_votes": 3,
      "publication_date": 20170917
    },
    {
      "title": "Great security device",
      "text": "Great item, tie it to your plants & the other end to the fence, when those dirty critters grab your garden plants & try to run you will be alerted by the loud alarm, & hopefully you'll be able to intervene 👍🏻🤞🏻",
      "rating": 5.0,
      "verified": true,
      "author": "J.B.E. 😜",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Works perfectly !!!",
      "text": "Used this device to alarm us of mailbox unauthorized entry. Placed device in mailbox with some creative placement and anchors worked like a charm. Device warded off mail box thief’s when alarmed was triggered. Perfect solution!",
      "rating": 5.0,
      "verified": true,
      "author": "MAC",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "Bears in the woods",
      "text": "Easy to use BUT it takes to much tension to pull it apart, not Sensitive it sticks until pulled hard. I had to sand it down to give it a easier separation. After all there are more than bears in the woods.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Would purchase again.",
      "text": "Will buy these for my daughters friends when they go off to college. We own 3 and love them. What I like best is they can not be used against you to harm you in any way if taken from you and you can take them through security at the airport. both my daughter have them hanging off their back packs. Just pull if you have any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty D.",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "however I do highly recommend this to anyone trying to increase personal security because ...",
      "text": "It isn't as loud as they say it is and it isn't completely water proof, however I do highly recommend this to anyone trying to increase personal security because it is substantially loud and it definitely catches peoples attention. I also would recommend this to anyone with a campsite in the middle of the actual woods because if used the right way, this product can become a very useful tripwire.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynda Montroy",
      "helpful_votes": 4,
      "publication_date": 20170503
    },
    {
      "title": "Personal Alarm",
      "text": "Arrived today and I just had to test it out. Hope I never have to use it but if I do it is quite easy to do and very loud. Looks good on my key ring and very lightweight. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Mazzeo",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Not as loud as I had hoped",
      "text": "I purchased the sound grenade and another emergency personal alarm shaped like a lady bug ( Sound grenade looks sleek and could double as a USB dongle--however, when I compare the sound to the lady bug alarm, the sound grenade doesn't make me wince, while the lady bug does. Both are supposed to be at 130 decibels, but the lady bug is definitely louder. The sound grenade is $10 while the lady bug is $7, so I would say comparatively, the sound grenade is overpriced for the purpose it serves.",
      "rating": 3.0,
      "verified": true,
      "author": "KingV",
      "helpful_votes": 7,
      "publication_date": 20170622
    },
    {
      "title": "Cool product.  works as described.",
      "text": "As described. Great product. Unbelievably loud. Makes my teeth vibrate when set off indoors. FYI though you have to pull pretty hard to set it off. 5+ pounds of pressure I would guess. That surprised me.",
      "rating": 5.0,
      "verified": true,
      "author": "teresa",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "Not very loud",
      "text": "Not a very loud alarm at 130db. I released the pin when I received this today inside my home (in the kitchen), and my 2 dogs were not even startled.",
      "rating": 2.0,
      "verified": true,
      "author": "Daisylover",
      "helpful_votes": 3,
      "publication_date": 20180128
    },
    {
      "title": "👍🏼",
      "text": "TOO LOUD! Lol I opened it for a second (took me 5 seconds to put it back cuz i was nervous and the noise was distracting) and almost gone deaf! 😂 I hope it would be easy to use if needed, and I hope I don’t need to use it! 😬",
      "rating": 5.0,
      "verified": true,
      "author": "Amy007",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Not as loud as I thought but still good",
      "text": "Not as loud as I thought but still good if I needed support. I dont know if its water resistant, I've not been out in the rain with it. I would buy some for my friends.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Feeling safe camping",
      "text": "So this thing DEFINITELY makes you feel a lot safer at night while camping lol. We spent a few nights in bear and wolf infested Canadian Wilderness and this gave us piece of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Not quite loud enough.",
      "text": "I liked the size and the loop at each end for attaching a wire but it isn't quite loud enough to hear in my house when placed about 20 feet out in my yard.",
      "rating": 4.0,
      "verified": true,
      "author": "Janet Foster",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "an attempt at adding safety is always worth $10",
      "text": "got this for my sister for college, call me over protective but i don't care I'm just glad she has this and it only costs $10 so why not. honestly.",
      "rating": 5.0,
      "verified": true,
      "author": "Since 2011",
      "helpful_votes": 5,
      "publication_date": 20170112
    },
    {
      "title": "Malfunctioned and sounded with pin still in.",
      "text": "Started constantly chirping with the pin still in. We tried all sorts of things to get it to stop and it wouldn’t. Contacted BASU and was told to put it in water to mask the sound and deplete the battery but water didn’t mask the sound enough at 2am! I’m now afraid to travel with this because can you imagine this going off in the middle of the night in a hotel room?! It would wake the entire place and for no reason! The unit is about 5-6 months old.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin H",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Basu Alarm",
      "text": "This thing is loud, but wouldn't work well with mono-filament line for trip-wires. It takes a lot of force to pull the thing apart. Might work well for women though to be used for emergency situations.",
      "rating": 2.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "They are Okey.",
      "text": "I thought they would be loader. Maybe 3.5 stars would be better. I didn't test for waterproof. But I would buy them again for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Myers",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Worked once, now doesn't",
      "text": "I tested this when I received it and it made a nice loud noise. I carried it in my purse and about a month later, tried to demonstrate to a friend and it doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "It's definitely loud and irritating, but I don't think ...",
      "text": "It's definitely loud and irritating, but I don't think it's as many decibels as claimed. If it were, I would barely be able to stay in the same room with it... I think it works okay though.",
      "rating": 4.0,
      "verified": true,
      "author": "Buyer of Stuff",
      "helpful_votes": 2,
      "publication_date": 20170815
    },
    {
      "title": "... as loud as they claim and the pin is easy to pull but requires enough pressure that it won't ...",
      "text": "It's as loud as they claim and the pin is easy to pull but requires enough pressure that it won't slip out by accident. I used to teach women's self defense and recommend this. A simple deterrent that doesn't require extensive training but could give you crucial seconds to get away or even scare off a threat.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney Davis",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Good product",
      "text": "Pretty good product. Shipping was super fast. The alarm is loud. Recommend for adults only, as a child would most likely set it off by accident, as the top comes off easily. Well made product, discreet design.",
      "rating": 5.0,
      "verified": true,
      "author": "Onlineshopperforlife",
      "helpful_votes": 2,
      "publication_date": 20170506
    },
    {
      "title": "Good personal protection for loved ones",
      "text": "Got these for the girls in my family. Nice stocking stuffer. The girls love them as some of them are in college. Best to tie a shoe string on the cap end and use a carabiner to the other so it can be worn on a belt loop. This makes it easier to grab in an emergency. The only issue I have is it doesn't sound a loud as I would like.",
      "rating": 4.0,
      "verified": true,
      "author": "Mao Xifaji",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "I feel just a little bit better knowing they are carrying these as they walk across ...",
      "text": "Got three of these for my daughters. I feel just a little bit better knowing they are carrying these as they walk across campus or in the mall parking lot.",
      "rating": 5.0,
      "verified": true,
      "author": "zibby",
      "helpful_votes": 3,
      "publication_date": 20170207
    },
    {
      "title": "Actual alarm works well",
      "text": "The alarm is VERY loud. It is easy to pull, but won't come go off on accident if you put it in a bag. The carabiner clip it comes with did break after a year. The alarm is also rather large in size.",
      "rating": 4.0,
      "verified": true,
      "author": "rae",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "personal alarm",
      "text": "The way it is designed, as the battery drains, it will start alarming and without a way to change the battery it has to be destroyed to stop the siren. Found this out on a trip, luckily it wasn't on the plane.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Novak",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "piercing sound",
      "text": "I connected it to my Christmas inflatable on my front lawn. Its very loud and I'm sure my son will hear it since his room window is close to where its at. Hopefully I won't have to \"hear\" it.",
      "rating": 4.0,
      "verified": true,
      "author": "adellmarie",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Works as described, Very Tweet",
      "text": "Arrived in described good condition. I would call the noise a loud high pitched tweeting or chirping noise. I think it would be enough to get a good persons attention if they were not terribly out of sight, or maybe annoying enough to make a shady one walk the other way. The clip is fairly easy to pull and reinsert for quiet. Probably not a bad item to have handy for you or your teen driver.",
      "rating": 4.0,
      "verified": true,
      "author": "StayCoolHoneyBunny",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Way too quiet. Waste of $20.",
      "text": "I was nervous to test this so I waited a bit before pulling the pin. This thing is way too quiet. I doubt this alarm would even turn heads, let alone frighten off an attacker or call attention to your distress. I regret wasting $20 on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Meghan",
      "helpful_votes": 24,
      "publication_date": 20160918
    },
    {
      "title": "BASU e alarm defet",
      "text": "I bought 4 BASU e alarms, 1 of the alarms has a defect. The alarm is on my desk and it keeps beeping about every 10 minutes. Right now, I have put the alarm in my garage. This has been going on or 4 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Dorothy Dunn-joy",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Worth the money",
      "text": "Serves its purpose and the sound is definitely noticeable. Worth the money and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Marko",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "NOT loud enough to be of real use.SCAM.",
      "text": "I wasted my money here. It's not lound enough to be heard 30 feet away.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Super loud!",
      "text": "Only lasts for a year or so battery wise. However great for several uses. Super loud, do not open indoors. Makes a periodic chirping sound when dying.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great alternative to pepper spray.",
      "text": "Great sense of security. I used to have pepper spray but with a toddler I didn’t want to risk her accidentally spraying herself or others. This is a very good alternative",
      "rating": 5.0,
      "verified": true,
      "author": "Guavashelly ",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Good little safety device",
      "text": "I just got this and took it with me on a trip to the city, luckily I didn't have to use it! I hope I never do but glad to have a little safety feature with me.",
      "rating": 4.0,
      "verified": true,
      "author": "VinoSucker",
      "helpful_votes": 2,
      "publication_date": 20170419
    },
    {
      "title": "Not loud enough!",
      "text": "Bought one for a gift and one for myself. We were in a room about 10' x 14' (w/ hardwood floors) when the gift recipient tested it. It was not loud enough! Smoke alarms are louder. I would have been satisfied with a smoke alarm equivalent volume. I do like that the pin is separate from what actually supports the unit. But, should be louder.",
      "rating": 2.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Over priced",
      "text": "Over priced compared to other alarms, not as loud as others that are much louder.",
      "rating": 3.0,
      "verified": true,
      "author": "At",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great for camping. Animals leave quickly!",
      "text": "Bought this for myself after getting a purple one for my wife. LOUD. Has many uses. I use it when camping in my RV.",
      "rating": 5.0,
      "verified": true,
      "author": "R. D. Byrne",
      "helpful_votes": 3,
      "publication_date": 20170112
    },
    {
      "title": "Just as described!",
      "text": "Oh man, this thing is louder than I expected. If you receive this and it doesn't leave your ears ringing then you may have gotten a dud because this sucker is loud! Just as described, thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Sena",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "LOUD LOUD LOUD",
      "text": "These are awesome....clips are firmly held in place but come apart easily with a quick pull.... I have lots of uses for these... I bought 3 and they all scream....",
      "rating": 5.0,
      "verified": true,
      "author": "tim r.",
      "helpful_votes": 11,
      "publication_date": 20170129
    },
    {
      "title": "CHIRPING NOISE CANT GET RID OF",
      "text": "After you've had it for a while, it starts making a chirping noise. I can't open it to remove any batteries.I dunk it in water to drown it but its still chirping. I want to smash it with a hammer but I'm afraid if it will beep louder.",
      "rating": 1.0,
      "verified": true,
      "author": "Msairs",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Help when you need it!",
      "text": "I liked that the alarm fits in my bag on my keychain, therefore, is easy to take with me wherever I go. The alarm is loud enough to attract attention and that is what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Di",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "It is a great trigger to use to guard against entry into shelving ...",
      "text": "The alarm is not that loud. It is a great trigger to use to guard against entry into shelving or small items but not to guard against a major assault or determined thief.",
      "rating": 3.0,
      "verified": true,
      "author": "James J.",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "As a woman walking alone at night on her way home from work this is just another thing besides being alert and cautious to make me feel better. Thank you for creating a wonderful product",
      "text": "Delivered quickly! And I feel much more secure with this device on my keychain. As a woman walking alone at night on her way home from work this is just another thing besides being alert and cautious to make me feel better. Thank you for creating a wonderful product. Wish I had it in college!",
      "rating": 5.0,
      "verified": true,
      "author": "Ophelia",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Works well",
      "text": "Works really well as an door alarm...simply drive small tacks in the door and the moulding, then tie each end to the nails , so that it separates the top from the bottom",
      "rating": 5.0,
      "verified": true,
      "author": "lee shelton",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Five Stars",
      "text": "Very sturdy and MUCH louder than I anticipated! We're very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Peacemaker",
      "helpful_votes": 3,
      "publication_date": 20170131
    },
    {
      "title": "Not very loud.",
      "text": "I guess it would help in some situations, but if it is covered at all it's barely heard. I was expecting it to be much louder.",
      "rating": 3.0,
      "verified": true,
      "author": "BOYSx3",
      "helpful_votes": 4,
      "publication_date": 20170316
    },
    {
      "title": "Wife is happy to carry it around",
      "text": "Alarm is LOUD!!! Wife is happy to carry it around.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Yeung",
      "helpful_votes": 4,
      "publication_date": 20170322
    },
    {
      "title": "Good until it's not.",
      "text": "This was great until it started going off by itself, without the plug being pulled. The past three days I've been dealing with sporadic alarms from it, with no way to turn it off. But I will say, the battery is quite good: I've been trying to get the battery to run out and it's hour three of constant noise.",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Sound is great! Nice gift for the ladies in your life ...",
      "text": "Sound is great! Nice gift for the ladies in your life for deterring anyone or if you have an emergency kit. I could see this being using well for those that like hiking or camping, great as a back-up for those in any form of distress.",
      "rating": 5.0,
      "verified": true,
      "author": "Tori",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Great Security Alarm",
      "text": "Very loud. This could be used in many ways. It’s even small and light enough for a child to wear around their neck",
      "rating": 5.0,
      "verified": true,
      "author": "T. Douglass",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Work well",
      "text": "Loud, work great as kid identifiers when hiking or to scare off wildlife",
      "rating": 5.0,
      "verified": true,
      "author": "AMS Pixie",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Good",
      "text": "I gave them as gifts. Mine fell apart the first time I tested it",
      "rating": 3.0,
      "verified": true,
      "author": "AnAmazonShopr",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "I bought this for my college age daughter to use ...",
      "text": "I bought this for my college age daughter to use around campus at night. But it is much bigger than pictured and she found it a pain to carry around.",
      "rating": 3.0,
      "verified": true,
      "author": "J. A. James",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "I'm pretty sure I could sleep through this after work",
      "text": "Not as loud as I was expecting. It could be that I'm desensitized to sound since I spend 12.5 hrs at a trauma center and I we have some pretty loud alarms. Im pretty sure I could sleep through this right after work. Maybe I should have my daughter pull the pin from another room.",
      "rating": 3.0,
      "verified": true,
      "author": "Shaun C.",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "NOT VERY LOUD",
      "text": "Not loud enough to be useful. Unfortunately I ordered four of them... waste of money.... ordered the other brand to see if they are better.",
      "rating": 3.0,
      "verified": true,
      "author": "Conangib",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Real nice! Loud",
      "text": "Real nice! Loud! Will certainly attract attention and deter most attackers. Bought one for each of my teenage daughters. Gives me a little piece of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "King Bob",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Loud, I put these on a commercial fence with ...",
      "text": "Loud , I put these on a commercial fence with fishing line trip wires , hopefully they will stop or scare people from cutting my fence .",
      "rating": 5.0,
      "verified": true,
      "author": "David Menzel",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "DO NOT BUY!!!!",
      "text": "Started going off on its own while sitting on a counter. Removing and reinserting the pin did not help. Not very loud. The material they used to coat the item scratches up very easily.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Price",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Loud! They work!",
      "text": "These things work!! Louder than you think, we have problems with black bears in the area we hunt, this should be an effective detour for hungry bears!",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Was easy to set up a trip wire",
      "text": "Huge box for a little item. Was easy to set up a trip wire. Very light and easy to operate",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "It is loud enough to get noticed.",
      "text": "This little guy is pretty loud so I am happy that I purchased it. Great to use if you have something that has to be polled that can trigger it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kasgardens",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Makes you feel safe",
      "text": "This gadget makes me feel safe when out on walks/runs with my jogging stroller or doing any tasks out with my toddler. Thats when I feel the most vulnerable. Im buying one for my niece, nephews, sisters, mom and brother. Pretty much my entire family is getting one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Five Stars",
      "text": "Decently loud for such a small size. Using for an alerting trap around the house",
      "rating": 5.0,
      "verified": true,
      "author": "kalam williams",
      "helpful_votes": 2,
      "publication_date": 20170524
    },
    {
      "title": "They like the compactness and the LOUDNESS",
      "text": "Gave as gifts to my wife and daughters. They like the compactness and the LOUDNESS!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve&theGang",
      "helpful_votes": 2,
      "publication_date": 20170525
    },
    {
      "title": "Security",
      "text": "Gave to daughter for Christmas with her car. Works as described. Noise is loud enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Smith",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "I bought several for the women in my family and they appear to be satisfied.",
      "text": "How much would you pay for piece mind? Apparently you don't need to pay much. I bought several for the women in my family and they appear to be satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Joel L Brown",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Good against sleepless children",
      "text": "I use mine to keep my kids from running around at night...I suppose it would work on bears too",
      "rating": 5.0,
      "verified": true,
      "author": "John Barone",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Great product. Each woman in my family received one ...",
      "text": "Great product. Each woman in my family received one from me. We all feel more safe and secure because of it. The customer service dept is top notch. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Susan B",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Excellent overall",
      "text": "Early warning alarm: this is the one you want for the money",
      "rating": 5.0,
      "verified": true,
      "author": "J.P.",
      "helpful_votes": 0,
      "publication_date": 20190717
    }
  ],
  "product_meta": {
    "title": "B A S U eAlarm+ with Tripwire Hook, Emergency Personal Alarm, Battery Included, Carabiner Included, S.W.A.T. Black",
    "description": "Color:S.W.A.T Black\n\nWe are born explorers. The eAlarm+ helps us explore with confidence. It is an ultra-compact emergency alarm, small in size but big in sound. Once you pull the pin, the device emits a 130 decibel alarm. The siren will sound continuously for 30 minutes unless pin is returned to device. The eAlarm+ allows maximum utility for those intending to use in the outdoors with a rugged rubber water-resistant shield. The extra bottom hook feature allows easy construction of a tripwire or campsite alarm. INCLUDED: Battery and Metal Carabiner.\n\n\n\nFROM THE MANUFACTURER\n \n\n\n\n\nSimple and Sleek Simplicity is the key in any great product. Personal safety is no different.\n\nCompact and portable. How can you carry something big and bulky? The answer is you can't. We've created the World's Smallest SOS Alarm. In fact, if you find a smaller+light+louder alarm, we will give you ours for free. That is the B A S U CHALLENGE.\n\n\n\n\nInstant Activation Just PULL THE PIN to activate.\n\nInstant Clip It comes with a pre-installed carabiner (metal hook) so you can clip on a keychain or backpack with extreme ease.\n\nTripwire Ready Transform into a tripwire or campsite alarm very quickly.\n\n\n\n\nPersonal Safety Tech, done right. B A S U designs and manufactures the best personal safety devices in the world.\n\n\n\n\nAbout the Startup Describe your product in 3 words.\n\nSOUND OF SAFETY\n\nHow did you come up with the idea for this product?\n\nWe've thought about personal safety for a while and looked at rigorous research to find what proves to be the best crime deterrent for those who don't want to use a weapon like a knife or pepper spray. Of course, the answer was a personal alarm. So why not innovate and make it much better? That's exactly what we did.\n\nWhat makes your product special?\n\nIt's built by artists who care about safety and making great, affordable products.\n\nWhat has been the best part of your startup experience?\n\nMeeting customers, users, and speaking with those who have used the device and find it valuable. Also speaking with people who say it saved their life!",
    "rating": 4.3,
    "feature_bullets": [
      "America's Number 1 Trusted Premium Emergency Alarm - Built with Airplane Approved Batteries. IT'S NOT REAL WITHOUT THE ROBOT",
      "2 x Brand New CR1632 Batteries Included",
      "Patented eAlarm Plus SmartHook Technology: Additional Semicircle loop allows instant Tripwire Alarm",
      "HOW IT WORKS: Pull the pin to activate the alarm. Re-insert the pin to deactivate the alarm. COMMON USES: Personal Alarm, Criminal Deterrent, Acoustic Animal Repellent, Rescue Signal, Intruder Alert, Tripwire Alarm, Portable Alarm, Survival Kit",
      "WHY B A S U : 24/7 Award-Winning USA-based Customer Support"
    ],
    "specifications": {
      "Product Dimensions": "3.4 x 1.22 x 0.51 inches",
      "Item Weight": "0.64 ounces",
      "ASIN": "B01ISNQK04",
      "Item model number": "RC1BL",
      "Batteries": "2 Lithium Metal batteries required.",
      "Customer Reviews": "4.3 out of 5 stars632 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#904 in Amazon Launchpad",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 21, 2016",
      "Manufacturer": "BASU"
    },
    "categories": [
      "Security & Surveillance",
      "Electronics"
    ],
    "price": 24.99
  }
}