{
  "website_summaries": [
    {
      "verdict": "Tough external SSD that provides all of the basic features you'll need at a reasonable price point.",
      "pros": [
        "You'll have plenty of options for picking the storage capacity you want because this model is offered in sizes from 128 GB to 4 TB",
        "Carries a nice price per GB of storage",
        "Has a tough external case to stand up to rough treatment",
        "Works well in extreme temperatures"
      ],
      "cons": [
        "Trails some others with read/write speeds of 450 Mbps",
        "A few models are defective out of the box"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "At first when you hold it and it feels cheap like there is nothing inside but that's the nice thing ...",
      "text": "Does what it says it does. At first when you hold it and it feels cheap like there is nothing inside but that's the nice thing about solid state hardrives. No internal parts that move. I've been beating the crap out of it for several months now with no consequence. The last external hardrive I had I dropped it from two feet after having it a whole week and it's case exploded on the floor. The needles bent inside and I lost everything I put on it. Solid state is worth the extra dollar.",
      "rating": 5.0,
      "verified": true,
      "author": "mark volz",
      "helpful_votes": 50,
      "publication_date": 20170623
    },
    {
      "title": "WOW OH WOW !!!",
      "text": "WOW OH WOW !!! In the blink of an eye so to speak. SSD drives are F..A..S..T.. Copied a full length movie file in maybe 3 seconds. This copies file(s) to as fast as it takes one to sneeze. Can't wait until the day SSD prices drop to flash drive prices and the memory expands into many TB. One day all computer drives will be SSD. All of them. I use this on a iMac with USB 3.0 for my iTunes media storage. It's always plugged in to the iMac's USB and does not need external power. I want more but just can't afford that...yet. But hopefully some day when prices fall.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall M",
      "helpful_votes": 34,
      "publication_date": 20170726
    },
    {
      "title": "As good as the big names",
      "text": "I know what you're thinking, can I trust this new company or stick with Sandisk or Samsung or whatever? Absolutely. After reading the reviews for similar solid state hard drives made by both of the big names (which surprisingly were not too good, structural issues? jacks falling out? seriously?). I thought I'd give VectoTech a try and have not regretted it. I transferred maybe 80 gigs to my 250 GB drive and the drive barely warmed up. Go for it.",
      "rating": 5.0,
      "verified": true,
      "author": "John E Sokolowski",
      "helpful_votes": 40,
      "publication_date": 20170114
    },
    {
      "title": "Defective unit? Super super slow!",
      "text": "Was excited to get this and thought it was a great deal on an external SSD. However, the unit I received was operating at 40MB/s as opposed to the 400MB/s claimed. That is even slower than my NON-SSD drives. Called their tech support and they had me try a few things, but nothing made a difference. Returning...could have just been a defective unit, but I am going to go with a brand I know instead. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 9,
      "publication_date": 20190425
    },
    {
      "title": "Excellent for running virtual machines",
      "text": "I've only had it for a couple of weeks and I can say is that it's excellent, I get really high speed transfers and am able to run my virtual machines from this drive just as fast as when they were local (I have a Mac with SSD, but only 512GB). I can also say that this drive is VERY light, I don't have experience with other SDD external drives, but compared to my traditional 3.5\" external HDDs, I was pleasantly surprised, since it already feels like I'm carrying rocks in my backpack every time I travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Cesar Alvarez",
      "helpful_votes": 15,
      "publication_date": 20170511
    },
    {
      "title": "Amazing performance!",
      "text": "I had been looking at SSDs for a while but the prices scared me away. Hence, I was a little nervous about the low price on this particular 2TB drive. But I read the reviews and ordered it. I'm a big believer in backups, but they can take a long time with conventional external drives. When I was able to back up 25GB of small files (family photos) in two minutes flat I was sold -- bought a second one immediately and it works great, too. I'm using a late 2012 iMac with Mountain Lion and I've never seen this computer work so fast! I will update if things change but for now, I am one mighty pleased customer!",
      "rating": 5.0,
      "verified": true,
      "author": "FilmFan",
      "helpful_votes": 5,
      "publication_date": 20180818
    },
    {
      "title": "It Started Out Good",
      "text": "I'm a Graphic Communications student, so being able to store the work I create is very important to me. For three months my Vectotech Rapid External SSD worked great. Now I plug it in and get the message that the drive is \"corrupted and unreadable\". I can't believe this is happening. Now I have to find a place that does data recovery in the hopes of getting my work back. Very unhappy.",
      "rating": 2.0,
      "verified": true,
      "author": "Prosey",
      "helpful_votes": 8,
      "publication_date": 20190109
    },
    {
      "title": "New Unit Received...replacing old one.",
      "text": "Recieved a new unit from the company and I'd like to say they've improved a ton since the last unit I had. Keep up the great work guys. High write speeds...copying a 3GB video file in under 20 seconds...just perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 8,
      "publication_date": 20191003
    },
    {
      "title": "Faulty",
      "text": "I bought this recently and have barely used it; but it randomly ejects from my computer while I’m using it, which has caused me a lot of trouble with my files. I think it might be an issue with the cable. Very disappointed since it was quite pricey.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181114
    },
    {
      "title": "Total garbage",
      "text": "Bought this in January and by the end of May drive was randomly freezing until it became dead,not recognized by any PC. Customer support is rude and unprofessional. Stay away if you value your time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Dymashok",
      "helpful_votes": 7,
      "publication_date": 20190527
    },
    {
      "title": "Final Update - 4.5 Stars - Excellent Support",
      "text": "My original drive appeared to have a bad controller in that it would report a corrupt file system at least once a week. Reformatting the drive would allow data to be written, but it would become corrupt again after a few days. I'm happy to report that VectoTech provides excellent support for their products. They provided a pre-paid shipping label and sent a new drive even though initial testing didn't duplicate the issue. Probably due to time constraints. The new drive is working without issue and is used to store games from Steam, Epic, etc. Performance is excellent via USB-C cable and I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "MorpheusNC",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Not a plug 'n' play device",
      "text": "This SSD is just what I needed after having two drives with disks fail in the past 2 years. The seller very thoughtfully sent a message which explains the consequences of failing to follow the somewhat cryptic manufacturer's instructions. This is not a plug and play -- you must first \"erase\" the drive and format it for your particular type of computer. But the seller's message arrived after I had already started using the disk, so would not have helped if I had misunderstood the manufacturer's instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan G. Allison",
      "helpful_votes": 5,
      "publication_date": 20181208
    },
    {
      "title": "Great Drive!!!",
      "text": "Easy to setup on my Xbox One S, specifically purchased this drive do to slow load time on Battlefield 1. The load time is super fast now and I'm basically the first one to load into the game waiting on the rest of the players to load. I highly recommend this drive, plus it was $60 cheaper then the Samsung version",
      "rating": 5.0,
      "verified": true,
      "author": "Zorin",
      "helpful_votes": 6,
      "publication_date": 20170223
    },
    {
      "title": "Speed comparable to Samsung T5, but...",
      "text": "Using the benchmark program CrystalDiskMark, the VectoTech speed ratings were comparable to the Samsung T5 (1TB) using a USB 3.0 interface (5 GB/s). However, I considered this SSD inferior to the Samsung due to size and packaging. It is about 3x the size of the Samsung and is housed in a plastic (not metal) shell. Also, the VectoTech website does not give the impression that the company has deep technical resources or adequate product support during the 3-year warranty period. OK, if you can't afford the few dollars more for a brand name drive.",
      "rating": 3.0,
      "verified": true,
      "author": "TJD",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Flawless, highly suggested portable HD!",
      "text": "Okay, I had nothing much in the way of a unique review for my portable external hard drive, so I admit I didn’t find a need to write a review. All has worked well for months. Then, out of the blue, VectoTech sent me a complimentary carrying case! Thank you, and of course, your company deserves a rate full review! I’m not compensated for this, but this is a generous reminder of how shoppers should pause to say thank you. On the least, I hope my review will nudge potential buyers to try VectoTech. I have found no problems with the drive I’m sure to fill very soon with my hefty work audio files!",
      "rating": 5.0,
      "verified": true,
      "author": "PersonalShopper",
      "helpful_votes": 4,
      "publication_date": 20190303
    },
    {
      "title": "Great for virtual machines!",
      "text": "I'm always looking for more storage for all types of systems... Mac, Windows, and so on. Being very technical I find myself running low on primary disk due to a vast number of virtual machines I use, including Linux and many other platforms. I was hesitant to try using a USB drive for this purpose, but since this was SSD, thought it might work. Well it did, and does very well. If I didn't know the VM's were running on an external drive, it would go unnoticed as they perform very well, even when running several simultaneously. Overall, if you're looking for an inexpensive way of adding additional storage without sacrificing performance, then I would highly recommend this drive.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 17,
      "publication_date": 20200201
    },
    {
      "title": "This Item is Useless and Unreliable",
      "text": "The only reason this did not get a zero star is because it doesn't go lower than one .This is the second one I have had corrupted for absolutely no reason whatsoever and now it is too late to exchange for a different type. an extremely frustrating piece of expensive rubbish. Both of them were corrupted a week after utilizing, same problem. first one was exchanged for current piece of rubbish.",
      "rating": 1.0,
      "verified": true,
      "author": "captmaxx",
      "helpful_votes": 2,
      "publication_date": 20200708
    },
    {
      "title": "Recent upgrade from 2 TB",
      "text": "Very pleased with this purchase. It is slightly faster than the highly regarded 2 TB Samsung. Concerns about over heating have not occurred. I transferred 1.2 TB and it was slightly warmer at the end of the transfer and has cooled off with regular use. Weight is slightly heavier than the Samsung. Didn't rate tech support because I haven't had any problems. The initial partition was setup for a generic PC / Mac. I converted the partition APFS and disk performance seems faster. Highly recommend this drive if you are looking for maximum storage capacity for an external with USB-C connection.",
      "rating": 5.0,
      "verified": true,
      "author": "Coast Guy",
      "helpful_votes": 17,
      "publication_date": 20200121
    },
    {
      "title": "Doesn’t keep connectivity on Mac",
      "text": "My Mac continually disconnected the drive and the speed at which it transferred data was awful. Their customer support was non-existent. They should t be allowed to sell this without informing customers that Mac connectivity issues existed by many customers I found online who have reported identical concerns.",
      "rating": 1.0,
      "verified": true,
      "author": "Critical Issue",
      "helpful_votes": 2,
      "publication_date": 20200919
    },
    {
      "title": "Amazing 4TB SSD!",
      "text": "OK so I am slowly moving all my regular drives over to SSD. Here are the main advantages: 1) Almost instant on whenever you access it 2) Transfer speed that allows me to do audio video production 3) Insanely small for what it is packing 4) Totally quiet. I record audio with these in the room Only had this Vecotech for about a week and so far it has been amazing. Did two or three audio edit projects on it and no problems. Really impressed, would buy two more!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryant Falk",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Large capacity and no moving parts.",
      "text": "After a number of external hard drive failures, I wanted to switch to a solid state drive with enough space for at least my music and photos. This drive was rather expensive, but seemed to serve the purpose. It seems to work OK. The only problem I've had is that a couple of times after shutting down my computer, I've gotten a message saying this drive was not shut down properly. (The drive does not have an on/off switch). I'm not sure what prompted those messages. I haven't had that happen recently though. All in all I've been happy with the drive. I hope the price for SSD drives continues to drop after my experiences with spinning disk drives.",
      "rating": 5.0,
      "verified": true,
      "author": "Weatherbird",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great SSD",
      "text": "I've only had my SSD for a few days but so far it is excellent. I have a Goboxx Laptop with a 200GB SSD and 32 GB of RAM that I use with the ADOBE Creative Cloud as well as Realusion 2D and 3D Animation programs. . The VectoTech is just like having another TB of internal memory in terms of performance and write speed. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Gray",
      "helpful_votes": 6,
      "publication_date": 20170226
    },
    {
      "title": "It works but plug it in before turning on computer.",
      "text": "I'm using this with Windows 10 and it is only detected by my computer if I plug it in before turning on my computer. Also, the cable end that plugs into this external drive can be connected either way but I found out that it works better if you plug it in one way only so I marked the top of the cable that needs to be facing up and I also left the cable plugged in but not to the computer because I'm only using this as a backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate2018",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Delivered on promises, speed and portability is great",
      "text": "It delivered on everything it promised. The capacity is great, it is very portable and lightweight, and the speed is fantastic. *Note* to get the full advertised speed, you need to use the USB 3.2 cable as well as a USB 3.2 port on your computer. If you computer or laptop doesn’t have this type of port, you will not get the full advertised speed. Not the manufacturer’s fault, you just gotta do your homework. I can’t answer for longevity, but I’m using this as a more permanent storage drive for all of my valuable files.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil C",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Connections began to fail after 1 month",
      "text": "I can still use it, but regardless which cable/port/computer I use, it will flutter in/out of being connected even on a perfectly still table. It'll work 95% of the time, but that 5% is enough to make me question if it's capturing my data accurately. Plus, it's tiring to constantly be unplugging and replugging it in, hoping for a more stable connection. Would not recommend. My workplace gave me a competitors model when they saw how much I struggled with this cheapo drive. You get what you pay for I guess. The other one works fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Unreliable and corrupts data.",
      "text": "I’ve had a lot of different external hard drives, this is my second ssd hard drive an it has to be the most unstable file system ever. Literally getting errors all the time with this drive. I lost so much data repairing and recovering files from OTHER backups it’s just an overpriced toy that sure has speed but but it is NOT reliable at all. I’ve been a CTO at several healthcare IT companies across the United States I will never purchase a device from this manufacturer anytime soon.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Works Great with Parallels",
      "text": "Update - 8 months later and still going strong hosting Windows 7 VM using parallels on an iMac. I bought this to use with parallels to host a windows VM on an iMac. Yes the device is very light but what else would you expect? Might have been happier with a longer usb cable but thats a nit. Installation was mindlessly easy as was reformatting for the mac. The windows VM is very snappy - been it using for a week or so. If there is an issue I would of course revise this review but so far very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Erlanger",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Insanely happy customer!",
      "text": "Transfer Speed on a 3.0 port was around 400 MB/s, let me tell you that this thing is ridiculously light! Like all SSDs it's much lighter than a HDD so the size of the casing is close to the size of the external HDDs but just much lighter, and faster. You're going to want to have a rubber band or something for the cord's storage because it doesn't come with anything, but that's as much of an issue I had with it. Recommended buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Benjam Limjap",
      "helpful_votes": 3,
      "publication_date": 20180809
    },
    {
      "title": "Changing the USB cable changed my rating",
      "text": "I initially posted the following scathing review with one star. \"It served its purpose for six months, but now the computer no longer recognises it. The blue light indicates that it's taking power from the computer, but each time I connect it, I get a \"USB device not recognized\" message.\" However, a change of USB cable seems to have fixed the problem. I'll upgrade to 4*. I'll withhold the fifth star on the gounds that the original USB cable seems suspect.",
      "rating": 4.0,
      "verified": true,
      "author": "Delta D.",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Make sure your system supports usb 3",
      "text": "This is a great piece of technology that will make it much easier to store compromising evidence farther away from prying eyes. I wish I could give it 5 stars however, while trying to enable usb 3.0 on my device, I accidentally disabled all usb ports and as a result my computer is currently unusable. Aside from this minor incovenience the product I received satisfies all my needs and deserves as high a rating as I can give, given the circumstances.",
      "rating": 4.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 2,
      "publication_date": 20190304
    },
    {
      "title": "Good case",
      "text": "What you'd expect, has one side for the drive and the other for the cable. I have a hard case for a small western digital drive and although this isn't as crushproof as the WD case, I think this is better in that the WD case didn't have a place for the cable. It's also plenty solid, I'm not worried about any of my HD's getting destroyed when in here. I need to mention that I got this as a gift, however this hasn't changed my opinion of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "ashley",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "The instructions do not fit with the disk, but it looks that the ssd it's excellent",
      "text": "I didn't like that pamphlet instructions do not help me it was not according with the product instructions. I just plug in on my desktop and start saving my pics easy no problem.. But the instructions said that is required to format the disk according with the computer usage PC or Mac but I didn't find the program how to do that so I used it without any previous format and it works. I also move pics from my cellphone to the disk without problems, it's so fast",
      "rating": 5.0,
      "verified": true,
      "author": "JE R.",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "So far so good",
      "text": "Its way lighter than any external hard drive I have bought, no sounds come from it, can be set in any direction, even shaking it won't affect copying files [Coming from booting computers with 5-1/4\" drives I still can't get over this \"flash\" storage architecture]. It barely gets warm. Seems to run fine on USB 2.0. I'm sure on USB 3.0 it might actually fly.... who knows :)",
      "rating": 5.0,
      "verified": true,
      "author": "Shaofu Chang",
      "helpful_votes": 3,
      "publication_date": 20170402
    },
    {
      "title": "This drive is made for Photoshop & Premiere Elements because the scratch disk speed is intense.",
      "text": "I bought 2 vector 2gb's one had a slight problem.... so I called and spoke to Sam @ Vector. This was during the beginning of the Corona Virus...We figured the problem out. He RMA'd it, received it, returned it in a very timely manner. I thought it would be a month...... It was a week! Works like new........Will buy again when the 8 gig SSD drive is available.... Worked in computers since 1984.... This co. is doing a killer job with a excellent SSD Product. Will buy again & will recommend other to Vector for their needs as well. Thanks for the fabulous service after the sale, Steven",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Finegold",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Hard drive constantly disconnects",
      "text": "For a solid state drive this one is awful. For a $1k drive it is a huge let down. Constantly ejecting itself on multiple computers without being touched. I'm a professional commercial photographer and from my experience I think it draws too much power from the USB and if you have any other drives or USB connected devices that require power then most likely it will eject on it's own. I wanted to return this item and noticed it only has a 6 month warranty!",
      "rating": 3.0,
      "verified": true,
      "author": "aaron fairooz",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Stores your data",
      "text": "Yeah. It's nothing fancy and certainly not enterprise-grade SSD, by this little beast does the trick just fine and for a reasonable price. As a Mac user, I did have to reformat the drive, but once that was complete, storing stuff on this two-terabyte filesystem has been a breeze. I use it for audio, but you can put presentations, photos, movies, or whatever you like on yours.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Stewart",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "incredible value and super fast",
      "text": "The drive is lightning fast right out of the box. Incredible value for an SSD at this price. It feels really solid and is a really great compact design. Bought to use to access my photo / music / video library, but thinking about getting another for my time machine backup!",
      "rating": 5.0,
      "verified": true,
      "author": "Buddy Overstreet",
      "helpful_votes": 6,
      "publication_date": 20160914
    },
    {
      "title": "Excellent. Should have bought sooner.",
      "text": "Excellent piece of hardware. First I was kinda' surprised how lightweight it is. Then I realized: that's (partly) the point. No magnetic media, no moving parts, no heavy assembly. Just ICs. It's a USB 3.0 device. Not the fastest available but very affordable and a very good value for money. My own speed test: 30 MBps (Mbytes, not Mbits) when block transferring from traditional hard drive, over 70 MBps when transferring directly from memory. I use it as a backup drive. Will switch my OS drive to SSD very soon.",
      "rating": 5.0,
      "verified": true,
      "author": "ipm",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Would not recommend for MacBook (2017) Pros",
      "text": "I bought this drive to use with my 2017 MacBook Pro. It worked the first day and man, I was ready to buy another one! But, day two and after I off loaded a ton of data onto the drive, the drive would not constantly mount. I had to do the old fashion windows technique of restarting the Mac. It would mount after the restart, but once you start to copy data off of the drive, it would once again dismount. So, I will not be buying only one of these drives.",
      "rating": 1.0,
      "verified": true,
      "author": "USIFF",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Dead on arrival #2. Never worked from start.",
      "text": "Never got it to work. Kept making my PC shut down. Was denied a refund as well. Total RIPOFF!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Confident1",
      "helpful_votes": 8,
      "publication_date": 20180926
    },
    {
      "title": "2TB SSD - 1 year review",
      "text": "Felt like I was taking a risk with an unknown (not mainstream) brand, but I've had no problems with this drive with a year of moderate use. Transferring files is extremely fast compared to other external spinning drives as well.",
      "rating": 4.0,
      "verified": true,
      "author": "SK Donahue",
      "helpful_votes": 2,
      "publication_date": 20190227
    },
    {
      "title": "I needed durability and speed in a hard drive for my photographs.",
      "text": "I notice that using Lightroom and Photoshop to work on photos was sluggish when using HDD drives. Solid state hard drives are expensive, but I received a gift certificate for Amazon for my birthday, and used it to reduce the cost of my first external solid state drive. I chose Vectotech Rapid 1T External SSD solid state drive. Using Lightroom and Photoshop is much more pleasant now. Very pleased with my new hard drive.",
      "rating": 5.0,
      "verified": true,
      "author": "PrestonG",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Big difference",
      "text": "I do a lot of recording music and using various tracks, filters,etc. Special effects use a lot of computer power. Boosting the RAM doesn't solve the problem...It has to be handled by switching from the standard hard drive to a solid state one. This allows for much improvement in the time that it takes for the drive to process the signal.",
      "rating": 5.0,
      "verified": true,
      "author": "JiminFla.",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Easy to set up and use.",
      "text": "After reviewing a number of products decided to go with the 250GB version in order to backup files and a possible move to a new computer. Very small manual but it is all that is needed. Explained exactly how to have the drive configured for a Mac. Followed the instructions and in less than five minutes it was backing up my files. I copied about 60 GB without any problems. I recommend this drive highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel L.",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Junk",
      "text": "This is a piece of crap. Kept shutting down, and files added couldn't be deleted. I'm no computer expert so I don't know what is going on, but as a guy who has had probably 20 externals, I know this is pure junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 2,
      "publication_date": 20190628
    },
    {
      "title": "Failing after a month (albeit a strenuous one)",
      "text": "Device started to fail in approximately one month, I'm having to fight it, restarting my computer, unplugging it and switching USB ports, the works. Granted, I've got a large number of files that I'm regularly encrypting and decrypting (with CrypTea), so YMMV as most won't tax their drives as hard, but still this is a bit ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Torres",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Faster than I thought it would be",
      "text": "Bought it as a TimeMachine backup for my MBP 15” 1TB SSD laptop. The initial backup was 551GB and I expected it to backup overnight. Plugged it in and selected “Rapid” as the TimeMachine Backup drive @ 8:00pm and “Preparing backup” started immediately. Around 9:30pm I checked on its progress and it was already finished. Judging by the file time stamp, it appears to have taken 85 minutes. That’s pretty fast. BUT BUY YOUR OWN THUNDEBOLT 3 / USB-C CABLE. Like many reviews and posts I've read, I experienced random disconnects with increasing frequency. Bought an Apple Certified TB3 cable and the problems ceased immediately and permanently (so far).",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Greatly improves playback quality.",
      "text": "I use this external hard drive on my cheapo dvr to record antenna tv. No more pixilation , no more freezing and jumping . The picture quality is really good. I already was using a solid state drive for a game console that makes massive difference in speed when navigating player menus . Next will be on my pc. I'm sold on solid state hard drives. Thanks !!",
      "rating": 5.0,
      "verified": true,
      "author": "Billy W.Walker",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "EXTREMELY Quick",
      "text": "This is a very quick hard drive, easy to use, and good looking. it was on sale when I bought it, which was my reason for choosing it. But, I'm glad i did. If needed another one, I'd buy one just like it. These SSD drives are so fast and lightweight. They cost more, but if you need speed, this is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Bade",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Formatting Mac is not too bad",
      "text": "I just received my 2TB drive (Rapid). I am running Mojav 10.4.3. on MacPro. In the APPS under system preferences or UTILITIES there is no DISK Utility for formatting the HDU. So what I did, was use TIME MACHINE to format the drive and to do my system backup. The latter executed without any issues and my (almost full) 1 TB drive was backed in less than an hour. At first cut, I love the drive.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Great!",
      "text": "Was a little nervous ordering this since it isn't a super prominent brand but love it so far! Copying files to this goes faster than my previous hard drive (HHD Western Digital). LOVE that it comes with a USB-C cable so I can plug it directly into my 2017 Macbook Pro. It is SUPER light -- I was surprised by how light it was. Only bought a 1TB but might have to get another!",
      "rating": 5.0,
      "verified": true,
      "author": "Iris",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Doing its job. Reliable.",
      "text": "Product arrived on time and is working well. Bought this because I cannot afford a 2TB internal SSD for my new laptop (PCIe). Have this fastened to the lid of the laptop. It works well with USB-C as an extra drive. Now restoring files from Carbonite to this drive. Works well so far.",
      "rating": 5.0,
      "verified": true,
      "author": "FrodoJRR",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "I was worried that this external SSD drive wouldn't be ...",
      "text": "I was worried that this external SSD drive wouldn't be compatible with my 8 yr old Thinkpad x201 tablet, but it worked immediately after being connected to the USB port. I was able to fully back up my system with plenty of storage to spare! I had intended to use it as a backup drive, but my old hard drive only has 15 GB of space left, so I'll find out soon how durable this new SSD will be as an active drive for my daily applications.",
      "rating": 5.0,
      "verified": true,
      "author": "Eva B",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "It sets up in seconds!",
      "text": "It took only seconds to begin my work. I plugged the VectoTech Rapid 2TB External SSD USB 3.0 into my Windows 10 system and chose to view my files... and I was off and running! I'm not a guy who does speed tests, but it appears to be copying fast. This drive is exceeding my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Evan Plante",
      "helpful_votes": 2,
      "publication_date": 20180227
    },
    {
      "title": "Constantly disconnecting",
      "text": "At first, I thought it was the cable that came with it... Nope. Don't spend your money on this, you'll regret it. Constantly drops and disconnects. Yes, it is lightweight - and that's cool and all, but... you know... it's a hard drive, so it should stay connected...",
      "rating": 2.0,
      "verified": true,
      "author": "Shelby Baldock",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Up and Running With No Hitchs",
      "text": "I mainly purchased this SSD to move files between several different PCs and laptops. It is working great and facilitating the transfers without any snags. Plug and Play all the way on every machine so far. As such I have not had to utilize Tech Support. Once it's initial task of moving files is done it will serve as the back up drive for my files.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Caton",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Store your stuffs.",
      "text": "Seems to work well. Very light and fast. Prefect to store all your por... I mean...files from work. No, but seriously, very good price for flash memory of this size. Much more reliable than a non-solid-state.",
      "rating": 4.0,
      "verified": true,
      "author": "Austin Hammerhand",
      "helpful_votes": 2,
      "publication_date": 20180408
    },
    {
      "title": "Super happy with it so far.",
      "text": "It's working like a dream. The only real review critique I can give is I wish it was a little less expensive and had more room on it. Otherwise it's doing just fine. I've only had this thing for a week, therefore I can't say how long it will last but will update if it becomes an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew M.",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Doesn’t work how it should",
      "text": "Takes about 10 minutes to transfer an hour video, I was hoping to use this for video editing in the go but this is worse than my hard drive😢",
      "rating": 1.0,
      "verified": true,
      "author": "cesarh826",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Tiny mega storage",
      "text": "This is an amazing product for its size and price. I'm now storing all my new data to it after filling up numerous larger external drives for my photography work. The only issue I have it that it doesn't read on some of my old XP machines that I use for specific editing jobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Willie L. Hill, Jr.",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Works well - great price",
      "text": "I've used the high price Samsungs which have worked well but I was looking for a lower price and bought 2 of these for a little more than I would have spent on 1 samsung. Using as external boot drive on an old iMac. Works really well. Happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gordon",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "A much needed storage device",
      "text": "I have not begun to use this item yet because I just recently received it, but it was delivered well and it is extremely light and I did follow the directions to format it on my pc. I look forward to using it. Good customer service by reaching out to thank me for buying the item! Follow up- have been using it and it is fast and easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "An American",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Great value, fast, reliable",
      "text": "Note: I did pay for this myself, although after I received it, VectoTech sent me a free case in the mail. I've had it now over two months and have been using it nonstop. I put my recent photos on it and move it back and forth between my desktop and laptop (when I travel). It's light weight, fast, and reliable. No complaints - good product - recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Edro",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Fast and Lightweight",
      "text": "Excellent so far. Fast and lightweight. SSD is so much better than the old mechanical drives! More $$ but worth it in the long run.",
      "rating": 5.0,
      "verified": true,
      "author": "ReneMichaels",
      "helpful_votes": 4,
      "publication_date": 20170508
    },
    {
      "title": "Really Fast",
      "text": "I use this drive as an upgraded boot drive for my Mac Mini (2014). It transfers 400 M bytes/sec both read and write. The stock drive only does 80 M bytes/sec. This drive runs faster over USB than if I installed a Sata SSD. Boots Mojave perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth H.",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Routinely disconnects",
      "text": "Have used this product for 3 weeks now with a upgraded iMac. Despite formatting the drive for the Mac this drive will routinely disconnect without prompting. Have tried three separate power cords thinking that was the issue however the same problem occurs routinely. If you need 100% reliability this is not a good drive.",
      "rating": 2.0,
      "verified": true,
      "author": "RICHARD M.",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Fast and Flawless",
      "text": "I bought 2 of these. I started with one, and it worked so well, I added the second one. They work flawlessly and are fast, quiet and give me the piece of mind knowing that they won't crash.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Brunet",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "It was easy to figure out even without know the technical terminology.",
      "text": "I loved that I could copy files to the SSD external drive and then just plug it in to the new computer and be ready to go. I am 74 years old and needed no help using this external drive. Easy to figure out, speedy, and now holds my backup files.",
      "rating": 5.0,
      "verified": true,
      "author": "ladyHuk",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Faster Than My HDD, But Not For the Price Difference",
      "text": "Bought it for speed over the portable HDDs I have now. Was disappointed that there was not a greater time savings on my larger file backups, but other factors may have contributed to this. Overall, I am satisfied with the product.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Thiel",
      "helpful_votes": 3,
      "publication_date": 20170404
    },
    {
      "title": "Product was broken on arrival",
      "text": "Product was unable to connect to a PS4 or two computers with the provided cable, which for some reason is proprietary. Don't know why it can't connect using USB 3.0 or USB C, but the connection seemed shoddy and weak. Much happier with the samsung SSD I got that uses a USB C.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181228
    },
    {
      "title": "Great SSD for the price",
      "text": "The product actually arrived quicker than expected and works just as it should. I mostly wanted it to have a sort of \"currently playing\" drive for my Xbox One and at that it excels. Load times are no longer an issue for any games I move into the drive, and the seller even went ahead and contacted me after the device had arrived to make sure everything arrived properly and in working order. The price point was honestly a key factor in my purchase, and this despite this not being a \"name brand\" like SanDisk, it does what I need it to do and does it very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jovany Alvarez-Sanchez",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "The reading speed is not As advertised . Low reading speeds",
      "text": "This is unbiased review . I bought this hard drive for the sole reason that it was advertised at read speed to be 540mb/s and when I checked on my pc and it read to be only exporting at 80 mb/s . I’ve had HDD hard drives read at faster rates . For a media creative speed is So crucial for editing and rendering all kinds of content . I’m not satisfied 100% . Possibly for people looking to store low data files . Such as word docs this would be for you but if speed and efficiency is the name of the game I would suggest thinking twice .",
      "rating": 2.0,
      "verified": true,
      "author": "Chris T.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Simply perfect.  Exactly what I needed works perfectly",
      "text": "I am really happy with this SSD external drive. I am using it to replace a Seagate mechanical external drive that I worry may one day fail and I will loose a lot of family pictures. I have piece of mind with this SSD drive. Easy to use, plug and play no hang ups. It just works!!!! How refreshing!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam R",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Works great for video editing.",
      "text": "I used this on my iMac and MacBook Air for video editing with Final Cut. I was streaming 5 HD camera angles at once and didn’t have to use proxy media.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Province",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Not as small as I hoped",
      "text": "I edit 4k video on my MacBook Pro and I really like the editing speed and performance of the 1TB Samsung SSD I have (on the left). When it filled up, I thought I would try a less expensive SSD drive next. It seems to be just as fast so I'm keeping it but it's way bigger (middle). For comparison, even a slim 2TB conventional drive I have is smaller than this one. No big deal if it stays on your desk but I really liked the portability of the smaller Samsung.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Stehlik",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "So far so good.",
      "text": "I've gone through a lot of so-called \"portable\" external drives and was recommended to get an SSD. I've only had it a couple of months so it's hard to know if it will last longer than the usual but I'm optimistic. It's super lightweight. They were kind enough to also send me a free carrying case - good customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Lamson",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Great Price and Performance",
      "text": "No complaints. The drive is fast. Being a SSD versus the old HDD type drives, the benefits are apparent. It is light, there are no moving parts so it seems like this drive should be relatively safe being jostled around in a bag. This is my 2nd vectotech drive purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake McCain",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Excellent customer service",
      "text": "I updated my star rating to reflect the excellent customer service. The vendor got in touch with me to make it right. I am now using my brand new drive and it's working perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "T. DiPiano",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "STAY AWAY!",
      "text": "Within days of purchasing this, it would disconnect with any slight movement of the laptop and would refuse to reconnect for hours. I can't afford that with schoolwork. Tech support said weeks ago they would send me a new cable in case it's that. I'm still waiting. Poor quality product and even worse tech support!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Dike ",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "GREAT DEVICE",
      "text": "Device was definitely great but the value of it was kinda steep. So for those who can buy it, you will get a great ssd...for those who cant buy it, there are other options you can consider. Overall great buy but price needs to come down to be somewhat more affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "Antoine B.",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "FAST!",
      "text": "Use this SSD as a backup for photos and financial info. Using USB 3, everything transferred in about a half hour. Bigger than a deck of cards; but no heads to worry about crashing and trashing the data.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald VanGrouw",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "lightweight and fast",
      "text": "Came with a bad cable that caused problems on my 3.0 usb. Trouble shot the problem with tech support and Amazon reimbursed me for the cable that I needed to buy.",
      "rating": 4.0,
      "verified": true,
      "author": "PB",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Mine doesn't work.",
      "text": "It doesn't work. We have tried it on both computers and nothing. It shows it is plugged in but I can't access it for anything. I'm sad. I am not a computer whiz so I waited for my son to check it out. He hasn't figured it out yet.",
      "rating": 2.0,
      "verified": true,
      "author": "Cat169",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Died in 48 hours",
      "text": "I had been editing a video project off of this drive, about 12 hours into the project and ready to export, the drive completely died. It wouldn't stay mounted to my computer for more than 10 or so seconds. Just long enough to transfer a few 100mbs of a 30gb project. Piece of ******* DO NOT BUY",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Pryce",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Very good purchase. Was expecteding 5 Gagabits per second or ...",
      "text": "Very good purchase. Was expecteding 5 Gagabits per second or about 500 MB a second. I actually getting about 250MB a second in transfer speed. 60 GB file took almost 4 minutes to transfer which is fast enough for me. Interesting a USB 3.1 Gen 1 is a USB 3.0 port. Cannot beat the price/performance/value metric. The drive is about the size of a a man's hand. So far I loving it. Great for 2015 Macbook Pro.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony Constantinides",
      "helpful_votes": 3,
      "publication_date": 20180528
    },
    {
      "title": "Crazy fast ssd",
      "text": "Crazy fast hard drive. I have 30,000 image files on this for photoshop and man it loads the images fast. Very expensive but if u need a fast ssd for images or video then this is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Bassett",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Great little drive all though having a lot of IO issues",
      "text": "On paper this drive is perfect for what I need on the road. It’s light weight and portable, very fast. However as someone else noted in a review I read it’s having a lot of I/O issues I’m not sure if it’s the drive itself or the cables provided. But it often disconnects or causes an error issue and it’s very annoying when I have to edit video on the go as I’m currently a touring photographer. It makes me not want to sue the drive at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Roddie",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Expensive but hopefully it’s a good investment",
      "text": "Arrived very fast , 1.5days. Capacity is good. Transferred all my files from an old Toshiba very fast. So far so good, fast and lightweight. Cables that come with it are fine, yes, they were folded to fit the box , but are working great, and yes this thing ain’t cheap. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Really useful",
      "text": "A normal HD will wear out, as I found out recently on my PC. I think a normal drive has up to 5 years (ok, maybe 2-3). But a solid state drive can last much longer. This little drive feels light, but I have 4TB to put my most important files for backup. Great device!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Skeet88",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Arrived on time and undamaged.",
      "text": "The drive arrived on time and packaged in its own box, which was placed inside a larger box. The drive arrived in good condition. It comes with a wire to link it to the computer. I have a PC and it linked right up and is really fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith A. B.",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Use as network drive",
      "text": "It was easy to install, plug and play. I use it as a network drive for storing and sharing files between computers. It works with both a PC and a Mac for both read and write.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorilyn Andrus",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "It Works and It's Cheap",
      "text": "It's physical size is not as small as other external solid state drives like the ones from Samsung and Sandisk, but it's cheaper per gigabyte compared to the products of the aforementioned companies. For weekly external drive file backups and occasional massive file transfers, I have the faster USB 3.1 external SSDs do the work. But for holding a system image of my computer, the VectoTech rapid fulfills that role perfectly because it comes at a low enough price to justify choosing a SSD product over an HDD product for storing a rarely used backup.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Great drive for the money",
      "text": "Not as compact as you can get but I use this drive to run Mac OS X 10.14 on my iMac and it does great. The drive works much faster even through usb 3.0. That is my only use for this drive and so far I have had no issues ! Definitely works as a bootable clone for Mac",
      "rating": 5.0,
      "verified": true,
      "author": "John A.",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Good Value and Portability",
      "text": "Incredibly light and portable. Ready to go out if the box. Successfully preserved data from a failing Western Digital 1TB hard drive. Software interface was intuitive and relatively informative on transfer progress. Much more time needed to assess reliability.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan L. Simon",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Works as advertised",
      "text": "I can't speak to longevity yet, but the product works as I hoped it would 45 days in and counting. $250 for 2 TB of SS storage. Perfect for storing a portable Steam library, TV/movie collection, etc. etc. The cable that comes with it is a bit short, but all these things are interchangeable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Woods",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "What I needed",
      "text": "My old HDD crashed out so I moved to this SSD. Small, light weight, and easy to use. Hooked it up and now it’s my new Timemachine backup",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Lazzaro",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Small and fast",
      "text": "I could not believe how small this is for 2 terabytes. I am loading my backups right now and it's going pretty fast even over a network so I'm pretty satisfied so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklyn CPA",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Nice design",
      "text": "Using this product for system image storage for a Windows 10 HP all-in-one computer, very lightweight and easy to use - just bought, so no long-term info. Nice design, seems very sturdy and tough to break",
      "rating": 5.0,
      "verified": true,
      "author": "DL Texas",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "No problems",
      "text": "I received this SSD about one month ago and it seems to work perfectly. I like the fact that it's completely silent. Set up was easy using the included instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence M.",
      "helpful_votes": 3,
      "publication_date": 20170302
    },
    {
      "title": "Fast drive",
      "text": "This SSD holds several GB of data for my MIDI music writing, so lots of data moving around fast. It works fine for my purposes. The outer wall of the shell looks a little cheap, but otherwise, it's a fine product. It is exceedingly light. Sometimes it hangs by the cord from my laptop. Probably not a good idea, but it's hard to notice when it falls.",
      "rating": 4.0,
      "verified": true,
      "author": "jmeinl",
      "helpful_votes": 0,
      "publication_date": 20191214
    }
  ],
  "product_meta": {
    "title": "VectoTech Rapid 1TB External SSD USB-C Portable Solid State Drive (USB 3.1 Gen 2) – Up to 540MB/s Data transfer, 3D NAND Flash",
    "rating": 4.5,
    "feature_bullets": [
      "PERFORMANCE – Ultra fast read/write speeds of up to 540MB/s, lets you transfer conveniently large files, 4K videos, high end gaming in seconds. With USB 3.1 Gen 2 interface (Type-C connection) and 3D NAND technology VectoTech portable SSD provides transfer speeds 5x faster than conventional hard drives",
      "COMPATIBILITY – Works with PC and MAC straight out of the box. Comes with USB Type C to C and USB Type C to A cables, which makes it universal for older and newer computers. Fully compatible with Windows (7 or higher), MAC (macOS 10.x and higher), XBOX, PS4, iPad Pro, Android smartphones with USB C port, Surveillance systems and Thunderbolt 3 devices",
      "DESIGN – Made out of durable Aluminum 1050 grade makes this portable solid state drive resistant to minor scratches, while providing ideal heat dissipation. Shock and vibration resistant up to 1500g at 0.5m/sec - equivalent of a 6-feet drop. Capable of withstanding operating temperatures from -13ºf (-25ºc) or 185ºf (85 ºc)",
      "Manufacturer warranty - 3 Years",
      "Technical support +1 (800) 987-0197"
    ],
    "specifications": {
      "Brand": "VectoTech",
      "Series": "Rapid",
      "Item model number": "VT1TBB",
      "Hardware Platform": "PC, Mac",
      "Item Weight": "0.16 ounces",
      "Product Dimensions": "4.5 x 3.2 x 0.5 inches",
      "Item Dimensions  LxWxH": "4.5 x 3.2 x 0.5 inches",
      "Color": "Black",
      "Flash Memory Size": "1 TB",
      "Manufacturer": "VectoTech",
      "ASIN": "B01JKMZ8FA",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 3, 2016",
      "Customer Reviews": "4.5 out of 5 stars523 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#106 in External Solid State Drives"
    },
    "categories": [
      "Data Storage",
      "Computers & Accessories",
      "Electronics",
      "External Solid State Drives"
    ],
    "price": 139.0
  }
}