{
  "website_summaries": [
    {
      "verdict": "A rust-resistant wheel chock that can hold up to 1,800 lb.",
      "pros": [
        "1,800 lb",
        "capacity",
        "Solid steel construction",
        "Rust resistant",
        "Fits front and rear wheel motorcycles 15\"-22\"",
        "Has 2 eye loops so you can tie straps to it",
        "Easy assembly",
        "Well made"
      ],
      "cons": [
        "If the wheel chock is not mounted to a floor or trailer, it can be difficult to get a bike on and off it",
        "Some reports of it arriving missing parts such as bolts or cotter pins"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Transport stand for large motorcycle",
      "text": "The stand performed flawlessly on a trip to Michigan's U.P. with two Harley Davidson FLHTK's in a tandem axel trailer. Tied the bikes down to the trailer and the stands held the bikes secure and locked in place. Best money spent in a while. Highly recommended for securing the front tire for travel in a trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170920
    },
    {
      "title": "Awesome product goes together about as easy as possible to ...",
      "text": "Awesome product goes together about as easy as possible to bolts two pins super sturdy construction works very very well hold my bike up like a champ I have a Suzuki TL1000R enables me to roll Again by myself get my rear stand and put my rear stand up on the bike exactly what I was looking for, don't waste your money on this super expensive ones this one packs the punch for only 60 bucks, it seems like it would Mount easy in the back of the truck or trailer I however am using it in my garage to use it as a bike stand",
      "rating": 5.0,
      "verified": true,
      "author": "raymond ellis",
      "helpful_votes": 4,
      "publication_date": 20171022
    },
    {
      "title": "Would be great if used in a trailer",
      "text": "Would be great if used in a trailer, or somewhere that it can be secured to the floor. Otherwise, it's almost impossible to get the bike off this thing with one person. Good product for what it is, just not what I was hoping for.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff E",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Too small and charged for return shipping.",
      "text": "Be careful when ordering. The front tire of my motorcycle doesnt fit through the stand. If you have any issues with this product, you'll have to pay return shipping. Nothing like being disappointed by Amazon twice on one order.",
      "rating": 1.0,
      "verified": true,
      "author": "Schyler Goodwin",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great wheel chock!",
      "text": "Love this wheel chock! Not a lot to it, but it holds up my 670 # bike just fine while tying it down. It was simple to mount, although I made some brackets to mount under the trailer that give me the ability to unbolt it without lying on the ground. Well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "David G.",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Five Stars",
      "text": "Works great in garage as it holds bike straight up it actually frees up floor space.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith K.",
      "helpful_votes": 3,
      "publication_date": 20170110
    },
    {
      "title": "Worked on a Ducati and a Harley",
      "text": "Good quality and works as expected. I used it for a Ducati multistrada Enduro with a 19 inch front tire and a 2018 road glide with a 19 inch front tire.",
      "rating": 4.0,
      "verified": true,
      "author": "Erik J Dahl",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Well constructed and served its purpose well!",
      "text": "I bought this chock to transport a bike in a rented U-Haul trailer. Tied down the chock to the trailer and then the bike to the trailer. It didn't move at all and saved me a lot of worrying. It breaks down for easy storage. If you're on the fence about buying one, buy it. It save me a ton of worrying.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Customer!",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "I've got a Victory Vision in one of the 3 I bought and it works great. The only reason it's 4 not 5 is ...",
      "text": "Very stable, I've got a Victory Vision in one of the 3 I bought and it works great. The only reason it's 4 not 5 is a couple of missing parts.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "excellent product well made",
      "text": "Wish I had bought this stand sooner. Works great holding my 2004 Yamaha cruiser, also now my bike takes up less room in the garage. Yes, you have to bolt the stand to the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Anti",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "great product fits my bike tire and hold the bike ...",
      "text": "great product fits my bike tire and hold the bike firm. my tire is a 150/16 and no problems. I mounted this to a motorcycle lift to replace the mount that came wiht it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley J Stevensen",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Three Stars",
      "text": "Overall product seems great but was missing a cotter pin and bolts. Otherwise would have given more stars",
      "rating": 3.0,
      "verified": true,
      "author": "Tim Carrender",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Five Stars",
      "text": "Works well on my 10 Hayabusa and 01 GSXR 1000.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark F.",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "used for many diff bikes. works great.",
      "text": "i bought this same stand from harbor freight. its fit every different type of bike ive hauled. i bolted mine down to a thick 4x8 piece of plywood for use in my pickup. i use the factory bed tie down points but still have not had ANY issues with it holding 700 pound bikes. even a big scooter small front tire fit with just enough room to not hit the fender on either end. ONLY thing i dont like is how you adjust the front for different tires. i dont know why they didnt make the pivoting part move.",
      "rating": 4.0,
      "verified": false,
      "author": "elyse diaz",
      "helpful_votes": 0,
      "publication_date": 20171108
    }
  ],
  "product_meta": {
    "title": "Best Choice Products Adjustable Motorcycle Stand Wheel Chock Upright w/ 1800lb Capacity",
    "description": "Best Choice Products presents this new motorcycle tire stand choke. Mount it on the floor or truck bed to hold bikes upright for storage or routine maintenance. This motorcycle tire stand is constructed of rust and corrosion-resistant, solid steel. It features two eye loops for straps and a tilting wheel adapter that automatically holds a tire securely. This adjustable tire stand choke is compatible with front and rear motorcycle wheels with sizes ranging from 15\" to 22.\" Purchase this tire stand choke today for a great motorcycle accessory! FEATURES: Motorcycle tire stand choke is constructed of rust and corrosion-resistant, solid steel Adjustable stand is compatible with front and rear motorcycle wheels with sizes ranging from 15\" to 22\" Mount it on the floor or truck bed to hold bikes upright for storage or routine maintenance Features two eye loops for straps and a tilting wheel adapter that automatically holds a tire securely Dimensions: 34\"(L) x 34\"(W) x 17\"(H); Weight capacity: 1800 lbs. SPECIFICATIONS: Dimensions: 34\"(L) x 34\"(W) x 17\"(H) Product Weight: 35 lbs. Weight capacity: 1800 lbs. Tire size: 15\"-22\" Frame material: Powder coated Steel Rust & Corrosion Resistant Frame color: black Some assembly required (instructions included).",
    "rating": 4.3,
    "feature_bullets": [
      "Motorcycle tire stand choke is constructed of rust and corrosion-resistant, solid steel",
      "Adjustable stand is compatible with front and rear motorcycle wheels with sizes ranging from 15\" to 22\"",
      "Mount it on the floor or truck bed to hold bikes upright for storage or routine maintenance",
      "Features two eye loops for straps and a tilting wheel adapter that automatically holds a tire securely",
      "Dimensions: 34\"(L) x 34\"(W) x 17\"(H); Weight capacity: 1800 lbs"
    ],
    "specifications": {
      "Manufacturer": "Best Choice Products",
      "Brand": "Best Choice Products",
      "Model": "SKY2725",
      "Item Weight": "35 pounds",
      "Product Dimensions": "34 x 34 x 17 inches",
      "Item model number": "SKY2725",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "SKY2725",
      "Folding": "No",
      "Cover Included": "Motorcycle Stand^Hardware^Instructions",
      "Vehicle Service Type": "Street-sport-motorcycles",
      "ASIN": "B01JARCE0M",
      "Customer Reviews": "4.3 out of 5 stars34 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#596,496 in Automotive",
      "Date First Available": "July 29, 2016"
    },
    "categories": [
      "Motorcycle & Powersports",
      "Accessories",
      "Automotive",
      "Automotive Parts & Accessories"
    ],
    "price": ""
  }
}