{
  "website_summaries": [
    {
      "verdict": "An essential replacement charging kit for the GamePad, with a standard USB connector that allows charging from any port.",
      "pros": [
        "Enables users to charge the Wii U GamePad via a wall outlet, without having to turn on Wii U console",
        "USB cable allows GamePad to be charged with any USB port",
        "Comparable lifespan to the OEM Nintendo charger"
      ],
      "cons": [
        "USB cable is shorter than original charging cable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome Deal!",
      "text": "So glad to find this awesome deal. I didn’t think I was going to use the usb charger but it ended up being a great bonus. Both chargers work great! When it is not in use it is in the cradle hooked up to the usb charger and we use the regular charger for during play time. I think that is one thing that frayed the original plug in charger it came with, was all of the back and forth plugging it into base then unplugging it and plugging it into the pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayo's Girl",
      "helpful_votes": 3,
      "publication_date": 20180903
    },
    {
      "title": "After 3 months, both chargers have stopped working.",
      "text": "Among the options available, this was the best set of chargers I've found yet. However, the plastic on the cord is very thin, allowing the wires inside to be damaged. I suggest using electric tape to reinforce the end of the cord that attaches to the WiiU pad. If you use the charging stand, you will likely have no problems with this product. If you or your child play the WiiU while it is plugged in, consider reinforcing the cord.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura Hano",
      "helpful_votes": 3,
      "publication_date": 20190531
    },
    {
      "title": "Unless you want a broken Wii U pad...",
      "text": "Do not but this! After day three of using this charger our brand new Wii U pad had that was in a case and very well taken care of completely broke. Totally disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190504
    },
    {
      "title": "To put it simply it charges the Wii U gamepad",
      "text": "The Usb charge is nice if you have USB outlets/ports really available but not so much wall outlets. currently have them set up on opposite sides of the room so no matter where I am I can plug and play to my hearts content.",
      "rating": 5.0,
      "verified": true,
      "author": "Wintersfrozen",
      "helpful_votes": 3,
      "publication_date": 20180314
    },
    {
      "title": "Amazing value & works beautifully",
      "text": "Absolute life saver! My kids last charger was so old and broke . It finally gave out a few months ago. The kids started to play the switch instead, but missed playing their Wii and Wii u games. I was afraid of purchasing a charger that wasn't Nintendo brand, but this was an amazing purchase. Works very well and is sturdier than the expensive cord I bought from Nintendo. Also, it comes with a USB charger for the computer or to use with a wall plug.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Perfect Replacement",
      "text": "I bought this charger after purchasing a used a certified refurbished Wii U from \"You know who\" . About 5 days after I bought the console, we started having an issue with it so I bought this charger hoping that was the issue. It fixed the problem. We've had the charger for some time now and we haven't had a single problem with it. Also, this charger is longer than the one that came with the console. Major plus!",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Montanez",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Too Short",
      "text": "This cord is shorter than the original and does not connect properly. Our tablet takes longer to charge and watching while charging is annoying (due to the incomplete connection); the screen and red light blink. I wish we purchased a genuine Nintendo cable.",
      "rating": 2.0,
      "verified": true,
      "author": "Sara M. Urbano",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Arrived on time and works",
      "text": "Replaces the original and so far does its job, not much else to be said.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlton E. Lester",
      "helpful_votes": 5,
      "publication_date": 20161210
    },
    {
      "title": "USB CABLE IS A MUST!!",
      "text": "I have not tried the AC-DC charger brick yet. as ive searched on amazon, the possibility of these aftermarket power bricks to get hot and melt and FIRE AWWWW!!!.... is very very high!! but the USB cable and just using a standard ac- 5v dc USB brick, you get with your phone or table, is capable to charging your Wii U controller (apple idk, i hate apple). You can also use your laptop or desktop, or any USB connection to charge your Controller including the USB ports on the front of your Wii U, but the Console has to be running as too your laptop or desktop.. and of course you can use the cradle with this cradle.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "So so thickness",
      "text": "Unfortunately these aren't very tough, just like the original. After a couple years both have worn with the grey clipped in the middle and the white at the tip requiring force to charge. If kids don't use it I'm sure it'd be fine, but I'll never know.",
      "rating": 3.0,
      "verified": true,
      "author": "steveb944",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Works great",
      "text": "Works well, Its been plugged in since it arrived on Dec-27-18. No issues. Between my daughter and I its played daily. The added bonus of the USB power cable is nice, its well made and works well also. 100% would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Smell",
      "helpful_votes": 2,
      "publication_date": 20190202
    },
    {
      "title": "Good Quality",
      "text": "I've had this for quite awhile now with multiple kids in my household using (abusing) it and it's still working great.",
      "rating": 5.0,
      "verified": true,
      "author": "SouthPaw",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Works as great as the original!",
      "text": "Our entertainement center was hit by a power surge during a thunderstorm and fried all electronics, including our Wii U power brick. Luckily I was able to purchase this replacement and it works great. So glad I could find it here on Amazon because no local gaming shops had one.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie C.",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Short lived",
      "text": "These charges worked great at first but they only lasted 3 months. They get to where they only work if the cable is just right but eventually quit working altogether.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 4,
      "publication_date": 20181027
    },
    {
      "title": "Love it!",
      "text": "My kids have really gotten their money’s worth out of their gaming system. Of course the cord finally died and we were happy to find out we could replace it easily and inexpensively. Seems to work just like the original cord. The USB is an added bonus we didn’t have before!",
      "rating": 5.0,
      "verified": true,
      "author": "HandleyMom",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Great product",
      "text": "Was skeptical at first as I don't normally buy knock offs of OEM products and such. Only purchased this one because it comes with two different methods to charge the Wii U tablet incase one of the two didn't work. My order came in, plugged it with my Wii U tablet and these babes work just like OEM product from Nintendo.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Vue",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Just what I needed",
      "text": "I noticed the WiiU remote had stopped charging, even when I plugged it into the top port. I initially thought the battery itself crapped out, but of course it was the charger cord. I haven’t tried to USB cable yet, but for 2 cables at this price I thought it was a pretty good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Prefect replacement",
      "text": "Cable is over 6ft long and works perfect since the oem charger died. Comes with a usb cable that works in conjuction with any usb charging block. Oem chargers are nearly impossible to find since nintendo discontinued the wii u.",
      "rating": 5.0,
      "verified": true,
      "author": "joshua betts",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Arrived potentially damaged",
      "text": "Arrived in a plastic bag that had rips in it, gray item was dirty, looked like it’d had pencil marks or smudges on it and scratches. Haven’t tried it yet and will update review to reflect if it works properly or not, but was disappointed upon opening it.",
      "rating": 2.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Two chargers that work.",
      "text": "The wall charger feels cheaper and has a short cord, but we keep it plugged into the base charger so not a big issue. The USB charger feels higher quality and is LONG so that makes up for the short other one. USB is cool because it works with any phone charger or USB port we have tried it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Oppliger",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Will not last.",
      "text": "I bought this about 6 months ago and used it like 10 times since then to charge the Wii U tablet. Now it it completely dead and will not work. You get what you pay for I suppose.",
      "rating": 1.0,
      "verified": true,
      "author": "Ahmad Elghazali",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "Both plugs worked for me and I've been using um ...",
      "text": "Both plugs worked for me and I've been using um for at least a month now with no issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 2,
      "publication_date": 20170317
    },
    {
      "title": "Excellent AC & USb for the Wii U",
      "text": "works great and fits perfectly, were currently using the ac part and saving the usb cord in case of issues in the future which is why this was a big plus. I would recommend if you need a replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Magee",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Love that it comes with 2 so you have backup",
      "text": "I love that this comes with 2 so you have backup. I have already had to order 3. They are sensitive and didnt last very long but the fact that there is another one to rely on helped.",
      "rating": 3.0,
      "verified": true,
      "author": "Neda Essa",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Works perfectly!",
      "text": "Only been a couple of weeks, but working beautifully thus far. Replaced the battery first and found that I still couldn't get a charge. Tried the new cord and RED LIGHT, VIOLA! So hopefully it holds up over time. I'll update the review if it doesn't.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Earley",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Works well",
      "text": "My dog ate through our original cord and our Wii U wasn't charging anymore. Got this to replace them. I've been using the USB attachment cord for a couple months now and haven't had any problems. It charges great!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Stopped working after a month",
      "text": "I purchased this cord and it stopped working after a month. I thought it was our controller, however, this cord would not work when tested on a second working controller.",
      "rating": 2.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Works great for the Wii-u game pad!",
      "text": "Bought this for my son as a replacement Wii-u game pad charger. Works great and has been since we purchased. Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "JuniorBB",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Perfect replacement",
      "text": "This was perfect for what we needed. We couldn’t find the power cord to my sons Wii U. Ordered this hoping it would work out and it has!",
      "rating": 5.0,
      "verified": true,
      "author": "liz",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Wii U charges with no problem",
      "text": "Purchased this plug 2 once due to the dog chewing the wire and now cause someone broke it excellent charger didn’t over heat or become hot still using now",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Exact fit for Wii U",
      "text": "The charging cable and power supply were a perfect replacement for my son's lost wires. It charges and provides power as it should.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Ling",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "It works perfectly",
      "text": "Thanks goodness my son's Nintendo game came back to life. The power supply on the Original game stopped working. This replacement supply brought the game console back to life. Son is happy, dad is happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Kwan",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Works for my wii u",
      "text": "Works great for my wii u. Our charging cable stopped working so I ordered this and it works great. It's nice that you get 2 chargers for the price of 1. Had it for 2 months now and still works!",
      "rating": 5.0,
      "verified": true,
      "author": "SDCA",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Ehhh 2.5 stars",
      "text": "So I hat high hopes for this item . I give 2.5 stars The usb charger went out fast after a few uses. I issued exchange . Kinda a pain in the butt",
      "rating": 2.0,
      "verified": true,
      "author": "Maria ",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Charges, comes with USB-end cable",
      "text": "Charges my Wii U gamepad without issues, exactly as one would expect. Bonus is that it came with a USB-end Wii U charger, so I can also just plug it into any USB brick or USB wall-port and charge it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "CatsAndIT",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Works!",
      "text": "Absolutely worth it. Game stop had used cords for $15 what a joke... Just like a brand new cord that came with the Wii U. I Would purchase again if I needed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "So far so good",
      "text": "I've just received in the mail today, no burning smell, Gamepad is charging nicely. Great that it includes a usb version of the cable, you'll most likely need a power brick with a higher wattage to get the maximum charge from it. Will update this review again if I encounter any issues with it. 4 stars for quality. 5 stars if it survives a week/month/year.",
      "rating": 4.0,
      "verified": true,
      "author": "Draginto",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Works as expected",
      "text": "Works like a charm. Every several months my daughter breaks her Wii U adapter for some reason (this is actually the 2nd time I've bought an adapter). I expect her to break it again in about 4 to 5 months and will have to reorder again, and so I will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Fredd",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "There is a reason it includes two; the wall ...",
      "text": "There is a reason it includes two; the wall charger quit working in less than a week. Will not be buying another from this retailer.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 3,
      "publication_date": 20170428
    },
    {
      "title": "Great",
      "text": "Bought this to go with a wii u that didnt have one too it. It works well and does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "jenni",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "As described by previous buyers this works perfectly as a ...",
      "text": "As described by previous buyers this works perfectly as a Nintendo wiiu charger. The chord is a bit shorter than the original wiiu charger, but it doesn't make much of a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 3,
      "publication_date": 20161206
    },
    {
      "title": "Five Stars",
      "text": "Work for what it is for. It’s been 6 months now and still works",
      "rating": 5.0,
      "verified": true,
      "author": "Klein",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Great product for Wii u",
      "text": "Bought this for my Wii u because the original got lost and it works great",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Flores",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Works great!",
      "text": "I’m always nervous buying replacement chargers, but this was inexpensive and has worked perfectly for my son’s Wii U game pad. We have been using it for awhile!",
      "rating": 5.0,
      "verified": true,
      "author": "LaLa",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Does the job!",
      "text": "We needed another one, again, because my son is not exactly gentle with the cords! The WiiU rides again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah2019",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Been using these chargers for about four months and they’re still going strong.",
      "text": "I’ve had this set of chargers for about four months now, and they’re still working perfectly! I use one charger to plug into the charging cradle while I use the other one to charge while I play. I only wish I bought this sooner since this gives you so much bang for your buck. I’m completely satisfied with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Phong Pham",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Good quality. No issues.",
      "text": "Been in use for a few weeks with no issues. In fact,it seems to charge my Wii u a bit faster than the original cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Works as expected",
      "text": "Works well. Charges my Wii U game pad as expected",
      "rating": 5.0,
      "verified": true,
      "author": "MD Dave",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Poor durability",
      "text": "The durability is poor. The cords keep breaking. I now have to replace my charger again, for the 3rd time!",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda Castillo",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Seems to work great, i was mostly excited to get the USB ...",
      "text": "Seems to work great, i was mostly excited to get the USB cable and it works just as well as the other charger",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Great affordable replacement",
      "text": "This was the perfect replacement for us. Our original charger broke all too quickly so we looked for an affordable replacement and came across these. We've used them for a few weeks now with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Leanna",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Seems to work great. It's a bit lighter and more delicate than ...",
      "text": "Seems to work great. It's a bit lighter and more delicate than my old Nintendo brand charger, however. I would recommend reenforcing the ends of the charger with a bit of electrical tape.",
      "rating": 4.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Worked Perfect",
      "text": "I've moved a number of times - poor choices in roommates and boyfriends - which leads to lots of packing. Long story short, my wii cord was MIA once I reached my most recent destination. Boom. Here we are, worked great, happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Kwiatkowski",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Great replacement!",
      "text": "Great adapter, fits well so dont be nervous! Both cords do their job. USB charger is great addition to charging options. I would buy again should I accidentally vaccum up these cords as well!",
      "rating": 5.0,
      "verified": true,
      "author": "mamamia",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Works as advertised",
      "text": "Great price for a replacement power adapter since mine died on me randomly. Seems to be made out of the same material as the original, but I'm no materials expert.",
      "rating": 5.0,
      "verified": true,
      "author": "Finalchrono",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Great replacement charging cord",
      "text": "Works great, charges our wii u gamepad. Fits tightly and love the extra cord as a 2nd charging spot or just a backup.",
      "rating": 5.0,
      "verified": true,
      "author": "momof2cuties",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Broke",
      "text": "Charger broke so fast. I would just buy the name brand next time.",
      "rating": 1.0,
      "verified": true,
      "author": "Kitty Cat Meow",
      "helpful_votes": 2,
      "publication_date": 20180313
    },
    {
      "title": "best price and it works perfect every time",
      "text": "this is our second time buying this product. we have a fat cat that loves cords. best price and it works perfect every time",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly A",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Good",
      "text": "Works perfect, value for the money although not original so treat it with care",
      "rating": 5.0,
      "verified": true,
      "author": "Yansel Rosario",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Works great for wiiu replacement charger",
      "text": "Works great, best value I could find for a wiiu charger replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Glance",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "It is charging our Wii u pad!!!",
      "text": "Our Wii u pad wouldn't not charge with the OEM so we bought this hopeful we could get it to charge. it is working so far.",
      "rating": 5.0,
      "verified": true,
      "author": "m",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Nintendo charger finally died, great replacement",
      "text": "Works great as a replacement to the officially licensed Nintendo charger. I like that this is a wall charger/USB combo, especially at a reasonable price. Very pleased and would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Great!!!",
      "text": "Our charger cord was shut in a foot stool and damaged. Trying to explain to our son you don't have to have your wiiu plugged in to play. Lesson learned. This replacement is just great!",
      "rating": 5.0,
      "verified": true,
      "author": "kelly",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Perfect",
      "text": "This saved us from buying a new gamepad... wonderful purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Christy L",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Works as it should",
      "text": "The addition of the USB charger cable makes it easier for additional charging options",
      "rating": 5.0,
      "verified": true,
      "author": "Smile :)",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "A good price deal",
      "text": "A good price deal. The usb cable didnt wprk right when the gamepad was already critically low plugged into wii u. Once it was charged to 2 bars via AC, it worked fine again. The AC cable has had no problems. The AC cord is normal length. The USB is very long. A good deal for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "It works and hasn't broke!",
      "text": "works with my WiiU and has yet to break. I thought my wiiU port was broken, because my old cord was loose and it was finnicky while charging, but this cord fits perfectly and charges very fast. Satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Dazzle",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Works great",
      "text": "Great purchase item as expected. Works for our Wii U with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen719",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Durable",
      "text": "Good price for both...very durable...have held up to my wild boys",
      "rating": 5.0,
      "verified": true,
      "author": "ladyheather821",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "it works",
      "text": "It connects to the dock and charges the pad. So it's good.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "As described",
      "text": "The cord is just as described and what we needed to replace the old cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly C. Hunter",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "easy purchase",
      "text": "what a fast easy well priced purchase. I am a very happy camper",
      "rating": 4.0,
      "verified": true,
      "author": "Lorna",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great for the price",
      "text": "Love the fact it's 2 cords, saved one as a back up. Had for a month now with no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Selizthorn",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Quality.",
      "text": "Our original charger stopped working. We thought the Wii U was done. This charger brought it back!! So happy that we can still use the Wii U.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Finally a peace of mind!!",
      "text": "Perfect replacement for the original charger after wear and tear of the old one. My 10 yo was very happy to have two cords to charge his gamepad. Now he can stop bugging me and I can have some me time.",
      "rating": 5.0,
      "verified": true,
      "author": "ladyv",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Replaced original AC",
      "text": "Replaced original cat chewed AC adapter cord, been working as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "TV Man",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Failed after 6 weeks",
      "text": "Worked for a month and a half. Then stopped working. The one good thing is an extra long usb cord i can use to charge it with.",
      "rating": 1.0,
      "verified": true,
      "author": "Eddiemlo",
      "helpful_votes": 2,
      "publication_date": 20180313
    },
    {
      "title": "Great replacement charger",
      "text": "Product as described and works great. Couldn't find a replacement charger for my kids Wii U after dog chewed the cord in half. This product shipped quickly and works great. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Good replacement.",
      "text": "As described, on time, and it works so far as I know, as it wasn't for me.",
      "rating": 5.0,
      "verified": true,
      "author": "sandymom",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Two chargers for the price of one: great deal!",
      "text": "My last charger was eaten by my cats, but this replacement works perfectly. Plus, by having a second charging option, I don't have to worry if something happens to the charger again.",
      "rating": 5.0,
      "verified": true,
      "author": "Marnie",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "They work great and a long",
      "text": "Due to my boisterous game playing I have bought several chargers from this dealer. They work great and a long! I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Great product",
      "text": "My little sister broke her Wi U charger and needed one right alway. I wasn't to sure if I should buy on from here or the Game Stop store. I risked it and bought one here due to having it at a better price. This change has been working just fine and it came with the laptop USB charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin More",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "It is probably a great product, unfortunately it does not work with my ...",
      "text": "It is probably a great product, unfortunately it does not work with my Wii. I will have to check around for another plug. Seller shipped in a timely manner, without incident",
      "rating": 3.0,
      "verified": true,
      "author": "Claudia M Leonard",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "It works",
      "text": "One of the items we needed, but it’s the power cord not the charger so title and description needs to be updated.",
      "rating": 5.0,
      "verified": true,
      "author": "Gamingmama",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Solved my problem.",
      "text": "Connection was not tight. Now it charges like a champ.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Recued our WiiU controller",
      "text": "Our WiiU controller would not charge anymore despite having a replaced battery. The new cable fixed the problem, which saved us time and money hunting down a replacement controller.",
      "rating": 5.0,
      "verified": true,
      "author": "NW family",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "I recommend",
      "text": "They work and having 2 chargers is great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricky",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Five Stars",
      "text": "Kids can again play their Wii U!!! A definite blessing when the cable is out.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy L.",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Compatible",
      "text": "This product is very reliable and compatible with our wiiu",
      "rating": 5.0,
      "verified": true,
      "author": "christy",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Works great so far",
      "text": "Works great so far. I have charged my Wii U Gamepad several times and no problems. This is a must buy if your original charger bit the dust like mine did!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hubert",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Austor Charger Kit for Wii U GamePad",
      "text": "No problems with the product this far. Shipping was fast!",
      "rating": 5.0,
      "verified": true,
      "author": "Niki ",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Good value, good quality, bonus cord for your money",
      "text": "Quality is just as good as OEM from Nintendo, plus you get a USB ended cable to boot. Great replacement. (My 4 year old took scissors to the original cord, so having an extra backup is a great thing.)",
      "rating": 5.0,
      "verified": true,
      "author": "Hilary Wright",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Good buy",
      "text": "The cables are in great condition, my husband has no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Like double charger feature.",
      "text": "Did what we needed it to do. Charged our WII U GamePad. Liked the fact that it came with a USB charger as well as a wall charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Stormy Dawn",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Pretty decent quality",
      "text": "Pretty decent quality. Not the same as Nintendo brand, but works well enough to not spend the price for name brand z",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "works for wii U game pad charging",
      "text": "This charger is working great so far, and a super price. We bought this to charge our Wii U game pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamamia",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Charger was DOA",
      "text": "The charger DID NOT work. Thankfully, the USB cable did.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180523
    },
    {
      "title": "It is a cord",
      "text": "Much game play need charger :) my daughter takes the poss in her room and plays using this chord. works great",
      "rating": 5.0,
      "verified": true,
      "author": "Trisha",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Five Stars",
      "text": "both work perfectly and were shipped as soon as i bought them",
      "rating": 5.0,
      "verified": true,
      "author": "ScottSummersLV",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Great charger",
      "text": "I prefer this one to just the single chord. It last longer. I like that it has the adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommyov5",
      "helpful_votes": 0,
      "publication_date": 20180729
    }
  ],
  "product_meta": {
    "title": "Austor Charger Kit for Wii U Gamepad - Supply AC Adapter Charging Cable with Charger Cord for Nintendo Wii U Gamepad",
    "description": "Ideal quality replacement bundle or as a spare for Nintendo Wii U Gamepad, have been tested to achieve the same optimum charging time and output of the original \n\nFeatures \nAC Adapter Input: 100-240V 50/60Hz; Output: 4.75V/1.6A \nCharger Cable length: 110cm, USB cable length: 3m \n\nPackage include \n\n1 x US Plug AC Adapter Charger for Nintendo Wii U GamePad \n1 x 3m Charger Cord for Nintendo Wii U GamePad",
    "rating": 4.7,
    "feature_bullets": [
      "Ideal quality replacement bundle or as a spare for Nintendo Wii U Gamepad, have been tested to achieve the same optimum charging time and output of the original",
      "Durable power adapter and USB charge cable allows you to have maximum portability and game time, seamless plug and play charging, extended life guarantee",
      "AC Adapter Input: 100-240V 50/60Hz; Output: 4.75V/1.6A",
      "Charger Cable length: 110cm, USB Cable length: 3m",
      "Compatible with Nintendo Wii U GamePad controller"
    ],
    "specifications": {
      "Product Dimensions": "8.66 x 1.57 x 3.94 inches",
      "Item Weight": "4.8 ounces",
      "ASIN": "B01JGNF60A",
      "Customer Reviews": "4.7 out of 5 stars716 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#2,971 in Video Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 1, 2016",
      "Manufacturer": "AUSTOR"
    },
    "categories": [
      "Accessories",
      "Chargers",
      "Video Games",
      "Electronics",
      "Legacy Systems",
      "Wii U",
      "Batteries & Chargers"
    ],
    "price": 11.99
  }
}