{
  "website_summaries": [
    {
      "verdict": "It's impressive that this harness significantly reduces the chance of back pain when toting binoculars for extended periods of time.",
      "pros": [
        "Design keeps back pain at bay, even when worn for extended periods",
        "Easy to attach and detach from binoculars and to put on",
        "Made of lightweight and breathable material, perfect for any weather",
        "Has enough length to fit comfortably over a jacket in most cases"
      ],
      "cons": [
        "Takes some trial and error to adjust strap to perfect length for each individual’s body"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Slick... well worth the money",
      "text": "I really like how the brace spreads support across the back. I had these on and off many times over a long weekend of hunting and never had issues with getting the back to lay flat. A few of my buddies, with a more traditional harness, ogled this simple but effective contraption.",
      "rating": 5.0,
      "verified": true,
      "author": "likesgoodthingsthatwork",
      "helpful_votes": 11,
      "publication_date": 20170410
    },
    {
      "title": "Far from an \"ingenious strap\"",
      "text": "So disappointed with this \"Amazon choice\" binocular strap. The advertising is inaccurate. It arrived in a used ziploc bag that had the word \"China\" on it and without any other packaging or instructions. It lacks support/substance. I cannot see any difference between this harness and the strap my binoculars came with.",
      "rating": 2.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Works with binoculars that have small place to connect",
      "text": "I love this harness. It is very comfortable, and is the only one I could find that had a way to connect to my Eagle binoculars, which have a small hole to connect straps to. I had been using zip-ties, and they both looked geeky and broke from time to time. So this is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie McNeill",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Good value",
      "text": "Nearly identical tot he Bushnell version of this, which is a good thing. I only wish the strap that secures to binos was a little longer to allow to secure the lens caps without it being so tight. Of course that depends on what style of binos you mount these too... Overall, great for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Trevor J. Smart",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Definitely worth the purchase",
      "text": "This harness worked out really great! Took a trip that involved a lot of binocular use, and this harness made it so easy to carry binocs without the neck strain and have them handy at a moments notice. Very comfortable. I put key rings on the binocs and found it very easy to attach/detach. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Shadow",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Buckles won't hold straps",
      "text": "Poorly designed buckles won't hold the elastic straps without slipping. You start out with your binoculars in the perfect position. Within 10 minutes they buckles slip and the binoculars are hanging down to your crotch.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "easy on the neck!",
      "text": "no more neck strain carrying my camera! So comfortable. I would have preferred rigid straps with a bit of elastic instead of totally elastic but that's easily repaired. very pleased with this purchase",
      "rating": 4.0,
      "verified": true,
      "author": "Diane C Wilson",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Thanks for a great harness!",
      "text": "I have some (to me) heavy binoculars and didn't want to have neck and back strain from a normal strap. This is adjustable and I don't even notice the feel of my binoculars with this on. Thanks for a great harness!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180430
    },
    {
      "title": "No Sore Neck for Me!",
      "text": "Just what I needed to hold my large binoculars at my grandson's safari themed 1st birthday party. Knew I wouldn't be comfortable with them just hanging around my neck. With this I had them on the entire party.... no problem! Just call me Grammy the safari guide!!!",
      "rating": 5.0,
      "verified": true,
      "author": "katrina",
      "helpful_votes": 4,
      "publication_date": 20170317
    },
    {
      "title": "Returned these straps",
      "text": "The straps seemed to be designed with a twist in them that made them uncomfortable to wear. The patch on the back seemed heavier that mn it needed to be.",
      "rating": 1.0,
      "verified": true,
      "author": "Phipfaye",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "clips too stiff to work easily",
      "text": "I really wanted to like this harness, and I tried and tried to attach it to my binocs. After a while I managed to thread the lanyard into the binoc slot. But the clips on this are so stiff that I couldn't work them easily. I can't imagine myself getting in and out of this outside . . . too hard.",
      "rating": 3.0,
      "verified": true,
      "author": "JLC",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Good for the price, but not quick clip attach / detach",
      "text": "The elastic harness is good for fitting - without constant readjusting - over layers of clothing when outdoors. I used them on a trip when I was wearing a heavy parka one minute, then shedding down to a fleece. BUT, this harness attaches to the binoculars with a little belt feature and then has a clip for \"quick\" detaching the binoculars, not a pinch insert as I recall was shown in the photo when I made my purchase. Good for the money, but this harness may be relegated to the kids when I find a more professional product.",
      "rating": 4.0,
      "verified": true,
      "author": "Leigh D.",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Comfort and ease of use",
      "text": "I love my harness, my husband and I are avid birders but this year having binoculars hanging around my neck stopped me from wanting to get out and do my favorite thing. My harness cured me I have been back out 4 days a week again. Thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Vick",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Received with frayed edge",
      "text": "Bought for a gift, but the edge was frayed so I returned it. Not sure how a frayed edge got through Quality Control. Two stars because it otherwise was as expected and fit fine. The embroidery was nice touch, better than the screen-printed brand I bought to replace this one.",
      "rating": 2.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Your binoculars are where you want them to be at all times",
      "text": "Really easy to put on and off compared to a ton of other types we've seen people struggle with.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Pullan",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Great harness for the price.",
      "text": "Best for the price. Great for the typical binocular but heavier binoculars may hang low due to very stretchy straps. Does not work well with my 15x70mm but works great witb my 10 x 40.",
      "rating": 5.0,
      "verified": true,
      "author": "Chico",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "very comfortable - worked great with both my binoculars and my ...",
      "text": "very comfortable - worked great with both my binoculars and my big 35 mm camera - much more comfortable than the neck harness.",
      "rating": 5.0,
      "verified": true,
      "author": "Newportmom",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Can't Share",
      "text": "Your neck will thank you. Remember that you won't be able to easily hand the binoculars to another person. You may need to buy your spouse their own set! Product quality seems top notch.",
      "rating": 5.0,
      "verified": true,
      "author": "RV Traveller",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Awesome product but probably works better for a man or ...",
      "text": "Awesome product but probably works better for a man or a female who has a smaller chest. It is comfortable and easy to wear, the chest straps just didnt stay in place for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Tricia Gentzler",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Works well and good value",
      "text": "We just got a new pair of good binoculars for birding, but the heavier weight was uncomfortable on our necks. This places the whole weight around your shoulders and the binoculars hang just above your belt. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Lesser",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Adjustment on your body is important to start.",
      "text": "First' I thought the sliding connectors on each side was strange, but the more I used it the better I liked it. When I would put my binoculars down, they would drop down to the point of my waist, but when I picked them up to used, they slid up smoothly, adjusting the strap was my problem, once I corrected the way it fit, it was perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "MrValdo",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Perfect!",
      "text": "Completely got rid of all the neck pain from the strap that came with the binoculars.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Sanchez",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Comfortable, secure",
      "text": "I got it to use with a Nikon P900 for mostly nature photography. I attached a Keyhole camera harness in the front and it supports the weight of the big camera just fine. A typical day is a 2-3 hour hike in the desert. The combination of this harness and the keyhole means I no longer have a heavy camera swinging back and forth around my neck. Fits comfortably with no hot spots even after several hours on the trail.",
      "rating": 5.0,
      "verified": true,
      "author": "pencilpusherTop Contributor: Photography",
      "helpful_votes": 6,
      "publication_date": 20170406
    },
    {
      "title": "Very good binocular harness",
      "text": "It is very easy to use and one doesn’t fight all the straps on other models. It is night to be able to remove the binoculars so easily. They seem to be prett6 well made.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Straps are too stretchy",
      "text": "The harness itself, is comfortable, but I found that the straps were too stretchy, especially after I attached my binoculars. I ended up buying some new connector straps, to help stabilize the straps a bit, so in the end.... I paid more for this harness than I was anticipating.",
      "rating": 4.0,
      "verified": true,
      "author": "David Clarke",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "light weight and comfortable",
      "text": "have been using for hunting this fall very comfortable and holds my binoculars well",
      "rating": 4.0,
      "verified": true,
      "author": "hunter 58",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Really easy to use",
      "text": "Received in two days. Really easy to use. Kind of light weight and straps are too stretchy for anything heavy..like my camera. Works great with my binoculars but doesn't support my camera. I am happy with product. Also comfortable to wear",
      "rating": 4.0,
      "verified": true,
      "author": "Jan Thomas",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Great scope so far",
      "text": "Great scope so far. Very easy to sight in and hopefully very durable everything seems to be of good quality and very user-friendly.",
      "rating": 5.0,
      "verified": true,
      "author": "John Mueller",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "as advertised",
      "text": "fit well, easy to use, performed as expected. Makes bird watching with binoculars easier and less tiring.",
      "rating": 5.0,
      "verified": true,
      "author": "RS",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Comfortable, easy to wear--makes having the binoculars on extremely ...",
      "text": "Comfortable, easy to wear--makes having the binoculars on extremely comfortable as opposed to uncomfortable with the traditional straps. Only complaint is that the clips provided don't appear to fit anything useful. We had to rig two cables to clip the harness to. That said-an excellent choice!",
      "rating": 5.0,
      "verified": true,
      "author": "Boyzdad3",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "great - just like Bushnell harness",
      "text": "got 2 of these to go with binoculars for hunting for my 2 sons. great product - just like BUSHNELL harness - at a much better price!",
      "rating": 5.0,
      "verified": true,
      "author": "Russell R. Herman",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Just buy it.",
      "text": "Tried a friend’s pair and didn’t realize how nice something like this is to have in your hunting gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Recommended",
      "text": "Nice product. Would like to see the clasp be narrower. Feel free to contact me if my suggestion is unclear.",
      "rating": 4.0,
      "verified": true,
      "author": "RossH",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Comfort plus makes this harness a winner",
      "text": "Eyeskey Binocular harness strap that I purchased for a friend was highly appreciated on a recent birding trip. Comfortable to the max and made hiking and siting a breeze. It was such a hit that I came home an ordered another for myself. Seems very airy and weightless. Heartily recommend. Thanks for an excellent product at a fine price.",
      "rating": 5.0,
      "verified": true,
      "author": "SandyB",
      "helpful_votes": 2,
      "publication_date": 20170429
    },
    {
      "title": "Comfort",
      "text": "My binoculars are no longer a pain in the neck! The harness is easy to use, comfortable and adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "happy wife",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Five Stars",
      "text": "Very easy to put on and easy to adjust. I'm sure I will be using on my next hunt.",
      "rating": 5.0,
      "verified": true,
      "author": "CAL",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Five Stars",
      "text": "this was for my wife and it fit her great and very light",
      "rating": 5.0,
      "verified": true,
      "author": "michael k.",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Binocular harness",
      "text": "Once you get use to getting these on you are set !! My binoculars are fairly heavy, I don't even know they are on !! I tried several harnesses and this was the best for me by far !!",
      "rating": 5.0,
      "verified": true,
      "author": "Phyllis F.",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Comfortable.",
      "text": "Buy this. Comfortable and keeps the glasses in perfect resting placement.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Great item, highly recommend",
      "text": "Love this binocular halter, fits great and really protects my neck from strain.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert H.",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Has a great fit equipment easily to use and it's available at ...",
      "text": "Has a great fit equipment easily to use and it's available at an awesome price I looked at plenty of plenty of others and none has fit as well as this does.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Groves",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "I love it as it is light and with the wider ...",
      "text": "I love it as it is light and with the wider back it is very comfortable to wear - no aching neck or back..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Comfortable, no pulling on neck",
      "text": "Comfortable, no pulling on neck, binoculars don't bounce as you walk. This is a second one for my other binos.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Granek",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Five Stars",
      "text": "Very competitive price and fast shipping. Purchased as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Wheeler",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "GREAT value for the money.... you'll Love it!",
      "text": "Feels great, looks fabulous, and functions beautifully! What more can one ask for... REALLY? 👍👍",
      "rating": 5.0,
      "verified": true,
      "author": "F W Logan",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Works beautifully!",
      "text": "Love this! It keeps my bonocs from bump, bump, bumping my stomach and chest, and doesn't make my neck tired.",
      "rating": 5.0,
      "verified": true,
      "author": "Steggie",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Nice harness and price",
      "text": "Nice harness and price, and comfortable to wear. I am adding clips and eyelets to the binocs to allow me to switch back and forth to a shoulder strap if desired.",
      "rating": 5.0,
      "verified": true,
      "author": "BILOZ",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Better than all straps",
      "text": "Nice fit with my heavy camera. Much easier on & off than my previous harness that was all straps",
      "rating": 4.0,
      "verified": true,
      "author": "Franklin L. Grabowski",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Comfortable",
      "text": "3rd try at getting a sling that works for me",
      "rating": 5.0,
      "verified": true,
      "author": "Julie A. Crozier",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "excellent & personalized follow up",
      "text": "quick delivery, excellent & personalized follow up, & good price",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Winsberg",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Five Stars",
      "text": "It’s awesome good deal too worth it for any biologist or bird lover",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Four Stars",
      "text": "I like the product. If straps were wider it would be more comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Dale M.",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "great comfort",
      "text": "spreads weight over back and not just the neck area, I am small and this adjusted nicely",
      "rating": 5.0,
      "verified": true,
      "author": "Carol A.",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Good Value",
      "text": "Does what it says. However, it rides up in the back and presses against my neck. Can't seem to make any adjustments to stop that. Not a huge problem, just somewhat annoying. Concerned the elastic straps might not last very long and will sag in a year or two. But for the price, it isn't a huge issue. The rear \"plate\"breathes enough, so I remain as cool as possible on hot days.",
      "rating": 3.0,
      "verified": true,
      "author": "Martin Main",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Five Stars",
      "text": "It's very comfortable and easy to get off and on.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "These are by far the best. They fit well",
      "text": "We have several harness straps for cameras and binoculars. These are by far the best. They fit well, are very sturdy and hold the camera/binoculars closer with less movement then the ones with smaller supports on the back.",
      "rating": 5.0,
      "verified": true,
      "author": "mathsj",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Handy Binocular Holder",
      "text": "Well designed and perfect for the binoculars I bought it for, 10 x 50s and 12 x 36s. Depending on your usage, it might suit your purposes quite well.",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Great product, It is a little difficult to get it fit flat against your back.",
      "text": "I would have given 5 stars, but the back support doesn't fit flat. It can fit smooth across your back if you have someone to help you.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Smith ",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "I really like this harness",
      "text": "I really like this harness. I holds the glasses in a good position, it's light and easy to get on and off. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Stein",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Average harness",
      "text": "Another attempt at a comfortable harness but as one who carries both binos and camera, I prefer the HEAD harness. I will use this for summer forays.",
      "rating": 3.0,
      "verified": true,
      "author": "john gregoire",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Five Stars",
      "text": "This harness is so awesome. Takes the weight off my back and shoulders.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "Five Stars",
      "text": "fits good, hooked the binoculars with the straps they came with it and I was ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick ball",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "I couldn't be more pleased.",
      "text": "I finally have a solution to hiking with binoculers! Simple and effective and confortable. I couldn't be more pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Hays",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Comfort and ease",
      "text": "Excellent soft and easy to don on...a must by if you want comfort!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Inaccurate Description",
      "text": "The description clearly states \"Eyeskey Binoculars Harness Strap - Great for Binoculars, Cameras and Rangefinders Eyeskey Eyeskey 10x42 High Powered Magnification Binoculars - Bright and Clear Range of View - for Travel Bird Watching, Astronomy, Sports and Wildlife - Comes with Case, Lens Caps, Strap\" All I received was the strap",
      "rating": 1.0,
      "verified": true,
      "author": "Prof",
      "helpful_votes": 3,
      "publication_date": 20170506
    }
  ],
  "product_meta": {
    "title": "Eyeskey Binoculars Harness Light-Weight Breathable Comfortable Binocular Strap Harness -Easy to Attach and Detach Binoculars, Cameras and Rangefinders, 4oz",
    "rating": 4.5,
    "feature_bullets": [
      "This harness with its ingenious strap keeps your binoculars and rangefinders, even cameras, from jostling around as you walk, freeing up the use of your hands.",
      "Made from nylon straps which are durable and allow for easy sliding of binoculars into viewing position",
      "Spreads the weight of your binoculars across your shoulders for more relaxed viewing, making this the most comfortable way to carry your binoculars for hours",
      "This binoculars harness also helps keep your binoculars close to your chest and out of the way",
      "Unique self-adjustable design can not only add comfort, but also offer large adjustment range to fit any requirements you desire"
    ],
    "specifications": {
      "Product Dimensions": "9.2 x 7 x 1.6 inches",
      "Item Weight": "3.99 ounces",
      "ASIN": "B01J3DV4MW",
      "Item model number": "4332112302",
      "Customer Reviews": "4.5 out of 5 stars120 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#25 in Binocular Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 19, 2016",
      "Manufacturer": "Eyeskey"
    },
    "categories": [
      "Electronics",
      "Accessories",
      "Camera & Photo",
      "Binocular Accessories"
    ],
    "price": 14.99
  }
}