{
  "website_summaries": [
    {
      "verdict": "An empowering and inspirational option. The perfect Barbie for little girls with big aspirations.",
      "pros": [
        "Allows little ones to adopt the role of a caretaker, encouraging compassionate and nurturing behavior",
        "Features loads of realistic extras for imaginative and convincing play"
      ],
      "cons": [
        "Small parts can be a little difficult to keep track of and may pose a choking hazard"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Adorable set!",
      "text": "Adorable set. My daughter will be excited to finally have African-American babies to play along with her other African-American dolls and the set really is adorable. I bought the \"used\" option from the Amazon Warehouse deals, which was much cheaper, and there was only slight damage to the packaging that isn't all that noticeable and is the type of damage items are prone to during shipping so it was a great deal. I recommend checking to see if there are \"used\" Amazon Warehouse deals on the items you buy so you can buy them much cheaper, because this is my second time buying an item with that method and the \"damage\" on both items was barely any damage at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 24,
      "publication_date": 20161217
    },
    {
      "title": "because the cart is not sturdy and keeps tipping over",
      "text": "This set has gotten more playtime than the average toy. I am giving it 3 stars, however, because the cart is not sturdy and keeps tipping over. My daughter has to prop it against the wall to play with it. The baby beds do not clip in well to the cart either so they slip off easily. This set is probably less frustrating for a child 5 and over.",
      "rating": 3.0,
      "verified": true,
      "author": "ck0987",
      "helpful_votes": 10,
      "publication_date": 20170913
    },
    {
      "title": "She is African American",
      "text": "I ordered this doll thinking she would be anglo/brunette. I was surprised to find she is African American, but no worries. I love the multicultural Barbies and am thrilled to give this lovely doll to my granddaughter. Her mother's OB/GYN is an African-American Doctor, so this doll is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Houston Trumpets",
      "helpful_votes": 6,
      "publication_date": 20181219
    },
    {
      "title": "She’s loves it!",
      "text": "My daughter is wanting to become a pediatrician when she grows up. Being half African American, it’s hard to find dolls that look similar to her. When she opened this up she screamed with joy!!! She loved seeing a Barbie that looks like her and is a pediatrician!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 3,
      "publication_date": 20191103
    },
    {
      "title": "We bought this for our daughter. She loves that ...",
      "text": "We bought this for our daughter. She loves that the Barbie is a doctor and that she got 2 babies to play with as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Ray",
      "helpful_votes": 4,
      "publication_date": 20180217
    },
    {
      "title": "it is great quality. My daughter loves that Barbie has babies ...",
      "text": "My 5 year old loves this Barbie set. As expected with Barbie, it is great quality. My daughter loves that Barbie has babies to care for.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Crawford",
      "helpful_votes": 5,
      "publication_date": 20180220
    },
    {
      "title": "The legs on the cart are bent",
      "text": "The package showed up on time, with the box in good shape but the legs of the cart bent. My daughter is so happy to have it so I don't want to send it back and wait for another",
      "rating": 2.0,
      "verified": true,
      "author": "Marlicia Jacobs",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Donation, Impressed.",
      "text": "In my next life I’m going to find a way to make toys that represent all heritages, the norm. This arrived promptly and well packaged. Girls rule! Just wish that there were more choices but the Pediatrician was very nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Patty",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Nurse Barbie with babies",
      "text": "Given to neice for her bday to go along with her Barbie Dreamhouse, as her mom is a nurse that works with the babies it was so cute to hear her say \"this like my mommie so I'll name her Nurse Christi\".",
      "rating": 5.0,
      "verified": true,
      "author": "Ringleider",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Inspirational Barbie",
      "text": "I bought this Barbie set as a birthday present for a sweet little girl. When she opened it everyone was WOWed with all that was in it. Most important to the little girl was the doctor looked like her. Thank you, Amazon & Mattel!",
      "rating": 5.0,
      "verified": true,
      "author": "PG",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Loved the dolls and the set",
      "text": "Loved the dolls and the set! My only complaint would be that the dolls are just regular dolls, painted darker, with no AA features. Still very satisfied with my purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Tina R.",
      "helpful_votes": 4,
      "publication_date": 20161223
    },
    {
      "title": "Great Product!",
      "text": "This was bought for my daughter for Christmas (6 years old). No complaints. She loves it! The dolls are well-built and look like they will withstand plenty of play. Thank you for making a little girl happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Therrien",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Christmas joy made affordable",
      "text": "If you like Barbie you will not be disappointed. my little girl loved it and it was so affordable I bought one for my niece",
      "rating": 5.0,
      "verified": true,
      "author": "cynthia murphy",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Looked everywhere for her",
      "text": "Super thrilled I was able to find the black barbie.. I looked everywhere. She’s awesome! Daughter loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy Young",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Who doesn't love Barbies",
      "text": "Got as a surprise for my daughter! She screamed when she seen it because it has the best of both worlds: barbies and babies. Cute little set. Great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great gift",
      "text": "I love it when Barbie makes African-American dolls with careers and I have been purchasing quite a few of these for my granddaughter who happens to love them",
      "rating": 5.0,
      "verified": true,
      "author": "Ladybugdes",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Awesome",
      "text": "My daughter absolutely loves her Barbie! It came with 2 babies, the changing table, chart, lotion, and 2 baby bottles. The doll is tall and has a nurse scurb look with tennis shoes and a scope. I would recommend this to anyone who's little girl loves Barbie's or who wants to be a doctor 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Foster",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Step daughter really likes it.",
      "text": "The packaging was in good shape when it arrived. It was just what she wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Blankenship",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Well worth the money",
      "text": "You will not be disappointed if you’re in the field and you want to carry out the tradition.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammi G.",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great doll set",
      "text": "Well made, she even stands upright without support. My daughter noticed she even has nurse shoes. My 3 year old LOVES this set.",
      "rating": 5.0,
      "verified": true,
      "author": "MBV",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Worth it!",
      "text": "My daughter loves her doctor barbie and the adorable babies!",
      "rating": 5.0,
      "verified": true,
      "author": "William A. Ray III",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "The quality is excellent. Grandma win",
      "text": "I bought this Barbie Doctor and babies set for my grand daughters. They have played and played with them. The quality is excellent. Grandma win!",
      "rating": 5.0,
      "verified": true,
      "author": "MaLinda P. Roy",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Great gift to go along with other barbie items",
      "text": "This was a great gift to go with the Barbie Medical van that was purchased.",
      "rating": 4.0,
      "verified": true,
      "author": "Malekats",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "the hardest part seems to be opening package , she loves it .",
      "text": "I think it is well worth the pice and she has already had counless hours of fun .",
      "rating": 4.0,
      "verified": true,
      "author": "Norman K. Hill",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Love seeing multicultural dolls in different professions",
      "text": "Love seeing multicultural dolls in different professions. I go to a culturally diverse church and I bought this doll to donate for a church function. Package arrived on time and was as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Margo Rice",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great inspiring gift!",
      "text": "I got this doll set as a Christmas gift for my 5 year old cousin. She absolutely adores it! Although the dolls look small on the picture, the doctor is a regular-sized Barbie and the babies aren't very small either.",
      "rating": 5.0,
      "verified": true,
      "author": "Demon reader",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Great gift",
      "text": "My niece is obsessed with Barbie and it was really important for me to get her one that she would see herself in. She adored it. Plays with it every weekend in her Barbie house and takes her job (as a twin baby doctor to quote her) very seriously.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabbi",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great gife  for mom and Daughter",
      "text": "It was a gift and she loved it since her mom is a Dr she got to play one .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "A nice find...",
      "text": "...a cute doll I have not come across in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "ETA",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "My daughter loves her new toy",
      "text": "Happy I got it for my daughter, she loves it 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Ramona Davila",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Love",
      "text": "My daughter was so excited and so happy when this Barbie set came we had been looking for it for a long time and when we found it on Amazon at such a good price we ordered it immediately and it came so quickly she was extremely happy and so were my husband and I with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "David G.",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Always great service with Amazon",
      "text": "Gave to my great granddaughter for Christmas because her mother is an RN in the maternity ward. And, this Barbie doll looks a lot like her. The doll was a big hit with Mommy & Daughter!💕💕",
      "rating": 5.0,
      "verified": true,
      "author": "LHenderson",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Yes",
      "text": "Exactly what she wanted, it put a smile on my grandbaby face",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Llanez",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Nice set!",
      "text": "7 year old Granddaughter received it today and she loves it! Very cute.",
      "rating": 5.0,
      "verified": true,
      "author": "curtid davis",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "For the price, I'm a little disappointed",
      "text": "For the price, I would expect the barbie to have posable arms and legs but they don't move so it makes playing with them rather difficult. The box came crushed as well. Overall this toy is still fun and my daughter enjoys it.",
      "rating": 3.0,
      "verified": true,
      "author": "Fran",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "I am disappointed that the item is damaged",
      "text": "The left hand of the doctors is badly mishappen. I wish I had time to exchange! Aside from the hand the dolls are good, it’s just too noticeable for my 6 yr old to not see it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Cute gift",
      "text": "Great gift. There are lots of tiny pieces that comes with it in case you have children with smaller siblings.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Labbe",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Super adorable",
      "text": "My 5yo loved this, great for pretend play. The little babies were a great addition to her barbie collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Gabriel",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Cute and good value",
      "text": "My three year old loves this set. It’s really cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah Brignoni",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "I'm sure my granddaughter is going to love it.",
      "text": "The play set is really cute. I'm sure my granddaughter is going to love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Manager in California",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Four Stars",
      "text": "loved it, although its weird the babies have on lipstick",
      "rating": 4.0,
      "verified": true,
      "author": "blackmajiqwoman",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Niece loved it!",
      "text": "Bought this for my niece’s birthday. She loved it! Great buy and quick delivery!",
      "rating": 5.0,
      "verified": true,
      "author": "Bethieannie",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Very pretty",
      "text": "It was a birthday gift for my neice, so loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Denise J. Riley",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Fun Barbie set with nice accessories.",
      "text": "My daughter loves playing with this set and all the included accessories. One of the few outfits she can easily take off AND put back on her Barbie.",
      "rating": 5.0,
      "verified": true,
      "author": "ChipIsHip",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Doc Reena proud barbie",
      "text": "It’s a gift for my daughter who is a Doctor and the Barbie is perfect with the similar outfit she wears to the hospital",
      "rating": 4.0,
      "verified": true,
      "author": "Shakuntala",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Every Little girl Needs!",
      "text": "My daughter adores this doll!!! Great quality and exactly as pictured!!",
      "rating": 5.0,
      "verified": true,
      "author": "Destiny",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Best Barbie Smile Ever",
      "text": "This was for my granddaughter who absolutely loved it! Very pleased customer. When she saw her Barbie the smile on her face was Priceless",
      "rating": 5.0,
      "verified": true,
      "author": "Marion Regina Mullings",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "my grands were quite pleased! That says it",
      "text": "nothing can be said here as it met all criteria in terms of what it is and the qulity of the item. my grands were quite pleased! That says it all",
      "rating": 5.0,
      "verified": true,
      "author": "Sean F. Smith",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Great Bday Gift",
      "text": "My step-daughter loved her birthday gift! She opened this gift 1st! #BlackGirlsRock",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Brathwaite",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "A good kids toy",
      "text": "A really good set. Its gotten a lot of use and the babies are adorable.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Taylor",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Positive images can help shape the future.",
      "text": "It was a gift for a baby that's part of the angel network. I was very pleased with it and proud to gift her with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jocelyn",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Perfect gift",
      "text": "My niece was so happy to get this for her birthday. Very good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane F.",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Cute",
      "text": "Cute doll and babies for 8 year old girl. She loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Itslala",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Wonderful!!!!",
      "text": "A wonderful gift for my daughter. She is not even three yet, but she loves the Doctor Barbie and the babies!",
      "rating": 5.0,
      "verified": true,
      "author": "bryant e pugh",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Beautiful",
      "text": "Love love love Christmas gift for my girls they will love it",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Franklin ",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "but I love the product",
      "text": "The box was a bit smashed, but I love the product.",
      "rating": 4.0,
      "verified": true,
      "author": "hartzlady",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "An Awesome Gift",
      "text": "I bought this as a birthday present for my 8 year old sister and she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Khalia ",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Super cute!!!",
      "text": "My niece loved this present! I wish I had a beautiful black doctor-barbie-doll when I was growing up. Thanks Barbie team :)",
      "rating": 5.0,
      "verified": true,
      "author": "Diva",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "... Barbie There mother is a doctor and they just love playing with her",
      "text": "I gave my two little neighbor girls this Barbie There mother is a doctor and they just love playing with her",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "wundefull",
      "text": "The doll looks very pretty. I like that the babies have different skin colours. Great to play with them. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia Maria",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Great Gift",
      "text": "Great That they have so many diverse dolls by Barbie",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "She loved seeing some one who looked like",
      "text": "This was a gift for my mixed race grand daughter. She loved seeing some one who looked like jer",
      "rating": 5.0,
      "verified": true,
      "author": "Flora Piterak",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Five Stars",
      "text": "Super cute and my daughter loves it. The baby barbies are a must have!",
      "rating": 5.0,
      "verified": true,
      "author": "Tamika",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Best Barbie set ever!",
      "text": "Loved the price and my daughter absolutely loves playing with the toys you play with it everyday!",
      "rating": 5.0,
      "verified": true,
      "author": "Aimee Flynn",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "I just wish it world have came on her birthday like it was supposed to",
      "text": "My daughter absolutely loves her Barbie. I just wish it world have came on her birthday like it was supposed to. It world have saved me a trip to build a bear.",
      "rating": 5.0,
      "verified": true,
      "author": "Momof6",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "The best",
      "text": "My daughter hasn't stopped playing with it. Best birthday gift so far 😁😁",
      "rating": 5.0,
      "verified": true,
      "author": "Tiara L B",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Cute babies!",
      "text": "Babies are so cute. One white and one black. My granddaughter loves them so much. She is of mixed heritage. Great dolls!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Stephens",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Great set, great price!",
      "text": "This set is quite adorable! My daughters love the little babies and the cart! The barbie is very pretty and her outfit is fun! The whole set, for the price is a steal! (I paid $19.99)",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Darst",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "Five Stars",
      "text": "My niece absolutely love this. I also got her the Barbie 2- story house.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Lipscomb",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "has a dark spot on her lip that looks like a bruise",
      "text": "I bought this for my 4 year old daughter because she loves babies. And these barbie babies are extremely difficult to find in stock. All the pieces were here, arrived in 2 days with my prime membership. Two problems though. Minor and cosmetic. But one of the babies, somehow only the backside of the diaper got colored white, the front is skin colored. And the doctor, has a dark spot on her lip that looks like a bruise. Other than that. It's great, and my daughter was extremely happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Colleen.",
      "helpful_votes": 16,
      "publication_date": 20170313
    },
    {
      "title": "Great Buy!",
      "text": "My Goddaughter is in love with this toy! A great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Douglas",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Barbie career doll",
      "text": "I bought for my 5 year old and she absolutely loved it! I'm glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Five Stars",
      "text": "FANTASTIC doll. My daughter absolutely loves her. The little babies are adorable and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Waggerby",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Good choice got my kiddo",
      "text": "My 4 year old LOVE this Barbie and the babies she came with!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie Spellmeyer",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Bought as a birthday gift for my granddaughter to give ...",
      "text": "Bought as a birthday gift for my granddaughter to give her friend. When she saw it see wanted one for herself so I ordered a second one to give her for her BD.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica Gilliland",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Five Stars",
      "text": "Fantastic gift for Christmas. Went well with the dream house.",
      "rating": 5.0,
      "verified": true,
      "author": "K Davis",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Received exactly what we expected",
      "text": "This doll was great for my child. came with lots of little items to play doctor with, shipped well and on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandyn",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "What are the best gifts I ever again for someone",
      "text": "Party for my granddaughter she loves it I guess I'll be buying some more thank you guys so much",
      "rating": 5.0,
      "verified": true,
      "author": "allen p.",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "package was all broken up",
      "text": "Not even presentable as a gift-see pics Would be willing to return for a replacement Contact me at my email address provided",
      "rating": 1.0,
      "verified": true,
      "author": "val bower",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "♥️IT!",
      "text": "Arrived before delivery date. Very cute! 1 of many gifts for my granddaughter birthday.",
      "rating": 5.0,
      "verified": true,
      "author": "Love",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "The doll is beautiful",
      "text": "I like that Barbie is available in brown skin tones.",
      "rating": 5.0,
      "verified": true,
      "author": "GIGI",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Perfect gift for my grand daughter.",
      "text": "I like the size of this Barbie It was a gift for my grand. She can carry it easily while travelling.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwin Robinson",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Love it!",
      "text": "Very fast shipping love the dolls very sturdy pieces. Will order again!",
      "rating": 5.0,
      "verified": true,
      "author": "Mia",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Super Cute!",
      "text": "She is going to LOVE this when she sees it!",
      "rating": 5.0,
      "verified": true,
      "author": "KV",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "My lil cousin loves this Barbie! She loves that ...",
      "text": "My lil cousin loves this Barbie! She loves that the babies come with it! Now she's trying to make her other barbies nurses!",
      "rating": 5.0,
      "verified": true,
      "author": "TiffanyJ",
      "helpful_votes": 0,
      "publication_date": 20170305
    },
    {
      "title": "Professional looking Barbie",
      "text": "I just hope my granddaughter loves it since it's a gift for her",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Golden-Jewett",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "The way it looks on line was the same way in person. \"PERFECT\"",
      "text": "I bought this as a gift for my granddaughter and of course she loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Scarlet",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Good product for the price.",
      "text": "Got this for my daughter for her birthday. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlene",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Good quality. Many small pieces.",
      "text": "My daughter likes the idea of doctor Barbie and loved the tiny babies",
      "rating": 5.0,
      "verified": true,
      "author": "T-Shea",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "On time delivery",
      "text": "Lovely gift for my niece and it came early just in time for Christmas!",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara Dixon",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Loved this item",
      "text": "Loved this item! Perfect gift for a girl having a Barbie birthday party & hoping to grow up to be a pediatrician!",
      "rating": 5.0,
      "verified": true,
      "author": "Treasure Ts",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Five Stars",
      "text": "I REALLY LOVE THIS SET, IT DID MEET MY EXPECTATION",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Excellent birthday gift",
      "text": "Daughter loves it. Just received it and has been playing with the set for a few hours now. Comes with everything pictured. Her enjoyment made this a great deal. She picked it out to so hopefully I have a future pediatrician on my hands",
      "rating": 5.0,
      "verified": true,
      "author": "Big Will",
      "helpful_votes": 3,
      "publication_date": 20170116
    },
    {
      "title": "Five Stars",
      "text": "I love it and my daughter loves it and it came in time!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "An ok set.",
      "text": "I like this set, but the chocolate baby should have had a different color on her lips. The baby blankets should have been acual blankets instead of little pieces of fabric. Other than that it's ok.",
      "rating": 4.0,
      "verified": true,
      "author": "The Paulson’s",
      "helpful_votes": 2,
      "publication_date": 20170816
    },
    {
      "title": "I am very pleased with this set",
      "text": "I am very pleased with this set. It gets so old seeing toys for 'girls' that only consist of cooking and crafts. I would purchase this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sol",
      "helpful_votes": 3,
      "publication_date": 20161209
    },
    {
      "title": "Daughter loves it!",
      "text": "My daughter loves this playset as her life goal is to be a pediatrician. Kept her entertained for awhile so that I can get little \"me\" time. No complaints here!",
      "rating": 5.0,
      "verified": true,
      "author": "Softball Mom",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "My niece absolutely loves this doll and her babies. ...",
      "text": "My niece absolutely loves this doll and her babies. She’s obsessed with motherhood, pregnancy and doctors so this is right up her alley.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "my daughters likes it and the babies are the perfect size for Barbarie accessories",
      "text": "Cute toy, my daughters likes it and the babies are the perfect size for Barbarie accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "Lissa",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "My niece loved it! The babies arms and legs move",
      "text": "My niece loved it! The babies arms and legs move!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy C.",
      "helpful_votes": 2,
      "publication_date": 20170105
    }
  ],
  "product_meta": {
    "title": "Barbie Careers Baby Doctor Doll Playset, Brunette",
    "description": "Explore the world of medicine with Barbie dolls and medical play sets! Barbie baby doctor doll is ready to see patients with furniture for an exam table and accessories to care for two adorable babies. Details are realistic with colorful touches and office-inspired elements. Teal scrubs and white shoes are a perfect professional look. Barbie baby doctor doll does double duty with an exam station that features two tubs, a moving mobile and storage space. Accessories let young minds care for baby patients with a stethoscope, two baby towels, a bottle and a medical chart. Young doctors will love giving their patients a clean bill of health with baby doctor Barbie doll. Explore all the Barbie career dolls because with Barbie, you can be anything (each sold separately, subject to availability). Includes Barbie baby doctor doll wearing career-themed outfit and accessories, office set, themed pieces and two patients. Doll cannot stand alone. Colors and decorations may vary.",
    "rating": 4.8,
    "feature_bullets": [
      "Explore the world of medicine with these Barbie doll and medical play sets!",
      "Choose from specialties that include zoo doctor, baby doctor or dentist",
      "Each comes with an exam station that has fun features",
      "Includes a career-ready outfit, along an adorable patient (or two)",
      "Girls will love exploring the field of medicine"
    ],
    "specifications": {
      "Product Dimensions": "2.38 x 12.75 x 8.5 inches",
      "Item Weight": "0.96 ounces",
      "ASIN": "B01JMYPFW2",
      "Item model number": "DVG12",
      "Manufacturer recommended age": "36 months - 6 years",
      "Best Sellers Rank": "#67,205 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars1,110 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "May 2, 2018",
      "Mfg Recommended age": "36 months - 6 years",
      "Manufacturer": "Mattel"
    },
    "categories": [
      "Dolls & Accessories",
      "Toys & Games",
      "Playsets"
    ],
    "price": ""
  }
}