{
  "website_summaries": [
    {
      "verdict": "Easy to use, easy to store, and easy to read. Very appealing price point means users can keep one in the car, one in the garage, and one in the boat trailer.",
      "pros": [
        "Compact, easy to store in glove box, backpack, or emergency kit",
        "Digital readout is more precise than manual stick gauges",
        "Automatic shut-off preserves batteries"
      ],
      "cons": [
        "Plastic housing has durability issues",
        "May require several attempts to get an accurate reading",
        "Does not work on all types of valve stems, such as high pressure Presta bike tires"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Something so cheap and plasticky but yet so good.",
      "text": "I bought this for around $9 from here. First thing I noticed was how cheap it felt in the hands when I pulled it out of its box. Thinking to myself, what a cheap piece of crap I bought. I drove to Costco and filled my tires with nitrogen and put it up against their pressure gauge. Holy moly, this gauge was exact compare to Costco's pressure gauge monitor to the T. I was left scratching my head. How can something so cheap in price and and plastic we were so damn good. I'm 100% satisfied and glad I purchase it. Lol. Thank you Amazon and to this company for a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "meee",
      "helpful_votes": 489,
      "publication_date": 20171128
    },
    {
      "title": "Convenient and Works Great!!",
      "text": "So this is the second tire guage I've bought thru Amazon. The first was completely useless. Didn't measure any pressure. At $5 wasn't worth returning. Sucky. This one is great. Seems very accurate, is extremely easy to use and is great at night. You know you need a tire gauge at all the inoportune times. I love that it takes a reading and holds it so you can bring the guage to your face, rather than having to squat in a ridiculous position to read the guage. GREAT IDEA!! It also allows you to bleed off extra air, which I didn't see mentioned - but that works great. This one is A+++++",
      "rating": 5.0,
      "verified": true,
      "author": "Gym Rat",
      "helpful_votes": 199,
      "publication_date": 20171116
    },
    {
      "title": "... dad gave me 30 years ago works so much better. Gives different readings each time I put it ...",
      "text": "My dollar manual tire pressure gauge that my dad gave me 30 years ago works so much better. Gives different readings each time I put it on a tire. Save your $10 and buy a good manual one.",
      "rating": 1.0,
      "verified": true,
      "author": "wdoctortexas",
      "helpful_votes": 116,
      "publication_date": 20180407
    },
    {
      "title": "No accuracy specifications whatsoever",
      "text": "If you look at the AstroAI website, as well as read everything on the box and instructions as well as the Amazon page, nowhere at all is any specification as to the percentage accuracy and +- accuracy tolerance whatsoever. The fact that this is a digital gauge does not make it accurate at all. What makes something accurate is that it is calibrated against a known standard and has quality control measures to ensure that the accuracy is repeatable. Unfortunately I have no know standard to test this gauge, but the fact that there is no published accuracy is extremely telling in iteself.",
      "rating": 1.0,
      "verified": true,
      "author": "Textbook Reader",
      "helpful_votes": 92,
      "publication_date": 20180927
    },
    {
      "title": "The tire gauge works as expected. It is a ...",
      "text": "The tire gauge works as expected. It is a little flimsy. More importantly, there's no mechanism on it to let air back out of the tire if you over inflate the tire. This would be a welcomed addition.",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 85,
      "publication_date": 20171209
    },
    {
      "title": "Handy Dandy Helper",
      "text": "The ergonomic design makes it easy to hold & the quality for the price is impressive. I used it yesterday for the first time & it was a lifesaver. My low tire light was on & it enabled me to pinpoint which one. I am a 75 year old woman & if I can use it anyone can! By the way, the instructions are well-written & clear. Thanks for the email about the battery replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 69,
      "publication_date": 20170901
    },
    {
      "title": "Recommend!",
      "text": "This pressure gauge was a bit more expensive then what I'd like to pay. However it definitely came in handy at night when I needed to check my tires. The blue light makes the process so much easier to find the stud that sticks out of your tires and check your tire pressure. The device also allows your to switch between pressure units (I just use the psi). So far I've had this product for 6 months and haven't need to change to battery or any problems. I recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 127,
      "publication_date": 20170417
    },
    {
      "title": "Very poor quality.",
      "text": "Digital read out of tire pressure is inaccurate & does not work as described. Sometimes will not measure or read out at all. Very poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 32,
      "publication_date": 20180422
    },
    {
      "title": "One Star",
      "text": "broke after a short time like a month. Tried a new battery no help .Its in the trash now",
      "rating": 1.0,
      "verified": true,
      "author": "D. Simmons",
      "helpful_votes": 35,
      "publication_date": 20171226
    },
    {
      "title": "Battery replacement and cost of batteries",
      "text": "This unit uses one CR2032 battery and three LR44 batteries. These are not batteries the typical homeowner has hanging around. And the cost of replacing these batteries is more than the unit is worth. Plus you have to disassemble the unit, two small phillips screws, to change the batteries. I currently own two digital pressure gauges that use two AAA batteries, with an easy sliding door to remove and change the batteries, no tools required. And in many cases AAA batteries are typical household items and relatively inexpensive. I will be returning this unit and will try to find one that runs on AAA batteries.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim W",
      "helpful_votes": 16,
      "publication_date": 20190505
    },
    {
      "title": "Love it but have to replace 4 batteries",
      "text": "This was a great device until it stopped working. I love the light and screen but I opened up expecting to replace 1 battery, but there's 4 batteries which cost more than the product. This isn't worth it. I'll buy a manual device.",
      "rating": 1.0,
      "verified": true,
      "author": "nnjcustomer",
      "helpful_votes": 16,
      "publication_date": 20191010
    },
    {
      "title": "Worth Every Penny",
      "text": "I now have three pressure gages. On the same tire, they read 32, 36, and 42 psi, respectively. The AstroAI is the one that reads 42 psi. I could take an average of the three, but instead I threw the AstroAI in the trash. Not worth the effort to return.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Brown",
      "helpful_votes": 19,
      "publication_date": 20180820
    },
    {
      "title": "Scam?",
      "text": "I bought this a while ago and I almost thought it was a scam... when I got up and went out to my car to test it to see if it worked everything was fine. Then about two days later I went to check my tires and it was completely dead. When I went to leave a negative Amazon review it said I couldn't because this thing had gotten too many suspicious reviews. Scrolling through the deals of the day I see it pop up again now it's finally allowing reviews again. I think this thing got a lot of fake reviews boosting the rating so high.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 9,
      "publication_date": 20190806
    },
    {
      "title": "Compact pressure gauge",
      "text": "I decided to try this pressure gauge from ASTRO and when it arrived it was defective. It wouldn't turn on at the press of the trigger. I would have to open it up, take out the battery and insert it again for it to power on. I contacted customer service and without any hesitation they sent me another one - no questions asked. When I received the replacement I thought \"now we're talking.\" I love this gauge now and I want to get 2 more and I'll surely be buying from ASTRO again. Makes checking tire pressure so easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 10,
      "publication_date": 20190124
    },
    {
      "title": "Very good pressure gauge.",
      "text": "Nicely made. Easy to switch ranges and read wrong pressure. Reads 2 psig higher than my calibrated gauge. Update: Seller sent me another gauge on his own initiative (no return needed). Reading matches the first one exactly. My conclusion: my \"calibrated\" mechanical gauge, several years old, is probably off by 2 psig. This AstroAI gauge is very nicely made and easy to read. Good lighting. I don't like the on button switching units, but easy to learn to make sure I'm reading in psig.",
      "rating": 3.0,
      "verified": true,
      "author": "doug",
      "helpful_votes": 9,
      "publication_date": 20180603
    },
    {
      "title": "Battery replacement is a little tricky",
      "text": "The device seems to work well, but I am concerned when the batteries fail. To access the batteries, you need a #0 (yes, that's a zero) Phillips head screw driver. The screw heads are small and they are very tightly installed. I'm worried that after a few battery replacements, the screw heads will strip. Not noted in the included documentation is that there are 4 batteries to replace - one CR2032 and three LR44 batteries. As you can see from my picture, the wiring and assembly make battery replacement a little tricky. Note that the power button is not attached to the device body so it is easy to lose when you are changing the batteries.",
      "rating": 3.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 7,
      "publication_date": 20191020
    },
    {
      "title": "Waste of $10",
      "text": "Never got to use it once. It worked when It came out of the package but never turned on after that. Purchased on March 25 today is May 13.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 27,
      "publication_date": 20170513
    },
    {
      "title": "outsranding customer service",
      "text": "The customer service is outstanding. I accidentally stepped on the pressure gauge and it broke into hundreds of pieces, definitely wasnt salvageable. The seller sent me a new one. The gauge is not made very robust, but it works fine and the customer service certainly makes up for it. If you take care of it and don’t leave it sitting out where it could get stepped on, it should last. The customer service couldn’t be better.",
      "rating": 4.0,
      "verified": true,
      "author": "MC320",
      "helpful_votes": 11,
      "publication_date": 20180617
    },
    {
      "title": "Worth getting one of these",
      "text": "I must have a dozen tire gauges, but this one is my new favorite. Backlit and accurate (I tested it with some others), it's easy to use. You get digital output that's easy to read at a glance. Since it requires batteries, this is best for using at home, so you don't forget it in the vehicle, and the batteries leak into the device and ruin it. I purchased a few of these for Christmas stocking stuffers as well....and I doubt they will be rejected.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave A.Top Contributor: Watches",
      "helpful_votes": 26,
      "publication_date": 20181124
    },
    {
      "title": "Cheep",
      "text": "Never worked. Very cheap, would not buy again or recommend",
      "rating": 1.0,
      "verified": true,
      "author": "HBVB",
      "helpful_votes": 8,
      "publication_date": 20181109
    },
    {
      "title": "mostly great tire pressure gauge",
      "text": "The tire gauge has some real good features: - lights up the valve stem area for low light pressure checks - offers 4 different units for expressing air pressure - fast reads - accurate readings - fits well in your hand Could be better: - memory enabling you to save pressure readings - the fit on the valve stem is a little loose and it sometimes takes 3 or 4 pushes to get a good reading All in all, I recommend",
      "rating": 4.0,
      "verified": true,
      "author": "A. Perper",
      "helpful_votes": 3,
      "publication_date": 20181117
    },
    {
      "title": "Great gauge!",
      "text": "Having a reliable tire gauge is a necessity with low profile tires. TPMS only sets off after the pressure has dropped below 25% of the calibrated tire pressure. Trying to avoid cracks in my sidewalls, I wanted to consistently and accurately keep on top of it. As others have said, it is lightweight making it appear cheap. It is far from it. I love the blue LCD illumination and the simplicity to use. Making sure my tires are inflated is no longer a chore.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rice",
      "helpful_votes": 3,
      "publication_date": 20180825
    },
    {
      "title": "Do not waste your money- this gauge is JUNK",
      "text": "This gauge turned out to be HIGHLY inaccurate- it reads almost 44% high- not even close! This gauge read 46 psi on each of my car tires, when the actual pressure of my tires was 32 psi, as set by my car dealership. Do not waste your money- this gauge is JUNK!",
      "rating": 1.0,
      "verified": true,
      "author": "Alex Smith",
      "helpful_votes": 7,
      "publication_date": 20180415
    },
    {
      "title": "from Bicycle tires to  150 psi",
      "text": "super easy to use. I first purchased one of these when my truck tires needed to be inflated to 80psi and my traditional gage wouldn't read that high. Since then I have loved how easy it is to use, and reliable it is. I have owned the first one for 3 years and never replaced the batteries, it still works great, and the display is easy to read. With an Auto Off feature after about 45 seconds, the batteries seem to last good too. This year my daughter is leaving for college and so I purchased this one for her vehicle. Very pleased with the reliability, ease of use, and longevity of this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "More than you need in a tire pressure gauge...",
      "text": "This product appears to be made out of some kind of strange futuristic/alien-constructed material ... is it metal? is it plastic? is it something else? ... who knows, but it is incredibly comfortable to hold ... which is, probably wasted on a tire gauge. ... This gauge is very reasonably priced, and seems to work well... and I would urge you to purchase it if only so you can feel it and wonder what on Earth it is made from and marvel at why they bothered to put so much effort into the finish for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "CHRISTOPHER BENNETT",
      "helpful_votes": 2,
      "publication_date": 20190908
    },
    {
      "title": "Impressed with accuracy",
      "text": "I had become tired of the pop-out gauges that seemed inconsistent and of questionable accuracy, so purchased this AstroAI Digital Tire Pressure Gauge as well as (another brand) digital inflator attachment for my compressor. I took both out to my truck. One read 51.8, the other 51.9. I then tried both on a cart tire that was going flat. Both read 5.1 psi. That is hard to beat! I cannot comment on durability, as this item is new to me. It is mostly plastic. You do have to set it so it reads PSI, but is otherwise simple to use. Very pleased so far.",
      "rating": 5.0,
      "verified": true,
      "author": "KC420",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "good gauge",
      "text": "these digital gauges are better I think to use it on my motorcycle tires to keep the right amount of air I don’t like to have to much or not enough air in tires since there’s only two on ground plus cot helps you get more miles out a tire when you keep right amount of air these will tell you pounds even if got like 32 an half ponds the older type gauges are not that accurate this is my second one the batteries only last about two summers and it’s cheaper to buy another gauge then try to find all the little batteries to put back in it and take it apart",
      "rating": 4.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Bad design",
      "text": "This thing is hard to hold and set correctly on the tire valve stem. I started getting readings of PSI in the 20s, when I knew my tire was just under 35 PSI. I just threw it away....I'll continue to use my traditional tire gauge....it's much more accurate! This was a waste of money. However, the seller was very quick to refund me the purchase price since the unit didn't work for me.....refund was done in a very timely way. I'm satisfied with the seller.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Baxter",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Works ok...a bit tough to get a good seal for a measurement",
      "text": "I got this gauge due to all of the positive ratings. I got this one since I needed something for the tires that I have that require 100 psi air pressure. I thought when I placed the end over the tires air valve it took a fair amount of manipulation and pressure before I got a good seal. Not as easy and straight forward as my analog pressure gauge. It still works, you just have to make sure you get a tight seal for a good reading.",
      "rating": 3.0,
      "verified": true,
      "author": "ZOIKS",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Inaccurate cheap toy.",
      "text": "This is a toy, not a real tool. It's easy to use and easy to read, but it's inaccurate. It feels very cheap and you can't even buy new batteries for it, once when the batteries run out, you gotta buy a new one. My sample was giving me 3 PSI less than my car's gauges and I wasn't sure which one was giving me the wrong readings so I purchased an old fashion mechanical pressure gauge and it measured the same as my car's dashboard gauges. The AstroAI one at least 3 PSI less. There is obviously not quality control here. Don't waste your time, with this.",
      "rating": 1.0,
      "verified": true,
      "author": "Screamer",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Not accurate",
      "text": "I got this for my motorcycle tires. It is at least 5 PSI off, which is a big difference!",
      "rating": 2.0,
      "verified": true,
      "author": "RaVo",
      "helpful_votes": 4,
      "publication_date": 20181130
    },
    {
      "title": "The angle stinks.",
      "text": "I bought this to check the PSI on my OneWheel pint. Because the nozzle is at an angle on the onewheel, this doesn't really hit it at a good angle. I trust the reading it gives off enough, and I'm definitely going to keep this because the price alone is worth it. I can use this fine on my bike and car tires, but unfortunately isn't 100% reliable for my OneWheel. Additional, cons to the packaging. This was either dropped at the warehouse during picking or it was returned. Box it came in also didn't have protective packaging so this just rattled in it. Packaging didn't affect the product, but it was just disappointing to see regardless.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "An outstanding tire pressure digital gauge that anyone can use.",
      "text": "I purchased this after my car tire pressure warning light illuminated and I could not detect which tire was low, or my warning system was the problem. I came within a couple of days, in great condition, with battery installed, and ready to check pressures. It's great for taking tire readings without losing the reading when taken off the tire valve, and the accuracy is excellent (plus or minus 1 PSIG).",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Holland",
      "helpful_votes": 2,
      "publication_date": 20180731
    },
    {
      "title": "Good value",
      "text": "Don't be confused. The build quality of this is remarkably cheap. Does it work? Yes. Is it expensive? No. Is it precise? Yes, but not entirely accurate. Compared to another $30 digital gauge I have, this performed much better. However, I did find this device consistently read 1psi lower than several mechanical gauges I have. For such a low price, just fill your tires up 1psi more. The precision matched well, so the decimal reading is reliable enough. The light is helpful when checking it in the dark...for whatever scenario that is required.",
      "rating": 5.0,
      "verified": true,
      "author": "Sir Arthur",
      "helpful_votes": 2,
      "publication_date": 20181110
    },
    {
      "title": "Great customer service",
      "text": "UPDATE: The company reached out, offered me a full refund and sent me a replacement. I was pleasantly surprised at the great level of customer service. I really appreciate that they wanted to make things right, and I’m giving it a second chance. I purchased this product after one of my tires went flat due to a puncture. It stopped working after only 6 months (I used it twice). My tire pressure warning light started beeping suddenly on my way to work, and when I pulled over to check it out, the gauge’s digital screen kept blinking and wouldn’t give me a read out. Luckily I was able to make it to a gas station. Very disappointing.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Gets a Good Seal and Accurate Reading First Time",
      "text": "Recently bought this tire gauge, and have used it once so an early review. So far, it is excellent. I had a different digital gauge and a metal stick type gauge, and always had a problem getting a good seal around the tire stem and an accurate reading. The first time using this AstroAI digital gauge, it went on the tire stems easily and completely and gave a good reading on the first shot. That the most impressive thing. It is also comfortable, and I like that the screen lights up and holds the pressure reading for a few seconds allowing you to remove it and read it.",
      "rating": 5.0,
      "verified": true,
      "author": "Peka M",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Worked well for a few months then died",
      "text": "Worked great at first, but then after a few months I couldn't get it to turn on. I wanted to check to see if just replacing the battery would get it back to normal. But I realized there's no battery cover and no easy way to replace the battery. It is as if you're not supposed to replace the battery on your own because you have to take it completely apart which made it more cumbersome to put it back together so I threw the whole thing away. Very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Are you under pressure or over pressure",
      "text": "You really need to know what your tire pressure is and those old mechanical styles they’re just a pain - are they accurate or not but this one I know is that accurate I’ve tested it against three others and it is dead on now I’m confident about my trailer tires at any time. run your tires at the recommended pressure know how to do it ? use this product and find out what your pressure is",
      "rating": 5.0,
      "verified": true,
      "author": "Seh Welch",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Exceedingly cheap and poorly made",
      "text": "This worked all of one time and then failed. Poorly constructed. PS. the company contacted me about the product and shipped me a new one, which I appreciated. (Still pretty cheap product but at least this one worked more than once.)",
      "rating": 3.0,
      "verified": true,
      "author": "dgreco",
      "helpful_votes": 3,
      "publication_date": 20180904
    },
    {
      "title": "Turns off just as you get to the next tire.",
      "text": "This is a nice air pressure gauge, with one major annoyance. When checking my tires, it seems to turn off just as I get to the next tire. If I push the button too soon, it changes from PSI to one of the other measurement systems. Then, I have to press it again until it returns to PSI. If I wait, it turns off, then I have to push the button to turn it back on. It may not seem like much of a problem but the 10th or 15th time it happens, it get annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Henry",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "The instruction sheet is lame. It refers to a non-existent Diagram",
      "text": "I just received this and have not yet tested it. The instruction sheet is lame. It refers to a non-existent Diagram. I also had to open the device to find the battery type (CR2032) which in the instruction sheet is only described as a \"3V Lithium coin cell\". (Oddly, there are also 3 small button batteries soldered inside the device.) I'll try to update this review after using the device.",
      "rating": 3.0,
      "verified": true,
      "author": "R.H.",
      "helpful_votes": 2,
      "publication_date": 20180507
    },
    {
      "title": "You Need One in Your Glove Box",
      "text": "Excellent product and perfect for keeping handy in the glove box. Be sure to read the instructions first just to understand how it works. USA pressures show up second on my unit - so was a bit confusing at first. I will probably gift some of these to friends and family. Good thing to have when you are out on the road and your air pressure warning light goes on. Keep the instructions in your glove box as the first few times you use them you may be a bit confused by the readouts. For less than $10 US this is a safety product everyone should have in their car.",
      "rating": 5.0,
      "verified": true,
      "author": "John H.",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Nice, but takes lots of batteries.",
      "text": "I like the light up screen and that it also lights up the valve stem. Seem as accurate as other gauges I have. The downside is that when it's time to replace the batteries, there are 3 button cells and one flatter watch-type battery. Given that it seems like half the time when something like this dies, you replace the batteries only to find out it's the device and not the batteries, I'll probably just chuck it once it stops working. Next time I'll find out how many and what type of batteries the gauge requires before ordering.",
      "rating": 3.0,
      "verified": true,
      "author": "G Hammer",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Almost Perfect!",
      "text": "Almost perfect. The only reason I am not giving this gauge all 5 stars is that (for me) it turns off a few seconds to soon. I have a hard time taking readings from one tire to next without it shutting off. I'm 60 yrs old, almost 300 lbs., and move slower than most, so it shuts down as I am moving from one tire to the next. I then have to restart the gauge, wait for it to initialize, confirm it's on \"PSI\" setting, then take my reading. Another 10 seconds before auto-shutdown and it would be 5 stars across the board.",
      "rating": 4.0,
      "verified": true,
      "author": "DrewLuvsKarin49",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Everyman's tire gauge",
      "text": "SUV, Segway's, ball and bikes are all on my list of stuff that needs a regular check and generally a few pounds of H2O. This Astro Gauge replaced another brand I owned that was more compact but the stems face the inside of the wheels of our Segway MiniPro's and I find this much easier to manipulate. It feels like a quality instrument and the pressure readings jive with what the car is displaying. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "TheDogMonster",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Be Warned: It's Very Flimsy",
      "text": "I ordered this pressure gauge to keep in my glove-box for a roadtrip I had planned. When I checked the tires the following morning I was shocked at how loose/flimsy the gauge was. It reminded me of the poorly assembled Dollar Store toys I bought as a kid... On top of it the LCD screen is difficult to see during the day even when it illuminates.",
      "rating": 1.0,
      "verified": true,
      "author": "Alecsander Morrison",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Sexy Air Gauge",
      "text": "I've used this quite a lot since I got it and am overall very satisfied with it. I like the red because it matches my car, so I try to keep things color coordinated like that. It's kinda pointless, but to be honest, this is the sexiest looking air gauge I've ever seen. And I'd be happy to buy it in multiple colors, for each person I gave one to for the color of their vehicle. All in all great simple product, no complaints. When the power went out at my home it doubled for a makeshift flashlight.",
      "rating": 5.0,
      "verified": true,
      "author": "Remrie Arrie",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "This is the best gauge I ever had and I Am old.",
      "text": "The batteries went dead in my old one and rather than taking it apart and replacing the batteries, I purchased a new one just like the one I had because it was so cheap. I have been using the original for some time now and it is very accurate unlike those stick ones. I highly recommend this gauge. When I get around to it, I will replace the batteries in the old one and have a spare.",
      "rating": 5.0,
      "verified": true,
      "author": "Jhon",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Does the job. Light very helpful. Clumsy readout. See below.",
      "text": "With successive trigger clicks it reads out in 5 different pressure units. Unfortunately “psi” is the only one 330,000,000 U.S. citizens care about and ought to be the default if you are gonna sell it in America— but it is the LAST one. So you have to click the trigger thru all the Pascals, Bars, etc every time you take a pressure reading (in the wind,rain, etc) while staring at the tiny text— to make sure you don’t click past”psi”. Annoying and clumsy. Even Tom Brady couldn’t take a reading fast enough get away with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Frederic Hering",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "ACCURATE & EASY TO USE TIRE PRESSURE GAUGE WITH LIGHTED DISPLAY",
      "text": "This is an accurate, easy to use tire pressure gauge. I like that it has a working light to see (at night) the valve stem and read the display. It was a bit expensive since it was an exact match to a ~10 year old \"Goodyear\" tire pressure gauge which was $5.00 at AutoZone. Although the Goodyear brand still works for air pressure, the light does not work making it difficult to read the display. I hope to get twice the longevity from this tire pressure gauge.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard L.",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Broke within the first 3 mos.",
      "text": "I bought this for my husband's car based on my positive experience with a similar device I purchased a few years ago for my car. This one is a complete clunker. It worked the first couple of times I tested it, but a few mos. later when my husband actually NEEDED it, it did not work at all, despite turning it on and off several times. Don't waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Working Woman",
      "helpful_votes": 2,
      "publication_date": 20180707
    },
    {
      "title": "Easy to use but remember to space subsequent readings by few seconds",
      "text": "It does look cheap but does work well for what it's worth. I use it to measure tire pressure for both my cars. Very handy an is easy to use. B only catch... If you want accurate reading, ensure you space your measurements atleast 20 or 30 seconds apart. Measuring too fast can yield incorrect readings. Maybe I am not 100pc right but that's what worked for me.",
      "rating": 4.0,
      "verified": true,
      "author": "SoCalUser",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "great solution",
      "text": "I received a non-working unit when I first ordered this item. Upon hearing that I was returning the item, the seller reached out to me and sent me a replacement, which was actually an upgraded model. The new one uses two AAA batteries instead of the button batteries that I assume you can't replace. The new unit works really well, and I'm very happy. I would recommend either one, but since the price is not much more, I would suggest the one with replaceable batteries. Both are made from durable plastic, and small enough to fit in your hand. If you're looking for a heavy, metal style this is not it. But for regular use, this one works great!",
      "rating": 4.0,
      "verified": true,
      "author": "jfejapan",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great when it wants to come on",
      "text": "This little thing is great when it works. Unfortunately, my experience has been that it sometimes doesn’t come on at all. I’ve only had it a few months so I’m doubtful that the battery is dead already. And after it doesn’t come on when I want to use it, it does work again the next time I try. So I find it to be inconsistently working at best. Good thing I didn’t toss my manual gauge as I still need it to back this one up.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Hope it lasts at least one season",
      "text": "The blue light is a very nice feature. Seems cheaply made and in order to get a reading I have to attempt to place it several times on the tire valve to get a reading “lock” thereby losing some air each time it mis-connects. Also, seems to auto-shut-off quickly at times, just as I’m ready to place on my valve for a reading. I’m not sure if this is “accurate” since I don’t have a calibrated device to compare it to so I just gave it 5 stars for accuracy. I liked my old one better.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Excellent product",
      "text": "I love this product this product. It came quickly and is very convenient. Its just the perfect size, and is very accurate. I was recently riding with a couple friends and one of them had a tire that was very low and needed to be checked he took out his rather big gauge and I took out my perfectly sized gauge and he said \"That little toy isn't gonna work.\" His gauge wouldn't stay on so I let him use mine and then he said \" Well I guess yours does work.\" Now he wants one. Would recommend and buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170817
    },
    {
      "title": "Will fail in about a year",
      "text": "I ordered several. The batteries die within a year. There are several kinds of batteries needed, 4 in total. Very clumsy replacement and then they did not work after replacement. Used a multimeter to check voltages before/after. I'm experienced in electronics assembly, these have poor build quality once you will have to inevitably open them to replace the batteries. You'll need a multimeter/voltmeter to be able to replace only the batteries that are low. Good luck! Won't buy again...",
      "rating": 1.0,
      "verified": true,
      "author": "Clarm Glamarge",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Saved my butt a couple times",
      "text": "Being completely clueless with cars, I needed something that could be more user-friendly to make sure I don't end up on the side of the road. This thing has saved me on more than one occasion. It's quick and simple and makes putting air in your tires hassle-free. I've had punctured tires that I only knew because the PSI ratings were incredibly low. Keeping up with tire pressure numbers and displaying them clearly is amazing for someone like me. I definitely recommend if you want to keep up with your tires consistently without too much work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Cool gadget",
      "text": "I've always hated using the manual tire gauges - especially in poor light. This device is so cool, quick and easy to use. The pressure is super easy to read and seems to be accurate...haven't done any testing. It reads to 1/10's of a pound so you can do your own rounding up or down. This does make it tempting at first to try and get each tire to the same reading, but that didn't last long. Best tire gauge I've owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Convenient and Accurate!",
      "text": "This works great! I had a suspicion that one of my tires was a little low on a new vehicle I purchased so I ordered this to replace an older analog one that broke. This takes all the effort of reading the gauge out of the process and makes it just a little quicker and easier to get it done.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Digital tire pressure gauge",
      "text": "I can't rate accuracy, as I have no way to test for this. However, my car repair mechanic swears by his, so it must be an improvement on the older mechanical devices. So at least the reading from one tire to the next is consistent, and the battery is holding charge for a long time. The ease of use makes this an easier effort to check tire pressure, and the first time I used it at home, one tire was wa=a=a=a=y too low. I recommend using rechargeable batteries for longest term usage.",
      "rating": 5.0,
      "verified": true,
      "author": "Blader",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Do not leave in the car",
      "text": "First off. Getting to battery was not very clear in the instructions. Setting it up was ok. I tested the pressures and it was off. Not much but it was off. Then I put it in the glovebox. And a month later to test my tires again. The LED was messed up and pulling the trigger shut it off and I wind up throwing it out. Not worth it. Also worth noting. If you have steel wheels and those plastic hubcaps, this item is very hard to put on for any reading. I had to take the plastic hubcaps off and then use it.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank Nawrocki",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "I needed a 3rd opinion on my tire pressure in Tesla Model 3",
      "text": "My TPMS was saying I was overinflated. I went to a Wawa and it said I was underinflated. I inflated my tires to 42 PSI. My TPMS then said I was at 55 PSI. Not good. I purchased this to get a 3rd opinion. Turns out the Wawa on route 18 in East Brunswick is very much incorrect. Be careful if you get air at this location. This device also allowed me to let out the air by angling it slightly.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "A very handy, accurate tire pressure gauge!",
      "text": "I drive quite a bit at night and the built-in light and lit read-out really makes it easy to check pressures in the dark. While it's larger than the old-school mechanical pressure gauges, it doesn't take up too much space in either my console or glove box. I've checked its accuracy against the tire shop after getting new tires and it's spot on. Overall, I'm very happy with it and recommend it to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom H Texas",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Easy to use product.",
      "text": "Easy to check the pressure. Small enough to keep in the glove compartment. Product is well made and easy to grip handle. Just like any other LCD display it is somewhat difficult to read under direct sunlight from an angle. I only had it for a week and so far so good. No idea how long the battery will last. With a small lit area and the automatic power off I hope it will last well over a year. Overall it is a good product,",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Florida",
      "helpful_votes": 3,
      "publication_date": 20180121
    },
    {
      "title": "Excellent Product",
      "text": "Gave 4 of these for Christmas presents. The recipients seemed to like them. The first one to report in after using it said he had serious low air pressure in his tires, so it was a timely gift for him. I think it works as well as any and easier to read. Offers results in many measurement units, be sure to use PSI ... or you will be confused with the readings",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey D Boozer",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "Beyond my expectations.",
      "text": "I purchased 4 of these, one for each of my kids, one for my wife, and one for myself. They measure in .1 increments which can give you a very accurate reading, and the ability to get consistent tire pressure from tire to tire. All of them worked upon arrival.",
      "rating": 5.0,
      "verified": true,
      "author": "Okfoz",
      "helpful_votes": 4,
      "publication_date": 20170421
    },
    {
      "title": "Nice little gauge",
      "text": "Checked this right after it came against my two other digital gauges and it produced the same readings when tested on four tires on my wife's Altima. So far so good. It is easy to use, easy to read and accurate. I think it will be just fine for a long time. I will use it on the Altima, the Frontier and the John Deere at least once or twice a month for all three vehicles. I think I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Nashoba Losa",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "This Thing is Wonderful",
      "text": "This digital tire pressure gauge is great. It's so much easier and quicker to use than a manual. It gives a quick reading and as far as I can tell is accurate. The light feature is a nice touch. It reads the pressure immediately and shuts off automatically. Nice size for the glove compartment. My car has an indicator that alerts you to low tire pressure but doesn't tell you which one is low. This gauge has taken the frustration out of finding the tire in need. Great for a woman who maintains her own vehicle. Very inexpensive tool and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "ladym",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Seems to work during normal temperatures, but will not function when it is cold outside",
      "text": "I kept the gauge in the glove box after I got it. Worked fine, but when I went to go check the pressure on a colder day. (I live in NC, so this is not very cold) and the gauge would only show some of the numbers. I was going to return it, but when I took it inside, after it warmed up, the gauge appeared normal. So I have to store the gauge inside the house before use.",
      "rating": 2.0,
      "verified": true,
      "author": "Junkmail",
      "helpful_votes": 2,
      "publication_date": 20190731
    },
    {
      "title": "Good digital tire pressure gauge indicator.",
      "text": "Generally works well. A bit annoying to use due to the screen having briefly displayed the result quickly gone bland or go off completely (I guess to save battery) . Also, to get accurate reading, one has to carefully mount it snugly onto the tire pressure valve to create a tight seal.",
      "rating": 4.0,
      "verified": true,
      "author": "Hugh",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Poor construction",
      "text": "This tire pressure gauge is of very poor construction. The fitting that attacked to the valve is made of a flimsy plastic and when I used it to measure pressure for my car tire the fitting collapsed and I needed a pen knife to try to wedge it out to be used.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Goldstein",
      "helpful_votes": 2,
      "publication_date": 20190729
    },
    {
      "title": "Not hard to use, but could be more intuitive.  Can't complain for the price though",
      "text": "Super accurate, way better than the analog gauge I was using before. Easy to use. Only complain is that it's slightly counterintuitive in that you need to press the trigger button before you test the pressure. several times I press the trigger as I was testing the pressure, and got no reading. You have to press the trigger button to turn the gauge on, and then test the tire within a number of seconds. Super easy to read, especially with the back light",
      "rating": 4.0,
      "verified": true,
      "author": "Philip Relic",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Not sure",
      "text": "I put this item in my car after testing to confirm it worked. When I needed it less than three months later, it wouldn't work. Very disappointed it didn't last me through until even the first time I needed to use it. I guess I'll be returning to a non-electronic reader. EDIT: customer service contacted me after this review and sent me a new one free of charge. I bumped my two stars to four - because I still am slightly concerned that it might not work due to the cold if I leave it in my glove box.",
      "rating": 4.0,
      "verified": true,
      "author": "dmelichar",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "accurate tire gauge with light",
      "text": "Hi. This gauge works SUPER! That is super after I learned to read the PSI rather than the other 3 choices 😋 I compared the reading to my rather new standard upgraded air gauge which fortunately showed double readings enabling me to notice A. accuracy is SUPER, B. I can easily adjust to PSI readings 😀. THANKS! Very satisfied. The light is a big help because not all tire checks are done in bright sun! Also holds the readings long enough to read them!",
      "rating": 5.0,
      "verified": true,
      "author": "David F. Daniels",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "4.75 stars Accurate and Easy to Read, just lightweight plastic",
      "text": "Although it is very light plastic, it seems to work quite well. 3 different pressure readings depending on your use and/or location show up bright and easily read. Instant read, didn't even sound like I lost air when I used it. The readout matched to the tenth of each of my tires and the reading from the instrument panel. For the money it is worth it. A little more weight or metal case would get the remaining .25 star",
      "rating": 4.0,
      "verified": true,
      "author": "Shae",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Not sure about this.",
      "text": "Nice little unit but I am unclear on how it registers the weight in my tires. I went to PSI and I get 4 or 8 when there should be 35 pounds per tire. SO, I am unclear!",
      "rating": 3.0,
      "verified": true,
      "author": "TNB",
      "helpful_votes": 3,
      "publication_date": 20181014
    },
    {
      "title": "It's accurate so far",
      "text": "I distrust digital gauges made in china, but for some reason, I guess curiosity, I bought it anyway. It's very accurate compared to my other gauges, which all read <1/2psi of each other. If/when it fails, or if it survives, I'll try to report on it after a year or so. If your valve is in a tight spot you may want to rethink. It barely fits mine car due to space, so I suppose maybe the business end should be thinner and have a little more reach?",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "love the light on it so it's easy to see what you're doing after dark",
      "text": "Shipping was fast. My Honda has a Tire Pressure Monitoring System and it seems to be pretty sensitive about the air pressure in the tires. I have had to take it to the shop several times to have the tire pressure checked because the light was on. With this digital system I will be able to get an accurate measurement that is easy to read day or night.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Very nice, very handy!",
      "text": "Very nice. PROS: Gives a variety of different readings. Has a loop for your attachments. Has a very handy light at the tip. Days of needing a flashlight are over. The screen is brightly backlit, you definitely won't miss the reading. CONS: Constantly shuts itself off -- requiring you to hold the button to power back up every time. Plastic feels cheap. Button needs a rubberized trim added. Very cheap brittle plastic button.",
      "rating": 4.0,
      "verified": true,
      "author": "Trevor Webster",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Factoring in battery replacement = Bad buy",
      "text": "Bad deal when it ships with dead batteries. 3V 2032 had 80% - LR44 (3ea) had 10% charge. And this is new out of box.",
      "rating": 2.0,
      "verified": true,
      "author": "wbent44",
      "helpful_votes": 4,
      "publication_date": 20171212
    },
    {
      "title": "Its a great product",
      "text": "Easy to use, and very versatile for many items. Fits great in my hand, not big and awkward. UPDATE: I use this one for my bike, and I bought a second one (the blue) for my car. Love that it has a light on the end!!",
      "rating": 4.0,
      "verified": true,
      "author": "cwakelam",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Accurate, Easy-To-Read, Lighted Dial.",
      "text": "Low cost, accurate, and lighted dial makes it easy to read at night. Pencil-type tire gauges are notoriously in accurate, and are difficult to read. Today's AWD and 4WD vehicles require ACCURATE tire pressures, because ALL FOUR TIRES must be the SAME pressure to prevent severe damage to the driveline.",
      "rating": 5.0,
      "verified": true,
      "author": "Rust Never Sleeps",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great for lawn tractor tires",
      "text": "I bought one of these a couple of years ago and it worked great until left out during the winter by mistake. Got another one. I use it for my cars ,but it is nice for those small tires and pressures like 12.5 lbs. Mine have been pretty accurate and easy to use. The trigger changes the reading in the LCD display, but isn't needed for taking the measurement. It holds it for long enough to get to the next tire ( about 20 sec.) and resets to 0 for another 20 seconds or turns off if not used.",
      "rating": 5.0,
      "verified": true,
      "author": "PC Head",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "I found this devise inconsistent with its pressure readings.",
      "text": "I tested all four tires on my car with this devise and then I tested the tires with an analog devise. None of the tires matched this devise's pressure readings vs. the analog's pressures. I tested one tire again and got a different reading than the original one. I tested the same tire two minutes later and the reading was 4 lbs. lower than the previous reading. I found this devise's readings to be erratic and not to be relied upon.",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin Shm",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Takes 4 batteries that don't last a year.",
      "text": "I liked this for the 9 months I've owned it. Probably used it no more than a dozen times and the batteries are now dead. These 4 specialty type batteries, of two types, will cost more to replace than I paid for the whole thing so I guess its now a throw away. I'd give it 5 starts if the batteries lasted a few years. 7/24/19 update. The seller did provide a replacement at no cost.",
      "rating": 3.0,
      "verified": true,
      "author": "GaryGTX",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Works great, love the light!",
      "text": "Not usually much to say on a tire pressure gauge... they're not typically all that exciting. But the nice little tough of having the light is really appreciated. I use this on my Onewheel and it is super nice to have the light help show me where to connect due to the angle. I also really like the grip for this gauge. Nice gauge, great build quality, super easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Harper",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Returned",
      "text": "It did not work and I returned it. Maybe it was just a defective one, but I didn't reorder it.",
      "rating": 1.0,
      "verified": true,
      "author": "DomC",
      "helpful_votes": 3,
      "publication_date": 20181113
    },
    {
      "title": "Worked once then died",
      "text": "This thing is garbage. Worked once. The second time I went to use it it just started flashing and hasn’t stopped since. Can’t read pressure, can’t turn off.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim M",
      "helpful_votes": 2,
      "publication_date": 20191202
    },
    {
      "title": "Provides quick measurements in frigid weather with cold hands",
      "text": "This is my second device since the last one died and was impossible to disassemble to change the battery - my only complaint is that replacing the whole device is annoying and adds more plastic waste to the landfill. Other than that, gauge reads quickly and efficiently, I do find I have to get the best of 2 or 3 10 second measurements in cold weather when it's hard to hold it against the nozzle completely flush.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn FTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Works great",
      "text": "Handy little sucker to keep in the car. Had a cheap mechanical one that I used for years but recently lost it so decided to try out a digital one. Been using it regularly for the last couple of months and haven't had any issues. Can never trust those gas station gauges!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 2,
      "publication_date": 20181206
    },
    {
      "title": "Very nice, but shuts off rather quick.",
      "text": "So far this is really what I wanted. It matches my Blue Tundra which is cool. It seems to be accurate compared to two other traditional pressure gauges. The only problem, which is minor, is that it turns off quickly. If i put the cap back on the stem b4 moving to the next tire it will shut off. It's easy to turn on so no sweat. Now I just take all the caps off at once and then go tire to tire.",
      "rating": 5.0,
      "verified": true,
      "author": "PinkMoonCow",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "I'm impressed.",
      "text": "I actually bought this as a gift. I did play with it for a while. It's comfortable to use, appears to be accurate. It even has a flashlight of sorts. Might just get one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Short",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Does exactly what it is designed to do",
      "text": "I can't say this is the most accurate tire gauge out there, but for someone who just needs an easy to use, easy to read tire gauge to make sure the cars have sufficient air in them this will work. It's really easy to read, has 4 different options and the illumination on the display helps if you are having to check it in a low-light area.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Stevens",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Nice !",
      "text": "Neat little gadget, my first digital style checker. Matched the pressure on my mechanical gauge so it’s pretty accurate and I’ll use this to fine tune my tire pressure. I’d like to order a few more for family members but will wait until delivery times get back to normal. I’d definitely recommend and I’m going to purchase a few more.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "I may have to buy a new screw driver if i want to replace batteries!!!",
      "text": "I don't know who came up with this idea to use such tiny screws on this device. It's not like this device is so small that it needs such tiny screws. The screws are so small that I can't find any existing screwdriver in my home to work with it. It's ok for now but when I need to replace the batteries, i need to buy a new screwdriver for it. What's up with that?",
      "rating": 3.0,
      "verified": true,
      "author": "-J.",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Appears cheap, but you will be impressed",
      "text": "Thought I would be underwhelmed with a cheap piece of plastic and fully expected it to work just for a little bit. Nope. Consistent measurements, always accurate, and because it’s so compact, is super easy to bring. I put it in my pocket on my way to the nearest pump! So handy to have, and the tape measure is a great add-on Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Does what it needs + nice functionality. Thin plastic, cheap feel, and loose button, though.",
      "text": "Nice pressure reader for the price. Good display, brightness, and functionality. The only issue I have is that it's very cheap feeling versus a Husky (cheaper price - I just live far away from a retailer) and the button to use it is very loose. I feel like it may fall out soon, lol. Very lightweight, however. Good for pocket carrying.",
      "rating": 4.0,
      "verified": true,
      "author": "Grey S",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Not always accurate",
      "text": "This is very convenient to have in the car and with the back light display it is easy to read at night. Some times it will be really off, even when I have a good seal, and I will have to revert to the old school gauge. Also, it take several small watch batteries, so if it dies, you may as well buy a new one as it will cost as much for batteries.",
      "rating": 3.0,
      "verified": true,
      "author": "Wendy S.",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Doesn't work...",
      "text": "I ordered this on December 17, 2018 and have used it once. I went to use it again this morning (for only the 2nd time) and it will now not turn on. It's too late to return this through Amazon. I emailed support@astroal.com (provided in the box with the gauge) and my email got returned as undeliverable. If someone who works for AstroAl could contact me to make this right I'd be happy to change my rating! Otherwise pretty disappointed - I guess you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela D. ",
      "helpful_votes": 0,
      "publication_date": 20190307
    }
  ],
  "product_meta": {
    "title": "AstroAI Digital Tire Pressure Gauge 150 PSI 4 Settings for Car Truck Bicycle with Backlit LCD and Non-Slip Grip, Silver (1 Pack)",
    "description": "Color:SilverThe AstroAI Digital Tire Pressure Gauge helps you maintain correct tire pressure, reduce tire wear and extend tire life. The Backlit LCD display and Lighted nozzle are for visibility in dimly light areas and the accurate and easy-to-read digits help you easily measure your vehicle's tire pressure. \n\nThe tool provides 4 settings with range: 4-150PSI / 0-10Bar / 0-10Kgf/cm² or 0-1000KPA and the ergonomic design and non-slip texture are both suitable for men and women's hands. Versatile use for cars, trucks, motocycles, bicycles etc.\n\nSpecifications\nMeasurement Ranges: PSI: 4-150, Bar: 0-10, KPA: 0-1000, Kg/cm: 0-10\nMinimum Increment: 0.1 PSI\nPower: 3xAG13 batteries; 1xCR2032 lithium coin cell, Battery Included\nDisplay: 8.3 x 4 inches LCD display\nOperating temperature: 23-122 ℉\n\nUseful note: \nIn order to get a good seal, please put the tire's air nozzle up or off to the side. It's the best when the nozzle is around 6 or 7 o'clock position so that you can firmly press the guage straight down which means you have to crane your head a little bit for reading. Always remember the most important thing for you is to be able to press down straight & hard onto the tire's nozzle.\n\nPackage Included\n1 x AstroAI Tire Gauge",
    "rating": 4.5,
    "feature_bullets": [
      "▲Check out our VIDEO on the left side and take a quick tour of AstroAI tire gauge! Backlit LCD display and Lighted nozzle for visibility in dimly light areas, best gift for men and women",
      "Designed to maintain correct tire pressure, reduce tire wear and extend tire life; Digital display reading instantly and clearly being shown, no longer do the guesswork of analog gauges",
      "Nozzle easily forms a seal with the valve stem on schrader valves, giving quick and accurate readings in 0.1 increments; 4 settings with range: 4-150PSI / 0-10Bar / 0-10Kgf/cm² or 0-1000KPA",
      "Simply press \"ON/UNIT/OFF\" button to turn on the tool, select the range, and automatically shut off in 30-40 seconds to save the power; Non-slip texture makes it easy to hold onto and the ergonomic design is both suitable for men and women's hands.Gauge automatically resets when taking pressure, no need to calibrate or reset the device",
      "1 Year Warranty and battery included; Perfect car accessories gifts for men; Versatile use for cars, trucks, motocycles, bicycles etc but not compatible with presta stems"
    ],
    "specifications": {
      "Manufacturer": "AstroAI",
      "Brand": "AstroAI",
      "Model": "Digital Tire Pressure Gauge",
      "Item Weight": "0.634 ounces",
      "Product Dimensions": "7.9 x 1.2 x 4.3 inches",
      "Item model number": "GL-0801A",
      "Batteries": "4 Lithium Metal batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "GL-0801A",
      "Folding": "No",
      "Cover Included": "AstroAI Digital Tire Pressure Gauge 150 PSI",
      "Special Features": "The AstroAI Digital Tire Pressure Gauge helps you maintain correct tire pressure, reduce tire wear and extend tire life, The Backlit LCD display and Lighted nozzle are for visibility in dimly light areas and the accurate and easy-to-read digits help you easily measure your vehicle's tire pressure",
      "Vehicle Service Type": "All of the above",
      "ASIN": "B01J8DLGU2",
      "Customer Reviews": "4.5 out of 5 stars14,550 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#39 in Automotive",
      "Date First Available": "August 3, 2016"
    },
    "categories": [
      "Tire Gauges",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Tire & Wheel Tools",
      "Automotive"
    ],
    "price": 9.98
  }
}