{
  "website_summaries": [
    {
      "verdict": "A great choice for beginners, this starter pack comes with nearly everything you need to get playing. Just add the amp of your choice.",
      "pros": [
        "This bass guitar features a solid wood body, rosewood fretboard, and polished blue and white finish",
        "As a kit, it includes the bass and a strap, pick, soft gig bag, and amp cord",
        "You’ll be ready to plug in and play out of the box"
      ],
      "cons": [
        "The pickups in this bass are relatively basic, so you may want to upgrade as you progress as a player"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great first bass",
      "text": "For what I paid for this bass I think it's awesome! This is my first bass and first string instrument. I only found out after gaining more info on basses that this is a replica of a fender precision bass. The pickups are ok The guitar strap broke within a couple minutes of use so definitely get a better strap The strings are ok. I replaced the pickups with better ones and will eventually replace the strings with better ones. Once that's done I'll have a pretty nice bass setup. I think this is a perfect first bass. Once you get an appetite for the bass you can always get something better.",
      "rating": 5.0,
      "verified": true,
      "author": "Slammin",
      "helpful_votes": 34,
      "publication_date": 20180919
    },
    {
      "title": "great product",
      "text": "I purchased this as a gift for my husband because he wants to learn to play bass. Overall a good bass, just requires a proper setup. Truss bar needed to be adjusted, saddles needed adjusting, strings are good quality (though he did snap one while tuning it LOL). He took it to a local guitar store and they adjusted everything for him, and it plays nicely with no more buzzing. I expected a lesser quality for the price, but didn't want to purchase a more expensive one for him to learn on. The product greatly exceeds our expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina St Pierre",
      "helpful_votes": 64,
      "publication_date": 20161225
    },
    {
      "title": "Great deal!",
      "text": "My son is a beginner and this bass guitar is perfect for that. I figure if he wants to continue, he can always upgrade, but this is a great starter guitar and my husband said that the quality seems as good if not better than higher priced bass guitars. There is just no brand name logo anywhere on it, which is unique. My son is 11 and he plays it daily. It appears to be easy to play. It was a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "ftmom39",
      "helpful_votes": 32,
      "publication_date": 20171105
    },
    {
      "title": "A solid bass guitar.",
      "text": "I was worried buying this bass because of the price. I was thinking it would be a real piece of cardboard. But it's solid. For the price, it's a great bass. As other have mentioned there was bad fret buzz but an adjustment of the truss rod cleared that up no problem. The wrench to make the adjustment is even included. Rocksmith picks it up just fine. No issues there. The only complaint I'd have is the pickups are held in by screws which gets in the way of where I like to rest my thumb while playing. But for the price, you can't go wrong with this bass.",
      "rating": 5.0,
      "verified": true,
      "author": "adam",
      "helpful_votes": 32,
      "publication_date": 20170824
    },
    {
      "title": "Amazing buy!!",
      "text": "This is my first base guitar so I don't really have anything to compare it to, but I do play guitar and ukulele so I do have knowledge of stringed instruments. The base sounds good when it is plugged up to my amp. There is no static. Is also feels like a solid instrument. It does not feel cheaply made by any means. The strings stay in tune. All screws are tight and nothing is loose. I am a smaller person and I find that my hands reach to all of the frets. All and all I think this is a very good instrument. Especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Dixon",
      "helpful_votes": 32,
      "publication_date": 20170718
    },
    {
      "title": "High Quality Bass",
      "text": "I recently formed a band, The Moskeetos, and was looking to learn the bass guitar, since I was lead singer. I was looking for an affordable bass that was of good quality. I found this one and took a risk, because most of the reviews proved that the bass was worthy of my time and money. This bass has proved to be extremely worth $70. It sounds better than many high end basses I've recently played. Other than the minimal packaging, and the useless/nonfunctional strap they provide you, this bass is well worth $70. With a little bit of tuning, this bass is extraordinary. I would recommend this bass to anyone who is on a budget and ready to jam.",
      "rating": 5.0,
      "verified": true,
      "author": "The Crop",
      "helpful_votes": 32,
      "publication_date": 20170619
    },
    {
      "title": "This is a great beginner guitar",
      "text": "This is a great beginner guitar, It has a solid quality build with a great tone and ease of play. This being said there was one issue with the guitar when it arrived, the neck was bent slightly to the rear. I was able to have it adjusted because my teacher is also a great luthier. After the adjustment (which was quite simple) the guitar is the best beginner guitar you can buy.",
      "rating": 5.0,
      "verified": true,
      "author": "zeus64068",
      "helpful_votes": 33,
      "publication_date": 20170402
    },
    {
      "title": "its ok",
      "text": "the body is a bit light causing the neck to fall.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra Rambler",
      "helpful_votes": 33,
      "publication_date": 20170825
    },
    {
      "title": "Many Missing Parts | Didn't Match Image",
      "text": "The Bass Guitar arrived a few months ago but I was hesitant to right a review until I gave it a couple months of practice. Compared to other Bass's I've played, even cheaper pawn shop basses sounded better. The bass was already pretty garbage to start with but then it didn't even come with a amp strap or chord to plug it in. Luckily I bought a electric guitar recently that came with a extra strap, a amp, and a chord. Very disappointed in the order and can not recommend to anyone, try your local pawn shops and see if there is one in there because most likely it's better.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Palmer",
      "helpful_votes": 2,
      "publication_date": 20181204
    },
    {
      "title": "It’s made cheap",
      "text": "We bought this in June 2019 and it’s now October 2019. It doesn’t work. It has loose parts and won’t play to an amp at all. A huge disappointment to my son who used his birthday money to buy this so he could start lessons. It’s obviously past the return date so we are stuck with it. I don’t recommend you buy this at all. Splurge on a Fender Precision Beginner Bass. It’s an extra $75, but will give you the quality you need for long time.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Lutz",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Shipped without checking the instrument",
      "text": "I received the bass today with the pickups loose inside the guitar bass. The back of the guitar bass has 2 dents. The box didn't have any damage or the bubble wrap paper. They probably just shipped a return guitar bass without caring about the customer. Update: I taped the pickups so they don't sink in. It seems that they were glued but it didn't do the job. I bought it to learn to play along with Rocksmith, the first time tuning the bass, 1 of the top and lower tuning keys's wheal teeth broke. They look like metal, but they aren't. Without these problems, I think it would be a good guitar bass to start learning.",
      "rating": 1.0,
      "verified": true,
      "author": "Colbushi",
      "helpful_votes": 3,
      "publication_date": 20190509
    },
    {
      "title": "Fantastic beginner bass",
      "text": "I bought this as a Christmas present for my teenage son who wants to learn to play the bass guitar. He is a total beginner and has never owned a bass guitar. It arrived in excellent condition. It appears to me to be a very nice beginner guitar, and he absolutely loves it. My son and my brother spent a lot of time on Christmas playing this guitar, and it sounded great! I am very happy with this purchase and would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan T.",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "YES",
      "text": "lot of ping. but still good sound. VERY cheap. Actual wood. I highly recommend for someone who wants a very cheap bass. much better than i expceted for the price, and much better than used to be availble for something your kid might not pick up. I have a blast with it, and have no problem letting my friends play around, while my $1000 buddy sits down stairs unmolested.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Morrison",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Good beginner guitar",
      "text": "Beautiful instrument, nicely priced. Not too happy with the pickups, but otherwise good guitar for beginners... especially ones that may not follow thru with actually learning to play... like my BF. Bought him this guitar (that he pretty much begged for) as a Christmas present last year, and he loved it. But he lost interest soon after he realized learning to play was not as easy as he thought it would be. Hasn't touched it in months. Maybe I will teach myself to play LOL.",
      "rating": 4.0,
      "verified": true,
      "author": "Simone J. Werkmeister",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "received defective model, compensated in full",
      "text": "One of the gears on the machine head was faulty, and overly weak and stripped during my first tuning. The company compensated me fully for the defective product. Although the bass was defective, I received full compensation. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Garrett K. Bemis",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Its alright",
      "text": "Its really good for the price. I liked it until one of the knobs got loose and was giving a sound while connected. I called tech support and didn’t help me at all and the manufacturer didn’t pick up the phone when I called. I took it to a place to see if they can fix it but we’re charging me a lot. So I might return it and buy another bass at a different place.",
      "rating": 4.0,
      "verified": true,
      "author": "Rodrigo Tejada",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "This was perfect. The low price point means I'm not investing ...",
      "text": "Longtime guitarist looking for a bass to start experimenting with. This was perfect. The low price point means I'm not investing too much into something I might decide I don't want to continue playing, but the quality is still surprisingly good. Intonation was good, as was the action. It's a little unbalanced and kind of wants to neck dive, but that's not a huge issue for me. Strap was pretty flimsy, but for the price of the whole bundle, I'm not really surprised. If you're looking for a cheap starter bass, I'd say this is easily your best bet.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "It is what it is",
      "text": "The guitar is like 9lbs. VERY light. It looks nice, but it also looks cheap. The hardware produces a buzz, and vibration...not anything you want to hear. I will adjust it, and if necessary replace the hardware to make it workable. I advise getting a squire for the few dollars more, this was a cheapo experiment. I have yet to plug it in, still trying to get it in tune, waiting for some light strings to replace the heavy grit ones it came with.",
      "rating": 3.0,
      "verified": true,
      "author": "Maui wowie",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Good for the price, great for beginners.",
      "text": "So this year I decided to have my midlife crisis. I bought a new sportier car, I started working out with a trainer, and I decided to take up bass guitar. For a total beginner like myself this seems pretty decent. I had to buy a separate amp (and learned that a guitar is not the same as a bass amp) and one of those little electric tuner machines, but so far this has worked out pretty well. For the price I'd say it's a great buy. If you're a total beginner this should do you just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "HarloweThrombey",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "A few adjustments and it's great to play",
      "text": "For the price, this can not be beat. Yeah, it's a cheap bass, but it works phenomenally well for the price. A few adjustments and it's great to play. Fair warning though, the included kit materials are not the greatest. Spend ten bucks and get a better bass strap. The gig bag has zero padding, but at least it can protect it from scratches. The included cable works, but you'll eventually want to get something a little more heavy duty. Like I said though, the bass is great buy for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "RndChris",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Good quality, but may miss a few things.",
      "text": "This is a very good product for its price. Mine functions well and came with no scratches. However, I didn't get what was advertised. I got the bass, case, cord, and strap. It was missing the L Wrench and pick shown in the pictures. Luckily, I already had these and didn't need it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason G.",
      "helpful_votes": 4,
      "publication_date": 20170112
    },
    {
      "title": "Worst material ever.",
      "text": "First time I went to tune it w/ my tuner , the gears in the gear box actually bent , leaving it it unable to tune. Made out of aluminum foil ?",
      "rating": 1.0,
      "verified": true,
      "author": "Rob L.",
      "helpful_votes": 2,
      "publication_date": 20200617
    },
    {
      "title": "Great bass for the price!",
      "text": "I have had this bass for a few months now, as a new bass player I wanted to get something that wasn't too expensive, but overall I am very satisfied with this bass, well worth the money for a good starter bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "I love my new toy",
      "text": "I love my new toy!!! I love the way it changes colors and the fact that it came with almost everything. It's nice and light. I'm in love with item!!! Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161115
    },
    {
      "title": "Nylon bag not worth much bit good beginners guitar.",
      "text": "Jr. High schooler needed for class 1st year. Good for beginner. The bag is ripping already though because of the knob for strap piercing the bag when carried to class (less than 2 mos). So expect to replace it. I wants expecting a whole lot from a nylon bag.",
      "rating": 5.0,
      "verified": true,
      "author": "If It Stinks, I Will Say So",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "setting intonation and filing the nut down it plays great, very little buzz",
      "text": "after adjusting the neck, setting intonation and filing the nut down it plays great, very little buzz , i wouldn't recommend a beginner learn on this bass until it is set up, your fingers will thank you. the pickups don't grab the low end very well, i would recommend replacing them, the neck and body is worth the purchase and upgrading. well balanced and easy to set up as a budget backup you can jam on and not worry about dents",
      "rating": 4.0,
      "verified": true,
      "author": "christopher hardman",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Buy This Guitar!",
      "text": "This guitar is fantastic for the price that it is. I love the color and the look. A problem with the guitar is the E string which I've heard other complain about too. The E (Low E) string rattles a little when you play an open note. So for others who have the rocksmith app the guitar is iffy. The E string sometimes may or may not register at all. This can probably be tweaked though. Besides that I love everything about it especially the amp and all the guitar's accessories. For a guitar you want to just mess around with or practice with this is a must buy!",
      "rating": 4.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Impressive quality for the price",
      "text": "I am a beginner, I vouch to this for being an excellent starter Bass.. I can't tell if it is any different from how top brands sound. I cut down 1 star because the socket for the Amp jack is a bit loose so often needs to be stabilized.",
      "rating": 4.0,
      "verified": true,
      "author": "Luda",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Excellent for the price.",
      "text": "I bought this for a friend of mine. Needed truss, nut and saddle adjustments, but very good for the price, It's input jack is solid with a tight clicky hot terminal, not loose like even many genuine fenders. Pickups are a tad weak but still sound good. I knocked one star off because the paulownia that the body is made of makes the finish quite fragile. Soft wood and hard finish don't mix very well.",
      "rating": 4.0,
      "verified": true,
      "author": "WizardsOf12",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Ba Ba Bass !",
      "text": "Good guitar I'am in my 60's And rock has come back into my life .. P.S. looking for a good drummer ?",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald R.",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Buy It",
      "text": "Plays and sounds as good as any high priced bass I've ever played. Perfect for studio work. Best price, best sound. Very easy to play after some basic setting up with the provided tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Good buy!",
      "text": "This is an excellent value buy for any beginner, sounds good , holds tune, very glad I bought this for my son but I'll put some tunes on and play along also....fun!",
      "rating": 5.0,
      "verified": true,
      "author": "byron",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "It feels like a much more expensive one",
      "text": "I wish I could have got one for this price a lot earlier in life. It feels like a much more expensive one. I couldn't say much about the sound quality because I'm a beginner. If I get discouraged learning to play, it won't be because of the quality of equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry E D",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "You can NOT beat this deal!!!",
      "text": "I'll echo the previous reviews. Fit and finish - perfect. Weighs much less than my Fender and SX. Only a slight adjustment on the bridge for fret buzz on the A and E strings. Intonation - very close. Again, only a slight adjustment to get spot on. Tonal response across the strings - excellent. Would I gig with this bass - YOU BET! Also, this bass holds tune. Only one drawback - doesn't come in red. I bought the black one. NOTE TO SELLER - DO NOT RAISE THE PRICE BECAUSE OF THE \"5's\" YOU'RE GETTING - RIGHT?. For the price...what are YOU waiting for...BUY THIS BASS!!",
      "rating": 5.0,
      "verified": true,
      "author": "DavidJ",
      "helpful_votes": 16,
      "publication_date": 20161115
    },
    {
      "title": "Breaks easily",
      "text": "Fine for a beginner but it has broken multiple times and have pain more than what it cost to fix it.",
      "rating": 2.0,
      "verified": true,
      "author": "Catherine Sweeney",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "I got a lemon...",
      "text": "Reading the reviews I thought I'd give this bass a shot, but unfortunately I got a lemon... the screws on the magnets were loose, which I thought wasn't a big deal I can just screw them in, and then when I started tuning the guitar and got to the G string, it wouldn't go higher than D. I could hear the gear slipping from the machine head and noticed that the gear was washed out. Other than that the quality seemed great, butbwithout proper tuning, its unfortunately unplayable.",
      "rating": 3.0,
      "verified": true,
      "author": "Cesar Garcia",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Five Stars",
      "text": "My husband is a professional musician. He loves this bass for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170331
    },
    {
      "title": "Okay",
      "text": "Output jack is bad quality, one little bump and it emits a horrible sound from the amp.",
      "rating": 2.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Good Value on a budget",
      "text": "It really is a easy fitting, large scale bass. Fender P-Style but better than some Squires Ive played. Very good value for the price and ease of purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "James Hazley",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Great bass for the price, especially for beginners",
      "text": "The best possible thing you could get for the price. The cord is a little iffy but works fine, I actually can't imagine how they managed to make a decent bass for so cheap. Amazing for a beginner like me who doesn't want to front a huge cost to get started.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Leff",
      "helpful_votes": 2,
      "publication_date": 20171007
    },
    {
      "title": "Great Quality Great Price Fast Shipping",
      "text": "Purchased for my 11 yr old who plays acoustic guitar and wants to learn bass guitar. Absolutely great price for a good guitar. Great for beginners. Everything you need but the amp. I would definitely recommend this!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Davis",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Stay away.",
      "text": "Very poor tuning pegs, they kept jumping cogs as you tightened them.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190511
    },
    {
      "title": "Worth Every Penny",
      "text": "For a bass that costs only a little over $200, this would be a great deal. But, it costs well under $100! It's fantastic. I won't claim it's as good as a real Fender P-bass, or even a Squier. But it produces nice, low tones. It stays in tune. It arrived well set-up but I had to adjust it a little. That's normal for every guitar or bass. Through a decent amp, it's suitable for almost any sort of gig.",
      "rating": 5.0,
      "verified": true,
      "author": "George H. Erdner",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "super bass. I wasn't expecting a lot for this ...",
      "text": "super bass. I wasn't expecting a lot for this price, but I was impressed. Just needed a little tweaking of the truss rod and it sounded awesum into a 20-watt amp. I am not an experienced bass player so I can,t give a professional review, but for a beginner this is a great sounding machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170404
    },
    {
      "title": "Awesome for the Great Value",
      "text": "Great value. I bought this to learn and mess around with, but it is a really awesome bass. I had to tweak it a little to get rid of some fret buzz, but all of the tools were included.",
      "rating": 5.0,
      "verified": true,
      "author": "Tidus",
      "helpful_votes": 2,
      "publication_date": 20170329
    },
    {
      "title": "Awesome Bass!",
      "text": "I don't know much about instruments, but I've had hours of fun playing around with this bass. I'm learning!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mulcahy",
      "helpful_votes": 5,
      "publication_date": 20170210
    },
    {
      "title": "Good quality",
      "text": "The Goplus electric bass Guitar was a real good bye was complete as you would wish it to be thank you very much, you made a young boy very,very happy and our pastor blessed you also, cause he plays at church on Sundays",
      "rating": 5.0,
      "verified": true,
      "author": "Ridgely Parker",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Great beginner bass.guitar.",
      "text": "I bought this bass guitar for my grandson for christmas. He loves it. It is great looking and perfect for him. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "It's pretty good besides all the fret buzz",
      "text": "It's good for a beginner not wanting to commit to buying an expensive one. There is quite a lot of fret buzz and I feel like this is just a tool to help you get better before you can buy a more expensive one.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Be prepared to do some set up work",
      "text": "After adjusting the neck, and setting string heights it plays well. I did not plug it in so don't know how the pickups are. I was using without an amp because I was only working on fingering patterns. It's also very light, which makes it comfortable to use while sitting on the couch watching TV.",
      "rating": 4.0,
      "verified": true,
      "author": "BobA",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Perfect package for a child who wants to add it ...",
      "text": "Perfect package for a child who wants to add it to his other instruments, and you're not sure whether it's something that he will want to continue. One month after the purchase, we can't get him away from the instrument. It was in need of tuning (which we expected) and the sound is more than we expected for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "MsKindleReader",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Christmas list",
      "text": "My granddaughter loves it!! Learning to play it from a teacher at her school. Very happy girl !!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah K. St.Pierre",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Very impressed with it considering it’s price.",
      "text": "A steal for its price. If you’re contemplating purchasing, just go for it. Not super high quality, but is impressive in its own way and perfect for a beginner.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "my expectations were low because of the price but it was way worse than I thought it was",
      "text": "Guitar showed up completely unadjusted, the pickups were rusted, I've had to rewire it 5 times because the wiring is so faulty. my expectations were low because of the price but it was way worse than I thought it was. Wouldn't suggest this for anyone the quality is terrible and it would be difficult for any inexperienced musician to adjust.",
      "rating": 1.0,
      "verified": true,
      "author": "Collin E.",
      "helpful_votes": 3,
      "publication_date": 20180303
    },
    {
      "title": "Not best condition when delivered",
      "text": "All around good bass, its the first one i ever bought and for the price its a good deal, but when mine came in the mail I don't know if it was ups fault or manufacturers fault but my pickups where sunken in and i had to take the bass apart to fix it. Quality is just as picture shows which is a decent bass for the price, but let me know if Im the only one who has had this problem. Again don't know whos fault it was but its not the end of the world.",
      "rating": 3.0,
      "verified": true,
      "author": "Unstealthy",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Good choice for a beginner",
      "text": "I am just starting to learn bass and this is my first bass guitar. It is easy to tune with an app and it sounds great! With this price I would say definitely worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Greenwald",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Perfect learning instrument",
      "text": "I’m having a blast learning bass on Rocksmith with this. Seems to have some buzz and I wouldn’t want to perform live in front of people but a great learner guitar",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy Olin",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "So worth the price!",
      "text": "This is great! I'd read reviews and kind of expected this bass to be average, especially for the price. But this is a high-quality instrument that's well-made and produces a great sound. The color is gorgeous, the entire instrument is well-built, and it holds its tune nicely. Absolutely no regrets on my part. It's a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Brooks",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Great Bass but probably not for gigs",
      "text": "Great Bass, its been a while now and it is holding up kinda good, but there are audio issues and it'll cut out here and there, I personally would get something more legit for gigs/shows just because I only use it for digital recording and its been falling apart maybe after a year or 2.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "It's my first bass and I say it works great. It's obviously not a high-quality instrument but what ...",
      "text": "It's my first bass and I say it works great. It's obviously not a high-quality instrument but what else would you expect from a bass as cheap as this. It works great as a beginner instrument and with a headphone amp I can even practice in my dorm without bothering others.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven The Gray",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "came but a key fell off it",
      "text": "my son was happy but only problem one of the key fell out when I open the box don't know if it can be fixed or what to do with it",
      "rating": 3.0,
      "verified": true,
      "author": "Andre Harris",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great Quality for the Price",
      "text": "Was a Christmas present to add to my husband's collection of instruments. He won't put it down now. He gave it 4 stars because some of the strings when certain frets are played have a slight metalic ring to it but I wasn't expecting it to be perfect since it was what I could afford for him.",
      "rating": 4.0,
      "verified": true,
      "author": "Krista Roberts",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Great little bass.",
      "text": "This is a great starter bass for beginners and for the value you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Pickle Rick",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "i couldent be happier",
      "text": "Honestly feel wise it is better than the fender i tried out. Its light weight and very comfortable. I might buy another one i liked it so much.",
      "rating": 5.0,
      "verified": true,
      "author": "boris khasin",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Awesome.",
      "text": "I've owned electric and acoustic guitars but never a bass. So when I saw the price of this bad boy here, I had to get it. I thought I ordered it in black but it came as the blue. So that was awesome. Get it if you're interested in starting bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Arnold",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great sound",
      "text": "I purchased this for my 11-year-old to play with and it sounds great!",
      "rating": 5.0,
      "verified": true,
      "author": "Stargazer💫",
      "helpful_votes": 4,
      "publication_date": 20170109
    },
    {
      "title": "Terrible Frets",
      "text": "poorly made frets literally slice my husbands hands everytime he tries to play it. will be returning.",
      "rating": 1.0,
      "verified": true,
      "author": "UrsKeo80",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Cool and light weight",
      "text": "My boy suddenly has interest in bass...it is a good price for beginners, looks cool. Wonder how long he can hold on that, so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel G.",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Best Choice for beginners and to have fun!",
      "text": "I'm very impressed by this instrument, I didn't have this great expectation!",
      "rating": 5.0,
      "verified": true,
      "author": "Meluccho",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Too top heavy",
      "text": "Much heavier than expected. Hard to balance even when sitting. Strap cuts into shoulder",
      "rating": 4.0,
      "verified": true,
      "author": "Deborah Decker",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Excellent student bass or lay-about bass",
      "text": "I echo the statements of the other good reviews, with a little setup, this is a very nice bass for 80 bucks. You get buzz right away, but it just takes a turn of the truss rod and it goes away. Perfect beginners bass or just a bass to have if say, you're a drummer or guitarist, etc. but like to have a bass on hand just in case.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcos",
      "helpful_votes": 7,
      "publication_date": 20170323
    },
    {
      "title": "Three Stars",
      "text": "Still rings even when I firmly press my fingers on the fret board.",
      "rating": 3.0,
      "verified": true,
      "author": "Clemstop",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Five Stars",
      "text": "Looks nice, plays nice, sounds nice. Hard to believe at this price point.",
      "rating": 5.0,
      "verified": true,
      "author": "David Gee",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Starter Basd",
      "text": "So far I've really enjoyed this bass. I'm using this as a learning bass as I've never played the guitar before. Great value, however the case and cable are cheaply made....i replaced those asap.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Wilkinson",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Stunned by how decent.",
      "text": "My way G&L out for neck repair so got as interim temp to screw with in meantime. These are not great but far far better than the price would suggest. Even better than a Squier for letting the kids mess with it.",
      "rating": 4.0,
      "verified": true,
      "author": "NotThat!",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "So far, so good. Very pleased with this. Excellent value.",
      "text": "Excellent bass. Probably would be fine for a professional player. Two bits of advice: 1) Make sure your tuner is set to bass and NOT guitar. 2) Use your thumb to tune it and not a pick.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald R. Miller",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Three Stars",
      "text": "Okay bass for a beginner, lots of buzzing issues. But it works.",
      "rating": 3.0,
      "verified": true,
      "author": "Skyler Khoury",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Great for beginners",
      "text": "My 12 year old daughter loves it. She is so excited to learn to play.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Garcia",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Sounds as good as any bass I've heard.",
      "text": "This guitar sounds terrific. Arrived in perfect condition. Really amazing value.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Nowetal",
      "helpful_votes": 2,
      "publication_date": 20170415
    },
    {
      "title": "GREAT BUY !!!!",
      "text": "Great buy. Great quality. Sounds great. The mini amplifier is awesome. It was the perfect gift for my daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "S.C.",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Great starter bass!",
      "text": "Bought this for my son for Christmas and he loves it. It doesn't require constant tuning and we were told that it's a great bass for the price. Mush better than similarly priced competitors.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Anaya",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Surprisingly good",
      "text": "Surprisingly, this appear to be equivalent to what Guitar Center sells for 149-199. Glad I returned a 199 Washburn for this 98. Came ready to go, action is surprisingly perfect. No brand insignia anywhere on it interesting.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "No brainer for beginners.",
      "text": "Bass sounds great. I'm a drummer who just started playing bass but my guitar friends are impressed with it. Other than being imbalanced (neck dives down when you let go) It is a great buy for the price. Also holds tuning very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Clemmer",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Great Purchase",
      "text": "Great purchase...my daughter loves her bass. First time playing and learning.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Can't beat that price.",
      "text": "I don't know enough about them to know what is good or bad but it arrived in good condition and it sounds and plays good to me!",
      "rating": 5.0,
      "verified": true,
      "author": "Hawks",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Reliable bass",
      "text": "This is my first bass guitar so I'm no expert, but it has a really nice sound quality and seems to be quite reliable and holds a tune really well. I haven't had any problems with it since I started playing it several months ago.",
      "rating": 5.0,
      "verified": true,
      "author": "clpumm",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "It's an \"affordable\" (cheap) bass",
      "text": "Came with a small dent on the back of the body and the tuning machines feel a bit crusty. Also the strap sucks. But I like it, does its job.",
      "rating": 4.0,
      "verified": true,
      "author": "Malivien",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Great to try your hand at bass without spending too much",
      "text": "Obviously, this bass isn't hundreds of dollars so you aren't going to get the greatest quality sound or anything like that, but if you are just trying to see how you like the instrument and learn some basic skills (or perhaps bass-ic skills), this is an excellent choice.",
      "rating": 5.0,
      "verified": true,
      "author": "pat",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Great for the price",
      "text": "The bass guitar is very light but plays well . The intonation was spot on truss rod takes adjustments fine .. I put new strings on it .. I was surprised at how well it played",
      "rating": 5.0,
      "verified": true,
      "author": "Joey Grimsley",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Great instrument",
      "text": "My great granddaughter wanted it and likes it. That’s good enough for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Castellano-Hoyt",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "I'm happy with it",
      "text": "Guitar is great for a beginner, I'd advise anyone interested to get one",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Stop looking & buy this hidden treasure",
      "text": "I love this bass. It's definitely worth the purchase. I thought this would just be a temporary bass, but it plays just as well as any other basses I've played.",
      "rating": 5.0,
      "verified": true,
      "author": "Toria",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Awesome amazing I love it",
      "text": "I love the bass guitar it's very good for some one that's begging time play the bass guitar it's all in one package deal for a very good price",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Already broken",
      "text": "After the first few weeks of playing it I was enjoying but eventually the sound stopped completly and i took it apart and relized the wires on the sound came undone and couldn't be fixed so i had to throw it away sadly.",
      "rating": 1.0,
      "verified": true,
      "author": "Person",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Totally amazed with this bass!",
      "text": "Amazing quality for what you pay! I was expecting something worse, but this bass is totally amazing! Nice wood, nice sound and nice looks!",
      "rating": 5.0,
      "verified": true,
      "author": "Wardys Mejía Terrero",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Waste of money",
      "text": "Arrives with broken tuner seriously a brand new product arrived not with shipping damages but defective from factory 1/10 do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "Ken Barnett",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Good bass",
      "text": "Good for price but definitely not for pros. When I received it one of the pickups were broken. But luckily I know some stuff so I fixed it changed the strings and some other things and the bass is good now but it’s still good for the price",
      "rating": 3.0,
      "verified": true,
      "author": "C m j ",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great Bass for cheap",
      "text": "The sides are really sharp however it's a really good bass",
      "rating": 4.0,
      "verified": true,
      "author": "Queen",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Do it",
      "text": "Excellent guitar for the money. Got it for my husband for christmas and hes learning quickly on it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jax Gates",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Good for the shorts",
      "text": "In my opinion it's great for people with tiny fingers",
      "rating": 4.0,
      "verified": true,
      "author": "Mj",
      "helpful_votes": 0,
      "publication_date": 20200209
    }
  ],
  "product_meta": {
    "title": "Goplus Electric Bass Guitar Full Size 4 String with Strap Guitar Bag Amp Cord (Blue Bass 4 Straps)",
    "rating": 4.4,
    "feature_bullets": [
      "🎸 Stable Quality & Fashionable Design---The electric bass is constructed with a wood body, it features solidity so that you can play it freely. The durable bass will stand up to years of wear and tear. With a polished surface, the bass looks smoother and more shiny. Besides, There are black & white and blue & white two colors for you to choose, it can satisfy your different aesthetics.",
      "🎸 Better Tones & Good feelings---The electric bass delivers a smooth tone for you, it is ideal choice for rock and roll, you can use it to play the blues, and everything else in between. The natural, bright sound of the bass complements the warm sounds of the solid wood.",
      "🎸 Bass Travel Bag Easy for Carrying---The electric bass comes with a travel bag, so you can take your bass to your lesson or anywhere you want. You can lift or carry the bass with straps. The bag designed with zip closures, you can also keep your music score or accessories inside conveniently.",
      "🎸 Great Gift & Quality Customer Service---The electric bass is a great gift for new, aspiring musicians or bass enthusiasts with fashionable design, reasonable price and excellent quality. Our professional teams not only offer qualified products with favorable price to our customers, but also great customer service.",
      "🎸 Complete Accessories---The electric bass is fully equipped with accessories The package is include 1×Electric Bass, 1×Bass bag, 1×Shoulder Strap, 1×Bass pick, 1×Amp Cord. When you receive the bass, you can play it directly."
    ],
    "specifications": {
      "Item Weight": "9.93 pounds",
      "Product Dimensions": "49 x 27 x 11.5 inches",
      "ASIN": "B01KNZOYO4",
      "Customer Reviews": "4.4 out of 5 stars529 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#2,428 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 7, 2016",
      "Back Material": "Paulownia",
      "Body Material": "Combined Laminated & Solid Wood",
      "Color Name": "Blue Bass 4 Straps",
      "Fretboard Material": "Rosewood",
      "Guitar Pickup Configuration": "Piezo",
      "Top Material": "Chrome Diecast",
      "Neck Material Type": "Rosewood",
      "Number of Strings": "4",
      "Guitar Bridge System": "Tremolo"
    },
    "categories": [
      "Electric Basses",
      "Musical Instruments",
      "Bass Guitars"
    ],
    "price": 99.99
  }
}