{
  "website_summaries": [
    {
      "verdict": "Very simple end table that has a low price point and won't take up much floor space.",
      "pros": [
        "Three-legged end table with angled legs to provide better stability than you may expect",
        "Uses bamboo legs, making it an eco-friendly choice",
        "Attractive"
      ],
      "cons": [
        "A little short at just 20 inches in height",
        "May tip over if you place heavy objects near edge"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "With its contemporary eco-friendly design and solid construction, this accent table is an excellent choice. Users across the board appreciate its high quality and practical elegance.",
      "pros": [
        "Owners appreciate the clean, stylish aesthetic appeal, durable feel, and large top of this end table",
        "One user reported she used this table in her work as an interior designer, praising its fabulous look",
        "We love that it is simple to assemble and has a unique two-toned color scheme"
      ],
      "cons": [
        "Some owners felt that the top of the table stains easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Gorgeous accent table!",
      "text": "A gorgeous table. Great quality! I'm an interior designer (Madi Design) and I used this table in one of my projects. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 39,
      "publication_date": 20170125
    },
    {
      "title": "Simple and elegant",
      "text": "I was looking for something basic, yet practical and found exactly what I wanted. The table goes perfectly with the decor but doesn't take over the room. I was pleasantly surprised to find that it took literally 3 mins to assemble and was very easy to do. Considering the price, my expectations weren't too high, but I’m thrilled to find that it's sturdy and well-made. It’s a happy addition to my living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott G",
      "helpful_votes": 9,
      "publication_date": 20190312
    },
    {
      "title": "Clean, minimalist design",
      "text": "This end table is a simple addition that goes a long way. It’s minimalist design looks great, I replaced a old boxy end table with this one and the whole room looks better now. Also this product has a “view in room” feature so I could check it out before buying. The feature is impressively accurate (see my third picture comparing the actual table to the feature table). Great modern design without the price.",
      "rating": 5.0,
      "verified": true,
      "author": "keith",
      "helpful_votes": 9,
      "publication_date": 20190315
    },
    {
      "title": "Really nice table!",
      "text": "The quality is way better than I expected. It's a study table, not wobbly, and it was easy to put together. It seems like it will last long. The look is simple and modern and will fit perfectly as a bedside table for our guest room.",
      "rating": 5.0,
      "verified": true,
      "author": "MsOak",
      "helpful_votes": 6,
      "publication_date": 20190830
    },
    {
      "title": "two months later",
      "text": "I have this table next to my bed as a side table and I’m so satisfied with it. It was the easiest thing to assemble of all the furniture I purchased for my room. It’s big enough to hold a table lamp and some miscellaneous items also (e.g. my phone, a glass of water, a framed photo). The table is also so stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalia",
      "helpful_votes": 9,
      "publication_date": 20200105
    },
    {
      "title": "Good business experience with the seller",
      "text": "NEW: I am updating my review because the seller reached out to me and was kind enough to send me a replacement with a full refund. Really appreciate the gesture. Good and fair business. OLD: After following all instructions on the manual, the last step of inserting screw 4 into table does not hold part A and B. When you try to lift the table holding part A, the screws labeled 4 comes out from part B. Every time i screw it tighter its no use. Complete waste of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Kumud Gautam",
      "helpful_votes": 5,
      "publication_date": 20200419
    },
    {
      "title": "Highly recommend, so cute!",
      "text": "I’ve been wanting a table like this forever! Finally found this seller and after looking at the price, I bought it immediately. Super affordable and so, SO cute! Easy to assemble, really great size (not a tiny flimsy table), and it’s so versatile I’ve been able to put it in several places in my home and it’s matched the decor every time. Highly recommend this side table!",
      "rating": 5.0,
      "verified": true,
      "author": "Kassandra Escandell",
      "helpful_votes": 5,
      "publication_date": 20191202
    },
    {
      "title": "Great Quality - Great Looking - Great Price!",
      "text": "I was so excited to get this table! I have been looking for clean and modern looking bamboo side table but had trouble finding one at this price point. This does not disappoint! Not only does it look great, it is very easy to put together! Trust me I am not handy at all 😃 I would recommend to anyone looking for stylish table at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole W",
      "helpful_votes": 8,
      "publication_date": 20161204
    },
    {
      "title": "EDITED",
      "text": "Really wanted to love this one. Looks wise it's really nice but practicality not so much. The table top is very top heavy and tips over all the time resulting in big dents on the white top when it hits the wood floor. Definitely not a table to buy when you have kids/ dogs or are planning on placing anything on it other then a cup of coffee. EDITED The company graciously reached out and offered to replace our table. We just received/ put together and the quality is great. We must have just had an off one on our last order. Beautiful side table that I would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Heatherelle",
      "helpful_votes": 9,
      "publication_date": 20171228
    },
    {
      "title": "Perfect side table",
      "text": "Very cute!! It looks just like the photo and was easy to assemble and feels well made. Be sure to double check the measurements because it feels a little larger than you would expect. The table top portion is actually about as wide as the table is tall. We did the measurements in advance and knew it would be perfect for our space. We love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie88",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "They're perfect!",
      "text": "Love these tables! They are exactly what I've been searching for, and at a reasonable price. Easy to put together, and seem nice and sturdy so far. I'm also very pleased with the size.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 6,
      "publication_date": 20170710
    },
    {
      "title": "Good quality for the price",
      "text": "I ordered a pack of 2 of these tables and they were a PAIN to put together. I thought the other reviews were just people who weren't handy...but I have put together quite a good amount of furniture in my life. The hard part was trying to get the holes to line up with the table top..not happening lol. After we eventually screwed them in, the tables were beautiful. A little shorter than I had expected, but my bed is also taller than most since I have the boxspring. They seem very sturdy and the quality is great. For less than $100, these are a great deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Cassidy Duhon",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "cute table",
      "text": "This is a cute side table, exactly as pictured and easy to assemble. My daughter bought it as a side table for her bedroom chair. 3 stars because it isn't super durable. This will work as an eye catching piece but wouldn't stand up to heavy use. The top can easily scratch and I would recommend using coasters for any drinks.",
      "rating": 3.0,
      "verified": true,
      "author": "James L. True",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Simple modern table, easy assembly",
      "text": "Very simple side table. Perfect for my nursery. Easy to put together. The legs are every so slightly wobbly no matter how tight the screws are, but it still seems sturdy enough for my purposes. Matched my Walmart basket perfectly too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kendra ",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Very disappointed with this purchase.",
      "text": "I received these tables and everything appeared to be in good condition, however upon assembling them I had multiple issues. The first table I assembled was extremely wobbly even with all the screws tightened, as far as they would go, short of splitting the wood. The second table had a screw assembly had no threads , so there was no way to keep the screw fastened. The second table is completely unusable and the leg collapses since the screw will not stay secured, as seen in the attached photo. Very disappointed with these tables.",
      "rating": 1.0,
      "verified": true,
      "author": "Lillie J",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "They are okay",
      "text": "They look good from afar, but up close, the texture of the tabletop looks cheap. They also damage easily if you accidentally knock them over. I had a a guest over who was drinking imported beers, and while they were listening to what sounded like old Madonna albums, a table tipped over and it was hard to tighten the legs. Oh well!",
      "rating": 3.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Great purchase!",
      "text": "Delivery packaging was excellent! I liked that everything was padded and easy to open and build. Sturdy feel. Wide table top. Modern aesthetic. Building was super easy. My only opportunity is that some of the parts can be a teeny bit loose, so just make sure you tighten the legs on super well! Overall, 5 stars! I got the set of 2 and it was a great deal for what I got!",
      "rating": 5.0,
      "verified": true,
      "author": "cdma5",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Unbeatable price but stains and sort of wobbly",
      "text": "Pros: This product was inexpensive so I had low expectations for it. It was easy to assemble (<8 min.) and looks like pictures. Nice addition for low-cost. Cons: The white top will stain upon contact with any sort of dark liquid (e.g. coffee ring,etc.) so use a coaster. Also, the integrity of the piece is poor — it is wobbly. However, these are acceptable deficiencies given the low price. I would rather have the extra $ and use a coaster and have a slightly wobbly bedside table. Overall: Good for those interested in purchasing a piece for the short term that looks elegant but does not have $$$ price.",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Great table",
      "text": "This table is great. Nice and sturdy, does not wobble at all which is the problem that I've had in the past with three-legged tables. I love the nice clean, sleek look. The top is actually bigger than I expected and that's a plus. Arrived on time without any problems and assembly was a breeze. I have no doubt that I get a lot of great use from this table.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Black",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "Looks good for the price",
      "text": "Really happy with this table Its small and works well, i can fit my laptop on it. My issue is that some of thr screws are not long enough and so i had to be creative with fasteing the top of the table to its base which is why i knocked off one star. Otherwise it was really easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "lanu",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Sturdy and looks good.",
      "text": "Packaging was great. Arrived quick. Material is nice. The only problem was the holes at the back of the white top where you attach the legs. The tools won't go in and you'll need a extra screwdriver or something.",
      "rating": 4.0,
      "verified": true,
      "author": "gandhali shastri",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Modern look",
      "text": "I ordered these for the modern look . I really like them . However the top scratches super easy . Would order them again though. Also surprisingly sturdy for 3 legs",
      "rating": 4.0,
      "verified": true,
      "author": "Martha K",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Looks great, easy to assemble",
      "text": "Looks great, easy to assemble, a bit wider than I had anticipated which is great. Great height. Very happy overall!",
      "rating": 5.0,
      "verified": true,
      "author": "dallas l gessel",
      "helpful_votes": 4,
      "publication_date": 20170612
    },
    {
      "title": "Liked it so much, I bought another.",
      "text": "Sturdy - which should be a minimum requirement for all tables, but sadly many are not. Easy to assemble - and I don't just mean few pieces and Allen wrench provided, but everything lines up as it should, threads and shavings don't come out of the holes when you start screwing, etc. Love the simplicity of the design! Purchased one to see if I liked it, and immediately purchased a second after assembling it and placing it next to my bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy",
      "helpful_votes": 2,
      "publication_date": 20171103
    },
    {
      "title": "good bedroom side tables",
      "text": "these worked as bedroom side tables/night stands. i wish they were a little taller. seems like side tables these days are so low/short.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin and Jess",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Awesome Table",
      "text": "It was very easy to put the table together. It is a lot sturdier, and has a bigger surface to hold things than I imagined it would be. I originally got it for the bedroom, but decided to use it in the living room instead. It's an excellent purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "SurferGirl",
      "helpful_votes": 3,
      "publication_date": 20170117
    },
    {
      "title": "Very nice!",
      "text": "Sturdy little side tables. Might be a little tippy if provoked as it is only three legged but they are well built, easy to put together and arrived quickly!",
      "rating": 4.0,
      "verified": true,
      "author": "GES",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Easy to build. Unstable finished product.",
      "text": "Extremely easy to build. Unfortunately the finished product was extremely wobbly and felt too unstable despite following the instructions perfectly. No issues with actual construction material quality. Maybe we got a dud?",
      "rating": 3.0,
      "verified": true,
      "author": "Law Tsai",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Nice kids night stand",
      "text": "Been using these for affordable side tables/nightstands in our kids rooms and they hold a good amount. Super lightweight and easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelley S.",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "looks just like what you'd imagine",
      "text": "Assembly is trivial, built quality is far above what I expected for the price, looks just like what you'd imagine. Very happy with the value of this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ronan carrein",
      "helpful_votes": 3,
      "publication_date": 20161120
    },
    {
      "title": "I love this table but it stains really easily",
      "text": "I love this table but it stains really easily! I've already had to paint over the white because of candles/glassware, etc. It's a really cute size, though, and super easy to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin Lunde",
      "helpful_votes": 3,
      "publication_date": 20170221
    },
    {
      "title": "Its ok for $50 but still looks kinda cheap. They charge for returns!!",
      "text": "Decent enough for $50 but it ended having a larger diameter than expected so decided to return it. Unfortunately they charge you $11 to return it. Definitely wont be ordering from this company again (Yuca).",
      "rating": 3.0,
      "verified": true,
      "author": "Jeremy B.",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Better than ikea",
      "text": "Such sturdy little tables for the price you pay. Wish directions were a little more clear but they’re not that hard. Loved these.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke Monroe",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Great little table",
      "text": "This is a great bedside table. It is attractive and was super easy to assemble. The packaging was in pieces when it arrived, but somehow the table was ok. I now have two of these in my bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Trista",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Great value, easy assembly.",
      "text": "Nothing too fancy but stylish and sturdy. Very easy to assemble. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "rbryan",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Great sturdy table",
      "text": "Great sturdy table, excellent for designing your living room. The craftsmanship is quite noticeable on the table and I really like it for putting odds and ends on it. I highly recommend this table. At this price, it's a steal as you won't find anything of this quality this cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Foresta",
      "helpful_votes": 3,
      "publication_date": 20170213
    },
    {
      "title": "Better than expected!",
      "text": "Got this for my office and I love it. I didn’t realize how big the table top was going to be, but I’m glad it was other than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Love these tables",
      "text": "Bought 2 of these. They are perfect for the price and size. Pretty easy to put together",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Miller",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Great modern/minimal style stands!",
      "text": "These were better than I expected! I was looking for some modern/minimal style stands to put in a guest room - and these were perfect. I ordered these as a warehouse deal and they arrived with all of the parts, no imperfections, and it was super easy to put together. I was pleasantly surprised and they look great in our guest room!",
      "rating": 5.0,
      "verified": true,
      "author": "Serena",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Simple Modern Chic Table",
      "text": "I had a hard time finding a side table that would be at the perfect height next to my sofa and this fit the dimensions perfectly! It looks just like the pictures and has a clean look and could fit almost any room aesthetic.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Faulkner",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Great Side Table",
      "text": "Lovely side table which was quite easy to assemble and fits perfectly next to the bed in my guest room. Wide enough for a lamp, book, phone and glass of water. The wood is beautiful. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather S.",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "High Quality, Clean Cut",
      "text": "This end table is so nice to look at and can be used as a nightstand or a small table. It is lightweight, easy to put together, and has a clean cut image with bamboo and a plain circle top. It's very sturdy, and I highly recommend using this item as a nightstand! You should totally buy this because it is worth much more than its price.",
      "rating": 5.0,
      "verified": true,
      "author": "Stefane Cahill Farella",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Very sturdy for a 3 leg table",
      "text": "I actually use this table to place my tire drum for playing (practice for Taiko drumming). It works fine for the height and that it is sturdy while I beat on the tire drum. It serves the purpose for me.",
      "rating": 5.0,
      "verified": true,
      "author": "RW music lover",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "MCM Table",
      "text": "Nice table - SUPER easy to assemble. It's actually bigger than I expected. It works perfectly next to a twin bed as a night stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter J. Hens",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Not worth it..",
      "text": "This had potential to be a simple, minimalistic table. Unfortunately, the screws that are supposed to attach the legs to the table top do not fit properly and after an hour of trying to screw it on, the table top has now produced a crack. I have assembled a lot of furniture before so I thought this would be easy however, something is not right with this piece. It's truly a disappointment especially seeing all the positive reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer L",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Beautiful table!",
      "text": "This a a beautiful table with clean lines and a gorgeous white top. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Val  Lorenzo",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Looks fairly cheap, materials are cheap. You're paying ...",
      "text": "Looks fairly cheap, materials are cheap. You're paying for the look, which is basically the tapered legs. In my opinion it's worth a retail price of $35, not a penny more. I fell for this one because I needed a hip looking table with natural wood finish legs and a white top. It is just that.",
      "rating": 3.0,
      "verified": true,
      "author": "UnbiasedAmazonReviewer",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Cute and sturdy",
      "text": "I actually love how these look, they were easy to put together, and are lightweight but sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Missing Screws",
      "text": "I really like the tables and I feel that the quality for the money is worthy of 4-5 stars as many of the other reviews suggest! They were easy to put together, and look very nice! However, the package I received was missing three screws! I tried to call the company, but it went to voicemail. I decided to just buy screws at the local hardware store. 8x1-1/3/M4.2x38.1 for particle board worked well in replacement if this happens to you!",
      "rating": 1.0,
      "verified": true,
      "author": "CLK",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Five Stars",
      "text": "Really cute and sturdy. We are using it in my daughter's room and it hasn't tipped over.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170904
    },
    {
      "title": "top came off",
      "text": "screws are set too shallow and the top literally sheared off immediately leaving me to rebuild the mounts with brackets. Wrong!",
      "rating": 1.0,
      "verified": true,
      "author": "P.Sherman42WallabyWay",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Loving the minimal, modern look",
      "text": "This table is awesome! It's gorgeous and fits the modern, minimal aesthetic that I'm going for in my apartment. It's sturdy, good quality, and easy to put together. Worth it!!",
      "rating": 5.0,
      "verified": true,
      "author": "V. Ton",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Easy to put together; great design!",
      "text": "I absolutely love this table. It was simple to put together (under 5 minutes) and the directions were very easy to follow. I appreciated the thank you card from STNDRD as a personal touch to the purchase. Also, the table’s modern design goes so well with just about any home decor setup and I have many places in my house where it can fit in.",
      "rating": 5.0,
      "verified": true,
      "author": "Tarah Tesmer",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Beautiful Table!",
      "text": "Not only is it an exquisite table, but it was easy peasy to put together. It is well constructed and fashionable. I'm happy and I recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sabra",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Good for price",
      "text": "Easy to assemble, but holes don’t align. Expect to use common sense and make your necessary adjustment. Cheaply made material, but I expected that for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Mrs Myers",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Screws don't attach fully causing wobbly top.",
      "text": "Even though I screwed the legs as much as I could to the top of the table, it's still very loose/wobbly. If I were to screw any more it would crack the wood, I think the screws are too small, but the problem is with the screw holes in the legs. Unfortunate, would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "veechee",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Missing screws, washers, etc required for assembly :-(",
      "text": "Well one table looks great... unfortunately that’s all the hardware that came included to assemble my “set of two”. And the long screws aren’t really something you can run to the hardware store and get extras of, they seem pretty custom. Hopefully someone from customer service can resolve this issue for me!",
      "rating": 2.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Perfect",
      "text": "I love the way the modern look of these nightstands. They are sustainable, affordable, and cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey Boyd",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great buy",
      "text": "This table is a great size. It was very easy to assemble, all the pre-drilled holes lined up and it only took 10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Grosso",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Poor quality table top",
      "text": "The table top scratches too easily. I placed a book on top. (A paperback book) And it scratched the surface! How?! $50 is too much for this table. Worth $20-$30, tops.",
      "rating": 2.0,
      "verified": true,
      "author": "Krys",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "You gotta love it",
      "text": "Personally, I think this is a really good small coffee table. The size is perfect. I also think it has fashion design. I love the wooden legs and white color. Moreover, it is easy to assemble. It only took me 20 minutes or so.",
      "rating": 5.0,
      "verified": true,
      "author": "FXXK netgear",
      "helpful_votes": 3,
      "publication_date": 20170509
    },
    {
      "title": "Exactly what I wanted!",
      "text": "I've been looking for a great mid century table for months now! I was so excited to finally find this + at a great price too! Super easy to put together + I've already gotten compliments on it!",
      "rating": 5.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Great looking and simple assembly!",
      "text": "Fantastic. These 2 stands are attractive and clean-looking. Look like they cost more. And (BIG PLUS) they are a breeze to assemble. They are on the low side (which is exactly what I needed beside a low platform bed) so just check the height of your bed to make sure they work.",
      "rating": 5.0,
      "verified": true,
      "author": "Twing",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Great product",
      "text": "A really nice set of tables that go great in my mid-century modern living room. Easy to assemble and arrived in great packaging.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Cute",
      "text": "They are cute and work great, but definitely a bit cheap",
      "rating": 5.0,
      "verified": true,
      "author": "kimberly",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Unstable and not worth the price",
      "text": "These tables are very unstable but they look nice. I don’t think it was worth $91 for two",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great simple design",
      "text": "Easy assembly. Table gives a nice simplistic accent to any room. Perfect for basic girls to add their fake succulent, oat milk latte, and display book that you haven’t read just to look cultured and take your Instagram pics. Except I bought this because my boyfriend wanted it. He likes it anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Cait J ",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Good-looking, economical bamboo tables",
      "text": "Delivered right on time. Two easy-to-assemble tables that look just right in the living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Delacorte",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Can't beat price & easy assembly!",
      "text": "SUPER easy assembly (and I am terrible at putting things together lol) Looks so cute next to my bed and is very sturdy. Looks way more expensive that it was & I've gotten soo many compliments! Great piece to pull a room together:)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Love it!",
      "text": "Very easy to put together. I love the way it looks! The pictures don't do it justice. The top scratches a little easy is my only complaint, but it's okay",
      "rating": 5.0,
      "verified": true,
      "author": "Margie",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Not worth the price",
      "text": "This is okay. Assembly took too long because one of the screws didn't quite fit. It is too cheap and wobbly due to the part that kind of fits for the price. If it was about 30 bucks I would think it was some what worth it.",
      "rating": 3.0,
      "verified": true,
      "author": "Claire McKeown",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Perfect table. Simple to put together",
      "text": "Perfect table. Simple to put together. Keep in mind this is very low to the ground, which worried me at first but it actually worked out really well in my space.",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Simple easy",
      "text": "Easy to put together looks great next to my bed. Perfect height too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Gorgeous and sturdy!",
      "text": "Not terrible to put together and it looks so good! Amazing price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Good Living room end table",
      "text": "Easy to build, not as sturdy you have to tighten the bolts from time to time but, i have had it for 2 years now and it’s perfect in my living room!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose C",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Perfect for boho vibes!",
      "text": "Super cute! Good price and taller than I expected (which is good). I put it in my office next to my chair and it’s giving off boho vibes. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Davis",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Didn’t come with all pieces needed to put it together",
      "text": "I would have loved to have given this a good review but I did not receive all of the screws needed to actually put the piece together. Sure wish I could just get sent a pack of the screws so I could complete this table...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Great affordable table",
      "text": "I have two of these babies. Look great in my house and are a great value. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister a",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Great table!",
      "text": "Love it. It's clean and sleek looking, easy to put together, and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Z",
      "helpful_votes": 4,
      "publication_date": 20170630
    },
    {
      "title": "Cute!",
      "text": "These seemed short at first . But fits next to my platform bed at just the right height. Love the look!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Awesome side tables!",
      "text": "Sturdy and so cute for the price! I bought these twice and love them!",
      "rating": 5.0,
      "verified": true,
      "author": "TNo",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Four Stars",
      "text": "It looks exactly like the picture. It's low to the ground, and it's a good height for a nightstand.",
      "rating": 4.0,
      "verified": true,
      "author": "jenny reviews",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Great Table",
      "text": "Very nice, slick table, easy to assemble and the smell of bamboo is awesome. The only I would like would be, for it to be all bamboo colored, not the top white, I think that will give it a more solid look but overall great table sturdy and bigger than I thought.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Nice but they come apart",
      "text": "These are nice tables but they do not stay together. The base and top separate. I have ordered several of these for our office and have had to glue the base to the under side of the top. I would’ve returned them, but they came apart after the return deadline.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Three Stars",
      "text": "Easy to assemble, looks nice. After about 4 months with nearly no use, it wobbles.",
      "rating": 3.0,
      "verified": true,
      "author": "Akchris",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Easy to assemble",
      "text": "Super easy to assemble and looks great as a nightstand.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim C.",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Easy to assemble",
      "text": "Assembly was easy and they look very modern and simple, which I like.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosa Armstrong",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "A basic end table - but is sturdy, simple and works nicely in our living room ...",
      "text": "A basic end table - but is sturdy, simple and works nicely in our living room at a fair price. Pleased with this purchase overall - though the quality of the wood was a bit less than I had hoped.",
      "rating": 4.0,
      "verified": true,
      "author": "Spencer S",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Great quality!",
      "text": "Great side tables! A little bigger than I had imagined but great quality and love the design",
      "rating": 5.0,
      "verified": true,
      "author": "Gillian C.",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Perfect size",
      "text": "Love this little table. It was very easy to assemble and it works perfectly in my apartment.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170524
    },
    {
      "title": "Okay?",
      "text": "It took me a little to install the legs to the base and it doesn’t seem all that sturdy. Table also has a small chip in it.",
      "rating": 3.0,
      "verified": true,
      "author": "Madelyn",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Light weight, great material and easy to install",
      "text": "Love this side table, it not very big so it can work great in small spaces. Has a lot space in the top. The best part is that is very easy to install and is not heavy. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyd Marie Colon",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "love these tables!",
      "text": "such a nice modern look. easy to set up and clear instructions! nice height next to our couch.",
      "rating": 5.0,
      "verified": true,
      "author": "Shan",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "An Amazon Gem",
      "text": "Love this little side table. I use it next to my bed as a nightstand but I plan to use it in my living room in my next house. Easy to assemble and great value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Shepherd",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Five Stars",
      "text": "Great table. Sturdy AF. minimalist/ modern/ clean design. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Noiceee",
      "text": "Easy assembly , holds 2 plants and a piggy bank . Seems sturdy",
      "rating": 4.0,
      "verified": true,
      "author": "Saul",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Great table!!",
      "text": "Got this for a bedside table and I really love it. It's sturdy and quality for the price, and looks super cute and modern!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 2,
      "publication_date": 20170103
    },
    {
      "title": "Stylish Table for a Great Price!",
      "text": "So easy to put together, and looks awesome on our balcony! Very stylish & modern. Great Price!\"",
      "rating": 5.0,
      "verified": true,
      "author": "RMC",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Five Stars",
      "text": "Great product. Minimalist, sturdy, and very easy to put together. We love these!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Cute and practical",
      "text": "Such a cute side table! So easy to assemble - only took a few minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200708
    }
  ],
  "product_meta": {
    "title": "STNDRD. Bamboo End Table: Mid-Century Modern. Bedside Nightstand or Living Room Side Table (Set of 1)",
    "rating": 4.6,
    "feature_bullets": [
      "NATURE-FRIENDLY. The STNDRD. 3 legged bamboo side table is an environmentally friendly piece of furniture. Bamboo is one of the many renewable resources in the planet. It takes only 5 years to regrow a bamboo tree compared to other types of hardwood.",
      "RUSTIC FURNITURE. This 3 legged bamboo furniture is a versatile piece. It is built from bamboo wood strong enough to hold some indoor plants. The 3 light colored bamboo legs is manufactured without using any method to alter its natural rustic look.",
      "PROVIDES COMPETITIVE PRICING ON FURNITURES. Our bamboo table top furniture comes at a competitive price compared to other wood furniture sets. Bamboo is a low cost raw material so it owns a big price advantage over other kinds of furniture sets.",
      "READY TO ASSEMBLE FURNITURE. Our STNDRD. 3 legged bamboo side table comes in a flat package box containing 1 round table top in white color and 3 bamboo legs. The assembly instructions are very easy to follow and no need for any special tools to use.",
      "100% MONEY BACK GUARANTEE. We are so confident with our product that we will give you a no-questions asked money back guarantee. So hit that \"Add to Cart\" button now get this versatile bamboo end table for that refreshing rustic furniture design."
    ],
    "specifications": {
      "Package Dimensions": "22.1 x 21.8 x 4 inches",
      "Item Weight": "11.33 pounds",
      "Manufacturer": "STNDRD.",
      "ASIN": "B01K09X598",
      "Item model number": "4C-INNJ-HKTZ",
      "Customer Reviews": "4.6 out of 5 stars401 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#47,392 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 8, 2016"
    },
    "categories": [
      "End Tables",
      "Tables",
      "Furniture",
      "Home & Kitchen",
      "Living Room Furniture"
    ],
    "price": 49.99
  }
}