{
  "website_summaries": [
    {
      "verdict": "Easy to use and heats evenly, but the unit tends to fail within a year of regular use.",
      "pros": [
        "Simple to set up and use, and gets very hot for a press at this price point",
        "Owners like the accurate temperature and good pressure provided",
        "Very sturdy"
      ],
      "cons": [
        "Reports of machine heating becoming unreliable or failing completely after a few months of use",
        "Handle can be tricky to unlock during use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "So far so good!",
      "text": "I haven't been using it too long I've only done about 20 shirts. But so far so good! I was pressing vinyl on shirts with an iron and one 3 layered onesie would take about an hour AND the vinyl would shrink so it ended up not lining up well. Best $200 I've spent. I've cut pressing time by about 2000% so worth it if you have constant requests coming in! S/n: If you're wondering if it's a good choice or not I asked a family friend who owns a print shop to help me choose between this and two others and he said this was a good choice for price quality and size!",
      "rating": 5.0,
      "verified": true,
      "author": "Ciara",
      "helpful_votes": 11,
      "publication_date": 20190506
    },
    {
      "title": "Must have for HTV",
      "text": "I got a Silhoutte for Christmas and was loving my endless possibilities for custom t-shirts. However it seems no matter how focused and hard I tried to iron on the vinyl I would get peeling spots after washing. This heat press has made it so much easier to make shirts and I have not had an issue with peeling using multiple brands of vinyl on different types of fabrics. Highly recommend this heat press for anyone working with HTV!",
      "rating": 5.0,
      "verified": true,
      "author": "Mama_Tiff",
      "helpful_votes": 6,
      "publication_date": 20200416
    },
    {
      "title": "Great heat press! Easy to use.",
      "text": "I cranked out five shirts in the time it took me to do one with my iron!! Why did I wait so long to buy this?! I purchased the 15x15 because my husband is a 3XLT and his shirt designs are all 11.75\" wide, so a smaller one wouldn't have sufficed. Extremely easy to use. Plugged it in, selected the temperature and time and that was IT! However.. when I have this on and it switches into heating up mode, my ceiling fan light dims. When it switches off, ceiling fan light goes bright again. It's on a normal wall socket.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Bear Bethay",
      "helpful_votes": 9,
      "publication_date": 20170801
    },
    {
      "title": "Great machine!",
      "text": "Great press! Arrived quickly! Sturdy frame and best price I could find for the size 15x15! I'm already spoiling my friends and family with t shirts and hoodies. I've only had it a few days but I'm in love. It was easy to set up (aka take out of box, set on a sturdy desk, and plug in) then setting the temp and time was super easy as well!",
      "rating": 5.0,
      "verified": true,
      "author": "H. Finney",
      "helpful_votes": 25,
      "publication_date": 20160918
    },
    {
      "title": "Get to know your machine",
      "text": "For the price, I love this press. The digital temp setting reads hotter than what the actual Platen temp is. Ex: 331 on the digital readout is actually 320 at the platen, measured with a temp gun. The upper platen has quite a bit of variation in heat distribution. The front usually ranges from 5-8 degrees hotter than the back, when checking with my laser temp gun. This poses a challenge on larger transfers for even heat distribution. Once you get the specifics of the machine figured out, it is easy to use, and seems to give even pressure throughout. Overall, I won’t complain for the price. Great for starting out with your first heat press.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted Titus",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Excellent Machine",
      "text": "Works as stated. Timely delivery. Heavy. No damage. My only reason for 4 stars is because when using heavier pressure, the arm is difficult to open, which can potentially cause damage to the item. When attempting to open on heavy pressure, the whole thing lifts. I have to pull down on the protective sheet and lift the arm at the same time. My tip is start trying to open around three seconds remaining.",
      "rating": 4.0,
      "verified": true,
      "author": "KorterBegorter",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Works great for me, despite terrible instructions",
      "text": "Seems to be pretty well made. The instructions were horrible. It did come with a book that was in impossible to understand English rendering it worthless- however it’s not rocket science and there is YouTube. The press works great, easy to use controls, accurate timer. Really pleased so far",
      "rating": 5.0,
      "verified": true,
      "author": "Raspberry Wren",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Great buy",
      "text": "I got this as my first heat press. I read several reviews and articles for weeks before buying one and debated if I should get one with a swing away arm or attachments but finally decided on this one and I have not been disappointed. It works great. I thought I would be scared of getting burned with it being clamshell but it really is easy to use. I am happy with this one",
      "rating": 5.0,
      "verified": true,
      "author": "maranda",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Quit extended warranty but not replaced",
      "text": "Heat press quit bought extended warranty but still no replacement wasn't even a year old will not work and Assurion warranty is no good no one will replace even with 4 year warranty save you money Fancierstudio will not back or even get back to you",
      "rating": 1.0,
      "verified": true,
      "author": "Judy L. Redger",
      "helpful_votes": 2,
      "publication_date": 20200619
    },
    {
      "title": "Sturdy & ready to use",
      "text": "I’ve been really impressed by this heat press. It’s sturdy, super easy to use, & has a great even press. This is not my first heat press, but wanted to go with a 15x15 this time & works perfectly for adult shirts!",
      "rating": 5.0,
      "verified": true,
      "author": "Jlg ",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Love it",
      "text": "So far I am very impressed with this machine. Makes the work very easy to do and quickly. Heavy and built solid. I was able to do 6 cruise t-shirts within minutes. I purchased a 9x12 Fancierstudio over a year ago and constantly second guessed myself on the positioning of the vinyl. Now I can actually see and just wished I went with the 15x15 in the first place.",
      "rating": 5.0,
      "verified": true,
      "author": "June",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "It's ok if on a budget",
      "text": "Works pretty well for the price definitely wish i would have gotten a better one tho, the pressure that I have to use seems like the handle is ready to snap at the bolt, the alignment is off amd there is like glue residue all over the side of the machine the temperature is not consistent throughout the plate either",
      "rating": 4.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Heat isn't working.",
      "text": "The heat on mine stopped working after 2 1/2 months. It's not getting hot enough. DO NOT BUY THIS. The return policy is only 30 days which is not fair, it should be atleast 90 days. I was happy at first but definitely not now.",
      "rating": 1.0,
      "verified": true,
      "author": "Whitney Walker",
      "helpful_votes": 8,
      "publication_date": 20170323
    },
    {
      "title": "So far, so good.",
      "text": "This press came highly recommended. So far I like it much better than the previous press that I had.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Rappa",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Great value for the money",
      "text": "Very pleased with this purchase! Press has been used daily since I purchased and it has held up well so far under those circumstances 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Tomika Coffey",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great product",
      "text": "Products works great and easy to use! So happy I made this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Hicks",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great machine.",
      "text": "I was a little nervous about using it. I watched YouTube videos and printed a cheat sheet for the different types of HTV. I took an old shirt and tested different types of HTV. I was pleasantly surprised how easy it was. The heat press is definitely a game changer. I'm in love with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Gerlack",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Disappointed",
      "text": "Was so excited when I got this. Instructions were hardy in English. From the start the display was a bit more difficult to set. Even after I figured how to set it the temperature was always wrong. Had it set to 310. Center was 308, one corner 289, one corner 340, another 320. Returned after 3 weeks.",
      "rating": 1.0,
      "verified": true,
      "author": "k.sierra",
      "helpful_votes": 2,
      "publication_date": 20170421
    },
    {
      "title": "Wish I would have bought sooner",
      "text": "I love this heat press. So long to my easy press and hello to constant pressure without the upper body workout. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Beckman ",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Sucks",
      "text": "The heat setting will not adjust after 2 months of use. Unfortunately they don't allow returns after 30 days so im stuck with ordering another brand",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "I bit the bullet & went with this one & I'm glad I did",
      "text": "I read so many reviews on heat presses & didn't feel confident with really any of them. I bit the bullet & went with this one & I'm glad I did. It has worked perfectly for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber S.",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "Never disappoints",
      "text": "This heat press never Disappoints my projects are always stuck on and perfect heats up quickly and is easy to store is a little bit heavy though",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Great value",
      "text": "I have found this heat press to be extremely user friendly and a great value! It's so easy to use from the heat settings to the timer and pressure. It has been a true game changer for me.",
      "rating": 5.0,
      "verified": true,
      "author": "SPBC",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Works freat",
      "text": "Product is just as described. Works perfect for our family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Amanda",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Works great!",
      "text": "Easy to use right out of the box. I read reviews and really shopped around before buying this heat press. I am extremely pleased with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Kinsey",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Nice press.  Good value for your money.",
      "text": "Nice cheap heat press. Easy to use. Only negative is how far it opens, it could be wider to make it easier to load a garment.",
      "rating": 4.0,
      "verified": true,
      "author": "BobLap",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "2 Years and Still Working Like New",
      "text": "One of the best! Got this press to start my business two years ago and it’s still going strong! Highly recommend this if you are looking to start your tshirt business!",
      "rating": 5.0,
      "verified": true,
      "author": "Prianna Fort",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Dropped Temperature",
      "text": "When its time to make a shirt and I have it on 315 once i clamp down the temp drops",
      "rating": 3.0,
      "verified": true,
      "author": "Harlem 700",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "TEMPERATURE MODULE COMPLETELY INACCURATE !!!!!",
      "text": "WAS AN ABSOLUTE DISASTER FROM THE START! DIDNT EVEN HA E IT 24HRS BEFORE IT OVERHEATED AND MELTED THROUGH THR TEFLON AND BURNT ONE OF MY T SHIRTS. I COULDNT IMAGINE ALL OF THE PRESSES THEY SELL DOING THIS! HOWEVER THIS PARTICULAR UNIT I RECEIVED WAS DEFINITELY DEFECTIVE/AND A DUD!!!! 👎🏾👎🏾👎🏾👎🏾👎🏾",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Alright press.",
      "text": "Good size. Pretty heavy. The handle is a little hard to lock down and unlock. The edges have some sharp spots. Other than that It’s okay.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Crandall",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Wobbles and unstable",
      "text": "When I took the heat press out of the box, I set it on the table and it wobbled. The back left corner doesn't touch the table like the other three corners. So when opening and closing the machine, it is unstable. I have sent it back and waiting on a replacement. I'll update this review after receiving the replacement product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "The design is really nice and the machine's design is easier than my old ...",
      "text": "I was never able to set the machine's temp/timer. I finally peeled back the covering for the LCD screen and saw that the buttons for the adjustment was too far back to work without removing the cover. I was then able to adjust the temp and time but it stopped working in the middle of doing that. The design is really nice and the machine's design is easier than my old machine but I could never get it to start up. What a waste!",
      "rating": 1.0,
      "verified": true,
      "author": "Sanicqua Smalls",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Coating peeling from hot plate after a few uses",
      "text": "The heat press is fairly easy to use. The arm requires a bit of strength to lock it into place. I’m very disappointed because I haven’t even had it for 30 days yet, used it 5 or 6 times and the coating is already peeling off of the hot plate. It’s just continuing to get worse with each use.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer Boory",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "worked like a charm",
      "text": "Item as described, manual leaves much to figure out on your own, but with youtube videos posted by other owners and a little bit of trial and error I have it figured out. Made my 1st 3 shirts this week, worked like a charm! :-D",
      "rating": 4.0,
      "verified": true,
      "author": "Christina Castillo",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Item falling apart strait out of the box",
      "text": "Foam padding was peeling off, does not look the same as in pictures, the padding is gray not red, not sure of that has something to do with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Gabby Vigil",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Love my press!",
      "text": "I had waited for so long to purchase a press. I researched for months before I purchased this press. I have been so pleased with it! It is so incredible simple to use and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "James Boggs",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Great product!",
      "text": "So easy to use! I've made over 50 shirts in my first month and haven't had any issues! The product is very heavy to make sure you have a surface you can leave it on permanently.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Huddleston",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "Five Stars",
      "text": "THIS MACHINE IS GREAT!!! I AM SO HAPPY WITH MY PURCHASE!!! WORTH THE MONEY FOR SURE !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicqan",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Quality control issues....",
      "text": "Read really good reviews about this budget heat press and needed to replace a 5 year old press. Lid almost impossible to release and will not hold temperature. Had to keep raising the temperature to get it over 300. Returned and will probably invest in a better quality press.",
      "rating": 1.0,
      "verified": true,
      "author": "Terrie L. Wardell",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Would buy again",
      "text": "Nice heat press for the money, a lil inaccurate but that's expected for the price point. Would order again.",
      "rating": 4.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great product. My only complaint would be the instructions ...",
      "text": "Great product. My only complaint would be the instructions are not in very good English. I was able to figure it out however they did not list in the directions to use the cover between heat press and vinyl/item.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren Conley",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Pressure knob is broken",
      "text": "I was able to use this for about a month. When it came time to tighten the pressure to make shirts, the knob just kept turning without adding any pressure. And of course it only gives 1 month to return so now I have a pretty useless piece of expensive equipment.",
      "rating": 1.0,
      "verified": true,
      "author": "s.byars",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Easy to use",
      "text": "Oh yes! Easy to use, easy to press! Just easy to do it. Everything works and I can't wait to use it more.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Taylor Sr.",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Darn good!",
      "text": "I still have this thing and I love it, it made my t-shirt making so much easier!",
      "rating": 4.0,
      "verified": true,
      "author": "Austin Marqua",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Broke in less than 4 months",
      "text": "Worked well instally when I purchased it in November, but gradually it became harder for the top to snap down into locked position. Now it won’t snap at all and even with putting pressure on it my vinyl isn’t transferring properly. A lot of money spent for a short amount of use.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Three Stars",
      "text": "It's ok. but it won't lock.. I need more pressure on items.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170309
    },
    {
      "title": "Excellent product!",
      "text": "I’ve had this for a few weeks now and I love the ease of use!",
      "rating": 5.0,
      "verified": true,
      "author": "Chap",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Five Stars",
      "text": "I bought for my daughter n law to make thing with and she loves it works wonderful",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Easy to use",
      "text": "I love this heat press. It was very easy to set up and works perfectly. So happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Keila Aldea",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Worth the money",
      "text": "I had to return my other heat press because it stopped working and I ordered this one. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Joesph C.",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Great Product",
      "text": "I really like this product. I tried a regular iron and then decided to get something good. I am very happy. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Good quality",
      "text": "Very good product. Has helped make shirts for baseball games.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Four Stars",
      "text": "Worth the price paid. Had it about a month. No issues yet.",
      "rating": 4.0,
      "verified": true,
      "author": "teresa b",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Great investment!",
      "text": "Great product and well made. Item as described. Very easy to use. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Excellent Machine & Value",
      "text": "Love this! It’s heavy and has held up very well!!",
      "rating": 5.0,
      "verified": true,
      "author": "APRIL AWADALLA",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Five Stars",
      "text": "Getting the job done how I expected. No issues as of now.",
      "rating": 5.0,
      "verified": true,
      "author": "Teressa Tate",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "Get what you pay for...",
      "text": "Pressed about 20 shirts and the top heating platen is already coming loose for the cover. Sending it back and getting the more expensive press. You get what you pay for. And with a business, I gotta make he investment.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "the directions was pretty easy to understand",
      "text": "Have had no problems with it warming up and working perfectly, the directions was pretty easy to understand. Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "Awesome",
      "text": "It works really well. Timer automatically starts. Really easily adjustable on the heat and the actual pressure. Only down side is that is is heavy. But that is everyone that I have used so far. So really no complaints",
      "rating": 4.0,
      "verified": true,
      "author": "Scottiesterling",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "No heats up evenly, not recommended",
      "text": "Heat press doesn’t heat up evenly, poor customer service definitely not recommended, save a little and buy something that don’t make you lose money instead of making",
      "rating": 1.0,
      "verified": true,
      "author": "Estephania",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "DON\"T DO IT",
      "text": "Let's just say I'm not even 6 months into using it with 2 months downtime from taking care of my grandmother and GUESS WHAT?! It has quit heating!! DO NOT BUY",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "love this press, great investment",
      "text": "I was using an Easy Press and just purchased this. Man am I happy I did. I absolutely love it. It heats evenly and is easy to use. It heats up quickly as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Callahan",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Works great",
      "text": "I made 23 t shirts with front and back vinyl over a 2 day period . machine worked great, shirts have been washed and worn multiple times and no peeling.",
      "rating": 5.0,
      "verified": true,
      "author": "Aimee",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Love this heat press",
      "text": "The heat press is fully functional as soon as it comes out of the box. It is nice and sturdy and extremely easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "The price was reasonable and very user friendly",
      "text": "I use for pressing decals on clothing. I find that this is better than the swing away I have been using.",
      "rating": 5.0,
      "verified": true,
      "author": "Harriet R. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Damaged, what happened?",
      "text": "Just unpacked my heat press and there is damage. Very disappointing for a brand new purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Twila Oliver",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Love it!",
      "text": "Love it it works great! So much better than my last one!",
      "rating": 5.0,
      "verified": true,
      "author": "camrynn waite",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Waste of money",
      "text": "I mean for almost $200 it would be nice if you could adjust the temperature and time. Doesn’t work - total waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Leanna Vaughn",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Easy to use",
      "text": "I bought this for my daughter's birthday. She absolutely loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Cheap Chinese knockoff",
      "text": "Poor design the heat panel sits too low when open will burn your knuckles when loading the shirt.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony V.",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "I received my press promptly and it's been perfect so far This is a trusted seller thank you ...",
      "text": "I received my press promptly and it's been perfect so far This is a trusted seller thank you for my product",
      "rating": 5.0,
      "verified": true,
      "author": "sherri s.",
      "helpful_votes": 2,
      "publication_date": 20161021
    },
    {
      "title": "Five Stars",
      "text": "MUST HAVE if you have a lot of iron on crafts.",
      "rating": 5.0,
      "verified": true,
      "author": "HemiHaley",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Fast delivery",
      "text": "I love the fact that it arrived almost a week early! So far, it’s been easy to use. It saves me so much time.",
      "rating": 5.0,
      "verified": true,
      "author": "ebonyeyedempress",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Awesome",
      "text": "My wife loves it she can’t stop using the press machine",
      "rating": 5.0,
      "verified": true,
      "author": "contavious W.",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Good item for the price",
      "text": "So far so good...does heart up past the desired temp but that hasn't caused any problems...",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon Cross",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Terrible waste of my money",
      "text": "Was not the same machine pictured. Does not even work right. It's not enough pressure even tightened all the way. Terrible waste of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "It took a couple of tries to get used to ...",
      "text": "It took a couple of tries to get used to using the machine, but it arrived in the expected time and is completing the jobs I am doing with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Latoya Wright",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "I wish there was an easy way to secure this to the table",
      "text": "I wish there was an easy way to secure this to the table, difficult to open without securing down. Works great. Easy to adjust settings and pressure",
      "rating": 4.0,
      "verified": true,
      "author": "Rustic Buck Designs",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "LOVE this heat press",
      "text": "LOVE this heat press!! Works great and is easy to use! Arrived quickly! Would definitely order again from this seller!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather S.",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Great product",
      "text": "Works great and just the right size for a T-shirt business",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Perfect!",
      "text": "I am loving my heat press. Heats up quick and get the job done! Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Mooney",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Great fun making custom stuff",
      "text": "Works exactly as it should. Great fun making custom stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Charley McBride",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Ordering  1 more",
      "text": "Product was clean and pack great plugged in and work instantly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Well, I apparently was not one of the lucky ...",
      "text": "Well, I apparently was not one of the lucky ones. Unboxed it, plugged it in, started heating, got to around 200 degrees, then died. No lights, no heat, no activity whatsoever. Pulled the controller, everything looked connected correctly. Sent an email to the company asking what to do now, waiting for a response.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce G.",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "Four Stars",
      "text": "Press works great, however the digital panel seems to be cheaply made.",
      "rating": 4.0,
      "verified": true,
      "author": "DONNA WATKINS",
      "helpful_votes": 2,
      "publication_date": 20170113
    },
    {
      "title": "Three Stars",
      "text": "Good machine for the price. Just disappointed that it did not include tephlon sheet like I was told",
      "rating": 3.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "Rusty",
      "text": "Rusted a fairly good bit and lools like it will eventually break due to it. It works fine but im very aggravated about the rust. The more i use it the worse it gets!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170305
    },
    {
      "title": "One Star",
      "text": "Awful press. Doesn't have the correct pressure even with the pressure knob at the tightest. Buyer beware. Don't buy.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 5,
      "publication_date": 20160928
    },
    {
      "title": "Don't change the pressure",
      "text": "I have ordered this twice. once was a replacement. It works great until you need to change the pressure. The unit will not lock at all. The knob turns in both directions but will never lock down again. If you are only pressing shirts and don't have to change anything it works but don't ever turn the knob.",
      "rating": 1.0,
      "verified": true,
      "author": "Melozone",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Works Great",
      "text": "I have only done 4 shirt but so far its great. It is heavy and locks down hard so its not for someone that is weak.",
      "rating": 5.0,
      "verified": true,
      "author": "chells6326",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "AWESOME!",
      "text": "Game changer! Upgraded from 9x12\" size and soooo much more I can do! I love this brand as it's the same brand as my small one..NO issues the 3 years I've used it.",
      "rating": 5.0,
      "verified": true,
      "author": "jilljill",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Great starter press",
      "text": "What I got was not what was pictured, however, it works fine. Great starter heat press, though. Get a digital thermometer to make sure the temp. is what it says and google a bit to figure out how to work it (the included instructions are beyond useless).",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole R.",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Great heat press!",
      "text": "Going on six months and have expanded my small, local business to Etsy. Love this thing!!! I do wish it would have come with the piece of foam some buyers report they got with theirs under the red rubber mat, but oh well. It's a work horse!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca R. Adams",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "When I took it out of the box, the ...",
      "text": "When I took it out of the box, the digital reader was not working properly but it is too much of a hassle to exchange. It works for what it's supposed to do. It does take a while to warm up and I do wonder about my electrical bill, so I save using the heat press for larger projects or when I have saved up enough projects to do at once.",
      "rating": 3.0,
      "verified": true,
      "author": "_JDR_",
      "helpful_votes": 2,
      "publication_date": 20170217
    },
    {
      "title": "was rusted when openned box",
      "text": "ours had rust out of the box...looked like the handle had been improperly coated",
      "rating": 1.0,
      "verified": true,
      "author": "jeremy allen",
      "helpful_votes": 8,
      "publication_date": 20161202
    },
    {
      "title": "Works great and is easy to use",
      "text": "Works great and is easy to use. Haven't had any issues with it, usually keep it at 325 degrees for 30 seconds and the presses come out great. I've used it to press at least a hundred shirts, tea towels and koozies.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 2,
      "publication_date": 20170420
    },
    {
      "title": "Very heavy & sturdy but easy to use",
      "text": "I love this heat press it’s the prefect press for my small business.",
      "rating": 5.0,
      "verified": true,
      "author": "Joni Jackson",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great machine for cheap price",
      "text": "Love it! I have burned my self a little when I was in a rush and not paying attention, totally my fault. Works amazing and I don’t know how I ever lived without it. I use it daily and it’s been amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "I expanded my business with this. It doesn't cost ...",
      "text": "I expanded my business with this. It doesn't cost much. It heats up quickly. It's not too heavy to lift. I'm not sure if the temp is accurate but I just bump up the temp anyhow and the job is done.",
      "rating": 4.0,
      "verified": true,
      "author": "John A Anderson",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Iron on King!",
      "text": "This machine is awesome! Super easy to use and does the job on iron on transfers like a professional!",
      "rating": 5.0,
      "verified": true,
      "author": "J-Bell",
      "helpful_votes": 0,
      "publication_date": 20190702
    }
  ],
  "product_meta": {
    "title": "Fancierstudio DG Digital Heat Press Industrial-Quality Digital 15-by-15-Inch Sublimation T-Shirt Heat Press, Black DG Heat Press Black Blue",
    "rating": 4.5,
    "feature_bullets": [
      "Fancierstudio DG Heat Press 15 inch by 15 inch heat press. Voltage: 110V (standard US and Canada) .Power: 1400 watts, Heat Press Style: Clamp shell, Temperature Range: 0 500 degrees F; Time Range:0 to 999 seconds, Electronic time and heat control; precise time set up, Silicon gel base board, Pressure adjustable. Teflon sheet included. Silicon pad lightly glued down not fully for purpose of replacement. Color of heat press is Blue Black Model: DG15X15 BB"
    ],
    "specifications": {
      "Product Dimensions": "28.5 x 16 x 18.5 inches",
      "Item Weight": "50 pounds",
      "Manufacturer": "fancierstudio",
      "ASIN": "B01K3GBP7C",
      "Item model number": "DG15-BLK",
      "Customer Reviews": "4.5 out of 5 stars273 ratings4.5 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen"
    ],
    "price": 189.99
  }
}