{
  "website_summaries": [
    {
      "verdict": "If you're looking to stabilize Amazon Echo, Echo Plus, UE Boom or other similar models, there's no need to look further.",
      "pros": [
        "They're compact, yet sturdy",
        "The design and modern look are appealing and blend in with the rest of your home",
        "They are simple in use and in design"
      ],
      "cons": [
        "There are only a few colors to choose from"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I couldnt be happier with my purchase",
      "text": "Due to finding my Alexa on the floor a handful of times because of the family pets behaving so well while I was away, yuk-yuk, I realized I can't be the only person dealing with this and investigated a solution to the problem. Outside of velcroing my end table and the bottom of my Alexa, i came upon Wasserstein's Alexa Speaker Stand. I couldnt be happier with my purchase. Its affordable, stylish, and solves the problem of it getting knocked over. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael W.",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Beautiful Stand",
      "text": "The product is very nice and sturdy. It makes the Amazon Echo look very nice. I paid a reduced price for it which was an excellent price. I have had this on my wishlist since it was introduced to the market. The reason I did not purchase it, was due to the price. The normal price for just a stand to hold the Echo is not worth it. I do admit it is well made and better than all the others I have seen. All the Wasserstein products I have purchased have been great and they are well made. Since it's price has gone down I bought another to place my other speaker when it arrives.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaffeguy",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Safety for my Echo",
      "text": "Fits great. Looks great. Now I feel like my Echo Plus has a safety net. I have to add, that the Echo bass now has more bass being in the stand rather than just standing on the table. *** I have three of these stands now. I won't review again, should there be another purchase. I love the stands. My cats can't knock over the Echos (really big plus) The newest one was for 2nd gen Echo. 2nd gen is shorter and fatter. The Echo is about an inch taller than the stand, all buttons are accessible. It fits like a glove due to Echo gaining a chubbier waist.",
      "rating": 5.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Alexa Protected",
      "text": "I am so happy with this speaker stand for my new best friend, Alexa (aka Amazon Echo.) I decided the kitchen was the best location to keep the Echo, so I purchased this to protect her from toppling over by accidental bumps. The sturdy stand matches the black Echo and looks beautiful on my kitchen counter.",
      "rating": 5.0,
      "verified": true,
      "author": "Linschwa",
      "helpful_votes": 5,
      "publication_date": 20170115
    },
    {
      "title": "Not bad",
      "text": "Not bad. I have not actually figured out yet what the real benefit of this unit is other than maybe keeping your Echo from being knocked over easily? If that is the purpose then I think it works great. It looks ok and is simple enough. I am not sure if it is really worth the price though.",
      "rating": 3.0,
      "verified": true,
      "author": "Clarence Wittwer",
      "helpful_votes": 3,
      "publication_date": 20170418
    },
    {
      "title": "A Must for any Echo owner",
      "text": "Bought this stand when I got the Echo back in October, for a Christmas gift for my wife. Finally am able to review it since we finally opened it up and used it. The stand came well packed and looked great coming out of the box. It complements the Echo. Makes it look even better then it already dose., As far as piece of mind go's? The echo will not topple over or be banged into with this stand in place. This is a MUST. And well worth the price. Great job Wasserstein.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "A Perfect Accessory for Echo",
      "text": "I ordered two stands; one black, and one blue. They arrived on time and perfectly packaged. I simply opened them and set each echo into the stand. They both provided some stability to the tall echo without taking an excessive amount of space n the table tops. Love the look too. The blue ring in the bedroom compliments the white Echo perfectly. Very satified with both the quality and price.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Cole",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "As Advertised and More",
      "text": "Tough little stand and easy on the eyes. Easy to set up, too- just slip in the Echo and arrange the cord and plug it in. It took just a few seconds. The non-slip pads and the weight of the Echo add to the stability of the stand. It had no affect on the responsiveness of the Echo and it has eased my mind, knowing the Echo was finally protected from cats, clods, and vacuum cleaners. 420 appropriate.",
      "rating": 5.0,
      "verified": true,
      "author": "ShknBkVgn",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Added security for Echo",
      "text": "I have three Echos and I use this style stand for each of them. It offers added protection against knock-overs or being banged into. It adds balance and a wider stand area between the Echo and the wall if you place it close to a wall. I highly recommend this item for anyone who uses the Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Avalon100",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Impressed",
      "text": "This product looks exactly as what I had expected. It secures my Echo well and looks good. However, I was hoping that I could leave the battery base attached and just take the Echo out as needed. Not the case. I need to take battery base off before using the stand and during the summer when I'm mostly outside, just not use the stand.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Alexa Hub  Good to have",
      "text": "I purchased this Alexa unit to begin upgrading my electrical outlets and appliances, It works properly but I have not been able to utilize it to its full capacity since I have not upgraded enough appliance.",
      "rating": 5.0,
      "verified": true,
      "author": "kojacsmith",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Serves its Purpose!",
      "text": "Stylish and functional. My dog knocked over my Echo a couple of times when she bumped into a speaker that I had the Echo sitting on. That is no longer a problem with this stand. I think that it looks very sharp, is durable and a perfect design.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony P.",
      "helpful_votes": 2,
      "publication_date": 20161215
    },
    {
      "title": "Wonderful addition to your Echo that has great functionality!",
      "text": "A perfect blend pairing up with my Echo! Very nice design and structure and most importantly, besides looking quite well on a table, it actually works keeping Echo more stabilized and protective of our roaming and nosy cats.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W. Hecht",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Money Well Spent",
      "text": "Couldn't be happier with this little stand. Has some weight to it and wants to stick down to a smooth surface, so I can feel secure in knowing my Alexa (in her Echo) is safe and sound. Money well spent, a must have if you own an Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "David Schulz",
      "helpful_votes": 5,
      "publication_date": 20161126
    },
    {
      "title": "This is a nice stand for the Echo",
      "text": "This is a nice stand for the Echo. Item was delivered on time, it came pre-assembled so I just took it out of the box and slipped my Echo into it. Very easy. I have cats who have come close to knocking it over many times. Glad I won't have to worry about it anymore. Item has grips on the bottom and a nice weight to it. Reccomend this to anyone with an Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "sairuhxd",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "No more slipping",
      "text": "For the price this stand is great! No more worrying about knocking it off the counter or slipping around. Make sure you peel off the plastic on the non-skid feet. Fit the ECHO PLUS 1st gen perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "red",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Animal-resistant Echo stand proves its worth",
      "text": "The product description included a reference to offering protection against Echo getting knocked over by inquisitive cats. Turns out, we have one, so the stand, which is on an easily-accessible end table, proved to be an immediate success. And it looks nice, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter R. Longini",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "My Speaker Stand! The company was great to work with.",
      "text": "I love my speaker stand. Made very nicely. I only have 4 stars because my first order came damaged not due to shipping. The company resent it out and everything was just perfect. Don't hesitate to order.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise K.",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "ok but can't plug in audio cable",
      "text": "for the price it looks nice and would be fine if you never need to use the aux out jack to hook into a bigger amp/ speaker. I cut a small bit off the lower rail to allow access , no big deal.",
      "rating": 4.0,
      "verified": true,
      "author": "tavegas",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "As described",
      "text": "I bought this so it's easier to keep people's hands off my echo. Also to help protect it if it tips. It doesn't really get touched so I can't speak of quality of build. It fits the echo perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Spurlin",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "This seemed a better solution. It fits and works nicely with the ...",
      "text": "I accidently knocked over one echo and broke it. This seemed a better solution. It fits and works nicely with the surrounding. I even had compliments on it already. Thanks for coming up with a basic but useful tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert White/ Mary White",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Looks very nice!",
      "text": "I’m very pleased with this stand. My Amazon Echo sits on my kitchen counter. With a lot of Holiday visitors, I didn’t want anyone knocking over my Echo! The stand arrived quickly, it was a cinch to put together and it did its job of protecting my Echo from being knocked over.",
      "rating": 5.0,
      "verified": true,
      "author": "Lingrif",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "The stand is very attractive and arrived exactly as described ...",
      "text": "The stand is very attractive and arrived exactly as described. It does the job and looks very stylish sitting on the kitchen counter. I ordered it to raise my Echo off of the counter and offer it some protection and it does that. I would not hesitate purchasing this product again if I ever buy another Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Martins",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Alexa looking good!",
      "text": "Other similar products out there, but this is aesthetically the best. Acrylic scratches easy and I was prickly in my inspection out of the box. No blemishes. High quality item at a reasonable price. Certainly does its job in keeping Alexa on her feet and looking pretty!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam's Dad",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Classy and Practical",
      "text": "This stand is as close to perfection as one can get. It arrive pre-assembled and ready to use. Adds a lot of class to with my Echo Plus!",
      "rating": 5.0,
      "verified": true,
      "author": "W. H. Fisher",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Quality Echo Stand!",
      "text": "My echo stand arrived in two days and was packaged to protect my purchase. I t is made of a quality plastic and looks great, as it belongs to/with my echo. I purchase to protect my echo from accidental bumps and falls, it is doing it's job beautifully on both counts.",
      "rating": 5.0,
      "verified": true,
      "author": "CJB",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Not a Snug Fit",
      "text": "This is a solid speaker stand that gets the job done. My only issue is that the opening for the speaker is much larger than my UE Boom2 speaker. It's not a snug fit.",
      "rating": 4.0,
      "verified": true,
      "author": "John W",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "The product is just OK, Does what it is ...",
      "text": "The product is just OK, Does what it is supposed to do. The communication with this company however, is quite deficient and would only deserve 1 star.",
      "rating": 3.0,
      "verified": true,
      "author": "PG",
      "helpful_votes": 2,
      "publication_date": 20170126
    },
    {
      "title": "Great purchase",
      "text": "I wasn't sure if I really needed this product but I am so glad I purchased it. Stand is sturdy and won't let Echo tip over (or my cat knock it off the shelf. ) Design is sleek and modern but will fit any decor. Arrived on time, well packaged. Highly recommend! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Abby M.",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Gift",
      "text": "this is a gift. I did not use, therefore I can\"t rate this product. I did see the product looks good and amazon echo fits perfect",
      "rating": 5.0,
      "verified": true,
      "author": "togi",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Classy, protective, aesthetic",
      "text": "Great stand for Alexa. Looks classy and protects Alexa from getting knocked over. Bought one for each Alexa!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Sipes",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Perfect Product! At last a device that was ready ...",
      "text": "Perfect Product ! At last a device that was ready to use and provided protection for my ECHO from my cat. Great transaction and thoughtful design.",
      "rating": 5.0,
      "verified": true,
      "author": "Selwyn S. Elledge",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Not bulky or an eye soar but just the right size and most importantly it is sturdy and protective from knockovers",
      "text": "I just received my echo stand and it was exactly the way I wanted it to be! Not bulky or an eye soar but just the right size and most importantly it is sturdy and protective from knockovers!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ellen Emiola",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "It's OK",
      "text": "I bought this for looks only and it serves the purpose. The Echo does not require any support. Rather pricey but worth the appearence",
      "rating": 4.0,
      "verified": true,
      "author": "Ray Stanley",
      "helpful_votes": 2,
      "publication_date": 20161114
    },
    {
      "title": "Safe Sturdy and Attractive",
      "text": "Lovely piece of art as well as a functional stand for my Echo. It was easy to install echo. It seems to be very stable and safe. I love it and have 2 for my devices placed on different floors in my abode. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Rider",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "I think it was the PERFECT add on",
      "text": "If you think that the Echo might get knocked over then you really need this stand. It matches my contemporary décor perfectly and it makes the Echo Stand out! I think it was the PERFECT add on , thxs everyone, great job!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom C.",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "A MUST HAVE FOR YOUR ECHO",
      "text": "The speaker stand provides extra stability plus an aesthetic quality to the Echo. The fit is perfect and the design makes the unit a conversation piece. Alexa will be happy you bought the stand.",
      "rating": 5.0,
      "verified": true,
      "author": "rdail",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Excellent Echo Stand!",
      "text": "This is a great stand! Very stable for my Echo. Sound not impeded at all. With kids and a cat, I didn’t want my Echo taking a tumble. This tasteful stand fits the bill!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen H. Jett",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Love It",
      "text": "Looks great and works great for stability for my Echo 2nd Generation speaker all at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Deuce",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "VERY STYLISH",
      "text": "I got the Echo & stand for my daughter & son-in-law for Christmas. They absolutely love both. The stand is very stylish & they have it right on their breakfast bar so they can access Alexa whenever...",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne happily living in the sunshine state",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "These do not fit the gen2 pluse",
      "text": "This does not fit the gen2 plus. Got two for gifts have send them back",
      "rating": 1.0,
      "verified": true,
      "author": "Sean D",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Great stand for the price",
      "text": "Love it it looks great Now I don’t have to be afraid that it will tip over. The stand is not made of cheap plastic it is well made",
      "rating": 5.0,
      "verified": true,
      "author": "I Pena",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Perffct solution to prevent tipping.",
      "text": "This is a perfect solution for preventing the Echo fro being knocked over. Not only does it look nice but it did not require any assembly. Also there are slots for the cord. Price is right.",
      "rating": 5.0,
      "verified": true,
      "author": "novice",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Does not fit Echo Plus",
      "text": "The one I received does NOT fit my Echo Plus. The diameter of the Plus is too large.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Stable stand",
      "text": "Impressive stand/holder for the Echo. Appears to be a good buy for the quality received.",
      "rating": 5.0,
      "verified": true,
      "author": "The Scamper",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Like the design and look of it though",
      "text": "It really stabilized the older version of the Echo which I had inadvertently knocked over several times. Not so much needed for the newer version which is heavier. Like the design and look of it though.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "Would buy again and highly recommend...",
      "text": "So many to choose from and I chose this one. I am glad I did. It is a really nice looking stand and very well made.No screw holes on top, beautiful finish. The slots for the cord is great...",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Nice Stand",
      "text": "This stand is well made and adds additional stability/protection for our Alexa.",
      "rating": 5.0,
      "verified": true,
      "author": "Ldj",
      "helpful_votes": 2,
      "publication_date": 20170130
    },
    {
      "title": "I would recommend this speaker to anyone who owns an Amazon Echo ...",
      "text": "This will be my second speaker stand that I have purchased from this company. The reason why I purchased a stand for my Echo is to keep it clean when I move it to a different location in my home. Yes, I would recommend this speaker to anyone who owns an Amazon Echo device.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Good product",
      "text": "Outstanding product, just what was needed to prevent t product from getting knocked over.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise Holmes",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Five Stars",
      "text": "These are great, already have two and bought two more for gifts..",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Really give an Art Deco look to the Echo. ...",
      "text": "Really give an Art Deco look to the Echo. I feel a bit more confident that it won't get knocked over, and keeps it a bit safer.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne Dooley",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Best looking echo stand",
      "text": "Perfect echo stand. Looks great and really fits not like other supposedly echo stands",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Giorlando",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "I love this stand!",
      "text": "I love the stand and will be ordering more since I have several Echo's. I have the black and it is so stylish!",
      "rating": 5.0,
      "verified": true,
      "author": "CooperSam",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Perfect Fit",
      "text": "This was a perfect fit for my new 2nd gen Echo. It's very stable.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott S.",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Really like the looks...",
      "text": "Fits my echo plus like a glove and protects it as well...Really worth the money...",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Bilczo",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "A classy stand for Alexa....",
      "text": "So happy I ordered this stand for my office desk....It completes the look for my Amazon Echo.....",
      "rating": 5.0,
      "verified": true,
      "author": "JanMan",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "keeps off counter",
      "text": "i like that it keeps off counter and is stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "CAROLE W.",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "I don't want to give this product a bad review because it does a good job if you ...",
      "text": "I don't want to give this product a bad review because it does a good job if you are only inserting the Echo. The problem I had was that I needed the Stand to fit with the Battery Base added to the Echo. It does not fit with Battery Base. I called and e-mailed Customer Service before buying the Stand and they said it should fit, but it did not.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Connelly",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Stand for the Amazon echo",
      "text": "I used it for my echo and it fits very good and it arrived on time",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "The echo fit perfect",
      "text": "The echo fit perfectly and it adds much needed stability for it",
      "rating": 5.0,
      "verified": true,
      "author": "JerryH",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Nice Stand.",
      "text": "Works well, looks great. No scratches or cracks in any of the plastic, and my Echo still responds the same. Will buy another one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Nieski",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Love it",
      "text": "Product is exactly as shown. Fits echo perfectly and has a nice weighted feel to it. Make echo very sturdy and enhances its look . Very happy with purchase",
      "rating": 5.0,
      "verified": true,
      "author": "cheryl l. randles",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Attractive and useful as well.",
      "text": "Attractive stand for Amazon Echo. It looks like it will give the Echo some additional stability on our den end table. I am glad I added it to my order.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Brock",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Good purchase",
      "text": "Product is exactly as described. I am a Prime member so received it in two days. Makes the Amazon Echo stable on the side table. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Berecca",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Wobbly and dusty",
      "text": "Out of the box was dusty with some material. I was going to look the other way then noticed that the top edges in the back were not alligned. Worst of all, it wobbled! thus making Alexa even less secure. Currently debating if should test luck with trying to purchase a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 2,
      "publication_date": 20170106
    },
    {
      "title": "Nice.",
      "text": "Solidly built and the echo fits right it. Definitely stabilizes it and makes it less likely to get knocked off a table or tipped.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Haft",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Most reliable company",
      "text": "The stand looks very nice and very sturdy. A very nice company to do business with.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry Isakoff",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Perfect design",
      "text": "Excellent. Particularly like the slots so that you don't have to unplug and re-plug the power connector. Works great. Looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "jwooding",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "The perfect compliment",
      "text": "I purchased this speaker stand as a gift for my brother's Amazon Echo. I haven't given it to him yet, but tried it out \"for size\" on mine. It's very nice looking and should be an excellent stablizing stand. The perfect compliment to an already great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori D.",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "I really like this stand for my Echo",
      "text": "I really like this stand for my Echo. It is very sturdy and will keep Alexa from being knocked over on the counter. Just what I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Stable and Attractive Table Stand",
      "text": "Excellent stability and good accommodation for the power cord. A good and attractive support stand for the Amazon Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Lord of Sipon",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "... bought three for our echo devices and these look great.",
      "text": "We bought three for our echo devices and these look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Iamkeithyb",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Love My Echo Speaker Stand",
      "text": "Love the look of my Amazon Echo speaker stand. It obviously adds stability to Amazon Echo, but is also very attractive looking and adds a certain flair to the room. I definitely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert L Singleton Jr",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Five Stars",
      "text": "It’s a great stand Alexa fits perfectly. I bought two.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen M.",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Great Stand",
      "text": "Excellent stand, can’t go wrong buying this. If the low price scares you into thinking it’s cheap it’s not.",
      "rating": 5.0,
      "verified": true,
      "author": "JCW",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Very nice quality",
      "text": "Very nice stand. It's looks more expensive than what I actually paid. Love that when it happens",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky Charm",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Sturdy stand.",
      "text": "Very nice stand to keep your Alexa stable on the table. Looks very cool also.",
      "rating": 5.0,
      "verified": true,
      "author": "Gil",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "I like this one better than my first purchase",
      "text": "This is my second purchase of an Echo stand. I like this one better than my first purchase. The price was less & it`s a lot sleeker looking than the one I purchased from another company. Good buy!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Sewell",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Absolutely perfect. Inserted my Echo without having to unplug the ...",
      "text": "Absolutely perfect. Inserted my Echo without having to unplug the unit. Adds a lot more stability to my Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Z",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "The speaker stand is very sturdy and good looking",
      "text": "The speaker stand is very sturdy and good looking. I would definitely recommend this stand to anyone who wants to spruce up their Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "JayG",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Buy it.",
      "text": "Love it. Looks great no matter where I put it. The Echo and the battery fit great. Makes it easier to move the Echo too",
      "rating": 5.0,
      "verified": true,
      "author": "MattinSpfld",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Five Stars",
      "text": "Fast service, pleasantly surprised at the quality was worried would look cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "Kit Kat",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Great Stand for a Echo",
      "text": "The stand acts as a great holster for my Echo which has nearly tipped over before. I like the stand for a couple reasons, 1 it acts as a holder so that it doesn't tip over, and 2. it cushions the bottom just a bit which is quite useful in my house since echo stays on my kitchen bar. Great product for the short duration that I've had it!",
      "rating": 5.0,
      "verified": true,
      "author": "John Reece",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Good looking contemporary piece",
      "text": "Good looking contemporary piece. I got it for my Son for Christmas to go with The Alexis Google speaker",
      "rating": 5.0,
      "verified": true,
      "author": "2Di4amazon",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "The stand is great in protecting your Echo",
      "text": "The stand is great in protecting your Echo. It looks great and best of all, the wife loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Walter",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Securing Echo to a Countertop.",
      "text": "Well constructed and reasonably priced. My application is to secure the Amazon Echo to a counter-top on my sailboat. Would be nice to have a double-sided pad pre-cut for the bottom, but a few strips of 3M Commander and it's held firmly in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Compliments the Echo perfectly.",
      "text": "Sleek and minimal in design. I love the way it looks on my desk as it matches perfectly with the decor of the room. It's sturdy and certainly balances the Echo. I would rate it higher if I could.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Five Stars",
      "text": "Looks nice, stabilizes the Echo and has no interference with sound.",
      "rating": 5.0,
      "verified": true,
      "author": "June",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Great product, looks are great",
      "text": "Great product, looks are great, it is a wonderful addition to the Echo. It enhances it design look and provides a very professional look.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Yes arrived in fast time works great, now I feel my Alexa is safer thank ...",
      "text": "Yes arrived in fast time works great, now I feel my Alexa is safer thank you Jim",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Ray",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Very well made and my Echo fits perfectly. The ...",
      "text": "Very well made and my Echo fits perfectly. The product shipped and arrived on time. Would purchase again if I bought one as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Lea67",
      "helpful_votes": 2,
      "publication_date": 20161021
    },
    {
      "title": "Perfect accessory for my Echo",
      "text": "The stand is sleek and fits the Echo perfectly. Would recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Annette Cox",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "All I could ask for!",
      "text": "Such a nice looking stand for our echo. Now I don't have to worry about our cats tipping it over.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Fisher",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Very cool",
      "text": "It looks very nice, it adds to the device in a very modern way",
      "rating": 5.0,
      "verified": true,
      "author": "Jason MP",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Good idea",
      "text": "Works well to steady the echo and seems well made. I received it fast too!",
      "rating": 4.0,
      "verified": true,
      "author": "C. Chesnut",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Looks amazing",
      "text": "Love it, it's perfect and classy looking. It also gave me peace of mind knowing it will be harder to knock over and damage my echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramg66",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Highly recommend this item to accent your device",
      "text": "Just received this stand to hold my new Echo. It’s very solid and elegant. Highly recommend this item to accent your device.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisa",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Works and looks as advertised",
      "text": "Came on time. Does what it's supposed to. I'm not nervous about knocking over Echo anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "I really enjoy the look of this Echo Stand",
      "text": "I really enjoy the look of this Echo Stand. Very stylish and very well built. The broad base assures me that my Echo won't be easily knocked over. Ithe is well worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Curly",
      "helpful_votes": 0,
      "publication_date": 20170107
    }
  ],
  "product_meta": {
    "title": "Speaker Stand for Amazon Echo, Echo Plus, UE Boom and Other Models - Protect and Stabilize Alexa by Wasserstein (Black)",
    "rating": 4.7,
    "specifications": {
      "Package Dimensions": "6.7 x 5.8 x 5.6 inches",
      "Item Weight": "3.52 ounces",
      "Manufacturer": "SUMLIB Glacie",
      "ASIN": "B01K1O7UH0",
      "Item model number": "LYSB01K1O7UH0-ELECTRNCS",
      "Customer Reviews": "4.7 out of 5 stars702 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#910 in Speaker Mounts",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Accessories & Supplies",
      "Mounts",
      "Home & Kitchen",
      "Speaker Mounts",
      "Electronics"
    ],
    "price": ""
  }
}