{
  "website_summaries": [
    {
      "verdict": "This refrigerator water filter consistently removes chlorine, chemicals and other water contaminants.",
      "pros": [
        "Filter is both NSF- and NSFI- certified to ensure ongoing removal of harmful water contaminants",
        "A single filter will keep up to 400 gallons of water clean",
        "Compatible with a wide range of refrigerators",
        "Designed for tool-free installation"
      ],
      "cons": [
        "Sometimes causes water to leak from a refrigerator",
        "May result in water that has a musty taste"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not an authorized GE part.  Did not work.",
      "text": "The filter is the correct one for the GE refrigerator model, being identified as MWF. Nonetheless, it did not properly insert into the holder following the directions in the manufacturer's instruction manual. Now, the water dispenser has stopped working. I have placed another order but this time directly through GE, inasmuch as the PrimeLine is not considered an authorized part. Using GE as part of the product name is misleading, I believe. '",
      "rating": 1.0,
      "verified": true,
      "author": "Docrob",
      "helpful_votes": 106,
      "publication_date": 20180227
    },
    {
      "title": "Filter says 300 Gallons, not 400 Gallons as stated in the listing description",
      "text": "I just recently installed the filter, so I can't review about how it performs, however, the reason I selected this over some of the others was that the listing states \"each water filter can purify at least 400 gallons of water, so you won’t have to replace them often! \" I was disappointed when I received them and on the filter it states that it filters 300 gallons. I could have selected a number of other filters that stated 300 gallons/filter, and many of them were less money.",
      "rating": 3.0,
      "verified": true,
      "author": "Catherine Wagner",
      "helpful_votes": 104,
      "publication_date": 20180917
    },
    {
      "title": "First cartridge only lasted two months",
      "text": "GE brand cartridges are expensive but they typically last for almost a year so they are worth every penny vs the generic brands. As is our habit, when the last GE cartridge was installed, we ordered another set of GE MWF water filters but what we didn't realize was the cartridges that displayed were from Pureline not GE. It wasn't until the last GE filter finally ran out and we installed the first Purline filter that we realized we had ordered the wrong product because the Pureline cartridge only lasted for two months. A second Pureline filter has been installed - we are waiting to see how long this one lasts.",
      "rating": 1.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 100,
      "publication_date": 20180922
    },
    {
      "title": "We are perfectly happy with them as far as installation",
      "text": "We are perfectly happy with them as far as installation. It went right in just like the brand name and it seems to be working fine with no weird taste or anything. I don’t really have a way of knowing how well it’s filtering the water so we’ll have to trust the certification process on that, but I did with the other filters too! Long story short, it is the same as the brand name ones we have been using but much cheaper. Worth it for having the same thing for less! If you are in doubt, like I was at first, try just one to test it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Clements",
      "helpful_votes": 39,
      "publication_date": 20170314
    },
    {
      "title": "RATTLING WATER LINE",
      "text": "These filters fit my fridge perfectly, but did not work at all. After installing and running the water a few minutes my water line started rattling extremely loud. I thought it was going to go away but I was wrong. I tried a second filter from the 3-pack, but the problem continued. I checked my connection on the fridge and water line connection in the basement, but all was in order. Decided to order the original replacement from GE(which worked perfectly in the past) and installed that filter, and the rattling is gone. Moving forward I will be happy to pay a little more and have clean tasting water and no room rattling water line.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony T",
      "helpful_votes": 90,
      "publication_date": 20170701
    },
    {
      "title": "Good filter - No leaking",
      "text": "I get so many requests for reviews that I typically just delete them. I thought I would take a second to write a word or two for this one, though. In the past, I have tried several off-brand versions of this filter and they invariably leak. This one doesn't, it was a good price, and it performs as expected. That's a win in my book!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim T.",
      "helpful_votes": 33,
      "publication_date": 20170303
    },
    {
      "title": "Defect? Leaked water everywhere",
      "text": "Never had issue with my fridge/filter for years. Tried this cheaper replacement for the chance to save some money. Item did not work. Installed per instructions and made sure it was a \"replacement\" for my model. It instantly leaked and water came pouring out bottom of my fridge. Would not try again just buck up and pay for the real thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 91,
      "publication_date": 20170920
    },
    {
      "title": "Very Happy",
      "text": "The filters shipped promptly and arrived very quickly. I removed the old filter and primed the new filter with some water before installing it. Putting the new filter in the fridge was very easy, it went in without a problem. I ran the water as suggested in the instructions. It did take a little bit for the air to clear out but once that cleared through everything works like a charm. I reset the filter counter. All in all I'm very happy with the filters and for the money can't beat the value over the manufacturer replacements.",
      "rating": 5.0,
      "verified": true,
      "author": "FL-Eagle",
      "helpful_votes": 3,
      "publication_date": 20190801
    },
    {
      "title": "Best Replacement Filter Value",
      "text": "Water filters - we have to have them if we want good tasting healthy water, right? When I bought my GE refrigerator I didn't realize just how much these filters would cost. A three-pack from GE is $156 and change, plus taxes. For a third of the price (just under $44) I thought this would be a good alternative on Amazon. I've noticed virtually no difference in water taste or quality, pH levels, or mineral content. This is especially important because we have folks in my house that have chlorine sensitivity issues, and because I have issues with kidney stones that high mineral content can aggravate. This was a great buy for us!",
      "rating": 4.0,
      "verified": true,
      "author": "Martin G.",
      "helpful_votes": 3,
      "publication_date": 20191005
    },
    {
      "title": "Soak. Before. Install. (Check your model numbers)",
      "text": "Edit after 10 days: Does not replace GE MWF smartwater filter for refrigerator model number GHSS6HGDCCSS. After dispensing approx. 2 cups of water the fridge makes an awful noise, as if the filter can't move water fast enough through it. For the love of all that is holy, soak before install. I wish it was in bigger font somewhere because the one installing it didn't even see that recommendation, but once soaked works perfectly fine. Filters great with no leaks. 👍 We just had a minor issue with user error 😅",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "So glad I saw these and purchased all 3 for less ...",
      "text": "So glad I saw these and purchased all 3 for less than the cost of one OEM filter. Installed easily in seconds and after initial spurting (they tell you about this) this bad boy is working great! Water flow is back up to speed and good taste is back! No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry E. Katcher",
      "helpful_votes": 10,
      "publication_date": 20170504
    },
    {
      "title": "NOT 100% compatible with MWF shape",
      "text": "I tried to replace a GE MWF filter with this cheaper off brand. The new filters would not fit the fridge's receiver receptacle. After studying the genuine filter and the off brand there are clearly differences in the shape of the connector. Perhaps it will work in some fridges, but not mine. I returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "Marcel",
      "helpful_votes": 2,
      "publication_date": 20200616
    },
    {
      "title": "Almost worked for my GE",
      "text": "I first installed it and water didn't come out. I read some other comments which started that water may need to rest in filter for 15 minutes before install (instructions not included). This worked, until it stopped working again, less that 30 days later. I just installed second one, still not working. I guess I'll try the third but I guess I'll try the expensive GE brand or another brand in future.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190712
    },
    {
      "title": "Filters do not remove chlorine taste!",
      "text": "Like other reviewers, I wanted to save money. Well, big mistake, I'm about to throw out the remaining two filters and order a different brand. We have used both GE and other brands with out complaint. Sorry, I can't remember the other brand names. We had been enjoying the water from our GE refrigerator for 7 years but with these filers the chlorine taste s awful. Save your money. UPDATE: I installed the second filter, wondering if I would see a different outcome. Amazingly the chlorine taste waste was gone and THE WATER IS NOW YELLOW!!! Buy this product at your own risk....",
      "rating": 1.0,
      "verified": true,
      "author": "RD22",
      "helpful_votes": 6,
      "publication_date": 20180222
    },
    {
      "title": "Does not fit my fridge",
      "text": "I bought these in 2018, they worked fine. Bought these in March 2020 (re-ordered from 2018) and they will not fit. The design is different, and they will not work. I even validated my model # and says these work. Its not May and time to change the filter and these do not work. If I can return them, I guess I toss them. Bait in switch and this is the first negative review I have written on Amazon....ever.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Williamson",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Defective water filters",
      "text": "2 out of 3 of these filters were either defective or damaged my refrigerator. My fridge was working fine with the first And when I switched it out to the second one is started making these loud noises and the water was not coming out the regular force that it comes out. I then installed the last one and it made even louder noise and the water was trickling out of the fridge. I would love my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca ",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Update to My Previous Review - Thrilled To Find These",
      "text": "Made the mistake of trying a different kind at a cheaper price as the Pureline had gone up in cost. I got what I paid for. Big mistake. Water tasted odd. I returned item and immediately ordered the Pureline. As I was out of filters, I looked forward to receiving. Was absolutely thrilled to get them the next day! And I don't have prime, nor did I pay for extra fast shipment. I'll stick with these in the future. Very satisfied. === Filter fits my GE MWF SmartWater refrigerator perfectly. Easy to install. Water looks clear and tastes fresh. Compared to the GE brand it's a steal. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Lusk",
      "helpful_votes": 3,
      "publication_date": 20170820
    },
    {
      "title": "THIS ITEM HAS CHANGED since December 2019",
      "text": "I have been ordering these for 2-1/2 years. The design changed and is not mentioned in the listing. Might this work? Yeah, it might - but since these are now 60.00 - I'm not chancing it. Back they go. Previous item PL-100. These are labeled as PL-100-S - replacement for PL-100. Very disappointed in this company and shall look elsewhere for a reasonable priced alternative.",
      "rating": 1.0,
      "verified": true,
      "author": "Diane M",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great deal.  Highly recommended",
      "text": "Edit: I just installed my second one and it was perfect. I highly recommend these. I have the MWF kind. Water taste great the entire time. The GE brand starts to taste bad when it’s time to change. Not these. They fit. But harder to install the. The GE Brand. I will for sure buy again though. Great quality. Just have to work to get it in. It’s worth it. The water taste better then with the GE one.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi ",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Does not replace all GE MWF filters!!!",
      "text": "Will NOT fit all models that utilize GE MWF filters!!! I did not think to check my individual refrigerator model # before ordering as I already have the GE MWF filter installed and this replacement does not fit my GSE25GSHJCSS. I ordered months ago but just now needed to replace the filter so my return window is closed.",
      "rating": 1.0,
      "verified": true,
      "author": "LRinMI",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Safety & QC Failure!",
      "text": "When I received the package one of the filters was missing the safety seal and had been placed in plastic sandwich baggy. For safety I had to assume the filter was contaminated and unsafe. Completely unacceptable and I will not do business with any company whose quality control could fail so miserably.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 16,
      "publication_date": 20170730
    },
    {
      "title": "DO NOT BUY. They don't work at all!",
      "text": "These are absolutely horrible. We had the name brand filters and never any issues. Based on the amazing reviews I purchased this product since they're so much less expensive. It makes a horrendous noise and there's no water coming out. We tried for an hour to get this to work, let is sit, tried again. Nothing. It is correctly installed. Returning item and super disappointed. Will buy the name brand ones again. You get what you pay for...",
      "rating": 1.0,
      "verified": true,
      "author": "ceva",
      "helpful_votes": 2,
      "publication_date": 20191107
    },
    {
      "title": "Great value, although it did decrease my water pressure.",
      "text": "I had a little bit of trouble inserting it in my refrigerator. It did decrease the water pressure some. It does the job and the water taste better than without it.Update: After using one,I had to switch to another one and finally even the third filterall within a week.These are NOT compatible with my GE smart water filter system.I am disapointed that they advertised that they were. I will NOT purchase again. I ended up wasting time making my own ice cubes until the correct filters arrived.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Great savings over Home Depot prices!",
      "text": "Odered this with my Amazon app while standing in Home Depot. I had the item in 2 days. My husband installed it in less than a minute. Water is running faster with more pressure, tastes better too! Glad I decided to price check before purchasing that day. I'll buy all my filters through you now. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 3,
      "publication_date": 20181102
    },
    {
      "title": "Not as described.",
      "text": "This was my second order of 3 PureLine Refrigerator Water Filters # PL-100 which are advertised to fit the GE MWF filters. The cartridges on the filters are significantly different and larger than the previous PureLine Refrigerator Water Filters # PL-100 received from Pureline. The filters no longer fit into the cartridge holder of my GE Refrigerator, Model No: GSE25HMHJHES",
      "rating": 1.0,
      "verified": true,
      "author": "Regina M. Higgins",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Value for money, but at a cost!",
      "text": "Best part - value for money. Getting three of theses at the cost of one OEM is definitely something you can’t beat. However, installation was a little rough. Unlike the OEM filter where there an arrow indicating how the filter should be inserted, this one doesnt and it may take a while to figure out. It took a while but once it went in, it was pretty snug, no leak! The first glass of water that came out from the fridge dispense was black, probably from the charcoal powder inside. I haven’t had issue since.",
      "rating": 3.0,
      "verified": true,
      "author": "rd_redevil",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Water Made Easy",
      "text": "This is my 2nd time purchasing this set of GE MWF water filters. It is the same brand I have been purchasing at the big boxes stores, but at a reduced price for a pack of 3 rather than buying them individually each time. Are there cheaper replacement filters available online/amazon? Yes. Do I feel the need to switch to another brand of water filter? No. These have performed consistently well, last the fully advertised shelf-life, and install with no issues. I am happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "magtfplanner",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Works as advertised and worth the money",
      "text": "I've had this water filter installed for a week and it works as advertised. I had reservatations due to the negative comments but the overwhelming positive reviews influenced my decision to buy. The installation wasn't as easy as the GE filter (which screwed on easily due to the longer tabs/lip) but after aligning the tabs and screwing it in as I pushed up I got it on after a couple of tries. You will know when it is on correctly installed as you will hear water flowing as the refrigerator fills the filter and pressurizes the system. The water tastes great and is nice and clear. Will buy this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "MalRaine",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Not an MWF compatible filter.",
      "text": "This is supposed to be an MWF replacement for my GE refrigerator. It’s not. The filter is larger than an MWF. I had to take out a shelf in my refrigerator to see if it would even fit. I’ve never had to do this before. The filter wouldn’t go in. Don’t buy it. I have no negative comment about the company I purchased the filter from. Just the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeannine D",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great value but one didn't work",
      "text": "This product looks just like the GE MWF filter and on the box said it's compatible. You get three for less than what one GE filter costs! Great value. So far the one I installed works great. My one complaint is that one of the three filters I received did not fit and would not install properly.. not sure if it is a fault in the product as the second one in the pack went in easily. Hopefully the third works well when I need to replace the one I have",
      "rating": 3.0,
      "verified": true,
      "author": "Krystin T.",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Water tasts bad",
      "text": "I like ice water throughout the day however this filter doesn't make my water drinkable. I replaced the existing filter in my recently purchased house, ran the required water through the filter and dumped the ice. The water had a soapy taste before the new filter and after. Even after two months and after dumping the ice again there is no change. I solved the problem by buying a water pitcher with a filter which produces good tasting water. I miss my ice.",
      "rating": 2.0,
      "verified": true,
      "author": "R. W. Wilson",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "NOT AS ADVERTISED!",
      "text": "DON’T BUY! If I could give a “zero star” review I would! This filter is listed as an MWF replacement compatible with GE refrigerators. It absolutely isn’t compatible. It doesn’t fit even though it LOOKS like it should. The small openings in the top are slightly different than the MWF filter I took out. That filter twisted back into place easily when I couldn’t get the new filter to work... so NOT user error!",
      "rating": 1.0,
      "verified": true,
      "author": "Prickleypear",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "I'll always buy this filter in the future....",
      "text": "These filters are just as promised. I was skeptical about the price, but once they arrived and I put one in they work great. Just as well as the far more expensive GE filter. I will always buy this brand in the future. I'd have to be clinically insane not to...... The ice is perfectly clear now and I think it may be more clear than when we used the GE brand. My wife says it is.....",
      "rating": 5.0,
      "verified": true,
      "author": "LarryG",
      "helpful_votes": 4,
      "publication_date": 20171003
    },
    {
      "title": "Disappointed in the design change.",
      "text": "I purchased the GE MWF replacement filter 3 pack last year and it worked fine. Therefore I went to the original purchase and selected reorder. For some reason the mounting design was different. I tried to install the replacement and it was impossible to install. I would suggest checking your refrigerator model number against their listing of compatible models. I have to go to Lowe’s and pay the price for one that I used to pay for three.",
      "rating": 3.0,
      "verified": true,
      "author": "Profpfk",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Changed? No longer fits, returned",
      "text": "Great value if they fit. I ordered this exact one before but now they changed the too and it doesn’t fit my fridge. Useless. Sent them back. Went on official GE website and ordered from them. More expensive but I know what I am getting. And it will be consistent too.",
      "rating": 1.0,
      "verified": true,
      "author": "ang mora",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "It did not work with my GE refrigerator",
      "text": "I am not sure about other model, but it did not work with cmy refrigerator. It made noise when water flowed, and water was not flowing smoothly. I tried reinstalling several times and got the same result. I returned these. My refrigerator model is DSHS6VGBBCSS",
      "rating": 1.0,
      "verified": true,
      "author": "W. Wang",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Works just as well as the origninal",
      "text": "I bought 2 years ago. They worked great. I then purchased for a friend for a different model and hers worked as well as the original. So this year I purchased the 3 pack. Generic product works as well at half the price or less. No hassle ordering on Amazon prime with free shipping. I have told friends and they have purchased on their own.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Rolston",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Did not fit and caused a problem",
      "text": "Even though it was supposed to be an “exact replacement”, it was not. We had to get a repair man out to fix the problem it caused. GE website indicated that factory original were no longer available, but the number was just changed. Get an original or a bypass.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Nelson",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Total Junk",
      "text": "We bought these filters as they were 3 for 1 and always used the more expensive GE water filters for our GE Profile Refrigerator. They must use cheap Chinese materials to manufacture these filters as they are totally useless. They made the tap water taste worse than out of the tap. All three of our kids even noticed. These filters don't work. We'll gladly pay a little more for quality filters where we know at least the water were drinking is healthy for us.",
      "rating": 1.0,
      "verified": true,
      "author": "Gregory Duclos",
      "helpful_votes": 2,
      "publication_date": 20190421
    },
    {
      "title": "Overpriced  product",
      "text": "I used to buy those 3 filters package 9 month ago for 37 $ and it was more expensive from other non USA products but it was ok with me cause it is made in USA now during this pandemic they raised the price to 60 $ without any reason I was expecting our country companies to support there people in this pandemic situation by reducing the price but I was surprised they almost double it without reason . Now it become over over priced and I will go with non USA products . Thank you for not supporting us in this dayes",
      "rating": 1.0,
      "verified": true,
      "author": "Mohamed Ismail ",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Does not work.",
      "text": "This would not work in my GE refrigerator that uses GE MWF filter. It looks like it should but my fridge will not pull it to do the automatic half turn and the water will not dispense. I put the GE filter back in and worked ai it's not the refrigerator malfunctioning. Cannot just mail back either. Have to hang around to have UPS come pick up or drive it to a UPS drop off location which is not handy as I live in a rural community.",
      "rating": 1.0,
      "verified": true,
      "author": "Beverly",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Bad Product!!!",
      "text": "Product is bad, not only did it not fit after I checked my Refrigerator Model and it told me that it was compatible with my Refrigerator, but now after trying to install it, it has damaged my Water Filter Assembly Housing, this filter has caused my housing to have a continuous leak. I have had to shut to water off going to the refrigerator and I now have to pay to repair and replace the Filter Assembly Housing. After further research, from today's damage by this filter, it seems as this filter is prone to causing this problem due to its engineering. It does not fit well with GE models. Will never buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "I have to admit that the instructions were right on ...",
      "text": "I have to admit that the instructions were right on. After reading them, it was really simple to uninstall the old filter and install the new filter. If you well read the instructions you shouldn't have any problem. By the way, the instructions are under the three filters.....",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory Scheytt",
      "helpful_votes": 3,
      "publication_date": 20180512
    },
    {
      "title": "Broke my refrigerator!",
      "text": "Zero stars if I could have. It does not replace GE MWF filters!!!! It would not fit the nozzle and instead broke my water filtration system sending water spraying out and flooding my fridge and kitchen floor, leaving my water filtration system n my refrigerator completely broken and useless. Don't buy these!",
      "rating": 1.0,
      "verified": true,
      "author": "ac",
      "helpful_votes": 2,
      "publication_date": 20200410
    },
    {
      "title": "NOT GE compatible - damaged refrigerator",
      "text": "Not GE compatible, will damage GE refrigerators. Purchased, installed three repair trips later with each repairman commenting on. The lack of compatibility with GE refrigerators made me re-think generic parts. Adhere to appropriate brand official parts for warranty validity and to lower margins ntenace & repair costs.",
      "rating": 1.0,
      "verified": true,
      "author": "Rex Osborn",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "SmartWater - GE MWF Compatible Replacement Refrigerator Water Filter",
      "text": "Filters arrived as promised. I replaced the old one with the compatible water filter. Installation went well, no drips or leaks. I ran water from the water dispenser for a few minutes, until I was satisfied the water was clear. There is no discernable difference compared to the OEM GE filter that came with the refrigerator. This appears to be a good value. The various certifications provided me the confidence that this filter has been properly tested to meet the standards for water purity.",
      "rating": 5.0,
      "verified": true,
      "author": "UsuallyRight",
      "helpful_votes": 2,
      "publication_date": 20170726
    },
    {
      "title": "Good Value - Fits Perfectly",
      "text": "I just received my first order of these filters. I was a bit anxious when I opened the first filter because the plastic collar on the top of the replacement filter looks significantly different than the OEM filter, but I was very happy that the filter fit perfectly into the refrigerator (\"insert and twist\") and seems to be functioning well after 24 hours. Good service and excellent price compared to OEM filters. I reserve the 5th star to give at a later date if the service life and durability are comparable to the OEM filters.",
      "rating": 4.0,
      "verified": true,
      "author": "McReviewer",
      "helpful_votes": 11,
      "publication_date": 20170607
    },
    {
      "title": "This filter is NOT FOR ALL GE Refridgerators",
      "text": "They look the exact same, but when I got my ordered I could twist the new filter into place it didn't work. I could twist it into place, but it wasn't secure and easily pulled knocked out if lightly bumped. There's no true seal with these filters that the old one does or even the temporary plug does. Your best bet is getting new filters directly from GE and not get generic brands. And yes, my old filters were GE MWF filters. The stickers on these new filters do not indicate they are MWF compatible.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great Replacement Filter",
      "text": "In the past, I have had problems with \"off brand\" filters for the water line in my refrigerator so I was hesitant to try one again. But the cost of the brand name filter was much higher than these, so I decided to try again. This filter fit perfectly, went on easily and is working like a charm. It's been installed for 3 days and no eevidence of any leaks.",
      "rating": 5.0,
      "verified": true,
      "author": "Dog Mom",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Value!!!",
      "text": "The value of this product is amazing! I had a little trouble installing it- could just be because I'm short and didnt have the best vantage point to install but my husband got it after a short amount of time. Also, I think with any new filter you're supposed to let the water run for a few gallons- I couldn't bring myself to run that long but I didn't have any issues with taste, debris, or water pressure.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa B",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great substitute for GE filters!",
      "text": "I was kinda nervous about ordering these since they were so much cheaper than the original GE filters, but after reading all the great reviews, I decided to pull the trigger..... so glad I did!! These filters work great!! They're a perfect replacement, no issues with fitting or leaking, water tastes great, and best of all, super affordable! Will continue to order these as long as I have this fridge!",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa P.",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Just as great as a name brand",
      "text": "Wow! These work just as well if not better than the filters made by GE. I went to home depot and spent $110 on 2 filters. When my fridge needed new ones I decided to save money and just buy ones that worked for my fridge. Honestly the water is clearer and does have not a lingering taste of anything what so ever. I will continue purchasing these as long as I need to, it's such a good bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "Oliva Toro",
      "helpful_votes": 2,
      "publication_date": 20180312
    },
    {
      "title": "Do yourself a favor and buy the real GE filters",
      "text": "I thought that maybe I had gotten a bad batch of these filters so I decided to give them another try. It was a big mistake. None of them worked with my GE refrigerator. I put them in and all you would hear is the refrigerator making this knocking noise like something was going to break on it. I tried all three filters in the batch and they were all the same. I noticed others who purchased these had the same issue. Just spend the little extra and buy the real GE ones.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Good replacements but slight differences to OEM.",
      "text": "These filters are a good replacement to original GE MWF filters have slight differences. First, the base is not round and slightly smaller but it fits fine. I thought it was not going to fit or drop water but the filter has been working for a week with no issues. Second, original filters have an alignment arrow to properly install it. I had to find the right position by looking at the alignment arrow on the old filter. Overall, you get what you pay.",
      "rating": 4.0,
      "verified": true,
      "author": "Net Buyer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Does not fit MWF",
      "text": "I actually could not even give this one star. It does not fit in the MWF filter at all. It was not until my product was delivered that I received an email from the seller stating they had redesigned the top of the filter.",
      "rating": 1.0,
      "verified": true,
      "author": "Abbey",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Does Not Work! Don't Waste Your Money",
      "text": "This did not work. I did not over-tighten but it still made a knocking sound. I ran several cups of water from the dispenser. At first it sputtered which is normal but then there was just a trickle. After about 8 cups of slowly filled water, it just stopped dispensing. I tried reinserting it with no success. I had to put the old filter back in to get water.",
      "rating": 1.0,
      "verified": true,
      "author": "MarjieW",
      "helpful_votes": 2,
      "publication_date": 20180926
    },
    {
      "title": "Use Name Brand",
      "text": "This product was not what it said it was. The filter fit the fridge but did not work. The water was coming out grey and the water flow was not smooth.i used all 3 to see if any of them worked and they didn’t. I ordered the GE water filter and as soon as I put it in the water flow was smooth and the water was clear! I will not ever order off brand for my refrigerator water filters again.",
      "rating": 1.0,
      "verified": true,
      "author": "MV",
      "helpful_votes": 2,
      "publication_date": 20180830
    },
    {
      "title": "Some bad filters in the 3 pack, water tastes like rubber",
      "text": "Maybe I got a bad batch, but I had a couple of the filters that made the water taste like rubber. Like drinking stale water from an outdoor garden hose. I switched to the Amazon generic for this filter and it's much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Same quality ... better price",
      "text": "Filters work just as good as the OEM filters. There was a lot of charcoal color to the water on initial installation. I simply ran the water till it cleared and it's been Crystal clear since. Very pleased with this purchase Not only was it a great money saver the product works just as good as the original .",
      "rating": 5.0,
      "verified": true,
      "author": "Sweetiegold",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Leaks on GE MWF filter type",
      "text": "This item was difficult to fit on, and isn't really 'designed' for MWF filter types, but as a generic replacement for several models. As a result, for my GE MWF it began leaking a couple hours after installation. I attempted to reseat the seal, but no luck. I'm very disappointed, as it was a bit of money for that 3 pack and I can't use any of them :(",
      "rating": 1.0,
      "verified": true,
      "author": "Jim S",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Works fine",
      "text": "The filter seems to be doing the job as I'm not noticing any difference from the GE or other compatible products I've purchased in the past. The only downsides would be that I had to struggle a bit with getting the filter to screw into position which I've never had. The top of the filter is shaped a little differently than the normal ones. Also, I had to flush water through longer than normal to get the charcoal out of the water.",
      "rating": 4.0,
      "verified": true,
      "author": "ScoobyFan",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Did not work !!!!",
      "text": "Could not get water through these. They're supposed to replace GE MWF. I called the help line at 11 am New Jersey time and they wanted to call me back when the help person would be back. Sending this wonderful product back !!",
      "rating": 1.0,
      "verified": true,
      "author": "John Arenz",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Didn't fit",
      "text": "Does not fit my GE refrigerator. I bought the three pack and tried two of the filters...they wouldn't seat into the filter housing. I had to buy the after-market GE filter MWF from Wal-Mart and that filter seated perfectly on the first attempt. Also these filters are typically good for 6 months. I just tried installing these filters back on 9/12 however the seller's return window is only 30 days and I purchased these back around 7/14. :(",
      "rating": 1.0,
      "verified": true,
      "author": "tim",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Nice try but no cigar!",
      "text": "When I first installed the filter, it spewed bluish gray colored water. After dispensing 3 gallons to clear the sputtering, the water tasted chlorinated and had particles floating in the glass. I have only used genuine GE filters in the past and my Floridian water taste as good as NY or bottled water. Not worth the savings for me and I love to save a dollar. Going back to manufacturer standard. Nice try, but no cigar!",
      "rating": 2.0,
      "verified": true,
      "author": "Hopey 1",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Does not fit MWF cartridge holder",
      "text": "I wish I had read all of the reviews! Like some others, I bought this to replace my MWF filter. It does not fit into the cartridge holder. Returning this item.",
      "rating": 1.0,
      "verified": true,
      "author": "M.J.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Best value for your buck!",
      "text": "I have been using OEM filters in my GE Refrigerator for years, after a while it was getting expensive to get healthy water for my family, I look into these OEM comparable filters and let my tell you that they work just as good as the OEM, but the huge difference is the cost. For the price of 3 of this comparable filters is less than ONE of the OEM. Don't be fooled!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Motormen23",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "I am so happy we got these",
      "text": "We have used the official GE water filters for as long as we've had our refrigerator. When I saw these, I thought why not. I am so happy we got these. They are much less expensive and seem to work just as well. I got them quickly, packaged well and have been pleased. I'll make these my go to for refrigerator water filters from this point forward. Great customer service too. The manufacturer actually contacted me personally to make sure we were happy with them. That just doesn't happen in today's world. Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Hackney",
      "helpful_votes": 2,
      "publication_date": 20171120
    },
    {
      "title": "Easy replacement",
      "text": "I order these for GE Refrigerator. Frankly speaking, I don't know if I can use any other brand with this fridge or not. I got this fridge with the house and it has the same water filter replacement before I move in. It is easy to order on Amazon and come in pack of 3. For a house of 2, it works fine for 3-4 months before I replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dishika Singh",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "What's in the water?",
      "text": "Purchased this water filter to replace the filter in my GE refrigerator. After a few months began to see an occasional dark colored particulate matter in the water. Submitted emails to Prime Filters asking what these particles are and are they harmful? Have not received any response. Installed the AmazonBasics Replacement GE MWF Refrigerator Water Filter. No more particulate problem and paid less at the same time!",
      "rating": 2.0,
      "verified": true,
      "author": "Loren",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Suitable replacement for the brand name",
      "text": "These work as well as the brand name version I got a year ago. I agree with other reviewers that they seem to be a bit \"slimmer\" in circumference, but they fit just fine and I have no leaks. Water tastes just as good as what we have been drinking. I suppose the test will be seeing if they last as long as the premium brand, but even if they last 1/3 as long, I'm still getting a better deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Smith",
      "helpful_votes": 2,
      "publication_date": 20171206
    },
    {
      "title": "A great inexpensive and perfect replacement to get great tasting water!",
      "text": "This filter just twists right into my GE Profile refrigerator. Crystal clear water flows right through the water dispenser. I don't see or smell any sediment passing through the water line into the glass. The water tastes great making you go back for more. The price is extremely reasonable compared to places like Home Depot or Lowe's. Pick this up and you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Parduhn",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Not made in the USA as stated",
      "text": "It states made in IL, USA. I wanted a quality made US filter. The first thing I see on the box is made in China. I attached the picture of their box and information listed on the item. Disappointed. I really hope the quality is as claims. If you sell Chinese products you probably shouldn't bash them in you description.",
      "rating": 3.0,
      "verified": true,
      "author": "Conrad",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Did not work for GE refrigerator.",
      "text": "Did not work for my GE refrigerator. My refrigerator uses MWF filters, so I tried PURELINE to save money. Unfortunately, when I inserted this filter, the water flow to ice maker and water dispenser stopped. After waiting 2 weeks for a repairman, it was determined that my water filer attachment had been damaged. So he had to order that part and I had to wait another 2 weeks for it to be replaced. Now, it appears I have passed the timeframe to return these filters... repair $294 + cost of Pureline filter+ cost of GE brand filters... definitely not a savings",
      "rating": 1.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 3,
      "publication_date": 20170801
    },
    {
      "title": "THIS IS NOT A GE MWF REPLACEMENT!!!!!",
      "text": "This filter does not replace the GE MWF filter. First off the OEM GE filter top is round, this pure line P.O.S is not. Second, It wont hold when you screw it in no matter what you try. I WASTED an hour on this worse the subpar product. Makes me seriously question the 4+ star review. Do not buy this as an MWF filter replacement, unless you like to waste your time and drive yourself to drinking.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Filter is Good but Installation was little tricky",
      "text": "Review on this filter is great I ordered it to replace for my refrigerator I tried to install it was not able to install in the beginning for 15 minutes later saw a few of videos then I was able to the water tastes good. I do recommend thsi product for our healthy day to day life.",
      "rating": 4.0,
      "verified": true,
      "author": "BHAGYA MARIK",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Water tastes funny",
      "text": "It makes water taste funny. I tried to use for 3-4 weeks and then missed my return window because hadvto purchase the GE filter first. I do not recommend. They will work, but I can’t drink the water.",
      "rating": 1.0,
      "verified": true,
      "author": "SKaye",
      "helpful_votes": 4,
      "publication_date": 20180205
    },
    {
      "title": "How would I know?",
      "text": "I ordered this product and the first time I got an email saying it was damaged and had to be returned to Amazon. The second time I ordered it is somehow \"delayed\" and I really don't have it yet. On top of that, it is a filter and I not sure how anyone would know how good it does for a few months by doing some testing. I hope others think about reviews and whether it is relavent and truthful in how it is left.",
      "rating": 3.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Do not buy",
      "text": "Are you kidding? First off, I installed this filter and no water came out. When comparing with the GE filter the opening on this one is smaller. I had to make the opening bigger with a screw driver. After throwing out bu kets and buckets of water to clear the filter the water is still more contaminated than my sink tap. This is a piece of crap.",
      "rating": 1.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Doesn’t fit properly!",
      "text": "Filter didn’t fit even though stated it was for GE MWF. Waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Bucko",
      "helpful_votes": 2,
      "publication_date": 20200420
    },
    {
      "title": "Terrible Product",
      "text": "the filter should easily turn in, it did not. I tried the old GE filter and it locked right in. I tried a second (bought a 3 pack) of these filters and it went in after some finagling but not the same as GE filter. Getting some drips from dispenser now. These are NOT good quality IMO.",
      "rating": 1.0,
      "verified": true,
      "author": "longterm",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Didn’t fit",
      "text": "Didn’t fit on GE refrigerator. Every other mwf filter I have used worked fine. I applied significant force and it wouldn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "cooler joe",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Garbage doesn’t fit my fridge even though it states it should",
      "text": "I bought these back in March since I had used my last filter. I have bought all of my filters from amazon and have had no issues. Well I finally needed to replace my filter again and I open these and they don’t even fit my fridge. I need MWF filters and the top of the filter is way to wide to fit my fridge. It’s too late to even return it. What a waste of $50. False advertising telling me it fits my fridge.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Warning.....not a GE product",
      "text": "Cannot install....doesn't actually fit even though it says it will. Not a GE product so the description is misleading at first. I realized it wasn't before ordering, so that part is on me. But it still won't catch the grooves to screw in and install properly. Again, I checked to make sure it would fit before buying, and it said it would fit my fridge.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Does NOT fit my GE refrigerator!",
      "text": "I spent most of an afternoon trying to install this filter in my GE refrigerator. Finally I compared measurements of this filter vs the genuine GE MWF filter that was in the refrigerator. The central opening of the Pureline replacement filter is a full 2 millimeters narrower than the one on the GE filter, making it too narrow to fit on the stem of the connector, and the Pureline filter will not lock in place. I will not buy Pureline filters again!",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Ann Smith",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "One for three",
      "text": "Ordered these for my GE compatible and only 1 of the filters out of 3 in box will fit and lock in place. The other two you would need to install with a jackhammer. Thanks for taking my cash and two went in trash. Once you pull the seal off all three and getting only last one to work, then you got yourself a good profitable business. Last time to order this brand. You think atleast the stickers on the filters would be straight, that was a sure \" sign\" when got them out. Have nice day",
      "rating": 1.0,
      "verified": true,
      "author": "Filter frenzy",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Shorted one filter, only got 2 of 3",
      "text": "Box came opened with one filter missing so it only had two instead of three. There was no seal on box which is scary for a filter.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff Jasper",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Great price!!",
      "text": "I received my filters quickly. The filters work great and are really easy to install. Each filter lasts almost 6 months. I am thankful that I found these filters because it saves me lots of money compared to buying them at Lowe's. I will continue to buy them here at the price I paid!!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Gaspard ",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Cheaper but I would be careful",
      "text": "I was tempted to buy this replacement unit, mainly because of the high price of the original GE MWF filter. I just installed one. Well ... it took me three attempts properly line up the filter inside (there is no arrow like on MWF), and properly have it snapped. Someone posted a picture of the “collar” of GE filter and this one. This is main difference, which could create some problem to fit it in properly. I hope it will work well, without any leak, and with the same water quality as GE. I will see in few months.",
      "rating": 3.0,
      "verified": true,
      "author": "Andy Z",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Does not work",
      "text": "Pay more and get a genuine GE water filter. This does screw into the fridge but it DOES not properly function and my ice/water quit working and started making a loud buzzing noise. Thankfully, I was worried about trying a knock-off and kept the filter that I had removed. After putting the old filter back in, ice/water started working and the buzzing stopped. I've ordered the real deal from GE.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Inaccurate Description",
      "text": "Product description is inaccurate. Does not fit GE GS25GMHBCES. Very disappointing that they have not updated their description! Sending back.",
      "rating": 1.0,
      "verified": true,
      "author": "Jana T.",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "... GE for my GE refrigerator as I have had bad luck in the past with \"off brands\" made to ...",
      "text": "I normally only purchase water filters from GE for my GE refrigerator as I have had bad luck in the past with \"off brands\" made to work on my refrigerator, but since the reviews were high, I thought that I would give it another try. I just put my first of the three in my refrigerator and it has been working perfectly well. At this point, I can not tell any difference between the Pure LIne Brand and the one directly from GE products.",
      "rating": 5.0,
      "verified": true,
      "author": "OCDoctor",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Works well....",
      "text": "So far so good....it was a little different from the another after-market brand we used but it seems to be working fine. I am all for \"The Little Guy/Gal\" versus the big giants so I will continue to buy your product. Small companies are the back-bone of our great country and always nice to see a lady owner of a successful busniess. Hope someday you will turn into a GIANT yourself! Best, Mike",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Swanson",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Don’t bother",
      "text": "They fit my fridge fine. The first one was fine & lasted about 6 months. The second & third one were rubbish. It didn’t matter how much water I ran out or ice I dumped out, the horrible taste never went away.",
      "rating": 1.0,
      "verified": true,
      "author": "KJC",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Not compatible with GE",
      "text": "This states compatible with GE refrigerator filter MWF is not. I read previous reviews about this filter made the water stop working on the refrigerator- I just thought just a one off and bought. Came in as expected and installed and worked for a week and just like the review stated my water stop working. Return was no problem from Amazon and went to Home Depot and bought HDX like in the past and back in business with water for my refrigerator.",
      "rating": 1.0,
      "verified": true,
      "author": "j d",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "BLEH! What IS that?!",
      "text": "The flavor is good and they're easy to install, but even after a month later, I still have white crap floating in my water when the ice melts. The water comes from my Brita, so it's definitely the ice that the water line is running through these crappy filters.",
      "rating": 1.0,
      "verified": true,
      "author": "Withatwist",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "you have to pay more about $100 to repair your refrigerator",
      "text": "Everyone should pay attention to This Filter Is Not GE Authorized, means that it can break the water pump pin. and if you want to fix it, you have to spend about $100 to replace a new one. the worst scenario if you can change it by yourself like me, you also need to pay about $100 labor fee. This filter should not be sold on Amazon!",
      "rating": 1.0,
      "verified": true,
      "author": "customer ",
      "helpful_votes": 3,
      "publication_date": 20190517
    },
    {
      "title": "Did not fit properly",
      "text": "I have ordered these filters twice in the last month. Returned the first order because while the filter looks exactly like my GE MWF, it only screws in part way and does not allow water to flow. The second order has been returned for the same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven A. Myers",
      "helpful_votes": 2,
      "publication_date": 20200501
    },
    {
      "title": "Three of these for the cost of 1 GE Filter",
      "text": "I ordered these as a replacement for my GE refrigerator filter. The MSRP of a GE Filter is $50. The off brand filters typically cost about $30. I bought these and they installed easily and were a perfect fit and function. I now have enough filters to last over a year. I would definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "EddieYouDaMan",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Happy with filter",
      "text": "I have a GE fridge that had a GE smartwater MWF filter, bought these because of the price 3 for $50 rather then just 1 for $50. Super easy to install and fit perfectly. No leaks so far. :) one picture is of the filter we replaced, and the other picture is the new filter installed.",
      "rating": 5.0,
      "verified": true,
      "author": "TxLuvBug",
      "helpful_votes": 4,
      "publication_date": 20170620
    },
    {
      "title": "Not great",
      "text": "I meant to return this but I've just had a lot of personal things to happen between losing my cousin and grandma and having been sick with the flu for 27 days. I don't recommend this product. I didn't like the taste, it taste very weird like chemicals or something. It sucks because now I'm stuck with 2 more filters I'll never use.",
      "rating": 2.0,
      "verified": true,
      "author": "Tigger",
      "helpful_votes": 0,
      "publication_date": 20200302
    }
  ],
  "product_meta": {
    "title": "GE MWF Water Filter Replacement. Compatible Models for GE: MWF, MWFP, MWFINT, MWFAP, GWF, GWFA, HWF, HWFA, HDX FMG-1, Smart Water, WFC1201, GSE25GSHECSS, 197D6321P006 (3 Pack)",
    "rating": 4.4,
    "feature_bullets": [
      "TRIPLE ACTION FILTRATION TECHNOLOGY: Our filters use advance carbon blocks made of active coconut carbon that purifies the water first through mechanical filtration of the waters passing through the micro-pores of the filter. Then the water is further purified through two seperate stages of ionization filtration that take place as the water passes through the carbon block to your refrigerator. This filtration process is state of the art and not something other filter brands offer.",
      "REMOVES 26 CONTAMINANTS: PURELINE removes 26 contaminants from your water. Our filters remove 99% of Heavy Metals, Mercury, Chlorine, Odor, THM, Voc, micro-organisms, particles and 95% or Greater Reduction Rates of Cadmium, Chromium, Copper, Lindane, and all other major contaminants.",
      "CERTIFICATION: PURELINE filters have been tested and certified by the NSF, WQA, and IAPMO.",
      "NO LEAKAGE & 100% COMPATIBILITY: PURELINE was one of the first generic filters on the market. We made a filter designed to the exact compatibility and standards as the GE MWF original refrigerator smartwater filter.",
      "COMPATIBLE GE MODELS: MWF, MWFP, MWFA, MWFAP, MWFINT, GWF, GWF01, GWF06, GWFA, HWF, HWFA, FMG-1, FMG"
    ],
    "specifications": {
      "Manufacturer": "PURELINE",
      "Part Number": "MWF",
      "Item Weight": "2.74 pounds",
      "Product Dimensions": "6 x 6 x 10 inches",
      "Item model number": "PL-100-S",
      "Is Discontinued By Manufacturer": "No",
      "Size": "3 Pack",
      "Color": "White",
      "Material": "Advanced Active Cocunut Carbon Block",
      "Item Package Quantity": "1",
      "Special Features": "NSF Certified, WQA Certified, Creates Clean and Contaminant free drinking water",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Life Time Warranty",
      "ASIN": "B01KKUFW34",
      "Customer Reviews": "4.4 out of 5 stars6,560 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#775 in Tools & Home Improvement",
      "Date First Available": "August 17, 2016"
    },
    "categories": [
      "Refrigerator Parts & Accessories",
      "Appliances",
      "Tools & Home Improvement",
      "Parts & Accessories",
      "Water Filters"
    ],
    "price": 43.95
  }
}