{
  "website_summaries": [
    {
      "verdict": "A good choice if you need a casket that comes at a reasonable price point and want a design for your loved one that has a bold color and an elaborate look.",
      "pros": [
        "Provides a dignified appearance, with black and silver and intricate details",
        "Made of 18 gauge steel",
        "Has a velvet interior with pillow and throw",
        "One of the more affordable options by the brand"
      ],
      "cons": [
        "Color and trim probably won't work if you prefer a more neutral or feminine option"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beautiful",
      "text": "Purchased when my mom passed. It was absolutely beautiful. We recieved it in perfect condition. I could not have been more pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Barraza",
      "helpful_votes": 6,
      "publication_date": 20200214
    },
    {
      "title": "Very comfortable",
      "text": "Haven’t heard a single peep from grandma since she received this",
      "rating": 5.0,
      "verified": false,
      "author": "Austin",
      "helpful_votes": 97,
      "publication_date": 20190614
    },
    {
      "title": "No oxygen or air vents to breathe!",
      "text": "I’ve been dieing to get one and loved it. So comfy i cant seem to arise from my deep sleep. So peaceful though.",
      "rating": 5.0,
      "verified": false,
      "author": "Sleazy",
      "helpful_votes": 89,
      "publication_date": 20181025
    },
    {
      "title": "Nice!",
      "text": "These are nice. However, I’d like to buy a used one.",
      "rating": 5.0,
      "verified": false,
      "author": "christian williams",
      "helpful_votes": 59,
      "publication_date": 20191001
    },
    {
      "title": "Liking",
      "text": "Amazing, I think my uncle liked it but he was dead so couldn’t feel anything",
      "rating": 5.0,
      "verified": false,
      "author": "Shane",
      "helpful_votes": 27,
      "publication_date": 20191005
    },
    {
      "title": "Not good",
      "text": "I’m very disappointed in this item, it was very uncomfortable while laying in it at my funeral and everyone one could hear me moving around and I got caught red handed.",
      "rating": 1.0,
      "verified": false,
      "author": "Simon",
      "helpful_votes": 5,
      "publication_date": 20200207
    },
    {
      "title": "Great for being dead in",
      "text": "I picked this one after I died because it looked comfy. It’s super comfy and I can finally get a good nights rest being dead in this thing.",
      "rating": 5.0,
      "verified": false,
      "author": "Miranda",
      "helpful_votes": 5,
      "publication_date": 20200201
    },
    {
      "title": "Grandpa has been complaining",
      "text": "Old Gramps said it's very uncomfortable can't get him to stop appearing in my room always scaring me appears in the corner because he's a gost but he has dementia he so he doesn't know that any who he also says it's hot down there but everyone at his funeral said he was in heaven fly high oh wait no I mean uh stay low",
      "rating": 2.0,
      "verified": false,
      "author": "Gostly ",
      "helpful_votes": 2,
      "publication_date": 20200828
    },
    {
      "title": "Perfect for exes",
      "text": "It was perfect for my ex. He hasn’t complained yet so it must be pretty good quality",
      "rating": 5.0,
      "verified": false,
      "author": "Meghan Davis",
      "helpful_votes": 3,
      "publication_date": 20200708
    },
    {
      "title": "Compact ability",
      "text": "Just bought one for Nesa! My best purchase yet she saids it’s very comfortable! Love the red velour",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Was occupied when we got it",
      "text": "When we opened it a black figure flew out and bolted out the window like a deatheater. It had a sinister laugh as it flew off into the night. But if that wasn’t enough, when we put my uncle inside it got real weird. Now, he was a sinner. He’d drop a stinky land mine in the women’s restroom just to make them even. He’d fire paintballs at people digging through our recycling. Point is, I can’t say if it was the coffin caused it, but it’s awfully suspicuous that he burst into flames when we closed the lid. 5 stars cause it cremated him for free and we got our deposit back on the burial.",
      "rating": 5.0,
      "verified": false,
      "author": "Shaherb",
      "helpful_votes": 36,
      "publication_date": 20190203
    },
    {
      "title": "Good",
      "text": "My mom got this for me for Christmas and DAMNis it comfy! I can’t wait to die and spend the rest of my physical eternity in this sexy box. Thanks ma!",
      "rating": 5.0,
      "verified": false,
      "author": "jhsissonII",
      "helpful_votes": 26,
      "publication_date": 20181230
    },
    {
      "title": "Sis loves it",
      "text": "This is great quality sister loves it so much that she’s turned purple",
      "rating": 5.0,
      "verified": false,
      "author": "T. Allen",
      "helpful_votes": 23,
      "publication_date": 20190512
    }
  ],
  "product_meta": {
    "title": "Overnight Caskets - Knight Black Brush with Velvet Interior - 18 Gauge Metal Casket/Coffin - 1-3 Day Shipping",
    "description": "This product is as shown in the images. Due to the sensitive and urgent nature of casket delivery, we highly recommend you contact us before purchasing to assure timely delivery to the funeral home of your choice. Please message us with ANY questions. We will answer immediately. We are available 24 hours a day, 7 days a week. With our numerous warehouses across the United States, we are able to offer 1 day shipping to 80% of the USA. Federal Law : Funeral Homes Must Accept our Caskets | Local Warehouse – White Glove Delivery to the Funeral Home of Your Choice. | Same Day And Next Day Delivery Guaranteed. | Save $3000-$5000 On Funeral Costs. | Funeral Assistance. Allow us to Help! | IMPORTANT : Make sure to receive an itemized price list from the funeral home prior to notifying them of your intentions of purchasing a casket elsewhere. This will greatly reduce the chances of a funeral home increasing their prices for other services to make up for the lost profit on the casket. We are here to help 24 hours.",
    "rating": 3.6,
    "feature_bullets": [
      "1-2 Day Shipping Available to 80% of the USA. Contact us for more information. Must Be Shipped to Commercial Address/Funeral Home.",
      "Beautiful Black Finish With Silver Highlights, White Velvet Interior in a French Fold Design, 18 Gauge Steel, Full Rubber Gasket Sealer, Swing Bar Handle Hardware, Locking Mechanism",
      "Half Couch, Matching Pillow and Throw, Adjustable Eternal Rest Bed (Both Head and Foot), Squared Corners",
      "Silver Jewel-Toned Accessories , Continuous Welded Construction Completely Sealing The Bottom, Memory and Record Tube, Fits In Standard Burial Vaults"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "210 Pounds",
      "Date First Available": "August 24, 2016",
      "Manufacturer": "Overnight Caskets",
      "ASIN": "B01KYIFD2C",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Brushes",
      "Household Supplies",
      "Health & Household",
      "Cleaning Tools",
      "Health, Household & Baby Care"
    ],
    "price": 1199.0
  }
}