{
  "website_summaries": [
    {
      "verdict": "A comfortable walking shoe, though not in the same league as the Match.",
      "pros": [
        "Well-constructed and comfortable, with a fashion-forward edge",
        "Comes in a variety of colors",
        "Leather upper with lace-up closure",
        "Leather lining",
        "Leather-covered Air-Jet cushion insole",
        "Durable rubber outsole"
      ],
      "cons": [
        "Squeaks when you walk",
        "Not as much support as other Mephisto styles"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Confort and style",
      "text": "Excellent in all aspects and details, it is a pity that Mephisto's size runs a bit larger than standard. That, however, does not imply in any disadvantage to the product itself, which carries the good qualities with which it is recognised everywhere. But with this order (one of two pairs), I got half-a-size big than ordered. Facing with the prospect of having to return it, lazy, I decided to keep it, regardless of the fact that that does not tell us of anything good from the seller - on the contrary...",
      "rating": 4.0,
      "verified": true,
      "author": "Luiz H.S.de Vasconcellos",
      "helpful_votes": 2,
      "publication_date": 20181211
    },
    {
      "title": "Nice shoe. Well constructed",
      "text": "Nice shoe. Well constructed. Consistently wear size 10 US, 43.5-44 Euro. Size 10 was more than 1/2 size too large. 9.5 was good.",
      "rating": 4.0,
      "verified": true,
      "author": "MC Hammertime",
      "helpful_votes": 3,
      "publication_date": 20180711
    },
    {
      "title": "I LOVE These Shoes",
      "text": "This is my 2nd pair of Ludos and my 4th pair of Mephistos (including the most comfortable sandals ever). The fit perfectly out-of-the -box. No \"break in\" required. Not only do I love them, but I get many compliments. Silly expensive but it is a truism that you get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Truth",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Mephisto",
      "text": "I have been wearing Mephisto shoes for years. These are very comfortable and good looking. Be careful with the size you order. Use their size chart to be sure. Great value when on sale",
      "rating": 5.0,
      "verified": true,
      "author": "Hadi I. Farah",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Great Shoe",
      "text": "I've owned 4-5 pairs of Mephisto. They're expensive but they last a long time. I mean years. I'll keep buying Mephisto. Highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Williams",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Great squeaky shoe",
      "text": "Great well fitting comfortable shoes BUT they are the squeakiest shoes I ever heard. It's funny. At first.",
      "rating": 3.0,
      "verified": true,
      "author": "Uppro",
      "helpful_votes": 4,
      "publication_date": 20170802
    },
    {
      "title": "Runs large",
      "text": "Nice styling. Ordered them before. I usually wear a size 12 us. Ordered these in an 11 us. They run big compared to most brands( vans,sketchers,Nike etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Nyle",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "i go to the symphony and wear them to Mass",
      "text": "Comfortable right out of the box. My closet is full of Mephisto shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "nearlyimperfect",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Four Stars",
      "text": "They squeak after about a week of use. This is my second pair, and both squeak when you walk.",
      "rating": 4.0,
      "verified": true,
      "author": "srg",
      "helpful_votes": 3,
      "publication_date": 20180111
    },
    {
      "title": "My favorite shoes",
      "text": "First, you have to buy Mephistopheles shoes a half size smaller than your regular size, because they run big. (I’ve bought three pairs over the years. ) For me they are just great shoes. They are very comfortable. They look great. And they last forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas H Macbride",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Comfortable",
      "text": "I've only worn them three times so far, but for all day comfort they are tops. Hope they get even better as they break-in. I bought them thinking they were suede. They are supple grainy leather. In some pictures they look more royal blue, but mine came as advertised- in navy blue. I recently bought a pair of black Finn Comfort Nantes. Both companies claim to make the most comfortable walking shoes. I like them both and look to see which have more long term potential. Though, the Nantes have hand sewn uppers to lowers. So they shouldn't come unglued like the Ludo could.",
      "rating": 5.0,
      "verified": true,
      "author": "Emungle",
      "helpful_votes": 3,
      "publication_date": 20160825
    },
    {
      "title": "Great shoe.",
      "text": "They fit like a glove. Great shoe. I’ll buy again!!",
      "rating": 5.0,
      "verified": true,
      "author": "James H. Lewis",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Lovely shoes with a very nice look. Mephisto is not cheap",
      "text": "Lovely shoes with a very nice look. Mephisto is not cheap, but it's worth it. I have owned six or so pairs.",
      "rating": 5.0,
      "verified": true,
      "author": "William F. Prizer",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Great shoes",
      "text": "Really nice shoes. Fit well and they are very well constructed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "It's a great fitting shoe and good looking",
      "text": "It's a great fitting shoe and good looking, too. If it lasts like all of the other Mephito I've bought through the years, it is worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "AspenTraveler",
      "helpful_votes": 2,
      "publication_date": 20151002
    },
    {
      "title": "Awful fit, very disappointed",
      "text": "I should have posted sooner about these shoes. I love the look but the fit is awful. They are a little roomie and are not comfortable at all. I have two other pairs of Mephisto loafers and I wear them all the time for years. I bought these because of my past experience. Do not buy these would be my opinion and I wish I had sent them back! Shame to throw away that much on a shoe I do not wear.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn Millerick",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Five Stars",
      "text": "Most comfortable shoes I have ever owned. Will continue to purchase Mephisto.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas W. Disanto",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Excellent so far.",
      "text": "So far, and with shoes, it can take a while to know for sure...these shoes seem very comfortable and well-made. I have become a bit of a shoe person; and these seem like an excellent pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon-World's Best Mediator",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "... much support as in most Mephisto's but they're very good looking.",
      "text": "There's not as much support as in most Mephisto's but they're very good looking.",
      "rating": 3.0,
      "verified": true,
      "author": "Sunny",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "This shoe is fantastic, fits perfectly",
      "text": "I got the navy blue of these as my first Mephisto shoe to try them out before buying some of the more expensive models. This shoe is fantastic, fits perfectly, is comfortable, and looks great. I have had several people compliment the shoes, which is always nice to hear. I'm definitely a Mephisto fan from here on out.",
      "rating": 5.0,
      "verified": false,
      "author": "Jared V",
      "helpful_votes": 0,
      "publication_date": 20161007
    }
  ],
  "product_meta": {
    "title": "Mephisto Men's Ludo Oxford",
    "description": "This modern MEPHISTO men's casual shoe offers excellent fit and optimal comfort. The removable insole with integrated SOFT-AIR TECHNOLOGY ensures soft, stress-free walking and the non-abrasive, special profile sole guarantees a secure grip on all foundations.\n\nMephisto makes some of the finest walking shoes on earth. Their comfort, support and durability are recognized wherever people are serious about walking. For more than three decades, Mephisto has been on the forefront of walking-shoe innovation. Mephisto's natural products are handmade of leather, latex, cork and rubber.",
    "rating": 4.4,
    "feature_bullets": [
      "100% Leather",
      "Imported",
      "Rubber sole",
      "Dress shoe made for walking",
      "Features lace fastening and heel type is flat"
    ],
    "categories": [
      "Fashion Sneakers",
      "Shoes",
      "Men",
      "Clothing, Shoes & Jewelry"
    ],
    "price": "",
    "specifications": {}
  }
}