{
  "website_summaries": [
    {
      "verdict": "Charge this light and get up to 54 hours of illumination, enough to keep any lawn or garden party going until the wee hours.",
      "pros": [
        "Light has two settings",
        "Recharges with a wall plug or by using a USB charger and computer or phone",
        "LED lights don't attract bugs like other types of lights and candles will",
        "High setting provides enough light to cover even larger patio tables"
      ],
      "cons": [
        "Have to remove from pole to close umbrella",
        "Because the switch is high when in place, some users would like a remote included"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Simply amazing 👏🏼",
      "text": "I absolutely love how beautiful and bright this is! It’s the simple things. I can’t wait to use this all summer and fall.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 22,
      "publication_date": 20190525
    },
    {
      "title": "Great light. Easy to use!",
      "text": "Great light! Rechargable and easy to attach to umbrella pole. Pictures include low and high lighting options.",
      "rating": 5.0,
      "verified": true,
      "author": "EMSSNM",
      "helpful_votes": 26,
      "publication_date": 20170904
    },
    {
      "title": "Great value/product",
      "text": "Very satisfied with this patio umbrella light's brightness and price. Exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "edison betancourt",
      "helpful_votes": 20,
      "publication_date": 20181013
    },
    {
      "title": "This umbrella light is easy to use, easy to recharge",
      "text": "This umbrella light is easy to use, easy to recharge. The unit opens up so you can attach it to the umbrella pole and has 2 tension buttons to keep it in place. The light stayed bright for 2 hours. At the end of the evening, I just took it off and plugged it into my computer to charge it. So much better than my old battery operated one.",
      "rating": 5.0,
      "verified": true,
      "author": "Salie Yates",
      "helpful_votes": 11,
      "publication_date": 20170807
    },
    {
      "title": "Very nice light with handy features...",
      "text": "The umbrella light appears to be exactly what we wanted for our new patio umbrella. It has two light settings and the batteries are rechargeable. Mounting the light was easy and the diameter of the central opening is large enough for our commercial-type umbrella. My only suggestion is that it would be nice if the light had a remote control to turn on and off. After the light is installed, it can be difficult to locate the switch at night...especially with it above your head. Otherwise, we're very happy with the light and will update this review after using it over the next few months.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister T",
      "helpful_votes": 7,
      "publication_date": 20171223
    },
    {
      "title": "worthless",
      "text": "These worked great right off the bat. The first one i ordered would not charge so i contacted the company and asked if maybe the charger was bad. They were very slow to respond and when they did they offered to replace if i sent the other one back. I just went ahead and ordered another one and kept the first one thinking that a new charger would do the trick and i could have 2. The second one did the exact same thing...wont charge. Im done...they are both in the trash $50.00 wasted",
      "rating": 1.0,
      "verified": true,
      "author": "Lynn Sisk",
      "helpful_votes": 4,
      "publication_date": 20190917
    },
    {
      "title": "nice light. Was looking for inexpensive unit",
      "text": "nice light. Was looking for inexpensive unit, scrolled thru many options. I knew I wanted rechargeable so I wasn't buying batteries endlessly. But now I wish I had considered a unit with a remote. The on/off switch is on the edge and nearly invisible when you are looking up into the umbrella to find the switch. And you must remove the light to fully close the umbrella. But still, it does the job, I don't hate it.",
      "rating": 4.0,
      "verified": true,
      "author": "mike oshaughnessy",
      "helpful_votes": 5,
      "publication_date": 20170901
    },
    {
      "title": "Does NOT fit 2” pole",
      "text": "I bought a new umbrella with a 2” pole and needed a new light so I ordered this one. It arrived and I tried to attach it to my pole. It went barely around and would not snap shut...It is a hair too small...My suggestion is to not buy this to attach to a true 2” pole",
      "rating": 1.0,
      "verified": true,
      "author": "Randy Fields",
      "helpful_votes": 5,
      "publication_date": 20190703
    },
    {
      "title": "Bought for chicken coop/ summer umbrella",
      "text": "Purchased to use as a rigged light in the winter for my chickens. Just needed to give them a few extra hours of light so they keep laying. If it's still working by summer I'll put it out under our patio umbrella so more use than one hopefully. I'm including a picture because there weren't many that showed how well it lights up. I have it on high in a very dark shed. I imagine it would light up the area better from straight above but I needed to reach to turn it on so it's at an angle. Seems to hold a good charge. Easy enough. I'll update this review if it doesn't make it through the winter",
      "rating": 5.0,
      "verified": true,
      "author": "Marissa Godinez ",
      "helpful_votes": 23,
      "publication_date": 20161004
    },
    {
      "title": "Very Good Brightness",
      "text": "Perfect for that night dinner on the patio..... The amount of lighting on the high level lit up our dinner perfectly for a romantic setting. It’s easy to install on the patio umbrella and easy to remove. The batteries last multiple dinners on highest level. Not sure how long it takes to full charge since I just left it plugged in overnight.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Wilson",
      "helpful_votes": 18,
      "publication_date": 20200502
    },
    {
      "title": "Great concept but not perfect",
      "text": "Lights have a blue tone not yellow so it is a bit harsh on color. Brilliant idea to add to umbrella post. Charger does not have an indicator as to when it is charging or when it is fully charged. Minor annoyance but why wouldn’t you build that into the product? 2 modes allow bright light or dim. Both worked well for eating and then talking outdoors after meal. If led’s were softer and charger had indicator lights it would be perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "pretty good, but light should be diffused.",
      "text": "Its easy to install, easy to use. clean looking, but the light is very direct. it would be much better if it was diffused a bit, because at it is, you can't look or in the general direction of the lights, as they are very bright. this can actually be a little uncomfortable, but otherwise they are very nice. they have a nice white/blue lighting (at least that is what it looks like to me). easy to use and easy to charge.",
      "rating": 3.0,
      "verified": true,
      "author": "Travis Most",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "All the light you need on your table, not in your eyes!",
      "text": "Our family likes to play games on the patio table in the evenings. We have an umbrella with built in lights but they weren’t bright enough. This solved the problem immediately. We have used it many times without fail. Con: Minor complaint. There is no charge indicator light or lights to know when to charge or it’s full. We usually charge it before the evening when we know we will need it so we have had no issues. I have used it a couple times without charging and the lights stayed bright. So I think it last at least a few times.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 25,
      "publication_date": 20200708
    },
    {
      "title": "So far so good",
      "text": "Easy to install. I like the 2 brightness levels. This product would be better if there was a button instead of a slide. The slide is a little hard to find in the dark. A charge indicator light would be nice. Just green when fully charged. It's great that it can be easily moved up or down.",
      "rating": 4.0,
      "verified": true,
      "author": "ffoxsmkr",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Nice umbrella lights",
      "text": "These lights are a nice way to light our patio without a cord, and have settings for less light or more light. It fit well around our umbrella pole. Unfortunately the umbrella was destroyed in a storm, but the lights still held up and still work! Rechargeable sealed batteries are a nice touch. Very nice lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel H. Yeary",
      "helpful_votes": 30,
      "publication_date": 20180829
    },
    {
      "title": "Difficult to use; stopped working after one use",
      "text": "Pros: Nice bright light; fit snugly to our umbrella stand; worked fine for one evening Cons: Power switch and release mechanism are the same color as the chassis: black. Difficult to find these switches in daylight, all but impossible during low-light conditions, requiring a supplemental flashlight to manage; quit working after one use (the lamp would flicker intermittently every few seconds).",
      "rating": 1.0,
      "verified": true,
      "author": "Fam-of-3",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Ok - but has no charging indicator",
      "text": "It’s a good light overall - good light power etc. however, the one thing I didn’t appreciate was that when charging it, you can’t really tell whether it’s in charging mode or not. No indicator light to say it’s charging, no way to know if it’s been fully charged. When I first got mine, I simply plugged it into the wall and left it there for a minimum of 18 hours as it says on the directions.",
      "rating": 4.0,
      "verified": true,
      "author": "Fabulous!",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Is easily removed to charge or I have used an USB ...",
      "text": "Gives off adequate lite for our umbrella on our lanai. More than enough light to eat dinner on our lanai table. Is easily removed to charge or I have used an USB extender to charge while still on the umbrella.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim of NJ",
      "helpful_votes": 3,
      "publication_date": 20180117
    },
    {
      "title": "no longer works after less than a year's use.",
      "text": "Loved the idea of not having to deal with batteries. It was brighter than the one it replaced which operated on batteries. We only used it over the summer with occasional use. Disappointed when it would not charge up again last month. I tried different chargers but none recharged it.",
      "rating": 2.0,
      "verified": true,
      "author": "Pnapo1",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Fire hazard!!! Burnt! If you mix a cable ( easily done) you will burn it.",
      "text": "USB cable provided with light is completely inconspicuous and can be easily mixed with other similar cables except, if you plug a regular cable from your other appliance you will burn the unit just like I did and it stars burning. I know for sure because smell of burning plastic is and black vapors were quite noticeable. Fire Hasardeur!",
      "rating": 1.0,
      "verified": true,
      "author": "GS",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Nice while it lasted",
      "text": "Nice while it lasted. it works fine for about a month and a half. But now, the side that is not brightly lit, the switch is very difficult to hold in position for it to keep light without blinking. Definitely sounds like a defective light switch. Be aware.",
      "rating": 2.0,
      "verified": true,
      "author": "AV",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Nice under umbrella light!",
      "text": "This light is great for outdoor use for under the outdoor umbrella. We have been eating outside on my desk a lot and this led light provides a strong light for under the umbrella. It proved the perfect amount of white light to be able to eat and clean up. We are very happy with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Philly Mike",
      "helpful_votes": 15,
      "publication_date": 20200913
    },
    {
      "title": "Provides a good amount of light",
      "text": "This stays on well and provides a good amount of light. It comes with it's own USB charging cable but not with the wall plug. But if you're like me you have a bunch of those from cell phones. I wish I would have bought it sooner :)",
      "rating": 5.0,
      "verified": true,
      "author": "Paxton",
      "helpful_votes": 20,
      "publication_date": 20180426
    },
    {
      "title": "useless light. Save your money",
      "text": "This light never worked right from the beginning. The light switch turns the light on after shut off and drains the battery. And when it is on, it is difficult to regulate the light. Construction couldn’t be cheaper. Save yo7r money!!!",
      "rating": 1.0,
      "verified": true,
      "author": "A.A. Bove",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "bright adjustable LED",
      "text": "Great price very bright and adjustable the springs that hold on to the rod are not to strong and after a couple of hours it'll come down on its own weight and the selector switch its a bit hard to see specially at night having to feel around to find it, no biggie though . Will update on the longevity of the battery charge on future post .",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 15,
      "publication_date": 20190724
    },
    {
      "title": "Disappointed but customer service has been great!!",
      "text": "Both switches went bad after a year, good while they worked. Disappointed that having problems after only 1 year *** Update*** the company has reached out to me and I will be receiving replacement lights. Great service!! Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 3,
      "publication_date": 20180824
    },
    {
      "title": "Very bright!",
      "text": "This product is very bright and even better, it fit our nearly 2\" diameter umbrella pole. This fit aspect is one of the principal reasons that I bought it. I'd recommend this product to others especially for those who are looking for a fixture such as this that would fit around the larger diameter umbrella poles such as ours.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Riada",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Good",
      "text": "Had the battery operated one. Went through batteries often. Neighbor told me the same one is available in a rechargeable she had and loved so I ordered it. The rechargeable is a little larger and sturdier. Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura1",
      "helpful_votes": 11,
      "publication_date": 20200813
    },
    {
      "title": "Love this!! Many uses!!",
      "text": "Wow! I love this! The 2 settings and lighting is great! I also used it for a table setting decor facing down on top of a glass vase filled with decor items. Looked great. So many options besides umbrella use. I face the lights upwards to illuminate umbrella so not to glare in our eyes while seated",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "umbrella light does the trick",
      "text": "when it starts to get dark it's often hard to see without a lot of candles or other lights. This one mounts on the umbrella up and out of the way. Two setting provide justbthe right amount of light.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb Kolling",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great price, great value!",
      "text": "This light works perfect! This is on bright, and it lights up my deck and lasts a long time too. I once forgot to turn it off and it was still on the next night,and no neec fof batteries you just charge it like you would your phone!",
      "rating": 5.0,
      "verified": true,
      "author": "francancook",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Great Value for the Price!",
      "text": "Great value for the price. Love that it is rechargeable and that it arrived with a charge. Charging was a breeze with the included USB cable. Easy one-snap installation onto patio umbrella pole and provides plenty of light to see your guests and even play board games on the patio table at night. The only con I can think of would be that there is no indicator to tell you when the device is charged.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Hebert",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Okay...Not as bright as I would have liked...",
      "text": "These lights are dimmish...Even at their highest setting! Ok but mildly disappointed by the light they produce...It's a very cool blueish light and not bright enough...Not enough to send them back...",
      "rating": 2.0,
      "verified": true,
      "author": "Teresa Bundoc",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "GREAT light",
      "text": "I am so amazed at how much light this tings projects. Even on the low setting, let alone full. Charge lasts a very long time. Will have to see how it is durability-wise, but for now happy and definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda A. Bradley",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "It fit my large diameter pole.",
      "text": "The first umbrella light I purchased did not fit my large diameter umbrella pole this model fit with a little room to spare. There is enough light to eat by but not real bright.",
      "rating": 5.0,
      "verified": true,
      "author": "John Peluso",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Awesome light !!",
      "text": "This light was so easy to install !! It has 2 settings one bright and the next brighter !! And I love the fact that I do not have to replace batteries just plug it in to recharge it !! Love it !!",
      "rating": 5.0,
      "verified": true,
      "author": "Trippitts",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Light doesn’t recharge!",
      "text": "Bought it in March 2019. Used once. Put in drawer. Took it out in September. Needed to be recharged. Tried with Notebook computers and usb plugs to outlets. Does not recharge while plugged into various charging options with switch in off position. Evidently out of warranty already. Surprised Amazon still sells these!",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Sabol",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Brightest",
      "text": "The light is nice and bright and dimmable. Facing down it lights table beautifully and if turned over and installed facing up it bounces soft ambient light off the umbrella.",
      "rating": 5.0,
      "verified": true,
      "author": "Springer Mom",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Fantastic Rechargabel  Upbrella LIght",
      "text": "What a deal for 28 LED lights and rechargeable with USB cable. High and Low setting with on/off switch. Purchased a second one for another umbrella. Great value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou P.",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "or easily covers the surface of our six foot round patio ...",
      "text": "Unbrella light has two options for brightness. Light works well if a person wants a small area lighted, or easily covers the surface of our six foot round patio table. Gary M",
      "rating": 5.0,
      "verified": true,
      "author": "Gary M",
      "helpful_votes": 11,
      "publication_date": 20170518
    },
    {
      "title": "Just what I was looking for",
      "text": "This light filled my list of expectations! Lights are bright, easy fit on our umbrella. Perfect addition to our patio! I would recommend to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Great under the umbrella",
      "text": "This thing is great. Once you find the button that unlatches it, it's pretty easy to use. Simply unhinge, wrap around your umbrella pole and re-attach. Now you have pretty bright light.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Price",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Awkward when Umbrella is Closed",
      "text": "Pros: Great light, easy to install. Cons: must remove light to fully closing up the umbrella. Perhaps selecting an umbrella with built in LED lights is a better buying decision.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Buckman",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Bright and long lasting.",
      "text": "Excellent light. It was to replace a light I had which was very dim and was a bad buy. When this one arrived, it looked very similar to the old one. I was worried that I'd bought the same one. No comparison. This one is bright and lasts for a very long time. You won't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "nicknut1",
      "helpful_votes": 11,
      "publication_date": 20190702
    },
    {
      "title": "Broken Wire, Re-soldered.",
      "text": "Worked great until one day half the lights didn’t work. I took it apart and found a ground wire had broken off thanks to a poor solder job. Resoldered the wire and was back in business.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris H.",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Very bright",
      "text": "This is my second one. First one died after 2 years. But I LOVE this as it is SO BRIGHT on high setting and lights up my whole patio table.",
      "rating": 5.0,
      "verified": true,
      "author": "LESLI JONES",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Perfect mood lighting",
      "text": "We wanted a light for our patio off our master bedroom that wasn't too bright. This light is perfect! The dim feature is exactly what we were looking for. I love that it's rechargeable and it can be moved easily.",
      "rating": 5.0,
      "verified": true,
      "author": "val",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Great light",
      "text": "I love it. It is so easy to put on and take off. It has 2 light functions, and I can use it on High for eating dinner or on Low when we are sitting around at night enjoying our fire pit. It has a pleasing glow when we are sitting around the table with company. I highly recommend this umbrella light.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty Martel",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Worth it!",
      "text": "I’m SO glad someone invited this! Had I known about this earlier, I would have bought it sooner! I strongly recommend this, perfect amount of light. It’s easy to charge and saves money on batteries, makes it convenient if you forget to turn it off at night 🙄",
      "rating": 5.0,
      "verified": true,
      "author": "Dan J Young",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Nice bright light!",
      "text": "This light works very well. I used it to light an area over a food table for an outside party. Hung it from the pergola with a piece of dowel. Turned it on at 5 PM. Batteries were still going at 9:30 the next morning.",
      "rating": 5.0,
      "verified": true,
      "author": "PNWgo!",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "GREAT LIGHT",
      "text": "I have had this Patio Umbrella Light for just over a month and his works quite well. 2 settings of brightness. It holds its Charge for many hours and recharges easily with a USB cable that comes with the light.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack B.",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Best light you'll ever buy!!",
      "text": "These lights are a wonderful addition to your patio table they are very bright when set on high and you can also dim them for a more cozy evening, I also had a few questions for their customer service team which were answered quickly and accurately so buying these lights are nothing but a win-win!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie M.",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "It works as expected`",
      "text": "This light is bright and glows across the patio table my family was impressed with being able to enjoy conversation with out a glare in the eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "spoolsd29",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Love it!",
      "text": "Easy to use, blue brightness and rechargeable! Perfect ! Will probably get one more for my other umbrella.",
      "rating": 5.0,
      "verified": true,
      "author": "STEVE",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Flexibility and Personalization",
      "text": "Perfect. Adjustable height and illumination intensity. Photo is on low setting. You can make it as enticing as you want.",
      "rating": 5.0,
      "verified": true,
      "author": "mwtravlr",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Rechargeable",
      "text": "Nice that it’s rechargeable. Works great if you point it upwards to light the underside of the umbrella",
      "rating": 5.0,
      "verified": true,
      "author": "christopher hearty",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Does last!",
      "text": "We bought two, there were easy to use and bright. We packed them away and now they do not work less than a year later. Great for a one time use, too bad they aren't cheaper to buy each year.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Nice Light - It Gets Job Done",
      "text": "Great light , easily connects to umbrella and puts light on table. The only negative is the on off switch is a little hard to find and user has to “feel around” for it I would recommend this product and buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Hdude92",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Great lighting for umbrella pole",
      "text": "Nice item because you can place it anywhere on the umbrella pole for whatever lighting needs you have. It is easy to snap on and off - easy to switch lighting off and one too",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Beckham",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Excellent lighting, easy to use!",
      "text": "Absolutely love my umbrella light!! Very easy to set up and use! Excellent lighting, perfect for eating outdoors or even reading a book! Very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Daphne D",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Great umbrella light!",
      "text": "Great patio umbrella light right out of the box. It is so easy to install, just click it around your pole. Love that it has both high and low led light settings. This is perfect for all your patio table light needs",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Moser",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Great light",
      "text": "This is easy to install and provides enough light to eat at the patio table or to sit around and talk in the evening",
      "rating": 5.0,
      "verified": true,
      "author": "George A. Sifuentes",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "perfect!",
      "text": "This is exactly what I needed. There is a dim and a bright setting, which is bright enough to read by if you have those old fashioned book things you want to read outside at night. Easy to mount and operate.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin V Cattoni",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Check your size carefully.",
      "text": "I had to send it back because it did not fit around my umbrella pole. Otherwise I would have liked it. For the price it was sufficient and easy to install if it had fit.",
      "rating": 4.0,
      "verified": true,
      "author": "DANIKA",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "bright, easy to instal and good price",
      "text": "it was easy to charge and install. the LED lights are very bright and good lighting underneath outdoor umbrella at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry Lashkari",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Very bright",
      "text": "I've had a battery powered one for years, got tired of replacing the batteries. This one is MUCH brighter. I'm really happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "fordstreet",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "wonderful and very bright",
      "text": "We love it. It is bright and works great. My hubby put one on our flag pole facing down on our flowers. It looks so pretty at night",
      "rating": 5.0,
      "verified": true,
      "author": "maureen mccarthy",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "GREAT PRODUCT",
      "text": "it works like a charm and I like the fact that it has 2 brightness levels and is a snap to install",
      "rating": 5.0,
      "verified": true,
      "author": "James C. Smith",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Nice umbrella light.",
      "text": "The light has several settings and charges easily through a USB port. No batteries!",
      "rating": 5.0,
      "verified": true,
      "author": "jean o'brien",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Dont be fooled by the low price!",
      "text": "Wasnt expecting such a well made, durable or bright light for such a low price! Fits the umbrella perfectly. Provides light to relax by, eat by and play cards or other games. Really is a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannie",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Super light",
      "text": "This light works very well, easy to charge, use and super bright.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie Spain",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Great light for  the price.",
      "text": "I haven’t actually used the light yet at night. But I think it’s just what I want. Our umbrella broke and now we have a new one ready to try it.",
      "rating": 5.0,
      "verified": true,
      "author": "gail",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Not bright enough",
      "text": "I thought I'd use it more but it's not bright enough for what I needed",
      "rating": 3.0,
      "verified": true,
      "author": "Lonnie",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Quality product at an excellent price",
      "text": "Love this umbrella light! It holds a charge and the light has two settings. I use the brighter setting when playing a game at the table and the lower setting is perfect for dinner.",
      "rating": 5.0,
      "verified": true,
      "author": "Phyllis C",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "You can't go wrong with this lite.",
      "text": "Best product I purchased. I accidently left my patio umbrella out in dorian's heavy rains. When I checked it today . It works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "deezer",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Great addition to patio umbrella - highly recommended",
      "text": "Charges fast. Throws great light - fits perfectly. Would highly recommend and will likely purchase another for s second area. Battery charge lasts for weeks with average use. Very fast to re-charge. Just an overall great design.",
      "rating": 5.0,
      "verified": true,
      "author": "752-4",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Bright",
      "text": "I love these lights. Charge lasts forever. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "SBbeachbetty",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Very nice!",
      "text": "This was purchased for our outside patio umbrella. It fits perfectly and works great as of to date. The lighting is outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Liz",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great buy",
      "text": "Good product as described. You can put anywhere on your umbrella pole and will stay. Two settings for brightness good feature. Also LED lights so does not attract bugs. I would recommend to friends.",
      "rating": 5.0,
      "verified": true,
      "author": "lauren t",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "I would not buy again.",
      "text": "Light stopped working about 1 month after initial installation, not sure if it was defective but it’s no longer functional. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Edwin Orellana",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Failed!",
      "text": "Bought last June...used it maybe 7 or 8 times over the Summer (bought for use at a lake house). Charged it for over a day last weekend...will not turn on. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Music Maven",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Waste of money",
      "text": "I bought 2. One will no longer charge and I can't return it because I'm past the 30 days. Waste of money. Hope the other one kees workng",
      "rating": 2.0,
      "verified": true,
      "author": "Barbara Lindblad",
      "helpful_votes": 3,
      "publication_date": 20171120
    },
    {
      "title": "Great value and very functional",
      "text": "I like the two levels of brightness. Not easy to move down when the wind begins to blow.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Hewitt",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Satisfied",
      "text": "Easy to install and provides nice glow while eating dinner on our deck.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Received product quickly",
      "text": "Very disappointed, received what looked like something someone threw out. Scuffed, scratched, dirty and missing the charging cable. Obviously used, there is a label on it that is warn off so most likely out in the rain. I am returning and reordering, I hope to be able to provide a much more positive review on the new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Pat Markhorst",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Great patio umbrella lights",
      "text": "These are great. Easy to use, 2 light settings. Give a nice amount of light and they stay charged! I'm very happy with the product!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Atkinson",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Buy it! It works great, produces great light",
      "text": "Great light, works great. Brightens whole table. Hightly recommended this light",
      "rating": 5.0,
      "verified": true,
      "author": "ET",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "No Complaints...",
      "text": "It works as advertised. Nice and bright and last for hours. I was actually looking for something that had multi-colored LEDs and was programmable to do sort of an umbrella light show. Happy with the product!",
      "rating": 5.0,
      "verified": true,
      "author": "Randy C.",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Great Product",
      "text": "We really love our light, performs as advertised and maybe better. And know that this company stands behind their product and has GREAT customer service. A real pleasure doing business with these folks",
      "rating": 5.0,
      "verified": true,
      "author": "M L.",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "effectiveness",
      "text": "it works great used it for the first time over the weekend",
      "rating": 5.0,
      "verified": true,
      "author": "Willie Rosa",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Light last long time.",
      "text": "This light is bright and last a long time for plaing cards.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "A gift...",
      "text": "My friend loves it. Does not use batteries too quickly. Fit her umbrella. gives off a good amount of light.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Good buy!",
      "text": "Absolutely a must have for backyard/deck gatherings that lack overhead lighting",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Llorada",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Great lights",
      "text": "We have 5 of them lights the yard up nice when we have guests",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Bright light",
      "text": "Snaps on and off easy. Switch started acting up after a few times but it still works. Charging it takes a hr. Lasts long",
      "rating": 4.0,
      "verified": true,
      "author": "Marsha B.",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "I love this. Not only is it great outdoors",
      "text": "What a find. I love this. Not only is it great outdoors, we lost power and it did great inside rather than having to light candles. I love that it is rechargeable and so easy to use. I kick myself for not thinking of this first and hitting Shark Tank.",
      "rating": 5.0,
      "verified": true,
      "author": "bookreader451",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "I TOTALLY RECOMMEND THIS LIGHT",
      "text": "verry good ! it fits the Umbrella and gives bright light on full switch on or half light... Best and worse the Money.",
      "rating": 5.0,
      "verified": true,
      "author": "martina c.",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "As advertised",
      "text": "Took it out of the package, it worked, fully charged it and put it to use. WAS UNABLE TO REGISTER IT FOR 2 YEAR WARRANTY!! SITE NOT FOIUND. MADE IS CHINA.",
      "rating": 4.0,
      "verified": true,
      "author": "Radar Navigator",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Portable brightness.",
      "text": "Easy to charge, install, and remove. Bright enough to light up a patio table of 6. Having bought this light, also a battery powered light, and a solar powered umbrella, this light is hands down the best! Will also be taking it on camping trips, not just limited to home backyard use.",
      "rating": 5.0,
      "verified": true,
      "author": "jane ",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "So far so good",
      "text": "We have only used the light one time. It fits on our patio umbrella and both light settings work well. Don't look at the lights - very bright! I can't speak to how long the charges lasts, but the product appears to be as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted T.",
      "helpful_votes": 0,
      "publication_date": 20190416
    }
  ],
  "product_meta": {
    "title": "Patio Umbrella Lights, Rechargeable TOTOBAY 28 LEDs Cordless Umbrella Pole Light for Patio Umbrellas, Camping Tents and Other Outdoor Use, 2 Level Dimming Switch",
    "rating": 4.5,
    "feature_bullets": [
      "Upgraded patio umbrella light with 28 LEDs ,Brighter enough 400Lumens Max, matched USB cable, more convenient to charge though power bank, computer or wall charger.",
      "2 Levels Brightness (28LED/8LED): Turn on dim light with 8 Led, or full light with 28 LED to set brightness for nightly outdoor activities.",
      "Built-in 2pcs premium environmental-friendly rechargeable batteries (3.7V, 4400mAh) and the light will be on 18-54 hours after fully charged in 8 hours.",
      "Simply Installation, Cordless design with built-in flexible auto adjustable clamp, no tools required, just need to clamp to your sunshade, Pole mounted fit pole size from (0.78in to 2.04in) in diameter, suitable for most patio umbrellas.",
      "The light with top thick black ABS shell, portable and convenient ,you can charged on power bank or notebook power adapter,perfect for outdoor use, camping tent,nightly leisure time and more!"
    ],
    "specifications": {
      "Manufacturer": "TOTOBAY Direct",
      "Part Number": "T28",
      "Item Weight": "12.9 ounces",
      "Product Dimensions": "7.87 x 1.18 x 7.87 inches",
      "Item model number": "T28",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Style": "28LED Umbrella Light",
      "Finish": "ABS Shell & Plastic",
      "Material": "ABS",
      "Shape": "Bulb",
      "Power Source": "Battery-powered",
      "Voltage": "3.7 Volts",
      "Item Package Quantity": "1",
      "Type of Bulb": "LED",
      "Special Features": "Built-in Rechargeable Batteries",
      "Batteries Included?": "Yes",
      "Batteries Required?": "No",
      "ASIN": "B01K1QWIVG",
      "Customer Reviews": "4.5 out of 5 stars675 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#7,346 in Tools & Home Improvement",
      "Date First Available": "August 9, 2016"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Umbrella Lights",
      "Outdoor Lighting"
    ],
    "price": 20.99
  }
}