{
  "website_summaries": [
    {
      "verdict": "Top choice for intense exercise, including long-distance running.",
      "pros": [
        "Unique Velcro- and strap-free design ensures tight fit",
        "Pocket is large enough to hold key fob, money, cards, and even an inhaler",
        "Fits any size phone"
      ],
      "cons": [
        "Mesh pocket instead of plastic screen means that you can't easily use touchscreen"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good for running",
      "text": "I have issues with arm bands coming loose or not being tight enough to run in. I ordered them small, the fit is tight, no movement. It’s comfortable to wear. It fits the iPhone 10 with some extra room for a key or gel. Once your phone is in and on you don’t really have easy access to your stuff unless you stop running and take it off. I’m learning that if you sweat, it can take a few extra seconds to remove the band. Overall the quality is great, it’s well made, very comfortable, fit is ideal for running or jumping.",
      "rating": 5.0,
      "verified": true,
      "author": "When in Rome",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "A+",
      "text": "I got a small fits Perfect also holds my iPhone X with its wallet case and popsocket just fine doesn’t slide down my arm or looks too bulky. Material is amazing definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Casy023",
      "helpful_votes": 4,
      "publication_date": 20190901
    },
    {
      "title": "Best non slip arm band for running.",
      "text": "I run a lot and it’s very hot in Florida. This armband was awesome! It never slipped even when i was dripping sweat. It was super comfortable as well. I am 115 lbs and I got the smallest size. I would have given it 5 stars except the inside portion had a rip at the seam. It did not affect performance though. It would be hard to get to my phone except I have air pods and an Apple Watch. So I can change songs and volume without getting to the phone itself.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary S.",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "Best Running Band",
      "text": "My favorite running band to date. I’ve tried belts that just don’t stay put and ride up on me. This is snug around my smaller arms and I don’t have to worry about feeling like I have a large phone bouncing around.",
      "rating": 5.0,
      "verified": true,
      "author": "run2088",
      "helpful_votes": 2,
      "publication_date": 20190605
    },
    {
      "title": "Great for this style of holder",
      "text": "Great little phone holder during runs. I have an 9.5” bicep circumference and it fits nice and snug both alone and with a phone. The only negative things about this type of holder is that it’s not very easy to access the phone quickly, and your phone is basically sitting in a wet holder for the duration of your workout if you sweat. But for what it is, this is a great product. I’ve used this every day for 2 weeks and hand washed it each time after use and it hasn’t affected the elasticity yet. Time will tell how well it holds up, but the material is pretty good so I’m not concerned.",
      "rating": 5.0,
      "verified": true,
      "author": "Lewis",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "good quality but too snug",
      "text": "I was hoping to replace an older armband made of a stretchy nylon, but this was unfortunately too tight to wear for long. Small was the recommended size for an almost 11 inch bicep, but it was uncomfortably snug even without a phone. The quality is good, - but the material is not as stretchy as I wanted and was too compressive. Still keeping it tho, just wearing it on my forearm where its more comfortable...",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Simple no nonsense device sleeve",
      "text": "Exactly what I had in mind, no Velcro... or anything that can rub.....simple, sleek. Works awesome holding my Samsung S 8+ I ordered the small. I use it at the gym on the elliptical and weight machines. I chose the black but I am sure the colorful ones are great as well. Great product for a decent price. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Best running arm band I’ve bought!",
      "text": "I love this arm band! It’s not bulky or restrictive and I barely notice it’s there while running. It does tend to smell (for me) if you use it repeatedly for running/exercise without washing it but the material is washable so I just throw it in the washing machine and let it air dry afterwards. As for sizing, I am a medium sized woman (BMI of 23.7) and the small fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "I like to tuck my cord in the same pocket so ...",
      "text": "Honestly, I was hesitant in buying this. I've had other armbands that I've had to become a contortionist with just to have them strapped in. Plus, I like to tuck my cord in the same pocket so it's out of my way. This thing is awesome. I can easily shove my phone and wire in there, and pull it up on my arm. It doesn't get in the way, it's comfortable and sleek and stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170302
    },
    {
      "title": "Love it",
      "text": "Love this and use it all the time. Material is strong and wicks away the sweat from the phone too.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Antonini",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Love!",
      "text": "I really love this! It holds my phone and my car key whenever I go running with my dog. I have beats headphones so I just throw those on, pick a pandora station, and put this sleeve on. It’s good material.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Comfortable",
      "text": "This is definitely one of the more comfortable arm bands I’ve tried. I would suggest sizing up a bit. The only thing I wish I could do is change my the song when I’m listening the music. But I’ll take that over some itchy Velcro band.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Ringer",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "but I’m super excited to use this when the weather isn’t so ...",
      "text": "I’ve only used this for a quick walk, but I’m super excited to use this when the weather isn’t so arctic in the Midwest!! This was snug on my arm and super easy to figure out. I wasn’t worried about it slipping off or anything. I would definitely purchase more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "AMason",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "It fits way better than those huge plastic/velcro contraptions with the see through ...",
      "text": "It fits way better than those huge plastic/velcro contraptions with the see through window for the phone. It's so much more comfortable, it stays in place and I'm not showcasing my valuables to the world. Definitely better used with a preset playlist though as getting your phone in and out of it is something you only want to have to do at the beginning and end of intended use.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashlee",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "It doesn't slip and although it doesn't have a hole for the head jack it simply folds right over and it's pretty sturdy, I've been using it and have had ...",
      "text": "I have been searching for an arm band for my small arms! It doesn't slip and although it doesn't have a hole for the head jack it simply folds right over and it's pretty sturdy, I've been using it and have had no accidents. You can also wash it! That's a plus. All my other arms bands had plastic so I didn't really wash them, anyway love this! I'm 5'1\" and 103 lbs I bought the small",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Flores",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Nice non-bulky armband!",
      "text": "I wore this armband today while hiking. My iPhone 8 Plus fits just fine, and it was pretty comfortable. I have tiny arms so I went with the small. I would definitely recommend it if you don’t like the big Velcro style armbands.",
      "rating": 4.0,
      "verified": true,
      "author": "c.b.",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Comfortable band.",
      "text": "Great band. Holds my LG v40. Did not slip, move, or slow me down during my work out. Really impressed with the comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy E. Lessner",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Workouts Made Convenient",
      "text": "I like how it has made my workouts easier when my jogging pants don’t have pockets. The only thing I dislike is that when I need to use my phone, I need to stop what I’m doing and take out my phone.",
      "rating": 5.0,
      "verified": true,
      "author": "medleclectic",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Runs small",
      "text": "The fit is a little tight. I ordered a med bc I have an iPhone 7+ and wanted to make sure it fit with that in there even though I figured I wear a small. It’s still tight and would be better if there was a hole for my headphone jack. I’ll keep it though, it’s fine for the money",
      "rating": 3.0,
      "verified": true,
      "author": "Dynamite Nelson",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Good work.",
      "text": "Bought this for my girlfriend and she loves it when she runs... she is 5\" 4' and is smaller but still has a iphone 7 lol! It fits around the phone well and wraps around her arm well... This is, no joke, the 5th or 6th arm band she has tried and the MUV365 is it for her... Entire process smooth and you could tell with the emails this seller cares... Good work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171012
    },
    {
      "title": "It is super snug, but I'd rather it be this way ...",
      "text": "I purchased the size S (<11\") although my bicep measures a circumference of 11.5\". It is super snug, but I'd rather it be this way than risk a band that was too loose (M, which spec'd at 11-14\"). Because of this, I have to put the phone into the armband before I pull it up onto my arm. removing/placing the phone is impossible without pulling it off entirely, which is not a problem for me, but may be a consideration point for others.",
      "rating": 5.0,
      "verified": true,
      "author": "scheeters",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Very simple. I used it while working out today ...",
      "text": "Very simple. I used it while working out today and it made life much easier - I use an iPhone 7 Plus and it fit perfectly but there wasn't much room for keys or anything else. If I have any suggestion it would be to make an adjustable version that can fit an iPhone 7 plus. I would definitely buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sun",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Order one size up if you don't want it to pinch your arm",
      "text": "I love It. I weigh 124 and I am 5'5. I have an iPhone 7 Plus. I thought A small would be fine, but I exchanged It for a medium. It fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie Ledesma",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Although I like the product",
      "text": "I am 5\" ft tall and weigh 100 lbs. I got size \"S\" thinking this would be my size, but I am only able to use the armband on my forearm and it is already very tight, which means I definitely cannot use it on my upper arm. I thought that getting this size would fit me because I am a small person with skinny arms. Although I like the product, I think that I'm gonna have to buy another one of these in size Large to fit my arms, but I really don't want to have two, nor do I want to spend my money on another one.",
      "rating": 4.0,
      "verified": true,
      "author": "Daysi L. Espinoza",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Meh",
      "text": "The idea is cool but it is REALLY tight and not super easy to get stuff in and out. Would be ideal for holding a key or chapstick...not ideal for a phone/lrge iPod",
      "rating": 3.0,
      "verified": true,
      "author": "Olivia B",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "From the first time she used it she loved it. Her gym buddy loved the way it ...",
      "text": "Ordered one for my wife for her gym sessions. From the first time she used it she loved it. Her gym buddy loved the way it looked so I ordered one for her as well. Now she loves it. Product is very snugged to the arm. Your phone will definitely stay in place. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Good for small arms",
      "text": "Fits nicely on my small arms. I'm about 127lbs for reference. iPhone 7+ stays put during workout and band is easy to get off. I bought a size small.",
      "rating": 5.0,
      "verified": true,
      "author": "OBZO",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "I'm a runner and this is the best armband I've ever owned",
      "text": "I'm a runner and this is the best armband I've ever owned! Running a marathon this weekend and needed an armband that won't cause chafing. This is perfect! Been training with it and it's been soft on skin, feels tight and secure, doesn't move around like the other typical armbands. The only thing is since it's fabric, it obviously doesn't have the clear face so you can see your phone. But I use Bluetooth headphones so I can hear my running tracker rather than look at it. Love this armband!",
      "rating": 5.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "Sizing is good",
      "text": "This is my daughter's. She has pretty thin arms and this fits well",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Schmoe",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Great for people with small arms",
      "text": "I have small arms, and this armband fits perfectly. I'm able to run without it sliding around. After running, I use it to carry my headphones as well.",
      "rating": 5.0,
      "verified": true,
      "author": "oakley121511",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Good product",
      "text": "It works perfectly. It stays on my arm just fine while working out.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Just fine",
      "text": "Not exactly sweat proof or easy to use with head phones but a good product none the less",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Not comfortable, but I believe I bought a size too ...",
      "text": "Not comfortable, but I believe I bought a size too small. I have an Iphone 6 Plus and it is difficult to get it tucked into place. Not to mention, it needs constant adjustment.",
      "rating": 2.0,
      "verified": true,
      "author": "Irene Rodriguez-Robles",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Nice look..room for improvement",
      "text": "Loved the material and sleek fit of product which is why i purchased. I bought for myself but was too small so my petite daughter tried which fit better for her. But she said the hole for your earbud wire was a bit off to the side making it unstable and could pop out the phone.",
      "rating": 2.0,
      "verified": true,
      "author": "msbree",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "MÜV365 IS THE FUTURE",
      "text": "Doesn't chafe skin, not bulky at all, doesn't move around like other products. Will recommend to all fitness buddies. - 10 year bodybuilding veteran with all sorts of accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "ACE",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Great product, great value!",
      "text": "Very comfortable. Cool security in having my iPhone next to me on a walk and my wife uses it on her daily walks. I may have to buy another!",
      "rating": 5.0,
      "verified": true,
      "author": "AJ Vel1147",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Try it, I like it",
      "text": "Little weird to put on, wish there were a hole for ear buds, but great for the gym.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly Sampson",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Simple and effective",
      "text": "Love it. Fits great, holds any phone (no need for a new one each time I replace my phone!), doesn't scratch or slide around my arm.",
      "rating": 5.0,
      "verified": true,
      "author": "MSeg",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Excellent arm band for the price!",
      "text": "Excellent arm band! I have very small arms, so I generally have trouble finding an arm band small enough to fit my arm, yet large enough to hold an iPhone 7 Plus with an otter box defender case. Very comfortable fabric, that stretches well to hold my phone. Does the job well, and doesn’t slide down during my run!",
      "rating": 5.0,
      "verified": true,
      "author": "Runner",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "so much more comfortable than the bulky plastic/velcro things we were using",
      "text": "loving this armband! so much more comfortable than the bulky plastic/velcro things we were using. not only is it highly fashionable😉 it fits perfect(i ordered small and my arm measured exactly 11\") and is super comfortable during workout! price is great shipping was fast you must order this armband!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Very nice",
      "text": "Better than what I was expecting. I use it solely to cover a native fistula and works better than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "perfect for all occasions",
      "text": "excellent for on the go, gym, jogging , or just out for a walk or hike. Works perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Spankiz",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Owner emailed me super nice. Nice to know they're small businesses out ...",
      "text": "Soft and comfy and looks cute on. Fits to your arm. Owner emailed me super nice. Nice to know they're small businesses out there that care and put pride in their products.",
      "rating": 5.0,
      "verified": true,
      "author": "bbalencia",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Five Stars",
      "text": "Love the armband and comfortable. Glad I chose this style. Ty for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Surfin",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Useful & Good Quality",
      "text": "Awesome band! Fits up to iPhone 7 plus. Doesn't move up or down your arm if you get the right size.",
      "rating": 5.0,
      "verified": true,
      "author": "Minoo Razavi",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable and stylish! Thank you for a great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "katrina",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable and keeps my phone and key where they need to be!",
      "rating": 5.0,
      "verified": true,
      "author": "LG",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Can't Access During Workout",
      "text": "I ordered the black armband in small. Once the music devise or phone is put within the armband, you will not be able to access it again until after your run or workout - so if you want to change your playlist or check your time, etc, this is not the armband for you. I found it difficult to get the device in and out of the pocket and then slipped onto my arm. I could not then slip the devise back out of the armband during my run. This is a good choice if you are going on a long run and don't need to change up your music.",
      "rating": 2.0,
      "verified": true,
      "author": "TwinMom",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Five Stars",
      "text": "Absolutely love this band! So much better than any I've ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonja Halvorson",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Three Stars",
      "text": "I love it, but the stiching is already unraveling with one washing. It says it is machine washable.",
      "rating": 3.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "I love it! Best running armband I ever had",
      "text": "I love it! Best running armband I ever had. very comfortable and doesn't slide down my arm while running. Would recommend this to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita Stautberg",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "It seems like the fabric should stretch more",
      "text": "This product is hard to use. The fit is very tight and uncomfortable. It seems like the fabric should stretch more. The pocket is too shallow to fit the phone in so it always feels like it is falling out. I do not recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "Cinshep",
      "helpful_votes": 4,
      "publication_date": 20161230
    },
    {
      "title": "Love the versatility",
      "text": "Love the versatility. I can put it around my wrist or around my bicep, depending on what exercise I'm doing; and I can use it for any phone or even mp3 player (which I've been using more often in gyms with less-than-ideal wifi/network connection.) It also seems relatively sweat resistant. Much better than keeping my device in my pants pocket, where they tend to get slightly foggy. Makes my life easier, so I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "... as a soldier This Fits in to my lifestyle like a glove",
      "text": "This Fit Perfectly and as a soldier This Fits in to my lifestyle like a glove",
      "rating": 5.0,
      "verified": true,
      "author": "Vonnie Kowaski",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Comfortable!",
      "text": "Really happy with this armband!!! Thick fabric, felt secure and held my iPhone 7 and two gel packs comfortably for 13 miles!! Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Moyer",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Five Stars",
      "text": "Such a great product! Exactly as described and exactly what I was looking for!! Thank you sooooooo much!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "for some reason i thought it was coming with the ...",
      "text": "for some reason i thought it was coming with the ear buds. So i will probably give it away.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "wow great product. Then",
      "text": "At first I though, wow great product. Then..... every-time you want to skip a song, or you lose connection and need to reconnect, you gotta take it out of the sleeve, which is a pain in my neck. If you want to see how far you've ran or how long you've ran, gotta take it out again. some see through mesh would have been a better design.... I don't use it anymore because it is so inconvenient.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "One Star",
      "text": "Garbage....ended up throwing it in the garbage. Total waste ! DON\"T BUY !",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Miller",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "No hole for head phone cord",
      "text": "This arm band is awesome The only thing missing is a hole for your headphone cord so that you don’t ruin the cord because you have to fold the arm band around it.",
      "rating": 3.0,
      "verified": true,
      "author": "Cate Perkins",
      "helpful_votes": 0,
      "publication_date": 20171119
    }
  ],
  "product_meta": {
    "title": "MÜV365 iPhone Armband for Runners | iPhone 11, X/10, 8, 7, 6, 6S, Samsung Galaxy S10, S9, S8, S7, S6, A8, Note 8, Plus Sizes Running Phone Armband for Women and Men",
    "rating": 4.1,
    "feature_bullets": [
      "IT’S A [GAME CHANGER]: While other running armbands for women and men are bulky, have an uncomfortable fit due to fabric, plastic and velcro components and don’t accommodate a variety of phone models... our workout sport armband takes a totally different approach by giving you ultimate comfort with our lightweight performance fabric that is velcro free and can FIT ANY SIZE PHONE with slim-line case (up to 7 in.).",
      "MULTI-FUNCTIONAL [USES]: Whether you are running, hiking, taking the dog for a walk, travelling or visiting an amusement park, you will find this armband is the perfect solution to safely store your cell phone, keys, money and/or cards. It is so light you won’t even know it’s there. The flexible fabric stays firmly in place so you won’t have to pull, tug or readjust while maintaining your active lifestyle.",
      "WHAT OUR [CUSTOMERS ARE SAYING]: \"Phone fits nice and snug and is really comfy. Great quality armband. Holds my phone and key fob. More comfortable than my plastic and velcro holder. Great for hands free walking while listening to music. Hold my phone with case on it. LOVE IT! Very comfortable for running, cycling. I use a wireless headphone so this is perfect when I'm on my mountain bike or tri bike. As advertised - breathable, easy to use, stays in place during light runs or gym workouts.\"",
      "PROBLEM [SOLVED]: No more chaffing, no velcro, no pinched skin, no slipping, sliding or banging! You will love how easy this armband is to slip on and off; keeps you from having to carry items in your pocket; doesn’t weigh you down; and keeps your hands free of clutter. Additionally, your visibility will be enhanced at night or in low light with our MÜV logo!",
      "FIND YOUR [FIT]: To find your perfect fit, please measure your bicep and choose accordingly: SMALL: <11\", MEDIUM: 11\"-14\", LARGE: 14.5\"-17.5\". We recommend if you are close/in between sizes to choose smaller size for a tighter and firmer fit."
    ],
    "specifications": {
      "Package Dimensions": "10 x 7 x 0.2 inches",
      "Item Weight": "1.6 ounces",
      "ASIN": "B01KMMYS2G",
      "Item model number": "4348680525",
      "Customer Reviews": "4.1 out of 5 stars1,082 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#8,803 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "CE",
      "Form Factor": "Armband",
      "Colour": "Black",
      "Manufacturer": "MUV365",
      "Date First Available": "August 18, 2016"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Electronics",
      "Armbands",
      "Cases, Holsters & Sleeves"
    ],
    "price": 12.99
  }
}