{
  "website_summaries": [
    {
      "verdict": "A great option for the man who wants a classic bomber look in a nylon style.",
      "pros": [
        "Owners felt this jacket was a good value for the cost and is warm, well-made, and wears well over time",
        "It also rates highly for its numerous pockets, comfortable fit, and durability"
      ],
      "cons": [
        "Tends to run small"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It fit him incredibly well and he loved it. He just beamed",
      "text": "We bought this for my 95 year old father in-law and put a 5th Army Air Force patch on it for his birthday gift. It fit him incredibly well and he loved it. He just beamed!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelleyz",
      "helpful_votes": 10,
      "publication_date": 20170716
    },
    {
      "title": "Quality and fit is exceptional.",
      "text": "Surprised at the quality and finish on this jacket. I wore this through the winter. It was warm enough for the average 40 deg. NY weather. I am writing the review now, because I just used it for a motorcycle ride on an unusually cool (60 deg.) July morning. My leather would be too warm, and this jacket was perfect. What makes is work is the fit, and the wrist and waist bands. It was the perfect weight, but also the perfect wind breaker. This is an extremely versatile jacket that looks great and wears well.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Macaluso",
      "helpful_votes": 2,
      "publication_date": 20180723
    },
    {
      "title": "Basic jacket, a little on the small side it costs more than it should",
      "text": "Good for spring and fall weather, pretty light, I bought a Large and it's more like a Medium, so if you like your jackets on the loose side to wear a sweatshirt or flannel underneath you might opt for ordering this jacket one size up. Edit: I've decided to return this jacket for 2 reasons, it's just a little to small for a large, and I'm seeing similar jackets at Amazon that are much less expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike H.",
      "helpful_votes": 4,
      "publication_date": 20180303
    },
    {
      "title": "Perfect - Better Than Expected!",
      "text": "Slightly more insulation than I thought from the description, but that makes it perfect for me - I didn't want the \"puffier\" version of the original MA-1 that I wore in the Air Force. The fit is pretty slim, but again, that's what I wanted. I am 5'11, 180 lbs, 34\" waist, 33\" sleeve, 16.5\" neck. I bought a size \"L\" and it's perfect for me. If you are heavier, you might feel this is too snug. Construction is great and I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ricky Spurrs",
      "helpful_votes": 2,
      "publication_date": 20190111
    },
    {
      "title": "Very nice, good quality and price",
      "text": "Very nice, good quality and price. However this is a gift, if I receive feedback, I will post at a later time. I was surprised by the color of the lining, a bright orange but I am told this is common...........:)",
      "rating": 5.0,
      "verified": true,
      "author": "History enthusiast",
      "helpful_votes": 3,
      "publication_date": 20170515
    },
    {
      "title": "One of the best bombers around.",
      "text": "This jacket fits great, fitted but not too snug or too loose. Price is great too. Higher quality than most of the designer bomber jackets that are 5x to 10x more.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Durden",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Great looking Jacket -- UPDATE Quality problem",
      "text": "UPDATE** After Wearing for 6 weeks the collar and sleeve cuffs starting 'pilling up badly. It's apparently poor material. Great looking Jacket! Looks very military. Great looking color too (Olive).",
      "rating": 2.0,
      "verified": true,
      "author": "ts twain",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Awesome style for me, fits ok",
      "text": "The jacket is very nice. Comfortable to wear. Perfect for chilly weather. Also fashionable for jeans or khakis. The fit isn't perfect but not enough to complain. I enjoy this jacket.",
      "rating": 4.0,
      "verified": true,
      "author": "I'm J. :)",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "PERFECT JACKET",
      "text": "COMFORTABLE, PLENTY OF POCKETS THAT ARE SECURE, GOOD LOOKING, QUALITY.",
      "rating": 5.0,
      "verified": true,
      "author": "Al & Josie",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Quality Classic Black Jacket",
      "text": "Love the look and feel of this jacket for the price. It's not ultra thin for summer, but then it seems designed for spring and autumn use. I actually appreciate the slightly thicker material as it better fits a slender, athletic frame.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Edward",
      "helpful_votes": 2,
      "publication_date": 20170713
    },
    {
      "title": "Nice Jacket",
      "text": "I'm liking this this jacket a lot. I'm about 5'9\", 265... definitely a stocky guy. A bit snug, but very comfortable. And lots of pockets. Heavy duty zipper.",
      "rating": 5.0,
      "verified": true,
      "author": "Tman",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "A great jacket for temperatures above freezing",
      "text": "A great jacket for temperatures above freezing. Fits well, looks great (it was quite wrinkled out of the box though), and wears exactly as I like my jackets. I'm ordering another one in blue.",
      "rating": 5.0,
      "verified": true,
      "author": "siop5c",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Very well made MA-1 Jacket.",
      "text": "This MA-1 is very well made. I recommend this Jacket to those looking for a MA-1. Good Stiching, a Good pockets design. I’m 5’11” medium frame and a XL fits just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis R Klein",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "classic can't go wrong",
      "text": "these are great jacket and I really like the style. They are comfortable and sturdy, which I like. I get compliments from people about this jacket. great find",
      "rating": 5.0,
      "verified": true,
      "author": "Youngster",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "Nice stylish and a good price poor in selection when come to clor,,,,",
      "text": "I like my jacket and I like to have more selection in color....is good for active people...",
      "rating": 4.0,
      "verified": true,
      "author": "Pierre Stephan",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Very Nice!",
      "text": "Just received the jacket yesterday and couldn't be more pleased. It's very well made and the fit is right on. I'm 5'9\" 155 and bought a medium and it fits perfectly. Also,the price and fast shipping sealed the deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Buzz",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Five Stars",
      "text": "This jacket is much better than my other flight jacket. (I wore one for 28 years in USMC).",
      "rating": 5.0,
      "verified": true,
      "author": "Walter J. Hofman",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Very comfortable",
      "text": "I like the ample inside pockets as well as the double outside pockets. The jacket is very comfortable, but it is just getting cooler here in New York so I can't tell how warm it's going to keep me yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard R. Borgner",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Cool vintage feel...",
      "text": "Ordered this jacket but was sent a different jacket. Had to exchange. Was worth the wait. Awesome jacket! Ordered a small fits perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Pioneer30",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Four Stars",
      "text": "quality is good, a little be pricey, but I like it",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Five Stars",
      "text": "Excellent fit...not shiny or swishy. I used this jacket for the entire northwest winter. Top notch!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Good coat",
      "text": "XL size. I wear a 46 sport coat. Well made.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard S.",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Just what I wanted...Motorcycle jacket...Pockets galore...",
      "text": "I m 5'11\" 260 husky build. Got the XXL looks and fits great. Usually tight fitting in chest. This one is just about right. Pockets more than adequate, inside and out, lots of pockets!! Lighter than expected, needed early spring to fall jacket, this one works. Metal zipper is nice, no cheap plastic one. Gonna use for motorcycle riding, snaps on pockets will securely hold my stuff...Did l mention it's got pockets...lol",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 5,
      "publication_date": 20170320
    },
    {
      "title": "Many Pockets!",
      "text": "Loved that this jacket has seven pockets total. Warm and stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "Young",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Fit was perfect, excellent quality",
      "text": "This coat was a hit with my 18 year old grandson. Fit was perfect, excellent quality. He has worn it every day since Christmas and says it is warm. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "VScan",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Very durable nylon shell fits us sizes",
      "text": "excellent quality flight jacket nylon shell is much more durable than the polyester used by most other brands a lot of pockets",
      "rating": 5.0,
      "verified": true,
      "author": "joe denver",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "and the quality is very good when considering the price",
      "text": "The jacket fits just right, and the quality is very good when considering the price. It is a little heavier weight than I imagined - would be too warm if you are looking for something very light but should work for most moderate temps",
      "rating": 5.0,
      "verified": true,
      "author": "Darryl Schlottman",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Nice twist to the classic MA-1 jacket",
      "text": "Nice twist to the classic MA-1 jacket. Nice slim fit and does not bulge up like the original ones. Can easily be worn with jeans or slacks and it looks good either way.",
      "rating": 5.0,
      "verified": true,
      "author": "DEF",
      "helpful_votes": 8,
      "publication_date": 20161222
    },
    {
      "title": "Five Stars",
      "text": "The quality is very good and the sizing is right.",
      "rating": 5.0,
      "verified": true,
      "author": "yvoel",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "Jamagel Love",
      "text": "I'm 6',slim with long arms.the large is a great fit for me...sleeve length is excellent,the body is just a tad big but it fits the style of the jacket...no complaint....its all Jamagel",
      "rating": 5.0,
      "verified": true,
      "author": "Jamagel",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Great option!!",
      "text": "Needed a jacket that I could wear in windy ass chicago while still looking fly, this jacket kept me warm and stylish all at once, good investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Eissen",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Good - But Runs Small",
      "text": "Arrived promptly, but apparently runs 1 size too small. So I bought the next size larger. This fits in all dimensions except sleeve width. Which works, but seems a little bit tighter around the biceps than it should. And no, I haven't been working out at the gym.",
      "rating": 3.0,
      "verified": true,
      "author": "Tah-Dah",
      "helpful_votes": 5,
      "publication_date": 20170101
    },
    {
      "title": "PERFECT",
      "text": "I am extremely happy with the jacket. It is really stylish and fits nicely on me. I'm 6'2 and 200 pounds and L is just the perfect fit for me.",
      "rating": 5.0,
      "verified": true,
      "author": "sunshine",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Lots of pockets and a great fit.",
      "text": "I really like this jacket. And for around $30 it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "George F",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Awesome! I look like a pilot",
      "text": "Very good fit and cool look. Pockets on the inside are a bit weird as they are sideways and stuff may slip out. Overall, still great.",
      "rating": 5.0,
      "verified": true,
      "author": "Leke",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Awesome",
      "text": "I’m 6ft2 in 200 pounds. Fits perfectly with room to wear a sweatshirt underneath!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew L Coffman",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Looks Good",
      "text": "The worst thing is when I saw it was made in China.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Really like the fit",
      "text": "Really like the fit. It keeps you warm. I like the 2 pockets on the inside of the jacket. It's a nice feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Very, very nice. High quality look and feel",
      "text": "If you are at the top of the size chart or the next size and you will be satisfied. I am 6' and 230 lbs the XXL fit perfectly. The jacket is high quality bomber style with lots of pockets. I ordered the olive color because it was on sale for <$30. It is very dark olive (almost black indoors). Very elegant looking and feeling nylon jacket. Just the right weight not overstuff like some in this style.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170420
    },
    {
      "title": "Four Stars",
      "text": "dark olive is a good color bought one in lg...... inside pockets are snap not zip. good sturdy main zipper. very good buy... bought a black one also... this one in med..... fits a little more snug but good...",
      "rating": 5.0,
      "verified": true,
      "author": "Willard G. Johnson",
      "helpful_votes": 4,
      "publication_date": 20170214
    },
    {
      "title": "Four Stars",
      "text": "I like it very much, warm and fashionable, but it's at a discount $9.00 after bought.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Very nice jacket, only thing to keep in mind the ...",
      "text": "Very nice jacket, only thing to keep in mind the inner fabric is bright orange, but the jacket feels great, lots of pockets without looking bad.",
      "rating": 5.0,
      "verified": true,
      "author": "ADV86",
      "helpful_votes": 2,
      "publication_date": 20170322
    },
    {
      "title": "Good flight jacket.",
      "text": "Good pockets and construction. Looks good. Get next size up to ensure roomy fit.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Patterson",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Soft and comfortable. 2 snap pockets on the outside and inside ...",
      "text": "Very well made jacket. Keeps me warm down to 30 degrees. Soft and comfortable. 2 snap pockets on the outside and inside plus a hand pouch behind the outside pockets to keep your hands warm without needing to unsnap the other side pockets. The green color is very dark and classy looking. Love this jacket. Great deal at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony B",
      "helpful_votes": 3,
      "publication_date": 20170131
    }
  ],
  "product_meta": {
    "title": "Levi's Men's Ma-1 Flight Jacket",
    "description": "Unfilled ma-1 flight bomber jacket with front zipper closure",
    "rating": 4.6,
    "feature_bullets": [
      "100% Nylon",
      "Imported",
      "Machine Wash",
      "Lower snap flap and double entry pockets",
      "Rib knit collar, cuffs, and waistband",
      "Interior chest zip pockets",
      "Levi's signature red tab on side seam"
    ],
    "categories": [
      "Shells",
      "Men",
      "Active & Performance",
      "Clothing, Shoes & Jewelry",
      "Clothing",
      "Jackets & Coats"
    ],
    "price": 66.39,
    "specifications": {}
  }
}