{
  "website_summaries": [
    {
      "verdict": "An excellent set that works both indoors and out. Consistent performance makes this one an easy favorite.",
      "pros": [
        "Bright illumination",
        "Easily connects to other strings",
        "Packaging makes it simple to set up right out of the box",
        "Connects to extra sets",
        "8 settings – combination, waves, sequential, slow, flash, slow fade, twinkle, and steady",
        "Can truly be used either indoors or out"
      ],
      "cons": [
        "No remote control",
        "Long distance between vertical strands"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Tangled nightmare that I can't even hang",
      "text": "I purchased these and they came tangled so bad I really just left them in the box to deal with another time. I finally took 2 hours to detangle them only to find out they're crap they light up fine but I can't hang them because they don't hang like the picture shows. I just can't believe the time and money I wasted on these.",
      "rating": 1.0,
      "verified": true,
      "author": "Jackee",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Dangerous Glass Shards in Box!",
      "text": "I ordered four boxes of these for a wedding reception. The lights work fine. However, all four boxes had shards of glass in them upon opening. At first, I thought some of the bulbs had broken during shipping. Upon closer look, I realized the shards were much larger than the size of the bulbs, so I have no idea where they came from. As we pulled the lights out of the box, glass started falling everywhere onto the floor. This is so dangerous and I have no idea how this product could have passed any type of quality assurance test.",
      "rating": 1.0,
      "verified": true,
      "author": "Megan Sparks",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Love!",
      "text": "These are so stunning I may just leave them up all year! I bought 3 strands and would honestly buy more if i needed them. I tested the waterproofing and they are definitely waterproof! I love all the different settings and the way they make my patio look. Just a heads up; do NOT take The twist ties off before you hang them up. I made the mistake of taking all the ties off and then had to untangle them for about half an hour lol Both my mom and sister asked where I bought these lights so YES I would definitely refer these to others. You won’t be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklyn",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "DO NOT WORK!",
      "text": "DUDS!!!! Dang we are so disappointed! My son got these for his birthday and had to clean his room in order for me to help him hang them (incentive), well he put them under his bed in the box for awhile and by the time he finally got his room clean, we hung them and realized they don’t even work. So disappointed. As you can see they are still rolled up in the original way. Advice would be to test upon arrival and then don’t get your hopes up that they’ll last long.",
      "rating": 1.0,
      "verified": true,
      "author": "H. Larochelle",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Buy literally any other lights",
      "text": "1- the width of this curtain is NOT 9 ft long, at least not the part with the actual lights. 2- part of the cable is black rather than transparent so it’s an eyesore 3- the “changing” part of the control doesn’t change anything so the lights are just stuck on flickering mode. This as my second set of these as the first arrived with only every other light working.",
      "rating": 1.0,
      "verified": true,
      "author": "OK",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Didn't even work once...",
      "text": "When I received these lights, I had to untangle them. Most of it was not twist tied like the instructions say they should be. When plugging them in and turning them on, none of the lights turned on. There was also a whole other section of the lights that did not connect to the section with a plug. There are two ends that looked like they had been cut. (Photo attached) I wonder if someone had sent these back before and they just re-shipped it to someone else. I hope that is not the case. Luckily, I opened these within the return window. Such a disappointment though, I was super excited for these. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "I would hate to see someone disappointed by this purchase",
      "text": "I bought this very early for a Christmas present. We hung the lights in our daughter's bedroom; they worked for a few hours, and then stopped. Now we get a message that it is too late to return. They weren't very expensive, but it is disappointing. I would hate to see someone disappointed by this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Philosophically Bent",
      "helpful_votes": 497,
      "publication_date": 20180102
    },
    {
      "title": "DON'T BUY FOR ONGOING OUTDOOR USE!",
      "text": "Initially I loved these lights . . . the look and the ease of putting them up OUTdoors (as advertised). I used two sets for the 2018 holiday season. I left one set on our patio pergola for ongoing festive lighting. They were occasionally used Jan-Mar 2019. Then NOT! The lights were checked out by my husband and brother-in-law (an electrical inspector). Turns out the wiring is MADE FROM A FERROUS METAL!!! Ferrous metals rust (see attached photo)! Next time I will be looking more closely at what materials are used in the construction of any outdoor lights I buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Lynn S",
      "helpful_votes": 679,
      "publication_date": 20190427
    },
    {
      "title": "Several strands won't stay lit.",
      "text": "I was so excited to get these but I'm really upset about the quality. I have several strands that just won't light up and they are NOTHING like the picture. If you think you're getting a nearly solid curtain of lights, like the picture, you're not. They are spaced out every 5-6 inches and you'd probably need three-four sets to get the effect of the picture and that's if the strings work. I only bought these because I saw someone on Youtube raving about how hers lasted for three years. Maybe I got a bad set.",
      "rating": 1.0,
      "verified": true,
      "author": "Exit Light",
      "helpful_votes": 208,
      "publication_date": 20180313
    },
    {
      "title": "Easy to hang and has multiple settings",
      "text": "So easy to hang! It has multiple lighting effects and is so mesmerizing. Perfect for parties and looks amazing in boomerangs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 175,
      "publication_date": 20190108
    },
    {
      "title": "Didn't receive correct color of lights.",
      "text": "I bought 4 boxes of these and got them very quickly and they seem gret BUT they are definitely all blue led lights NOT \"warm led lighting\" like stated in the product discription. I would really like to return them and have them switched for the warm lights if possible. (picture shows the lights I purchased on the left and what I expected the color to match on the right)",
      "rating": 1.0,
      "verified": true,
      "author": "Olivia Reynolds",
      "helpful_votes": 630,
      "publication_date": 20171022
    },
    {
      "title": "Hygge life!!",
      "text": "#Hyggelife... super easy to put up. Advise: don't untie the twist ties until you have it up completely, then save them to use evenly throughout the line to attach to the rod and keep it from dropping. They're rather long, so I considered somehow securing the bottom of each strand to the main line so it didn't drag so much. Lights do not get hot at all, but I still unplug when I'm not home just in case. Going to buy another set later to hang outside on our screened-in porch in the backyard <3",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Edgerly",
      "helpful_votes": 123,
      "publication_date": 20190113
    },
    {
      "title": "I thought it was obvious from the pictures (if you bother to look farther than just the first one) that the strands are spaced pretty far apart",
      "text": "I bought two sets to overlap on each other. I thought it was obvious from the pictures (if you bother to look farther than just the first one) that the strands are spaced pretty far apart. My problem with the lights is that both sets were completely defective right out of the box. Didn't even work for a second. We tested all the connections, the outlet, and different parts of our setup to make sure it was the lights, and they're both broken right out of the box. Cheap, poorly-manufactured crap. Please don't waste your time or your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 611,
      "publication_date": 20180722
    },
    {
      "title": "Yellow Not In A Good Way",
      "text": "The lights aren't white at all. They're yellow and unattractive. If you're looking for string lights that give off entirely yellow light these are the ones. They aren't great holiday lighting. If you reference the photo, the lights in the top pf the photo are white led string lights previously purchased from Amazon. The ligh cluster below are the curtain string lights. You can see how terribly yellow they are. They're unattractive IMO and I will be returning them.",
      "rating": 1.0,
      "verified": true,
      "author": "Honest P",
      "helpful_votes": 173,
      "publication_date": 20191208
    },
    {
      "title": "Overall happy!",
      "text": "Happy with the length of the lights! Only bought 2 hoping it would cover my whole wall and did. Also happy that they can connect to each other if you have more than one set. I kind of thought they would be a bit brighter but for my room it turned out perfect. Also arrived fast! Ordered on Saturday night and arrived on Tuesday.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniela",
      "helpful_votes": 128,
      "publication_date": 20171107
    },
    {
      "title": "EXTREMELY DIFFICULT - spent hours untangling and when I FINALLY ...",
      "text": "EXTREMELY DIFFICULT - spent hours untangling and when I FINALLY achieved this, I plugged it in and NOTHING- then I noticed a loose wire which connected to nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Luckyssej",
      "helpful_votes": 190,
      "publication_date": 20171020
    },
    {
      "title": "Dont waste your money",
      "text": "DO NOT BUY - Could not even hang these as they were a tangled mess. I spent an hour trying to sort out the strands but gave up.. Unfortunately I didn't keep the packaging to return. Big waste of money. I guess you could use them in a large jar as decoration due to them just being a tangled ball. Also, from what I could tell, the spacing in-between strands wouldn't allow it to look as full as the pictures show.",
      "rating": 1.0,
      "verified": true,
      "author": "JMM",
      "helpful_votes": 93,
      "publication_date": 20171211
    },
    {
      "title": "Outlet plug-in cord too short",
      "text": "For the same price, the Neon Mart light are better, but they were sold out so I got these. The light color is more of a blue-white than a warm yellow-light. This rope length is shorter than the neon Mart lights. But the biggest flaw is that the outlet plug for these lights is only ~3 feet long. Thus, of you hang your lights at the ceiling, as they are designed to be hung, you would have to have an outlet within 3 feet of the ceiling or use an extension cord.",
      "rating": 3.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 45,
      "publication_date": 20170818
    },
    {
      "title": "So pretty",
      "text": "These were great for a twinkle twinkle little star baby shower",
      "rating": 5.0,
      "verified": true,
      "author": "Santiav",
      "helpful_votes": 31,
      "publication_date": 20190106
    },
    {
      "title": "Beautiful!",
      "text": "I love love love these lights! Hung them downstairs at Christmas and they were so pretty! Bought a second set for upstairs that looks great with our sheer black curtains in front of them (Photo doesn’t do them justice because I took it during the day but at night it’s gorgeous!).",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer A Saks",
      "helpful_votes": 35,
      "publication_date": 20180105
    },
    {
      "title": "Watch the installation video or you will cry yourself to sleep.",
      "text": "I watched the installation video AFTER I made a mess of the string lights. I thought of returning a ball of sadness but couldn’t bring myself to have another human cleanup my mistake. After an hour of untangling and crying I unraveled the strings and recoiled them as they were received. I kept the lights because they were much easier to install when I followed the video-instructions. Glad I kept them. They are beautiful and the warm light makes my living room even cozier. Follow directions when installing and recoil before uninstalling otherwise you will be frowning for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "¯\\_(ツ)_/¯",
      "helpful_votes": 20,
      "publication_date": 20190101
    },
    {
      "title": "Product is defective, came in the mail and doesn't ...",
      "text": "Product is defective, came in the mail and doesn't work at all. The lights are much more spread à part than is described and end up covering close to my entire bedroom wall with a lot of space in between each strand. Very disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "Cassi Talbot",
      "helpful_votes": 34,
      "publication_date": 20180122
    },
    {
      "title": "Product's plug was so short there was no possible way ...",
      "text": "Product's plug was so short there was no possible way I could hang the lights up and plug it into a socket. Tangled and messy. Broken when I received the package.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Infraglow",
      "helpful_votes": 46,
      "publication_date": 20170804
    },
    {
      "title": "Can't plug up and hang up without adjustments.",
      "text": "The slack for the power adapter to the string of lights is almost nonexistent. How is one supposed to plug this up and also hang it up? You'd have to have high outlets or use an unsightly extension cord. Still that doesn't help..the issue is with amouny of cord to the controller box. These are to hang, so this needs to have more slack.",
      "rating": 3.0,
      "verified": true,
      "author": "Golden Fennex",
      "helpful_votes": 17,
      "publication_date": 20171210
    },
    {
      "title": "Stopped working after only a couple times",
      "text": "UPDATE: This company never responded therefore no replacement, refund or even apology. Wasted money... I put these up in the backyard under a covered patio immediately and they were beautiful! Unfortunately I only had the chance to use them a few times before they just stopped working! They were only up about 2-3 weeks. I checked the plugs, changed outlets/extension cords, etc. but nothing, they’re dead 😕 And the return window passed a couple of weeks ago. So disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Miller",
      "helpful_votes": 8,
      "publication_date": 20191111
    },
    {
      "title": "These stink! ...Literally!",
      "text": "I don’t know how people aren’t mentioning the terrible SMELL of these lights! Like cheap plastic.. but worse! The odor that my house filled with after hanging these lights is so pungent and gross it makes me nauseous. With disappointed because they’re so cute",
      "rating": 1.0,
      "verified": true,
      "author": "Courtney Rieger",
      "helpful_votes": 10,
      "publication_date": 20181213
    },
    {
      "title": "A completely different product being sold with the same picture",
      "text": "i ordered these earlier in the year. Liked them so much I tried to order another, from the same seller and the same amazon listing, and even the same picture, and received completely different lights. The new ones arebof much poorer quality and look cheap. The new light do not loop at the bottom, they are an obnoxious bright yellow color instead of soft warm yellow, and even the twinkling sequences somehow look cheaper, almost like a lagging video with a low frame rate. Do NOT buy these!! I guess I’m going to attempt to return them.",
      "rating": 1.0,
      "verified": true,
      "author": "SunnySides",
      "helpful_votes": 8,
      "publication_date": 20181224
    },
    {
      "title": "Blink no blink fantastic easy lights!",
      "text": "These lights are beyond easy to put up and they look awesome! Check out my light show. TIIp: hang them up first, very easy to do since they come in a bunch of wires. Then, unravel them last, to avoid frustration of tangles. You may even want to lay it out flat on the floor just to see how it’s going to hang. It took us ten minites to hang and that’s because I’m short. Using them as part of our Christmas decor, but they’re good year round and for any event. You can do the blink or no blink mode. Just press the button on the plug. 5 stars. easy, looks good and a bargain!",
      "rating": 5.0,
      "verified": true,
      "author": "amazoner",
      "helpful_votes": 6,
      "publication_date": 20181210
    },
    {
      "title": "Came not working",
      "text": "I got mine and set it up recently. When I plugged it in, it didn’t work at all. I tried pressing the black bottom piece that connects the plug and the lights but it still wasn’t working. I guess I just got a bad one",
      "rating": 1.0,
      "verified": true,
      "author": "Catherine T.",
      "helpful_votes": 15,
      "publication_date": 20171206
    },
    {
      "title": "Brightness added!",
      "text": "These are beautiful in a picture! Lots of compliments at the breakfast with Santa. I did plan to use them again but had to be in s hurry taking them down and they easily were tangled back up. This is packaged beautifully - so I would keep the ties on each dangling strand and tie each strand up before removing the main lights. I’d buy these again. Might even buy them again instead of untangling my other strand 😉",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca Ann Price",
      "helpful_votes": 9,
      "publication_date": 20190107
    },
    {
      "title": "I love these lights so much",
      "text": "Honestly, I love these lights so much. They're beautiful and have lots of nice transitional settings. The reason I gave them a 2 star though is because I've only had them about 3 months and two of the strands have gone dark. I've put them indoors and they're on a timer so they're only on for around 4 hours every day so I don't understand why they would be dying already. Very frustrating as they're the center point of the room.",
      "rating": 2.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 11,
      "publication_date": 20180322
    },
    {
      "title": "Nicer than I imagined.  Great price.",
      "text": "These lights are very darling. They turned out better than I had imagined. I used them for a photo backdrop, but will be using them in my front window for Christmas as well as for any other fun celebrations. Great price. One photo shows the lights with flash, the second shows them without flash.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Florez",
      "helpful_votes": 14,
      "publication_date": 20170924
    },
    {
      "title": "3 stars.. Who packaged these together.. a BLIND man??",
      "text": "I'm going to give this 3 stars because of the way they are intertwined together upon unpackaging.. It'sVERYconfusing and once you take the ties off, you are literally screwed and takes hours to untangle them and figure out how they lay, in order to put them up. If you have the patience to do this, they are very pretty warm lights. Had it been for the way you have to unravel them, I'd give them 5 stars. Maybe a warning label or a side note to not take them out of the twist ties until you have your lights mapped out. A diagram of before and after woulf be perfect.",
      "rating": 3.0,
      "verified": true,
      "author": "BECKY",
      "helpful_votes": 7,
      "publication_date": 20171101
    },
    {
      "title": "Headache, wow",
      "text": "Firstly, these took like 9 years to untangle *upon delivery* but I trooped through it. Recommended that you put them behind a sheer curtain for indoor use because they are so super bright. Would be really beneficial for outdoor use but in a bedroom? Holy god. The light of Christ shone upon me and nearly gave me a migraine. My main concern is how easily they tangle and how difficult they are to position so they *don't* tangle. They're really a pain; ended up getting smaller fairy lights and I'm much happier. Tl;dr: good for outdoor use but do not use them in a small room. Also plan on untangling them for years upon opening the box.",
      "rating": 3.0,
      "verified": true,
      "author": "Gakusei",
      "helpful_votes": 2,
      "publication_date": 20191128
    },
    {
      "title": "Perfect for what I needed",
      "text": "Love them! They're very long. So I ended up bringing some back up to the top. And",
      "rating": 5.0,
      "verified": true,
      "author": "Cherrelle",
      "helpful_votes": 15,
      "publication_date": 20170819
    },
    {
      "title": "Waste of money!!!",
      "text": "Do not purchase unless you are okay with only having these lights for a month!! I purchased two pairs and both stopped working after ~30 days of light use. Of course at that time it is too late to return the product. Although they lookED pretty, I am extremely disappointed in the longevity. There are no fuses to replace so there is no way of fixing them.. They simply just fail to turn on one day despite working perfectly the night before.",
      "rating": 1.0,
      "verified": true,
      "author": "Sara Borst",
      "helpful_votes": 3,
      "publication_date": 20191004
    },
    {
      "title": "Look elsewhere. Do not buy.",
      "text": "Complete waste of money. After following the poor instructions carefully you'll realize you do have to cut the tiny zip tie to unravel the lights. You weave them through your curtains carefully, then undue each strap for each column and the lights drop. You power up and realize even i on steady burn, the lights flicker. The power supply is so garbage and cheap it can't even maintain a steady output for a consistent, steady, always on light. The other patterns are completely crap. They aren't relaxing and even those flicker. I cut them out of my blinds and will be sending them back so they can throw their garbage product away.",
      "rating": 1.0,
      "verified": true,
      "author": "Paige",
      "helpful_votes": 4,
      "publication_date": 20191129
    },
    {
      "title": "Order more than one set for it to look like the main photo.",
      "text": "The lights are lovely and a good price. I do have a couple of cons though. One light was missing from a strand, which showed exposed wires. Didn't affect the circuit though, so that's a plus. The lights aren't as bright as you'd expect. You definitely need more than one set for it to look like the first photo. A word of caution, they tangle easily. All in all, still pleased. I bought these for my husband who likes to hang out on the patio a lot. He says he loves them, so I'm thrilled nonetheless.",
      "rating": 4.0,
      "verified": true,
      "author": "Candace Black",
      "helpful_votes": 6,
      "publication_date": 20180307
    },
    {
      "title": "Nice!",
      "text": "I like these lights, they have that warm white color and i used to put in my living room. I like that you can change the settings on them, if you want them to stay on, blink fast or slow or even have that twinkle light motion just with one button. They came package well and EVERY string had its own little twist tie so they dont get tangled. Was able to place with a ladder without any help.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheddricka Arthur",
      "helpful_votes": 2,
      "publication_date": 20200530
    },
    {
      "title": "Adorable",
      "text": "Just as described. Really pretty and my daughter loves them as do I lol... do as the instructions say. Hang them up on the wall first going across then after they’re attached, unroll the strings once they’re up so that they don’t get tangled. Comes with the plug and you’re able to change the settings to blink etc",
      "rating": 5.0,
      "verified": true,
      "author": "Luz360",
      "helpful_votes": 6,
      "publication_date": 20180406
    },
    {
      "title": "Beautiful!!!",
      "text": "These lights actually completed the background that I wanted for my wall in the bedroom. I would love to have a handheld remote instead of just the little black box that is connected to the main chord that is plugged into the wall. I always have to get up to turn the lights on and off or to switch them in a different mode-that is super duper important for me because if I'm already in bed I don't wanna have to get up to turn the lights off, so that's my only downfall with this purchase, otherwise I am 99% happy.",
      "rating": 5.0,
      "verified": true,
      "author": "FAYE",
      "helpful_votes": 2,
      "publication_date": 20200515
    },
    {
      "title": "Love these",
      "text": "These are awesome lights. There is no good way to store these without them getting tangled or knotting. The different settings are cool from romantic, festive, and the \"I will never use\" strobe-esque feature. Linked three of these together and they worked flawlessly. The way to connect them together is super easy and the little screw cap to take off the remote/outlet is genius. Best thing is that my cats loved them so much they would play in them: hang/bat at/chew. One strand did suffer a loss to cat teeth and surprisingly enough the rest of the lights still work. Typically in other lights when something like that happens it ruins the whole thing but these still work.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Really pretty and inexpensive!",
      "text": "This is pretty damn cool. There is no remote with this listing but it’s okay there’s a lil box you can push a button and it has like 10+ light flashing settings it’s pretty awesome. I’d suggest getting a 2-3 foot extension chord to plug it in cause it gives you like 3 inches until the box to plug it in. You just need a lil extra space and you’re good to go! Otherwise super pretty and nice quality for the price. They also kinda have a weird smell I hope it goes away lol",
      "rating": 4.0,
      "verified": true,
      "author": "Sophia",
      "helpful_votes": 2,
      "publication_date": 20190220
    },
    {
      "title": "Stopped working",
      "text": "When I originally ordered these and set them up, I loved them. They are beautiful and look so pretty in my front window. However, not even 3 months and they have stopped working. I went to turn them on and they flash like a strobe light and not all the lights are lit when this happens. Really disappointing. I can't find any info on this but hoped they would last a long while. I unplugged and reconnected and still just a strobe light effect which is terrible. The button to change the speed and turn off doesn't work to turn it off. Have to unplug. Will be ordering a new set elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Jamie F.",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Exactly what I expected!",
      "text": "Exactly what I had wanted when I ordered these!!! I even got a deal on them since the box had been damaged! They worked very well with my project, need to order more now!!! Highly recommend this product!!!! As you can tell from my pictures I am not quite finished with the project, but wanted to make sure I loved it before I finished the entire back wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsae McLane",
      "helpful_votes": 6,
      "publication_date": 20171026
    },
    {
      "title": "Not all lights work",
      "text": "I bought these a little over 2 months prior to my daughter's wedding. I plugged them in to see that they worked but did not unwind all of the wires. I ordered 2 strands and on both of them they had a section of lights that did not light. It was very upsetting since there was not much that could be done at that point. I had hoped to share them with friends who are also having weddings. Unfortunately, it was a waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole Marie Thomas",
      "helpful_votes": 135,
      "publication_date": 20190729
    },
    {
      "title": "Warm glowing curtain light",
      "text": "The curtain was packaged well to minimize tangling. Each strand came tightly wound and twistie-tied. The product video was accurate and very helpful during installation. We kept all the strings wound up while installing, and released each curtain after everything was set up. One of the strands was extra long, but we simply looped it up with one of the many twistie ties. I kept all the twistie ties; assuming we take it down, I would wind up each strand again before removing. The color is a warm white (more golden, not cool white). Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "F. Di",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Adorable ...... when it worked",
      "text": "For one thing, the image shown shows at least two (maybe three) of these string curtains side-by-side. When I got ours, it only had a fraction of the strings. I was disappointed but put it up in my daughters' room anyway. It was super cute and gave their room a pretty glow at night. We turned it on almost every night and, after about 4 months, the lights stopped working. Maybe we were using them too much? I have no idea, but I'm disappointed nonetheless. I'll be buying more string lights, but not these.",
      "rating": 2.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Beautiful light curtain.",
      "text": "I hung this to decorate for my son’s birthday. In the picture the strands have been folded up and clipped so as to be the height of the window seat. It’s so pretty and it was the correct length with extra length to travel up the wall from the outlet. The on/off box is great, though I wish that The constant option was first! I have to push the button a few times to get to that setting. I hanged mine with the 30 mm command stick on hooks.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Corrales",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Sabrina Says Yes!",
      "text": "Definitely one of my top five favorite purchases on Amazon. They sit right above my headboard and I love the fairy vibe they give my bedroom at night. All the different flash modes are great too! I love the slow flicker most! The light strings are very long, so I folded mine in half behind my headboard and just made another line on my wall. No use for the excess length to just be dangling behind my bed where no one could see them. Very pleased with the results and the purchase! Product Approved! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina Says Yes!",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Stopped working in minutes",
      "text": "Purchased to decorate for EID and hoping to have a little joy spread during our quarantined Ramadan, plugged in checked that they worked. Hung up, plugged back in then they started blinking very fast then stopped for good never to be lit again :( very very sad as Ramadan is starting in four days and I timed my order to arrive just in time. very sad because they were super cute and very soft light for the few moments they did work. I changed outlets and tried to screw and unscrew and even wiggled each light to see if they would start again to no avail. Sadly i am returning.",
      "rating": 1.0,
      "verified": true,
      "author": "C Family ",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Not as pictured, works but photos are not for this same product",
      "text": "The product is not bad I like it but the picture is not the product that you recieve. It is not as densely packed with the strings of light as pictured. Change the picture, advertise the actual product lower the price and do a video for the actual product. Being deceiptive and sending the product that is not pictured is disappointing regardless of the features that are working well so far. I will take pictures and post a video for this product, I brought it for a room surprise. I got the surprise more so. 😑",
      "rating": 2.0,
      "verified": true,
      "author": "Kimmchie",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Yes yes yes yes yes!",
      "text": "Soooooo obsessed with these lights! I have Received SO many compliments and have sent this link out to so many people! I’m room feels cozy with a touch a magic ✨ Reeeeeally wish this came with a remote control so I didn't Have to go search for the controller under my curtains but still love it so much and would totally buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sadie",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Will be buying more!!!! I want them everywhere!",
      "text": "Amazing!! I bought 2 and both work well!! You can plug them into each other kind of like how Christmas lights work. They have different settings for blinking different speeds if you want, and different levels of brightness. I have them outside and they do tangle a bit if the wind blows (look at the 1st pic you can see 2 tangled). They are easily untangled though. There was a lot of space in between the strands I didn’t expect. They have lasted through several thunderstorms, but not a run in with the weed eater in case you need to know that🙄",
      "rating": 5.0,
      "verified": true,
      "author": "Shantilly0091",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Great!",
      "text": "Honestly these lights are amazing. I hung one strand up in my apartment and used the solid on setting every night for a year and a half and they’re still as bright as day one. I ordered two more strands for my new apartment and I love them so much! They add a lot of ambiance and light to a dark wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Used daily for almost 6 months... still Loving them!",
      "text": "I got these for Yule, but chose white because I love to have lights indoors and out all year. I hung two of these over my double LR windows. Months later, not a single bulb is out. Not too bright, unless you want a very dim lighting. These give off the equivalent of a low watt covered lamp. They don't get hot. They are amazing! I plan to try some outdoors next!",
      "rating": 5.0,
      "verified": true,
      "author": "Momma Bear",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Not as full as you think.",
      "text": "I bought one set of these twinkle lights for my holiday Christmas party. Judging off the hero photo for the product, I thought it would be super full! It wasn't. Actually, it wasn't full at all. :| I was a bit disappointed, but we made do with what we had. In order to achieve that very full look, I suggest ordering 5 of these. Other than that, they were beautiful and worked great. The length on these were also good. They were longer than I expected, so that was nice. :) I do like this product, but just be cognizant if you are looking for something full.",
      "rating": 4.0,
      "verified": true,
      "author": "Jilly P",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Happy Purchase",
      "text": "These have been holding up just fine outside. They hang under the patio so they do have some coverage. That may be why they are still in good condition, however, I know the rain and wind have still gotten to it somewhat. I keep the actual plugin part inside and that part is not waterproof. I just take it off and put it back on as I use it. It is really easy. They were a little long for my patio but that isn't a problem for me and I should have measured it first. If it is something that would bother you I would recommend measuring the area before purchasing. All in all very happy with these lights :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "LOVEEEE!!!",
      "text": "These lights are so pretty, I've gotten a lot of compliments on this lights. It really sets the mood of my room so different when it is on. I love to have these lights on instead of my real lights. It's not too bright and it's not too dark. I have these on during the night time before I got to bed and it's so pretty. It's the little things in life that makes you happy and this is one of them! It's not hard to set up, the lights have different settings, but the remote is attached to the plug so you need to manually turn the setting on/off. But it's great! Loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Hae Rry Hong",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Stopped working after a few months - but great customer service",
      "text": "Update April 22, 2020: I contacted customer service in regard to the broken item. They attempted to troubleshoot the issue and when there was no solution, they sent me a replacement free of charge. As of now, those are working just fine, hoping it stays that way! April 15, 2020: Loved them at the beginning and now they've completely stopped working just a few months after receiving them. Bummer.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Cute lights",
      "text": "At first, I loved these lights. Then they began to turn on by themselves. I contacted customer service and they told me to use a different outlet... I don’t see how which outlet I’m using is causing a problem with the product but okay. So that issue never got resolved, so I’m still dealing with the same issue. But they are pretty, I do like the many settings you can choose from with the convenient remote. The “remote” part is connected to the strings so it isn’t separate, idk if that matters to some people or not.",
      "rating": 4.0,
      "verified": true,
      "author": "Schweetums",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "One broken. The other great.",
      "text": "Ordered 2 of these. One works great and the other didn't work at all. I ordered these to a friend in the US who brought them to me in a different country, so I had to wait for them and couldn't get the broken one back on time for a refund. Very dissappointed. If you live outside the US do NOT order from this company because their stuff might be BROKEN. I am waiting for a esponse from the company. If I get a refund or a new set of lights I will change my review.",
      "rating": 2.0,
      "verified": true,
      "author": "Tannor",
      "helpful_votes": 2,
      "publication_date": 20180802
    },
    {
      "title": "Excellent indoor lighting - brightens room",
      "text": "Very happy with this purchase, especially for the price. We bought two sets to hang on the ceiling in our family room during winter when it gets dark so early. Fantastic! We used the command small clear decorating clips to hang them. Worked like a charm! Originally intended just for holidays, but it brightens up the room so well (especially without can lights in the ceiling) that we have left them up. Nightly use for multiple hours for several months. Couldn't be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Very nice!!",
      "text": "So, I got these for my sister in laws graduation party because she’s always wanted them and it went so well with the theme. I saw photos of people saying it wasn’t weather proof which concerned me after I had bought them. It rained last night so I tested how well these lights actually were with rain. Answer: It didn’t rust, the lights are still white, and they still work. Not calling any of you liars who it didn’t work for but I wonder why it rusted and stopped working..? Maybe it’s too early to tell for me",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Rivera",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Love them",
      "text": "I love these! I had to buy 2 sets for my room. The lighting is a nice yellow. I love the settings options. It’s added a nice vibe to my room overall. 1 complaint is that on the last setting where the lights are virtually off but still glow (like little stars) one section does not work for some reason. On every other setting they work though. Not sure why this is. One recommendation: don’t unravel the strands before you hang them. I got them all tangled up before I hung them. Just my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Lights Camera Action!",
      "text": "I like everything about the lights. I’m prepping for my 50th in December for my distinguished backdrop. I will share that you must have a spacious area to lay out the lights to see how it’s going to flow and what you’re working with. The lights were well packaged and very easy to lay out. If you have a bundled mess it’s because you didn’t take the time to lay it out. It’s a breeze and have fun with it.",
      "rating": 5.0,
      "verified": true,
      "author": "MercedesLady",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Short in the wires, doesn’t work.",
      "text": "The moment I got it out of the box it did not work. After fiddling with the connector part it flashed. So it seems to have a short in it. But I was able to get them to stay on if I taped it up so there was slack on the connector. Well now it’s not coming on at all no matter how much I tape or wiggle it. Frustrating as these were the only lights we got to decorate our home for Christmas.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 2,
      "publication_date": 20181207
    },
    {
      "title": "Beautiful! Worth every penny",
      "text": "These are soooooo pretty. I had a hard time understanding if they would fit my sliding glass doors and they do. They have many patterns of twinkling to choose from and the wiring is transparent so its not a bunch of ugly green or white wires hanging in the view during the day. I paired them with the Wemo smart plug Amazon had a special on and so I plugged the lights into that and programmed them to turn on at 7:30pm every night. I live in an apartment complex so this is an excellent and beautiful way to get light on the patio at night since there are no outdoor outlets and a lovely effect inside, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen R",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Made in China Smell",
      "text": "I just put these up today above my bed. They look beautiful and were packaged very nicely and I found very easy to put up. An hour after hanging them up I started to smell this awful familiar smell. The plastic used to make these lights are omitting such a strong smell that it’s actually making me nauseous and gave me a headache. I hope it goes away but I’m also concerned if this smell is safe to breathe.",
      "rating": 3.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Twinkle twinkle Little Light",
      "text": "A BIG YES to this purchase!! These were ordered to add some extra sparkle to a birthday celebration and that they did. I ordered two sets but honestly could have gotten away with one. These lights were wrapped so that installation was easy, just be sure to follow directions. The two sets are made that they can be connected to each other. You can adjust the way they light up which can be flashing fast, all on or intermittently. I can now understand why these lights are popular for home decor. You don't need a party to enjoy these, a little delicate lighting can be pretty just about anywhere and enjoyed every day of the year. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Forever Geralyn",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "100% real here",
      "text": "For real? I opened the box and was so overwhelmed by the bundled conglomerate of \"Christmas tree\" lights that I went EEK and put it back in the box. Until I thought, well that's just ridiculous! Then I opened it again and untied the bundle to which a spider web looking mess of light spilled down and my head felt like it would explode at the mere idea of trying to untangle and figure it out that I just put it back in the box again and realized this sort of thing is for people who love tedious challenges and that if I truly want that twinkle light effect? Imma have to just get traditional xmas lights",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Bright!",
      "text": "We finally hung these up yesterday. My daughter uses them at night. They are very bright, with multiple settings (flashing, sunrise, still, twinkling). The only complaint I had was the plug, it's very heavy, if you bump into it, it'll fall out of the wall (but we won't have an issue because it's plugged behind furniture). They may be too bright for some kids (you don't need any other lighting, they're that good and light up the entire room). Overall great quality and I'm very happy with the purchase. We may even order again for her older sister.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Lots of issues in regards to hanging it up",
      "text": "Terrible light. No instructions to hang up properly and very difficult to try and hang up especially when the plug in outlet is at the very top of the light with a very short outlet that did not reach the bottom of my outlet. Did not work properly. I am highly disappointed. I contact the seller for a refund because I wanted to return the item. Customer service was not helpful at all and cannot resolve the issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Nat",
      "helpful_votes": 17,
      "publication_date": 20170501
    },
    {
      "title": "It does the job",
      "text": "Day 1- so far so good. Video and pix attached. Will update if anything changes. So we sampled it before putting it on our canopy bed. I Covered a four panel Japanese privacy screen with 1/4 one the other side so it won’t touch the floor. You won’t be getting 300 lights, FYI only 290. It does look pretty, with seven different settings. Only thing, I wish we could have one of the settings be a soft dim twinkle. The one already programmed is a bit to bright. These can connect to multiples and run off of one plug! We bought 6, we want to double it up for our canopy.",
      "rating": 4.0,
      "verified": true,
      "author": "Nawahine4",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Stopped working after 1 month.",
      "text": "Edit: 1 month after purchase, they have just completely stopped working altogether. They were great while they lasted, but there is no good reason they should have stopped working. They stayed in my window the whole time without tampering. That is the reason I adjusted my review and star rating. These are so great! The wires themselves are quite long, but when folded in half, it creates a much fuller effect. Perfect in my front window for Christmas!",
      "rating": 2.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 5,
      "publication_date": 20171217
    },
    {
      "title": "Not quite as bright as I'd hoped",
      "text": "I accidentally left a product review as a seller review, which now I feel kind of bad for because I haven't had actual experience with the seller and I gave them three stars. I'm sure they're great. The product itself is nice, just not quite what I'd hoped for. There are larger spaces between the strings than I expected - it didn't show that way in any photos I've seen. They aren't quite as bright as I'd hoped, either. Everything else is great - good length, quite a few different settings for the lights themselves. I would have given it four stars if not for the lack of brightness.",
      "rating": 3.0,
      "verified": true,
      "author": "DarkLightningEnvy",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Gorgeous lights",
      "text": "These are just lovely lights. I hung them in a child's room. They are like curtains....one long strand with multiple very long strands off it. The strands of light are extremely long and vary in size by small amounts. They are beautiful and the light pattern can change depending on the setting you choose. My only complaint is the cord prior to the start of the lights is pretty short. Given the length of the lights....you end up with a visible black power cord hanging. It's not easy to hide. But I'd still purchase again, especially given the great price.",
      "rating": 5.0,
      "verified": true,
      "author": "SweetMagnolia24",
      "helpful_votes": 2,
      "publication_date": 20171102
    },
    {
      "title": "Added a little magic to my attic.",
      "text": "Bought them for an attic tea space. I purposely left the middle ones coiled because I’m still adding mandala print fabric panels to the walls. But I let the rest down because I wanted to get an idea of how they’d look, and I must say, they exceeded my expectations. There are several settings to play with, the product came neatly packaged, and the seller was responsive. WARNING: Do NOT unravel the string ties until the lights are secured exactly how you want them. They tangle easily if you do. Great product and great seller overall, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Hey Girl Hey",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Definitely worth the purchase!!!",
      "text": "I used these lights to create a beautifully lit “hideaway” under my daughter’s loft bed. I am thoroughly impressed!! One trick, the directions say not to cut the white clips, but there is one main white clip/zip tie that bundles the main line and all of the sub lines together. You will need to cut that main zip tie (not the smaller ones that are found on each line). Then, stretch the main line and all of the sub lines can be unraveled so that the curtain is formed. BEAUTIFUL!!",
      "rating": 5.0,
      "verified": true,
      "author": "KlassyLadee04",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Glow, sparkle, twinkle! I love it!!!",
      "text": "Love this!! Magical effect behind the Tree wall panel on my massage office! Really made it come to life. Plenty tall as well, about 8 feet, had to tight some of the lights to make them shorter, but that was not a problem to me.The warm glow of the 300 little lights and the several blinking options on the remote make this a great value for the money. You will not be disappointed!!",
      "rating": 5.0,
      "verified": true,
      "author": "Angelique S.",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "strong chemical plastic smell",
      "text": "Quite honestly, I never got to put these up in my classroom because the plastic smell was overpowering. And when I say overpowering, I mean I had aired them out for days and still people would get an instant headache from the chemical plastic smell coming off of them. That's just not right. I did plug them in and the color was wonderful, very warm. But if you are going to use these, even outdoors, please buy them well ahead of time and let them air out for weeks before exposing people to them. Wow.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Peterson",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "They are what they say they are.",
      "text": "I can't speak to the longevity because I just got them but they are FANTASTIC! They are exactly what they look like. Light weight and the strands are long. Like 8 or 10 different lighting settings. Hanging could be tricky if you dont have common sense. I secured the strand that the lights hang down from first, THEN I untied each strand and let them fall into place.",
      "rating": 5.0,
      "verified": true,
      "author": "StephanieCunningham91",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "stopped working",
      "text": "I saw reviews from 2018 saying how these stopped working. Since it was 2 years ago I ignored those reviews and bought the lights anyway. They were easy to hang up and were absolutely perfect in my room. I ordered them March 17 and it’s now April 1 and the lights no longer work. They were having issues with turning on for a few days and today I went to turn them on and nothing is happening. Exchanging them for new ones, hope those work. If not I’m hoping for a refund. Don’t get how this is “Amazon’s Choice” of lights when they don’t work properly. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Very pretty, but it wont last long.",
      "text": "I ordered these & forgot about them for like 2 months. As soon as I found them, I hung them up in my blinds. I loved how they looked. It was really pretty! But unfortunately, after 2-3 weeks, the remote was having problems & then shortly after that, the lights were very dim, so I just took them down & threw them away.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole Bishop",
      "helpful_votes": 2,
      "publication_date": 20200121
    },
    {
      "title": "Few strands got hot and melted after short use",
      "text": "These lights have nice color to them and different neat sequences that you can do. We used them this year for our Christmas light display and draped them over our garage door. Although after just 3-4 weeks of being on for 4-6 hours each night, more than a dozen single lights on the strand look brown which tells me that it must of got hot and started to melt the lights and plastic around the lights. They still worked but not sure if I’ll be able to get another years use out of them due to the potential of burning up. The picture shows the brown tint the lights now have.",
      "rating": 3.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Only works for couple times. Wasted money",
      "text": "It was BROKEN after like 3rd time of uses!! It was placed indoor the whole time and did not even do anything to it but it just won’t turn on anymore...!!! And it’s already passed the last date of return. So guess I just paid the money for couple times of usage..??!",
      "rating": 1.0,
      "verified": true,
      "author": "QMilk",
      "helpful_votes": 4,
      "publication_date": 20180802
    },
    {
      "title": "SAVE YOUR MONEY",
      "text": "DO NOT BUY!!!! Ive only had this for two months and its already starting to die on me. I use it as a night light on the “on” setting where it doesn’t flash or dim. Yet the lights flicker occasionally as if its not working properly. SAVE YOUR MONEY! DO NOT RECOMMEND!",
      "rating": 1.0,
      "verified": true,
      "author": "Steven Hang",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "starting to break",
      "text": "i've had these lights in my room for about a month and the lights are already cutting out and i can't seem to get them to turn back on :( also there's no remote so it's been a bit of a hassle to turn them on or adjust the settings. also, the lights don't have any dimmer settings either!",
      "rating": 1.0,
      "verified": true,
      "author": "Luka",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Great lights - but didn't last a full year",
      "text": "I bought these in December 2018 and have used them every single day since. I really love them, they add a comforting light to my space. However, I have been noticing the lights flickering the last few weeks. Then today I noticed a strand is completely burnt out. I personally would have hoped that they lasted at least a full year, but I'm still happy with them for the most part. They did what I wanted them to do. I'm on the lookout for a bulb I could maybe replace to see if that will get the light strand working again. I would recommend these though.",
      "rating": 4.0,
      "verified": true,
      "author": "smith612",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Lasts up to a year",
      "text": "I've had these lights on my enclosed apartment balcony for about 10 months now. They worked great up until recently the lights have been spazzing out on multiple different settings. The remote control doesn't even work anymore. I loved these lights originally, but because I've had them for such a short period of time, I would not say they are weatherproof and good for long-term use.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Buy 2",
      "text": "Their really nice, but gappy. Purchase 2 for more of a full effect. Also, DO NOT untie the lights unless you plan on taking forever to seperate them after you hang them up. Hang up first, then untie, letting the string lights fall down. I still have mine up 6 months later.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Great idea. Too tall to use in a standard ...",
      "text": "Great idea. Too tall to use in a standard room. And I thought the lights would be closer together. I also thought it was an actual curtain as preceived by the photo. But it is just a wall of lights and the gold shimmer you see is their fabric. Not even close to represnting the photo. My error for not investigating more.",
      "rating": 1.0,
      "verified": true,
      "author": "Luci",
      "helpful_votes": 6,
      "publication_date": 20180131
    },
    {
      "title": "Easy, expandable, beautiful.",
      "text": "Easy and expandable. Really beautiful. Perfect for turning my spare room into a magical space for my nieces. I ordered one strand to test them out, but totally ordering more to re-create the Harry Potter canopy from Pottery Barn teen. I easily folded the long strands in half so they ended at the window sill. So much flexibility, easy to hang. I used the clear 3m clips, fit these perfectly! The strands attach together with a very secure screw tight connector. They are ideal for this project. Happy to recreate the pbteen potter collection look at a fraction of the price. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Devil505",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Pretty!",
      "text": "I made the mistake of untying the individual strands before hanging them up and it took me about 2 hours to untangle. So that was awful, don't do that to yourself. They lovely and much longer than expected. The different blink settings are great (though the strobe one is a bit intense :P). I love them and they are now hanging in my partner and my front livingroom window behind our desks.",
      "rating": 5.0,
      "verified": true,
      "author": "Nebica Lynn",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Love these! Actually going to keep up year round",
      "text": "These are so pretty. They were so easy to put up. The remote has numerous settings, I personally favor the 2nd setting, which is what I have in the video I attached. The light is not too bright, it's a soft white/yellow light. I'm actually thinking of buying a set for each window facing the road for Christmas. I kept this set up after Christmas and will keep it up year round. I put them on each evening.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica Hough",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "pretty but had issues",
      "text": "these lights are really pretty and the setting options are awesome. i loved them, up until i tried to string them together, which did NOT work. i had to plug each individual one into an extension cord, because they refused to connect into one another to form a continuous string. as soon as i plugged them together, the rest of them would not work, and definitely ruined the overall look i was going for. its a bummer, because theyre well made and super pretty otherwise.",
      "rating": 3.0,
      "verified": true,
      "author": "taylor",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Cute, dainty, beautiful but hanging them.....&!#¥?",
      "text": "These lights turned out to be adorable; however I almost had a nervous breakdown detangling 300 fairy lights to hang. My husband made small wooden blocks painted to match our daughter’s wall and those were my saving grace. Be sure to measure the end that plugs in and contains the on/off control, and hang it somewhere easy to reach, and then brace yourself for 5 frustrating hours of laying out the light strands. It almost killed me. I cried twice, but overall, they are adorable!",
      "rating": 5.0,
      "verified": true,
      "author": "Carly Leslie",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Why did they program them to be so annoying?",
      "text": "These are ok. I wouldn't buy them again. I bought them to hang on my canopy and never ended up unraveling most of them. The most annoying thing about them is that every lighting cycle ends with rapid flashing. So what starts as a relaxing slow fade in and out eventually becomes a stressful headache inducing flashing. I'm worried my senior dog will have a seizure. The only setting I use is the final one that just keeps them on consistently.",
      "rating": 3.0,
      "verified": true,
      "author": "Katina",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Worst fire hazard ever",
      "text": "Talked to two people money was supposed to be refunded cause not safe to send the moronic fire hazard through mail apparently nobody wrote that down so I’ll send it back at post office and pay outta pocket Morons",
      "rating": 1.0,
      "verified": true,
      "author": "Catherine delardi",
      "helpful_votes": 2,
      "publication_date": 20190811
    },
    {
      "title": "Great lights but the listing photos are deceiving",
      "text": "Ok, so these lights are nice and the girl friend loves them over the bed. However, the item phone is misleading. That photo with the lights as a curtain? That must have 5 of these put together. They aren't that \"full\" if you will. The remote isn't really a \"remote\" either. Just a box that lets you change settings between the plug and the lights. With that said, the photo is of the lights as a \"headboard\" of a King Sized bed. It gets 5 stars because the girl friend loves them. If she is happy, I am happy.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190629
    }
  ],
  "product_meta": {
    "title": "Twinkle Star 300 LED Window Curtain String Light Wedding Party Home Garden Bedroom Outdoor Indoor Wall Decorations, Warm White",
    "rating": 4.5,
    "feature_bullets": [
      "8 Modes settings: combination, in waves, sequential, slogs , chasing/flash, slow fade, twinkle/flash, and steady on.",
      "High quality: 6.6ft*9.8ft(width*length), 300 WARM WHITE LED lights. UL Certificated Output and wire: 29V Voltage Safe Curtain Lights with UL certified, leads to 29V safe output by UL plug-in transformer.",
      "Easy to use: directly plug in and unplug it for power on and off. US standard outlet, voltage 110V. Plug to the controller: 1ft. Controller to the LED light: 8.9ft.",
      "Perfect decoration: WATERPROOF(IP44) Perfect for indoor and outdoor decorations. Christmas,party,Valentine's Day, wedding, home, window, bathroom, festival, Holiday, shows, restaurant, hotel, commercial building, shopping center etc.",
      "Sales price,this lights will make your life lovely. NOTE: ONLY STRING LIGHTS, NOT COME WITH A CURTAIN, MAINLY USED FOR CURTAIN DECORATION. 100% SATISFACTION GUARANTEE! If for any reason you're not 100% SATISFIED, please let us know and our customer service team will help you RETURN OR REFUND."
    ],
    "specifications": {
      "Product Dimensions": "8.26 x 3.14 x 3.95 inches",
      "Item Weight": "8 ounces",
      "Manufacturer": "Twinkle Star",
      "ASIN": "B01LLSNG1E",
      "Item model number": "300 LED Window Curtain String Light",
      "Customer Reviews": "4.5 out of 5 stars22,153 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#137 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Indoor String Lights",
      "Seasonal Lighting",
      "Seasonal Décor"
    ],
    "price": 17.99
  }
}