{
  "website_summaries": [
    {
      "verdict": "Absence of headphone jack aside, the 7 Plus is the best iPhone you can buy, with more memory than its smaller counterpart and dual cameras that peer toward Apple's future.",
      "pros": [
        "Dual cameras",
        "Copious memory and storage",
        "Water-resistant design",
        "Faster on all performance measures, with better battery life, than last year's iPhones",
        "iOS still leads on high-quality games and creative apps"
      ],
      "cons": [
        "Lacks a 3.5mm jack, and there aren't a lot of Lightning-compatible headphones yet",
        "Not all models are compatible with all carriers"
      ],
      "aspects": {},
      "publication_date": 20170322,
      "rating": 9.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "iPhone 7 Plus. It didn’t mention anything about reconditioned in the advert.",
      "text": "I thought I was buying a new iPhone 7 Plus for the money paid. I didn’t receive a plug and charging cable or headphones although there were gaps in the box for them. The box itself was stuck with sellotape. Very disappointed indeed.",
      "rating": 1.0,
      "verified": true,
      "author": "Margarita",
      "helpful_votes": 57,
      "publication_date": 20190523
    },
    {
      "title": "Works great",
      "text": "Phone works great, a little more damage that I wanted (ding on top outer), but fine as I use a case. The screen isn’t a genuine apple display, so my Apple Pay doesn’t work, annoying!",
      "rating": 4.0,
      "verified": true,
      "author": "Jersey",
      "helpful_votes": 35,
      "publication_date": 20181003
    },
    {
      "title": "All present and correct, 100% Apple! 5 Stars",
      "text": "Ordered the phone on Sunday, arrived today (Tuesday). Everything is present and correct (hope the images help). All appears perfectly legit and I had NO ISSUES setting it up. Side note: after doing an analysis of the prices and the Apple iPhone range the iPhone 7 is definitely the best VALUE FOR MONEY. Which one you choose is up to you! 5 Stars and have already recommended it to people!",
      "rating": 5.0,
      "verified": true,
      "author": "BG",
      "helpful_votes": 21,
      "publication_date": 20190709
    },
    {
      "title": "Brand new !!!",
      "text": "Brand new black iPhone 7 Plus in sealed apple box with all accessories. 1yr apple warranty £100 cheaper than apple site Just the job thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 23,
      "publication_date": 20190114
    },
    {
      "title": "Excellent phone. Invaluable seller. Unbeatable price.",
      "text": "Found an excellent phone for an unbeatable price from this awesome seller. Very happy with service: seller made sure I knew what I was buying before shipping the item. No issues at all after 8 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Please provide a pen name.",
      "helpful_votes": 11,
      "publication_date": 20190610
    },
    {
      "title": "Amazing product",
      "text": "I am really happy with my new iPhone 7 Plus! The battery is amazing and do we want to talk about the dual camera??? Brilliant!",
      "rating": 5.0,
      "verified": true,
      "author": "Stefano",
      "helpful_votes": 17,
      "publication_date": 20170806
    },
    {
      "title": "Slim and gorgeous",
      "text": "The iphone arrived ahead of time and everything was as I had hoped. It was bigger than I thought as I thought it was the same size as the 6S but I love it. I was able to transfer all my information and data within 5 minutes. The display is bright and clear and the battery life is much better than my old phone. It also takes great photos. I was also pleased to find that the enclosed headphones fit in the charger port as I wanted to use regular headphones. Overall I am delighted with my new phone. Fiona Leahy",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "DO NOT BUY",
      "text": "Awful ignored my complaints. The phone I bought had a dodger speaker which you wouldn’t be able to tell at first. It would mean all phone calls FaceTimes and everything would have to be made using headphones. Even then the phone it’s self would end up breaking the headphones due to this. Extremely disappointed no longer am I buying phones from amazon the manufacturers website it is for me. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Nice kit",
      "text": "Christmas present for my wife and I have only marked it down on easy to use as none of the contacts or photo's transferred from the old phone despite following the instructions and will take a visit to the Apple Store - Well over=priced but hey its Apple not exactly breaking news. Screen is excellent and although we know fragile from our daughters mishaps with hers but overall a decent phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Collins",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Virtually unusable after 12 months",
      "text": "Apps no longer open. Performance is terrible. Plenty of spare memory, but phone is now useless. I may have to abandon iPhones from now on. iPhone 7 Plus was brand new when supplied by Amazon. I presume iOS 13.3.1 or the iPhone’s internals are to blame. It’s pretty shocking from Apple!",
      "rating": 1.0,
      "verified": true,
      "author": "Justice Peace",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Good upgrade from iPhone 5...",
      "text": "My iPhone 5 was on its way out, to the point I could hardly open it (which wasn’t the safest option for me being a student living away from home in a big city). Invested in this phone as a quick option, and it’s proven great so far - more storage and bigger screen.",
      "rating": 5.0,
      "verified": true,
      "author": "haz00mc3",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Iphone quality at a reasonable price.",
      "text": "Now an older model whose functions are fine unless you need the latest cameras. Enables you to have a sim only contract to avoid large monthly bills. As all Iphones the battery life if used a lot is disappointing. A worthwhile buy nonetheless.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "This is a scam",
      "text": "Trying to make a complaint here. The iPhone 7 Plus I bought from this supplier is not new and is either not the real thing or is a scam. The female lightning charging receiver on the phone does not fit the male wire receiver supplied with it. I bought this in September to give to my husband for Christmas only to find out that it’s a fake.",
      "rating": 1.0,
      "verified": true,
      "author": "C M Ireland ",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Love it ... great price n delivery",
      "text": "Good value ... delivered next day . Got stuck with set up , but quick visit to Apple shop for help n up n running Gold is Lovely .... love the big screen . Another bargain from Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Even if its an old model, still worthed!",
      "text": "Ive always been an android fan and decided to try ios system so I decided to start with this model of phone, iphone 7 plus, because the 8th plus has glass case. 2 months of use and the phone is amazing, battery life keeps me full day with facebook, watsapp and some youtube heavy usage.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Genuine New phone (Sold By Amazon)",
      "text": "Great Genuine phone Brand new (Sold By Amazon) unlike some phones sold on the internet; which are sold as New sealed phones, but in fact used/reconditioned and re-sealed in the box.",
      "rating": 5.0,
      "verified": true,
      "author": "ANDY ZM.",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "My best ever phone.",
      "text": "Great quality and great spec, wether you want to take photos, videos, play games or just have boring phone calls. Big enough to be like a mini tablet, but not big enough to be a burden.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr B.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Amazing product",
      "text": "Amazing phone and has a great battery life. Very cool features on the phone! Delivery was greatt and the packaging was just like it was bought from and Apple store.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs N K Dulai",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Amazing condition , just as if it was bought from the Apple store",
      "text": "I like that it came in beautiful conditions as if it was bought from the apple store. It was very easy to use and I've haven't done across any glitches which is very good. I would definitely recommend purchasing from here again as it is good value for your money.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Very happy customer",
      "text": "The phone was bought for my Daughter at Christmas time. She absolutely thinks it's the most amazing phone ever and finds it very easy to use. Would not know it was refurbished ☺",
      "rating": 5.0,
      "verified": true,
      "author": "sally elmore",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Love it",
      "text": "I bought this to replace a terminally ill iPhone 5s and I couldn’t be happier. Brand new and arrived sealed in the original packaging and a joy to use. It’s a big leap from my 5s so it’s going to take a while to learn all the ins and outs! Overall very happy with a great phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "AMAZING !!!!!!!!",
      "text": "100/100 fantastic phone 🥳 took 3 days to come and the quality is AMAZING !!!! RECOMMEND TO BUY !!!! FOR £399 is amazing for iphone 7 plus",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Worth the money!",
      "text": "Really good, good size iOS 13 is available brand new very good condition nice to hold camera is great And your giving 61 days to put in apple care if you want to although I did I not receive a headphone jack",
      "rating": 5.0,
      "verified": true,
      "author": "S. Campbell ",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Rubbish",
      "text": "As soon as I received it it came with a cracked screen and the battery died after an hour of use",
      "rating": 5.0,
      "verified": true,
      "author": "Jess Ackland",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Good Phone",
      "text": "Good upgrade compared to my 5s. Good service from suppliers too. Boxed and brand new",
      "rating": 5.0,
      "verified": true,
      "author": "Mr H.",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Good price",
      "text": "As described, easy to track on the delivery day. I bought it for 5 months, no difference to the phone I bought from apple shop but cheaper.",
      "rating": 5.0,
      "verified": true,
      "author": "Han",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Great phone but did not come headphone adaptor",
      "text": "Phone came very quickly however it did not come with the headphone adapter as described in the description. Still a great price but just annoying now needing to buy a headphone adapter",
      "rating": 4.0,
      "verified": true,
      "author": "Dave Roberts",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Fantastic phone for a good price.",
      "text": "Wonderful piece for such good value for money. The battery life also lasted for a very long time. I will be recommending this to anyone who wants a good phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Pekky",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "It's a lovely phone to have its built beautifully.",
      "text": "I'm happy with the iPhone gold 7 plus it arrived on time and everythings been perfect with it ,it came packaged properly with all the accessories it's supposed to come with so I'm happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Value of money",
      "text": "I was a bit worried about buying this phone through amazon since I’ve always bought my phone at the Apple Store. But let me say, I’m really happy with this phone. Definitely would buy more phone off this supplier",
      "rating": 5.0,
      "verified": true,
      "author": "sonia",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Top seller",
      "text": "Definitely recommend. Let me know if you have any other iPhone for sale",
      "rating": 5.0,
      "verified": true,
      "author": "James Brown Sinclair",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Good iPhone 7 Plus",
      "text": "This is a very good iPhone I like them. I have a iPhone 7. As well.",
      "rating": 5.0,
      "verified": true,
      "author": "mr a",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "audio now working",
      "text": "received an iphone 7 plus, however the audio was not working and cannot get any update from the seller on return",
      "rating": 1.0,
      "verified": true,
      "author": "yvonne",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "iPhone 7 Plus Jet Black 128GB",
      "text": "Best phone I have had. It stated that it was Refurbished but it was actually in Grade C condition. I still love this phone and cherish it. Thank you We Sell Tek",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel Kwarteng",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Long battery, if u stay off Twitter ,",
      "text": "I never want to update , Amazing photos & videos",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Top offer",
      "text": "Fab as described! What a top deal phoned apple today and all good.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew s",
      "helpful_votes": 2,
      "publication_date": 20170809
    },
    {
      "title": "Excellent",
      "text": "Upgraded from my older phone. Fast delivery well informed. Easy to set up upon arrival. Great prices ce.",
      "rating": 5.0,
      "verified": true,
      "author": "David F",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "It’s PERFECT overall",
      "text": "Very good new iPhone i love it and honestly it’s a great choice if your upgrading it’s an absolutely amazing device and a must use",
      "rating": 4.0,
      "verified": true,
      "author": "brent evans",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Better than I expected",
      "text": "The item came a lot quicker than I expected, it was in really good condition as described. It didn't come with headphones, but that's to be expected",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Amazon123",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Poor quality",
      "text": "Very poor quality and did not receive lighting connector Had to replace phone in Apple store",
      "rating": 1.0,
      "verified": true,
      "author": "NITIN BABY",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "👌👌👌👌👌👌👌",
      "text": "The Phone look just like I was expected....Very good purchase,very happy with him",
      "rating": 5.0,
      "verified": true,
      "author": "Castro Gomes",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Wow",
      "text": "A really good phone practically like new. The delivery time was super fast really pleased with the product. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Kiran",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "As described.",
      "text": "Too soon to know all the details but good product",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Belen Palacio",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "It’s just as I wanted",
      "text": "It’s a very good phone and in a perfect condition",
      "rating": 5.0,
      "verified": true,
      "author": "Joana Sackey",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Check battery, should be over 80% efficient",
      "text": "After 2 months battery needed replacement, 50 qwid from Apple",
      "rating": 4.0,
      "verified": true,
      "author": "Dennio",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "I find it more comfortable to hold.",
      "text": "I really love the screen size, and the battery life. Nice colour. It’s great improvement on my last one, iPhone 5s. Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Josephine",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Very good",
      "text": "I am very much satisfied with the product no doubt!",
      "rating": 5.0,
      "verified": true,
      "author": "THAGU",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Five Stars",
      "text": "Really good product, fast delivery and helpful staff. I recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "SIMPLY A CHEAT , it is awful condition and it said on the listing it is acceptable ?????",
      "text": "it is awful condition and it said on the listing it is acceptable ????? I don't see that in the pic explains all .... IT IS VERY BAD CONDITION AND NOT ACCEPTABLE !!",
      "rating": 1.0,
      "verified": true,
      "author": "WEST LONDON SHOP",
      "helpful_votes": 30,
      "publication_date": 20180923
    },
    {
      "title": "Wrong phone!!!",
      "text": "I received a Motorola instead of an iPhone. Would have given zero stars had that been an option.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim McCamley",
      "helpful_votes": 23,
      "publication_date": 20171220
    },
    {
      "title": "An amazing smartphone",
      "text": "Without a doubt, one of the best smartphones out there. Fast, stylish, amazing. My personal favourite out of all the ones on the market currently. If the price is a drawback for you - I assure you, it is worth every penny. No cons to this phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristiyan",
      "helpful_votes": 14,
      "publication_date": 20170723
    },
    {
      "title": "Love it",
      "text": "Absolutely love it!! If you guys are like me: afraid to spend this big amount of money online for a phone that you're not sure will turn out original well then you can be sure you will receive a brand new iPhone 7plus buying from here!! Love it love it",
      "rating": 5.0,
      "verified": true,
      "author": "Michela Santagata",
      "helpful_votes": 11,
      "publication_date": 20170914
    },
    {
      "title": "Iphone is locked to a network",
      "text": "The iphone came locked to a network carrier. Even if the purchase says sim free. I have to spend extra money to unlock it after I already paid in full for it",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20170814
    },
    {
      "title": "Highly recommended 5*",
      "text": "Bought this new and it's great - it's still in original packing and the 1 year guarantee was activated the day i received it! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "B. G. Barnes",
      "helpful_votes": 6,
      "publication_date": 20170614
    },
    {
      "title": "5 stars!",
      "text": "Fast delivery, great seller services and the iPhone is brand new and unlocked like said.",
      "rating": 5.0,
      "verified": true,
      "author": "Lzonian",
      "helpful_votes": 3,
      "publication_date": 20161030
    },
    {
      "title": "Great Apple",
      "text": "It is of high quality and great design. I love it so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Aiden",
      "helpful_votes": 3,
      "publication_date": 20161208
    },
    {
      "title": "Excellent overall ...",
      "text": "Excellent upgrade especially coming from an iPhone 6. Can't complain at all. All the features do make a big difference if you are coming from the previous version.",
      "rating": 5.0,
      "verified": true,
      "author": "MB2012",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Love it, an awesome phone and aside from a ...",
      "text": "Love it, an awesome phone and aside from a few hiccups with delivery it arrived in perfect condition and I was playing with it 1/2 hour after setup downloaded all my previous phones settings from the cloud and I was all set. This was £169 cheaper than going through apple direct, no brainer. top marks",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon Fairey",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Love it!",
      "text": "Absolutely Love this iPhone 7 plus !! Got a good value from Amazon, with coupons became even better!! Easy to set up especially if you are already an iPhone user. Does so many things, fantastic picture quality, can't leave without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "fantastic, wonderful",
      "text": "fantastic, wonderful, love it, never owned an i phone before, always had an android, this is so much better, highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Excellent product just as described",
      "text": "Excellent product just as described. I bought two described as very good and they were like new. I bought one described a good and it had a very slight blemish on the screen which i covered with protective glass. With a 12 month warranty they are great value. I would recommend to anyone i knew. Thank you very much. Regards Monty Moseley.",
      "rating": 5.0,
      "verified": true,
      "author": "Monty Moseley",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Does what it says on the tin👍👍",
      "text": "Love the phone, many thanks just what I was looking for",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Faux",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Again, anytime !",
      "text": "Delivered as promissed. A 6s plus Box but who cares. Phone is flawless.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank T.",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Love apple",
      "text": "Love it , fast , good picture quality and reliable .",
      "rating": 5.0,
      "verified": true,
      "author": "Thor24",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Am so happy with my purchase really needed a new phone it ...",
      "text": "Am so happy with my purchase really needed a new phone it came fresh in a box with everything inside nothing was missing it was brand new also i was so happy that it came the next day after ordered it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170330
    },
    {
      "title": "Five Stars",
      "text": "Love iPhone 7 as far more better and faster than 6s Plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Shiv Sharan Singh",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "One Star",
      "text": "the product cane broken too me very upset about it",
      "rating": 1.0,
      "verified": true,
      "author": "evelyn kwabiah",
      "helpful_votes": 3,
      "publication_date": 20171118
    },
    {
      "title": "One Star",
      "text": "It was used, we found social network and email accounts inside",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20170808
    },
    {
      "title": "would recommend to anyone doing something similar great seller and good ...",
      "text": "Brand new unlocked iPhone 7 plus 128GB as described, a little pricy though but purchased to last me the next 3 years through university so I'm not tied into any contract.. would recommend to anyone doing something similar great seller and good delivery speed",
      "rating": 4.0,
      "verified": true,
      "author": "Olly Duffy",
      "helpful_votes": 12,
      "publication_date": 20161120
    },
    {
      "title": "One Star",
      "text": "I order this item and receive only one empty box",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 27,
      "publication_date": 20170117
    },
    {
      "title": "just front protector not 3d cover",
      "text": "its not 3d cover , it is just front protector",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20161121
    },
    {
      "title": "Excellent phone.",
      "text": "The iPhone 7 Plus is a beautiful phone that's still very reliable & easy to use. The software is super fluid, even with iOS 12. I love the camera but miss the headphone jack. Still with buying in 2019/20",
      "rating": 5.0,
      "verified": true,
      "author": "RyanUK",
      "helpful_votes": 2,
      "publication_date": 20190601
    },
    {
      "title": "Good phone but overpriced for something so dated.....",
      "text": "Had a fault with the home button and screen brightness went up amd down randomly, Apple retuned it as couldn’t find a fault, got full refund and bought a Pristine one grade A from CEX for £130 less.....Plus a 2 year guarantee, it’s CEX for my next phone",
      "rating": 5.0,
      "verified": true,
      "author": "Reddwaf4ever enterprises",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Very good battery life",
      "text": "The 7 plus has noticeably better battery life than the iPhone & I had previously, quite large now (too large for 1 hand only) but it has handy features to help deal with this. Very good quality phone, feel no need to get an 8/X/XR etc. And in gold it's beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasim",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Does everything we expect",
      "text": "Got this for my wife after the battery in her old one died. I already have one and it does everything we expect but at a cheaper price than I paid originally.",
      "rating": 5.0,
      "verified": true,
      "author": "Bhuddabean",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "A lovely beautiful phone",
      "text": "I am very happy with my new IPhone I wanted the plus as it is a bit bigger, the battery life is fantastic, my son tells me he needs to Charge his every night I only have to every 3 days so far..",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Can see display better.",
      "text": "Bought this as a replacement for iPhone 7. Can see display better.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Ghiara",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "My best iPhone yet",
      "text": "Purchased to replace an ageing 4S. Nice big clear screen in an easy to use size. The things I don't like are features of iOS 12 rather than the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "B. T. Taylor",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Excellent product!",
      "text": "My daughter is “over the moon” with delight at her new iPhone! Excellent product which my daughter tells me is everything she wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Graham J Evans",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Not too good",
      "text": "Had the phone for over thre Monty’s. Works fine but speaker bad. And seller not too bothered (I guessed) when I complained.",
      "rating": 3.0,
      "verified": true,
      "author": "chinedu",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great phone - let down by poor battery and heating up",
      "text": "Great phone - let down by poor battery and heating up. Great delivery and customer service.",
      "rating": 4.0,
      "verified": true,
      "author": "Kal27500",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Solid apple device",
      "text": "Bought for my mother due to old iPhone 4 dying, She love the fact it’s battery lasts her a few days and how easy it is using iOS as in it’s easy to swap between devices and not having to learn all over again!",
      "rating": 5.0,
      "verified": true,
      "author": "Wd",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Best phone Ever",
      "text": "This was for my Wife,She thinks this is the best phone She has owned. Loves it",
      "rating": 5.0,
      "verified": true,
      "author": "R8AYO",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "As good as new",
      "text": "I have had it for over a year now and it has worked incredibly well, I have not has one single issue with it. Very happy with the outcome!",
      "rating": 5.0,
      "verified": true,
      "author": "Emelina Gall",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Superb phone.",
      "text": "Excellent phone just like new not a mark on it! And the price was excellent value, will buy from this selller again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon jones",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Rose gold color very pretty",
      "text": "Lovely phone, large screen and superior photo quality. Seems to charge quite slowly. If you buy from Amazon, phone is brand new sealed in box.",
      "rating": 5.0,
      "verified": true,
      "author": "Fifi",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Original Boxed and Arrived Quickly",
      "text": "Original, fully boxed, perfect, been using it about 3/4 of a year now and perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ C. Fraser",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "more than 5 stars!",
      "text": "I bought this August last year and until now its finger lickin' Good! Very Satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Uriarte",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "It is good quality",
      "text": "I did not like that he does not have a charger and headphones.",
      "rating": 4.0,
      "verified": true,
      "author": "Ana Irina Groza ",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Excellent",
      "text": "Outstanding as always from apple if you ignore the price tag. :/",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 2,
      "publication_date": 20161212
    },
    {
      "title": "Extremely good condition for nearly half the price of a brand new iPhone.",
      "text": "Very happy with this iphone, it came earlier than stated and has fulfilled all my expectations, after reading numerous reviews on various phones, both Android and Apple. Extremely good condition for nearly half the price of a brand new one, only lacking the original box & earphones etc that would normally come with a new purchase, but I knew that, so wasn't disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "iPhone 7",
      "text": "Love this phone lot of money but well worth it",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Five Stars",
      "text": "Great phone. Does all that I need. Don't drop it as a screen replacement is around £170.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeP",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Five Stars",
      "text": "I absolutely LOVE this phone. I used to have golden Iphones but this rose color is actually pretty cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "iPhone 7 plus",
      "text": "what can I say...... best phone out there up to now , great screen (see pic) so easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Scousekenny",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "IPhone 7 Plus is a define Plus",
      "text": "Absolutely fabulous. The service I received was spot on. The phone is brilliant. I had been looking at the iPhone 7 and the iPhone 7 plus and couldn't make my mind up which to have. I decided to have the 7 plus. I have not regretted it one bit. It's a great size and to be honest I hardly use my iPad now as the screen is so much better in size than I had expected",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 2,
      "publication_date": 20170410
    },
    {
      "title": "A stunning piece of technology",
      "text": "What's not to love about this device? (Apart from the price) I don't by Apple for the image. I buy for the ease of use and the reliability. I've not been disappointed by this iPhone.",
      "rating": 5.0,
      "verified": true,
      "author": "blackjazz",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "One Star",
      "text": "smashed after less than a day of having it! I suggest buying from an apple shop itself",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170602
    }
  ],
  "product_meta": {
    "title": "Apple iPhone 7 Plus 128 GB UK SIM-Free Smartphone - Jet Black",
    "rating": 4.6,
    "feature_bullets": [
      "5.5\" Retina HD Display",
      "Multi-Touch display with IPS technology",
      "1920x1080-pixel resolution at 401 pp",
      "Splash, Water and Dust Resistant"
    ],
    "categories": [
      "Electronics & Photo"
    ],
    "price": "",
    "specifications": {}
  }
}