{
  "website_summaries": [
    {
      "verdict": "Aesthetically pleasing and large enough to accommodate bigger pills such as fish oil.",
      "pros": [
        "Made of plastic that securely keeps pills protected when travelling or otherwise",
        "We love that the material is BPA-free",
        "Customers appreciate the small touches including lids that stay open while filling pills"
      ],
      "cons": [
        "While the lids are tight for a reason, some customers note they can be quite difficult to open"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A good start but needs design improvements",
      "text": "Advantages are the compartments remain closed after filling; compartments can hold several large tablets/pills; writing spaces are large; and there is room for other papers in the pocket (where the white paper is shown). Disadvantages include days of the week are written smaller than the times (e.g., \"morn\"). This design feature can be confusing if working with many medications/supplements, especially with frequent medication changes. A second disadvantage involves the difficulty properly locking the individual \"daily\" containers into place. The third disadvantage is the lack of room to maneuver the individual \"daily\" containers out from the clear protective cover. For reference, I'm male, mid-40s, and manage several chronic health issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 48,
      "publication_date": 20180617
    },
    {
      "title": "Wow, XL doesn't tell you just how big it is",
      "text": "Ok, I guess I didn't understand just how big thing is. The tray is 10 1/2 inches wide by 6\" long. Each day is 1.5\"wide, 6\" long and1.5\" high. Each day is divided into 4 sections. Each section is 1.5\" square and will hold every possible number of pills, medications, supplements I can imagine anyone taking. It is extremely easy to fill as the tops will stay open for you to open all of them and add the pills. The tops may break off eventually as they are plastic. IF you are careful with things, they will be fine. If you are not careful, you will break them.",
      "rating": 5.0,
      "verified": true,
      "author": "MerryChristmas",
      "helpful_votes": 65,
      "publication_date": 20170314
    },
    {
      "title": "RIP-OFF",
      "text": "The lids to each separate compartments are extremely difficult to open. I have to use a thick nail file to pry them open. Seniors don't need that! Also, the individual daily sections pop out of their space making it difficult to keep the pieces organized without having to fuss with them. Seniors don't need to have to fuss with something that is supposed to help them, especially for twenty-five bucks. Want to return it but can't find an online option to do so. RIPPED OFF!!!",
      "rating": 1.0,
      "verified": true,
      "author": "C.J. IN USA",
      "helpful_votes": 46,
      "publication_date": 20170605
    },
    {
      "title": "Pretty to look at but not convenient to use",
      "text": "The case was great, the plastic containers were nearly impossible for me to open. The first one I broke a fingernail on trying to get it open it was totally inconvenient to have a come out of the container to load your pills you could not open them without removing them I was not pleased",
      "rating": 2.0,
      "verified": true,
      "author": "Judymomofsixgreatkids",
      "helpful_votes": 28,
      "publication_date": 20180219
    },
    {
      "title": "UPDATED REVIEW (Originally rated it a 1, but in less than 24 hours I have changed my rating to 5 STARS!)",
      "text": "I initially wrote a review giving this product ONE STAR, but I would like to change my rating. The product arrived with three of the seven compartments unable to close and secure medication. Within minutes of notifying the seller, he addressed the problem and has replacement parts in the mail to me. Given the seller's desire to deliver an exceptional product, I am confident that this pill holder will exceed me expectations!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr David L. Alcorn",
      "helpful_votes": 67,
      "publication_date": 20161127
    },
    {
      "title": "Buyer beware! Terrible product!!",
      "text": "The compartments are VERY hard to open and close! Also, they fall out of the case so you have to hold it all together to turn over to get the pills out! It's horrible! I'm already shopping for a replacement. I discarded my old one or l would switch back.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 25,
      "publication_date": 20180313
    },
    {
      "title": "Best Jumbo Pillbox",
      "text": "I love my Jumbo Pillboxes. They have such large compartments. I can close each lid easily. No more shaking and rearranging pills just to close the lids. I bought 2 Jumbo XXL Pillboxes so I only have to fill my pillboxes every other week. I am very happy. I recently lost my Friday pill day. I was really upset but the warranty cover it and they sent me a Friday to complete my weekly Jumbo XXL pillbox. I was so happy how fast they responded to me. I received it the next day. Stuff Seniors Need.com is a wonderful company. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 20,
      "publication_date": 20170831
    },
    {
      "title": "Awful!!! The daily sections don’t stay in ...",
      "text": "Awful!!! The daily sections don’t stay in place i had to use double sided tape cause my daughter kept losing days!!!!! It was always in a pile on my counter!!!",
      "rating": 1.0,
      "verified": true,
      "author": "ERIC C ARRUDA",
      "helpful_votes": 23,
      "publication_date": 20180620
    },
    {
      "title": "I like it, but should have taken the measurements seriously",
      "text": "They weren't kidding when they say it's an XXL pill case. In the picture I posted, I put the pill organizer (without the case) next to my iPad mini so you could get an idea at how big it is. I like it, but should have taken the measurements seriously! Lol ... will definitely hold a lot of pills.",
      "rating": 4.0,
      "verified": true,
      "author": "ChrisG",
      "helpful_votes": 16,
      "publication_date": 20170331
    },
    {
      "title": "Big and will for many medicines in one box",
      "text": "My original box broke, I bought a replacement and it was too small to fit all of my father's pills. I bought this one and I love it. It now fits all of my father's pills. If you are taking many pills at a time (morning, noon, evening, night) this will be great for you. This can easily fit 3 or 4 multivitamin sized pills and a few regular sized medicines in each box. If you take 2 multivitamin sized pills and a couple medicines, the others could work, but I do recommend this one, especially if you need more space and it should be harder to lose.",
      "rating": 5.0,
      "verified": true,
      "author": "Art",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "It is nice and big however that was a terrible smell to ...",
      "text": "It is nice and big however there was a terrible smell to it. I am still airing it out. We need another one of these for traveling so I bought another both had a terrible smell. I put drops of essential oil on it and rubbed in all over and left it out for a few days and then it is okay. I do wish they offered one like this in a tapestry to make it more attractive and less smelly and I wish they had a two week one. Other than that it is very nice. You can fit a ton of large supplements in it.",
      "rating": 3.0,
      "verified": true,
      "author": "3Ob1v7",
      "helpful_votes": 5,
      "publication_date": 20170516
    },
    {
      "title": "BAD item",
      "text": "If I could give no stars, I would. This is stuff seniors do NOT need. My husband and I, who are not yet seniors, had difficulty getting the boxes open. No way could my elderly parents do it. In addition, the boxes are loose in the tray, allowing them to fall out easily. Yes, the boxes are large and would hold many pills, but if one can't open it ....",
      "rating": 1.0,
      "verified": true,
      "author": "anniekatz",
      "helpful_votes": 10,
      "publication_date": 20170207
    },
    {
      "title": "Wow that smelled AND it didn't work.",
      "text": "The vinyl cover smelled. I mean it really smelled. As for the pill container, it had a major design flaw: no tab to open each compartment. I'm not a senior with arthritis and I couldn't slip a nail under the lid to pop open. I did not like that each strip was in the plastic tray separately, the plastic film holding the color boxes and white tray to the super-smelly vinyl cover was flimsy. This was NOT senior friendly - it wasn't people friendly. It was also non-returnable which I did not notice until too late. Waste of time, money and plastic.",
      "rating": 1.0,
      "verified": true,
      "author": "AMH-om",
      "helpful_votes": 9,
      "publication_date": 20170531
    },
    {
      "title": "I've already put my pills in this",
      "text": "I like the way the pill boxes close tight and don't open accidentally. And I like the leather case to hold the pill trays. I keep it loaded so i can just grab it and go and have all my pills with me. I just bought a second one and have it filled. I am planning a move so I have 2 weeks worth ready to go at a minutes notice.",
      "rating": 5.0,
      "verified": true,
      "author": "Rufus",
      "helpful_votes": 4,
      "publication_date": 20190712
    },
    {
      "title": "Purchasing my third one now",
      "text": "I already have two of these & am ordering a third so I can sort my pills for three weeks in advance. They have held up extremely well versus other pill sorters. they don’t pop open when they’re not supposed to yet they are not difficult to open and close. I use them daily. The case also makes these very easy to travel with. Best part is I can fit all my pills, even three large fish oil pills. I fit about 20 different kinds of pills that I take once or twice daily into this organizer. They have four compartments for each day morning noon evening and bedtime.",
      "rating": 5.0,
      "verified": true,
      "author": "amberpsalm23",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "best big medication organizer",
      "text": "has 7 colorful pill holders with 4 compartments each, am, noon, pm, bedtime. has extra labels. i relabelled mine to use for once a day dosing for 30 days. has a lifetime guaranteed. it measures 11” by 6 “, fits in purse, opens like a notebook. also bought one for my mom and she loves it. the cover makes it discreet, looks like an address book. worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Knowles-Jonas",
      "helpful_votes": 4,
      "publication_date": 20180728
    },
    {
      "title": "Great extra large compartments for many or large meds/vitamins",
      "text": "Loved it was as promised. Loved the extra large compartments, good for those who have a lot of medicines / vitamins or good sized medicines / vitamins. It also has a nice carrying case with a slip in plastic liner so meds/vitamins dont spill when traveling. Also provided is stickers to replace the lettering, as we know most of lettering wears off on most pill boxes. So I'm glad they provided these. Thanks. The only thing I dont like was the compartment tray was a little bent which caused the compartments the inability to snap in properly. Would have gave 5 stars except for this.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "BOTH EXCELLENT",
      "text": "The Lids stay open for filling!!! If you know what I'm talking about then you will be thrilled with these. Yes, they hold many pills bc the containers are large. The containers are secure, your pills will not dump out. I don't know if I will ever use the case but all 7 containers fit snugly into a white tray, which could be hung on the wall with velcro. I love them both. If I get the wrong pill in the smaller one's container, of course it's a bit harder to get out. If you have a lot of large pills, you will need the larger one. Both excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "Val Turquoise",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Not a favorite purchase.",
      "text": "Great idea, but the pillbox is of poor quality (flimsy material), fits poorly in the base and the flap lids get in the way as you try loading pills into the slots. Didn't care much for the dark colors either. Much prefer white or a lighter color on the inside of the daily sections as that is easier to see inside of. Travel case seems useful though, but I wouldn't buy it again knowing what I know. .",
      "rating": 2.0,
      "verified": true,
      "author": "WON",
      "helpful_votes": 3,
      "publication_date": 20170612
    },
    {
      "title": "Toxic!",
      "text": "This item smells like it was dipped in toxic waste; it's so bad it made my eyes water. Obviously I can't put supplements in it, but apparently it's not eligible for return, either?! Going to have to call Amazon, because there's no mention of this in the listing and I'm certainly not keeping it. Caveat emptor!",
      "rating": 1.0,
      "verified": true,
      "author": "BG",
      "helpful_votes": 7,
      "publication_date": 20170628
    },
    {
      "title": "It looks nice and I like black case it came with",
      "text": "It looks nice and I like black case it came with; however I bought it for my 82 years old mother and it was impossible for her to open the compartments itsetves; some are better than another; they say it will get easier with time, but she lives on her own and it has to work for her from the start; for that reason it's going back",
      "rating": 3.0,
      "verified": true,
      "author": "Lova",
      "helpful_votes": 2,
      "publication_date": 20180507
    },
    {
      "title": "Finally kept all my pills in one spot",
      "text": "Was having trouble keeping my myriad of pills straight as to what and when I took things. Wife had me on about 50 different supplements for a few months. After speaking with dr and pharmacist they told me all that was doing was giving me expensive urine. Went back to just taking medication prescribed and a few vitamin supplements and no longer use this for weeds and extracts From all over the world. Great product regardless, not lockable if you have any little ones or pull heads in your house though.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Hudson",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Impossible for senior to open ,",
      "text": "The size is fine , I like the travel case but the pill sections are so hard to open it is a problem for a senior. I read the inserted directions and it's still difficult for a 50 year old and impossible for the 80 year old they were bought for . That's why it gets a 1 star .",
      "rating": 1.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 6,
      "publication_date": 20170609
    },
    {
      "title": "Well-made, and easy to use.",
      "text": "My husband likes the 4 selections per day in one container, so he can take a day's pills with him easily. The size of each space is great, and the lid closings seem secure. Having a week's worth all in a zippered carrying case is super for traveling. Color coding would help someone who isn't red/green colorblind. The labels were a nice addition he did not expect, and will use. What he was hoping for was that each case was secured somehow in the tray, so if he dropped the tray, they would stay in it.",
      "rating": 4.0,
      "verified": true,
      "author": "Flutterby",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Always flopping around",
      "text": "Each day is a different container. As you remove one, the others tend to get jumbled. Also, VERY tight locks so somewhat hard to use. Good only if you take so many pills (or several large ones). Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Dixie Reader",
      "helpful_votes": 2,
      "publication_date": 20191018
    },
    {
      "title": "Size and easy to fill and use.",
      "text": "Way too large; returned it and ordered small one which works well now, but if any one of the pills gets even a little bigger, the case will be too small. Need something in between. With insurance companies only covering generic drugs, pharmacies are constantly changing suppliers. On last refill had two prescriptions that each had two different generic pills, all small white pills. Before I knew what I was taking because the pills were consistent in size, shape, & color and used a strip with 1 cube for each day. No longer the case; need case for times to take meds.",
      "rating": 1.0,
      "verified": true,
      "author": "Gamma",
      "helpful_votes": 2,
      "publication_date": 20180415
    },
    {
      "title": "I’d try this one first. Sturdy, secure, large lettering, fast shipping",
      "text": "If you take a lot of medication like I do, I wanted something larger to be able to fill the 15 pills I take in the morning. I don’t take anymore the rest of the day, so I decided to use the noon, dinner and bedtime ones and treat them just like they were my regular morning ones. This way I can fill out 28 days in advance. Comes i. A very steady case and lots of security to hold you pills in place. This is very East to read and perfect for traveling. I would recommend it, very fast shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne Rudrud",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "This Colorful Case Does The Job!",
      "text": "Boxes have plenty of room for larger pills like potassium supplements; will be more than adequate for those who have to take multiple medications. The cassettes can be somewhat difficult to open for anyone with significant neuropathy of the fingers--something to keep in mind particularly if you are diabetic or are going through chemotherapy. The item arrived on time and without any shipping damage. I was disappointed to receive a black case; I could have sworn I ordered a different case. I also didn't care for seeing the logo on the case. Both of these are minor cosmetic issues. On the whole, it's a very good case for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "reese",
      "helpful_votes": 2,
      "publication_date": 20161205
    },
    {
      "title": "Awesome pill box, but one box doesn't fully close.",
      "text": "The individual pill boxes are large enough to hold multiple pills and I love that I can get my pills ready on Sunday for the entire week. Every morning I grab the pill box I need for that day and it fits perfectly in my purse. The only thing I'm slightly upset about is that the Friday pill box doesn't close effectively. It keeps popping open and I have had to use tape to keep it shut.",
      "rating": 3.0,
      "verified": true,
      "author": "Melissa Zimmerman",
      "helpful_votes": 4,
      "publication_date": 20161209
    },
    {
      "title": "Large enough to handle a bundle of meds. Easy to flip open. Color coded",
      "text": "Bought this for my brother. The nurse that comes to the house helped me pick this one. Works beautifully it has its own case even contains a place card inside that helps maintain the names of the meds and when they're taken and I like the idea that it comes with a label just in case the ink comes off of the plastic so far so good he is so non-compliant this really does help we're able to know if he has had his med or not so there you have it it's one of the best ones I've seen on the market",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.  Wiggins",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "It's PERFECT for those who have to take multiple pills",
      "text": "It's PERFECT PERFECT PERFECT All the problems I had with previous pill containers are solved with this new Travel Pill Box. The size allows for large pills a well as numerous pills. The plastic slide in assures me that the containers and pills will NOT fall out. The outside case is nice looking, sturdy and has a zipper to make all secure. The BEST PART = each day's pills....AM thru PM can be removed from the rest....allowing me to carry just that day's medications not the whole kit. It's PERFECT !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Betty P",
      "helpful_votes": 2,
      "publication_date": 20170425
    },
    {
      "title": "Pill container usefulness!",
      "text": "My husband is a 25+ year heart patient. He also has NASH, diabetes, blood pressure issues, high cholesterol and many, many medicines to help keep his heart from dying and beating properly. Therefore, he is on over 15 medications several times a day. This container allows me to make up his medicines for a whole week and the boxes are big enough to hold all his morning medicines! Thank you, thank you, thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Hensley",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Worth every penny.",
      "text": "My biggest concern when looking for a replacement pill organizer was the build quality. I decided to take a risk and use the logic \"Higher cost means higher quality\". It paid off wonderfully in this instance. Unlike the 2 previous products I used of a similar design, these pill containers stay closed and are very sturdy. I've been using it for several months now for my Mother, and other than some minor decal fading (The printed text) , the product it working just as well as the day it arrived. (It comes with replacement decals, by the way) Spend the extra few bucks and invest in this product.",
      "rating": 5.0,
      "verified": true,
      "author": "HUGGIES",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "The people at Stuff Seniors Need give awesome customer service",
      "text": "The people at Stuff Seniors Need give awesome customer service! Most of the pill box sections were great, but a couple didn't stay closed. I told the SSN customer service rep (Tony Rovere) which sections were a bit of a problem, and within a few minutes he mailed me replacements. I'm completely happy with this product and this customer service! Thank you very much! Jan Wiles",
      "rating": 5.0,
      "verified": true,
      "author": "Bindi Vanderiel",
      "helpful_votes": 6,
      "publication_date": 20161207
    },
    {
      "title": "Perfect for those large size supplements",
      "text": "Read the reviews both good and bad and decided to try it. So glad I did..I use the smaller size for my prescription medications but this is great for my supplements. I use it out of the case at home and reserve using the case for travel. Since 2x a day is the most I need to take any of the supplements this actually holds a months worth for me",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 2,
      "publication_date": 20170414
    },
    {
      "title": "Best pill case ever!",
      "text": "This pill case is the best of them all in my opinion. Seems like the older you get the more meds you have to take. These pill boxes got you covered, my wife and I have several medications we take daily, I like to fill these up once a week and don't have to remind myself or her to take our pills. The compartments are big enough for them all and still have room to close and snap the sturdy lids shut without having to worry about them remaining closed or popping open due to over filling. We both love these pill boxes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimbo9918",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Nice way to carry your medications for travel as wll as at home.",
      "text": "I already had a smaller version of this pill organizer and liked it so much that I ordered this one for my husband. This is great for travel and for daily use as well. This way you'll know if you took your pills or not. Now we don't have to carry different containers of pills with us when we travel for a week. I still use my travel case at home and fill it up weekly so I can keep track of what pills I have taken. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "J.P.",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Makes Meds FAR Easier to Track and Take!",
      "text": "New to having to take meds on a daily basis, not to mention taking multiple different times on a daily basis... This organizes the multiple pills logically and keeps me up to date with the medicines. It is easy to fill them all, then remove one \"day\" and have it in plain view and easy reach, while the rest can be tucked out of the way. then the next morning, trade the empty \"day before\" for the \"current day\". Generous size boxes gives a LOT of room, far more than I need even with four to six pills in some sections of the \"day\".",
      "rating": 5.0,
      "verified": true,
      "author": "Tee's",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Awesome!! Love it!",
      "text": "This is really great! Each section is plenty big for all supplements/vitamins/medications. You can fit them ALL in there! I have to take a lot of supplements for my diverticulitis many times a day and this is perfect. I don't have to measure them out every morning and have them in many different ramikens on my counter like I did before. You can take out one day at a time and keep the rest in your pantry or cabinet. When you're traveling you can take each day along with you so you don't forget to take your lunch or dinner pills, etc. A great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica R",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Love the size of the pill containers",
      "text": "When I first received the pill organizer, I though,”This thing is huge”. It took some getting used to. Now that I am in a routine, I love it. I have my prescription medications that I take three times a day. I also take a probiotic and turmeric , Vitamin B 12, Vitamin D 3 supplement . The supplements I put in the evening slot. I love I can take out the daily trays and put in my purse and go about my day. I love the carrying case it comes in too. A very nice product. I am well pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Scmeemaw",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Love the product but a bit pricey",
      "text": "Wife made fun of me when I bought this. Asked if I was going blind. I take a few supplements in the morning that are “horse pills” and they don’t fit in a regular pill case very well. This case has plenty of room and I like that you can easily separate a days worth of medication for a day trip. The plastic sleeve that the case fits into doesn’t look like it will hold up very well. Needs to be a heavier gauge plastic. Also, although I like the fact that the lids fasten securely, I believe that if you have arthritis you may want to think twice about buying this product as the lids fit very tightly.",
      "rating": 4.0,
      "verified": true,
      "author": "ep",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Dont' buy.  it has disappointment all over it.",
      "text": "I liked the generous cell size. The cells were literally painfully difficult to open. I broke a cell lid within the first week. Poorly designed: Flimsy plastic retainer for the cells in the tray: To much work to get things done. To much of the price seemed to be devoted to the bulky leather(ette) cover and not enough to the product. To the seller's credit they offer to refund my money if the product was returned w/i 30 days. Unfortunately, it took longer than that to find and receive a different product. Because they offered to refund my money I won't mention what I bought to replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "Jane D.",
      "helpful_votes": 3,
      "publication_date": 20180411
    },
    {
      "title": "Perfect for a week's meds",
      "text": "This is a replacement for another organizer I had. It is far superior to the one I had. Having each day be a different color makes it easy to load and keep track of daily. Like being able to see through the compartments to see if I have taken all of that day's pills. The case is nice to keep all of the containers secure. I can easily pick it up and take it with me if I am going away from home for extended days. Only drawback is that the printing is coming off some of the compartments. The enclosed stickers will help but they may come off with use. I still highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Favorite health accessory purchase this year!",
      "text": "I absolutely LOVE this pill box! I would give it 10 stars if I could. My favorite features are the frequency sorted by morning, lunch, dinner and bedtime since many of my supplements are taken during these times. Second, the travel case is amazing and stylish and inconspicuous . I can take them on the go and not forget to take them. I also love that you can take out each individual day separately and just bring that day along. Highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "GA Mom of 4",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Sturdy. Travels well",
      "text": "I’ve gotten to where I’m taking a lot of supplements as well as a few prescriptions. This really helps keeping everything sorted out! I also enjoy creative aspect that they are in proper light spectrum order (ROY-G-BIV). There are hard to open and close sometimes. Although that makes him a little more secure when traveling... The Pre-printed labels rub off too easily.",
      "rating": 4.0,
      "verified": true,
      "author": "curtis m.",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Would try a different product",
      "text": "I've been using this product for a while now. I love the bigger compartments and the overall design. However, the compartments are VERY difficult to open so not he bets product for people with arthritis. Also, he plastic has already ripped from taking each compartment out.",
      "rating": 2.0,
      "verified": true,
      "author": "Sunflower435",
      "helpful_votes": 3,
      "publication_date": 20180101
    },
    {
      "title": "easy to use",
      "text": "The only fault is the writing rubs off very easy, however I did get an extra set of labels. The lids fit tight which make it ideal for travelling. The best part of me it you can with take one day with you when doing your daily outdoors activities. It is just the right size to hold large pills and fit into my inner handbag pockets.",
      "rating": 4.0,
      "verified": true,
      "author": "Anneshah B.",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "It works great for me!",
      "text": "This pill organizer is large, but as a lung transplant patient, I take 30 pills a day, so it works great for me. I can remove pills from organizer one day at a time and carry with me. Since I have to take my pills at a certain time each day, this is perfect. The \"lids\" fit tight so I don't worry about them coming open in my purse. They are a little difficult to fill.",
      "rating": 5.0,
      "verified": true,
      "author": "Bert",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "BETTER THEN EXPECTED.",
      "text": "BETTER THEN EXPECTED. ARRIVED TIMELY. WELL PACKAGED. PILL CADDY IS STURDY AND SHOULD SURVIVE THE OCCASIONAL FALL OFF THE EDGE OF THE TABLE WITH NO PROBLEM. EASY TO USE. BRIGHT COLORS MAKE IT EASIER FOR HUBBY WHO IS VISION IMPAIRED. BEST IS THE CAPACITY - SO MUCH EASIER TO SET UP A WEEKS WORTH OF MEDS RATHER THAN A DAILY STRUGGLE TO DO IT. COMPARTMENT SIZE IS GREAT FOR OVERSIZED PILLS - LARGE QUANTITY OF PILLS. CASE IS GREAT FOR TRAVELING.",
      "rating": 5.0,
      "verified": true,
      "author": "LNB",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Unique and useful system for multiple supplements and/ or scripts",
      "text": "This is well designed and seems to be well made...my husband and I take a lot of supplements and its so nice to just do a weeks worth and they fit in the compartments! Haven't seen a system that has this big of compartments....we really needed this and it did not disappoint...love that I can stick it between the bed and nightstand and it is out of sight compared to my huge tote full of bottles....",
      "rating": 5.0,
      "verified": true,
      "author": "Franniefromsavanny",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "For seniors? Really?",
      "text": "This is difficult to review. The size of the individual pill containers is great. The alternating colors are good. The graphics not so much, it's hard to read the days so you have to crane your next or take the whole day out of the holder to check. The individual pill containers are really hard to open. The whole day container doesn't seat well in the tray and requires a lot of fidgeting. The leather-ish cover is really heavy which makes it inconvenient to travel with. I'm not impressed and considering returning it. Makes me sad",
      "rating": 1.0,
      "verified": true,
      "author": "Dr V Graham-Costain",
      "helpful_votes": 5,
      "publication_date": 20170527
    },
    {
      "title": "I am thrilled!",
      "text": "I am so happy I chose to order this unit! I don't know why I took so long in bringing myself to tell you. The pill box is more than I expected. Due to the number of pills I am required to take throughout the day , the oversized is appreciated. Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "Giggles",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Works great for extended trips",
      "text": "I used this for a month long trip to New Zealand and it did the trick. No worries about missing my meds. It is a bit bulky though and I wish the inserts were divided by weeks rather than by days so you could take just the number of weeks needed on your trip. (they come out of the big case as 4 Mondays, 4 Tuesdays ect..)",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon H",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Fantastic and Helpful",
      "text": "Fantastic and helpful! I have chronic migraines and take many vitamins and supplements daily. I was using two large organizers from another brand per day and still couldn't get everything to fit. Then I found these XXL. I now have three sets of this and am ordering sets for both of my senior parents. I can get a ridiculous number of pills in each compartment and am grateful I found them. If you take many pills of any kind, this is a wonderful and delightfully colorful way to organize them.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lam",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Great For Those Taking Multiple Medications",
      "text": "Exactly what I needed. I love the option of pulling out a particular day, placing it in my purse & off I go. Would have given it 5 stars but it is somewhat difficult to pull the tray in/out of the cover because the plastic covering. The individual “pockets” were very stiff and difficult to open. However, after a few weeks of use, I can easily open the individual pill “pockets.” Good value.",
      "rating": 4.0,
      "verified": true,
      "author": "David P",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "The velcro latch folding down causes you to open upside down",
      "text": "I gave only 4 stars because the velcro latch really needs to go on the other side as in up not down as in photo. You end up opening the tray upside down which i think could risk them falling out. Ive had for a few days and that seems to be my only issue, other than that im happy with and wont be breaking off any more tops as long as i use case. Its worth the $ if you can get use to velcro. I give a solid B+",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "The \"days\" don't stay in the case very well - it's nice being able to pull each day out",
      "text": "I ended up returning this product. It was much larger than what I needed. The \"days\" don't stay in the case very well - it's nice being able to pull each day out, but these would fall out easily if keeping in the pouch. There was also an odd smell to this. I was most upset about having to pay return shipping on this item. For $20+ this didn't meet my expectations.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170831
    },
    {
      "title": "Exactly what I was looking for",
      "text": "I needed a supersized pill holder with compartments that would stay locked. I was tired of squeezing all the pills and supplements into the \"xl\" one I had. The fact that it's so colorful and comes in a carry case is a bonus. Each compartment only gets half full when I put in my 5 calcium pills, a fish oil, 2 magnesium tabs, 2 potassium caplets, and an assortment of other vitamins and prescription meds. That goes in each compartment- not the whole pillbox. And Tony- the person I purchased this from- checked in with me through email every step of the way. It was my privilege to support his small business.",
      "rating": 5.0,
      "verified": true,
      "author": "mcoh61",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "High quality pill organizer!",
      "text": "This pill organizer is great. Not only does it have each day of the week but has dividers for separating your medication for those taking pills at different times a day or up to 4 times a day. The material the casing is made of is nice quality, easy to grasp as it is grippy, and makes taking your medication on-the-go much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "mike covello",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Large size and smart design",
      "text": "This is the smartest design I've seen for a pill case. It is huge and perfect if you take a lot of large sized vitamins or supplements. Each compartment snaps shut but the fact that the case allows you to slide the entire thing under a plastic sleeve means that no pills will fall out even if you drop it. This makes it perfect for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "okmichele",
      "helpful_votes": 3,
      "publication_date": 20161126
    },
    {
      "title": "The Absolute BEST",
      "text": "This is excellent for large meds and supplements. Just slide out the day you need and you are ready to go. I love this and highly recommend it. I am the worst about remembering to take my pills. This has helped me so much. I just flip on the TV on Sunday night and get ready for the week.",
      "rating": 5.0,
      "verified": true,
      "author": "pj0908",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Very handy.",
      "text": "I bought two of these for my 83 year old mother-in-law so she can organize all her pills for the trips she takes. She likes the large lettering and the color coding so she can take a day's worth of pills and drop them in her purse. She especially like the travel case. I thought it would be too big and I should have gotten the smaller one --- but she liked this size.",
      "rating": 5.0,
      "verified": true,
      "author": "JSW",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Exactly what we needed!",
      "text": "I ordered this to organize my mother’s mefication and it has been wonderful! I love it! The compartments are very large and will hold huge pills and a lot of pills. They are easy for my mom to open and the insert really helped me write everything out (dosage, days/times, etc)! I also love the case!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Perfect for my needs",
      "text": "This pill organizer is exactly what I was looking for. It is portable, clasps tightly, and is large enough for my medications and my supplements. The customer service is amazing too. I had one that had a broken clasp. I contacted Tony and he sent a replacement compartment. I couldn’t be happier without my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawna",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Lots of room, but one faulty lid",
      "text": "I really like this for my supplements. This gives me enough room for all my supplements. I take throughout the day. Unfortunately one of the plastic lids was not created correctly and will not shut so I have to rubber band it. That is why I'm giving it 4 out of 5 stars because one of the areas in the red will not shut.",
      "rating": 4.0,
      "verified": true,
      "author": "Fitness lady",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Easy and convenient",
      "text": "Sized just right to hold the amount of supplements I take daily. I also like being able to \"pop out\" a day of pills to carry with me. Second photo shows how many pills fit into one section.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Downing",
      "helpful_votes": 12,
      "publication_date": 20170206
    },
    {
      "title": "Worth every penny",
      "text": "Works like a dream if you have a lot of pills to take everyday at multiple times through the day. We use all 4 compartments each day. The bonus is if you are going only a few days you can pack just those days worth of meds. We still take for a week because I'm a worry wort! Lol",
      "rating": 5.0,
      "verified": true,
      "author": "mom24/7",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Well worth finding, pruchasing and using. Would buy again if needed or will recommend.",
      "text": "Ordered two- they are as pictured. Bright see thru colors, they sit in white base tray, tops easy to read. Extra labels if original letters wear. Black case nice. Each day tray removes easily/replaces easy. Top hinges stiff/ will loosen with use. Great for lots daily supplements. Wish we could buy as 14 day (this is 7 day) or purchase second without Case. We are satisfied - Delivery was fast.",
      "rating": 5.0,
      "verified": true,
      "author": "memawrequest",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Plastic too thin is ripped won’t hold tray",
      "text": "Plastic that holds tray in place ripped an torn won’t hold vitamin tray in place went to store got heavy duty plastic tape for repair better now than the plastic on original product which will not last",
      "rating": 1.0,
      "verified": true,
      "author": "james m. calcante",
      "helpful_votes": 2,
      "publication_date": 20190824
    },
    {
      "title": "We take a ton of supplements and I am very happy with the size of the compartments as well as ...",
      "text": "This pill box handles all of me and my husband's supplements - we outgrew the standard size pill boxes. I use the top 2 rows for his morning and evening supplements, and I use the bottom 2 rows for mine. We take a ton of supplements and I am very happy with the size of the compartments as well as the rainbow color which makes it easy to keep days of week in correct order.",
      "rating": 5.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 2,
      "publication_date": 20170422
    },
    {
      "title": "EASY TO OPEN BUT STAYS CLOSED WHEN YOU WANT IT TO!!!!!!!!!!!!!!!",
      "text": "OMG. Can i give it 10 stars?? I have so many health issues and take sooooooo much medicine. This container has more than enough room for everything I have to take. It also has a good contact card on the inside for your necessary information. My absolute favorite thing about this item is that it has a plastic envelope to fit the medicine tray into and a lid with velcro closure to keep it secure. I have literally thrown it into the back seat on several occasions and it does NOT fall open. OMG LOVE!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "kimberley turner",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Very good solution for someone taking many pills.",
      "text": "This is larger than the pill container that the VNA gave my mother. She takes 20 pills in the morning and other varieties I have to split between 2 different cases. This works with all of them.. I find this confuses my mother less because she can take out the entire days medicine, for 4 different times of the day. I liked it so much that I have bought a second one so I can put up 2 weeks at a time.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie Novak",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Holds lots of supplements!",
      "text": "I like that the individual compartments are large and hold lots of supplements. I also like that they are grouped by day, not by meal time as some are. (I can pop the day's supplements in my purse and have them wherever I go.) I understand that someone else may prefer that their breakfast pills, their lunch pills, their dinner pills, or their bedtime pills are all grouped together. I would prefer that the plastic was not colored, but that is just personal preference.",
      "rating": 4.0,
      "verified": true,
      "author": "IWasWondering",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Overall a nice secure pill container",
      "text": "I like this due to the case the pill container is in. It closes with velcro, so if dropped the containers stay closed and the pills do not go flying everywhere. I would have given it 5 stars, but the Saturday afternoon container will not stay closed. I t makes that one section unusable.",
      "rating": 4.0,
      "verified": true,
      "author": "V. Cline",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Not wasy to open",
      "text": "They are very difficult to open. You must use your finger nail to poop it open. This is advertised for senior citizens and I believe it would be very difficult for them to open. I am also disappointed that I can not return this item. It was also advertised for senior citizens.",
      "rating": 2.0,
      "verified": true,
      "author": "Garden Girl In Seattle",
      "helpful_votes": 3,
      "publication_date": 20170611
    },
    {
      "title": "Good product",
      "text": "Great for travel - I would not use it for Air travel, as I believe that you have to have all medication in prescription bottles. It would be great for those of you who set up meds for someone else. The lids are a bit tight, but loosen after use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Great organizer but difficult to open and close.",
      "text": "Handy and practical for organizing and traveling with your supplements and meds. They are stiff when opening and closing and stay stiff for a long time, so if you have arthritis or other difficulties with your hands, this probably wouldn’t work for you. I took away one star because of the stiffness.",
      "rating": 4.0,
      "verified": true,
      "author": "JJ Worth",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Awesome! A great buy!",
      "text": "I bought this pill pill organizer for my mother, we originally got the small one but it was too small but she’s going to use that for traveling. Then I got the XL organizer and there’s a huge difference in size, she has to take a couple of what I call “ horse pills” 30 min before every meal and this organizer is wonderful and fits it all. The extra money is worth it and mom likes it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Turner",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Holds large pills or large amounts of pills in each compartment.",
      "text": "This pill minder is the best! I have lots of supplements in addition to my regular meds and they take up a lot of space. I can get everything into the individual compartments that I need at each dosing time. The overall size is good as I have RA and small things are hard for me to handle. It will be especially helpful on trips because I’ll have everything organized and the case packs well in my luggage. Traveling will be much easier with this carrier.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.Claus",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "I also love that each strip is separate from the next",
      "text": "I take a lot of vitamins and supplements, and am so excited to have found a pill box large enough to hold them all! I also love that each strip is separate from the next, so if I am going out of town, I can take however many of the strips I need to get me through rather than packing the whole case.",
      "rating": 5.0,
      "verified": true,
      "author": "E. L. Jenkins",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "JUST WHAT WE NEEDED",
      "text": "Wonderful product. We were looking for a LARGE pill organizer for the wife. Needed one that was for four times per day. This one is just the ticket...also love the tab that holds the organizer closed. Great for us...may also purchase a second one for me. Just the thing for SENIOR RX needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Nyl Noswar",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "A really excellent pill organizer",
      "text": "I love this pill organizer. It's like a mini briefcase for my pills. I also like the paper in the pocket because I can list down my breakfast, lunch, and dinner meds which makes it so much easier for me. I have a bad memory and I take a lot of pills so writing the down on that paper in the organizer is good stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Rex Camposagrado",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "Only a score of 2",
      "text": "I like the concept of this but they do not stay snug unless completely in the case. When they are outside of the black case they become loose.",
      "rating": 2.0,
      "verified": true,
      "author": "Beverly Callaway",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "For Everyone!",
      "text": "Perfectly large! Was dividing daily vitamins into 4 slots, only find I save time and frustration by using one of these large slots for an entire day. Any way you go these open easily and close securely. The case is nice to hold all secure, travel safely and good for privacy. All around good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "GiveEmKel",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Fits all my drugs and supplements",
      "text": "Love this extra large pill case. I had the large one and outgrew it between prescriptions and supplements. I don’t think I’ll outgrow this one. It has a nice leather look case so there’s never any worries that you’ll have all your pills fall out. Tony at Stuff for Seniors is great to work with!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Loved this pill container from stuff seniors need",
      "text": "Loved this pill container from stuff seniors need! It is the biggest I’ve come across for a four day container! It can fit all of my supplements and antibiotics which is great! I also love the case it comes in ... it’s great for keeping it in my bag and not letting my pills all fall out! The one thing I’d try and improve is the opening of each compartment. It’s a little difficult but I’m sure will break in and become easier for me! I woild Definitely recommend this company!",
      "rating": 4.0,
      "verified": true,
      "author": "Mikayla",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Perfect!",
      "text": "Me and those I care for are very happy with these pull boxes. I made personalized labels because each has specific needs. Easy to fill! Easy to use! Great for daily travel or longer. We have included some medical detail in top pouch available to doctors. This has been a very good investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great organizer, poor material to keep closed!",
      "text": "This organizer is great. Very sturdy and handy. Only issue is the velcro fastner has already started to come off. I have not even had it a month and it is separated and will be fully off soon which means the case will not stay closed!",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "I thought the quality would be better. I just received it today for Christmas and ...",
      "text": "For the cost, I thought the quality would be better. I just received it today for Christmas and do not have time to return it now since its 2 days before Christmas. The plastic is very cheap and some of the lids do not fully close and stay shut. the others appear warn already. It appears if you were to open and close it several time a day, which my father who has cancer must do, that they will break right off. I am disappointed in the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Carolyn Nasto",
      "helpful_votes": 2,
      "publication_date": 20161223
    },
    {
      "title": "Made poorly",
      "text": "I had issues with the daily pill containers staying in the base. They do not stick in there well. I only can get one day to actually stay in the base. The other ones fall out",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Larson",
      "helpful_votes": 2,
      "publication_date": 20191230
    },
    {
      "title": "It's important to me that I can put a months worth of pills in one secure case.",
      "text": "I bought the smaller version, when it first came out and have enjoyed using it. Now, with the larger version, I can include all of my supplemental vitamins in this case. I put a days worth of pills in each box and am covered for the next 28 days. Love this pill case and have recommended it to many of my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Gibson-adair",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "The large compartments hold all her medications plus her OTC vitamins easily. The days are not only clearly marked but ...",
      "text": "I ordered one for an older friend of mine. She loves everything about it. The large compartments hold all her medications plus her OTC vitamins easily. The days are not only clearly marked but color coded. Also, the company is awesome. While visiting family Christmas she lost her \"Monday\". She was very upset. I contacted the company about a replacement and not only did they promptly send one, they did so free of charge. I was so impressed with this product that I have since ordered one for myself. Not only would I do business with this company again I look forward to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Day",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Easy to use",
      "text": "I like the overall size. I also like that the compartments are larger than the ones I have owned before. I also like that I can remove just a days box to take with me if I am going some where for the day. The case it all fits in is nice for travel, keeping everything safe from spillage. A bargain for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Mar",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Good space, poor quality.",
      "text": "Great size for holding lots of supplements. The daily rows don’t stay securely in the base without being in the larger case. One of the snaps on one of the containers broke the first time I opened it. The quality of the materials is very poor.",
      "rating": 2.0,
      "verified": true,
      "author": "H. O'Hollaren",
      "helpful_votes": 2,
      "publication_date": 20181211
    },
    {
      "title": "Will not spill",
      "text": "This is really nice and sturdy. Large enough to fill easily without struggling with tiny compartments. Just what we've been looking for. Very easy to close up with the cover and travel with in a backpack or in your luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitzi Whitford",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Great Customer Service",
      "text": "I received this pill box promptly and it fits my needs. Large enough to fit all my supplements and the traveling case is great. Many complaints about how hard it is to open but if you have any nail at all it shouldn't be difficult. I would prefer to have a pill box a little harder to open then one that flipped open easily and spilled my pills. The Saturday bedtime compartment lid was cracked and I reached out to the company and received a new Saturday container in just a few days. Great customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Nice well made, easy to use pill organizer.",
      "text": "Great customer service, fast shipping, and really nice pill box. My old one did not have the pill case and would spill out when we were traveling. I like it so much, I'm going to order another for my husband.",
      "rating": 5.0,
      "verified": true,
      "author": "Marleespal",
      "helpful_votes": 3,
      "publication_date": 20161223
    },
    {
      "title": "Flimsy Made",
      "text": "Product was not as expected. Boxes are loose fitting, inside of envelope is clear plastic but very flimsy.",
      "rating": 1.0,
      "verified": true,
      "author": "Candie Magill",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Love it",
      "text": "This pill organizer is excellent. Needed something to help husband get his meds in order. Exactly what I wanted. Exactly as advertised. Well made, convenient to use. Delivery was quick. Would recommend. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda E",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Superior Product & product support!",
      "text": "Fast shipping, great packaging, on time delivery. This is an outstanding product, my wife loves it. If you take a lot of large vitamins and or Rx pills this will hold them! The company has superior communication, follow up, and product support. This is a well made product.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Gould",
      "helpful_votes": 0,
      "publication_date": 20170206
    }
  ],
  "product_meta": {
    "title": "Extra Large Pill Organizer 7 Day Weekly XL Travel Case Medication Reminder Pill Box Morning Noon Afternoon Night Daily 28 Detachable Compartments",
    "rating": 4.6,
    "feature_bullets": [
      "★ IMPROVED DESIGN BY A CAREGIVER – Convenient pill organizer 7 Day makes organizing your meds easy. It can also be the perfect supplement organizer for those who are more active.",
      "★ PEACE OF MIND FOR CAREGIVERS: Convenient weekly pill organizer is the perfect medicine organizer 7 days in advance! Time-of-day compartments make pill management simple & precise in the stylish, attractive pill case.",
      "★ CUSTOMER CARE PROMISE: Stuff Seniors Need offers complete customer satisfaction, period. Our customers are more important than our sales. If for any reason you are not absolutely happy with the stackable pill box, we will replace or refund your pill boxes and organizer, no questions asked. CONTACT US directly and we will take care of you. We love to help!",
      "★ TAKE IT ANYWHERE: small, compact pill organizer can fit in your purse or a small travel bag to take with you on the go. See pictures on the left for dimensions of the compartments and the whole plastic case."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.5 x 1.5 x 12 inches; 1.19 Pounds",
      "Item model number": "BD4068",
      "Date First Available": "September 29, 2016",
      "Manufacturer": "Stuff Seniors Need",
      "ASIN": "B01LY0FGRV",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "OTC Medications & Treatments",
      "Health & Household",
      "Pill Dispensers & Reminders",
      "Health, Household & Baby Care",
      "Medication Aids"
    ],
    "price": 21.97
  }
}