{
  "website_summaries": [
    {
      "verdict": "If you can afford its initial and ongoing costs and aren't looking to hang your work in a museum, the HP Sprocket Photo Printer is a simple and enjoyable way to get photos off your phone.",
      "pros": [
        "The HP Sprocket is exceptionally easy to use and prints straight from your phone",
        "The image editing tools bring fun to an otherwise ordinary task"
      ],
      "cons": [
        "Print quality is average and the cost of replacement paper can add up quickly"
      ],
      "aspects": {
        "Value": 6.0,
        "Features": 8.0,
        "Performance": 6.0,
        "Design": 7.0
      },
      "publication_date": 20161221,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Ten times better than the Polaroid Zip!",
      "text": "Ten times better than the Polaroid Zip! About 5 times faster photo transfer to the printer and 3 times faster print speed. Software is a winner over clunky Polaroid app. This one is a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather V.",
      "helpful_votes": 204,
      "publication_date": 20161008
    },
    {
      "title": "Beware if you are using the Samsung Galaxy Note 5",
      "text": "Beware if you are using the Samsung Galaxy Note 5 Android 6.0. I say this because these were my specks at the time of trying. The pictures came out fast and dim. Very grey like in color. No matter what I did. I could not rectify this. Then I did the picture from an older phone. The picture was fine. From the Samsung Galaxy S7 and the picture was fine. After doing some research (not on amazon) I have found that a lot of folks using the Note 5 with Android 6 were having the same problem. So if you have this phone beware!!! It's not compatible!",
      "rating": 2.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 7,
      "publication_date": 20170426
    },
    {
      "title": "This is a great product! Quality of the image is everything you ...",
      "text": "This is a great product! Quality of the image is everything you could expect from a portable printer. Is light and feels very solid. The app is super user friendly and really straight forward to use. I opened the printer and was able to print in less than 5 min. I would totally recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20170321
    },
    {
      "title": "Horrible print quality.",
      "text": "I genuinely don't know why there are so many positive reviews for this printer. I did some research before purchasing, and the reviews here put me over the top for the HP. Based on what I read here, we had high hopes. However, when we pulled it out of the box, and the family started printing pictures, there was nothing but utter disappointment on everyone's face. The print quality is terrible. Really, truly, BAD. We tried printing pictures from everyone's phone, and not a single one of them was of decent quality. It was not a matter of the prints being too dark, they just looked awful. Weird colors, poor contrast, streaks, etc. Don't waste your time on this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Sinned",
      "helpful_votes": 4,
      "publication_date": 20180107
    },
    {
      "title": "Love it! This app connected Samsung Note 3 (unlike poloroid zip)",
      "text": "Bought the poloroid zip and the app failed so I hoped this HP would work and it does! I love the sticky backs and use this for journals and most recently for the father's day card I made for my father. Note, I haven't updated the app since I bought this, so caution to read recent reviews just in case! At first I had issues with it connecting and printing, but I followed some youtube video on what to do to sync it properly and it's been connecting and printing smoothly ever since!",
      "rating": 5.0,
      "verified": true,
      "author": "cakeNbacon",
      "helpful_votes": 4,
      "publication_date": 20170617
    },
    {
      "title": "No matter what I do the images have yellow undertone",
      "text": "Nice little machine. Not hard to operate ONCE you hunt down the INSTRUCTIONS. HP, WHY SHOULD THE CONSUMER have to hunt down instructions online when you could just put a quick start guide in the box?? Spent a good deal of time trying prints, color correcting to where they look great on my phone screen, or in some cases too light, trying to compensate for the darker printout but no matter what I do the print is darker and always yellower.",
      "rating": 3.0,
      "verified": true,
      "author": "KJ",
      "helpful_votes": 3,
      "publication_date": 20181112
    },
    {
      "title": "Awesome little printer.",
      "text": "I was debating whether to get a Fugi Film Instax or a Sprocket. I went with a Sprocket mainly because i can connect my phone, size, and sticky back pictures. The pictures are really good for a small printer. Everyone that complained about it probably expected professional prints lol. They’re not perfect, but its good. You have to mess around with the brightness on your phone before you print. You get a complete print on the sheet instead of a border print like the Fugi Film. You can also modify, add borders, and other stuff on the app. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Not worth it.",
      "text": "Bought this on the treasure truck and thought I was getting it for a good price but found that it was selling $20 cheaper on Ebay. More about the product, it was a waste of money. Pictures were not vibrant at all. Nothing like as advertised. The pictures look ghostly like and pretty dark. Also, they had an orange tint to the pictures when printed out. Only good things about it was that it's wireless, compact, and does not require ink. That's about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Haro",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Wonderful and convenient",
      "text": "I purchased this for my job at a cat café. It’s a beautiful way to display all the cats individually and we’re working up to building a huge photo album of the alumni cats. In less than a year we’ve printed easily 300 photos. The film is reasonably priced and the editing pictures in the app is extremely easy. The one downside is sometimes the pictures don’t turn out well. The coloring can be faded and black coloring sometimes comes out brown.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Ruble",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Easy, Cute Way to Print Pics on the Go",
      "text": "I love how easy this is to use! What a fun gadget. Super easy to print pics from my phone. I can even add in cute borders or silly icons onto the picture. They do print a bit darker than the original pic from my phone, but the quality is decent enough for my kids to have a tiny wallet size picture of whatever they want immediately. We also have photo paper with sticky backing so it works like a sticker picture which is cool. Very portable and small. Very easy to travel with for pics on the go!",
      "rating": 5.0,
      "verified": true,
      "author": "Two Girls of Mine",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "BUY ONE. HIGHLY RECOMMEND",
      "text": "Hahaha. Just realized I reviewed this product under the case I purchased. Sorry. This is fantastic. Bought for my daughter and works better than ever expected. Pic Quality is great. Easy to use. Easy to reload. Can use with phone and camera. Awesome u can use pics regularly or as stickers. The best part is that it doesn’t use ink. That pays for itself right there. Love so much purchasing another. Which I could remember all stated in first review. Lol. If interested...JUST BUY!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shana",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Terrific and meets all expectations",
      "text": "I love this. It is so easy to use. Some of the reviews comments about picture quality. Yes, it isn't a larger picture with perfect quality, but the value of having a quick way to print small pictures is great. The app is also easy and allows you to edit the picture to your liking.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Clement",
      "helpful_votes": 3,
      "publication_date": 20171206
    },
    {
      "title": "Thank you what an amzing product!!!!",
      "text": "I love it. It is pretty cool to be so small and a printer it helps me print out memories as they happen. The picture color is slightly off but that doesn't stop the beauty of the picture. I hung my pitures on my wall near my bed with tacks. Its perfect for wallet size photos and scrapbooks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannette",
      "helpful_votes": 3,
      "publication_date": 20170912
    },
    {
      "title": "Gimmicky",
      "text": "Not sure why I bought this after having owned a similar Polaroid ZINK printer a few years ago. I was expecting better quality prints after several years of technological evolution. Guess I was wrong. If you just want fuzzy pictures a little bigger than a postage stamp to stick in your day planner, go for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Quick, good quality photos",
      "text": "Great portable printer! Says it takes 50s to print each picture and I'm going to use this for guests at my wedding (to take a picture and then sign by it in the guest book) so that had me worried. It takes about 50 seconds for that first run but after that it's quicker, more like 30 seconds. I'm just going to have a table set up of decorations and pictures set up between where guests get their photos taken and where they will sign the guest book to allow for print time! Prints great quality photos!",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Good Image Quality",
      "text": "We'll see how it stands up to a trip around the world. It was easy to connect to my s7. The app is cool and works well every time. Not too excited about having to turn my location off because the device \"has to use the location\" to produce the pic. My location is not HP's business. Picture quality is good. Editing the pic may be necessary for your image to 'pop', but it can print pretty O.K. looking prints. Definitely good enough for what it is.",
      "rating": 4.0,
      "verified": true,
      "author": "r v",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Easy to use with the app!",
      "text": "I purchased this for a scrapbook project and I loved it! It was very easy to use, but you do have to download an app, it's useless without it. The app was easy to use. The paper and the print quality was great and the fact that it was a sticker picture was awesome for my project! Within the app, you can apply borders, text and \"stickers\" to the picture .",
      "rating": 5.0,
      "verified": true,
      "author": "littlebit232",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Awesome product",
      "text": "my daughter is using it for a smash book project. Great for kids. Not the greatest quality, but still a great product. I am a very happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia Limbaugh",
      "helpful_votes": 7,
      "publication_date": 20170113
    },
    {
      "title": "Love this little photo printer",
      "text": "I bought this for my daughter and she loves it! I love it too. I am back to buy one for myself. She loads the paper without the little blue card and it works great! So yes we use any zink 2 x 3 paper that is available lol. I absolutely love the ease of use!! So simple a caveman can do it lol",
      "rating": 5.0,
      "verified": true,
      "author": "Foxy Vixen",
      "helpful_votes": 2,
      "publication_date": 20171129
    },
    {
      "title": "Horrible quality.",
      "text": "Honestly I was excited to get this for my wife. I read some reviews and was hesitant on getting it due to the picture quality reviews. I don’t like the quality at all. In 2018 pictures shouldn’t look this bad printed. My wife says it’s better than she expected(maybe she’s just being nice since it was a gift) but I don’t like the quality. This really isn’t worth the price. I should have listened to the reviews and just got her a at home photo printer.",
      "rating": 1.0,
      "verified": true,
      "author": "Mitchell",
      "helpful_votes": 2,
      "publication_date": 20181129
    },
    {
      "title": "Easy to use, even my 6 year old could figure it out.",
      "text": "Easy to use but photos are kind of dull... not sure how to explain. I didn’t expect them to be crystal clear and bright, but they seem pixelated and closer to a sepia tone. Bought this for my 6 year old so I could print pics for him to have as he goes back and forth from my house to his dad’s. He’s happy with it so that’s all that matters.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen Z.",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Great as a gift!",
      "text": "Love it! Worth my money! Got this for sister for Christmas last year! Wanted to wait a whole year before making a official review. Sister loves it. She loves putting the pictures that she printed out from her sprocket on her wall. I sometimes use it and print out photos to give as gifts! Such a handy gift I would say",
      "rating": 5.0,
      "verified": true,
      "author": "Amber H.",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Love the idea, but the pictures are always grainy",
      "text": "I'm torn on this - I really like the idea of this printer, but the prints all come out super grainy and odd colored. I still use it, but after all the settings and updates I have attempted, the color and grainy look is still there - it kind of drives me crazy.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "So fun! gone so bad...",
      "text": "I'm changing my initial review - every time I want to use it I have to reset it. To change the paper is ridiculous! it won't work most of the time with the HP paper it requires. I've wasted hours and hours trying to make it work and the print isn't even great. Not worth the money or the time - looking for a new mini printer if anyone has suggestions.",
      "rating": 1.0,
      "verified": true,
      "author": "Dottie L",
      "helpful_votes": 3,
      "publication_date": 20170325
    },
    {
      "title": "Compact. Easy. Excellent.",
      "text": "Just printed my first Sprocket picture and am super pleased! The set up app was straightforward and easy to use. The quality was better than I expected. Working with kids a lot, this will be a great (albeit expensive) activity. The expense is the one drawback to this nifty little machine. $.50 a piece for the pictures will make this only an occasionally used item.",
      "rating": 5.0,
      "verified": true,
      "author": "Dinah B.",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Awesome little printer",
      "text": "This is a great little printer, perfect for any occassion. Simple to use, charge last a while an the app is great. Prints over wifi with Bluetooth an can be used with Apple or android. Small can fit in a purse, backpack. I love that you don't need ink!",
      "rating": 5.0,
      "verified": true,
      "author": "swhite1294",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "It does what I wanted it to - prints tiny ...",
      "text": "It does what I wanted it to - prints tiny pictures for my desk at work. However, the coloring is off by far and I can't seem to get it to adjust to print properly - no matter how many times its updated etc. Bummer. Especially since it costs so much. I'd rather have printed out a few prints from Walgreens for that price and just dealt with the bigger images and the inconvenience of picking them up. heh.",
      "rating": 3.0,
      "verified": true,
      "author": "ldeleon",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Great little gadget for a teenager and her friends!!",
      "text": "This is the neatest little pocket printer. Bought for my daughter for Christmas but of course I had to try it before wrapping! App is easy to download to iphone and sync to printer. The app could use a little more photo stickers to apply to pictures, but I think she will LOVE it when Santa delivers :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Straub",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Neat little printer for fun but not for serious mementos",
      "text": "Very easy to use with the sprocket app on your phone. The app is also frequently updated with super cute stickers and themes for editing photos. My only gripe is that picture quality just isn't there. Even the clearest pictures captured on your phone will print discolored and and slightly hazy. Still very cool for anyone who wishes to print pictures for fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Not happy",
      "text": "I feel a little bit lied to, and that I over spent money, next time will try the polaroid one, I dont like the quality of the pics, too dark, and with lines and dont come commenting HP with your link to improve the quality of the image cos it doesnt work...",
      "rating": 2.0,
      "verified": true,
      "author": "mabs",
      "helpful_votes": 2,
      "publication_date": 20170813
    },
    {
      "title": "No.  Just, no.",
      "text": "My daughter purchased this product with her own money and she is not happy with the product at all. The ink does not stay put on the photos. She started selling these at her school to make some side money and stopped because of all of the complaints she was getting. Save your money and dont buy this product.",
      "rating": 1.0,
      "verified": true,
      "author": "AdoretheSP",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Worked pretty good, But sometimes needs a restart",
      "text": "Worked pretty good, But sometimes needs a restart. Some issues with the app, probably. The quality is good for the travel Journal for my kids. Great idea to have fun on the way. Very good for long time in the airplane.",
      "rating": 5.0,
      "verified": true,
      "author": "mom",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Love this!",
      "text": "I was surprised how clearly this print. I am in love with this gadget. I travel journal and this is perfect for iPhone photos. There is no ink to worry about and batteries. No attachable cables to be bothered with. It is light to travel. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Irma Magana",
      "helpful_votes": 2,
      "publication_date": 20170721
    },
    {
      "title": "Great printer for artistic adventures",
      "text": "I got this little printer to take with me to Disney World to print out little memories for my DIY autograph book. The picture itself prints out in fairly good quality (you can tell it is a quick print off). This does work with other 2x3 ZINK paper you just have to keep the blue sheet that comes with the HP Zink paper.",
      "rating": 4.0,
      "verified": true,
      "author": "D. M. ODonnell",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Picture is pink",
      "text": "I just got my HP Sprocket photo printer yesterday May 8 2019. Pros: - portable - picture quality is good - it can transform into a sticker - picture has a glossy look Cons: - picture has a pink hue (very very pink) - doesn’t print the actual colors of what the image is supposed to look like",
      "rating": 1.0,
      "verified": true,
      "author": "Lily",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "This product does not work and the HP site provides zero support via the chat session",
      "text": "This product arrived as expected, but when I attempted to charge it I was just presented with a blinking red light. This light blinks between green and red, but will never take a charge. I have attempted every solution in the suggested by the forums, but nothing worked. I even attempted to contact HP via the automated chat system and was just lead in circles with no solution provided. I would have given this product a zero, but that does not appear to be an option.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Onorato",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Great price. Great item.",
      "text": "Can't really complain. My girl loves it and she's been using it. The price isn't that bad as well as the price of the paper for it. Quality-wise is surprisingly well despite of how small it is. I almost didn't believe that it doesn't need ink.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Waste of money!!!!",
      "text": "Do NOT buy this. Not only does the cover continuously just randomly fall off, causing dirty and other damaging debris to get inside the mechanical printer area, but after only a few months everything starting printing with a strong yellow shade over the whole picture. And it wasn’t an ink problem - I hadn’t even printed more than 6 pictures by the time this started. Such a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Jules01313",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Simple and satisfied.",
      "text": "Awesome little printer. Ain't perfect but what do you expect for this price? If you edit your pictures right you can get excellent results! But the bad results I've gotten haven't been bad enough to throw away the picture entirely so take that how you will. Some sky photos it stuggles unless the colors are solid it seems. I felt like the first few pictures kinda broke the machine in and it just got better from there. The app is also super easy to use which is a plus. Only way to get 5 stars is to be flawless all the time but as I said what do you expect for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "John Lopez",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "It came with no good instructions. The website is very vague",
      "text": "Printed 2 pics and then paper jam. It came with no good instructions. The website is very vague. Followed what instructions there was and the paper is so jammed it just tears when you try to remove it. It was a Christmas present for my daughter and broke immediately on Christmas day!!! Uggggg. At this price It was a rip off!",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie Lusby",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Ehh it’s okay..",
      "text": "This is just for the fun of it. Don’t buy this and expect to get good prints. The quality is pretty mediocre and the color pay off on the prints is also disappointing. It’s an easy way to print out some pictures to put on your desk at work at best..",
      "rating": 3.0,
      "verified": true,
      "author": "Jem",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Newer version out with bigger better photos",
      "text": "There is a newer version hence the less than five stars. But having prints that you can share is awesome. The photos curl which is kinda unexpected even after flattening them in a book. Print quality is better than expected although still lower than drug store prints. I’m happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Y. Ding",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Pictures Make Happiness!",
      "text": "So far I love my HP Sprocket. It took me a little while to understand the co trolls in terms of effects for the pictures lol. But I love it...now I just need to buy a years supply of paper cause I’ve seen pictures on Pinterest and google and deviant art, just beautiful artwork and stuff and I’m like, I’d like to have them. :) just because. Now with this device I can have fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Welsh",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Pretty good.",
      "text": "Pretty good. Was hoping for better photo quality. It’s not bad for my purpose, of making a easy visual record of the handmade crafts I have made and given to kids / family members. Print speed is acceptable.",
      "rating": 4.0,
      "verified": true,
      "author": "Traci X.",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Poor Quality",
      "text": "Dont waist your time or your money... awesome cool idea but picture quality is very poor... might as well spend a little more money on pictures or ink when it comes to printing pictures",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "So much fun I wish I had bought two!",
      "text": "We really loved this little printer! It was easy to set up, fits in a pocket in my bag and prints easily! I originally planned on giving this to my nieces but liked it so much I'm getting them another one!",
      "rating": 5.0,
      "verified": true,
      "author": "Lupita Accept No S",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Not quite picture perfect",
      "text": "The colors that print off are muted. I was told that it was because of my settings that I had it on, but even with tweeking, my pictures never come out as nice as I would like. It's a great concept, but still has room for improvement.",
      "rating": 3.0,
      "verified": true,
      "author": "KansasKim",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "finally a phot printer for your phone...",
      "text": "Perfect and comes with a fun app to use to insert stickers and texts into the photo. So easy to use. It’s like an instant camera, except using your phone instead. Worked great for my daughter’s Apple Iphone.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Morgan",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Excellent Price-Easy Setup",
      "text": "oh my goodness why didn't I purchase this sooner. Excellent price, easy set up, amazing prints I just love it. I have printed so many photos that I am using in my memory keeping planner. Prompt shipping too.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Daniels",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Poor Color Quality",
      "text": "Great concept but the color quality leaves a lot to be desired. I certainly didn't expect the best but I thought the colors would be more true to the photo. I'll keep it, but I certainly would not buy it again. I'm disappointed in this product.",
      "rating": 3.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Fun little printer!",
      "text": "Bought this for my parents. They love it! Now they can print of pics from their phone of their Grandkids, and put them in a small album or on the fridge! I'm sure as more come out, the price will drop a bit!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Gee-Reads ",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Teenager Must Have",
      "text": "My daughter talked me into buying this product. Far exceed expecatations. The picture quality for me an andorid user was fuzzy, iphone my daughter, clear clarity quality picture. Overall great product,thinking about get the larger picture model, as photos are quite small.",
      "rating": 5.0,
      "verified": true,
      "author": "amanda",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Love it!",
      "text": "After buying this product, my family and I went a little picture happy. We love the portability of this device and thanks to the printable pics we no longer have to worry about storage space on our phones!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Rayner",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "Works great!",
      "text": "Purchased for my daughters. They love them. Works great as long as you understand it doesn’t print large photos.",
      "rating": 5.0,
      "verified": true,
      "author": "ambi*",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Have had item barely over a month and now I ...",
      "text": "Have had item barely over a month and now I am unable to return it but it is printing a line down the front of my photos",
      "rating": 2.0,
      "verified": true,
      "author": "Robin Bishop",
      "helpful_votes": 2,
      "publication_date": 20170622
    },
    {
      "title": "Fair",
      "text": "Good size to cary, a bit heavy for its size. Prints ok pictures. Good for small gifts and to put in cards and stuff",
      "rating": 4.0,
      "verified": true,
      "author": "Jenni ",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Five Stars",
      "text": "Love this little printer, using the photos to add to my travel journal writing",
      "rating": 5.0,
      "verified": true,
      "author": "Astrid M. Van Buuren",
      "helpful_votes": 4,
      "publication_date": 20170718
    },
    {
      "title": "... unimpressed with the quality of the photos they seem dull and yellow",
      "text": "so unimpressed with the quality of the photos they seem dull and yellow! Also the app isnt very intuitive. you cant flip through the photos on your phone you have to look at very tiny thumbnails and select each individual picture to look at closely.",
      "rating": 1.0,
      "verified": true,
      "author": "Luke Reid",
      "helpful_votes": 2,
      "publication_date": 20170914
    },
    {
      "title": "decent",
      "text": "I don't like how the pictures roll up on the sides.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Fantastic \"take along\" printer!!!",
      "text": "Fantastic little \"on the go\" printer... no disappointment at all! Easy setup and simple to use! (Purchasing another one for a gift!)",
      "rating": 5.0,
      "verified": true,
      "author": "LWB",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Love it",
      "text": "The pictures are really small. Wallet size photos but for the product itself it’s so easy to set up and convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "S.C.",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "I absolutely love it - I love how fast it is and ...",
      "text": "Got this as a gift. I absolutely love it - I love how fast it is and how you can customize pictures. It's a great tool for scrapbooking, adding fun pictures to greeting cards, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Dissapointed with colour of the picture once printed. Not ...",
      "text": "Dissapointed with colour of the picture once printed. Not true to what to what you see on screen. Surprised because this product had fab reviews with regards to The printing colour",
      "rating": 2.0,
      "verified": true,
      "author": "Petite International",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Five Stars",
      "text": "havent used it yet, got it for a gift, hope she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Catheirne M. Coleman",
      "helpful_votes": 3,
      "publication_date": 20170424
    },
    {
      "title": "I like the concept and it is small and lightweight",
      "text": "I like the concept and it is small and lightweight. The quality of the print is mediocre. The prints come out dark and the colors are faded.",
      "rating": 3.0,
      "verified": true,
      "author": "L Worthy",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Cool idea, terrible execution",
      "text": "The quality of the print is god awful but it’s pretty awesome that you can print a sticker on the go like that.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason M",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Love it. Perfect for adding pictures to my journal",
      "text": "This is one slick little rig. Love it. Perfect for adding pictures to my journal. Print quality is great w/ exception of a slight yellow tint to all the pictures but nothing think that has to do with zink and not necessarily the printer itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Wilson W. Stewart",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Thumbs up!",
      "text": "I bought this for my 12 year old son who has an older version iPhone connected to this printer. The quality of photos exceeded our expectations! Great little printer and fun and super easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Pink tint no true colors go with the sprocket",
      "text": "Every image has a pink tint to it it is really harsh to look at. The picture on the right is from the Polaroid zip in the picture on the left is from the sprocket. I have both but at this point I just won't use my sprocket so I will be returning it and just continuing to use my zip.",
      "rating": 1.0,
      "verified": true,
      "author": "David Rosenblatt",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Great Printer",
      "text": "I had never heard of a sprocket printer before, but this little thing is awesome especially if you take a lot of pictures. It never needs ink and only requires paper once in a while. I gave this to my wife for Mother’s Day and she loved it. This gift is a sure bet homerun. I would definitely recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Bought a used one",
      "text": "I took a huge risk buying a $60 one that was used it said very good but I was still worried. It works fantastically and I love it!! The only thing that was different from buying a brand new one was there was no box just the insides.",
      "rating": 5.0,
      "verified": true,
      "author": "oldsoul78",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "This product is amazing!",
      "text": "This is amazing and I love it. I don’t really have much else to say. I got mine at a discount because I got a used one but even at full price it’s well worth it. The quality is amazing and I recommend this product to anyone looking for a portable printer without wanting to pay the $100+ price of just about all other printers I saw.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor P.",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Terrible picture quality, fussy operation...",
      "text": "The picture quality is terrible. Every picture has a pinkish hue. There is no way to fix the quality either. Also, the printer is fussy and works when it wants to. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Eloise",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Great item!! Worth it!",
      "text": "Great gift for anyone. Feels great, great printing, easy to set up, thru bouetooth",
      "rating": 5.0,
      "verified": true,
      "author": "Jeramie R",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Worked for its intended purpose.",
      "text": "Bought this for making employee ID cards, it worked out for what it was intended to.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Rockwood",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Great product!",
      "text": "I love this little thing! Sometimes it doesn't connect as well as I would like but the pictures are wonderful and it is very useful for crafts.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Pictures are extremely poor quality. You can edit your pictures on your ...",
      "text": "Pictures are extremely poor quality. You can edit your pictures on your phone but unfortunately they still come out terrible. Don't recommend this product at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "I don't like it but my sister in law loves it because ...",
      "text": "Smallest printer, feels solid. but not for portrait. Skin tone is poooooooooor. I don't like it but my sister in law loves it because she prints heavily filtered photo.",
      "rating": 3.0,
      "verified": true,
      "author": "Sangwook",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "👍🏼",
      "text": "My son Loves to use this to print pictures instantly. A bit pricey but pretty good quality",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Great",
      "text": "Was amazing the first print dont take long and can stick to places",
      "rating": 5.0,
      "verified": true,
      "author": "Yoselin Araniva",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Loved it!!!!",
      "text": "I am a high school teacher and purchase this for a senior high school project. It worked perfect and all my students loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Daigle",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Does not work more than it does.",
      "text": "I have had this printer since July and I realized this week that I never use it. The reason is because it is unreliable. It has trouble connecting to my phone and does not print more than it does. It is very frustrating. Please think twice before purchasing this printer. The point is to have a fun way to share pictures. It does not work. It may be my particular printer. Just want to give a warning. It has sat in my drawer without being used because it does not work.",
      "rating": 1.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 4,
      "publication_date": 20171210
    },
    {
      "title": "love it, but had some difficulty getting it to ...",
      "text": "love it, but had some difficulty getting it to talk with my phone. the pictures are also not as clear as i would have hoped.",
      "rating": 3.0,
      "verified": true,
      "author": "Okoro M.",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Fun and easy to use!",
      "text": "A lot of fun if you like to stick pictures on everything! Very easy to use, and the app gives you many edit options. Not a necessary gadget, but fun none the less!",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart T.",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Loved this little portable printer",
      "text": "Loved this little portable printer. I was expecting the pictures to be a little bit bigger but still pretty cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Martinez",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Buy It",
      "text": "I don't understand the bad reviews. It is a convenient and impressive tool. The printer isn't meant to produce intense quality. Also remember that the quality of your phone picture affects it. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Benzekri",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Sophisticated design and color",
      "text": "I already have a white HP Sprocket but I figured my husband would like his own because he takes way more photos of EVERYTHING than I do. So I decided to go grab this black design for him. And the first thing he noticed was how sophisticated it looked when it's in the palm of your hands. Like, it's pretty in the picture but it's way more sophisticated in person. The functionality he adores as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Love the size a function",
      "text": "Love the size a function. Fits in my hand and i can through it in my purse when i am on the go",
      "rating": 5.0,
      "verified": true,
      "author": "GrandmaE",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Dont belive the hype...",
      "text": "This was so cute but the picture quality was terrible. The colors were faded and dull",
      "rating": 1.0,
      "verified": true,
      "author": "T. Paddy",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Love this",
      "text": "This was a great gift idea and I would get another.",
      "rating": 5.0,
      "verified": true,
      "author": "Athenas Pets",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Colors are off and the quality looks bad",
      "text": "It does the job but the printing is very weird. Colors are off and the quality looks bad",
      "rating": 2.0,
      "verified": true,
      "author": "jewel",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Glad we own one worth the money",
      "text": "A great gift for the whole family works great easy to use great pictures and stickers",
      "rating": 5.0,
      "verified": true,
      "author": "June Enos",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great! Except for one small problem",
      "text": "I love it! I would give it 5 stars, but sometimes the paper doesn't feed properly. It's fixed when I open it and finagle it a bit, but still not ideal. Other then that, I super happy with it!",
      "rating": 4.0,
      "verified": true,
      "author": "Andy G",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Amazing!! I print pictures all the time",
      "text": "Amazing!! I print pictures all the time. Just did a project for my daughter in school of our family tree. Very convenient for on the go too. Family party pictures instantly.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxana C.",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "I’d buy something else",
      "text": "I didn’t get a whole lot of use from it, and now it doesn’t print anymore. The picture quality wasn’t all that great either. The colors weren’t vibrant for my liking.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucenda",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "AMAZING",
      "text": "Prints great ! It small and very easy to set up on your phone. Great gift idea too !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Unforgettable moments",
      "text": "It means so much when you can see the photos you love printed and cherished. It gives a different sense of happiness to me and my family. I would love for my kids to see these sweet photos of me and their dad. It won't be until a couple of years before they can appreciate them but the prints seem durable so my hopes are definitely up.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Easy to use",
      "text": "Pics print a little dark, but it’s fun to print and stick!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Three Stars",
      "text": "My pictures don't print out very clear unless they're black and white.",
      "rating": 3.0,
      "verified": true,
      "author": "LaLa..",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Great buy!",
      "text": "Great buy! Was able to print pictures quickly to pass out to family members during our family day",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Ross-Verret",
      "helpful_votes": 0,
      "publication_date": 20190713
    }
  ],
  "product_meta": {
    "title": "HP Sprocket Portable Photo Printer, Print Social Media Photos on 2x3\" Sticky-Backed Paper - Black (X7N08A)",
    "description": "Color:Black| Style:PrinterWith the portable, lightweight HP Sprocket Photo Printer, print photos from your smartphone or tablet just as easily as you post them. Make time spent with friends more memorable with instantly sharable 2x3-inch snapshots of every fun-filled moment. Use the free HP Sprocket App to customize photos with filters, borders, and emojis, scan printed photos, and view photo collections. Includes 10 sheets of HP ZINK 2x3-inch photo paper with peel-and-stick backing for instant photos or stickers.",
    "rating": 4.4,
    "feature_bullets": [
      "A PHOTO PRINTER FOR ON-THE-GO FUN – Print and share 2x3-inch snapshots or stickers from your iOS or Android devices with a simple tap",
      "PERFECTLY PORTABLE – About the size of a smartphone, this lightweight, portable photo printer easily fits into a pocket or backpack",
      "EASY WIRELESS PHONE PRINTING – Set up Sprocket at parties and events, and everyone can connect to your mobile printer using Bluetooth connectivity (HP Sprocket app required)",
      "CREATE AND SHARE MEMORIES – Connect your social media accounts to HP Sprocket app and instantly turn any of your online photos into color prints",
      "PERSONALIZE PHOTOS OF UNFORGETTABLE MOMENTS – Download the HP Sprocket app to create customized snapshots using filters, borders, emojis and drawings created within the app. You can even scan in printed photos and view entire photo collections",
      "INCLUDES HP ZINK PHOTO PAPER – Use Original HP ZINK Photo Paper to ensure bright, glossy photos every time you print. Just peel off the back of your prints and your photos become instant stickers",
      "HOW TO PRINT – Load HP ZINK photo paper into the Sprocket Printer. Connect the printer to your mobile device via Bluetooth. Download the free HP Sprocket app and enjoy fun portable printing",
      "WARRANTY - One-year limited hardware warranty"
    ],
    "specifications": {
      "Product Dimensions": "2.95 x 4.53 x 0.87 inches",
      "Item Weight": "6.1 ounces",
      "ASIN": "B01LBWELHI",
      "Item model number": "X7N08A",
      "Batteries": "1 A batteries required.",
      "Customer Reviews": "4.4 out of 5 stars4,239 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#70 in Portable Photo Printers",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 15, 2016",
      "Manufacturer": "Hewlett Packard Inkjet Printers"
    },
    "categories": [
      "Electronics",
      "Camera & Photo",
      "Portable Photo Printers",
      "Printers & Scanners"
    ],
    "price": ""
  }
}