{
  "website_summaries": [
    {
      "verdict": "Three color options to match your style.",
      "pros": [
        "Hammer and everything you need to assemble in one box",
        "Easy-to-clean and water-resistant design makes it great for kids rooms",
        "12-inch-by-12-inch storage cubes",
        "Eco-friendly and safe for children and pets",
        "Panels are rustproof and long-lasting"
      ],
      "cons": [
        "Compared to other similar bookcases, this one is trickier to assemble"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for extra closet shelves!",
      "text": "I put these in my closet to make extra shelves for sweaters/sweatshirts. They were easy to assemble and worked great at adding additional space to my closet. I like that my clothes don’t topple over into the pile next to them anymore. They were easy to put together and if I move they will be easy to take apart put in a small box and move. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Goldensummerdog",
      "helpful_votes": 155,
      "publication_date": 20180823
    },
    {
      "title": "LOVE these. 6/5 stars",
      "text": "LOVE these. 6/5 stars. I purchased two sets and assembled them together. Easy enough to put together and only swore a couple of times while doing so! Didn't need screws or wood glue like I had to use with the wooden kind. Only problem I ran into was making sure the 'shelves' were all the way locked into place. So great!",
      "rating": 5.0,
      "verified": true,
      "author": "Disappointed Al",
      "helpful_votes": 136,
      "publication_date": 20161125
    },
    {
      "title": "These shelves were super fun and easy to assemble",
      "text": "These shelves were super fun and easy to assemble. All I needed was my rubber mallet. I did end up breaking one of the connectors though. You can definitely order some additional connectors online though. I ordered this shelf to make a shelf under my bed for my books and I struggled with it a bit because of the size. The connecting plastics stuck up and there were some areas where it would cause issues because of the bed frame. However, it ended up working perfectly for my purposes.",
      "rating": 4.0,
      "verified": true,
      "author": "Idalia",
      "helpful_votes": 34,
      "publication_date": 20180325
    },
    {
      "title": "Good",
      "text": "Pretty good for price. I only use them for clothes and light items, but happy! I bought 4 and put them together in my closet!",
      "rating": 5.0,
      "verified": true,
      "author": ":)",
      "helpful_votes": 79,
      "publication_date": 20170410
    },
    {
      "title": "They go SO well with color changing lights",
      "text": "These are amazing. I bought two sets and use them as a dresser. I don't have to decide on what to wear, I just grab a finished outfit and hit the shower. They go SO well with color changing lights it's unbelievable. Or rather it is believable, but still, you get the point. These are durable, easy to assemble, highly customizable, and perfect for a wide variety of storage options. Like laundry.",
      "rating": 5.0,
      "verified": true,
      "author": "James Till",
      "helpful_votes": 28,
      "publication_date": 20180405
    },
    {
      "title": "It is very convenient how they provided us a hammer tho Would I recommend it to someone else",
      "text": "I would give it a 4 stars if it wasn't delivered broken. Only a piece but I need it to complete my cube): It is not as stable as a expected to be. Another piece broken when I was setting it up. It is very convenient how they provided us a hammer tho Would I recommend it to someone else, I would bcos it is stable for small stuff but nothing too heavy. & you can design it to fit your room perfectly. UPDATE: 3stars to 4 stars The reason why I changed to four stars because they care about their customers. They sent me extra connectors (2 packs) Thank you!",
      "rating": 4.0,
      "verified": true,
      "author": "Myra v",
      "helpful_votes": 29,
      "publication_date": 20170903
    },
    {
      "title": "Flimsy, terrible quality",
      "text": "Unless you plan to store stuffed animals in the cubes, don’t bother. The walls of the cubes are made out of the same plastic material as the plastic folders that go into binders. The metal rods in the structure make it somewhat stable as a construction, but still, you cannot place books on the ‘shelves’ as they bend immediately. The photo l attached shows the bending caused by a tiny stack of children’s books. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "prairiebsicuit",
      "helpful_votes": 10,
      "publication_date": 20190127
    },
    {
      "title": "Great storage unit!",
      "text": "I have been using the organizers with cloth sides and bottoms, which works fine for fabric storage cubes. This one is for the playroom and the solid shelves are great for books and toys, as well as the fabric storage cubes. I love the opaque color of the shelves. It provides a lightness and I can also see the kids decorating the cubes with decals and stickers. I also like that this model has more versatility in shelf arrangement. It came with a special hammer and was easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. P",
      "helpful_votes": 4,
      "publication_date": 20170921
    },
    {
      "title": "Nice, but certainly not a living room piece",
      "text": "Easy construction, took maybe 10 minutes. The whole thing is also very light and easy to move around after built but really does feel stable. Looks nice with cloth storage cubes. I have it in my closet for additional storage, would probably not recommend though as something that will be out in the open or in the livingroom (unless you are like a college/highschool student). It comes with a little hammer to help build and some extra connectors, which is good because I broke one with the hammer. Unfortunately I couldn't get it off the furniture so just built around it. Even with that broken piece near the back it still was solid and not shaky or wobbly",
      "rating": 4.0,
      "verified": true,
      "author": "Khald",
      "helpful_votes": 2,
      "publication_date": 20171003
    },
    {
      "title": "Great for Simple Storage",
      "text": "Perfect. Goes together in minutes and you can build in a variety of shapes. I'm only using four cubes right now, but I like knowing I can always expand. The plastic vinyl covering stuff is pulled taut, so it's very sturdy. It holds piles of cloths or shoes or whatever.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Brotman",
      "helpful_votes": 9,
      "publication_date": 20161006
    },
    {
      "title": "So this thing is really cool. It is easy to put together and gives ...",
      "text": "So this thing is really cool. It is easy to put together and gives you a lot of flexibility on how you assemble it. The one thing I don't really like is the material of the white parts. So they are made of this very thin plastic that when stressed a little get a color change. It is very similar to taking a plastic toy and bending a part of it the wrong way, it gets discolored on that part, and that does not go away.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie Stengle",
      "helpful_votes": 3,
      "publication_date": 20180201
    },
    {
      "title": "Sturdy and functional",
      "text": "This is a very sturdy product. I use it as a bookcase. Once assembled, it is hard to move without removing everything that was added to the shelves. It's best to have two people lift it if you aren't going to empty it first. I'm impressed that it didn't fall apart while moving it. It's easy to lift when it's empty. I recently bought a similar unit from a different company that had flimsy panels that arrived cracked. That purchase helped me appreciate the quality of the Songmics unit more. The material from the Songmics unit doesn't feel like it would crack.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Great product!!!",
      "text": "Great product, I use it as a bookshelf. It wasn't hard to put it together, my 6 year old and I put it together just like playing with legos. I will be buying another one bc I just opened another box of books that needs to be stored. Wonderful product!",
      "rating": 5.0,
      "verified": true,
      "author": "KMM",
      "helpful_votes": 22,
      "publication_date": 20170410
    },
    {
      "title": "Functional, but fragile",
      "text": "I love the functionality of this product, plus the clear color really makes it less conspicuous in the closet. My ONLY problem was the little black connector pieces. Product comes with a small hammer and instructions that say to gently hammer in connector pieces to join the panels together. When I GENTLY hammered the piece it SNAPPED! Thankfully I picked a layout for the boxes that didn't need all the connectors, otherwise I would've been out of luck.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Serralta",
      "helpful_votes": 3,
      "publication_date": 20180930
    },
    {
      "title": "Wonderful/great for storage/kids",
      "text": "I purchased this specificity bc I needed a Storage for my 5 year old and his many toys. I was scared that it was flimsy and would collapse. After having it for a year I can honestly say that this thing has lasted. He takes his bins out daily, throws his toys at random sometimes and it has not collapsed, broken, or torn. The great thing is their is many ways to place it and easy to assemble. I would definitely buy again if needed. So worth the buy and it’s better than having a hug piece of furniture in a kids room.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon_customer",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Great variety, multi-functional and easy to assemble!",
      "text": "I needed something like this to help organize my son’s toys inside his closet space. It’s perfect! Easy to assemble (our 12-year old helped!) and is multi-functional. It can hold toys, books, shoes, clothes, and can be assembled in a variety of sizes. Just pay attention to the instructions to place the connectors in the right way. We needed something that’s large enough to fit his variety of toys but small enough to fit his closet that’s not a walk-in, and this was just perfect. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Milica P.",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "dont waste your money",
      "text": "i thought this was a solid plastic cubical container like the pictures indicate. This is a vynal like material stretched over coat hanger size wire that you snap together using plastic corner pieces. Its junk. It cannot support any weight to speak of. The weight of one roll of toilet paper causes the material to sag. Its not worth 5$ much less 30.",
      "rating": 1.0,
      "verified": true,
      "author": "RobP",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Good for the Money",
      "text": "We're trying to expand storage in our boys' playroom, but we don't know exactly what we want to do yet. We got these kind of as a trial. We would love for them to be the ultimate solution, but for the price we also knew they may be temporary. Over all, we're still on the fence. They've held up so far. I would definitely recommend liter objects on them as opposed to, say, books or records. I'm not sure if we'd make this purchase again, but it's definitely not a bad option if it fits your needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelsey Markley",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Honestly what a fantastic product",
      "text": "So I bought something similar to this that had you stick poles into these small holes and use all your strength to get them to stay. One small yank and the whole thing collapses and all my closet crud that I stacked on it was now on the floor. So I bought this instead. So impressed and so pleased. Very sturdy. Requires some muscle and the hammer is cute but not THAT useful but I like that they included it because you will need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Scfred",
      "helpful_votes": 3,
      "publication_date": 20170404
    },
    {
      "title": "didn't work well on a shelf",
      "text": "I bought this to use on a closet shelf. (it was one shelf with a bunch of space on top so I wanted more storage). However I didn't notice that the connectors are not flat on the bottom. So the back of the boxes lean on the connectors while the front hangs off the shelf a bit and leans forward. We didn't return it because my kid propped it up to make it decent.",
      "rating": 3.0,
      "verified": true,
      "author": "RH",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Excellent Organizer for Any Space",
      "text": "I really think that this is a great piece! It was a little tricky (at first) to put together, but once you get the hang of it, putting it together is a breeze! I got one in white and one in black for the top and bottom of my closet. It works perfectly for what I need it. The squares aren't crazy spacious but perfect for my needs. I also wouldn't use anything too heavy in the them. I love them and plan on ordering more",
      "rating": 5.0,
      "verified": true,
      "author": "D.Vito",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Flimsy",
      "text": "Upon opening I noticed that there were already marks and indentations (picture) from where the tape held them together while packaged. When I opened it up further and had them in my hand I realized there was no way the material could withstand what we were storing in my sons room. If tape made marks and bent them then books and other items certainly would do worse. I immediately returned and am looking for wood based and more sturdy storage.",
      "rating": 2.0,
      "verified": true,
      "author": "Momma of 3",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "BUY THIS!!!",
      "text": "I LOVE these things! I have bought 6 of them so far. The picture shows 1.5 of them I used in my kids play room. They also have them in their rooms. I put one up in my room and removed my bookshelf and hair supplies cabinet. I even have some on the shelves in my closet to hold, separate, and organize my jeans, leggings, purses, etc. Did I mention that I LOVE these!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Very cute",
      "text": "I really like this and it keeps my things organized. A lot of people say that it's not strong / sturdy, but I didn't realize that the material is more think plastic... almost like the paper dividers, more sturdy than that but it's not sturdy at all. I just put it up in my living room and don't really put anything heavy on it at all. Like I said more of a organizing cubby for random things in the living room.",
      "rating": 4.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Sturdy/Attractive/Convenient",
      "text": "I was looking for an affordable shelf/cubby system for my children’s toys, and stumbled upon these. They are perfect!!! You can put them together many different ways, which is convenient. I switch mine around to different ways whenever I rearrange my living room. They are sturdy enough to hold toys and books. And lastly, they look very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Easy to assemble, but limited functionality",
      "text": "I really like this storage organizer in theory but (1) there were not enough of the black connectors to do any \"shape\" or cube combination other than the one in the picture and (2) I'm concerned about the stability. I had initially hoped to make two \"sets\" of organizers given the limited space in my closet. Not an option with the limited amount of black connectors. I would recommend supplying a few extras with every shipment in case customers have smaller closets/spaces or just want the flexibility to choose how they organize their things.",
      "rating": 2.0,
      "verified": true,
      "author": "Kate Sullivan",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Super easy to put together!",
      "text": "If you are looking for cubes that fit in here, Amazon basic cubes in 10.5x10.5x11 fit perfectly! I purchases to create storage in my closet, they are perfect! I thought these were going to be a hard plastic, but they are more of a vinyl material, so you can't stack really heavy items on top. I think over time they would get weighed down. Otherwise, i was able to clean up and organize my closet, they are doing a great job!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Easy to put together with the tools included",
      "text": "Pretty easy to assemble and I like the little hammer it comes with, makes it so much easier to snap the cubes tightly together once they are stacked. I changed my mind about the shape I wanted and had to pull a few cubes apart and ended up cracking some of the connectors, so they are harder to take apart than put together but at least for the shape I wanted I had a few extra connectors to use.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Lin",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Good if you need it",
      "text": "Easy to assemble. Gets the job done. It looks good enough if you need the extra storage. It works well for what you need as it’s easy to fancy up or down; I really enjoyed this product! I’d buy more if I needed them. I’ve certainly recommended them to a couple of people. I live in a small apartment and needed extra storage space this provided both the extra space and a piece of furniture thats not a sore eye. So in my book it’s a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgina Kiel ",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "College Space Saver",
      "text": "As a college student that needed some organizational space, I would recommend this product. It's affordable and easy to put together. I'm currently using this to store my clothes in a more accessible manner, but can definitely see this being used as a video game holder, shoe shelves, or random trinket organizer/trophy case. I definitely would not put books on this as it probably would not hold up, and don't want to try how heavy each cube can hold. All in all, it's a useful storage alternative.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew H.",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "amazing",
      "text": "This is an amazing product. It's easy and fun to assemble (it's like playing legos). You can create any shape you want. I used it to increase storage in my closet. I put it on top of an existing single plank shelf. There was a lot of space there to add this entire assembled organizer. It looks awesome and adds so much space. I even decided not to have some back panels assembled (there's a wall behind), so I could have an extra cube.",
      "rating": 5.0,
      "verified": true,
      "author": "Irma",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "No go",
      "text": "Songmics has been great in the past but they changed their dimensions and now I can not hook them to my old set which was the whole point in buying these, they're cheaper and smaller than the originals I bought",
      "rating": 1.0,
      "verified": true,
      "author": "Alec",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "Super effective for organization and storage.",
      "text": "The metal is sturdy enough to hold baskets filled with items (as long as they are not super heavy items like books). It is more \"modern\" in appearance, easy to wipe clean, and is wonderful compared to the horrible pressboard options that come chipped, cannot withstand any moisture, or bow under weight after time. Fairly easy to assemble. I've purchased 2 and preparing to purchase a 3rd.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 2,
      "publication_date": 20170509
    },
    {
      "title": "Instructions clear, looks great in my closet, but slightly annoying to install",
      "text": "This plastic cube organizer definitely feels sturdy enough to hold a lot of weight and does its job. I would probably recommend this to others. It may have been just me, but it was annoying to get the alignment perfect as indicated in the instructions, so I went ahead and finished installing anyway with slight misalignment between the flat shelf pieces. This left some open gaps in the shelf, but these are hard to notice unless you're really looking. Great product otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Great Product!",
      "text": "Despite a minor delivery set back, these cubes are great! I created a bookshelf after my old one crumbled on me while moving it. These are really versatile in the type of structure you could build with them. My book shelf not only holds books, but my DVDs and other personal items (my room is small so it had to multitask). I bought 4 of the 6 pack, so I had several left over to create another cube shelf for clothes. I bought cubbies to go in that one. Overall a good investment. Was pretty easy to assemble and I loved the mallets that came with the cubes to help you secure the structure.",
      "rating": 5.0,
      "verified": true,
      "author": "Alina Hart",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "A PAIN to put together",
      "text": "I bought this A. because of the price and B. because all of the other dressers I saw online had reviews that went something like this: \"this took me HOURS to assemble!\" I wanted something easy. This was FAR from easy. It comes with a hammer for a reason. I have bruises on my hands trying to assemble this. So unless you have Hercules, Arnold Swartzenegger, or the Rock living at your house, be prepared for some real elbow grease. It took me about 2 hours to put together including taking a couple of breaks because my hands hurt so bad. However, I do like it.... now that it's finally put together.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great way to organize for little cost in odd places",
      "text": "Works great in the small storage spaces in our RV. Works exactly as described. SUPER easy to assemble. My ONLY complain is that they dont send enough of the connectors to assemble in any other configuration than what is pictured. I put 2 squares in the storage cabinets on both sides of my RV's bed in the master bedroom. It left enough of the pannels to assemble another 2 square stack for somewhere else but id need at least 4, but more like 8 more connectors. It wouldnt cost much to simply include a few more. But, small complaint for a product that does exactly what I needed it to.",
      "rating": 4.0,
      "verified": true,
      "author": "Pavmentsurfer",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Love it so far",
      "text": "Some pieces were broken but it came with extras (I counted the pieces and the instructions didn't show it was supposed to come with extras, so maybe I got lucky that it did.) Love it so far. Fits perfect in my kids room closet. I put all my son's next sizes up in hand me down baby clothes we got. Seems sturdy and worth the price. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "B Nunes",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "fit sloped ceiling application",
      "text": "I ordered two sets and sent one back after i open and assembled the first one. The white plastic is okay, pretty durable and will hold a few pounds but the whole thing is not super sturdy and i'm sure will sag and bend over time. It works for my sloped ceiling (attic). I purchased fabric storage boxes (like baskets) to fit inside some of the cubes to keep loose items tidy (it's in the craft room/work space).",
      "rating": 3.0,
      "verified": true,
      "author": "Pam N.",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "So good I have to buy another :)",
      "text": "Much sturdier than I expected. Setup was a breeze. I didn’t even have to open the manual. Everything just clicks together. My initial plan was to bring this to my campus apartment, but I love it so much that I’m going to keep this one here and order another for my university housing! The bins from dollar tree, which many people recommended in these reviews, are perfect to put in the cubes ($1 each).",
      "rating": 5.0,
      "verified": true,
      "author": "CH",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "GET IT!!!!",
      "text": "I looovveee this soo much, that the minute I finished putting it all together, I literally ordered another one!!! It’s mega sturdy, super easy to assemble,l and way cute!! You could totally add the storage cubes that have pretty designs on them and make it look a million times cuter, but alone with the plain black storage cubes, it looks fantastic! I love that you can create different structure designs and that it’s sturdy enough to place cute things on top! I’m using it as drawers for clothes and I couldn’t be happier! Definitely recommend and I wil defund purchasing mor in the future! This could also be a Greag gift idea!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "JimGab",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Prettier than the wire cube organizers",
      "text": "An upgrade from the wire ones I used to use, same concept, easy to install. The material used looks a lot nicer than the wire ones but is not as sturdy as the wire ones. There’s lots of square pieces and attachments so I have used half of them in one room and half in another.",
      "rating": 4.0,
      "verified": true,
      "author": "Marissa",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Excellent! save us some spaces",
      "text": "I bought it 1-2 months ago and it save us some space in the closet. We had lots of clothes and this one is sturdy enough to hold clothes, towels or a couple of sweaters. So far it stays well and sturdy in my mom's closet. Even it took me about thirty minutes to installs all the parts correctly and safely, but it was worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Loan Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "It's  so nice  I bought it  twice!",
      "text": "I orginally bought one for my closet and was so impressed how it decluttered everything I brought another one for my room. It was pretty much easy to assemble and is very sturdy. I probably will by another one in the future and definitely would recommend if having cluttering issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Gordon",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Good bargain, love it",
      "text": "The shelfs were definitely more sturdy then I expected so that was a nice surprise. For the price it does what I need it to do. I’m using it for clothes storage. I also like I can add on to when I want to/need too. I do like that you build it in multiple ways to suit the needs of the space. Will definitely be buying additional ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyleah",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Wonderful little cubes!",
      "text": "I love these things! I got these to replace my old bulky dresser and they're perfect. I didn't put the backs on all the boxes so with 2 sets, I got 18 storage cubes instead of 12( 3 cubes have backs and the rest were open ended). Sturdy and easy to set up, it comes with a little mallet that's great for making sure things are in correctly.",
      "rating": 5.0,
      "verified": true,
      "author": "puffle_huff",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "Versatile Design",
      "text": "I have a fairly small closet and these were perfect to put at the bottom and top to keep all my sweaters and shoes mice and organized and not toppling over every time something is removed. I was able to configure it many different ways to make it fit the way I needed it to. Nice to have something that is durable and adds flexibility to design and organization.",
      "rating": 5.0,
      "verified": true,
      "author": "LuLu 005",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Easy to install, no brainer",
      "text": "Very easy to assemble. Sturdy enough for light to medium weight items. Shirts, shoes, magazines, odds and ends. Comes with rubberized hammer to finalize the fittings. Can be easily taken apart to store away when need to, or to add additional shelves. The feature design I like the most, is that you can rearrange the layout to fit your space or special needs. Great invention. Worth the price I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Jor El",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Sturdy and long lasting",
      "text": "We have a 2 year and 6 year old kid in our home, so not-to-mention the play area gets messy all the time. When we are looking for a solution we stumbled upon the storage organizer. It is a pretty neat and sturdy product and does the job very well. It is easy to assemble and also comes in with own tool to put it together, so we don't need to be worried about not having any special tools. The bins can be put together of any design format.. If needed more bins can be added and attached later.",
      "rating": 5.0,
      "verified": true,
      "author": "Thendral ",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Best purchase in a while!",
      "text": "So I’ve been wanting to rearrange my kids’ closet and was looking for something to replace the hanging closet organizers they had. This was the best purchase I’ve made in awhile! Super easy to assemble (even with a 2yr old and a 4yr old trying to help). Only thing that kinda bugged me was trying to take it from the living room to their closet, the bottom of it kept coming undone. As soon as I settled it in their closet I just fixed it and made sure it was tightened. It holds a lot. Very sturdy, I’m actually about to order another one for mine and my hubby’s closet.",
      "rating": 5.0,
      "verified": true,
      "author": "c.c",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Good choice for storage but won’t break the bank.",
      "text": "I’ve purchased 2 of these for my kids. The shelves are pretty lightweight and versatile. I put it together in about 15 or 20 minutes. Not fancy furniture but good enough for a bedroom or closet. One kid is using it for clothes and the other for toiletries etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 3",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Easy to assemble",
      "text": "Pretty easy to assemble, took about 20-30 minutes. Hopefully will hold up for a while. I don’t think you could put anything heavy on the shelves without ripping or coming apart. Good for T-shirts & shirt organizing. Cubes were smaller than expected but works.",
      "rating": 4.0,
      "verified": true,
      "author": "RW",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Love these! Will definitely be buying more!",
      "text": "These are really easy to assemble and holds a surprising amount of stuff. I bought this to help organize that awkward upper closet shelf and I love it. Bonus, they're so affordable and versatile that you can get pretty creative with storage ideas",
      "rating": 5.0,
      "verified": true,
      "author": "truthslinger",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Ordering another one!",
      "text": "Honestly, I bought this because it was cheaper than the other cube storage units I have found. But ... I logged in to order another one because I absolutely love it. It's light, fun to assemble, can be modified to different formations, less visually bulky than the 'wood' ones but still sturdy. And will be easy to pack and move whenever that happens again. So happy with it. :)",
      "rating": 5.0,
      "verified": true,
      "author": "zoetica",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Awesome",
      "text": "These are great. I just moved and put them in my bedroom for quick clothing storage. They were easy to assemble and the hammer was a big plus. They also fit the fabric drawers bought at target. Great purchase",
      "rating": 5.0,
      "verified": true,
      "author": "galila",
      "helpful_votes": 3,
      "publication_date": 20171025
    },
    {
      "title": "Simple to build, looks great.",
      "text": "Very simple to build and looks even better than the photos! My one critique is that if you are looking for something for kids, this might not work- the “boxes” are made of fabric. It’s nice and lightweight and great for my room- I just had to tell my toddler not to lean on it. Overall, I’m very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Stella Belle ",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Well built...",
      "text": "Bought a set of White and Black. I did an either,or set up, 6-4-2 and couldn't be happier. Went together easily and the included little mallet hammer worked flawlessly!! The connectors are well thought out. Great at hiding clutter and dumping some file folders into the drawers, I bought also. Very happy with this set up!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Well built...",
      "text": "I really like the little hammer and how easy and well done all the parts are. It won't support anything heavy but, for hiding clutter and displaying a few geeky items...well done!!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Sturdy and easy to put together",
      "text": "I used this for my clothes in my closet and its perfect size and can hold a lot in each cubical. If you are looking to organize your closet, under your bed or even your pantry area this is the set you should by. It's AWESOME.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Spencer",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Great quality for the price",
      "text": "I was pleasantly surprised by the quality of both the assembly tools and the pieces of the unit. Putting it together was fairly easy and the unit is light weight which is perfect for my purposes since I put it on a shelf that is above my head. I have not put anything inside the cubes yet as long as I don't over film them I think the unit will hold up nicely. Another review complained that it was hard to get the pieces together to form a square. I didn't have any difficulty with this. It just requires a little pressure to pop the sides into the clips and a hit from the hammer that comes with product.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelica Anne",
      "helpful_votes": 26,
      "publication_date": 20170804
    },
    {
      "title": "Decent",
      "text": "These things attract dust like nothing else and the fabric is a bit too flemsey for the purpose of a shelf but as long as it’s for minimal usage they’re not bad. I like that you can rearrange them however you like and the price is pretty decent so I will most likely order again.",
      "rating": 4.0,
      "verified": true,
      "author": "Bree",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great way to organize toys and clothes",
      "text": "Easy to assemble, easy to access your items, and its sturdier then you might think . And you can stack them and connect them in any pattern that you like. Pretty neat organizing item.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert stroup",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "More storage",
      "text": "These are pretty sturdy and easy to assemble. I have some that are all wire, but I like these better. Using for books and small office storage drawers for paper and accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "bbinmbsc",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "I would not buy again.",
      "text": "If it’s for a child to use as a doll house you got a good buy. For me i still do not know what I can use this for. Hopefully a use will present itself sooner or later. I do not recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ROSEMARY",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Perfect for storing crafting supplies",
      "text": "Use this shelving unit to store my felt and it works great. Is lightweight which is important because I'll be moving it frequently. The metal frame seems very sturdy and the plastic shelving is stronger than I anticipated. I wouldn't use this for heavy items, but is great for lightweight storage",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Love it!",
      "text": "Super easy to assemble and nice looking. I really love this product! I've got 17 books, 3 plants, and one lamp sitting on them and they're holding strong!",
      "rating": 5.0,
      "verified": true,
      "author": "Madi",
      "helpful_votes": 15,
      "publication_date": 20170125
    },
    {
      "title": "Too flimsy to be of real use",
      "text": "Lightning-quick delivery didn't atone for the flimsy product. Forget about storing books or DVDS on this unit. I bought it because I plan to move in months and didn't want heavy dresser it would cost a fortune move. It will hold socks briefs and tees. And that's fine for now. But when I move, this will fall apart completely. And, frankly, it was a pain to assemble.",
      "rating": 2.0,
      "verified": true,
      "author": "Reb MacRath",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Great organizer",
      "text": "Got these six months ago to organize my closet. Can’t imagine the space without them now. Easy to assemble and usually the process ends in expletives for me. Not with this one!",
      "rating": 5.0,
      "verified": true,
      "author": "CGP",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Love it",
      "text": "It took me awhile to figure out how I wanted to set it up but, I got it. In a way, I kind of created more space and it's more divided (should've take a before image, sorry). But I highly recommend it as to create more space and separate the clothing in a more organized fashion 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Harley Quinn",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "DOES NOT FIT 12x12x12 CUBE BINS",
      "text": "12x12X12 storage bins DO NOT FIT! YOU MUST BUY THE 10.5x10.5x11 ones. I had an issue with buying the wrong size bins and the seller was very accommodating and reached out to me to ensure I was happy with the product. Amazing customer service. Also, it was extremely easy to put together. I put it together with my 3 year old in about 10-15 minutes.",
      "rating": 3.0,
      "verified": true,
      "author": "Sara Fellus",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Must Have!",
      "text": "Seriously love this so much!! Already ordered one more for myself, and two for my mom. Must have! Sturdy, and so easy to assemble. I had one left over (hence the extra on top), but I purchased another to extend this cube higher because I love it that much! Trust me, YOU WILL LOVE IT.",
      "rating": 5.0,
      "verified": true,
      "author": "Ebony Dozier",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Most of all I really like this product.",
      "text": "I like this product because is light and space saving. Howeve, there is one peace missing but didn’t realize until I finished assemble it. Because time consuming and I don’t have time to return it. I didn’t return for replacement but would to ask the seller to send in one 12x12 wall.",
      "rating": 4.0,
      "verified": true,
      "author": "Va Vangyi",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Good and inexpensive storage",
      "text": "Using it to store pet supplies, easy to put together and has a unique look. It's of course not going to be as sturdy as a wooden unit, but it's sturdy for being plastic (up to 10 lbs per shelf) and is well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Very disappointed",
      "text": "Very flimsy, not good for anything heavy like books or pantry items which is why we purchased. Also, not enough connectors now we have extra panels and not a way to connect them. Not very happy and don’t want to buy another unit just to get the connectors",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "This thing is great . Ordered me another one",
      "text": "I love this thing I just received it yesterday , put it together and I love it so much I ordered another one lol It’s coming tomorrow and I can’t wait . It’s better than a wood furniture and I love it so much it doesn’t take much space",
      "rating": 5.0,
      "verified": true,
      "author": "AnnaMondavi",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Easy Assembly, Flexibility of Design, and Great Service",
      "text": "These were just what I was looking for--flexibility of design with enough extra parts, perfect size of compartments, and sturdiness for a variety of uses. (The sturdiness has limitations, so I mostly use them for clothes and for cleaning supplies.) I bought two to use in two different places--that left me with extra panels but not quite enough connectors to expand one layout. So I e-mailed the company to purchase extra connectors, and they sent them free of charge--and the person I communicated with was exceptionally nice and helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "A F.",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Pretty sturdy, great value, highly recommend for apartments.",
      "text": "I use it in my closet for additional storage. I put heavier clothing items like bulky sweaters and jeans on the bottom and lighter items in the higher cubes. It’s quite sturdy for me and my storage needs. Sturdiness generally depends on how you arrange it I think. Super easy to set up. Highly recommend for people who live in apartments. Great value and easy to dismantle and store or transport if you’re moving.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "My new toy organizer",
      "text": "I used it for toy organizing, doesn’t seem so sturdy but it can definitely hold toys. I posted a video for better reference on what I’m using it for. Assembly Was fast, just make sure you put the knobs or whatever they are as you build, I’m thinking on buying more for my closet, seems like a very good option for organizing",
      "rating": 5.0,
      "verified": true,
      "author": "Violeta A",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Good product, great customer service",
      "text": "I bought this for my son’s room and I am really happy with it. It looks nice, and my son enjoyed helping me put it together. A couple of the panels had an issue, and when I reached out to the company their customer service was very responsive and helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Looks good but sags",
      "text": "The product looks nice, but the material is soft so it sags. I tried to use this in my pantry, but it was useless because the cans and jars weighed it down in the middle so everything toppled toward the center. I re-purposed it in another closet, but had to buy a sturdier cube organizer for the pantry.",
      "rating": 3.0,
      "verified": true,
      "author": "Laurie Duncan",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Easy to assemble",
      "text": "Was concerned finding something that would work with my wired shelf and figured would try these...works amazing and was so easy to assemble! Great find and happy I purchased!",
      "rating": 5.0,
      "verified": true,
      "author": "roc_em_soc_em",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great organizer",
      "text": "Easy to assemble, good storage capacity, time will tell on durability. I’ve got big family and shoe racks always break so I purchased this to use for shoes and so far so good. Each child has a little cubby they can put their shoes in! Also was a fun activity for my 3yr old as he was able to help assemble!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Troyer",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "The bomb!",
      "text": "This is the bomb!!! Very well made and super sturdy! Easy to assemble and feels strong (like it can hold a lot.) Would totally buy another one if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "gina houp",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Great storage option",
      "text": "These bins are so easy to assemble. My nine year old put them together since I am challenged with RA. It took him less than 20 mins. Using as a bookcase.",
      "rating": 5.0,
      "verified": true,
      "author": "Nica",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "LOVE",
      "text": "Sturdy yet lightweight. Using it for purse storage! I like the size of the cubes because they can fit 5 small purses in one cube as well as fit larger purses.",
      "rating": 5.0,
      "verified": true,
      "author": "Karina A.",
      "helpful_votes": 2,
      "publication_date": 20200405
    },
    {
      "title": "It was super easy to assemble after you look at the direction ...",
      "text": "I bought to organize my art supplies. It was super easy to assemble after you look at the direction pamphlet. The only think I didn't like out this unit was that my tube paints would topple over if I put them to far to the side of one of the cubes. But it was a great buy for organizing, and I will likely purchase another.",
      "rating": 4.0,
      "verified": true,
      "author": "Sylvia Combs",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Other than that for lighter stuff like clothes and some text books it works like a ...",
      "text": "It holds quite a bit especially for the price and material it's made out off. I was quite impressed at how much it could hold but I wouldn't suggest putting an object that weighs 20 pounds. If you put a 20 pound object or more it will probably leave an indent on it. Other than that for lighter stuff like clothes and some text books it works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Affordable and Solid",
      "text": "Most definitely did the job and I’m sure I have way more weight than it should have on it lol.. Feels solid and haven’t had any issues. Easy access to my shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Ill Will",
      "helpful_votes": 2,
      "publication_date": 20181128
    },
    {
      "title": "Great Buy!",
      "text": "Great buy! Very easy to put together, and seems quite sturdy however I wouldn’t put anything extremely heavy on it, but definitely great for storing various items and it looks cute while doing it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jovon Lewis",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Great storage",
      "text": "I’m using this for temporary storage.. plan on putting clothes in them, but they are right now holding pretty heavy items and it’s holding up great.. I plan to get another one for my other closet",
      "rating": 5.0,
      "verified": true,
      "author": "Mercedes Serna",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Very nice",
      "text": "I tried to find a nice shelve that organize our walk-in closet for jeans, shirts etc. This product is perfect fit!! Save so much space hold lots of stuffs. Also I’m happy that we can make smaller when we move.",
      "rating": 5.0,
      "verified": true,
      "author": "Chie",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Not what I expected",
      "text": "Confusing on how to assemble....did not fit my 12×12 cubes...way smaller . Looks nice though..and sturdy... will have to buy smaller cubes now..",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "I like this product, just wish it was more sturdy!!",
      "text": "A little flimsier than expected. Very delicate. Not very strong, but attractive and nice space for shoes. Also fits storage baskets nicely.",
      "rating": 3.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Does the job",
      "text": "Does the job but I wish it had more of the connecters and I wish they stayed together better. You get what you pay for :)",
      "rating": 4.0,
      "verified": true,
      "author": "Shan",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Perfect for shoes",
      "text": "We bought this for our sons closet space at his college house. It is a small closet and we needed something to organize the shoes and work with vertical space as the closet was narrow. this was perfect. It was easy to assemble and you configure it to your liking. It is also very sturdy. We built 8 shelves all vertically one on top of the other and it holds many shoes and my son even has clothes in one or two of the spaces. I recommend it! Has many uses.",
      "rating": 4.0,
      "verified": true,
      "author": "Doris",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Excellent!",
      "text": "Super easy and very sturdy and no problem with the configuration I wanted it even has straps to secure it to the wall so that it won’t topple over Purchasing more for sure",
      "rating": 5.0,
      "verified": true,
      "author": "Karen  L Gattinella",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Very Sturdy, Holds A Lot",
      "text": "Very good product, it was easy to put together. Super sturdy which makes it hard to disassemble. Which isn't a bad thing because you don't want it to fall apart. Holds a lot in each and comes with a booklet of shapes to put it in. Know what shape before you build.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Sturdy and convenient",
      "text": "Quick and easy to assemble. Comes with everything that you need in the box including a small hammer. The cubes seem pretty sturdy. I have various items in the cubes and it has been holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Love these!",
      "text": "Very sturdy, super easy to build. I bought 3 of these to use in our master closets. The only reason I’m giving 4 stars is because it’s hard to move once built because they start coming undone and also the material attract dust and dirt from static. Once it’s where you need it though, it’s great.",
      "rating": 4.0,
      "verified": true,
      "author": "kayla",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Very economical storage.",
      "text": "Easy to put together and very sturdy. I was surprised how much it can hold and being able to customize the shape allowed me to make a perfect fit into the room. I have it fully loaded with books, a stereo, and plants on top and it holds up well. I'm ordering another set to use in the garage to hold tools.",
      "rating": 4.0,
      "verified": true,
      "author": "CadAllV8",
      "helpful_votes": 0,
      "publication_date": 20171107
    }
  ],
  "product_meta": {
    "title": "SONGMICS Cube Storage Organizer, 6-Cube Closet Storage Shelves, DIY Plastic Closet Cabinet, Modular Bookcase, Storage Shelving for Bedroom, Living room , Office, Black with Rubber Hammer Black ULPC06H",
    "description": "Color:Black\n\nThis SONGMICS DIY 6-Cube Organizer will help you keep your home neat, tidy and organized, offer ultimate convenient for your household organization. This Songmics cube organizer is versatile and can be used for storing all sorts of items such as artworks, toys, books, folding clothes or other household necessities. You can assemble this item into different style too satisfy your carious storage needs.\n\nWe still carry set of 6 fabric drawers in 3 colors to match this shelf, you can search \"\"Songmics Fabric Drawer\"\" and purchase at the same time.\n\nSpecification:\n\n- Color: Black\n\n- Assemble Required: Yes\n\n- Material: ABS connectors, PP Plastic Panel and Rust-proof Metal Frame\n\n- Size for each cube: 11.8'' x 11.8¡± x 11.8'' (30 x 30 x 30cm)\n\n- Overall Size: 36.6'' x 36.6'' x 12.2'' (93 x 93 x 31cm)\n\n- Overall Height: 37.6'' (95.5 cm)\n\n- Weight: 8.8lbs (3.9kg)\n\nParts List\n\n- 24pcs Panels: 11.8'' x 11.8''/ 30 x 30cm (L x W)\n\n- 26pcs Connectors: 1.38'' / 3.5cm (Diameter)\n\n- 1pc Hammer\n\nShipping List:\n\n- 1 x Storage Cube\n\n- 1 x Instruction\n\n- 1 x Rubber Hammer\n\nTips:\n\nPlease DIY the cube into different style under the number of the parts we offered",
    "rating": 4.6,
    "feature_bullets": [
      "Organize your life: lots of clean, neat storage space in these premium diy storage cubes. This modern design is in a lovely fashionable white color that will go well with your furniture, carpet, and deco",
      "Store more possessions: these 12\" x 12\" x 12\" (30 x 30 x 30cm)cubes are made of pp plastic sheets with sturdy metal wire frame and abs plastic connectors. Each cube holds up to 10Lbs. This is a very stable structure that won't tip or fall over. Super easy to assemble yourself",
      "Simple assembly: simple and light in structure, it is easy to assemble and disassemble; with provided accessories, this storage shelf can be assembled in different shapes (refer to instructions)",
      "Multiple uses: not only can be placed anywhere in your house or office as a storage shelf for clothes, shoes, toiletries etc., but also can be used as a partition to provide the private space for you",
      "100Percent satisfaction guarantee: we are always available to provide a professional customer service before and after your purchase, don't wait any longer and enjoy it right now"
    ],
    "specifications": {
      "Product Dimensions": "37.6 x 12 x 37.6 inches",
      "Item Weight": "8.8 pounds",
      "Manufacturer": "Songmics",
      "ASIN": "B01LGZOR6A",
      "Item model number": "ULPC06H",
      "Customer Reviews": "4.6 out of 5 stars2,297 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#5,181 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Finish Types": "Black",
      "Is Assembly Required?": "Yes",
      "Batteries Required": "No",
      "Included Components": "SONGMICS 3-Tier DIY Storage Cube Organizer Plastic Closet Shelf 6-Cube Bookcase Cabinet Black ULPC06H"
    },
    "categories": [
      "Clothing & Closet Storage",
      "Home & Kitchen",
      "Closet Systems",
      "Storage & Organization"
    ],
    "price": 28.99
  }
}