{
  "website_summaries": [
    {
      "verdict": "The Huawei Fit is a capable fitness smartwatch, but the software falls short of the competition.",
      "pros": [
        "The Huawei Fit is lightweight, comfortable to wear, and has week-long battery life",
        "It can track daily activities, including heart rate, and can show notifications from your phone",
        "It can be worn in the shower and while swimming"
      ],
      "cons": [
        "The display is dull and touchscreen is difficult to operate when working out",
        "There's no GPS or automatic exercise detection",
        "The Huawei app lacks any sort of social features"
      ],
      "aspects": {
        "Design": 8.0,
        "Battery": 8.0,
        "Performance": 6.0,
        "Software": 6.0,
        "Features": 7.0
      },
      "publication_date": 20161103,
      "rating": 6.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Frozen Screen",
      "text": "This item was pretty good for the first 8 months, but then it stopped pairing to my iphone. Now it is stuck on one screen and will not allow me to use it. I have emailed the manufacturer because it clearly states that there is a year warranty, but the manufacturer has failed to respond to me. I have also contacted amazon, they will not do anything for me either. In addition, the screen quality has always been slightly fuzzy and not very hi-quality looking. The case of the watch is easily damageable and the paint chips off after a few months",
      "rating": 1.0,
      "verified": true,
      "author": "Tkgates",
      "helpful_votes": 9,
      "publication_date": 20171127
    },
    {
      "title": "Can't download extrawatch faces, only have 6",
      "text": "Doesnt work well with Android devices, Mine had issue at first to setup with android device but works well with iOS devices. Bluetooth keep loosing connection from time to time. Can't download extra watch faces, only have 6. Touch is Ok. Battery life is better then other smart watches in this price range. Works well with iPhone and apple health app. Heart Rate monitoring is good too.",
      "rating": 3.0,
      "verified": true,
      "author": "Pooja",
      "helpful_votes": 4,
      "publication_date": 20170511
    },
    {
      "title": "Great SemiSmart Watch",
      "text": "After my Fitbit died in 15 months I looked around for a watch with heart rate monitoring as I have an ICD implanted in my chest. The price was right. I call it a semi smart watch as it has basic features but not all the bells and whistles. The best part is that it only needs to be charged once a week!! The only criticism is that switching between an iPad and Android watch requires unsparing from the iPad before linking to the android phone.",
      "rating": 5.0,
      "verified": true,
      "author": "AZOldGuy",
      "helpful_votes": 2,
      "publication_date": 20170816
    },
    {
      "title": "Excellent Device - does exactly what a simple smartwatch should",
      "text": "I purchased this watch because I wanted the following: - Heart rate monitor - Long battery life - Always-on display - Alerts displayed from iphone - Elegant unobtrusive design - Waterproof This watch has met all these criteria and more. The design is surprisingly stylish, all notifications shown on the iphone are transferred to the watch, and health data is seamlessly transferred into Apple Health. The Huawei Fit is so simple that it will continue as my watch of choice for many years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik E Kraayenhof",
      "helpful_votes": 2,
      "publication_date": 20170912
    },
    {
      "title": "Disappointed",
      "text": "It worked all good for the first month. Then it started giving me problems like unresponsive display, wrong heart rate often etc., When the display is frozen, I had no option other than to keep it until the battery run out. It was out of the return eligible window by that time so had no option but to keep it. After another month, started showing me the wrong time. Then I have decided to stop using it. The app is a disaster. When ever I open the app it shows \"Not Connected\", trying to reconnect takes for ever and fail most of the time. Only good I felt was that it looks good... Nothing else worked for me... Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Arun Ravindran",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "This fitness watch is not user friendly at all",
      "text": "I can not possibly recommend this watch at all, it's user interface is severely limited and not user friendly at all, it's capabilities are severely limited compared to competitors (fitbit or garmin) I would not ever buy this device again",
      "rating": 1.0,
      "verified": true,
      "author": "Per Wiatrow",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Excellent smart watch for fitness monitor",
      "text": "I loved it so much I can receive the mobile call ringing and message notifications, I charge it every week after 7 days of continuous using, it's very high quality, really durable, a great reminder to start an activity after a period of setting down, it can set 7 alarm, monitor your sleeping timing and quality, heart rate measuring, and water resistance up to 30 meters, it's cheap compared to other brands with same functions. Thanks Huawei!",
      "rating": 5.0,
      "verified": true,
      "author": "Belal",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Not sure if it's safe to use",
      "text": "With all the talk about cyber security, I stopped using this watch. My biggest complaints were that it's nice to see if you have a text or email, but you have to take your phone out to answer, and while using GPS you can't view the watch mode",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Essential for training.",
      "text": "Great watch. Does everything I want. Great price too. I love the Huawei TRU-Sleep function which tells you how much sleep you've had and of what quality. The only thing that lets it down is that its primarily cardio sports based. (Running, Treadmill, Swimming, Cycling and Walking I believe). Would've been good if they included some resistance training modes. But its a great watch nonetheless. I also love how it displays the heart rate, and for me personally, helps me to stay in the fat burning heart rate zone so I don't burn muscle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Would not pair with OS",
      "text": "Could not get it to pair with my OnePlus 6. The Huawei app would pair but loose connection... But the OS would not show it as a paired device, meaning I could not use smart Lock which I depend on.... So never got pass the set up stage. Unfortunate as I am looking for an always on display watch that I love as much as my pebble R.I.P",
      "rating": 1.0,
      "verified": true,
      "author": "TNV",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "It is very hard to set and it loses time set and hard to get it back",
      "text": "I just cant see it good enough to keep it",
      "rating": 3.0,
      "verified": true,
      "author": "Greg E. Palmer",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Five Stars",
      "text": "Good. used for swimming whitout hesitation, but like others, the back plastic tears after some time.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis F.",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Spend a little more and get a Ticwatch",
      "text": "In the brief time that I tested this out, I grew to dislike it. I did not realize this was not really a \"smart watch\" but rather a health-monitoring device that connects to your phone, with sub-par software to access the data.",
      "rating": 3.0,
      "verified": true,
      "author": "GuyInDogSuit",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "love the simplicity.",
      "text": "Works as expected. Sync with my iPhone 8Plus without any issue",
      "rating": 5.0,
      "verified": true,
      "author": "Amircat",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "A nice suprise",
      "text": "While Huawei was trying to make a good fitness tracker, I believe they have produced a nice smart watch with good fitness tracking built in. While other brands make make fitness trackers that look like they are for fitness monitoring. The Huawei fit has found nice spot in the middle. I can where this watch anywhere from the gym to a restaurant without looking out of place without having to charge every night",
      "rating": 5.0,
      "verified": true,
      "author": "Malcolm Ross",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Okay Fitness Watch",
      "text": "With no physical buttons to work with it can be challenging to navigate the screens. The display is very easy to see and the watch is comfortable to wear.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Don't buy Huawei fit",
      "text": "It is not accurate and increase count of steps a lot when I compare it with Huawei Band 2 Pro. I used both of them at the same time in the same hand. Don't buy this device",
      "rating": 1.0,
      "verified": true,
      "author": "Manar",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Huawei fit - in a word, AWESOME!",
      "text": "So far, exactly what I wanted, and more! I love the Huawei software/app the way it works with my iPhone. When I set that up, as soon as I put the watch on, it paired with the device, no problems. The HRM is spot on and wonderful - the reason I got this model. It also keeps track of running/walking, cycling, swimming, etc. Multiple modes - this thing has all I want and need!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170310
    },
    {
      "title": "Not that friendly to navigate through menus",
      "text": "Menus a little confusing some time and the band irritated mine and my wife's skin. I had other watches before never had issues with skin irritations. I am using the Withings Nokia now and no irritation problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Felix G.",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Battery life is great and sleep tracking is superior to more android watch",
      "text": "Swim stroke not accurate and double tapping in water is not too responsive. But it gets the job done. Running and biking is accurate. It doesn't sync with runkeeper or strava yet. Battery life is great and sleep tracking is superior to more android watch.",
      "rating": 4.0,
      "verified": true,
      "author": "acheung128",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Great Watch!",
      "text": "I've had this watch for over 10 months and have had no problems. Great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Not worth the price",
      "text": "Poor touch response when you want to select something yet you can wake up in the morning and apparently be working out for several hours. Heart rate monitor is sketchy at best.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan Schwartz",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Four Stars",
      "text": "Great battery life. But the band looks too cheap and I'm not sure it is resistant enough.",
      "rating": 4.0,
      "verified": true,
      "author": "KyllerCG",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Easy to use",
      "text": "I liked how easy it is for use, however the lack of color and the display is a litros bit poor",
      "rating": 5.0,
      "verified": true,
      "author": "FRANCISCO QUINTERO",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Five Stars",
      "text": "I use it and gave it to my son. he loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "love the over all design",
      "text": "love the over all design. the fact that i can do individual work outs are nice as well. i wish it counted my stairs and it was a bit more accurate on the calories. if it did those two things it would be perfect. overall i am very satisfied with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess Rossetti",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Super light. I like always on function",
      "text": "Super light. I like always on function. Ive been using fitbit alta but this is better. Water proof is amazing",
      "rating": 5.0,
      "verified": true,
      "author": "ITALIA Milano",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Broken after only 2 Months",
      "text": "I really like this watch but after only 2 Months the back cracked without any force after i lift the watch off the charger. Unfortunately it causes pain when i wear it so it is pretty much useless right now",
      "rating": 2.0,
      "verified": true,
      "author": "Andy Blohm",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Pretty good",
      "text": "Works well, but lack of a lot of features... For the money I paid (30$) it's pretty amazing!",
      "rating": 4.0,
      "verified": true,
      "author": "Ben Richter",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Bad luck with the band",
      "text": "The buckle broke on the band within 2 or 3 weeks. It was not too tight or loose. I had it adjusted perfectly for me. The watch itself was nice. Sent it back for a vivoactive.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Neat fit on your hand/wrist",
      "text": "Very good product. Easy to use and is a nice size and shape, very stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Item is not like new",
      "text": "This item is not like newsletter. The description said , this is like new. But this item has noticeable scratches.",
      "rating": 1.0,
      "verified": true,
      "author": "Sabiel Santana",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Not waterproof",
      "text": "Water leaking inside the watch after taking the shower in less than 3 months of usage.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy Chiang",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "the quality of the watch is good and comfortable to wear it .",
      "text": "I very like it . the whole watch is light and thin.",
      "rating": 5.0,
      "verified": true,
      "author": "SE",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Five Stars",
      "text": "Great product for the price and you can use it swimming.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Benbaruj",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Huawei not stand by product",
      "text": "The watch did not last 3 month's of regular use until moisture fogged the inside screen. Huawei customer support is poor, and they are not standing by their product. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170610
    },
    {
      "title": "Nice heart and sleep monitor",
      "text": "Nice watch for tracking the sleep patterns and also the heart monitor along with the tracking of the steps you take. I just wish that it tracks stair climbing it does show a stair climbing logo but I can't activate the feature and you can't edit the app if you need to adjust the steps you take. Unfortunately I forget to stop the tracking of steps and I end up with extra time under the steps tracking which might explain why I need to charge the battery almost every other day. Besides those couple of items it's a pretty good watch. Just wish it was a little less expensive because of the items I mentioned earlier.",
      "rating": 3.0,
      "verified": true,
      "author": "addam",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "Whit Huawei wear software battery last just for 2 days",
      "text": "Verry quality product, just like described. Very fast charging and long lasting from 6-8 days average 7 days (using just 'huawei health' software)",
      "rating": 5.0,
      "verified": true,
      "author": "Mitja",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Phone required!",
      "text": "I actually really like the thing but it has some huge drawbacks. In order to use it you must have it connected to a smart phone and never get out of blue tooth range. It will also not pair with a tablet, it must be a phone. I am actually not able to use it because I don't use a smart phone. The watch will not work unless it is paired with a phone using either apple or android software. It will not pair with an iPad, I tried. It must be a phone and will not work unless connected to one.",
      "rating": 1.0,
      "verified": true,
      "author": "DIVER GUY",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Almost perfect",
      "text": "Extremely light and very comfortable with some of the best sensors of any smart watch I have ever owned meaning the accuracy of steps, heart rate, exercising in general and the sleep data are second to none. Build quality is excellent just like my Mate 10 Pro and really everything Huawei makes. The reason I dropped 1 star is because the screen sensitivity makes it awkward to navigate from one screen to another. I have about 8 smart watches and always find myself going back to my Pebble 2HR which for me is the ideal smart watch.",
      "rating": 4.0,
      "verified": true,
      "author": "E Hall",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Love it but sleep tracker won't work",
      "text": "Love the size, functions but can't get the sleep tracker to work. Any tips? May have to return. UPDATE 1: I contacted Huawei by phone, they were very helpful. Thank you. I tried their suggestions but sleep tracker still not working. I ended up returning and purchasing another brand new one this time. I uninstalled both wear and health apps then booted up watch. We will see tonight if it works. UPDATE 2: Sleep tracker didn't work again last night. Will reset and try on other wrist. Disappointing! UPDATE 3: Returning watch sleep tracker still not working.",
      "rating": 3.0,
      "verified": true,
      "author": "John B.",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "meh...",
      "text": "Battery life is good, but that is the only nice thing I have to say about it. It is not a full wearOS device. It uses its own proprietary OS and interface with your phone, and it's not intuitive in its use. I would return this if the return window wasn't closed. I'm also concerned with the global espionage issues Huawei is facing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Good Fitness Tracker",
      "text": "The Huawei watch has the average bells and whistles that you would find on a fitness watch (heart rate monitor, pedometer, flight counter, sleep monitor). It's no fitbit but if you can't afford the more flashy fitness trackers then this very well could be the one for you. The battery is EXCELLENT and lasts 6 days for me. I would absolutely recommend this fitness watch to my friends and family.",
      "rating": 4.0,
      "verified": true,
      "author": "Ced",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "DOES NOT HONOR WARRANTY",
      "text": "The fit I bought had a malfunction within the time of being under warranty. This was proven to the customer service rep and he still refused to honor the warranty. The product is amazing, but don't think I will ever buy anything from this company again.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Kimbrough",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "useless second counter",
      "text": "SECOND HAND COUNTER/HAND DOES NOT STAY ON LONGER THAN 7 SECONDS!!! this watch is great for tracking excercise and sleep but it's a terrible watch. As a health professional I cannot use this at work.",
      "rating": 3.0,
      "verified": true,
      "author": "E. Glende",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "I was looking for awatch with some health care benefits",
      "text": "I was looking for a watch with some health care benefits, not as simple as a fitbit flex, not as complex as a samsung gear or apple watch. Huawei Fit was a complete and pleasant surprise, with an elegant design, useful features and good battery life",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo Starling",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Email, text notifications",
      "text": "Like with any new product learning the menu is challenging but what I mainly wanted this for is for notifications from email, text, fb, instagram etc. It does this perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "MELINDA NICHOLS",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Battery life is great",
      "text": "Simple yet useful, battery life makes it a whole week plus on normal use. Screen response could be difficult at times. Features a heart rate monitor and workout plans modified via Huawei app. Bluetooth connectivity is great.",
      "rating": 5.0,
      "verified": true,
      "author": "\"I am\" Bradley",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "This is an absolutely fantastic watch. It has all the features I wanted",
      "text": "This is an absolutely fantastic watch. It has all the features I wanted, and works flawlessly. The battery last forever, the faceplate is durable, and is everything you could want in an entry level smartwatch.",
      "rating": 4.0,
      "verified": true,
      "author": "Bradley Webb",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Five Stars",
      "text": "It is simple thing, track your steps, exercises, cont calories and that all is I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Jurij Sinicyn",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Excellent professional looking",
      "text": "Excellent professional looking, is the best I ever try. Vary intuitive, put it on and that'll. Do recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Manuel Guadron",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Defect by design",
      "text": "Don't waste your money. A little over a month after wearing, the glass back of the watch cracked, making it unusable. This is a common problem and not repairable.",
      "rating": 1.0,
      "verified": true,
      "author": "WK",
      "helpful_votes": 0,
      "publication_date": 20171229
    }
  ],
  "product_meta": {
    "title": "Huawei Fit Smart Fitness Watch Heart Rate and Sleep Monitor Water Resistant Activity Tracker, Black Sport Band, Large",
    "description": "Color:Titanium grey with black sport bandHuawei fit is an all-in-one sports activity tracker, including sleep monitor, Heart rate monitor, notification display, and more. The perfect combination of sports, fashion, and intelligent design, Huawei fit will provide valuable health related information for you to better understand your body and health condition. Huawei fit features the following with the use of Huawei wear app: 1. Personal training experience, such as customized running plan with real-time running guidance and training effect analysis; 2. Heart rate monitoring, including all-day Periodic monitoring and real-time Heart rate monitoring during workout; 3. 5ATM Water-Resistance suitable for pool swimming; 4. Multi-sport modes for Multiple forms of exercises (walking, running, cycling, treadmill) supporting Multiple goals of running (distance, calories, time, fat burning, endurance); 5. Tracking and monitoring of daily activity information, including step count, calories burned, and distance covered; 6. Automatic detection of Sleeping State with Statistics; 7. Alarm notification displays, including smart alarms and event alarms; 8. Notifications Supported include call, SMS, email, calendar, and other social media apps. The strap is easily removable and customizable; the strap included with purchase is made of TPU. The body of the wearable device and the strap have undergone strict allergy testing; controls for hazardous and toxic substances are in accordance with European Union standards.",
    "rating": 3.7,
    "feature_bullets": [
      "Personal training experience: customize your running plan with first be at, receive real-time running guidance, and analyze the effects of your training",
      "Heart rate monitoring: single measurements, all-day periodic background measurement, and real-time heart rate monitoring during workout",
      "Multi-sport modes and 5ATM water-resistance: supports multiple forms of exercise, including walking, running, cycling, and treadmill.",
      "Daily activity tracking: tracks and monitors daily activity information, including step count, calories burned, and distance covered; automatically detects your sleeping State and gathers statistics.",
      "Smart notifications: incoming call notifications, message notifications, smart alarms, and inactivity reminders"
    ],
    "specifications": {
      "Product Dimensions": "9.7 x 1.6 x 0.4 inches",
      "Item Weight": "1.28 ounces",
      "ASIN": "B01LZNYNUR",
      "Item model number": "HUAWEI FIT GB",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "3.7 out of 5 stars130 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#301,952 in Sports & Outdoors",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 10, 2016",
      "Department": "Wearables",
      "Manufacturer": "Huawei Device USA Inc"
    },
    "categories": [
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Fitness Technology",
      "Activity & Fitness Trackers",
      "All Departments"
    ],
    "price": ""
  }
}