{
  "website_summaries": [
    {
      "verdict": "This design eliminates the standard toe strap that many brands place across the bottom of the boot. But if you plan to compete, be sure this features meets regulations.",
      "pros": [
        "Design eliminates standard toe strap to slip or rip out the bottom of the boot",
        "Includes a free backpack",
        "Comes in choice of colors and sizes",
        "Reinforced at common tear points",
        "Design promotes good airflow",
        "Comfortable and easy to put on",
        "Allow better floor contact",
        "No cracks in vinyl or exposed foam"
      ],
      "cons": [
        "May run small",
        "Boots with toe straps are required in some martial arts competitions, so make sure you check before buying"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "No front foot strap = disqualification at tournaments.",
      "text": "I really hate having to give this product a Single Star. The build quality is fantastic. The fit is spot on. However, this gear just caused a disqualification at a Sparring Tournament. The fact that there is NOT a built in strap at the front of the boot meant that this gear could NOT be used at tournament. If you are looking for practice gear only then i would highly recommend this gear. If you are looking for gear to use at practice and at tournaments, the select another brand of Foot Gear. I did purchase Hands, Shins, Head gear and all of that product is perfectly fine and I would purchase those again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170909
    },
    {
      "title": "Protect your feet with these excellent foot protectors",
      "text": "I have been doing Taekwon Do for the last 14 years and have worn through numerous foot protectors. These fit great, are comfortable and are very easy to put on. The foam is sturdy and thick and it is absolutely exactly as advertised. Zero complaints. My only issue (and it is with all brands of protectors) is that they are listed as small, medium, large etc. There is no shoe size equivalent for each measurement. I initially ordered one size too small, however, I was able to immediately return and exchange them for the correct size. The order came fast as well. The guards are well priced and I can confidently recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "David Prager",
      "helpful_votes": 3,
      "publication_date": 20171214
    },
    {
      "title": "BEST MONEY EVER SPENT!!!!",
      "text": "my name is Angel Diaz and This product is AMAZING! The quality of the foam is unmatched, better than anything out there on the market today. I have used almost every single brand of sparring gear out there and I have found that Whistlekick is the BEST! There foam will stiff up or crack. The foam is flexible and durable. I am a national competitor that competes on NASKA and International circuits. I put in a lot of rounds of sparring and sparring drills every week and this gear will definitely last. This is the best money i have spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Abigail",
      "helpful_votes": 3,
      "publication_date": 20180928
    },
    {
      "title": "Glad I found these!",
      "text": "I've only used these a few times so far, but absolutely NO Break-in time required which was always what stopped me from buying new gear and just sticking with duck tape repairs. The lack of toe strap almost stopped me from buying, but so glad I did. They definitely run small, so size up (size 10 women's, bought large, just fits). I look forward to using these more in the future. Really wish they came in White!!!",
      "rating": 4.0,
      "verified": true,
      "author": "jilly327",
      "helpful_votes": 4,
      "publication_date": 20170410
    },
    {
      "title": "but they are excellent quality Sparring Boots",
      "text": "I bought these for my son. His only complaint is that there aren't any straps at the bottom to keep his feet in place, but they are excellent quality Sparring Boots. Hopefully, as he grows, his feet will become large & they will ​stay in place.",
      "rating": 4.0,
      "verified": true,
      "author": "Tfish",
      "helpful_votes": 4,
      "publication_date": 20160727
    },
    {
      "title": "Look before you leap.",
      "text": "Good fit. Size runs accurately. But be advised - there are no straps to hold them on your feet in the front of the pad, like every other pair I've ever bought have. The main elastic band that wraps around your foot is the only thing holding it on the bottom. Pad tends to roll back from the front of your foot with every strike. Cut the elastic off the worn set I was replacing and threaded it through the slots on the front of the pad, sewed it in place, and voila - no more problem. Annoying that I had to modify a brand-new set of pads, though.",
      "rating": 3.0,
      "verified": true,
      "author": "Trever Smith",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "I find any better",
      "text": "Compared to other brands I see around the dojo these hold up. This is his second set. He has out grown the first set and now his cousin is using them now. They are starting to show a little wear around the bottom, Just where they rub on the mat. No cracks in the vinyl, no exposed foam. These get about 4 hours a week sense Nov 2016. Also he likes that they work with no toe strap.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Neeley",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Clip and file your toenails, get the right size, and these are a good option.",
      "text": "It does feel a little odd to have no straps by the toes... but they don't fall off. And even with straps near the toes you could accidentally get someone with your toe nails if you aren't careful. I'm women's US 9.5 and I got the Adult Medium. I wish they were very slightly larger, but they are the best choice for my size foot.",
      "rating": 4.0,
      "verified": true,
      "author": "notamolly",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Great Design and Quality",
      "text": "This is our 2nd pair of Whistlekick sparring boots. My son won our first pair at a local Vermont martial arts tournament for his timed maximum push-up total. The boots are of great quality and design. They are more comfortable and allow better bare foot contact with mats/floors than other competing products. Easy to put on and take off without ripping the foam. We will continue to purchase Whistlekick products. Having push-up competitions at tournaments is such a great idea too. Keep that going!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170422
    },
    {
      "title": "Worth every penny!",
      "text": "Our daughter loves them. She is thrilled there are no bottom straps which annoyed her very much on her old pair. Worth every penny to not hear her complain multuple times per week and she her smile whem putting them on in her relief to be wearing these instead!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Tidbitz",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Just what we needed...",
      "text": "My stepson outgrew the boots we'd purchased at his dojo...we meant to purchase these in black (I must have made a mistake in ordering) but ended up with the blue. Luckily he likes them well enough. They seem to be of good quality, are comfortable, and are exactly what we were needing.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Set Terra",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Best boot on the market",
      "text": "Best boot on the market. I bought a pair about 4 years ago. It is still in great condition I just wanted one in a different color. The one aspect that put its above the rest is durability. I have bought other foam boots from other companies and the average rip or tear rate is 6 months or less. With my first pair I got 4 years ago still has neither a single rip or tear. Highly recommend this product along with all the other whistlekick gear",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Millholen",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Perfect coverage",
      "text": "I wear a size 11 shoe. There wasn't any spare room under these things like other boots (wore over my Venum shin guards). These fit great, these don't need straps like other boots, I just use the ankle strap wrap around. The feel nice and breathe well. If I ever wore these out I know which brand i'll be buying again.",
      "rating": 5.0,
      "verified": true,
      "author": "LRaeMcD",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Good quality",
      "text": "I only gave them a 3 rating because they lack a fixed strap across the foot, so, even with the wraparound strap, they tend to slide up and expose the toes, at least for me. Other than that, they are durable and provide otherwise adequate protection.",
      "rating": 3.0,
      "verified": true,
      "author": "BobB",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Sizing runs small, good product.",
      "text": "10 year martial artist, tae Kwon do & Kajukenbo. These run very small. Pick a size larger than what you think you need. I got the XL and I'm an 11 or 12 shoe size for general reference. They were barely big enough. Otherwise they are very good quality. The strap looks quite sturdy and the foam is plenty sturdy for sparring. Don't use them with a heavy bag, that's not what they're designed for (oh white belts, what will you come up with next).",
      "rating": 5.0,
      "verified": true,
      "author": "Michael K.",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "No underfoot bottom straps",
      "text": "Ok item but doesn't have the straps under your foot like other brands have causing them to flop more on certain kicks. Shipping was fast and rest of the item is as good as others.",
      "rating": 2.0,
      "verified": true,
      "author": "Lee Lichterman",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "OK but small",
      "text": "I used their chart to order the sizes and they run small. the padding is not a dense as others so, OK they are lighter but I want protection. I handed these down to my 8 year old son.",
      "rating": 2.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "What you see is what you get.",
      "text": "Been using for a few months now. Quality is excellent, true to size. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Floyd",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Awesome product.",
      "text": "Exactly what I was looking for. A sturdy, high quality boot for sparring is hard to find. These were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Marebear",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Sturdy well made material",
      "text": "fits my sons feet perfectly. The size chart was spot on. Sturdy well made material. No tears and instructions on the elastic wellbeing as well as cleaning and taking care of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee M. Fesler",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "these boots fit great. This is my third different order of sparring ...",
      "text": "Sparring in taekwondo creates challenges for keeping your feet and toes healthy and fully functioning. As someone that wears a size 15 shoe, these boots fit great. This is my third different order of sparring boots. So far, this is (by far) the best pair.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Williams, Professional Engineer",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "Durable and light, best foam dipped gear on the market",
      "text": "Great quality gear! I spar a lot and it holds up very well. Having no toe strap is awesome, but my toes stick out a bit when I do a round house kick.",
      "rating": 5.0,
      "verified": true,
      "author": "Russianjen",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Great quality and quick delivery!",
      "text": "Great product and quick delivery! Great part of the set and the image is exactly how it looks!",
      "rating": 5.0,
      "verified": true,
      "author": "Eunice",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Great product",
      "text": "These are great boxing shoes! Comfortable and durable, would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Better equipment for the same price",
      "text": "Not accurate on size. There's also no bottom straps to keep the ball of your foot in place.",
      "rating": 1.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Five Stars",
      "text": "Ordered these for my son. Fit as expected and have held up well so far. Order arrived quickly. ”",
      "rating": 5.0,
      "verified": true,
      "author": "mare_7",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Dependable",
      "text": "Great product. I have used them in numerous sparring matches and no issues. They are comfortable and lightweight. Most of all they do a great job of protecting your toes against elbows.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Nolen",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Five Stars",
      "text": "exact gear my daughter needed. speedy delivery and exactly as pictured.",
      "rating": 5.0,
      "verified": true,
      "author": "ainsley",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Must Buy!! Dont trust any name brand!!",
      "text": "Works great, fits right and my son loves Whistlekick!!! A must buy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer Roy",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Great but small",
      "text": "Excellent quality. I ordered what size the chart said to get but they are a bit small.",
      "rating": 4.0,
      "verified": true,
      "author": "gallopingjester",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Good product, good seller",
      "text": "The item arrived whole, in a timely manner, with frequent messages from the seller. I would have kept the boots, but sadly they weren't my size. In all other aspects, good product, and good seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles A.",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Plenty of ventilation and Velcro is very sturdy. Shouldn't have to readjust your gear mid-match",
      "text": "No uncomfortable straps on the bottom. Plenty of ventilation and Velcro is very sturdy. Shouldn't have to readjust your gear mid-match! Highly recommend. It feels great kicking people in the head with these!",
      "rating": 5.0,
      "verified": true,
      "author": "Elise",
      "helpful_votes": 2,
      "publication_date": 20160506
    },
    {
      "title": "all good, but let's see how product works and holds",
      "text": "Originally bought seeing size. No issues returning, and received correct size a few days later. So far, all good, but let's see how product works and holds up",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Yant",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "great value",
      "text": "It's very good quality and the price was very reasonable compared to other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Tsa",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Horrible",
      "text": "Not good quality. I wore them twice and the Velcro strap is coming unglued from the boot. I won't buy from them again.",
      "rating": 1.0,
      "verified": true,
      "author": "kayla",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Sizing is off",
      "text": "Medium says shoe size 3-4 my son is a 2.5-3 and his toes stuck out of the top of these. Sending back.",
      "rating": 1.0,
      "verified": true,
      "author": "sonic the hedgehog",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Two Stars",
      "text": "The sizing runs small and they don’t stay on well. No straps or cover under the foot.",
      "rating": 2.0,
      "verified": true,
      "author": "Byrd",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "They protect my toes! The wraps are a little ...",
      "text": "They protect my toes! The wraps are a little long, but no more toe jams on the front kicks!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Cegielski",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Can roll with the punches",
      "text": "Awesome sparring gear, yet to see any degradation after several sparring sessions.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "... or something on the bottom-and the quality is very poor. The plastic it is wrapped in is very ...",
      "text": "The shoes have spots where holes have been made by some kind of machine or something on the bottom-and the quality is very poor. The plastic it is wrapped in is very thin and wouldn't last long at all. I'm sending this back and ordering Century instead. There is HUGE difference in the quality! I only ordered this brand because they had Prime shipping on it, but it wasn't worth it. I would only recommend this to someone who's kid is starting out and hasn't yet decided this is something they want to stick with-otherwise you'll be replacing this sooner than later.",
      "rating": 1.0,
      "verified": true,
      "author": "momma",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Five Stars",
      "text": "Excellent Product! Just what my son needed for Kung Fu!",
      "rating": 5.0,
      "verified": true,
      "author": "brad",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Whistlekick is good with their sizes and the texture of their items.",
      "text": "My 8 year old grandson loves it. I like how it fits securely.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen C",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Three Stars",
      "text": "very wide and only the one strap to keep them on",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara v.",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Great gear",
      "text": "Every item delivered on time, fits great. The gear feels light but can hold up in the ring. Good job!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "well made & comfortable. good coverage for top of foot & ankle ...",
      "text": "well made & comfortable. good coverage for top of foot & ankle also. very sharp looking also. good quality. I did not use them for competition, decided instead to use foam guards that went up shins instead just because that's what I was used to. boots are awkward if you are not used to wearing them . for size 11-12 mens shoe, I should have gotten XL. XXL was way too big.",
      "rating": 5.0,
      "verified": true,
      "author": "it's me",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "Four Stars",
      "text": "The quality is very nice, just go one size bigger than what you would normally wear...",
      "rating": 4.0,
      "verified": true,
      "author": "Brian Suess",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Thin and Flimsy",
      "text": "You get what you pay for, and these are thin and flimsy. After 1 use they are already starting to tear. There is nothing on the bottom to help keep your foot secure, which of course requires you to make them very tight, which of course causes foot cramps. I can't recommend anyone buy these. Of the cheap sparring boots out there these are very poor quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Darren D",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "the quality is very poor as opposed to what the website states",
      "text": "For almost $30, the quality is very poor as opposed to what the website states. If you order these, you'll see that they're probably worth a few dollars at best. Inferior quality.........",
      "rating": 2.0,
      "verified": true,
      "author": "CBW",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "This is by far the best pair I have used",
      "text": "I have trained in martial arts for 20 years. I was in need of new sparring gear. This is by far the best pair I have used. Lightweight, durable, highly recommended. I did need to return due to sizing, but the correct size fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Kasey",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Five Stars",
      "text": "Fits my son perfectly! Order one size bigger because these run smaller than other sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Levenson",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Brused toes not good",
      "text": "I only used them three times. Twice i hurt my big toe its bruzed and i walk with a limp, took weeks to recover. Get some with the toe guard and not just the black strap.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard M. Swingle",
      "helpful_votes": 0,
      "publication_date": 20171012
    }
  ],
  "product_meta": {
    "title": "whistlekick Karate Sparring Foot Gear for Karate/Taekwondo Martial Arts Industry Best Warranty - No Toe Strap",
    "description": "PRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Package Dimensions :14 x 14 x 0.4 inches; 9.6 Ounces\n * Date First Available :April 30, 2015\n * Manufacturer :whistlekick\n * ASIN :B01LP01EF8\n\n * Amazon Best Sellers Rank: #229,077 in Sports & Outdoors (See Top 100 in Sports & Outdoors)  *  #46 inMartial Arts Protective Foot Gear \n   \n   \n\n * Customer Reviews:3.9 out of 5 stars117 ratings",
    "rating": 3.9,
    "feature_bullets": [
      "Imported",
      "velcro closure",
      "☯ FULL WARRANTY FROM THE #1 SPARRING GEAR BRAND - Simply the best martial arts sparring gear! There's no better choice for a martial arts equipment set for men, women & children looking for taekwondo shoes, karate shoes or any martial arts shoes. Get Our industry leading 120 warranty plus a free 60 day extension through our Warranty Extension Program.",
      "☯ SMARTEST DESIGNED KARATE GEAR - Stop settling! No annoying toe strap to slip on or rip out the bottom of the karate sparring boot like with other brands of karate equipment sparring gear / taekwondo sparring boots.",
      "☯ EXTRA DURABLE - All of our karate sparring gear sets and taekwondo sparring gear sets are extra-reinforced at common tear points, unlike other martial arts sparring boots/feet/kicks.",
      "☯ LESS SWEAT - MORE COMFORT - Better airflow makes our taekwondo sparring gear foot pads & karate sparring gear more comfortable and less sweaty than our competition. You have to try our sparring shoes to believe how much better they are."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "14 x 14 x 0.4 inches; 9.6 Ounces",
      "Date First Available": "April 30, 2015",
      "Manufacturer": "whistlekick",
      "ASIN": "B01LP01EF8"
    },
    "categories": [
      "Other Sports",
      "Martial Arts",
      "Sports & Outdoors",
      "Protective Gear",
      "Sports & Fitness",
      "Foot Gear"
    ],
    "price": 24.99
  }
}