{
  "website_summaries": [
    {
      "verdict": "High-performance, lightweight wireless headphones are made with performance in mind.",
      "pros": [
        "These headphones have easy Bluetooth pairing, and their StayHear+ Sports tips design is optimized for staying in your ear during runs or other workouts",
        "The Bose connect app allows you to track your headphones if they go missing"
      ],
      "cons": [
        "Some instances of short battery life"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "If you are looking for top-of-the-line earbuds, these are the ones to get. Bose considered every concern users have had with wireless ear buds and developed a truly impressive product.",
      "pros": [
        "Users can't get enough of their awesome sound quality and user-friendly functions",
        "Get high marks for their no-slip fit and auto pause when removed from the ear",
        "Comfortable",
        "Rarely drop the Bluetooth connection"
      ],
      "cons": [
        "They are expensive, but you get outstanding quality for the price"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Not only do these Bose headphones sound great, but they look cool too. Wireless capability make these headphones a can’t miss.",
      "pros": [
        "The ability to work as either wireless, or wired makes these versatile headphones one of our favorites",
        "The StayHear tips make this model practical for long workouts at the gym, without missing a beat"
      ],
      "cons": [
        "Access to the USB charging port is somewhat awkward, though gets easier to perform with practice"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Problems with longevitity",
      "text": "For starters, I've always been a big fan of Bose products. We have a 5.1 surround sound system in the house, I have noise cancelling headphones I use for travel, etc. I was given these as a Christmas gift in 2016. The product worked flawlessly for about a year. Evidently there is a 1-year warranty on the product, and of course just after Christmas 2017 the product started having issues. It won't hold a charge, will shut down suddenly, etc. For a Bose product, especially given the cost, I would expect much more.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill Greenway",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Battery life awful",
      "text": "The headphones fit well into my ear and stay in through hard running, but since I first received them, and over the entire 6 months of use, they have been really hard to charge. I use the included charger, and about 4 days out of 7, the battery dies within 10-30 minutes of my turning them on, even when I've charged overnight. I'm not sure if I got a lemon or not, but I am going to try to return these. The longest charge I've ever gotten is about 60 minutes. I would not recommend these.",
      "rating": 1.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 72,
      "publication_date": 20170819
    },
    {
      "title": "Junk",
      "text": "Junk. The rubber seal keeps coming off the volume buttons. I have had to return these inferior headphones three times. The forth set has failed again and I will not bother getting a fifth set. These may be a Bose product, but they are junk. Spend you hard earned money on another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 207,
      "publication_date": 20170118
    },
    {
      "title": "Terrible waste of money - inappropriate customers support with Bose",
      "text": "Total garbage. Started falling apart after 6 months and then the battery life went. I called customer service as they were still under warranty and while the agent was able to help me with a replacement he was extremely unprofessional and inappropriate with me on the call (asked questions about my age, made strange sexual jokes). I contacted Bose about the agents behavior and they claimed they are looking into it but havent had an update from them. Total waste of time and money. Will never buy these again and I am not impressed with Bose as a company at this point.",
      "rating": 1.0,
      "verified": true,
      "author": "becca r",
      "helpful_votes": 8,
      "publication_date": 20181122
    },
    {
      "title": "Great sound, but every other important thing is a complete failure.",
      "text": "I love the sound. I have other Bose products and I am a big Bose fan. But these do not stay in the ear sufficiently on long runs. They come with three different size earpieces and none work for me, although my wired Bose earbuds have never slipped once in the couple years I have had them. Additionally- WOW the Bluetooth is weak!!! Just google the Bluetooth problems with these headphones- it is even well documented on Bose’ support website. The Bluetooth receiver is on the right side so if you phone/watch is on the left- good luck. Good luck even if it was next to the right earbud!",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Wyman",
      "helpful_votes": 9,
      "publication_date": 20171124
    },
    {
      "title": "The sound quality is very good, but there was no way I could keep ...",
      "text": "The sound quality is very good, but there was no way I could keep these snugly in my ears with any reasonable amount of movement. Tried all three sizes of the ear things, and none worked for me. I admittedly have an ear shape that is apparently hard to fit, so this issue probably doesn’t exist for most people. The main issue is the weight. The Bluetooth technology is housed in the earbuds themselves, which makes them fairly heavy...hence the issue. The search continued for good quality wireless earbuds that I can actually use. Until then, I’ll have to stick with my wired Bose earbuds.",
      "rating": 3.0,
      "verified": true,
      "author": "craig",
      "helpful_votes": 5,
      "publication_date": 20180121
    },
    {
      "title": "Too uncomfortable to use!",
      "text": "I've never had trouble with the comfort of a pair of earbuds before--I never really even considered it as a criteria for judging them, because it just never occurred to me that it would be an issue. Well, it's totally an issue with this set. They feel terrible and I hate using them. The smallest set of tips feels like I've got a massive piece of rubber painfully stuffed into my ear. They hurt my ears--I will never end up using these things. This was a terrible purchase--what a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret A. Mcglinch",
      "helpful_votes": 3,
      "publication_date": 20191222
    },
    {
      "title": "Bose forces NEW arbitration agreement in order to use previously purchases product",
      "text": "With the latest update to their app, which is required to set up these headphones for the first time and for all subsequent updates and configuration changes to the headphones, Bose is now forcing users to agree to forced arbitration and WAIVE any right to participate in a class action suit against them. Because I will not agree to these revised terms, I can no longer use the product that I bought from Bose almost two years ago. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Meghan",
      "helpful_votes": 2,
      "publication_date": 20200112
    },
    {
      "title": "After returning 2 defective pairs, I gave up",
      "text": "I wanted to like these headphones, because I've been happy with other Bose products. However, the first pair I bought died before I'd had them 3 weeks, and Amazon sent a replacement immediately. The replacement pair didn't last a week before the left ear started crackling/static even when powered down (!) then they died completely when I unpaired and tried to charge them. I'm sorry, but either the firmware updates are killing them, or they're just junk. For what it's worth, they sounded good during their brief life.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill Stratford",
      "helpful_votes": 2,
      "publication_date": 20200831
    },
    {
      "title": "Great Sound",
      "text": "So my last pair of headphones were the Beats 2. They fit well and the sound was ok but they broke three times. The ear bud snapped off from the housing. They refused to fix the third time so I went to Bose since I always had good over the hear headphones from them. Have not been disappointed. Sound is much better than beats. The charging case is perfect for traveling. The app always informs on battery level and takes heart rate if you are into using them for working out. They fit great in ear and dont fall out. Batter last about three hours longer than Beats. Totally recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180828
    },
    {
      "title": "SoundSports refuse to pair to my iPhone",
      "text": "Bought these new on Amazon. After charging my new SoundSports, I attempted to pair to my iPhone 6 Plus. My phone, which has successfully paired to many other Bluetooth devices, does not see the SoundSports headphones unless I reboot my phone first. Really annoying. Sending them back for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "P Todd",
      "helpful_votes": 6,
      "publication_date": 20171122
    },
    {
      "title": "Received a used pair of headphones",
      "text": "I purchased a \"New\" pair of soundsport headphones. When I received my package, it was clear that these were not brand new. They had already been paired to someone elses pixel 2 phone, and the box had clearly been opened before. The soundsport headphones are great. This would have been my second pair and the first lasted at least 3 years. The only reason I purchased a \"new\" pair was because I lost the first. I will be returning this pair and I would like a NEW pair of headphones...",
      "rating": 1.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 3,
      "publication_date": 20181213
    },
    {
      "title": "Garbage",
      "text": "I originally bought a pair in 2018 and loved them. Recently, they broke so I bought a new pair. The new pair broke within two days. Bose sent me a replacement. The replacement broke within three days. Since Apple bought out Bose, they're products are total trash. I love the feel of their wireless headphones but come on, give me a break. What a waste of time and money. They're just as trash as Beats. I'm so so disappointed. Oh, and when the second pair broke, Amazon wouldn't let me get another free replacement. I have to rebuy them and wait for a refund for the other pair.",
      "rating": 1.0,
      "verified": true,
      "author": "Hot Salt",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Big Disappointment",
      "text": "I replaced a wired in ear sport headphone from Bose. I was very eager to try the wireless because the wired set would get pulled out of my ears when I worked in the yard or around the house. These are basically unusable since they constantly fall out of my ears and I have tried all of the different sized ear pieces. Bose needs to re-think the shape of a human ear like some of their competitors. On top of that, the sound is not nearly as good as the wired. I would love to send them back if Bose would take them.",
      "rating": 1.0,
      "verified": true,
      "author": "William H",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "These DO NOT stay in your ear well.",
      "text": "I run almost daily. I got these as a treat, since I use BT earbuds for running and I've been running for years and plan to for a long time to come. These barely sit in my ear (I tried all the earbud sizes) and any jostling makes them come loose. And there is NO noise cancellation. It sounds like I'm listening to the music through a toilet paper tube because they don't even fit in my ear securely. I have not been this disappointed in earbuds before and I've been using/testing various brands of $10-20 BT earbuds for over 4 years. I was so sad that Bose created something intended for running that couldn't even be used for running.",
      "rating": 1.0,
      "verified": true,
      "author": "bbbbirdistheword",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "I don't recommend",
      "text": "compared to jaybird..it was more comfortable. But given I live in cold weather I need to put a hat on when I'm out. A lot of time headphone falls off. That why I took one star off. The battery is pretty good. I used three days without charging. (commute about 2 hours every day) After three months usage: I only use 2hours, three four days out of a week. the battery isn't last for a day without charging. Jaybird I've never had this problem...I'm going to contact the company and see what they can do for this product. I will be posting once I receive any response from Bose",
      "rating": 1.0,
      "verified": true,
      "author": "Yohaan",
      "helpful_votes": 4,
      "publication_date": 20180109
    },
    {
      "title": "Bad construction. Cheap materials. Good sound.",
      "text": "The plastic used on the wire covering is very weak and breaks within a few weeks of normal use. I went through three of these with the same problem before switching to Sony. Bose US stores were switching these out for me but the international stores don’t seem to offer the same service. Besides this issue, I prefer the Bose over the Sony. Oh well. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 5,
      "publication_date": 20180913
    },
    {
      "title": "Defective Design",
      "text": "I have had two pairs of SoundSports fail. The first pair I ordered directly from Bose and they died mid-workout after 2.5 months. Bose Customer Support was horrendous (they wouldn't mail back a replacement pair for 30-60 days) and I had to dispute the charge on my credit card to get a refund. I bought the second pair from Amazon and they went dead after 3 weeks...same problem, died mid-workout (wont power on or charge). I've had a lot of Bose products and never had a complaint...this particular unit is a lemon and should be avoided at all costs.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Summers",
      "helpful_votes": 2,
      "publication_date": 20200713
    },
    {
      "title": "Impossible to reasonably use with multiple devices",
      "text": "Your head will explode by the time you get these headphones to connect to the right device. Want to make a call from your phone? It'll \"connect\", but no audio. Hang up the call, and suddenly your computer's Spotify starts playing through the headphones. All while the Bose Connect app tells you your headphones are not even on. Sound quality is great, but it's literally unusable, and all Bose support can tell you to do is reset bluetooth connections on your devices and retry. No, I'm not going to re-pair my headphones every time I want to use them. I'm returning these. Thankful that I'm able to do so!",
      "rating": 1.0,
      "verified": true,
      "author": "Ajax M.",
      "helpful_votes": 2,
      "publication_date": 20200719
    },
    {
      "title": "HORRIBLE CUSTOMER SRV. AND BAD QUALITY",
      "text": "I purchased 2 of these . withing a couple of weeks they stopped functioning correctly. I was not able to turn off one of the units and the other became impossible to pair. Not only were the products defective they were also painful to wear. both me and my wife had lots of ear pain after waiting them for more than 15 minutes. I returned them after they stopped working the Amazon tried to charge me Restocking fee on an item that could no no longer be put back in stock as it was defective. it took me over 2 hrs on the phone after being hung up on more than 3 times. to get help.",
      "rating": 1.0,
      "verified": true,
      "author": "TETORTIZ",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Ear buds casing too big and heavy in the ears.",
      "text": "I only have this for four months till I lost it last week. I wasn't using it at the time and I just left it hanging around my neck and eventually fell off Without me realizing it. Anyways, it sounded really great if I can fit it properly in my ears. The smallest ear buds included still too big or it can be the in-ear device itself. It felt too heavy and big in the ears. As for leaving it around your neck, I like the ones with magnet for security. I don't workout but I don't think this one will be comfortable either for that. The weight of the cord get unbalanced it pulls on one side.",
      "rating": 3.0,
      "verified": true,
      "author": "FeV",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Superb sound - horrible battery",
      "text": "I bought my Bose SoundSport Wireless Headphones less than a year ago on Amazon and have used them on a daily basis for about 6 months (typically for about 1-2 hours/day). The sound quality is amazing, and they fit extremely well. I used to tell all my colleagues that they should get them too. Now I regret that I advertised this product so much - the battery is already worn out. It won't fully recharge any more, and whatever charge it gets will deplete in just a half hour. This dismal performance is not in line with the usual high quality of Bose products (I own several other headsets and speakers). Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Martin H",
      "helpful_votes": 2,
      "publication_date": 20190926
    },
    {
      "title": "Awesome sound",
      "text": "Excellent, I’ve been using it since the pandemic shut downs began and I’m on the phone pretty much all day for 5-6 hour at least. One charge lasts throughout the day no issues. The only complaint I have is that it doesn’t have noise canceling feature for its mic. So whomever you are talking to can hear you typing, clicking the mouse or even noises from 20 feet away. Noise cancellation for the headphones is great though. I can barely hear anything other than the person I’m talking to when I have them while on the phone. Also, of course perfect for playing music. They don’t come off when I’m running etc. Very good value overall.",
      "rating": 5.0,
      "verified": true,
      "author": "MN",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Sound is awesome, bass is not overpowering but does leave you ...",
      "text": "I'd have to agree with a lot of more detailed reviewers: Sound is awesome, bass is not overpowering but does leave you wanting more volume. Fit was fine for me but did note the cable tends to pull to the side of the controller (right)...fixed by using the clip at the back of your shirt. I returned mine due to the choppy BT signal (while jogging/running) when pulling my iPod Nano out of my pocket. Just that short distance caused the spotty BT connection until returned to my pocket. I expected better from Bose. So until a more solid wireless BT product comes to market, I'll continue to use my \"wired\" Bose headphones.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180130
    },
    {
      "title": "Hands down these are still the best earbuds I've found",
      "text": "Hands down these are still the best earbuds I've found. The ear bud is BY FAR the most comfortable I've ever found, and they stay put! The silicone is super soft and the sound quality is great. I also own the wired version and have bought multiple as gifts for people, all who have been very happy with them. I do prefer the wired version's silicone tips vs these. These have a double wall style that are more noise canceling, but the great thing is the standard silicone tips fit these so I just bought a 2 pack and swapped them out.",
      "rating": 5.0,
      "verified": true,
      "author": "A Hayes",
      "helpful_votes": 2,
      "publication_date": 20180418
    },
    {
      "title": "Overall good product",
      "text": "My boyfriend always used this at the gym so I decided to buy one too. The music quality is great. It does kind of get annoying when trying to jog because the cord is moving around making you think its going to fall out at any second, but I guess that is just normal. Overall, I would recommend this product. The price is high, but I have had it for over 6 months now and it hasn't broken like a 5 dollar pair would.",
      "rating": 5.0,
      "verified": true,
      "author": "N.N.",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Not sweat proof",
      "text": "Great sound and fit, wish I could turn the volume up a little more but otherwise the best ear buds I've ever had. Update: they quit working one day for no reason even with a full charge.Talked to Bose CS and they are shipping me out an expedited replacement set. Hopefully they last longer than five months this time.Update 2: I've come to the conclusion these are not as sweat proof as I was lead to believe. Started getting static and a high pitched noise in the left bud while working out, even when they're turned off. Contacted Bose CS again but haven't received a response yet so I wouldn't recommend these for working out, especially for the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Duke",
      "helpful_votes": 3,
      "publication_date": 20171117
    },
    {
      "title": "Stopped working after 4 weeks. Replacement pair is on its way..... The replacement pair died after 4 1/5 weeks!!!!",
      "text": "I've had the headphones for about 4 weeks and they died on me today... I charged the headphones at 100% before my run. They worked for about 20' before stopping. It's been impossible to restart them ever since. I tried pretty much everything I found on the Bose customer website but it didn't work out. I'm glad I bought them through Amazon as a replacement pair is on its ways so 5 stars to Amazon but none to Bose for the quality of their product. Looking at the Bose Customer community forum, it seems that I'm not the only one with this problem :(",
      "rating": 1.0,
      "verified": true,
      "author": "Lolo",
      "helpful_votes": 3,
      "publication_date": 20180705
    },
    {
      "title": "Quality Headphones",
      "text": "I use these headphones for everyday use. Going to work, Riding the motorcycle, relaxing. I already own the fully wireless Bose headset but I was afraid to use them while riding the motorcycle. The main reason why I bought this new headset is because of the wire that I can attach to my collar in case the wind should knock one of the earbuds out. So far I am very satisfied with this headset and the sound quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Great sound, no issues!",
      "text": "I got these to replace some other wireless headsets that I'd use for runs. I connect them to my Samsung Gear watch and to my phone and I have never had problems. The sound quality is so good I just started using them for everyday listening on commutes, work, etc. They are so light, comfortable, no sound variation from movement (like the beats of running) and the sound is clear. These do not have enhanced base so if you like that, get some beats or something. So far, no quality issues to speak of. Personally, they are better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Persistently Cuts Out",
      "text": "These headphones have fantastic sound. I would easily give these five stars if there wasn't the problem of the headphones periodically cutting out and back in. There doesn't seem to be any pattern to it... it cuts out when I'm walking and listening to a podcast. It cuts out when I'm standing still and listening to music. I have a bluetooth device in my car that connects to the same iPhone and it never cuts out, so I don't believe the device is the problem. TL;DR: Great sound, but cuts out too much.",
      "rating": 2.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Pricey and bulky compared to others but much more comfortable",
      "text": "Sound quality very good and I like the case it comes with. I had the prior version that connected to your phone via wire and they were the most comfortable earbuds I've ever worn - by far. I barely felt them in my ears. But I wanted a wireless set and hoped these would be as comfortable. They're not, but much more comfortable than all the others. Previously, I bought another pair for $34 that sounded just as good, had the magnetic feature and we're less bulky, however I kept the Bose because the less expensive pair, like all others, we're uncomfortable for me.",
      "rating": 5.0,
      "verified": true,
      "author": "LyricalPursuit",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Not worth the price",
      "text": "I bought these headphones because I was a big fan of the Bose wired headphones. These headphones have decent sound quality, but are very bulky and the weight constantly pulls the headphones out of my ear. Additionally, I have connection problems ALL THE TIME. All of my other bluetooth headphones connect with no problem; however these never seem to connect. After turning my phone and the headphones on and off dozens of time, it eventually connects at random. Overall, these are okay, but there are much better options out there for a fraction of the price.",
      "rating": 2.0,
      "verified": true,
      "author": "ryguy",
      "helpful_votes": 2,
      "publication_date": 20171119
    },
    {
      "title": "These babies sound AWESOME. I recently used the Powerbeats2",
      "text": "These babies sound AWESOME. I recently used the Powerbeats2, but after a little over a year, they died on me. Amazon was nice enough to refund me, and I decided (from reading multiple reviews), that the Bose SoundSport were a good choice for me. I am very satisfied that I went with them! Their sound, especially the bass, is by far better than the Powerbeats2. The fit is also really nice, considering I have glasses, so the Powerbeats were a bit annoying. The SoundSport fit nicely in my small ears, and do not shift at all. I will definitely recommend to anyone looking for wireless headphones for every day life or working out!",
      "rating": 5.0,
      "verified": true,
      "author": "ohyeahkate",
      "helpful_votes": 3,
      "publication_date": 20170111
    },
    {
      "title": "Excellent buds that do not fall out of my ears",
      "text": "The sound is infinitely better than other brands I've tried that were intended for use in an athletic endeavor. They stay in and sound great. They do stick out a bit far, but that is not a problem. I did not rate the noise cancellation as I do not think these were intended for that. I will say that the earphones will not stop the noise of wind when out walking although they do not let the noise of a truck in unless it is very near. Overall, this is a good purchase at a purchase point below $100. Over that, and I think they are too expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Best Sound, easy to wear",
      "text": "I took off one star, only because they look a little clunky in the ear. They sound fantastic right out of the box, and are the most comfortable wireless earbuds I have found. I returned Jaybird X3's because they sounded lousy (even with the sound adjustment app), and they hurt my ears no matter what size end I used. These are much better, and much less fussy. These also stay in my ear during my workouts with zero adjustments. Wish they were made in white with gold or silver accents....these are a little more masculine in look.",
      "rating": 4.0,
      "verified": true,
      "author": "Smart Shopper",
      "helpful_votes": 2,
      "publication_date": 20180112
    },
    {
      "title": "Died after two months",
      "text": "These headphones were great for seven weeks. Then, while I was using them, they made a crackling noise and shut down. Even though they had a 50 percent charge, I tried connecting them to the charging cable. The battery heated up and felt as though it would burst into flames, it was so hot. I’m talking to the Amazon rep now about my options. I didn’t get the electronic insurance because I expected them to last longer than a few weeks. While the sound quality was excellent, the overall durability of the headphones are not good. Do not waste your money. Amazon says I’m SOL and need to contact Bose.",
      "rating": 1.0,
      "verified": true,
      "author": "Sonnypaige",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Short term good sound. They'll fall apart.",
      "text": "I'm on year 2 (bought Dec 2017. Currently July 2019) and the entire structure of these headphones is absolutely disintegrating before my eyes. I first noticed the rubbery outer shell separating around 1 10-12 months in. Keep in mind I use these inside only. They're next to my bed for an hour of twitch before sleeping. They've never seen the elements and are still falling apart. I like the sound but at this point I'm having to replace the housing at each use since it creeps itself off the headphones. Both sides. Not just the side with the charger and on button. Wouldn't buy again, but enjoyed the time they lasted.",
      "rating": 2.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Power button and battery short life",
      "text": "I’ve had them for just over 7 months. First 5 months were great. The charge port cover was always a pain in the rear so I removed it shortly after getting them. At the 5 month time frame the power button started giving me problems to where I couldn’t turn it on without messing with it for a few months. On the 6th month time frame the battery would only charge to 90%. Now at 7 months the power switch no longer works. I’ve had much much less expensive buds very similar that have lasted years without any issues Save your $$$$ and by a less expensive longer life set",
      "rating": 1.0,
      "verified": true,
      "author": "R. L. Crowder",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "EXPENSIVE AND COMPLETELY UNRELIABLE BATTERY- DO NOT BUY THESE HEADPHONES",
      "text": "i bought a second pair, thinking the first one was a dud or I dropped it too many times - something I did to impact the battery. The second set is exactly the same. After a few months, the battery WILL NOT hold a charge and BOSE is completely non-responsive. I tried all the tricks listed on the BOSE website and nothing works. It seems to charge - says \"Battery 100%\" - and ten minutes later \"Battery 10%. Please recharge\" DO NOT BUY THESE HEADPHONES!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa M. Mascolo",
      "helpful_votes": 2,
      "publication_date": 20200414
    },
    {
      "title": "update_ Durability is NOT good",
      "text": "I bought these over a year ago when I wanted a name brand wireless sport earphones believing in I would get better quality and durability. After a 8 months the headset is falling apart , specifically in the volume control and the Bose logo on the right ear bud. I used these for my gym ( 2-3 times a week) and while doing chores. Also , I use my in-ear Bose sport headset more than these when I want to enjoy a better sound. One plus is that connection to Bluetooth is never an issue. I've use these headphones android ( google Pixel 2) windows 10 laptop/Linux laptop , and tablet with no issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Diaz",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Excellent sound quality",
      "text": "Sound quality is excellent. They don’t really cancel a lot of noise out but they’re loud enough so that you don’t hear a whole lot outside of the music, which is not true noise cancellation. Battery life is good but seems to deplete in increments of 10? There is no 95%, 85%, 75%, etc. only 90, 80, 70, etc which I find interesting. Makes me wonder if there is actually more or less battery life left than what the headphones tell you. Overall, buy these just for the sound quality. Make sure you crank me up though. It’s like a concert in your head.",
      "rating": 4.0,
      "verified": true,
      "author": "Derpy",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "little bulky",
      "text": "If you are looking for function at a good price... these are the ones. First...they are a bit bulky looking when you look in the mirror. Their battery holds for about 3 hours max. Mine had an issue where it wouldn't hold a full charge but vendor was very happy to refund some of the money (good customer service). Overall I am happy. I use them when I am running my tractor and want to listen to music vice the muffler. It works as designed (somewhat). I would buy again. I didn't pay all that much for them so for the price... I am happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mstr Beekeeper",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Absolutely perfect",
      "text": "Tried a lot of different brands in the gym, some of them, didn't work at all, some of them range of Bluetooth too short, most common problem for me was almost all of the headphones i used, they are falling off, due to intense workout. I read a lot of reviews, and decided to purchase, even though most of the reviews was not that good. But, at the end I love them, they are amazing, they are very light, the weight is so good balanced that they never bother you during the workout, material is really nice, and battery life is amazing also, what else you need for GYM.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Good Product",
      "text": "Bose never seems to disappoint. These are good quality (not for audiophiles). They connected well to my devices and most stay connected when I turn the bose on or off. Tip: For the fit pick the right earpiece that fits then read directions as to how you place it in the ear, then twist them and they will hold in your ear much better. if you just stick them in the ear and don't twist (counterclockwise right ear, clockwise left ear) they will just hold okay. Haven't traveled with them yet to judge the noise-canceling effect.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradster",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Overall pleased.",
      "text": "These do the job. They stay in my small ears. I am a fan of the cord because it keeps the ear buds together. I wish the range was longer. Only about 20 feet from your phone and you start to loose signal. I bought these for using in my house, so I was a bit disappointed to have such a short range. I still have to carry my phone from room to room. The battery doesn’t seem to last terribly long so I don’t think they would be great for long flights. Sound quality is good. The person you are talking to can hear a pin drop. Quality listening to music is ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Great sound, poor bluetooth connectivity",
      "text": "Sound is great, but bluetooth connection with my iPhone 6 plus is not the best. I've had these for a couple days. Use them when I walk the dog. I listen to pandora, with the SoundSports connected to my iPhone bluetooth, starting pandora from my apple watch. My iPhone is in my pant pocket. I get blanks in music that is annoying as I walk briskly. If I move the phone to my shirt pocket problem resolves. I gave the headphones a 2 because these are designed for activity. Sound quality is good except when it disconnects from music. Great sound poor connectivity.",
      "rating": 2.0,
      "verified": true,
      "author": "kend",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "Dubstep now sounds like it should.....siiiick",
      "text": "Yeeeees after pairs of chineese headphones claiming great bass and loud they have all been returned and I bit the bullet and naught these. All I can say is wow ,this is what headphones should sound like. The bass is deep the highs are crisp and outside noise is gone. Do I need say more? Thank you bose",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 2,
      "publication_date": 20190314
    },
    {
      "title": "Bad Battery/worse tech support from Bose",
      "text": "The battery has started to rapidly die after 4 months of use. Ive gone through two painfully long tech support calls to reset the headphones. Both occasions were unsuccessful. I've tried to send them to them for repair but can not do that. The reason is that a serial number is required. They state that the serial number is on the headphone. It is so small that I've attempted to read it with a very good 10X magnifying glass. After 90 minutes of trying to get the number right, I was unsuccessful. So, I guess I just have to eat it and buy other headphones. They won't be from Bose.",
      "rating": 1.0,
      "verified": true,
      "author": "ptr",
      "helpful_votes": 2,
      "publication_date": 20200704
    },
    {
      "title": "great sound, poor battery",
      "text": "I'm giving two stars because for a Bose product for the price I expected a lot more. I've only had these a few weeks and I'm alarmed at how quickly the battery drains. I have to charge them after each use. And you can't charge them while listening, which is B.S. My Bose wired earbuds are a lot more comfortable and always stay in my ears. With these, the small size falls out occasionally and the med size are too big and hurt my ears. For what I paid, I'm disappointed. But they do sound great.",
      "rating": 2.0,
      "verified": true,
      "author": "Lynn C. Adesko",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Great to listen to but horrible to use as a phone",
      "text": "If you are going to buy this to listen to music or podcasts; this is great. Earbuds are comfortable and you can wear the cord in front of you or behind you. BUT if you are going to buy these to talk on the phone, DON'T. Sadly, I was hoping to use them for both, but people keep asking me what I'm doing that is sooooo loud. The tv on in the background on very low or folding laundry......too loud? Wow. Now I can't use these to talk to anyone on the phone. Bummer.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Raymond",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Great sound for active users",
      "text": "Sound and voice quality is great. Phone calls sound fine and my callers say my voice sounds clear and crisp. They’re easy to use once you get familiar with the insert and twist method required to “lock” them into your ears. Once in, the buds stay put while I work out. On battery life, I find I have to charge them more often then my old LGs but they are much smaller then the LGs. The voice prompts tell you what the battery level is and what you’re connected to. Overall, I’d buy them again and if you’re looking for a small headset that you can use in a variety of activities, you should consider these.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Kadrich",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great BUT serious durability problem",
      "text": "2nd pair. Loved everything about them... BUT the outside layer of the cord starts to get soft then sticky then it disintegrates exposing the wires. This happened to both pairs a little over one year of using. As other reviewers said, the volume switch came apart on my first pair but not these. I have not been rough or careless using them. I’m done and looking for something else. This model has been around for a while... they must known about the problems but didn’t bother to reformulate the materials used.",
      "rating": 3.0,
      "verified": true,
      "author": "j",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "the best!",
      "text": "i had bought skullcandy bluetooth earbuds twice at $50 each and they broke couple months after. ugh! soo i decided to go higher $ and try the Bose sound sport ... yep its worth the $130! These go everywhere with me now and are a must have if you want high quality and clear crisp sound! The case is really nice to have and protects the earbuds in my purse. Although these are not noise cancelling they do a great job of damping ambient noise.",
      "rating": 5.0,
      "verified": true,
      "author": "RavenGirl",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Not worth the money",
      "text": "At best, headphones were alright. Did not experience the depth of sound that Bose products typically deliver and did not find that I could keep the headphones seated in my ear during exercise. Battery life was also less than I'd hoped. The dealbreaker, though, was the bluetooth connection. I had my phone on my desk 2 feet away from the headphones and still experienced consistent stuttering and play disruptions. At 15-20 feet, they essentially stopped working. Overall they deliver a far poorer experience than headphones 1/4 the price",
      "rating": 1.0,
      "verified": true,
      "author": "A non",
      "helpful_votes": 2,
      "publication_date": 20190709
    },
    {
      "title": "Bose QC going downhill",
      "text": "We have replaced my wife's Bose SoundSport earbuds 3 times and have another replacement on the way (Amazon Prime is great!). The first two worked for about 2 weeks then failed to charged. The last one worked about 3 weeks and the bluetooth radio failed. On the other hand, I use the same earbuds that have worked flawlessly for well over a year. Evidently QC at Bose has taken a turn for the worse. Update: The 4th Bose SoundSport will not charge. Four in a row, how can this be? This time it is out of Amazon's return window so will need to deal with Bose. Major piece of crap. NOT HAPPY.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Not Impressed with Bose Support",
      "text": "I called Bose support when the power button on my Soundsport head phones stopped working after 6 months. I took really good care of these ear buds. When they were not in use or charging, they were in the case.The support guy (obviously not in the US) said all would be taken care of. When I did not receive my mailer I sent an email to Bose support. The response I got was that they had no record of my call. The call took an hour. Beware of Bose and their new international support.",
      "rating": 1.0,
      "verified": true,
      "author": "Spacemom",
      "helpful_votes": 2,
      "publication_date": 20180901
    },
    {
      "title": "Great sound quality bad build",
      "text": "Very nice sound and feel, clean simple light and well balanced feel and sound, I've been using the Samsung level pro which I like the battery life but sound was not what I needed so I tried the BOSE and what a difference in base and clarity but not the battery life but I'm willing to give up some battery life for a much better sound quality. I had originally given this a 5 star rating but due the the control buttons falling apart and having BOSE tell me that they'll do me a favor to exchange it although it's under 1 year old. Thanks BOSE.",
      "rating": 2.0,
      "verified": true,
      "author": "CJT",
      "helpful_votes": 2,
      "publication_date": 20170819
    },
    {
      "title": "Stopped working within 1 year",
      "text": "While working (1 year) they had great sound, but that is the only positive i have for these headphones. Quality of product is poor, the cord started fraying within the first month only used these sitting at a desk. Tried contacting customer service twice and provided all the model and other numbers on product as requested and nothing was resolved. They no longer work at all and I just cant bring myself to order another pair. Very disappointed in product.",
      "rating": 1.0,
      "verified": true,
      "author": "createpm",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Don’t buy. Won’t last.",
      "text": "I gave these as a gift to my Dad last year for Christmas. He is an avid runner and runs 10ks and Marathons. Theses were great until about a week ago. They stopped holding a charge. For the price of Bose I would have expected better quality. Of course the one year warrant just ran out. Overall recommendation: find something else. This will not last more than 11 months.",
      "rating": 1.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Poor construction",
      "text": "Sound quality is ok but construction is not what I would expect. I’ve had these about 8 months and they have fallen apart. First, the clothing clip broke off but that wasn’t too big a deal. The play/pause button never worked right. I’d hit pause and it wouldn’t, hit play and it wouldn’t, it was annoying. I’d have to hit it pretty hard for it to catch until finally about 2 months ago it just stopped working altogether. Now the on/off switch isn’t working either. Definitely not worth it, find something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Katisa",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "What was I thinking?",
      "text": "I am a person whom refrains from writing bad reviews unless it is clearly justified. This product was purchased by myself as to upgrade the many existing earbuds that have been used consistently every day. It was suggested by a friend to go the Bose route as top of the line head bud. These headphones not only sound inferior and are overly overpriced considerably to the many other buds available . My suggestion is to try one of the other headphones available on Amazon at one third the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth D.",
      "helpful_votes": 3,
      "publication_date": 20181006
    },
    {
      "title": "Almost Perfect",
      "text": "These are fantastic. I wear them frequently. As advertised, they have been sweat resistant and the sound is fantastic. It keeps its charge for a few hours and stayed snug in my ears no matter how much I moved around. My only caveat is that they look silly and draw attention by protruding from your ears. Not sure if they need to be that bulky in order to work as well as they do, but I for one do not like drawing that much attention to such a pilferable item.",
      "rating": 5.0,
      "verified": true,
      "author": "Evianbackwards",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Good running earbuds.",
      "text": "Use for gym, and they get SWEATY. They could be a little louder for the treadmill or other machines, but overall they work well, sound great, and block most noise. Wetness doesnt seem to affect them and they stay put in the ear for long runs. I dont really count the loudness against them, since they get to about as loud as I need them, just sometimes for youtube videos with abnormally quiet sound I wish there was a few more levels up. Most music wont be an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Way to overthink it, Bose.",
      "text": "I got these to use for running with a Garmin, cycling on a Peloton, and working out to music or with apps on my iPad. Headphones fit fine; sound is adequate. But it’s incredibly clunky (and frustrating) to switch from device to device. Unlike other headphones, you can’t just hold the Bluetooth button until it’s in pairing mode and select whichever device you want. The app automatically connects to the most recent two devices, whether those are what you’ll be using or not. And trying to get it to disconnect from one requires physically disconnecting on one of the two devices...so carry them all around with you. And usually then the app crashes.",
      "rating": 2.0,
      "verified": true,
      "author": "IUCavalry",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Disappointing and overpriced.",
      "text": "I adore my Bose Soundwave. I thought these would be a logical choice. They are well built and have decent battery life. However, I literally had to crank these up to 90%+ volume when I went outside, that was on a non-windy day. As soon as I started moving, the sound of wind was all I could hear. They have the Bose sound quality, when it's quiet. All of my other headphones I can hear really well at 30%-40%, I rarely have to crank them past 50% volume. These had potential, the sound quality is there, if you can hear it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amy C.",
      "helpful_votes": 2,
      "publication_date": 20170828
    },
    {
      "title": "Back to from fully wireless - strongly prefer this one",
      "text": "I had one like this - after 2 years of (lot of) using it, the button gave up. It's great for running. But now I can't skip songs or control volume anymore. I replaced it with the fully wireless version. That one has a much shorter battery life, can only connect to one device and ones connected to the wrong device, has issue connecting to another one, so I bought this one again. I like it much better, although I do hope that it now lasts for more than 2 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony N",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Great sound, if you're stationary?",
      "text": "I bought these for workouts. Today I tested them running and they just kept slipping out, even the small ear pieces were too big. It is likely these are going back- my over-ear Bose QC 35s are much more secure and have better noise-canceling. These earbuds have pretty good sound-quality for how small they are, though they don't get very loud.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly H.",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Outstanding earbuds!",
      "text": "I’ve tested out 7 or 8 Bluetooth earbuds including the Sony WF-1000XM3 earbuds, considered one of the best and they’re poor sounding compared to these, IMO. The bass is huge, the whole tonal range is sharp and clear, the earpieces fit great and stay in comfortably in the gym, and the battery life is very good. I prefer not having the cord on my neck but it’s minor compared with the major sound quality! They’re not that expensive and this is my second pair after wearing another for a couple years and wore out the rubber control button.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Martin Bennett",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Good quality",
      "text": "These really have a nice clear crisp sound quality. They fit takes some time to find the size that's perfect for you. The volume is loud enough to drown out the surrounding noise. Now if your running a lawn more or trimmer you'll have to turn volume all the way up, but you'll still wish for better noise cancelling. But their are better products for that type of noise cancelling if your looking for something while doing yard work or in noisy environments.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "- THE SOUND - Comfortable - Lightweight - Sturdy mic/remote - Pairs quickly - ...",
      "text": "Yes, they are bigger than other bluetooth earbuds, but once you put these in your ears you won't care if they had rainbow disco balls on the ends. The sound is INCREDIBLE, and that's likely due to their size. PROS: - THE SOUND - Comfortable - Lightweight - Sturdy mic/remote - Pairs quickly - Has an on/off/pair button (can't tell you how the lack of such a button frustrated me with my last bluetooth headphones) CONS: - A little bulky for earbuds - Can't use them all day without charging (battery lasts most of a work day) The cons are so minor as to be negligible though. Did I mention they sound amazing?",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Most comfortable earbuds I've tried",
      "text": "These are by far the most comfortable earbuds i've tried. I've always used the smallest ear cushion on most other wireless earbuds because my ears would hurt after a few hours of use. I can wear these all day at my desk with zero pain. They stay put, are easy to take in and out quickly and I never have issues with syncing to my phone like I did with all the others i've tried. These are worth every penny. The only thing that sucks is the cheap plastic clothing clip, it will break on you within a month or two of use. Both my husband and I have these and the clips broke right away.",
      "rating": 4.0,
      "verified": true,
      "author": "naddlles",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Quality & Sound",
      "text": "I had Beats exercise bluetooth headphones thinking they would be good quality. While the return and repair process worked well, in my mind it shouldn't be a process that needs to be used to begin with. After the third breakage, I decided to buy what my daughter and wife are using. They have had theirs for 2 years, no problems. Sound quality is better with actual bass notes and they stay in my ear when running. I've had Bose QC2 headphones for years and am a believer in Bose quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Obsessed with these",
      "text": "I had the wired version of these headphones and love them so much, but I really wanted a wireless pair for working out, ease, etc. I tried a different brand, but ended up returning them and buying these instead. I'm so happy with them - there is no match for their inner ear design. It is so comfortable, you can't even notice they're there. These aren't heavy so you can wear them all day (as I do at work and then to work out and walk to and from places). The sound is great and the battery lasts about 7-8 hours. Don't bother trying others, these are 100% worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "MCHan",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Battery life degraded very fast.",
      "text": "I really liked these until the battery stopped working after having them for about 12 months. Now a charge barely lasts for 30 minutes - not quite the promised six hours. I also had a hard time keeping them in my ears while running - despite trying the different inserts provided to keep them in your ear, I would constantly have to readjust them while running, as one of the ear buds while always slowly work its way out.",
      "rating": 1.0,
      "verified": true,
      "author": "LoRider",
      "helpful_votes": 3,
      "publication_date": 20180606
    },
    {
      "title": "AWESOME!...if your body is not moving listening to music with these, your dead. ;)  Best by a long shot.",
      "text": "AWESOME! Just opened the box hit one button nice voice said 50% charged connected to my phone and was testing the sound with the who \"imminent front\" and WOW. sound was better than concert and clean, perfect bass.... tried jayz 99prob... better than i could have imagined.. wort every dollar.. Cant wait to wear them training hard at the gym tomr.. I tried many before and tested many in stores but these to me atlest kicked my ass. love these.. also the quality, packaging etc like your getting a Roll Royce. Bose nailed it! I would buy more if i had more heads haha",
      "rating": 5.0,
      "verified": true,
      "author": "Traveler",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Sounds great; fit could be a little better",
      "text": "These earbuds sound great; I'm happy about that. I have really sensitive ears. Most earbuds I want to yank out of my ears. I really had high hopes for these regarding comfort/fit, but they didn't live up to them. The small size don't stay in when I'm hiking, and the medium fit great and sound even better, but they start to hurt after about 20 minutes or so, specifically the area of my ear called the daith (no, it is not pierced.) I really wish there was a size in between or some other alternative.",
      "rating": 4.0,
      "verified": true,
      "author": "Jami",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "terrible issues, dont buy",
      "text": "Listening to music sounds great, when they work... Using them for calls is impossible, the bluetooth disconnects every three minutes, there is intermittent static and you cant hear yourself talking on a call. Been fighting with these for two months and it is too late to return them now. Ive tried several devices/phones, Ive updated the firm wear etc... Bought these as an xmas gift. Had to buy wired headphones as a replacement because the recipient wont take the chance on wireless again...",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy Sherman",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Short battery life",
      "text": "The battery has a short life. I used this headphone less than one hour a day, six days a week, after first month, the battery only holds 90% even if fully charged. after each month the battery holds less and less percentage%, very unsatisfied with the battery life.",
      "rating": 2.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Headphones failed two times",
      "text": "Four months after buying them, one day after the battery run off, they stopped working, i couldn't charge it anymore. Bose told me to take them for repairs. They left me nearly 3 months with no headphones. Then they gave me a new pair, which started working wrong only 2 months after, again with battery problems /they only charge up to 70 or 80%. They want me to do the whole process again (not having headphones for 3 months while they check it)",
      "rating": 1.0,
      "verified": true,
      "author": "Pablo Gustavo Sabbatella",
      "helpful_votes": 2,
      "publication_date": 20190523
    },
    {
      "title": "Great sound and comfort, but",
      "text": "I'm a BIG fan of Bose, and have been a customer for a very long time. When it came time to purchase wireless ear buds, I started and ended with Bose. The sound quality of these are exactly as expected (awesome), the batter life is extremely good for wireless ear buds, but I'm really dissappointed in the fit. They are very comfortable, but have a tendency to fall out of my ears, especailly when I'm sweating. They need to do a better job of having more customizable fittings for your ears.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott C.",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Sporty, Great Bass and weak clip ?",
      "text": "Purchased the product and I have now had it for almost 2 years. The sound quality is still superior, I use it when doing gym activities as well as when working spending a good 4-6 hours a day using them. Pros: The material quality is amazing and has not shown any deterioration as of yet; However the clip that comes with the product did break fairly quickly. Cons: The battery has shown slight loss of performance, with giving me a mere 4 hours of use now instead of the original 6 I am used to get. The charging will sometimes show fully charged even tho its only been on charge for 5 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "So far these seem to have a very good battery life after reaching full charge",
      "text": "So far these seem to have a very good battery life after reaching full charge. I like the volume controls built into the cord. It also comes with 3 different ear piece adapters should you have rather large or small ear canals making it work for anyone. The only thing I don't like is that I've had other brands that are 40% cheaper but have similar sound quality. Bose has always been overpriced but I went ahead and got them hoping their overall quality and craftsmanship will keep them working longer than the cheaper brands. Sound quality difference is zero in my opinion.",
      "rating": 4.0,
      "verified": true,
      "author": "NateTop Contributor: Woodworking",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "I use this at the gym everyday",
      "text": "after buying a few cheap earbuds for the gym on amazon and having them break pretty quickly I decided to spend the money and get these. They are incredible. They charge fast, sound perfect, connect instantly and have given me no issues. My brothers PowerBeats2 on the other hand give him nothing but issues every time he tries to use them, takes him a few minutes just to get the to connect. Bose is worth the $$$",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Love the sound",
      "text": "Update - now 2 and 1/2 years since my original purchase: I still love these headphones! I use them ALL the time and they work perfectly! They are still in perfect condition. I absolutely love these and wonder how I ever lived without them! Whenever I used to use headphones with a cord, I would always get so frustrated because I would pull them out accidently. I do have to say that the ear piece is a little difficult to put in when you first try these. I am getting better at getting them in. They are definitely comfortable - they do not hurt your ears during extended wear like the apple ear buds do.",
      "rating": 4.0,
      "verified": true,
      "author": "SueK",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Not the BOSE quality you'd expect - Not worth the $",
      "text": "When you pay the price for BOSE you expect it to last. After just more than a year the battery won't hold a charge that lasts more than one hour. One conference call worth is all. The right side headphone that has the controls to power on and off has fallen apart. Had to superglue the plastic piece back in, just to be able to turn it on and off and the rubber around it is about to fall off completely. I expected more from BOSE. This is a turnoff. I'd rather pay half the price for something knowing it will only last a year.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "For \"sport\" style ear buds these fall out constantly",
      "text": "Great sound but I cant get these to stay in my ear while working out. I primarily row so I'm not bouncing around or turning my head. Even with them clipped to my hair or the cord in front and clipped to shirt. I've not found a way to keep them in for a five minute set. Even on the lawn mower these fall out all the time. I've tried all the sizes of the buds, no difference. I was hoping these came with a rubber over the ear clip piece but it does not.",
      "rating": 3.0,
      "verified": true,
      "author": "Hoyt",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "garbage product",
      "text": "absolute garbage. the battery died after an hour use and constantly asked me to recharge. so frustrating. at one point, it would not charge past 70%, which only died after one hour. do not waste your money! never again! i can only wonder if this is chinese made crap for amazon. this is how amazon cuts costs, but it is dishonest. should have bought direct from bose.",
      "rating": 1.0,
      "verified": true,
      "author": "mark graydon",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Bose Quality & Excellent Bose Customer Support!",
      "text": "Bose Quality & Excellent Bose Customer Support! I did a lot of research on Wireless Headphones and I kept coming back to Bose. So i purchased the Bose SoundSport Wireless Headphones and used them everyday. I did experience an issue with power up and it appeared to be a known issue. I contacted Bose and they replaced with a new pair. I used again for almost a year and experienced another issue and Bose replaced with no problems. Bose stands behind their products and take care of any issues. Along with the great sound, their Brand and Support is my I own many types of Bose Headphones. Highly Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "deLeonStrong",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great until it stopped working after eight months.",
      "text": "I was tired of wired headphones so I decided to splurge and get a top at the end line wireless headphones for running. The quality was great and they were very comfortable until one run when the volume just started rising to max level. Was unbearable and I had to let them just hang for my shirt. Next time I ran it did the same thing at the end of a 3 mile run. After that they didn’t work at all. I only put in about 9-12 miles a week and don’t run when it rains so there is no excessive use. Not at all what I expected from Bose!",
      "rating": 1.0,
      "verified": true,
      "author": "Just biding my time....",
      "helpful_votes": 2,
      "publication_date": 20180528
    },
    {
      "title": "Overall good.",
      "text": "They have very good sound what's expected from Bose, you can hear outside noise, but thats not why I bought them, actually wanted to hear people around me. I think the battery life could be better. Since this is my first rechargeable set, not sure how they compare to others. Never had a problem with Bluetooth connection (Samsung S10 plus). Overall, happy with purchase, would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Chazz T",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Works for me",
      "text": "I bought this specifically because the headphones are wireless yet attached. I do not want to lose a headphone in any kind of transition (pocket, charger, ear drop, etc...). I guess when you have limited movement on one side things are different. I'm super happy with the sound but I still have to find the sweet spot for the earbuds and how they attach. It could be me or the product. Either way, it was a great buy for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Great for Runners",
      "text": "Gifted this for my husband over a year ago and he uses this regularly for his runs. Great quality and sound. I have even borrowed this a time or two for my 5k's and have been impressed with how lightweight they are and yet stay in place without moving during my runs. They stay in your ear nicely. The small clip to attach them to your shirt collar can come off the cord and we have lost ours. We have since bought third-part clip replacements that have worked fine with this.",
      "rating": 5.0,
      "verified": true,
      "author": "myruggy89",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Buy These!",
      "text": "The Bose SoundSport Wireless Headphones are fantastic! And what is with the complaints of batter life? You can turn them off when you store them. Here is my schedule Monday - Battery 100%; used them for 1 hr on the treadmill, Tuesday - Battery 90%; used them for 1 hr on the tread mill, Wednesday - stored on my vanity, Thursday - Battery 84%; used them for 1 hr on the treadmill, Fri - Sun - stored on my vanity, Monday - Battery 70%; used them for 1 hr on the treadmill. I don't know why you'd buy another brand. Totally recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "John Gausta",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Bose great customer service",
      "text": "First and foremost Bose has the best customer service service ever! These headphones are a little heavy in my ear. I would much rather prefer over-ear design. The sound quality is superb way better than anything Beats (which are complete junk) could produce. These headphones do very well in the steam room giving it only has an rating of 6 when it comes to water resistance. They do not do well in the sauna if you wear these and an area where the ambient temperature hangs around 160-170 they will malfunction beyond repair.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "My husbands favorite headphones (pair #2)!",
      "text": "I bought these for my husband last Christmas and he adored them! He almost always has headphones in his ears listening to podcasts, sports talk and music (including at night) and these are the best sounding, longest lasting, most comfortable wireless buds he's ever used. Unfortunately he accidentally put them through the wash in the pocket of a hoody several months ago and has been in mourning ever since. I ordered another pair for him for Christmas this year and he is thrilled once again! Bose really has done a wonderful job packing such great sound and comfort into such a small, wireless package! I can't recommend enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate MahoneyTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "They're Okay",
      "text": "Overall I think these are okay... I've used them for exercise and if that's what you're looking to use them for, like a 30 - 60 minute workout, then they're fine. But as general headphones they're bleh. The sound quality is about average but they have good bass in my opinion. I like the way they \"lock\" into your ear by turning them; however, they get really uncomfortable after about an hour. If you're planning to wear these all day then your ears are going to be hurting.",
      "rating": 3.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "IF YOU WANT SOUND QUALITY BOSE IS THE ONLY GAME IN TOWN FOR EAR BUDS",
      "text": "Well after going through over 2 dozen different styles and types of ear buds looking for sound quality Bose came through Everything I tried wa either all bass and no treble or all treble and no bass. Looking for a clean smooth full range sound is a lot harder than I ever imagined and when I was about to give up all hope i found the Bose SoundSport wireless earbud style headphones. One thing that was not good was the many reports of the control switch coming apart from the seam. But I'm hoping if I only use the phones basic sound controls and not touch the problemed control switch at all it should not be a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Rev. Farley",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Dont mean to brag or Bose(t)",
      "text": "Love these headphones and basically you never go wrong with Bose products (at least in my experience with their products) but the only reason that I didn't give it 5 stars is that the battery life on here only last about 6-8 hours and the bulky earbuds and the useless clip it comes with. Comparing it to other brands of earbuds, you can usually let it go without charging it for a few days. Other than that, the sound is far better than any other set of wireless earbuds I have had and if you can put up with the short(er) battery life and bulky ear buds then these are hands down awesome!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "These have become an essential part of my day. ...",
      "text": "These have become an essential part of my day. I use them constantly for calls at work, for listening to music on my Mac, and for listening to audiobooks on my phone when I'm walking or at the gym. The handoff between devices is nearly seamless, and it just seems to know the priority -- calls from my phone are more important than tunes from the computer. The charge lasts a long time, although I am somewhat strategic about when I charge them at my desk during the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Masyukun",
      "helpful_votes": 0,
      "publication_date": 20180607
    }
  ],
  "product_meta": {
    "title": "Bose SoundSport, Wireless Earbuds, (Sweatproof Bluetooth Headphones for Running and Sports), Black",
    "description": "Color:BlackWith no wires in the way, Bose sound sport wireless headphones keep you moving with powerful audio and Stay Hear+ tips designed for comfort and stability. A soft silicone material and unique shape provide a secure fit that stays put and feels good. Connect to your device easily with Bluetooth and NFC pairing, and use the inline mic and remote to control volume, skip tracks and take calls. With the Bose connect app, controlling and switching between multiple devices is easy. These headphones are sweat and weather resistant and have a lithium ion battery that delivers up to 6 hours per charge. With performance like this, the only challenge left is your workout. Included: Sound Sport wireless headphones; Stay hear+ tips; USB charging cable; carry case. Allow up to two hours to fully charge the battery. A full charge powers the headphones for up to six hours. The headphones will not play while charging.Note: Before charging, be sure the headphones are at room temperature between 41 degree Fahrenheit (5 degree Celsius ) and 104 degree Fahrenheit (40 degree Celsius ). “Made for iPod,” “Made for iPhone,” and “Made for iPad” mean that an electronic accessory has been designed to connect specifically to iPod, iPhone, or iPad, respectively, and has been certified by the developer to meet Apple performance standards. Apple is not responsible for the operation of this device or its compliance with safety and regulatory standards. Please note that the use of this accessory with iPod, iPhone or iPad may affect wireless performance.",
    "rating": 4.3,
    "feature_bullets": [
      "A high quality audio experience, consistently balanced at any volume, thanks to Bose active EQ. Connectivity Technology: Wireless",
      "Wireless convenience, with easy Bluetooth and NFC pairing aided by voice prompts",
      "Exclusive Stay Hear and tips keep the headphones comfortably in place during workouts",
      "Sweat and weather resistance for reliability while exercising",
      "Up to 6 hours battery life per charge. Please refer the User Guide before use"
    ],
    "specifications": {
      "Product Dimensions": "0.98 x 1.2 x 1.2 inches",
      "Item Weight": "0.8 ounces",
      "ASIN": "B01L7PSJFO",
      "Item model number": "761529-0010",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.3 out of 5 stars17,151 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#87 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 5, 2016",
      "Manufacturer": "Bose Corporation"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 129.0
  }
}