{
  "website_summaries": [
    {
      "verdict": "A sturdy base and plenty of table surface area make this a go-to for DIYers.",
      "pros": [
        "Lots of surface area gives users more stability for a variety of tasks",
        "Plenty of holes for bench dogs and preset attachment points for clamps",
        "Stands taller for a more comfortable work position",
        "Holds 350 pounds without flexing"
      ],
      "cons": [
        "Table leafs tend to sag downward, and it’s heavy to lug around at 48 pounds"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "If you're looking for a flat surface, look elsewhere.",
      "text": "Like everyone else I too was very surprised when I figured out the top does not lie flat. The center clamp slide is at least 5/16 higher than the outer edge of the table. I have two of the tables and expected to use them to build face frames but quickly found out the piece doesn't lay flat enough. So now I have two tables that are useless. This picture is so small you can't see the 3/4 inch table drop. The table has had nothing heavy on it. There is zero damage to it. It's just the way it came out of the box. I didn't notice the problem until I went to build face frames 6 months later.",
      "rating": 1.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 66,
      "publication_date": 20180623
    },
    {
      "title": "It's also unnecessarily heavy and cumbersome to move around when folded",
      "text": "This table has a fatal flaw, the table is not level or flat across and there is no adjustment to make it flat and a flat surface if imperative when making face frames which this table was supposedly designed for. It's also unnecessarily heavy and cumbersome to move around when folded.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 27,
      "publication_date": 20171105
    },
    {
      "title": "Love them but dislike a couple things.",
      "text": "I bought two of these for my new workshop in my garage. I couldn't get the tables to perfectly align so there is only one connector keeping them together. They still hold in place, thankfully. The other thing that wasn't good is that the bottom is very cheap. With any amount of weight, the bottom will sag. The stuff I do like are the clamps that attach to the sides to make it easy to clamp and cut wood, including the easy-to-use bench dogs when sanding and lifting projects up off the table.",
      "rating": 3.0,
      "verified": true,
      "author": "Shopper in MD",
      "helpful_votes": 22,
      "publication_date": 20170514
    },
    {
      "title": "The KWS1000 is by far the best, most expensive",
      "text": "I don't have room for a permanent workbench so I have several portable work space alternatives. The KWS1000 is by far the best, most expensive. and heaviest. That said, I am very happy with this purchase. It is truly an alternative to a workbench. There are a variety of clamping options, orientations, and options that make this device very useful. If building a dining room table were in my future (and it is not), I'm not sure I would be so pleased, but for smaller stuff I am likely build, this is money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "jwd",
      "helpful_votes": 24,
      "publication_date": 20161226
    },
    {
      "title": "Actually worth the money",
      "text": "I'd been eyeballing this for awhile but didn't want to throw down $160 on a workbench. Christmas came around and I found myself with a $100 Amazon card so I picked it up. What a great workbench. I'm not hand chopping mortises on this or anything but for drilling pocket holes and some general working it's been solid as a rock. Now that I think about it I probably could cut mortises right over the legs of the bench, it's that solid. If I had a nitpick I would like the bottom shelf to be mounted higher, but with the current design it would need to be much smaller if it was.",
      "rating": 5.0,
      "verified": true,
      "author": "br549",
      "helpful_votes": 5,
      "publication_date": 20171231
    },
    {
      "title": "Great work station, great customer service.",
      "text": "So I've own this portable work table for over 2 years now and its come in handy with just about every home DIY project. No more bending over and looking for tools or assembling things in awkward positions. I just put whatever project I'm doing on the table and it makes for a safe and efficient outcome. Recently noticed one of the rubber leg fasteners had cracked and fell off as I moved the table. Called into customer support and within minutes someone answered and sent me out a replacement part. Very happy with both product build and Kreg support. Will not hesitate to buy their products when such standards are in place.",
      "rating": 5.0,
      "verified": true,
      "author": "George Irakis",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "More practical than I thought it would be",
      "text": "I purchased this along with the KWS 500 so that I could build a work bench/table. Both units came with clamps, pegs and rail guides(?). Super sturdy and the adjustable legs are not flimsy in any way. The various holes and trays come in very handy during a project. They're not light but store fairly easily when folded. 3/4\" plywood fits perfectly into the groove to create a flush working surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Kokott",
      "helpful_votes": 3,
      "publication_date": 20200113
    },
    {
      "title": "A fairly good portable workbench",
      "text": "I bought this Kreg unit to replace a portable work surface I have had for 30 years. After a few projects, I opine that this is a fairly good portable workbench. I like the slot that enables use of Kreg clamps to hold materials in place. The first one I purchased was severely damaged by UPS during shipping. Amazon was prompt and hassle free with the return. I bought the second one at a Lowe's. It would be a 5 star bench if the leg heights were adjustable.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 5,
      "publication_date": 20170615
    },
    {
      "title": "Really Impressive",
      "text": "Like all Kreg products I've used, I'm very impressed. I was hesitent at first because of so many reviews about the surface not being 100% flat, but I can't say I had the same experience. Everything looks true and it is much sturdier (and heavier) than I thought it would be. It's a little akward and clunky to move around but it is still portable. This thing can easily handle a miter saw or other heavy power tools. I haven't used the clamps / dogs yet but they seem legit. Overall I'm happy with the product - thing is a beast!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Vincent",
      "helpful_votes": 2,
      "publication_date": 20180806
    },
    {
      "title": "Remakes my shop",
      "text": "These tables are great. I can use a single table or with a 2nd, add plywood between and create a full workbench that is easy to set up or pull down. Strong and steady, these tables weigh about 45 lbs each. I have heard others complain that the leaves sag, but all 3 of mine are flat and flush. Added thought has been put into these tables so if used for a sawhorse, a 2X4 can be attached to the top and keep the blade well away from your surface. Would I purchase again? Yes! but 3 is (probably) enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Silverspur",
      "helpful_votes": 2,
      "publication_date": 20180906
    },
    {
      "title": "Sturdy and compatible with other Kreg",
      "text": "I tried several other products and returned them all. This table will not replace a 2\" thick maple workbench for use with mallets and chisels. After using it for couple months I am going to get the Kreg Sawhorse that connects with it and their track saw top. That combination will replace my table saw and let me fold everything up to recover floor space as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Is a great option to have.",
      "text": "I bought this when I was installing new cabinet doors and drawer faces on my kitchen and bathroom cabinets. I used the kreg jig for hidden soft close hinges and this worked well with the kreg clamps. There was a reviewer that commented about the need to be careful when opening and closing to avoid pinch points, such advise is worth keeping in mind. I like it and very glad I bought it. I expect it will come in handy finishing up the kitchen with a recessed look and some crown molding. I bought the crown molding jig too.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "I grabbed two of these and I do love them. I just wish that they didnt droop ...",
      "text": "I grabbed two of these and I do love them. I just wish that they didnt droop when clamping from the middle rail. Also they are not exactly flat, each edge drops slightly making the middle slightly high. Only a deal really when clamping multiple items over the whole table. Not a big deal but kind of annoying, thats one more thing to pay attention to.",
      "rating": 4.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 3,
      "publication_date": 20180605
    },
    {
      "title": "Great work station, best Ive seen.",
      "text": "Just got this today, I buy lots of tools and like good quality. This is the best stand I have bought. i own a B&D work station and and smaller BD station and this is much better made. I love the clamping system and I plan on buying the rest of the clamping systems and maybe a 2nd bench for larger projects. This thing feels like quality when you unfold it and start working with it. It is well thought out with a ton of good ideas. You won't be disappointed in this. I do not get paid for writing reviews i just love the stand.",
      "rating": 5.0,
      "verified": true,
      "author": "st",
      "helpful_votes": 2,
      "publication_date": 20171027
    },
    {
      "title": "Will I only just buy one?",
      "text": "I have not yet used it, that will happen next week. It was easy to unpack and very easy to fold and unfold and do a checklist on how the center moved, opened, closed and fit together. All were fine. The accessories fit and work well. The Center is easy to move around and I found the bottom shelf works fine for holding my tool kit. It is not a step and Kreg makes that very clear. Kreg has not let me down to this point in their products that I use and I have high hopes for this Center to assist me in my woodworking.",
      "rating": 5.0,
      "verified": true,
      "author": "Supreme Shopper",
      "helpful_votes": 2,
      "publication_date": 20171103
    },
    {
      "title": "Made In USA",
      "text": "I ordered this workbench after another purchase was returned due to missing parts. I was very pleased with this purchase right out of the box. The build quality is very apparent and will last me for many years. Have never purchased from this company before but I will definitely be back. This workbench does cost a bit more that others but it is well worth the difference. Not to mention that you don't have to assemble it !",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Hardee",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Great little work table.",
      "text": "Bought this for my husband last Christmas and he loves it. He’s been a woodworker for many years and is really quite picky about his shop tools so I worried that he wouldn’t like it. Quite the opposite. He loves it! He says that it is well made, very sturdy and super handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia C",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "Handy Dandy",
      "text": "The pair of project center tables arrived on time and as advertised. I've owned a few multipurpose benches and this one is the most versatile so far. I've taken it through all it's different configurations using clamps, bench dogs, sacrificial cutting top and extended table configuration and all worked as advertised with great results. Light enough for Sr. citizen to carry and setup.",
      "rating": 5.0,
      "verified": true,
      "author": "OZ4",
      "helpful_votes": 2,
      "publication_date": 20180605
    },
    {
      "title": "Expensive saw-horse, but may be useful in shops with little room.",
      "text": "This is a major finger-pinching machine! Several design elements could have been changed to prevent the numerous pinch-points every time it is folded, unfolded, or carried. Due to the moderately heavy weight, it would benefit from a more ergonomic carry-handle.",
      "rating": 4.0,
      "verified": true,
      "author": "Roger S.",
      "helpful_votes": 2,
      "publication_date": 20190918
    },
    {
      "title": "Work surface does not open flat. Less than solid plastic top.",
      "text": "Good idea, mediocre implementation. Plastic top is not exactly flimsy but flexes unnecessarily. Most annoying of all, the top surface does not open flat, apparently because of incorrectly cut or positioned holes (on the legs of the workbench) for the latch locks. Also, a large, in-your-face, readable logo.",
      "rating": 2.0,
      "verified": true,
      "author": "Convex Hull",
      "helpful_votes": 2,
      "publication_date": 20181124
    },
    {
      "title": "Great for Limited Assembly Space",
      "text": "A very handy shop set up piece! And it does not take up a great deal of room in my shop when working with Kreg pocket holes. A goodly number of spacing slots and the right size for those projects that are too large for some of my work tables. I like the idea of have two Mobile Project Centers for larger projects, some assembled on site. Very easy to disassemble and store. Also can keep my clamps and accessories easily at hand.",
      "rating": 5.0,
      "verified": true,
      "author": "intheWood",
      "helpful_votes": 2,
      "publication_date": 20170628
    },
    {
      "title": "Fantastic product!",
      "text": "I purchased this product because I use Kreg pocket hole products. I purchased 2 of these Kreg KWS1000 mobile project centers. Love the portability and especially the sturdiness of the product. I use it for attaching my mobile tools such as my miter saw and my jointer. I am totally pleased with these mobile project centers. I will probably purchase one more of these in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian K Quick",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Perfect for a restricted space work area",
      "text": "This is exactly what I needed for a restricted space wood shop. Had it for about a month now and love it. The potential pinch point has been a non issue because there is a big warning and I pay attention to what I’m doing. Done everything for sanding to assembling to painting and staining. It’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great Table and Customer Service",
      "text": "Have had my table for 2 months. Used it to finish a 1000 sq foot basement. Love how portable and sturdy it is. Plus the multiple function of it. (Go to u tube and find Kreg videos. They have a series on this table called did you know I noticed a small crack in the trim around top of table. Called Customer Service and they sent me a replacement in two days. Very loyal customer who has used many of Kreg tools. You won't go wrong with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Cooper",
      "helpful_votes": 2,
      "publication_date": 20170818
    },
    {
      "title": "Got to love kreg",
      "text": "I researched a lot of work tables and I really like the construction of the Keegan workbench. The made reason I bought it is because it’s metal. I seen the other plastic options which they are not bad but I needed versatility with durability. I would recommend also buying extra clamps for this.",
      "rating": 5.0,
      "verified": true,
      "author": "bear",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "These are SO MUCH MORE than a sawhorse!",
      "text": "These are very well engineered work stations with heavy gauge steel for legs and braces. The table top and sides offer various clamping locations with the 4 bench dogs that are provided.",
      "rating": 5.0,
      "verified": true,
      "author": "DickMcK",
      "helpful_votes": 5,
      "publication_date": 20170508
    },
    {
      "title": "Great, well thought out product that gets better x2.",
      "text": "One of these “Project Centers” is great. I loved mine. It was a small clamping station and work top with a bunch of little features that were integrated. Two of them are friggin workhorses... With two simple 2”x4”x10’s and a couple sheets of 1/2” ply, you have a giant workbench that is easy to put up, easy to tear down and simple to store away. Great product. Watch the pinch-points but to be fair, if someone is dumb enough not to know that, I don’t want them on my job site.",
      "rating": 5.0,
      "verified": true,
      "author": "Corby",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "A great portable work bench for small projects.",
      "text": "They are certainly more than just a saw horse. I purchased two of them and I am well pleased with them. My wife and I both like to do small craft projects. The versitillity of them being able to turn into a small portable work bench has already proven their worth to us. We can work separately or connect them to work on larger projects as needed. This was one purchase that we were both happy with.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry Click",
      "helpful_votes": 2,
      "publication_date": 20171002
    },
    {
      "title": "Taller",
      "text": "The only thing I would like to have is for it to be taller. I’m a little over six feet and it would be cool if it had some height adjustments. Other than that it is pretty handy",
      "rating": 4.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great for owners of Kreg Tools or Weekend Warriors",
      "text": "Well made, solid, and has many clamping and use options. I'm going to buy a second to be able to make a very long work surface using two 2X4's and a sheet of 3/4\" plywood. When I'm not using it, it will fold up to be very thin. This is important to all the weekend warriors out there who have limited garage space, as I do. The fact that every Kreg tool is usable with it was one of the deciding factors for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Martin",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "LOVE THEM.  I BOUGHT 2 OF THEM!",
      "text": "These tables are amazing. They help a person that builds so much. So many different ways you can use this table to make your job easier. The clamping power this table has is great. When you use the dogs that come with it makes it easier to square corners. Can't say enough about these tables. They are great. I bought 2 of them to replace my saw horses. So many ways you can use these tables.",
      "rating": 5.0,
      "verified": true,
      "author": "kat",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Awesome shop addition",
      "text": "I am pretty pleased with the quality of this item. It is very helpful for a small working table that can be easily dismantled and moved around. I am actually going to purchase a 2nd so I can extend the table capability for use with my track saw. Overall - I recommend this tool to any do it yourself person or someone needing mobile workspace!",
      "rating": 5.0,
      "verified": true,
      "author": "SWG - Columbus, Ohio",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "great table!",
      "text": "great for extra space when doing a project. I have used it to clamp wood, metal, and cut all the above. didn't miss a beat. can't comment on durability, since I have only had it a couple of weeks. better than just a sawhorse, and the ability to make a longer worktable with 2x4's is a great feature. it comes with a clamp which offsets the cost of the bench, making it on par with workx and others.",
      "rating": 5.0,
      "verified": true,
      "author": "cutter23",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Strong and flexible setup",
      "text": "These babies are rock solid and flexible with clamping options. I have not had issues with pinch points either. Adding plywood to mid section to increase surface area is fantastic and Saturday as well. The only area of improvement would be to try and get table to be more flat with the leafs extended. Mine dropped off approximately 1/4”. Just makes assembling cabinet a bit more of challenging.",
      "rating": 4.0,
      "verified": true,
      "author": "2Cougs",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Heavy duty!",
      "text": "Bought this for my husband for Fathers Day. Was a little nervous because some of the reviews mentioned that it would not lay flat. It works great and he is very happy with it. Much nicer then his last one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "another Kreg Jig homerun",
      "text": "this is the only thing that I have found that competes with my 20 year old work mate!",
      "rating": 5.0,
      "verified": true,
      "author": "Harry L. Wheeler",
      "helpful_votes": 7,
      "publication_date": 20161217
    },
    {
      "title": "Watch your finger for this price point",
      "text": "Construction is solid and works well with tool family but it left fingers and nail black and blue because of the horrible designed pinch points on this mobile work table. The pinch points are everywhere in at least 4 different locations",
      "rating": 2.0,
      "verified": true,
      "author": "Andrew Cox",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Love the idea of this Kreg product",
      "text": "Love the idea of this Kreg product. The only thing that I'm not thrilled about is the lack of effort that Kreg put into having the table top flat when the two side leafs are put up into place. I had to shim the hinges to get it flat. Should have come complete and ready to use without having to fix it first.",
      "rating": 4.0,
      "verified": true,
      "author": "DEP",
      "helpful_votes": 2,
      "publication_date": 20180216
    },
    {
      "title": "Very versatile",
      "text": "I almost use it daily. Mechanism can pinch you but warning label is clear. I use poly webbing and quick release plastic buckles to keep it folded when carrying.",
      "rating": 5.0,
      "verified": true,
      "author": "yourotherleft",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Solid",
      "text": "Very solid, functional units (I purchased two...). A lot of features that really are more useful than gimmicky...would be five stars if a bit less expensive, but pleased with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "BigskyOne",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Awesome work table",
      "text": "This thing is so convenient and practical to work on. Heavy so it doesn't move. Clamp works super well. Designed perfectly. Definitely worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "bob",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Second bench for Christmas",
      "text": "This was a birthday gift for my husband and he is loving it. He just finished 2 Adirondack chairs for me using his Kreg products. I think he needs a second bench for Christmas for bigger and better projects to come.",
      "rating": 5.0,
      "verified": true,
      "author": "V. L. Davis",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "Greatest investment ever!",
      "text": "I have had this for just a little over a month now. What a great tool. I have used it for several projects and it has done everything I needed. I have just recently ordered some more accessories and are ready to start my next project. I am 6'-1\" tall and I love the height of the work surface.",
      "rating": 5.0,
      "verified": true,
      "author": "DPR",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Great product!  Innovative.  Kreg has the best customer service!",
      "text": "Pretty darn cool! Very innovative. Not perfect. I had a manufacturing issue with one. I called Kreg directly and they took care of the issue. Awesome customer service. I have three now. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary O.",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "More sturdy than you would think",
      "text": "This by far has been the best investment for my home shop. It's extremely sturdy and expandable. I will probably get another one and link them together for a full work surface or try to clamp the Kreg PRS1025 Router Table Top to them.",
      "rating": 5.0,
      "verified": true,
      "author": "KenJ",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Careful about getting pinched",
      "text": "Glad I finally got this. Works very well. Various accessories are rather pricey. But the functionality is very good. A few areas that can pinch you badly if your not careful. These are well labeled but I think everyone gets pinched anyway, at least once.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Lund",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Kreg Project Center",
      "text": "This is a very sturdy portable workbench that lives up to Kreg's reputation for quality tools. It comes fully assembled so there is no need to bolt together pieces and parts. The accessories which come with the bench are equally heavy duty and functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Achille",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Love this table!",
      "text": "I love this thing! It works with all my Kreg accessories. I can't wait to get another one and tie them together so I can finally get rid of my heavy plywood work table!",
      "rating": 5.0,
      "verified": true,
      "author": "Drew P. Hansen",
      "helpful_votes": 4,
      "publication_date": 20170218
    },
    {
      "title": "From a professional carpenter",
      "text": "This thing is worth it’s weight in gold That’s saying a lot too because this thing is heavy But really I don’t mind the weight because it is built to last",
      "rating": 5.0,
      "verified": true,
      "author": "BuilderD",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "It’s a Kreg what do you expect",
      "text": "Great to have put in the field with you I carry it with me every day, saved my butt countless times so I didn’t scratch up a counter top",
      "rating": 5.0,
      "verified": true,
      "author": "Brian G.",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Best wood working table on the planet",
      "text": "This table is amazing!! So many options with other Kreg clams and tooling! The table is very veristile and sturdy!! I would highly recommend this product and all kreg products to any woodworker!! The clams that interface with table make it effortless to clam down and securely mount any project as well as add in the kreg saw house and convietly turn them both into a nice big work table but just adding in a couple two by fours. Very sting design and durable",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Hull",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Not worth the money.",
      "text": "The hinges broke the first time I used it. I believe this unit is overpriced for what you get.",
      "rating": 2.0,
      "verified": true,
      "author": "Jose Madera",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "very sturdy as a project table",
      "text": "Used this several times, very sturdy as a project table. Clamping features are nice. Very impressed by Kreg auto clamp included, enough to get more clamps! Table collapses down small enough. Only thing I wish it had is a lock to keep it closed when folded. As it is you have to be careful not to pinch fingers when moving it.",
      "rating": 4.0,
      "verified": true,
      "author": "DAG",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Awesome work station",
      "text": "I have been a fan of Kreg for sometime now and truly love their innovative designs and functionality. This is a very versatile work station. I have been a fan of Kreg for sometime now and truly love their innovative designs and functionality.",
      "rating": 5.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "A great table if your limited in space!",
      "text": "I have a very full of garage with no space for a real table saw. This project table does everything I need to get my projects completed and then falls out nicely into the six-inch slot on the wall. It’s well-built and feels good to work with. I will continue to purchase Kreg products.",
      "rating": 5.0,
      "verified": true,
      "author": "J. SHOEMATE",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Great Product",
      "text": "I really like this product and most of Kregs products. This one was on par with what I thought, not a heavy, stable work bench but a smaller, portable one. I have added a bunch of features to it and plan to keep using it! Maybe ill add weight to the base also!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Mills",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Stable and easy set or moved",
      "text": "I really like this table. Easy to setup and portable. The track is very useful and helpful when securing projects. The only problem the table is not perfectly flat when opened. Works great for most projects just not great when you are trying to glue up boards.",
      "rating": 4.0,
      "verified": true,
      "author": "Vincent Villano",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "This is one of the best work stations that I have ever used and it ...",
      "text": "This is one of the best work stations that I have ever used and it is super sturdy. Clamping on this station is simple and easy. I would purchase this item again in the future if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "cojack369",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Overpriced Plastic",
      "text": "it is largely plastic, and worth about 50 bucks max. It comes with lots of attachments for adding more of them!",
      "rating": 1.0,
      "verified": true,
      "author": "White Dog",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "The best of its kind",
      "text": "The versatility of these is what drove me to buy two. Coupled together they are the most versatile utility work space I have ever seen. Sturdy and well thought out. I find it specially useful how I can incorporate clamps and configure the space needed for different tasks. When done, fold it out of the way. Excellent product for my application.",
      "rating": 5.0,
      "verified": true,
      "author": "Fropo",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Love them, I can connect them together",
      "text": "Purchased two of these. Love them, I can connect them together. Or extend them to create a 8 foot long work bench using 2\"x 4\" and insulation foam board ( not supplied). Supplied Pegs to hold work in place",
      "rating": 5.0,
      "verified": true,
      "author": "Larry L.",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Excellent product",
      "text": "Wonderful experience and the product was all it was advertised to be. this shall assist with the tasks at our Warrior Refuge in Montana.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond & Mindy Kahle",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Not sure why anyone would be any other portable workbench?",
      "text": "This thing is amazing in design and sturdiness! The thing is a tank and comes 100% assembled and ready to go. Easy to fold up and move. I would be 100 out of 100 times again",
      "rating": 5.0,
      "verified": true,
      "author": "Robb M.",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Not what I would expect from Kreg.",
      "text": "Could amazon give me an option to rate this with less than one star? The top is not level, overall the item is very flimsy. I should have expected this for the price, but I'm disappointed in Kreg - I expected better quality from them. All of the negative reviews are very accurate. I'm guessing that the positive reviews are people who are extremely lucky, or have very low standards.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Gray",
      "helpful_votes": 6,
      "publication_date": 20180503
    },
    {
      "title": "Yes, you can pinch your fingers setting up or taking down-use due caution",
      "text": "I have only used it a couple times for small projects so far, but I love that I can fold it up if I need in my little room-already thinking about locking 2 together",
      "rating": 5.0,
      "verified": true,
      "author": "Jude",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Great product for Finish Carpenters and finished carpentry in general!",
      "text": "This table is Bullet-Proof! High quality workbench that can be used 100's of different ways. Love it for setting up my Board and Batten work station! Eddie Case (Basement Finishing Man)",
      "rating": 5.0,
      "verified": true,
      "author": "Basement Finishing Man",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Solid work table.",
      "text": "Not quite as flexible as my (very old) workmate, but extremely well built. May have to buy more accessories to fully utilize its potential. Beware pinch points when raising table leaf.",
      "rating": 4.0,
      "verified": true,
      "author": "jaw5279",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Kreg is good!",
      "text": "This workstation is so versatile and handy in my workshop. I’m about to order a second on to expand my assembly space.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Wade",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Real strong",
      "text": "Well built and strong, i have a set of two and they work real good together. Used them to hold up a 320 lb 4'x6'x2\" concrete countertop I was making.",
      "rating": 5.0,
      "verified": true,
      "author": "GTG357",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Nice. Heavy Duty. Very well built and sturdy.",
      "text": "Love this table. Lost a star for two things. 1. No place to store the little parts and tabs. 2. Will pinch the heck out of you if you're not careful.",
      "rating": 4.0,
      "verified": true,
      "author": "ReneaRae",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "A very versatile tool",
      "text": "A really great tool, I bought 2 of them. The configurations are endless and you can fold them up and store them in a corner out of the way when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Very Useful",
      "text": "This thing is awesome. I ordered an extra clamp and it’s so much better than anything I’ve used before.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarhead5811",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Husband loves it",
      "text": "I bought this as a Christmas gift for my husband. He has zero complaints and really wants a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Megand89",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "Rockler- 5 day delivery,  excellent",
      "text": "Great product as expected. Rocker delivered as if it were prime. Ordered on June 12th received today, June 17th.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Vera",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "I have several Kreg items and have been pleased with them",
      "text": "I have several Kreg items and have been pleased with them. They should use less plastic but they are ok. These work tables do not live up to Kreg’s usual standards. When tables are raised and locked in place they droop by 1/4 inch or more on each side.! If a work surface isn’t flat it is worthless. That makes these worthless. Unfortunately I didn’t realize this until I had destroyed all the bugs cra and packing. So now I’m stuck.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20171118
    },
    {
      "title": "Quality, quick and accurate",
      "text": "Quick and accurate purchase. Kreg does it right with quality. Simply makes work easier.",
      "rating": 5.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "glad I purchased two as I needed to work on ...",
      "text": "glad I purchased two as I needed to work on a long piece of plywood and the two benches saved my back.",
      "rating": 5.0,
      "verified": true,
      "author": "tuff_customer",
      "helpful_votes": 2,
      "publication_date": 20170226
    },
    {
      "title": "It is great and I can do many things with it",
      "text": "It is great and I can do many things with it. The only problem I have with it is the weight. I have a pinched nerve in my neck that is affecting my arms with lifting.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed R",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Can’t Go Wrong With Kreg!",
      "text": "Very sturdy work table that can be easily folded and put back to use. I love using the clamp system when cutting and joining wood or drilling pocket holes. Can’t wait to get a second one to create a bigger working table to work with sheets of wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Garza",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "versatile & sturdy",
      "text": "Great addition to the home workshop where space is an issue",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Awesome setup!",
      "text": "have used this table on multiple projects and can't say enough good things about it! The only concern I have is it seems that the center of the table is slightly raised compared to the edges when laying boards across it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Sedlock",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Five Stars",
      "text": "Great work tables, hold down clamp adds a great deal to tasks. It was go good I have two.",
      "rating": 5.0,
      "verified": true,
      "author": "Will of WA",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Wow. Bought two of them.",
      "text": "Wow. Nice product. Seems sturdy. Really nice to have gripper feet, on table top and shelf. Bought two of them. Watched YouTube channel.",
      "rating": 5.0,
      "verified": true,
      "author": "mfabric",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "High Quality Mobile Project Table... for Low Mobile Skill Men!",
      "text": "This is one of the best purchases I have ever made. I ordered two and I plan to order two more. A Great Purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Absalom Peruq",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "They are very sturdy and can accommodate a wide variety of projects from ...",
      "text": "I bought two. They are very sturdy and can accommodate a wide variety of projects from small to very large. Would recommend to hobbyists and professionals.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170525
    },
    {
      "title": "excellent benches. As stated by other reviewers a few ...",
      "text": "excellent benches. As stated by other reviewers a few shims are required to obtain a truly flat table. However this is easy to do.",
      "rating": 4.0,
      "verified": true,
      "author": "gunther",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "What a great, innovative idea that is also expandable to a ...",
      "text": "This is just what I have been looking for. A versatile, portable work station. I work with a lot of odd shaped projects and this is the answer to make working on my projects a whole lot easier. What a great, innovative idea that is also expandable to a larger work area.",
      "rating": 5.0,
      "verified": true,
      "author": "Clyde Duranceau",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Typical Kreg Product - well done.",
      "text": "Kreg makes great stuff - well thought out, good design, and durable. Well done!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Great Work Surface For Young Strong Folks",
      "text": "This is a great work table. My only frustration is finding it cumbersome to move around. I am trying to figure out a roller base. For young strong guys the issue won't apply",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Parks",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Like having that extra hand we’re always wishing we could use quite often.",
      "text": "So far so good!!! I think this is the second best gift I have ever given my husband. He’s us actually interested in it and what he can do with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Vivian C.",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Mobile table",
      "text": "The convience of storing and I use for home projects",
      "rating": 4.0,
      "verified": true,
      "author": "Eileen C",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Husband Loved It",
      "text": "My husband bought this for our son for his birthday, but he liked it so much he is keeping it for himself.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Brockman",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Excellent table! So versatile",
      "text": "Excellent table! So versatile! It's a lot heavier and studier than it appears in the pictures. I life all the clamping options.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan P.",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Very functional",
      "text": "This is a great product from Kreg. The clamping system makes projects a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Far more substantial than I had suspected.",
      "text": "I really like the heft and sturdiness. Just unboxed it (no shipping damage, well packed by manufacturer) and all parts/accessories are there and fit well. Haven't used it yet, folded and stored out of the way.",
      "rating": 5.0,
      "verified": true,
      "author": "David Green",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Four Stars",
      "text": "A nice well made table. Only complaint is it’s a little on the heavy side.",
      "rating": 4.0,
      "verified": true,
      "author": "William J. Bosse",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "versatile and great for any project",
      "text": "very versatile we bought two because we are constantly building things around the house",
      "rating": 5.0,
      "verified": true,
      "author": "Mkelly",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Loose a finger",
      "text": "A little heavy and can pinch your fingers when carrying.",
      "rating": 4.0,
      "verified": true,
      "author": "Campbell Barker",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "This tool gives me what I expect.",
      "text": "The selling price went up more than 60% since I first saw the tool on hardware store about 12 months ago. Suppose trade war with China, high tariff on Chinese goods.",
      "rating": 4.0,
      "verified": true,
      "author": "hk1997",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Well built",
      "text": "I was surprised to find out how well built it was. I am sure I will have it for a long time. I like it so much that I ordered another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Blueduck",
      "helpful_votes": 0,
      "publication_date": 20170621
    }
  ],
  "product_meta": {
    "title": "Kreg KWS1000 Mobile Project Center",
    "description": "Style:Mobile Project CenterThe mobile project center is a workbench, Sawhorse, assembly Table, and clamping station all in one that provides a versatile workspace for DIY, repair, and woodworking projects. It's easy to set up and store away, and it provides a sturdy platform for all kinds of project tasks. Plus, the Mobile project center includes $40 worth of bonus clamping accessories, so it’s ready to go to work, right out of the box.",
    "rating": 4.5,
    "feature_bullets": [
      "Multiple work modes provide maximum versatility",
      "Folds down in seconds for work on the go, and for easy storage",
      "Hole pattern on tables accept bench dogs and other accessories",
      "Built-in storage trays hold hardware and parts. Heavy-gauge steel legs provide a solid foundation",
      "Auto-adjust bench clamp and 4 Bench dogs included"
    ],
    "specifications": {
      "Manufacturer": "Kreg Tool Company",
      "Part Number": "KWS1000",
      "Item Weight": "40 pounds",
      "Product Dimensions": "31.5 x 27.75 x 31.5 inches",
      "Item model number": "KWS1000",
      "Is Discontinued By Manufacturer": "No",
      "Style": "Mobile Project Center",
      "Material": "Aluminum",
      "Item Package Quantity": "1",
      "Measurement System": "Metric",
      "Included Components": "Mobile Project Center, Bench Clamp with Automaxx Technology,",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B01LY321WA",
      "Customer Reviews": "4.5 out of 5 stars1,966 ratings4.5 out of 5 stars",
      "Date First Available": "October 4, 2016"
    },
    "categories": [
      "Tools & Home Improvement"
    ],
    "price": 169.0
  }
}