{
  "website_summaries": [
    {
      "verdict": "A great-performing, mid-priced machine that saves time and delivers crisp pizza every time.",
      "pros": [
        "Constantly rotating stone  keeps the pizza baking evenly",
        "Versatile enough to cook other small items"
      ],
      "cons": [
        "Only cooks up to 12-inch pizzas, so a bit limiting in size"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "More than just pizza!",
      "text": "I have been using this appliance for a few weeks now, with great results. All my pizzas have come out perfectly cooked with a crispy crust and bubbly melted cheese. But the fun does not stop there, I have also made excellent frozen eggrolls, cheese toast, and today for the first time, bacon! The bacon came out absolutely perfect and I did not have to turn it over, stayed flat ,perfectly crisp, and ready to serve . And the only cleanup was rinsing off the pan in warm soapy water .",
      "rating": 5.0,
      "verified": true,
      "author": "Nick G.",
      "helpful_votes": 22,
      "publication_date": 20161125
    },
    {
      "title": "Great little machine!",
      "text": "This was a Christmas family gift that I bought as a surprise. We bake pizzas at least once a week, if not more. This little oven is phenomenal at cooking pizzas, grilled sandwiches, chicken nuggets, garlic bread, quesadillas, etc. I love this machine! Even thought it has an open design, it doesn't seem to emit too much heat. Obviously the top of the unit gets very hot, so use caution. The tray washes up in a second, too. Best investment for the kitchen in years.",
      "rating": 5.0,
      "verified": true,
      "author": "mitzi15",
      "helpful_votes": 3,
      "publication_date": 20180202
    },
    {
      "title": "Cooks uneven.",
      "text": "Works ok, but center of pizza doesn’t cook like the rest since it never really gets in the oven the whole way.",
      "rating": 3.0,
      "verified": true,
      "author": "Matsyuk",
      "helpful_votes": 2,
      "publication_date": 20181108
    },
    {
      "title": "Great choice",
      "text": "I was hesitant when I bought this, i have never owned an open one like this. But we love it. It cooks faster than a conventional oven, tastes like you are at a pizzeria, and cooks so much more than pizza if you get creative. Very easy to clean and the warmer on top is really handy for appetizers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jefrey Burnell",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "... worried whether or not this cooker would be as good as my old one",
      "text": "I was worried whether or not this cooker would be as good as my old one. It gave up the ghost. This one is great! Cook's as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Les C. Adams",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Excellent, we loved it",
      "text": "Excellent, we loved it. cooks the pizza perfectly, In about 12 to 15 minutes. the chicken wings takes about 20 minutes when the wings are at room temperature. when we cooked the mini croissants they came out golden brown.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "This machine is rad",
      "text": "We’ve had it for 3 days and it is our new favorite kitchen accessory!!! We habent made a pizza yet but made nachos, hotdogs and bacon!!!! Everything has turned out perfect!!! My joke it was my boyfriend’s Valentine’s Day gift. He loves it too! I added a photo of our pulled pork nachos",
      "rating": 5.0,
      "verified": true,
      "author": "casey carlock",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Inaccurate information what it says online.",
      "text": "I did not like this pizza oven because theres a lot of reasons. It sticks to the pan. And it also makes a huge huge mess. It is hard to clean up. And it takes forever too cook it.",
      "rating": 1.0,
      "verified": true,
      "author": "Ethan Nathaniel Smith",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "well worth it",
      "text": "Best pizza maker for the price, and cooks my partially homemade pizza in 13 minutes!",
      "rating": 5.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Undercooked",
      "text": "Mostly used this for small frozen personal pizzas. I also have a Pizzazz, and that is by far a better product. The Ronco just doesnt cook properly, food is always undercooked and doesnt cook as evenly. It takes twice as long to cook a pizza than the directions suggest. However, I love the on/off feature which is why I purchased this pizza oven, because for some reason the Pizzazz doesnt offer an on/off switch. I also like the style, and the warming tray on top.",
      "rating": 2.0,
      "verified": true,
      "author": "Serj Tankian",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Ron's the man!",
      "text": "Ronco did it again. They designed a product that makes cooking easy and enjoyable. This little bugger does the do! It has surprised us time and again. Just don't use a pound of dough to make your pizza because it will fill the opening up! Was a hoot watching the toppings being scraped off. My bad though, not Ron's. The tray cleans easily and we even use it for toast! If you like quick and easy, buy this!",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph R.",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Made me the best frozen pizza ever",
      "text": "Made me the best frozen pizza ever! Thin crust was not mushy but perfectly crispy, and regular crust pizza tasted fluffy and phenomenal",
      "rating": 5.0,
      "verified": true,
      "author": "MaryMcGlohn",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "and the fact that I can see the progress means I get a perfect cook.",
      "text": "Fast, efficient, and the fact that I can see the progress means I get a perfect cook.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "use it every week worrks great love the pizzaz and more great to re-heat left ...",
      "text": "use it every week worrks great love the pizzaz and more great to re-heat left over meat",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Bad Pan",
      "text": "Pizza sticks to the pan as you use this product and it becomes really difficult to take the pizza off the pan that moves out of its place while it is hot once you try to take the pizza. They need to improve the material they use for the pan if they want better rating from me.",
      "rating": 2.0,
      "verified": true,
      "author": "Evren AKIN",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Like advertised, it works...great!",
      "text": "This is the easiest and fastest way to cook a great pizza. It also works for frozen foods too! I've cooked chicken tenders and fish sticks and they were amazing. They say you can cook s'mores on it. What? S'mores???? Gonna have to try that next.",
      "rating": 5.0,
      "verified": false,
      "author": "CLH",
      "helpful_votes": 2,
      "publication_date": 20161026
    },
    {
      "title": "Totally worth it!!!",
      "text": "This pizza maker is an awesome gadget! My husband and kids love pizza! We order it a lot so we are basically wasting money in that area but not anymore!!! The Ronco pizza maker was perfect for my daughter's slumber party. I actually love the way this oven cooks over the conventional oven. It doesn't take as long and the pizza cooks more evenly too me. It's going to save us money in the long run so I'm happy about that! I'm sorry about the nontechnical review. I just wanted to let potential buyers know that it was a huge hit in our home so I highly recommend getting it!",
      "rating": 5.0,
      "verified": false,
      "author": "L.C",
      "helpful_votes": 3,
      "publication_date": 20161123
    },
    {
      "title": "Pizza turns out like it had just came out of restaurant pizza oven! It's great!",
      "text": "This pizza maker is awesome! First I tried pizza and it was baked to perfection. The crust was crisp and the goodies on top were nice and piping hot without burning. It cooked quickly and evenly, much more better than an oven. Next I tried dinner fries and they turned out great. Next came corn dogs, chicken wing, chicken nuggets and they are came out cooked perfectly due to the rotating dish. Love it. But I especially like the warming tray until you are ready to serve. So very convenient! The Ronco is not very big and stores easily in my cabinet for when ever I need to use it. Just love it!",
      "rating": 5.0,
      "verified": false,
      "author": "J. Stroh",
      "helpful_votes": 2,
      "publication_date": 20161026
    },
    {
      "title": "Five Stars",
      "text": "this was a gift for my daughter and she loves it",
      "rating": 5.0,
      "verified": false,
      "author": "Gin Martin",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "This thing is Amazing, perfect pizza using the guide",
      "text": "This thing is Amazing, perfect pizza using the guide. Only reason that I couldn't give it a full 5 stars, was because the unit does not have a heat resistant handle to allow for easy moving on the counter.",
      "rating": 4.0,
      "verified": false,
      "author": "Lauren V",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "they love it, but it was missing the warming tray",
      "text": "Bought this for a Christmas present, they love it, but it was missing the warming tray!",
      "rating": 4.0,
      "verified": false,
      "author": "Marilyn sexton",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Not for people without teeth.",
      "text": "It cooks pizza great! I was very surprised to see anything like this and had serious doubts about It, 25 minutes for a perfect take and bake pizza. Down side I found is with an original/handtossed or pan pizza the crust is crispy and not soft at all. So if you wear dentures and love pizza I do not recommend this product. 4/5 stars",
      "rating": 4.0,
      "verified": false,
      "author": "littlejohn",
      "helpful_votes": 3,
      "publication_date": 20171124
    },
    {
      "title": "For those who long to work in a pizzeria without leaving your home.",
      "text": "For those who long to work in a pizzeria without leaving your home --- this Ronco Pizza & More Maker is for you! Rotating circular tray allows for your home-made pizza to cook evenly and the top warming tray can be used for a number of smaller items --- Buffalo Wings, anyone? Easy to use and clean!",
      "rating": 5.0,
      "verified": false,
      "author": "Ray J. Palen Jr.",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Awesome",
      "text": "So easy to use and versatile. My family has already made a list of things they want to make using this oven. I am going to be busy with it for some time. The perfect size to use and easy to store.",
      "rating": 5.0,
      "verified": false,
      "author": "Ellen M. Jones",
      "helpful_votes": 0,
      "publication_date": 20161026
    }
  ],
  "product_meta": {
    "title": "Ronco Pizza & More, Black/Stainless",
    "description": "Color:SilverThe Ronco Pizza & More oven combines traditional, old-world pizza-cooking techniques with the latest cooking technology to make pizzeria-style pizza quickly and easily, in the comfort of your own home! Designed with high radiant heat, open-air convection, conduction and rotating pan to create the perfect pizza-cooking environment. Enjoy crispy, golden crusts and perfectly cooked toppings every time with the Ronco Pizza & More oven. Perfect for frozen or homemade pizzas, jalapeño poppers, wings, pizza rolls, nachos, s’mores, open-faced sandwiches and so much more! Keep the party going and your apps warm with the removable Warming Tray that sits directly on top.",
    "rating": 4,
    "feature_bullets": [
      "13\" non-stick pan rotates to evenly cook your pizzas, snacks & appetizers",
      "Cooks a pizza up to 40% faster than a regular kitchen oven & is more energy efficient",
      "The removable Warming Tray and Pizza Pan are dishwasher-safe",
      "30-minute cooking timer with auto shutoff",
      "Dual heating elements on the top and bottom for even, fast cooking"
    ],
    "specifications": {
      "Product Dimensions": "17.82 x 12 x 7 inches",
      "Item Weight": "12 pounds",
      "Manufacturer": "Ronco",
      "ASIN": "B01LX1XYIG",
      "Item model number": "PO1001BLGEN",
      "Customer Reviews": "4.0 out of 5 stars67 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#263,758 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 29, 2016"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Countertop Pizza Ovens",
      "Ovens & Toasters",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}