{
  "website_summaries": [
    {
      "verdict": "A quality three-quarter size guitar that is ideal for beginners or intermediate players alike. Solid mahogany build. Included travel bag is a plus.",
      "pros": [
        "Mahogany back and sides and spruce top covered in a thin layer of lacquer to help reduce scratches and marks without affecting tone",
        "Includes hex key for adjusting the two way truss rod situated in the neck which affects string height",
        "Comes with padded travel bag to protect your guitar while on the move"
      ],
      "cons": [
        "Some buyers report receiving damaged product"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beautiful guitar! Even has a truss rod. 10/10",
      "text": "The pictures on Amazon look great, but the guitar looked even nicer up close. I bought the nylon string one. It feels well made, has a nice design and trim. Even has a truss rod, so you can adjust the neck (my old guitar didn't have one). The guitar sounds great and feels great. The guitar bag is good too. I'm extremely happy with this purchase. Perfection!",
      "rating": 5.0,
      "verified": true,
      "author": "Jojo",
      "helpful_votes": 4,
      "publication_date": 20190318
    },
    {
      "title": "Great guitar for our son",
      "text": "My 6yr old recently started guitar lessons, and his his teacher was very impressed with this guitar. He said it’s great quality! I think it’s beautiful, and am very happy with it! I highly recommend this guitar!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley E. Green",
      "helpful_votes": 4,
      "publication_date": 20180809
    },
    {
      "title": "Big Value Small Money",
      "text": "For the price, you can't go wrong. I was in the market for a lower cost classical guitar and after playing several at GC and looking at used, I decided to give the Hola! a try. Wow was I pleased with the guitar when I opened the box. It seems well made with nice binding and very decent tuning gears, etc. For the price, you get big value. Sure, I'll need to do a setup but that's pretty typical for even mid-range guitars these days. I'm very happy with my purchase and would do it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Quahog",
      "helpful_votes": 4,
      "publication_date": 20170208
    },
    {
      "title": "Nice instrument, very happy with my purchase!!",
      "text": "Guitar arrived in excellent condition. After tuning a few times I played it and am very pleased! I am a music student, just learning guitar, and I wanted my own instrument. I was a little concerned that a low price meant low quality but that is not the case. This guitar is just as good as the expensive one I was borrowing and I do believe it is easier to get my hands around the fretboard. The case is beautiful and I love the backpack straps in addition to the regular handle. All in all I am happy with my purchase. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Lorisha",
      "helpful_votes": 2,
      "publication_date": 20190406
    },
    {
      "title": "Good early beginner guitar for kids.",
      "text": "I bought this for my granddaughter who just turned seven. It is just the right size. It can be tuned and the strings are easy to hold down. She was able to pick out some songs right away and play some abbreviated chords as well. We had a good time playing together. Her guitar looks like a more expensive guitar. The case is padded and she likes to carry it around. This seems to be a very caring company and I would deal with them again.",
      "rating": 5.0,
      "verified": true,
      "author": "SJR",
      "helpful_votes": 2,
      "publication_date": 20190405
    },
    {
      "title": "Sounds really good for price.",
      "text": "Price point is pretty good, not the best iv ever played but couldon't ask for better at that price. The strings that came on it cold be better, but that's something that will be replaced eventually anyway. Great sound and beautiful looking guitar. This arrived on time and was undamaged.",
      "rating": 5.0,
      "verified": true,
      "author": "contentedwater1",
      "helpful_votes": 5,
      "publication_date": 20161122
    },
    {
      "title": "Very good in every aspect",
      "text": "This guitar is awesome. Truthfully it is the fifth guitar I tried for a while, and I love it. The sound is awesome, it is nicely and maticulously crafted, the strings are very gentle on my fingers, the shipping was prepared with care and caution. The size is pefect, and the neck is very comfortable. I love this guitar and feel that it will stay with me for a long time. It is definitley way beyond I expected for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Yael Shany",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great Value for the price",
      "text": "This is a solid beginners guitar. Received it in perfect shape, well packaged. I like the wide neck and nylon strings, will take a short while till it holds a tune given new strings. I like that this inexpensive guitar has the truss rod making it easy to adjust the string height. The spruce front is lighter than the picture, but it is not a problem with me. Unfortunately any issues that I have are in my own training :)",
      "rating": 5.0,
      "verified": true,
      "author": "Charles J. Sedlacek",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "First impression",
      "text": "This guitar is beautiful! We bought my daughter a hohner guitar for her birthday in July and it snapped not even a week later after it was over tightened. Looking at it we decided to spend alittle more money and got this beautiful thing. Tuned easy my daughter 7 loves it and is tickled pink by the case. She said it was worth the wait. My husband didn't want to put it down! If we have any trouble I'll post about it but so far it's worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Thewife",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Great guitar!!",
      "text": "I have two music degrees, but am not a guitar player. I carefully combed through the available options for my son. We purchased this Hola! guitar and it has been great. He has been using it for about a year and a half and sounds wonderful! Some have complained about it going out of tune, but that is because it is a Classical guitar with nylon strings-totally normal to have to retune new strings often. Once they settle in, it stays in tune just fine. I have already recommended this guitar to a friend and would do so again!",
      "rating": 5.0,
      "verified": true,
      "author": "Hfam",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "High value guitar for intermediate student",
      "text": "My son started getting into classical guitar and the metal strings on his acoustic was shredding his fingers. He wanted nylon strings and cutaway. I was a bit skeptical because of the unfamiliar brand and low price, but the reviews looked solid. This guitar sounds good, and the boy really likes it. Therefore, I am adding my 5-stars so that others also find this high value product.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Lim",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Quality way above its price point!",
      "text": "This is a super clean well made guitar. I was pleasantly surprised by how good it looked and feels. I like the handy feel of the 3/4 size and it comes with a decent travel case. All this and limited free lessons online. Can’t beat this guitar for a great starter or kick around for adults and youth alike. With care I would expect this to provide great sound for many years. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan W",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Good quality!",
      "text": "I am SO happy with this 1/2 size guitar and case! I am a music teacher, have already given my young grandson his first lesson on the day the guitar arrived. The pegs are sturdy and the body is of good quality wood with a nice tone. The case is padded for good protection. What a bargain!",
      "rating": 5.0,
      "verified": true,
      "author": "Barb M.",
      "helpful_votes": 3,
      "publication_date": 20180607
    },
    {
      "title": "From a teen intermediate player",
      "text": "Bought this for my 16 year old son, his thoughts: great to play, good size, great look and sound. I play for 4 hours daily and the strings lasted for 6 months. The guitar store said it was nice quality and well made for it's cost when they restrung it. I agree. I'd buy another. I'm an intermediate player.",
      "rating": 4.0,
      "verified": true,
      "author": "Danyelle T",
      "helpful_votes": 2,
      "publication_date": 20170531
    },
    {
      "title": "You will need to tune it.",
      "text": "I am 63 yrs old. I play guitar since I was 17. I have owned over 8 guitars. I bought this guitar as a gift for my father in law. I bought the 2nd one for my son. I will buy another for myself. This guitar has a better sound than my old $500 guitar. This is the best combo quality sound/price ever seen.",
      "rating": 5.0,
      "verified": true,
      "author": "luis trochez",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "It's never too late to learn",
      "text": "I'm almost 80 years old and since it's never too late to learn something new, I decide to teach myself how to play the guitar. I just started with the first basic cord and although my fingertips get sore, I'm enjoying it. I was pleasantly surprised at the quality of the guitar for what I consider a low price for entry level and the instrument feels comfortable in my hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Music teacher said it was really good",
      "text": "I bought this for my 10 year old son and he is on a intermediate level. I bought it four moths ago for his birthday. His music teacher recommended a Cordoba guitar but I wanted to try this guitar because I saw the good review. When we showed his teacher he was surprised how good the sound was. If you don't play it for a while it keeps tuned. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dario",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "For my 13 yrs old",
      "text": "My son wanted to learn to play the guitar because he started to play one at the church. I got this for him not knowing anything about them or the size he would need. It fit him perfect and over the last few months, he has learned to play on it. Any guitar may have been fine but I am glad I choose this one.",
      "rating": 4.0,
      "verified": true,
      "author": "Love2read",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Good quality for the money",
      "text": "This was a gift for my teenage son (which he picked out for himself) and he was not disappointed. It is what he had expected & we thought it was good quality for the money. Good sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Exceeds expectations",
      "text": "Four months now and I'm still in awe of this guitar. It holds stays in tune extremely well, has a full rich sound and is gorgeous. I agonized over whether to purchase this one or a similar one around the same price. The reviews sold me on this one (even used a review authenticater website) and I know I got more than just lucky. It's a Damn good product.",
      "rating": 5.0,
      "verified": true,
      "author": "nivlak",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Loved this Guitar!!",
      "text": "This is a wonderful guitar, not only in looks but sound. It’s hard to describe how it plays, but I was very satisfied. I very much enjoyed this guitar and continue to play in daily. This is sort of unrelated but I’ll mention it either way, my dog normally hates guitars, but he can’t get enough of this one! I’ll often sit on our porch and play some music for him and he’ll actually lay by me and listen as I play. Take that as you’d like, but I very much enjoy this guitar. - Anatoliy Kazatskiy",
      "rating": 5.0,
      "verified": true,
      "author": "Anatoliy",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Great value",
      "text": "This was a lovely guitar for the price but I have fat fingers and felt the neck just a little too narrow. I decided to have my old classic guitar repaired. I did send this one back.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Rawlings",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Quality is outstanding.",
      "text": "My grand daughter has been playing the ukelele and is itching for a guitar. The size is just right, and it's really a well-made guitar. She is going to be ecstatic!",
      "rating": 5.0,
      "verified": true,
      "author": "Kay D",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Great value beginner guitar",
      "text": "Great value and exceeded my expectations. I’m an advanced guitar player and primarily bought this for my daughter to learn on. I was impressed by the quality of the guitar and sounds good (as good as a 3/4 guitar can sound). Feels solid and well made. I noticed we have had to tune it each time we played but probably just the new strings. Only had it a few days now but my daughter loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan M Smith",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "This was a great purchase.",
      "text": "This was a great purchase. It was exactly what i was looking for. The price was great and it is perfect for me as a new guitar player learning flamenco, especially with the softer nylon strings. I can practice longer with out killing my fingers on the strings.",
      "rating": 5.0,
      "verified": true,
      "author": " james",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "This is a wonderful guitar!",
      "text": "My son received this guitar for Christmas and LOVES it! It sounds beautiful, and I am excited for him to learn how to play it.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Holloway",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Excellent product.  Good value for money.",
      "text": "Good quality, well-made product. Excellent playability - just the right size for my small hands and fingers. Good sound (for a small instrument, and should even improve with age). I think I will enjoy playing with this guitar for many years. Added pluses - the free gig bag and the truss rod.",
      "rating": 5.0,
      "verified": true,
      "author": "vvc143",
      "helpful_votes": 2,
      "publication_date": 20180913
    },
    {
      "title": "Son Loves the Guitar",
      "text": "The guitar is well made, craftmanship is good, the guitar case is solid. Yes for the price if they had given extra strings it would have been great or even a tuner. Overall Satisfied buyer",
      "rating": 5.0,
      "verified": true,
      "author": "afterburner71",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Absolutely perfect beginner guitar",
      "text": "We purchased this guitar for our granddaughter for Christmas and were very pleased. The gift arrived on schedule and was very well packaged. Our granddaughter was absolutely thrilled! The guitar is beautiful and just the right size for her. We made the right choice in ordering from Hola Music not only for the quality of this very important gift, but in addition, Hola offered 2 months online classes free.",
      "rating": 5.0,
      "verified": true,
      "author": "Karla",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Nice! (Free lessons question...)",
      "text": "Guitar looks perfect for my six year old grandson to learn on. But please tell me how to contact Hola (or do we call Amazon?) to start his free video lessons!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Ball Scryer",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Beautiful Guitar",
      "text": "Out of the many classic guitars I researched, this product by far was the best priced and upon receiving for my 6 year old was beautifully crafted and made. Two thumbs up for a remarkable instrument and to Hola! Music 🎸 for the great service! 👍🏼👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Veron Smitty",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Perfect for a beginner",
      "text": "Arrived on time and in perfect condition. Just what we needed to get the grandson playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie Milligan",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Amazing instrument for the price",
      "text": "What can you expect for 130 bucks? Not much, but this guitar really surprised me. Great quality for the price and the design is good too. What about the sound? You should definitely use high quality strings. The default strings didnt sound good, but once I put on high quality strings the guitar came to life. Fun instrument that I bought for a stay abroad. I already know I won't regret it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great Guitar",
      "text": "This was a gift for my husband. He was very pleased with the overall quality of the guitar.",
      "rating": 5.0,
      "verified": true,
      "author": "Looney JackaLoope",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Nice guitar",
      "text": "I like the size and the nylon strings. Craftmanship is good but it requires constant tuning. Overall, is compares favorably with my full size guitar.",
      "rating": 4.0,
      "verified": true,
      "author": "JeanB",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Guitar teacher approves",
      "text": "Great product for the money. I'm a guitar teacher and I needed a half size guitar for my daughter. I was surprised when it arrived how nice it was. It has good intonation, and even has a truss rod so you can adjust the neck. My daughter loves the backpack case that came with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Kjar",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Very nice!",
      "text": "This was a gift for my 9yr old daughter. The size is perfect for her and she absolutely loves it. It looks very nice and appears to be well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Regular guy",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "100% happy with this.",
      "text": "Great product for the little ones. And the customer support is outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Wonderful guitar for the price",
      "text": "There are few blemishes but overall it's very nice. It does need to be retuned often at first (which is normal) but not nearly as often as I expected. The guitar sounds much nicer than I expected and overall it is a nice instrument.",
      "rating": 4.0,
      "verified": true,
      "author": "Janessa",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "I love it!",
      "text": "I always wanted to learn how to play guitar and I never had the time so with us being in quarantine now I decide it was the time. I have to say that I LOVE IT!! I’m just learning but here I go step by step! My friend was right, if you are just learning get the nylon strings. Also the bag is stunning! ❤️ Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaritza Prado Paredes",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "perfect for practice and learning",
      "text": "perfect for practice and learning, I have been playing for many years, but I wanted something I felt safe letting my kids learn on, stays in tune for a long time, which is nice",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 3,
      "publication_date": 20161201
    },
    {
      "title": "Good guitar for the price",
      "text": "It is a good looking guitar that sounds nice for the price paid. It comes with a comfortable case that can be carried as a back pack also. For the moment it is my review a 5 stars, let's see with the time.",
      "rating": 5.0,
      "verified": true,
      "author": "ROGER ROJAS",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great Guitar",
      "text": "This is a great guitar for my 6 year old daughter who just started lessons! She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "Distance between the strings and the arm a little too high",
      "text": "The strings are too high in relation to the arm of the guitar. That makes it harder to extract a clear sound.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "beautiful guitar. Great pricing",
      "text": "Warm rich sound, beautiful guitar. Great pricing. Excellent customer service. Support this family business, much better than working with a mass production type company.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Excellent seller",
      "text": "Guitar was defective, was able to easily get a refund. Thank the seller for making it right.",
      "rating": 4.0,
      "verified": true,
      "author": "Vladimir Barayev",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "This guitar sounds great",
      "text": "I wanted to get a guitar for my wife for her birthday, a 3/4 size nylon string to facilitate learning. I tried a cheaper guitar first and the sound was awful and muddy. This guitar sounds beautiful, comparable to a violin.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Our grandson loved it",
      "text": "It has been quite a boost to our grandson's level of enjoyment. He takes guitar in high school and just loves his. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "S in Fischer TX",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Excellent results",
      "text": "Good sound quality for the price... Speedy delivery. Nice finish. Easy to play.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Beautiful",
      "text": "Beautiful guitar. Arrived quickly, case is very nice, included picks. This is my daughter's first guitar (age 15) and she loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Very nice, especially for the price.",
      "text": "Beautiful wood, finish and workmanship. I think it has nice sound but heard that better string would make a difference but I haven't tried yet. I really like that it has a truss bar too.",
      "rating": 5.0,
      "verified": true,
      "author": "Don W. (Man of the World)",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Great company good quality product!",
      "text": "The fit and finish is great for the price, mine arrived on time and with one minor flaw, the high E string was frayed. Adam told me he was sorry and will send me a new set of strings. Recommend for any beginner, great company!",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny Joe",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Classical Guitar You WIll Love",
      "text": "This is a great instrument! Perfect size for my smaller hands. Looks and sounds perfect. Can't beat this, especially for this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Sotomayor",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Amazing service & great product",
      "text": "My daughter loves her new guitar. When we first opened the box the first thing we both thought was that it was so pretty. It has been perfect. My 10 year old just started guitar lessons and the 3/4 size is perfect for her. Definitely recommend the product and seller, I have been very pleased with everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Great purchase",
      "text": "Perfect guitar for my son! Just recently started guitar lessons, and he loves it. Great price and was delivered promptly. Will definitely use this company again, and suggest using this guitar for a younger kid just starting.",
      "rating": 5.0,
      "verified": true,
      "author": "Chera Davis",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Great functions!",
      "text": "The sound of the guitar is very pleasant! And the shape of the guitar is also very good!! I especially like the truss rod! We just need to make some adjustments and it creates a very comforting sound!",
      "rating": 5.0,
      "verified": true,
      "author": "ung van nguyen",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Good guitar for my 10yo",
      "text": "Nice quality instrument. Sounds good. Don't forget to stretch nylon strings.",
      "rating": 5.0,
      "verified": true,
      "author": "ILYA ANISIMOV",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Great so far",
      "text": "Great so far. Good quality and sounds great for the low price. I've had to tune it often but it may just need some time to adjust and I'll most likely change the strings.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Low",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Item quality",
      "text": "I just love the guitar. It is a fine and super well done product! I happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Wingeier-Rayo",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Amazing guitar",
      "text": "Such a great product for a great price. The sound is amazing and the strings stay in tune well for a new guitar. The craftsmanship is very sleek and well done. The bag is padded and very secure so there is a lot of protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenea",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Favorite Christmas present!",
      "text": "Love it! I’m just starting and I couldn’t have picked a better starting point!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Duarte",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Five Stars",
      "text": "Brought 2 one for my husband one for my son no complaints as of yet. Maybe the toning.",
      "rating": 5.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Excellent guitar for the price",
      "text": "Would highly recommend this guitar for the price, and a nice soft case is included. The guitar was carefully wrapped and shipped in double cartons.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "A very good classical guitar for beginners",
      "text": "A very good classical guitar. It stays in tune well and sounds very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Mutee ",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "No tuner",
      "text": "Really not for complete beginners without a tuner. All in all it looks great, fits great, just what I was looking for, Plenty of free instructions on the intern et.",
      "rating": 5.0,
      "verified": true,
      "author": "Tj",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great guitar",
      "text": "My 7 year old son has just started lessons, this is a perfect starter guitar for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Love the Lord",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Great for beginners",
      "text": "Love this guitar it is perfect for me as a beginner in learning guitar. The explanation on guitar sizes was really helpful to picking the right guitar. And classical nylon strings make it really easy to play.",
      "rating": 5.0,
      "verified": true,
      "author": "Aplate",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "good beginners guitar",
      "text": "Bought it for our daughter (8) and its a good guitar for beginners",
      "rating": 5.0,
      "verified": true,
      "author": "hoellero",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "make sure an adult is around to help get started.",
      "text": "i liked the guitar very much. if it is for a kid, make sure someone can help tune, set up and adjust every thing. as an adult, this was a great deal and i think it sounds great. nice job adam et al.",
      "rating": 4.0,
      "verified": true,
      "author": "frank",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Great guitar for youth to learn on.",
      "text": "Outstanding product for the price; perfect gift for my 7 year old grandson. The Spanish-like guitar came well protected with a removable case. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Landry",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Amazing Guitar",
      "text": "As a beginner, this is definitely a guitar worth purchasing and so glad I made this decision. The sound quality is great and the craftsmanship is unbelievable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Wang",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great value",
      "text": "Really good starter guitar. My kids teacher liked it too",
      "rating": 5.0,
      "verified": true,
      "author": "Dada",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Delivered very fast",
      "text": "I bought this as a gift, I didn't open it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "High quality guitar, does not look cheep.",
      "text": "Beautiful guitar, finished very carefully. Love the look, and all the details. Does not look cheep, great quality. My daughters guitar teacher was really impurest. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Eva Kalisiak",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Good buy",
      "text": "Great kid starter guitar for the price. Well made & looks sturdy. Has a nice sound considering it's size. I'm happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Five Stars",
      "text": "Tunes well, stays tuned for a long time. Teacher likes it also",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "sounds great...great value",
      "text": "Received it this weekend and have now learned how to play 5 chords....cant't wait to be able to put it all together for a song....",
      "rating": 5.0,
      "verified": true,
      "author": "CounselorPhil",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Beginner guitar lessons",
      "text": "I got this guitar for my son’s lessons. He’s a beginner and the guitar was really good for it. It was the perfect size and made well.",
      "rating": 5.0,
      "verified": true,
      "author": "Yarett Mendez",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Good Value",
      "text": "A great starting guitar for my granddaughter -- and fast delivery!",
      "rating": 5.0,
      "verified": true,
      "author": "John R. Aldridge",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Happy and beautiful guitar.",
      "text": "This is a beautiful guitar and am so happy with it. It stays in tune. It feels and sounds great. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "AV - US",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "would have better guitar!",
      "text": "Guitar is ok .. Butt my tuning gears will not stay tight even at Low tuning..need to look in to that..would have better guitar!!",
      "rating": 3.0,
      "verified": true,
      "author": "Rick P.",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Great product!",
      "text": "Great product! Will buy again for my second child once they start lessons.",
      "rating": 5.0,
      "verified": true,
      "author": "Candy L.",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Great guitar for the price.",
      "text": "Great guitar and great price! I would have paid double for this. Great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Webb",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "perfect pricing",
      "text": "I have zero complaints. It plays nice for the money. it smells nice. it looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "vickys friend",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Hola! Music guitar is a great option!!",
      "text": "A beautiful gift to learn a new ability during the stay-home call during COVID19. Great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Lina Martinez",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Good instrument at a great price !",
      "text": "Great instrument, received on time as promised in a neat and clean packing. My kiddo is tuning along! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Bhavika",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Nice and sounds good. Excellent for beginners",
      "text": "Bought this for my six grader as a beginners guitar and it’s great for this.",
      "rating": 4.0,
      "verified": true,
      "author": "Eliya Peer",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "sounds terrible",
      "text": "sound is terrible. gave it 3 stars instead of 1 because you get what you pay for i guess",
      "rating": 3.0,
      "verified": true,
      "author": "keeto",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Superior Quality!",
      "text": "This guitar is excellent quality. The case is a plus to the super price! I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann M",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Five Stars",
      "text": "It looks great. It arrived on time and all ready for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "It had beautiful tone, a gorgeous exterior and the carrying case ...",
      "text": "The classical guitar was more than we expected. It had beautiful tone, a gorgeous exterior and the carrying case was of top quality. Now we just need the talent!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Gustafson",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Would buy again. Very pleased with this classical acoustic!!",
      "text": "Guitar is fantastic. Quite well built and designed... Look at the neck on this gem... Yeehaa I love it. Plays like gold...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Quick Delivery and Great Follow Up Service",
      "text": "So excited to gif this to my son for Christmas!",
      "rating": 5.0,
      "verified": true,
      "author": "KLD",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great guitar, great sound and good quality",
      "text": "Great guitar, great sound and good quality. I like the nylon strings. I would recommend this guitar to everybody.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Truong",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Good looking guitar.",
      "text": "Very nice guitar. Well made and sounds good. Much better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Steveg",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "... the range of 300$ and it certainly is a good guitar for the price I paid",
      "text": "I have compared it with guitars in the range of 300$ and it certainly is a good guitar for the price I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Majid",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "Five Stars",
      "text": "A gift and the recipient loved it! Sounds good for the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly A Fevrier",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Awesome Guitar",
      "text": "The Hola Classical guitar is the best dollar value guitar I have ever had. The sound is awesome. It was perfect in every way, except for the packaging. How it got to my home without a scratch is a mystery. I guess the employees of UPS realized it was an instrument and needed extra care because the thin, poorly packed instrument packaging was not scratched. I tip my hat to UPS for doing an excellent job. Anyone looking for an excellent beginner or intermediate guitar this is the one. One thing I did do was change the tuning machines and put better strings.",
      "rating": 5.0,
      "verified": true,
      "author": "Catman",
      "helpful_votes": 2,
      "publication_date": 20160127
    },
    {
      "title": "I prefer my steel string, blisters and all",
      "text": "I got this because I'm relatively new to guitar and my fingers were killing me on steel string I've been playing. The sound is meh, but also I'm not a great guitarist, so to be real I probably shouldn't even be allowed to rate this puppy. But this is our capitalist system so here it is: MY OPINION! It's iiiiight. I went back to the steel string.",
      "rating": 3.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Hola is an awesome brand!",
      "text": "I bought this guitar for a beginning student and wow! Was I surprised! It sounded and played close to my $8'ooo guitar. I was so impressed that I let a virtuoso guitarist play it and he bought one also!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Fair",
      "helpful_votes": 8,
      "publication_date": 20160904
    }
  ],
  "product_meta": {
    "title": "Classical Guitar with Soft Nylon Strings by Hola! Music, Junior 3/4 Size 36 Inch Model HG-36GLS, Natural Gloss Finish - FREE Padded Gig Bag Included",
    "rating": 4.6,
    "feature_bullets": [
      "Don't miss!! We’ve joined with America’s largest lessons company. When you purchase this bundle, you will get TWO MONTHS of FREE live, video lessons where you can interact and learn from an expert instructor. You’ll be on your journey to stardom in no time!",
      "Hola! Music Junior Classical Guitar HG-36GLS features: Spruce top, Mahogany back, sides and neck",
      "This 3/4 size classical guitar provides the perfect combination of style, sound, and savings. Small and light, but produces big, beautiful melodies and the Nylon strings are soft on the fingers for beginners and youngsters",
      "Glossy finish gives this guitar a touch of glamour. FREE padded gig bag included!",
      "Don't miss!! Full description, images and specifications down the page. Hola! Music guarantees quality and affordability. Hola! - Say Hello to Music!"
    ],
    "specifications": {
      "Item Weight": "6.49 pounds",
      "Package Dimensions": "37.75 x 18.3 x 5.6 inches",
      "ASIN": "B01LCJ1L00",
      "Item model number": "HG-36GLS",
      "Customer Reviews": "4.6 out of 5 stars237 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#2,170 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 25, 2016",
      "Back Material": "Mahogany Wood",
      "Body Material": "Wood",
      "Color Name": "3/4 Size Classical Guitar",
      "Fretboard Material": "Walnut",
      "Guitar Pickup Configuration": "No",
      "String Material": "Nylon",
      "Top Material": "Spruce Wood",
      "Neck Material Type": "Mahogany",
      "Number of Strings": "6",
      "Guitar Attribute": "Classical",
      "Guitar Bridge System": "Hardtail Bridge",
      "Size": "3/4 Size - 36\""
    },
    "categories": [
      "Acoustic Guitars",
      "Musical Instruments",
      "Guitars"
    ],
    "price": 129.95
  }
}