{
  "website_summaries": [
    {
      "verdict": "A multi-purpose tool with a number of features that are useful beyond escaping your vehicle.",
      "pros": [
        "Besides the window hammer and seat-belt cutter, this tool has an LED flashlight and red SOS light",
        "Additionally, it features a hand-cranked charging system that can provide enough power to get a quick emergency call out if your phone has died"
      ],
      "cons": [
        "The unit is larger than many other escape tools and may be a bit cumbersome for some users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very Handy Vehicle Tool!",
      "text": "I am really glad I bought LUXON Emergency Tool 7-in-1 Car Safety Tool. It is very handy tool to place in my car. I tried all the functions the instruction mentioned. They all worked pretty well, especially the flash light and phone charger. The flash light is very bright and clear, which can make me see anything in the dark and people can notice me as well. I tried the hand cracking charger as well. It charged my phone up to 5% within in 6 mins. It's definitely an \"insurance\" for me when I need charge my phone in an emergency situation. I highly recommend this product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Haitao Zhang",
      "helpful_votes": 15,
      "publication_date": 20190102
    },
    {
      "title": "Very useful tool. The flashlight has several flashing mode and can be charged by hand cranking.",
      "text": "This is a very useful tool overall. I like the hand cranking charge system, which means you won't be worried about the battery in any emergency. The seatbelt cutter seems quite sharp. I feel safer after having this in my car.",
      "rating": 5.0,
      "verified": true,
      "author": "kingxmyth",
      "helpful_votes": 18,
      "publication_date": 20190217
    },
    {
      "title": "I Like it. Most features i can used not only ...",
      "text": "Just use this Emergency Tool Kit in my recent travel. The flashlight surpriseD me. If fully charged, it also can power cellphone. I Like it. Most features i can used not only in the car. It is worth to have it for safe . Will buy another set for my wife's car.",
      "rating": 5.0,
      "verified": true,
      "author": "johnny",
      "helpful_votes": 14,
      "publication_date": 20180418
    },
    {
      "title": "High Quality product!",
      "text": "Solid build, bright led light, bright amber lights, the integrated battery charges my phone fairly quickly which is a plus. Haven't tested out the window breaker or the seat belt cutter but I will update this when I do. The only con is that the magnets at the front near the light are not strong enough to keep the tool attached to a car. Other than that it's a MUST have for your car.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel",
      "helpful_votes": 14,
      "publication_date": 20181010
    },
    {
      "title": "Great emergency tool",
      "text": "I am one of those “how will I know if this thing really works” kinda guy, sooo I went to auto salvage lot and paid $10 to break two windows on a wrecked Dodge Charger (similar windows to my Challenger). The Tungsten steel tip shattered the glass (safely) and the entire window fell out. It was easier to use on the driver side because I am right handed, it took two hits when I was in the passenger seat. However, both windows were successfully shattered and removed. It also makes short work of cutting a seat belt. Great tool!",
      "rating": 5.0,
      "verified": true,
      "author": "H. M. Leith",
      "helpful_votes": 4,
      "publication_date": 20200322
    },
    {
      "title": "Poor user instructions, baffling switch",
      "text": "No useful user instructions. Couldn't figure out how to turn on bright red flashing light. Finally got the red lights flashing, and now I can't figure out how to turn them off. I just packed it up for return as it happily flashes away. In an emergency, I don't want to be fiddling around looking for the right combination of actions on one-button interface to turn on the flashing LEDs. Also, one of the red LEDs diodes was DOA.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20180330
    },
    {
      "title": "Great Light and Tool",
      "text": "I had the power go out due to a storm about a week after this item came. The light performed great. The USB charger is not going to quick charge your phone by any means, but it does charge it. I really like the light and tool. PLUS PLUS PLUS",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Kim",
      "helpful_votes": 12,
      "publication_date": 20180811
    },
    {
      "title": "price is reasonable",
      "text": "Combined safety belt cutter and broken window hammer. This is an important item of your car, but it must be installed so that it is still in place, even in major accidents. The Amazon looks good and the price is reasonable. It should be installed to the floor, door, or the bottom of the dash easy to reach the driver.",
      "rating": 5.0,
      "verified": true,
      "author": "JACK STRAHM",
      "helpful_votes": 13,
      "publication_date": 20180405
    },
    {
      "title": "Good quality",
      "text": "The perfect tool to keep in your glovebox. The light is bright and I’ve had no problems so far. Have not tried smashing my window with it! But I’m sure it’ll work. The seat belt cutter is sharp and works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney Brownlow",
      "helpful_votes": 3,
      "publication_date": 20180514
    },
    {
      "title": "The building quality is definitely excellent, handy and ergonomic",
      "text": "The building quality is definitely excellent, handy and ergonomic. Multiple functions are built in such a compact device which is a must in the car especially in emergency. I would like to recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerry L",
      "helpful_votes": 3,
      "publication_date": 20180421
    },
    {
      "title": "Hope to never have to need it...",
      "text": "First, I bought four of these. Found them all to be exactly as specified. As they are for emergencies, I hope no one in my family has to use them but they provide comfort in the fact that they have great features for emergency situations. I did have to contact the manufacturer for clarification on something and was completely satisfied with their prompt attention to my needs and customer service. It was impressive their friendly and helpful response. Would highly recommend the product for your cars in case of an emergency and have confidence in their wonderful customer support should you have any concerns.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy of Three",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Awesome!",
      "text": "Get one for every car! I got 2 of these and they work great! I tested the charger and Even the charger works better than the cell phone charger I use normally. It comes with a universal charger cord so if you have an iPhone plan to keep one in your car in case of emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "Purple Monkey",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Not durable",
      "text": "I bought it 4 month ago and left it in my car, I took it out yesterday and found out the flashlight did not work anymore. I thought it is durable....",
      "rating": 1.0,
      "verified": true,
      "author": "ilJKDli",
      "helpful_votes": 2,
      "publication_date": 20190113
    },
    {
      "title": "Simple, functional, & practical",
      "text": "It works well as expected in terms of the flashlight--charging by electrical & mechanical Though I did not test the seatbelt cutter & and the pointed glass breaker, they seemed reliable to me. The flashlight past long--i left it on in the night for few days while on trip to Africa. Peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Franco Nero",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "A nice accessory for the car",
      "text": "This works very well but keep it stored close to you in the car. It should be within an arms reach if you are in an accident and need to cut your seatbelt strap or alert responders with the spotlight. It fit nicely in the door pocket of my Equinox.",
      "rating": 5.0,
      "verified": true,
      "author": "MJWmisty",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "It's amazing how long the charge for the flashlight lasts.",
      "text": "I bought this a while back. I spun the crank to see how it worked and then plopped it in my car and semi-forgot about it. I picked it up a couple of days ago and even after months of non-use in a hot car the internal battery still had enough charge to shine the flashlight. Pretty impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Cap'n Dave",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "A 'Must Have' for your car!",
      "text": "The item is as described and was delivered as promised. Love all the functions in the tool and knowing that it is available when needed. Sturdy and well-built. The hammer and seat belt cutter are good. I haven’t used it yet, but I don’t want to either. But I am sure it will do the job, it does really give me a sense of security.",
      "rating": 5.0,
      "verified": true,
      "author": "FEI DUAN",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "I had thought to velcro it to the dash for easy access in an emergency as it will be of ...",
      "text": "this thing is HUGE! I had thought to velcro it to the dash for easy access in an emergency as it will be of no good if stored in the glove box or comes tumbling out of a center console in a crash but this is WAY too big for that. Going to have to figure out something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Rustie",
      "helpful_votes": 2,
      "publication_date": 20180720
    },
    {
      "title": "The weird flashing wouldn't turn off no matter what you ...",
      "text": "The weird flashing wouldn't turn off no matter what you tried to do. It was still flashing in the box for return. Guess it can just flash all the way back then.",
      "rating": 1.0,
      "verified": true,
      "author": "BenBen",
      "helpful_votes": 5,
      "publication_date": 20180619
    },
    {
      "title": "Not fully tested - Need a car charger since it's a car emergency tool??",
      "text": "Since this tool is designed for car emergency situation, LUXON why you didn't supply this tool with a car charger??? This is a total fail or thought out, not every car has a USB port! I didn't get test out the seat belt cutter or experience the low battery and has to crank it yet. I will keep you all posted on that.",
      "rating": 3.0,
      "verified": true,
      "author": "Julie's review",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Peace of mind owning it.",
      "text": "I have not had to use this product yet (thankfully) and the only reason I'm giving it 4 stars is because A. I have not used it and B. Because it's a bit big and clunky (personal opinion) hopefully I will never have to use it but it's peace of mind having it.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "A little large for car storage",
      "text": "The features of the Luxon tool are great and it works as specified. I was surprised how large it is, but at least it will be easy to quickly find in an emergency. appears to be well constructed and I would expect it to perform well in an emergency, good purchase for peace of mind.",
      "rating": 4.0,
      "verified": true,
      "author": "JDPompano",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "This tool could save your life",
      "text": "This is the coolest tool for having in your car \"just in case.\" It can cut your seat belt and break your window if you are trapped. It even includes a triangle for clearly indicating you're in trouble. Every car should have one.",
      "rating": 4.0,
      "verified": true,
      "author": "constant reader",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "I like gadgets",
      "text": "Charged my phone up kinda sorta, and that was enough for me. I will worry about the auto glass breaking, and seat belt cutting when it's too late of course.",
      "rating": 5.0,
      "verified": true,
      "author": "spudboy100",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Great Tool",
      "text": "We bought two of these - one for each vehicle. I hope to never have to use these, but glad to have them in case they are ever needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sewcstm",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "great product !",
      "text": "I am very pleased with this product, the delivery was prompt and the product was just as advertised. I would recommend you to all my associates.",
      "rating": 5.0,
      "verified": true,
      "author": "willie A. Perkins",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Emergency use Auto safety tool",
      "text": "I love that it has a flash light, a flashing emergency red light, a seat belt cutter, and window smasher and can be charged via USB and 12V car charger.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Peters",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Great emergency tool",
      "text": "Great emergency tool, fits in glove box. Nicely made, easy to operate.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommyof2",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "It has not worked.",
      "text": "I got this as a gift for someone. I got it early so when her birthday came I would have it. It has not worked at all, we have charged several times, turned the crank on it, nothing, it just does not work at all! My window for returning it is gone.",
      "rating": 1.0,
      "verified": true,
      "author": "Rita Walden",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Great tool for emergencies",
      "text": "I purchased this as a gift for a friend. It is a valuable tool for unexpected emergencies. Hopefully it will never have to be used!",
      "rating": 5.0,
      "verified": true,
      "author": "Bluebug",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "It seems like a wonderful tool if it's needed- I have it ...",
      "text": "It seems like a wonderful tool if it's needed- I have it in the door to my car. I like having a portable charger and a way to recharge the device.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Dimattia",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Emergency tool kit",
      "text": "Great item to keep in the car. Hand operated and multi features. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Pat Carter",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Superb practical product. Excellent for a gift for family and friends",
      "text": "Construction, ease of use, easy to carry in any auto. Liked it so much, purchased two additional for friends",
      "rating": 5.0,
      "verified": true,
      "author": "GEORGE H BARBIER",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Good to keep in car",
      "text": "I bought this because my husband and I travel a lot on the road and I thought it would be good to keep in the car. It is bigger than I had hoped and probably a bit overpriced.",
      "rating": 3.0,
      "verified": true,
      "author": "Ang S",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Safety First",
      "text": "These were a gift for my grandchildren. Hope they never need them, but if they do ........ they'll be prepared.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte Duncan",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Problem",
      "text": "i ordered ONE of these devises. The device is okay. HOWEVER, the company has tried to send and bill me for TWO other devices. WITHOUT my permission.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Harris",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Very useful.",
      "text": "Purchased this just in case, but hope we never actually need to use it. It is exactly what we were looking for our vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie E.",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Nice sturdy little car emergency tool.",
      "text": "Nice emergency car tool. Hopefully never needed but nice to have just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank W. Cranmer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "However they seamed well made and sturdy.",
      "text": "Gave these out as gifts. Haven't really used one. However they seamed well made and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "As described",
      "text": "Item is as described. Had an issue with the light and seller quickly rectified.",
      "rating": 4.0,
      "verified": true,
      "author": "DB Medway",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Needs to be 8-1 to be perfect...add a radio",
      "text": "Just wish it had a radio built in like some others I’ve found",
      "rating": 4.0,
      "verified": true,
      "author": "DKVNY",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "You need to have this in your vehicle.",
      "text": "It’s a little bulky . But it has all the assessor in case of emergency.",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn Williams",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Good survival tool if u need it",
      "text": "Upon opening the box the product felt very solid in hand. Got all the functions it mentioned, works very well. And the footprint could be fit in the glovebox with no problem at all. Overall, very good experience so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Excellent product",
      "text": "Bought for myself. Ended up liking it so much, we bought them as Christmas gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "D Drake",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Five Stars",
      "text": "Built decent for a China product. hopefully never have to use it but more for a piece of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Great tool in case of an emergency",
      "text": "I purchased one for my son, who drives a Jeep Wrangler. He was impressed with the features such as the emergency light, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Leigh",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great car or emergency gift",
      "text": "I love emergency things like this. I keep it in my car at all times and love it",
      "rating": 5.0,
      "verified": true,
      "author": "olivia massie",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Many Features",
      "text": "This is a wonderful Survival tool! Went right to my glove box to have in case of any emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "Southern Girl",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Yet to be proven.",
      "text": "Not a bad product, as with all emergency stuff, you hope it works when it counts.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Everything seems to work fine (what I was able to use/test)",
      "text": "Everything seems to work fine (what I was able to use/test), hopefully I never need to use it in real life but happy to have it",
      "rating": 3.0,
      "verified": true,
      "author": "Maribel",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Have not had to use it, thankfully. But ...",
      "text": "Have not had to use it, thankfully. But seems to be well made and practical. The flash light on the end is fairly bright. Worth having inside your vehicle, just in case.",
      "rating": 4.0,
      "verified": true,
      "author": "Hemingway",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Bought for a first time driver",
      "text": "Had tools every car owner should have in the vehicle",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "I like the versatility of this emergency tool kit",
      "text": "I like the versatility of this emergency tool kit. The one drawback I see and it may be something of an issue of personal taste is that I would have preferred for the main body be constructed of something other than plastic. Perhaps a shockproof hard rubber. It would have given the item more heft and a better sense of stability against accidental dropping.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel F.",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Works and looks good.",
      "text": "As advertised. Came charged and ready to go. Would like to have had better instructions and perhaps a lanyard, but will work fine for what I need.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike C.",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Amazing & sturdy",
      "text": "Very impressed. Will be getting these for all our car driver family members for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Trish Wahl",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Work as advertised!",
      "text": "At least some of the features work as advertised.lol Good thing is I have not have to break a window or cut a seat belt yet. The blade is sharp enough though.",
      "rating": 5.0,
      "verified": true,
      "author": "P-Fire",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Good item for all motor vehicles.",
      "text": "Good , practical device to keep in all cars or trucks,SUV’s etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Downes",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Piece of Junk",
      "text": "After a couple months, it stopped holding the charge. Really not a light to use for emergencies.",
      "rating": 1.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Provides a powerful feeling of security",
      "text": "I like everything about the product including the unique hand crank. Thankfully, I have not had to put it to the test. I'll keep it in the boot of my car.",
      "rating": 5.0,
      "verified": true,
      "author": "Dick Dalton",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Safety net",
      "text": "Good quality, very useful. I keep it in the side pocket of the car here in the south. Folks have been drowning in cars that have gone off the road into bodies of water.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernestine",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Hope it lives up to description",
      "text": "Appears that it will be handy.. have not tried ad of yet",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy Hawk",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "As good as it seemed",
      "text": "Great product; got it for daughter who travels a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "okwhite",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "A lot of assurance in a small package",
      "text": "Never want to need it, but in case you ever should, this is a tool that should be in every vehicle! A smart gift for anyone you love as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Easyreader",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Junk. Brand new item. 3 days after a full charge it was dead.",
      "text": "Junk. I bought the \"emergency tool kit\" thinking it would be useful for charging a phone. Charged it via the included USB cord, checked it again 3 days later and it was completely dead. Not even enough power to turn on the flashlight. Sure, I could crank it to charge the phone, but then what's the point of including a battery? The flashlight is junk but even if it were decent, it would take two hands to operate since the battery doesn't hold a charge.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan M",
      "helpful_votes": 4,
      "publication_date": 20170906
    },
    {
      "title": "Very Useful !",
      "text": "Has everything I need in case of emergencies - the hand-crank is especially appreciated to recharge my cell phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Vic",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Do NOT Buy!",
      "text": "Originally purchased for all of the features and on recommendation. Unfortunately the flashlight stopped working after the 2nd charge. Makes for an excellent club for self-defense. Don't buy this piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve ",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "The bulb doesn’t last",
      "text": "The flashlight light worked one time, the emergency light still works",
      "rating": 2.0,
      "verified": true,
      "author": "Francis Seybold",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "buy Peace of mind with escape tool.",
      "text": "This is the perfect tool for peace of mind. If you're ever in an emerging crisis, proper planning prevents piss poor performance. Being prepared gives me confidence, less anxiety Jeff Bezos is a genius hero of our times. He thinks of everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Great tool",
      "text": "Love the hand crank and it fits perfectly in the door pocket. I feel great knowing that I have so many safety tools at my disposal.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda DeArmond",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "it a good product to have just in case",
      "text": "Everything works. I hope to never have to use this. But, it a good product to have just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Defective product. Requires quality control...",
      "text": "When I received the item I charged it for like 5 hours and it still wouldn’t turn on. No flashlight no S.O.S. light or nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "CJMcjenzie",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Good product.",
      "text": "Have had no problem with this product, I will be buying several more for Christmas gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby C.",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Keep one in every vehicle",
      "text": "Everything works as Advertised, I just hope I never need all the features!",
      "rating": 5.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "This is a great product to just leave it in the car",
      "text": "This is a great product to just leave it in the car, very handy and provides lot of useful features.",
      "rating": 5.0,
      "verified": true,
      "author": "Teej",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "for my safety",
      "text": "Works great and I have it in my drivers side door for emergency purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "wanda l.",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Five Stars",
      "text": "great tool for car - does a lot - good for emergencies!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine E. Madison",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Great Product. Missing 1 Manual and 1 USB cable",
      "text": "Everything seems to work great so far, except one of the units we purchased was shipped with no user manual and no white usb charging cable. Good thing we bought 2!",
      "rating": 4.0,
      "verified": true,
      "author": "dbailie",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Got it like a month ago",
      "text": "Got it like a month ago. Haven't actually use it since but I have tried all the functions. Looks sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "XinweiLin",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "I bought this to test it out as an item ...",
      "text": "I bought this to test it out as an item to keep in the vehicle for emergencies, I guess i will come back and do an update when I actually use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Durable",
      "text": "Light weight, easy to use. Haven't had long enough yet to know how durable",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "A must have for your car",
      "text": "This looked pretty cool on Amazon and the reviews are pretty positive so I gave it a try. WORTH EVERY PENNY!!! A good size. The flashlight is more than bright enough for any road side needs or finding your way through the woods. The magnets are more than strong enough to hold it tight against your car when using the tail flashers. The crank is quiet and solid and the battery capacity is excellent. Just buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "ShutterBuddy",
      "helpful_votes": 2,
      "publication_date": 20171010
    },
    {
      "title": "I really like this emergency tool",
      "text": "I really like this emergency tool. I plan to buy a couple more, one for home and for each vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "theresa Garcia",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Perfect Emergency Tool",
      "text": "Wonderful gift idea. Everyone needs one in their vehicles and useful during power outages. Has the capacity to hand crank for power if battery is low and still charge a cell phone. Emergency flashlight, seat belt cutter, window breaker, and so much more. I bought this for my Son in law for Xhristm ass and he loves it. I am planning to get one for every member of my family next Christmas. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Love2Read",
      "helpful_votes": 20,
      "publication_date": 20180626
    },
    {
      "title": "Multifunction Safety Hammer",
      "text": "I haven't had to use this product yet but I will be prepared in case of an emergency. I like that it is multipurpose. The Multifunction Hammer is bright orange- can't miss seeing it- and comes with a detailed user guide plus the USB Connectors. I feel safer in case of an emergency- and feel this should be in all cars!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary L. Larson",
      "helpful_votes": 18,
      "publication_date": 20180607
    },
    {
      "title": "a very nice tool integrating lots of useful functions",
      "text": "a very nice tool integrating lots of useful functions. I mainly keep it in car to prevent danger. I believe it will help a lot also in wild field.",
      "rating": 5.0,
      "verified": true,
      "author": "laowu",
      "helpful_votes": 19,
      "publication_date": 20180411
    },
    {
      "title": "Solid product!",
      "text": "Thank God I haven't had to use it! LOL...........packaging was great, product seems to be sturdy and strong. I tested everything except the seat belt cutter and window \"buster\". I will test product as soon as I can on similar products. Everything great for now.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 12,
      "publication_date": 20180905
    },
    {
      "title": "Broken within a few days of use",
      "text": "The tool initially seemed to be of good quality, but it broke and stopped working within a few days of purchasing it. Initially, the brightness of the front light started dimming. Thinking it to be a charging issue, I charged the tool, but it still did not improve the brightness. Then a few days later, the usb charging port stopped working. In spite of fully charging the tool and using the hand crank, the usb port would not work. Overall, a very poorly built, poor quality product.",
      "rating": 1.0,
      "verified": true,
      "author": "Sanky",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Disappointed!",
      "text": "I bought this as a Christmas present for my husband for Christmas 2017. Already it no longer works. I would think the life expectancy should be more than 1 year.",
      "rating": 1.0,
      "verified": true,
      "author": "Sheree",
      "helpful_votes": 7,
      "publication_date": 20180821
    },
    {
      "title": "Much more lightweight than I expected.",
      "text": "I expected this to have a bit more weight to it. I am hard pressed to imagine being able to break my window with it. It is a very light weight tool. That being said some of the other features seem really nice. We won't know if the window breaking aspect works unless we come into a situation where we need it. That would be a bad time to find out it doesn't work!",
      "rating": 4.0,
      "verified": true,
      "author": "Dianne M.  McAllister",
      "helpful_votes": 2,
      "publication_date": 20180622
    },
    {
      "title": "FOR THE AUTOMOBILE",
      "text": "I keep this in my car at all times as an emergency tool. Can use it in event of a situation requiring immediate breaking of glass from within, or helping others locked out of their car with pet or child within.",
      "rating": 3.0,
      "verified": true,
      "author": "Jazzbeaux",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Well priced and great features",
      "text": "Bought as gift for my son - well impressed with it! Hope he never has to use some of features, but all on it really useful to have. He was very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "ILoveBootsGirl",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Neat",
      "text": "Cool device, I hope I’ll never have to use it but at least I’ll have peace of mind having it just in case. The only flaw with it is it came missing one of the front magnets. Not a big deal to me though. Otherwise works as described and the LED light on this baby is BRIGHT!",
      "rating": 4.0,
      "verified": true,
      "author": "Alexa",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Convenient tool for road trip safety",
      "text": "Took this on a road trip this weekend. Only had to use the flashlight function but I definitely had peace of mind knowing that this little tool is in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra V",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Great product! If there's an emergency",
      "text": "Great product! If there's an emergency...this is the tool to have!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Pangel",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Great size! Very user-friendly!",
      "text": "Love this! It's the perfect size and it has everything I need to stay safe in a car-related emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "MamaCass",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Bought as gifts - looked pretty cool.",
      "text": "Bought as gifts - recipients loved it but hadn’t used it yet. Will Update if they let me know.",
      "rating": 5.0,
      "verified": true,
      "author": "Honest opinion",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Great product. It is really compact and has a ...",
      "text": "Great product. It is really compact and has a lot of features.",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Just as advertized",
      "text": "Looks like it will be very helpful. It has more features than any other car tool I had bought previously and looks easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Gayle Holden",
      "helpful_votes": 0,
      "publication_date": 20190225
    }
  ],
  "product_meta": {
    "title": "Emergency Tool Kit with LED Flashlight & USB Charger 7-in-1 Rescue Tool Vehicle Emergency Escape Tool with Window Breaker & Seat Belt Cutter Car Safety Hammer for Roadside / Automotive Emergency Kit",
    "rating": 4.5,
    "feature_bullets": [
      "◈7 in 1 EMERGENCY KIT: This multifunctional tool contains car safety hammer, seat belt cutter, red indicating light(SOS lighting), magnet, LED flashlight (bright/dim/flashing), USB charger with cables, hand cranking charging system.",
      "◈WINDOW BREAKER & SEAT BELT CUTTER: The car safety hammer as an emergency escape tool can break the windows, and the seat belt cutter with sharp razor blade can cut off the seat belts. Allowing you to escape quickly from your vehicle in an emergency situation.",
      "◈HAND CRANKING CHARGING SYSTEM: The emergency tool with USB charger and USB cable has a special skill to save itself, that is hand power generation. As well as, it can charging for most phones in an emergency circumstance.",
      "◈LIGHTING TOOL & EMERGENCY SOS: When you are in the dark or emergency, you can use the car emergency kit with LED light as a lighting tool. The led light with flashlight function also can be used as emergency SOS for asking for help.",
      "◈APPLICATION AND 1 YEAR WARRANTY: The hammer as a emergency escape tool is ideal for camping, wild life adventure, field survival, home, hiking, travel, office, vehicle. This car escape kit comes with a 1 year hassle-free warranty, if you have any issues with your order, please contact us directly, we'll respond within 24 hours to give you a satisfactory reply."
    ],
    "specifications": {
      "Product Dimensions": "9.65 x 1.77 x 2.76 inches",
      "Item Weight": "10.1 ounces",
      "ASIN": "B01LZAHT64",
      "Item model number": "LX-1084-F",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.5 out of 5 stars272 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#14,211 in Automotive",
      "Is Discontinued By Manufacturer": "No",
      "Additional Features": "Seat Belt Cutter",
      "Other display features": "Wireless",
      "Colour": "Orange",
      "Included Components": "Comes with USB cable",
      "Department": "Unisex Adult",
      "Manufacturer": "ZH Electronic Co., Ltd",
      "Date First Available": "October 25, 2016"
    },
    "categories": [
      "Escape Tools",
      "Interior Accessories",
      "All Departments",
      "Automotive",
      "Safety"
    ],
    "price": 26.99
  }
}