{
  "website_summaries": [
    {
      "verdict": "Puzzle solvers and retro game fans will enjoy swapping between seasons to solve its many engaging brainteasers. \"Oracle of Seasons\" is just as fun today as it was for the Game Boy Color in 2001, and it’s a fantastic budget \"Zelda\" title.",
      "pros": [
        "Extra affordable",
        "Call upon spring, summer, fall, and winter to alter the world as needed",
        "Creatively designed puzzles and dungeons",
        "Colorful cast",
        "Combines with \"Oracle of Ages\" for bonus content"
      ],
      "cons": [
        "Although \"Oracle of Seasons\" is playable on the Nintendo 3DS, you can’t play it in 3D"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dirty Dancing",
      "text": "SO this dude link is like whoa \"where am i?\" Then he sees a bunch of people dancing and hes like sweet i like to dance. He starts dancing but then a bad dudes like \" NAW\" dancing is for weirdo mcbeardos. SO links like \" wait i like friends bring mine back!\" so he sets off on a journey to find his new dancing partner. To sum it all up This game is Dirty Dancing with swords. You're Patrick Swazye Enjoy the knowledge that you are now a badass",
      "rating": 5.0,
      "verified": true,
      "author": "Musicman22",
      "helpful_votes": 9,
      "publication_date": 20180405
    },
    {
      "title": "Wouldn't download/no info onto new advance.",
      "text": "Asked multiple times how to download it onto my new advance and unfortunately can't review it, because 5 months later, it's never been played by me... I bet it's probably awesome though-",
      "rating": 1.0,
      "verified": true,
      "author": "Never Wrong",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Awesome!",
      "text": "I bought this as a gift for my girlfriend. It was very easy to put the code in and download it on her 3DS. It worked smoothly and the game was awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrey",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "I love the Zelda series games",
      "text": "I love the Zelda series games and this is a great port for a new console.",
      "rating": 5.0,
      "verified": true,
      "author": "Bushman",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Amazing game! Just like the old ones",
      "text": "Amazing game! Just like the old ones, a perfect match for a nostalgic retro day! Recommended for all portable zelda games fans.",
      "rating": 5.0,
      "verified": true,
      "author": "daniel arturo luis perez",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "One of the best!",
      "text": "This game is perhaps one of the best in the series in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Luky_shot",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Just great.",
      "text": "Just a fantastic ZELDA game. If you like ZELDA this is worth having.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad80",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "... ago on the gba advance wanted to play again wonderful game",
      "text": "played it along time ago on the gba advance wanted to play again wonderful game",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Instant classic",
      "text": "Instant classic. Very fun game for those who like Zelda titles.",
      "rating": 5.0,
      "verified": true,
      "author": "jake",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great game",
      "text": "Fun to play when bored, I could easily spend hours on this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mah name jeff",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Five Stars",
      "text": "Always love shopping with Amazon. The Legend of Zelda met all my expectations!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Haley",
      "helpful_votes": 0,
      "publication_date": 20170902
    }
  ],
  "product_meta": {
    "title": "The Legend of Zelda: Oracle of Seasons - 3DS [Digital Code]",
    "description": "* Released on the Game Boy Color system in 2001, The Legend of Zelda: Oracle of Ages and The Legend of Zelda: Oracle of Seasons represent the pinnacle of classic 2D Zelda gameplay. Now you can play these classics on your Nintendo 3DS system! \n * When played together, these two games offer an ultimate adventure not possible when each game is experienced on its own. The games feature a link system that unlocks access to additional content that you can't access any other way. \n * This game is only playable in 2D. \n * This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES, Super NES and Game Boy Advance.",
    "rating": 4.6,
    "feature_bullets": [
      "Transform the world around you with the Rod of Seasons, and create order from chaos. Stop a power-hungry general named Onox, and rescue Din, the Oracle of Seasons, to save the troubled land of Holodrum.",
      "Change the seasons to overcome puzzling obstacles. If Link finds a small plant at the bottom of a cliff, change the season to summer, and Link can use the newly grown Deku Flower to boost up to the top. If Link faces a deep lake, use the Rod of Seasons to shift into winter, letting Link walk over the ice."
    ],
    "specifications": {
      "ASIN": "B01LX67YWP",
      "Release date": "May 30, 2013",
      "Customer Reviews": "4.6 out of 5 stars51 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#6,240 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Return Policy": "This product is non-returnable and non-refundable.",
      "Terms of Use": "By placing your order, you agree to our Terms of Use.",
      "Binding": "Software Download",
      "Rated": "Everyone",
      "Item model number": "CTRNQACE",
      "Manufacturer": "Nintendo",
      "Date First Available": "September 13, 2016"
    },
    "categories": [
      "Nintendo 3DS & 2DS",
      "Video Games"
    ],
    "price": 5.99
  }
}