{
  "website_summaries": [
    {
      "verdict": "Richly-infused bath soak with organic oils.",
      "pros": [
        "Dissolves quickly in your bath",
        "This soak works as a stress reliever in addition to relaxation"
      ],
      "cons": [
        "More expensive than other competitors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Protective seal???",
      "text": "I just received the bath salt in the mail today so I haven’t had the opportunity to try it. When I opened the jar I noticed there was no protective seal? Should I be concerned? I know the previous reviews sound amazing, but a little concerning that there wouldn’t be a protective seal?",
      "rating": 3.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "It was okay.",
      "text": "I love taking an epsom salt soak but I did not love the scent of this product.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Holder",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Good for allergies!",
      "text": "This is a really good product if you suffer from allergies. I love the Echinacea in the product, I wish more products like this added Echinacea in their product as well.",
      "rating": 5.0,
      "verified": true,
      "author": "missyandru",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Bath salts",
      "text": "This salts was very soothing, but it didn't help me get to sleep.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170218
    },
    {
      "title": "Relaxing, Amazing Smell",
      "text": "This product smells absolutely amazing. They are a great addition to my bath and definitely helped me relax and get ready to sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Amazing scent, huge container",
      "text": "Amazing scent, huge container, my skin felt soft after bathing in it and it helped me relax and sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay Manekas Cassidy",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "My favorite new bath product!",
      "text": "These bath salts are heavenly!! Love the tangy, warm scent of lemongrass, I am hooked!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan E. Walter",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Nice but cheaper elsewhere",
      "text": "These are lovely but a bit overpriced since you can get the same product for $5.99 at TJM. Oops.",
      "rating": 4.0,
      "verified": true,
      "author": "Winebyrd",
      "helpful_votes": 5,
      "publication_date": 20170402
    },
    {
      "title": "Slip into a nice hot bath!",
      "text": "I love this bath salt! I'm not sure if it makes me sleepy.. But, it's amazing to soak in after a long day.",
      "rating": 5.0,
      "verified": true,
      "author": "Troiann C.",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Five Stars",
      "text": "Love it! Skin feels silky and smooth from all the oils in the salts .",
      "rating": 5.0,
      "verified": true,
      "author": "Siggy",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "I purchased these bath salts for my daughter as a ...",
      "text": "I purchased these bath salts for my daughter as a Christmas present. She likes them very much as does her eight-year-old daughter.",
      "rating": 4.0,
      "verified": true,
      "author": "CAM",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Five Stars",
      "text": "The salts smell amazing and make a perfect gift for any bath taker",
      "rating": 5.0,
      "verified": true,
      "author": "Clare Simonis",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "The tea tree oil in this also really helps to keep your skin nice and soft",
      "text": "Talk about a product that packs a punch. A quick read of this salt's ingredient list had me convinced from the gate, and the smell of it when it arrived was the icing on the cake. Winter usually gifts me with a cold or three over the course of the season, and so far the occasional bath with this soak has helped keep me cold-free. The tea tree oil in this also really helps to keep your skin nice and soft, which can sometimes be an issue when you live in the frigid northeast. Awesome buy, will definitely be enrolling in the recurring delivery option!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor H",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "Works!",
      "text": "These are awesome! Really help me relax in order to fall asleep.",
      "rating": 5.0,
      "verified": false,
      "author": "M. DAY",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "I LOVE the subtle smell of this organic sleep soak",
      "text": "I LOVE the subtle smell of this organic sleep soak!!! I really only buy organic items, so this was a real treat to find. And I don't sleep, so I will try just about anything. Tough to say whether it was the hot bath or the salts that knocked me out, but the combo definitely did. Will definitely buy again.",
      "rating": 5.0,
      "verified": false,
      "author": "Lori B.",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Sleep Salts are the best in the bath salt category",
      "text": "Sleep Salts are the best in the bath salt category. The reason is simple, Sleep Salts are made with the best ingredients.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "I've been suffering with a herniated disc. Needless to ...",
      "text": "I've been suffering with a herniated disc. Needless to say, I needed something to help my muscles relax and to help me sleep, in spite of the pain. This worked wonders. I would definitely purchase again.",
      "rating": 5.0,
      "verified": false,
      "author": "E Hilliard",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "I use epsom salts for a detox bath. This ...",
      "text": "I use epsom salts for a detox bath. This is a pure product with a little scent added to it and therefore is pleasant, but not overwhelming",
      "rating": 5.0,
      "verified": false,
      "author": "claudiacsg",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Soothing relaxing bath",
      "text": "These salts offer a very soothing and relaxing bath. I used them before bath time and selpt like a baby. It would be a good idea to make them in a larger bottle. Great for a gift",
      "rating": 5.0,
      "verified": false,
      "author": "Rogelio",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "This stuff feels amazing. You can tell by the feel of it ...",
      "text": "This stuff feels amazing. You can tell by the feel of it that it is good salt and it smells amazing!",
      "rating": 5.0,
      "verified": false,
      "author": "Ana Kroh",
      "helpful_votes": 0,
      "publication_date": 20161115
    }
  ],
  "product_meta": {
    "title": "Sleep Salts Vitamin Soak Bath Blend With Organic Essential Oils, Echinachea, and Rose Hips, 22 Ounce Jar",
    "description": "Feeling under the weather? Let mother nature put you to sleep. This blend of epsom salt, dead sea salt, organic essential oils, and echinachea was formulated just for you. Epsom salt has long been used a natural detoxifier. We add Israel Dead Sea salt, organic lemon, lemongrass, and tea tree essential oils, as well as the immune system boosting root, echinachea, for the ultimate cold and flu bath product. We only use the real stuff! This product is free of the synthetic dyes and oils common in most bath salt products today.",
    "rating": 4.1,
    "feature_bullets": [
      "Organic tea tree oil and lemon oil",
      "Natural stress reliever",
      "Pharmaceutical grade epsom salt",
      "Israeli Dead Sea salt",
      "Detox formula for cold and flu"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4 x 2 x 5 inches; 1 Pounds",
      "Item model number": "SS-222-1",
      "UPC": "868228000222",
      "Manufacturer": "Sleep Salts",
      "ASIN": "B01LZS47GN",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Personal Care",
      "Bath",
      "Beauty & Personal Care",
      "Bath & Bathing Accessories",
      "Minerals & Salts"
    ],
    "price": ""
  }
}