{
  "website_summaries": [
    {
      "verdict": "If you need something extra-adorable to brighten up your keys, a cat sandwiched inside a lemon macaroon or stretching through a doughnut is a sweet option.",
      "pros": [
        "8 colorful keychains featuring cats lounging on baked goods",
        "Equal chance of finding doughnut, macaroon, cupcake, and coffee cats",
        "Metal ball keychains",
        "Decent price"
      ],
      "cons": [
        "Not the sturdiest keychain"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Heavier than you'd expect",
      "text": "I got the yellow macaroon cat and they look just like they do in the pictures, however it is a little larger than I thought it would be and A LOT heavier!! I was going to put it on my car keys but I absolutely can not do that. I had it on my purse for awhile but even that added extra weight that I didn't need and before I took it off, it broke off. I had gotten one of the cat sushi one's as well and they are so much lighter.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180103
    },
    {
      "title": "adorable!!",
      "text": "I got two of these cute kitty keychains, one for me and one for a friend, and we love them!! I got a kitty in a cupcake and my friend got one in a donunt! My friend's did break after not too long though. The tail broke off! I dont know what exactly happened there as mine is still perfectly fine hanging on my everyday bag. I do think these were a little on the pricey side for a keychain, but they are super adorable and the perfect way to cute up a purse! I can safely say I recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Zuzu",
      "helpful_votes": 3,
      "publication_date": 20200323
    },
    {
      "title": "Cute, cute, cute and adorable packaging!",
      "text": "I know I didn’t buy the product for the packaging but I’m crazy about the package and the clever attention statement...that made me laugh and shared it with everybody that would listen. The keychain was as advertised and I got compliments on how cute it is. Can’t wait to get others. The only thing I can say I disliked is that it’s a mystery product and you don’t know which one your getting but they are all adorable. Again thank you for the clever packaging",
      "rating": 5.0,
      "verified": true,
      "author": "Uzumaki Romeo ",
      "helpful_votes": 4,
      "publication_date": 20190328
    },
    {
      "title": "These are adorable. Got three",
      "text": "These are adorable. Got three, one for me and my kids. Mine rode on my keychain until it just popped off of the attachment one day. It’s only been a couple of months....",
      "rating": 3.0,
      "verified": true,
      "author": "Leslie weiler Meng",
      "helpful_votes": 5,
      "publication_date": 20180618
    },
    {
      "title": "So freaking cute!!",
      "text": "Besides the title summing up my general feeling about my keychain, this keychain is rather big. I received the cat-uppcino one and it was bigger than I anticipated. You can see all the details and it is easy to attach to keys or bags. I especially like the variety of options you can get.",
      "rating": 5.0,
      "verified": true,
      "author": "mini",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Once you buy one you will buy more",
      "text": "I was hesitant to spend $8 on a keychain but omg are these boxes a hit with my friends and coworkers! I love mine and want to collect them all!",
      "rating": 5.0,
      "verified": true,
      "author": "Christapalooza",
      "helpful_votes": 2,
      "publication_date": 20190614
    },
    {
      "title": "Adorable. Happy purchase!",
      "text": "These are well designed. I got the choco+mint stretching kitty. I unscrewed the keychain screw, so I could rest it on a flat surface. Kittah & donut sit upright perfectly. Cheers! :3 :3",
      "rating": 4.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 2,
      "publication_date": 20190131
    },
    {
      "title": "Cute, but.",
      "text": "Revised Review: It is super cute, but I dropped a star because it didn't stay attached to the keyring very well. It does still look cute as a figurine on a shelf though.",
      "rating": 3.0,
      "verified": true,
      "author": "ninny8",
      "helpful_votes": 2,
      "publication_date": 20181016
    },
    {
      "title": "Only one randomly selected for $$$",
      "text": "These are really cute but I misunderstood the descriptions. I didn’t realize that I was only receiving one for that price along with that it was randomly selected. I was sent two of the same items for an extremely high price!",
      "rating": 1.0,
      "verified": true,
      "author": "Jacksonbmichelle317",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Cute little key chains",
      "text": "Overall if it’s got a cat on it, I’m all for it. It’s only a plus that I ended up with the cupcake and macaroon cats too but I would’ve loved any of them. I put my spare key onto it and it sets on my computer desk. Love it. Would make a great stocking stuffer/ Easter basket filler whatever little gift for someone who loves cats as much as me. 5 stars",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Cutie",
      "text": "I've bought 4 of them and have never got a duplicate. They're cute af",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Adorable",
      "text": "I bought two and they are super cute. I use them as decor on my vanity. They are a little too heavy to use as actual key chains.",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda Kershaw",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "cute but",
      "text": "Expect a lot of duplicates since they are mystery boxes with not a lot of options.",
      "rating": 5.0,
      "verified": true,
      "author": "A&A.S.",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Girlfriend loved this gift",
      "text": "I expected her to use the cats on different keychains but she liked them so much they all went on the same one. On the plus side it makes it much easier to find her keys in her purse, just look for all the kitties.",
      "rating": 5.0,
      "verified": true,
      "author": "Raul Estrada",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Cuteness overload",
      "text": "Highly detailed, larger than expected. Great gift for any cat lover out there!",
      "rating": 5.0,
      "verified": true,
      "author": "branden colwell",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "The best key chain",
      "text": "Love love love it! It is so cute! I got the little pink macaroon with adorable black/grey kitten.",
      "rating": 5.0,
      "verified": true,
      "author": "karinn",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Adorable but not durable",
      "text": "Bought 2 of these and they are the cutest little guys!! Sadly 1 broke in half pretty quickly. Made more for looks and not to actually use as a key chain. Had it on purse and it snapped. So sad because daughter and I loved it!",
      "rating": 4.0,
      "verified": true,
      "author": "Bree",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Great Quality and Value for Money",
      "text": "These little kitties are adorable! They have absolutely amazing detail, and they are so cute on a purse. I recommend this to anyone who likes cute things. This is an amazing buy, and I am happy :)",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "The name says it all",
      "text": "Ordered two of these and both were the same thing... it even had the numberof what it was... why would they send two of the same item...I would buy another one because they are so darn cute but I don't dare for fear I would get the same ones I already have",
      "rating": 2.0,
      "verified": true,
      "author": "Caveat Emptor",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "So cute !",
      "text": "I love these and have been adding to my collection. They are good quality and adorable detail.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyss",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "So Cute",
      "text": "What a cute kitty collection item to hang on my wall of animals.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianna Stone",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Very cute",
      "text": "Very cute however, I am worried that it is not very stable I worry about losing part of the cat",
      "rating": 4.0,
      "verified": true,
      "author": "Ollie :)",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Cute cat, good quality",
      "text": "The paint and molding were both very good quality. I think the product should be about $2 cheaper, but it is a nice keychain.",
      "rating": 4.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Adorable!",
      "text": "These are just too cute! My kids love them and I think they are the cutest. Gonna be ordering a few more for christmas gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "Kirstin flack",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "An instant hit",
      "text": "Every single one is precious and I’ll definitely be ordering more soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "So cute!",
      "text": "Love them. I got the yellow macaron and white coffee cup. My students love them too.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Pinnell",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "So cute!",
      "text": "I got this for my friend who is an avid feline lover. She loves it! She got the pink macaron/gray cat.",
      "rating": 5.0,
      "verified": true,
      "author": "BootyJunk",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Daughter loves it!",
      "text": "Got this for my daughters 11th birthday! She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Keelan Kolek",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Cat lovers dream",
      "text": "I’m a cat person so my review is awesome. Just be careful with keychains they don’t like to much bumping and pulling.",
      "rating": 5.0,
      "verified": true,
      "author": "Kzcatluvr",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "These are super cute. Came exactly as expected",
      "text": "These are super cute. Came exactly as expected. My daughter loves Japanese capsule toys and was so excited about this!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Weiss",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Small and cute",
      "text": "Well made and super cute. It's small but I knew that.",
      "rating": 5.0,
      "verified": true,
      "author": "coffeedrinker",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Cute Cafe Cat",
      "text": "It's cute. Kind of expensive for the size, but I like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20180220
    },
    {
      "title": "Cute and fun!",
      "text": "So cute! Such a good give for dessert cat lovers everywhere!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin M",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Cute",
      "text": "Bought it as a Christmas gift and it's exactly as I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby Hardesty",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "ended up being perfect.",
      "text": "Bought this as a gift for someone who loves cats and sweets....ended up being perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Voodoomouse",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Good quality, but too heavy for a key holder",
      "text": "They are cute! Good quality, but too heavy for a key holder. Wish they were only figures, not key rings",
      "rating": 3.0,
      "verified": true,
      "author": "A.L.",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Love",
      "text": "I really love these keychains. I really wish I could get the black cat macaroon because it looks like my cat. But I’ve alre ordered 3 so I don’t know if I can get anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "So cute!",
      "text": "I love it! I got the pink doughnut cat. I wish it wasn't a keychain, though, however, product was as described, so I knew that before I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "GS",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Amazing!",
      "text": "I adore these cat key chains. It comes with all of the cats as told, they are amazing quality. They don't feel cheap and are quiet durable. I just honestly love them, I defiantly recommend them as a gift for anyone who loves cats.",
      "rating": 5.0,
      "verified": true,
      "author": "Karina",
      "helpful_votes": 2,
      "publication_date": 20180315
    },
    {
      "title": "Four Stars",
      "text": "It's cute, husband has it decorating the cat food bin. He loves it",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Very cute",
      "text": "Bought this as a gift for my sister who really loves cats and she loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sh",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Five Stars",
      "text": "These are so cute. It's a little bigger and heavier than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Allegra Tedder",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Good quality",
      "text": "Really cute and adorable for attaching to backpacks. 9 yr old girl ignores the keychain and treats them like friends",
      "rating": 5.0,
      "verified": true,
      "author": "Sbg",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "As pictured!",
      "text": "Cute and good quality details. I might order one more later.",
      "rating": 5.0,
      "verified": true,
      "author": "Tatiana",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "The perfect gift for my daughter, except now I want one...",
      "text": "The detail is very nice for something so small. These cute little kitties will steal your heart.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Malone",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Doesn't hold up well",
      "text": "This lasted for a couple of weeks or so before it broke in half.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie Holston",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Cute Cupcake",
      "text": "So cute, I revived the adorable white cat on the chocolate cupcake.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Lots of fun and great for those who love cats and sweets.",
      "text": "Lots of fun and a change from Sushi Cat. Great stocking stuffer.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 2",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Adorable!",
      "text": "Found these in Chicago during a trip and only bought one! I regretted it immediately and was (thankfully) able to find them online! Cutest things I've ever seen!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "These are pretty cute but don't be a fool like me and ...",
      "text": "These are pretty cute but don't be a fool like me and think you're gonna get all of them. You only get one.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Cool cat keychain",
      "text": "If you love cats and keychains or know someone who does, this is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191217
    }
  ],
  "product_meta": {
    "title": "Clever Idiots Cafe du Meow Dessert Cat Keychain - Blind Box Includes 1 of 8 Collectable Figurines - Features a Detachable Keyring - Authentic Japanese Design - Durable Plastic",
    "description": "Edition:1pc\n\nGive Your Keys an Instant Upgrade!\n\nWhether you need to make your car keys easier to identify or you simply want to give your purse \nsome extra flare, keychains add instant personality. Unfortunately, many of them are made with \nheavy, bulky materials that make them uncomfortable to wear and carry.\n\nCafe du Meow Dessert Cat Keychains are adorably unique yet convenient to carry! Our fun, frisky \nseries contains 8 different figurines, each pairing an endearing kitty with a beautiful dessert. It \nincludes 2 American shorthair cats with macaroons (pink, yellow), 2 coffee Persian cats (black, \nwhite), 2 cupcake munchkin cats (blue, cream) and 2 cats stretching through donuts (green, pink).\n\nEach figurine includes a detachable keyring that’s perfect for hooking onto your purse, backpack \nor an ID lanyard! Lightweight and measuring about 1.38in x 1.57in x 0.79in, you can show off \nyour style without excess bulk. For added fun, your figurine arrives in a blind mystery box! You \nreceive 1 of our 8 designs, allowing you to trade and collect them while enjoying a special surprise.\n\nUnlike our competitors, we’re offering genuine Japanese-designed products! Famously cute and made \nwith durable plastic, it’s craftsmanship at its finest. Thanks to beautifully detailed designs, each figurine \ntruly comes to life.\n\nWhy Choose Our Collectable Keychains?\n\n- Order includes 1of 8 figurines\n- Features a detachable keyring\n- Blind mystery box for added fun\n- Made with durable plastic\n- Authentic Japanese design\n\n\nOur Customer Service Team is Standing By!\n\n*Stock is limited. Order today to ensure availability.\n\nOrder Your Keychain Now and Let Your Style Shine!",
    "rating": 4.6,
    "feature_bullets": [
      "Adorable Dessert Cats: Cafe du Meow is where adorable kitties curl up with delectable desserts. Our 8-piece series has macaroon shorthair cats (pink, yellow), coffee Persian cats (black, white), cupcake munchkin cats (blue, cream) and donut cats (green, pink).",
      "Go-Anywhere Kitty Keychain: Thanks to a detachable keyring, you can bring your cat cupcake anywhere you go. Measuring 1.38in x 1.57in x 0.79in, each one is lightweight and compact, making these felines the perfect addition to you purse, backpack or keys.",
      "Surprise Blind Box: When you purchase one of our blind mystery boxes, you receive 1 of our 8 designs. Adding fun surprise to every order, you get to unwrap the mystery. Trade our cool keychains with friends and collect them all to build the complete series.",
      "Trusted Quality: Expertly designed and carefully crafted, these animal toys reflect our commitment to trusted and reliable craftsmanship. Strong plastic ensures long-lasting durability while the beautifully detailed faces give each figurine its own unique charm.",
      "Authentic Japanese Keychains: Clever Idiots is home to hundreds of products imagined and brought to life by Japanese creatives. Our customer service team is knowledgeable and eager to help, so let us know if you have any questions about our unique keychains."
    ],
    "specifications": {
      "Product Dimensions": "1.5 x 1.5 x 1.5 inches",
      "Item Weight": "0.64 ounces",
      "ASIN": "B01LYUB7IW",
      "Item model number": "CI-BB-MEOW001",
      "Manufacturer recommended age": "12 months and up",
      "Best Sellers Rank": "#28,519 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars169 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "12 months and up",
      "Department": "Unisex-adult",
      "Manufacturer": "Clever Idiots Inc."
    },
    "categories": [
      "Toys & Games",
      "Miniatures",
      "Novelty & Gag Toys"
    ],
    "price": 7.99
  }
}