{
  "website_summaries": [
    {
      "verdict": "A durable, light and intuitive gaming mouse that takes precision gaming to the next level, though its size can be a challenge for smaller hands.",
      "pros": [
        "Lightweight but sturdy, with matte rubber coating along the sides to prevent slipping and make precision movements easier",
        "Sensible button placement and mapping",
        "Braided cable prevents tangles"
      ],
      "cons": [
        "Mouse is too big for some users’ hands",
        "Switching button configuration in-game can be difficult",
        "Buttons sound somewhat loud when pressed",
        "Scroll button can fail"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Disgusting: Surrender your privacy to program your mouse",
      "text": "In order to use the Razer software, you have to go to their website and register, which includes giving them indentifying information and giving them the right to take information from your computer and share it with others. This is totally repulsive to me. Why do I have to surrender privacy to program my mouse???? n n",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Mouse is good, mandatory bloatware and account registration is horrible.",
      "text": "The mouse itself is excellent. I don't like having to install special software, but I can even deal with that. But seriously, why do I have to create a user account with Razer just to use my mouse? It's ridiculous. If I had known this beforehand I would never have bought this mouse. Edit: Also, after a bit of use, I find myself accidentally hitting the DPI adjustment buttons more than is acceptable. They're right behind the scroll wheel, and very easy to push with the base of your middle finger when scrolling upward or just resting your hand on the mouse. Unexpectedly shifting DPI mid-movement will really throw you off.",
      "rating": 2.0,
      "verified": true,
      "author": "SP",
      "helpful_votes": 741,
      "publication_date": 20180727
    },
    {
      "title": "This mouse is almost exactly four months old and the plastic detail is peeling off.",
      "text": "If you spend $50 on a mouse - A MOUSE - it shouldn't fall apart after 4 months of use. Garbage. The side is still sticky (which makes it totally unusable without the detail rubber piece, because it's too distracting and my fingers are sticking to it), but the rubber piece won't stay on.",
      "rating": 1.0,
      "verified": true,
      "author": "Nathliea",
      "helpful_votes": 54,
      "publication_date": 20181205
    },
    {
      "title": "Your Mouse is Spying on You",
      "text": "Beware. To configure anything beyond the basic mouse functions you have to use their Razer Synapse software. This software requires an account which contains: Your full name Email address Phone Number (!) Home Address (!!!) And you have to agree to their terms in order to continue, which includes this nugget: \"Using the data we collect, we analyse and profile your data to understand your preferences and to determine the most relevant advertisements and recommendations that may interest you\" Nope. No thanks. I'll be returning mine.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Scheirman",
      "helpful_votes": 39,
      "publication_date": 20190117
    },
    {
      "title": "Broken After 5 Months",
      "text": "50 million clicks? The left click switch is worn out after 5 months, it accidentally double clicks and fails when holding down the click as well. Completely unacceptable for a $60 gaming mouse.",
      "rating": 1.0,
      "verified": true,
      "author": "Jinxx",
      "helpful_votes": 27,
      "publication_date": 20180913
    },
    {
      "title": "I've friggen had it with this mouse.",
      "text": "The thumb area has a textured rubber pad with poor adhesive that keeps falling off - but hey, at least I can keep sticking it back on so I guess that means it's quality crap. The DPI switches are too easy to bump. The razer bloatware wont update/reinstall for me on windows 10 so I can't reprogram anything anymore. The final straw for me is that the mouse has started feeling like it drifts the DPI setting all over the place without touching the DPI buttons - sometimes i even have to reboot to get it back into something usable. Time for this mouse to get fed to the trash can - probably shouldn't let the cats eat this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Ross K.",
      "helpful_votes": 9,
      "publication_date": 20191130
    },
    {
      "title": "Do NOT buy this. 6 months in started to have an issue where single click on mouse would do a double-click",
      "text": "Do NOT buy this. 6 months in started to have an issue where single click on mouse would do a double-click. Installed and updated to the latest drivers etc. What a waste, I barely game or touch my PC at all and this happened.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay Khan",
      "helpful_votes": 21,
      "publication_date": 20180223
    },
    {
      "title": "Great Mouse for Big Hands; Outstanding MS Comfort Mouse Replacement",
      "text": "Seriously... BEST MOUSE!!!!!!!!!!!!!!!!!!!!!!!!!!! Mystopped working and I was initially distraught that it was discontinued with no full size mouse replacement available. This DeathAdder Elite is quite the worthy replacement! I didn't install the Razer mouse software and just using Windows 10 built-in capabilities. The forward/back buttons work as expected. Very nice to have the increase/decrease resolution buttons for on-the-fly sensitivity adjustments. While I love everything about it, the click wheel may be the best part of this mouse! Nubbed texture guarantees grip and it's got a satisfying click wheel- it's not a free flowing annoying wheel like on other mice I've used. The nubs make it easy to do a middle-button click without losing scroll position.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Albert",
      "helpful_votes": 23,
      "publication_date": 20170828
    },
    {
      "title": "Requires an Internet connection and account sign-up to use the mouse software",
      "text": "It is completely unacceptable to me that using the mouse software, to program buttons or change colors requires signing up for an account. There is NO REASON this software can't run entirely locally. Absolute garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "AD203",
      "helpful_votes": 10,
      "publication_date": 20181221
    },
    {
      "title": "Great mouse ruined by one small design flaw",
      "text": "I love everything about this mouse's performance, but unfortunately it gets ruined by one design flaw - the clear sticker on the bottom. If you are the type of person who constantly lifts the mouse to reposition it (most gamers are if you play with low sensitivity), then the sticker will start to peel off. This makes it more difficult to drag the mouse and the sticker peels off more and more when you do. You can't remove the stick entirely because then the bottom of it will be sticky and not smooth. This happened to my previous one and I got a new one hoping it wouldn't happen again but it has. Super disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicholas Ottrando",
      "helpful_votes": 9,
      "publication_date": 20181204
    },
    {
      "title": "Love Razer mice, will buy again!",
      "text": "I'm a faithful Razer mouse customer. Using Razer Chroma Studio to align Corsair Fans, GSKILL RAM, NZXT LED strip, & my Razer Deathadder is easy once you set them all up to be controlled by Chroma Studio. - Honestly, I found this out by accident as Corsair & NZXT do NOT play well together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200824
    },
    {
      "title": "Skip The Elite, get the Chroma",
      "text": "This mouse is poorly designed and terrible for gaming. Under the mouse wheel, there are 2 buttons that let you toggle your mousespeed up and down. Unfortunately, during an intense online video game match (DOTA, Overwatch, Counter-Strike, hell even freakin' Hearthstone), those 2 tiny buttons right under the mouse wheel WILL get accidentally pushed. The slightest touch triggers them, sending your cursor all over the place and often to an untimely death. The Chroma doesn't have this issue, because it doesn't have those 2 useless buttons under the wheel. Skip The Elite, get the Chroma",
      "rating": 2.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 4,
      "publication_date": 20180723
    },
    {
      "title": "Privacy alert: They log all keystrokes",
      "text": "Useless product as to use their settings app you have to agree to logging of your every mouse click and keystroke (!), AND SEND THIS INFORMATION TO THEM. Not buying from this ridiculous company anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "madrobby",
      "helpful_votes": 6,
      "publication_date": 20190117
    },
    {
      "title": "Nice mouse with a factory problem",
      "text": "I've had this mouse for less than a month and the mouse wheel already squeaks its very annoying. My previous steelseries mouse which I was using for a good 5 years didn't do that at all and still doesnt. Now that the negatives are out of the way this mouse for it's price is pretty nice. It looks clean and feels good in hand, although it has a low DPI its fine for me since I prefer playing with 800dpi anyways.",
      "rating": 4.0,
      "verified": true,
      "author": "MrPillow",
      "helpful_votes": 2,
      "publication_date": 20200712
    },
    {
      "title": "great while it worked but the double click issue happened every time",
      "text": "This is the 2nd razer deathadder mouse I got. The mouse is great when working. The first 1 start to have the double click issue mention by many about 5 months into use, i thought it was just a defect so purchased another one. now 6 months into the 2nd one the problem started again, time for a new mouse from another brand, very disappointed as this mouse is great when working. I'm not a gamer so the issue is def not from over use.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 2,
      "publication_date": 20200413
    },
    {
      "title": "After less than 1 year had issues with double clicking.",
      "text": "I bought this less than a year ago. Everything was good, but then it started occasionally double clicking. After spending some time trying to figure it out, it turns out that static electricity builds up in the mouse causing the double clicks. The only solution I have found to fix it was to blow air into the mouse, but that only helped for a few minutes. The mouse then goes back to having about every 5th or 6th click be a double click.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew N.",
      "helpful_votes": 2,
      "publication_date": 20200131
    },
    {
      "title": "I should have known better",
      "text": "I had read enough reviews to be warned of the problems both PC and Mac owners have had with Razer's invasive software. Having to create an account just to use a mouse should have warned me off alone. Short version: two driver downloads, two attempts in order to create an account and then the driver needs to update itself and in the process froze my Macbook Pro to the point that nothing would get it restarted short of wiping the drive and reinstalling everything from backup – a half a day wasted. Needless to say, I wouldn't dare put their software back on my computer and returned the mouse.",
      "rating": 1.0,
      "verified": true,
      "author": "William G Dalzell",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Fits my hand, performs well, but lights are annoying to disable",
      "text": "I tried quite a few mice, and this is the first one I found which fits my hand well. Other mice make my wrist hurt. It performs fine as a mouse. The adjustable DPI is nice so I can set it where I want. I hate the default constantly-changing light pattern. Having to find a Windows machine, install the software, create an account, reinstall the software a few times so it will actually open, and then find the light settings was a major annoyance when setting the mouse up. Luckily, it saves the settings in the mouse, so now the lights are set tolerably on any computer I plug the mouse into.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian S.",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Ergonomic perfection; you don't need to sign in anymore (improvements to software)",
      "text": "This mouse is perfect for me, a male with relatively small (17cm long) hands. I thought it might be too big, but it's not. It's comfortable, a good size, fairly light, and has just the right number of buttons for casual gaming. Also, I would ignore the reviews complaining about signing in with the software. You don't need to do that anymore. You can just use \"guest\" (no account) to configure the mouse. It looks like Razer took the negative feedback in mind and changed this.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Golden",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Junk",
      "text": "The fact that this is considered the eSports mouse is a joke to me. I have had for less than a year with moderate gaming and the lighting no longer works and the app constantly crashes which makes the DPI go crazy and takes me forever to fix. Overall, this mouse may have good DPI, but its reliability makes it a piece of junk. Overpriced as well, got a $8 gaming mouse alternative that I'm much happier with. Will not be buying one of these again. Update: Has stopped working completely, santa gave me coal cause it gave out on christmas day. Lifespan of about 1 year..",
      "rating": 1.0,
      "verified": true,
      "author": "Extreme",
      "helpful_votes": 3,
      "publication_date": 20181224
    },
    {
      "title": "Not what I expected / Hate the Software",
      "text": "Coming from Razer, I really did expect that this product would be something that represents the company. So far, the materials are just average and comparing it to a Red Dragon mouse, they are about the same. The thing that really annoys me is the fact that once you plug in this mouse, Razer software will start downloading and will be there on your computer. It auto starts and it's a bit annoying. There's a few features in it, but honestly, I want to use the mouse without any of these software Just average, I would suggest to look at other Razer mouses or other brands instead.",
      "rating": 3.0,
      "verified": true,
      "author": "Usrs",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Dead after 6 months",
      "text": "I was super excited to get this mouse, but within 6 months, this thing is dead. The mouse wheel wont scroll anymore and is completely lose and does not work... Everything else is fine on it... but the mouse wheel causes it to be completely not usable. Very unfortunate. I will update if anything changes, or customer service contacts me.",
      "rating": 1.0,
      "verified": true,
      "author": "Cooper",
      "helpful_votes": 2,
      "publication_date": 20200408
    },
    {
      "title": "Have to Use Software to Configure RGB",
      "text": "If you don't want this mouse to just cycle rainbows all the time, you have to keep the Razer bloatware running on your PC at all times. It can save profiles on the mouse, but these don't include RGB settings.",
      "rating": 1.0,
      "verified": true,
      "author": "mispeled",
      "helpful_votes": 4,
      "publication_date": 20200321
    },
    {
      "title": "Worse than the Deathadder Chroma",
      "text": "I got this mouse to replace my old Deathadder Chroma that I had used happily for years. Unfortunately, this mouse is worse in every way and feels like a massive downgrade. The clicks feel less \"springy\" - the left click is okay, but the right click feels very dull and is much more difficult to use repeatedly(not great if you want to play a MOBA or an RTS game). It feels similar to going back to using a rubber dome keyboard after getting used to a mechanical one. If you're looking to replace an old Deathadder, look elsewhere. The sensor may very well be better, but in my opinion the awful new click is not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "D H",
      "helpful_votes": 2,
      "publication_date": 20200817
    },
    {
      "title": "Not compatible with macOS 10.15 Catalina",
      "text": "The mouse works fine as a mouse as long as I don't want to configure the buttons or the lighting (which defaults to a slow rainbow mode). The Razer Synapse software doesn't work on my Mac running Catalina (10.15); it either prompts me to \"Allow System software from Razer USA Ltd.\" for which there's no longer an option to allow that in Catalina, or it doesn't recognize the mouse, or it lets me change settings but the mouse ignores my settings. I contacted Razer support and was told \"Razer does not and will never support Mac Catalina and onwards.\"",
      "rating": 2.0,
      "verified": true,
      "author": "Brian Kendig",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Worked great at first but failed in less than a year",
      "text": "This mouse didn’t last 9 months under normal use and stops working intermittently with no solution to be found by support after a week of a half a dozen emails. I suggest using any of Logitech devices as they seem to be better made and have better support.",
      "rating": 1.0,
      "verified": true,
      "author": "Harpy Eagle",
      "helpful_votes": 3,
      "publication_date": 20191110
    },
    {
      "title": "Great when it's on sale",
      "text": "I've seen this mouse on sale for $29.99 off and on for awhile. Luckily it went on sale when I actually NEEDED a new mouse. The RGB LEDs are a bit ridiculous, but otherwise this is a nice mouse. It fits my more-than-large-but-not quite-extra-large hands quite well. I just have to get used to not hitting the right button when making large movements - maybe if I stepped up the DPI...",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Heinrich",
      "helpful_votes": 2,
      "publication_date": 20191129
    },
    {
      "title": "Doesn't work for PlayStation (which is cool) But OMG the SPYWARE",
      "text": "This was suggested to be used with PlayStation. It didn't work. (Shocker) but that isn't why I am deducting stars. The spyware on this mouse is insane, constant pop-ups, and you have to give it way too many permissions. A mouse should not require that much crap. It is ergonomic, and a very attractive mouse, which made the hubby all that more disappointed when it was so intrusive on the computer and wouldn't work as intended. I ended up gifting it to someone who doesn't care about their privacy because it was on sale.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Good budget mouse",
      "text": "This is a great budget mouse at a sale price compared to most brick and mortars around me. The tracking and switches in the mouse itself are both excellent for the price point. My main complaint with this mouse compared to my... 9 other gaming mice is the weight of the mouse itself, Its incredibly light. I usually use wireless mice from Logitech (G900 and G602), so the lack of a battery in this guy is probably throwing me off. The ergonomics and tracking are excellent, however. I highly recommend picking one of these up for gaming and basic mouse usage.",
      "rating": 5.0,
      "verified": true,
      "author": "Cole",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Barely 1 month of use - Failed.",
      "text": "My son is an avid gamer. It's a nice mouse and should work well for gaming. However, it began missing clicks after a few weeks of use among some other odd behaviors. By the time he decided it needed to be returned, he'd missed the window by 1 day. And the original manufacturer won't honor the 2 year warranty because, unbeknownst to me, I bought it through a 3rd party seller. I'm super disappointed and disheartened. Do not buy from this seller. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "SLHarbour",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great mouse with a great feel for both everyday and gaming use!",
      "text": "I bought this after my Deathadder V1 died on me after several years of faithful service. The V2 feels just as great as the V1 and still has the same smoothness and responsiveness of the original along with the comfortable feel. the cord is still braided and still looks and feels very high quality. The Razer Synapse software is simple enough to use once you play around with it a bit and it allows you to synchronize with your other RGB Razer gear if you have any. You can also easily change the button mapping using the same software. Highly recommended for not only gaming but for everyday web surfing as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Cory",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "PROPRIETARY SOFTWARE IS GARBAGE",
      "text": "The mouse is good, probably the best for the money, but if you want to actually change anything about it, you'll have to use the insanely bad software. I thought it wouldn't annoy me, but it will open 5 services that are REQUIRED TO USE CUSTOM PROFILES. You cannot set custom profiles on hardware memory, only in the software that needs to run 24/7. The software will ask to update every week or so, and will forget your password for no apparent reason and lock you out if you enter your password wrong five or so times, to keep your valuable gaming mouse profiles safe. Dumb and unnecessary software for an otherwise decent mouse.",
      "rating": 2.0,
      "verified": true,
      "author": "Yammers",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "These mice do not last!",
      "text": "I bought this mouse in April and it’s already triple and double clicking on me. I use this one for work... this model of Razer mice do not last. I have gone through 5 death adder mice in 5 years. I’m now trying a mamba for home. Let’s see how long this one lasts. These will be my last razer products. I have a key board that still works from them. But let’s be honest... their software is just another forced bloat ware to use all the features of the product. You can use them without installing the software. But at that point, just get a better mouse you don’t have to control.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Broke down too quick",
      "text": "I've owned mine for under a year and I have noticed over the past two months it is going haywire. First the mouse would subtly register that I was moving the mouse forward on the surface, slowly moving the arrow up on the screen despite holding the mouse completely stationary. Second (and the real doozy) it has stopped registering clicks on left and right mouse buttons. It is infrequent, there is no indication of a pressure issue... it just misses probably one in 5 clicks on the left and one in 20 on the right. Final note, as everyone else has stated the bloatware for this brand is rediculous. Should have trusted my gut originally, going with a better brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Keenan Herlocker",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Nice mouse, works great so far (Video included)",
      "text": "Nice mouse so far, I upgraded from a basic dell mouse, so not sure if my comment is worth anything to the true gamers. I definitely recommend getting the large mouse pad also (sold separately), it’s called The “Razer Gigantus large gaming mouse mat” (17.5”x17.5”) Colors change automatically, I didn’t download the razer control drivers for it, so this is what it does straight out of the box (0:53 video I included with this comment) Feels good in my hand, and I like the mouse pointer speed controls on the mouse. I’ll post again for wear and tear update...",
      "rating": 5.0,
      "verified": true,
      "author": "Billy White",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "High Quality Mouse",
      "text": "I've used Death Adder's since I started PC gaming. Each iteration is an improvement from the previous predecessor. While still a comfortable mouse, it's not the most comfortable to use, but is fine for hours. The LED's are nice, and I like the additional texture added to the scroll wheel. Additional buttons all work well. The only issues I've had with any Death Adder is that the scroll wheel click will sometimes give out entirely, and the left click will also become worn, and not register holding down. But with intense use, this is probably expected, and doesn't occur usually within the first year.",
      "rating": 5.0,
      "verified": true,
      "author": "SlimeBallBuilder",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Power Point and Excel User Dream",
      "text": "I only use this really for documents; I do a lot of copy and paste between big excel workbooks with lots of charts and power point decks that get very dense with content. So having a high resolution mouse with a few extra programmable buttons is a extreme convenience to me and the command,c, and v keys on my keyboard. I hate wireless mouses as I always feel like they are less than accurate and reliable. Oh and it works for the one video game I’ve been playing for like 5 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Addicted Ninja Shopper",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Trash mouse",
      "text": "This mouse is trash. I have taken care of it and never dropped or thrown it. And now all of a sudden it just keeps disconnecting repeatedly. DO NOT BUY THIS MOUSE!!!!! Look at videos on YouTube by looking up RAZER mouse disconnecting. A LOT of people have this problem with it. I’ve only had this thing for like a month.",
      "rating": 1.0,
      "verified": true,
      "author": "Cameron",
      "helpful_votes": 3,
      "publication_date": 20200816
    },
    {
      "title": "Synapse 3 Still Not Ported to OS X",
      "text": "Even though they offer a white mouse, Razer still has not provided software support for Mac computers. You have to connect the mouse to a Windows PC to get it configured. The software, Synapse 3, is the only way to configure the mouse's extra features and buttons. Razer has not ported it. Customer service told me Synapse 3 was to be ported \"soon\", although every evidence to the contrary. Looking online, I found people have been waiting YEARS now for that port. Physically, it's a great mouse, although without the software I cannot dim the bright light it emits.",
      "rating": 2.0,
      "verified": true,
      "author": "Philip J. Mayo",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Very pleased",
      "text": "I am still getting used to the feel of it after a few days but it is an extremely fast mouse. So far I am very pleased with the purchase. Especially now that an account is not necessary to enjoy the features of the product. After reading some of the reviews about personal information, I was glad to see that Razer allows for “Guest” usage. Well done, great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Crappy mouse",
      "text": "This is a crappy mouse -- top to bottom. I'm not a gamer, just a guy who is willing to pay for ergonomics and build quality. This mouse has neither. Extremely light and cheap plastic. No rubber grip as as advertised. Mainly, it's just way to long (I'm a 6-1 man) to be comfortable for most people. The build quality is below any Logitech I have ever tried.",
      "rating": 2.0,
      "verified": true,
      "author": "AmazonUser",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Feels solid, great software installs w/o downloading anything",
      "text": "Pros: Mouse feels solid, large, comfortable Razer installer pops up when you first plug in the mouse. No downloading needed Razer software is excellent, letting you customize the mouse in many way Cons: Too easy to bump the large buttons on the left side. I have programmed one to show/hide the desktop and the other to toggle between slow and fast mouse movement (800 and 3200dpi modes). I keep accidentally triggering one of those. There is almost no way to hold the mouse without your right thumb resting on those buttons.",
      "rating": 4.0,
      "verified": true,
      "author": "DABBLE",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great for bigger hands",
      "text": "I have slightly large hands and find most mice, particularly gaming mice, feel small and cause my hand to cramp after a while. I've tried the Red Dragon M601, SteelSeries Rival 310, and a few vertical mice as well. Button placement on the M601 and 310 felt cramped and my pinky had to squeeze constantly to ensure fast reactions. This led to fatigue. I found the vertical mice felt pretty good and lowered my hand fatigue but were clunkier and less accurate for gaming. The Razer DeathAdder v2 gives me very little fatigue and feels very natural.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "It's no Microsoft mouse, but it''ll do.",
      "text": "I had my trusty Microsoft mouse for maybe 15 years and it lived a good life. This mouse felt very similar but, as many have stated, the wheel quits working within a couple years. Mine unfortunately quit just after the two year warranty. You can disassemble it and clean out the contact on the wheel, but the metal tabs that hold it together probably can't be pulled apart and pressed back in more than once. It's also not quite the same after my service work, but it's better than being all jumpy. :)",
      "rating": 2.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "side button failed to work after 1 year of use. typical razer",
      "text": "Anyone who is passionate about PC peripherals either experienced or heard Razer's poor reliability. The deathadder, while the grip and ergonomics are superb, is no exception to their reputation of using poor materials and poorer quality control. I really wanted to like this mouse because it fits into my hand perfectly and love their concave mouse buttons. Though, after swapping/troubleshooting, it was certain that the side buttons were unresponsive after a year of use...which is the typical lifespan of Razer's product line. I will not be purchasing another Razer in the future. It's appalling how easily their products break down considering how expensive it is and being manufactured by a sizable company.",
      "rating": 2.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Does Not Work With Mac OS 10.15.7 (Catalina)",
      "text": "Downloaded controlling software Synapse 2 (Synapse 3 is not available for Mac) and installed it without any issue, although having to create a Razer account should not be required. Connected the mouse directly to my Mac Pro running Mac OS 10.15.7 (Catalina) and got a message to connect a product. Conclusion: it does not work with Mac OS 10.15.7.That makes it highly unlikely it will work with the next version of the Mac OS – Big Sure. Which Mac OS's it does work with should be listed in the description. Returned the mouse for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "JOHN K. DESMARTEAU",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "go Logitech",
      "text": "I've only tried two Razer products (this mouse & a $30 MMO Razer mouse). I didn't like the feel of the $30 MMO mouse so I purchased this one instead. I've used this mouse everyday for the last 9 months and have now encountered issues. The mouse barely works. My computer is in my garage workshop (very dirty) and I've only dropped it on my countertop no more than a foot like 3 or 4 times. My previous mouse was a $50 Logitech and I dropped that thing on the concrete daily for 5 years before it died.. guess I'll go back to Logitech",
      "rating": 3.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Good, but not great in 2020.",
      "text": "For the price of $25 dollars it is a great mouse, but takes getting used to. A lot. I do like the shape and placement of the side buttons, but the hump style is rough for new comers. Again, would only purchase for a price equal or below $25. Would not recommend in 2020 with the options currently available. However, once you break into it, it works well and been happy so far.",
      "rating": 3.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Broke After One Month, Couldn't Reach Customer Service - Mailbox Full",
      "text": "My 12-year-old son loved this mouse, purchased for his birthday, for about a month, and took impeccable care of it. However, after under a month, the sensor broke. We reinstalled the software, troubleshooted for more than an hour, and attempted to reach the customer service line but were sent to a full mailbox with no way to leave a message, and were disconnected multiple times. The product has a two-year warranty so we were hoping to go through the manufacturer, but ended up needing to go through Amazon return process. Very frustrated with the entire experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Case",
      "helpful_votes": 2,
      "publication_date": 20191207
    },
    {
      "title": "impossible to configure software without an online account",
      "text": "Tracks well, but the buttons are too firm to prevent repetitive stress injury, the scroll wheel is uncomfortable, the side buttons interfere with normal grip, the cord has too much memory/kinks, and there is no way to control the RGB lights or buttons without subjecting myself to more SPAM. The idea that a mouse needs to be online strikes me as ridiculous for anyone who does not normally move the mouse between multiple computers. Does anyone do that? I do not.",
      "rating": 1.0,
      "verified": true,
      "author": "MrMark",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "What a let down.",
      "text": "Nice mouse with lots of bells and whistles. Would be more user friendly if the software allowed you to just turn off the features you don't use. I don't care about having the lighting effect, wish I could just turn it off. The size is a little taller than the comfort mouse 6000 that I'm used to. Seems slightly bulky. The wheel is great, with the large diameter helping it scroll smoothly. The buttons are very soft touch and are reminiscent of the Microsoft touch mouse that I gave away. Wish I would have gone to a store that had one to try, could have saved myself some money and frustration.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Carlton",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Replaced an 8 year old DeathAdder",
      "text": "My 8 year old DeathAdder required 2 clicks to register the left mouse button. This gets annoying very fast. I switched the button layout to use the right as the left, and immediately found it more responsive. That's when I realized the left button is toast. I tried to blow it clean but that didn't help. So I broke down and ordered a new DeathAdder. It has been GREAT! Better than I expected. No more double clicking to get a single click. Also, it works out of the box with Linux. I just plugged it in and it works. You can download the razer software and compile it for Linux to control the chroma feature of the mouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus M. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "This one's a keeper!",
      "text": "Okay, I ordered mine three years ago and paid double the price it's going for now; yeah, I'm late with this review, but here it is: Get this mouse if'n you want a good one. My hands are just a bit larger than normal (what's normal?), yet I've had no problem maneuvering this mouse. The buttons are very responsive, the thing is fast as far as reactions to each click and tap. The rubber-like very thin coating that makes it so damb easy to grab it and then do whatever you need it to do is a big plus: it's never slipped outta my hand. 'Tay, there ya go. See ya.",
      "rating": 5.0,
      "verified": true,
      "author": "Biomanb2",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Pound for Pound Champ",
      "text": "This might be the best all around mouse of all time. I bought this because it was on sale on Prime Day for dirt cheap ($25 if I recall correctly) and I wasn’t totally satisfied with the Corsair Ironclaw I had purchased. I had previous good experience with this mouse and it doesn’t disappoint. I love the knobby scroll wheel and the side buttons are perfectly placed. I have two knocks against. First is the plastic feels a bit cheap. Second I did not like the synapse software at all and found it intrusive. Don’t hesitate on this one if you want a great daily driver scoop it up",
      "rating": 5.0,
      "verified": true,
      "author": "Mark M.",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Comfortable",
      "text": "This is a great mouse for a picky person. At least for me it is. For the longest time I refused to use any other mouse then my wireless LG mouse. Nothing else felt comfortable but the mouse was also not designed for gaming, so I decided to upgrade. I bought this mouse because it has a very similar shape to the mouse I used including the side buttons. Everything is super smooth and feels wonderful, the wheel is exceptional, the weight, color options, absolutely perfect and I will not be going back to my old mouse any time soon. TL;DR Great gaming mouse for the price, very comfortable, built well",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "The mouse you want!",
      "text": "What I love about this mouse the most is the shape and fit in one's hand: You can feel and see that Razer set out to construct a mouse intended for comfort and efficiency, and they nailed it! Lets also give note to the AMAZING light show this thing can put on for you; you can even customize the patterns and rhythm to make it your own. I have had this mouse for some time now and I really haven't found a reason to regret my purchase. Oh! Let's not forget that it can sync with your other Razer products and really put on a show with the lights!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Rowe",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Perfect for small hands!",
      "text": "Perfect! I was looking for something fairly straightforward with no chroma (I know, but it distracts me) and that would fit my small hands. The deathadder is perfect for everything I needed. It comes with a couple macros on the side which is SUPER nice, and they're in a spot where I won't accidentally press them while gaming. The texture is a nice matte, which I really love. The material seems super easy to clean, too (I have a bad habit of eating at my desk lol). Slides super well on any surface. Razer's synapse program lets you customize the macros SUPER easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Ally",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Still the most comfortable for big hands.",
      "text": "I replaced my 2013 death adder with this. It's working great and it's comfortable. The mouse wheel texture took some getting used too as it kind of tickled my finger, I prefer the 2013's texture there. The feet on the mouse are much improved over previous models, spanning the whole mouse, leaving less edges for weird dust build up. The Chroma colors are beautiful. Synapse 3.0 works OK, but I do miss just installing drivers and firmware, I didn't really need my mouse to have voice chat and heat maps and all that.",
      "rating": 4.0,
      "verified": true,
      "author": "Rich Hayes",
      "helpful_votes": 2,
      "publication_date": 20180608
    },
    {
      "title": "Great While it Works - Buttons Fail",
      "text": "This is a great mouse for FPS while it works but, I've purchased two of them for my son and both of them have had mouse buttons fail long before it would be expected. I would expect the buttons on these to be as reliable as they come but, that's unfortunately not the case. This time the right mouse button is failing to perform consistently. Attempting to warranty the item - only had it for about 5 months. Otherwise a very ergonomic and responsive mouse. Wider/bigger than my Logitech G502 Hero etc. NOTE: I don't care for the razer software but, it's not horrible.",
      "rating": 3.0,
      "verified": true,
      "author": "Mooki",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Slippery to use, wheel is already squealing, cheap construction.",
      "text": "This is an update on my previous review. Dropped it to 1 star. I barely used it but now it developed an annoying noise coming from the wheel when I turn it. This mouse is cheaply constructed, worse than some of my 5-10 year old mouse and absolutely not worth the premium money they are asking for it. Also slippery to hold for anyone who uses claw or fingertip mouse use. Avoid it.",
      "rating": 1.0,
      "verified": true,
      "author": "NewEnglander",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Best Mouse For Gaming, Hands Down",
      "text": "I'm coming from a Logitech G903, which was a great mouse, ergonomic, light, excellent button press, but unfortunately was unusable as every 2-3 months the primary left or right mouse buttons would stick, not click, lose click, etc. The Razer Deathadder V2 just came today, and I've been playing Escape From Tarkov and COD, and boy I am 110% satisfied. There is no way to describe the material that the body of this mouse is made out of, it feels great, has plenty of grip, and the buttons and scroll wheel are a DREAM. DO NOT HESITATE TO BUY THIS MOUSE!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chaos Entertainment Records",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Good mouse, bad company",
      "text": "The quality is that you would expect for the a cheap mouse. It is sub-pair in comparison to the mice at 60 dollars, but you get what you pay for. I loved this mouse until I realized what the company was doing. The had recently (1-2 years ago) incorporated a key logger into their software, which is fine for just the mouse. But I had one of their keyboards, and I did not want my passwords in their poorly secured server, so the mouse became as useful as an office mouse. It was not very comfortable after trying other mice and I regret ever considering Razer to be a good company.",
      "rating": 3.0,
      "verified": true,
      "author": "Trjumom",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "glaring issues",
      "text": "The razor synapse software is irredeemably bad. It pops up annoyingly on startup, asks for admin privileges, advertises razor products, forces you to make an account, does not reconnect when signing out of windows. Compare this to my previous mouse software which sat on my taskbar silently, offering literally every feature that this mouse offers with none of the sheer annoyance.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190411
    },
    {
      "title": "Cheap, ripoff, much better mice out there for the price.",
      "text": "I feel like this mouse is made out of air. Its light and cheap feeling. The RGB on the white version is just.. white - no chroma rgb. I was actually surprised buying this from Razer. I'd never bought a product from them before and this will definatly be the last. I kept it for a week then bought a logitech mouse for 30 dollars. That mouse was league above this one. I really see no reason for this mouse to exist, unless you happen to be a sasquatch with the strength of a toddler. Also to note - I feel like I get more privacy using the drivers to my old chineese gaming mouse than this.",
      "rating": 1.0,
      "verified": true,
      "author": "Dariusz",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "DPI Keeps Resetting",
      "text": "I like it for the most part, but the DPI resets itself for no reason every 1-2 days. It's incredibly annoying as I find it happening during some of my online competitive games. It completely throws me off. I reset it to my usual setting through the synapse program, yet it continues to randomly reset itself.",
      "rating": 1.0,
      "verified": true,
      "author": "A. B.",
      "helpful_votes": 2,
      "publication_date": 20200327
    },
    {
      "title": "Stopped working shortly after connecting",
      "text": "This was a gift for my brother so this is his review. \"When I first plugged it in, the mouse was fairly mundane compared to my original one, I saw nothing special about it besides the feeling of using a new mouse, this was my first razer product and likely my last. After installing synapse the mouse immediately stopped working as a mouse, it retained its LED colors, but had no function whatsoever. This was a disappointment as I spent roughly an hour figuring out how to fix this from uninstalling the mouse drivers to restarting my pc multiple times and quit from frustration after trying everything I could with methods I was able to.\"",
      "rating": 1.0,
      "verified": true,
      "author": "nova",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "tl;dr great, simple gaming mouse",
      "text": "You might seriously NOT want to get this mouse if your palms sweat during gaming. It's the one serious drawback of the mouse. It's nice and large, good for palm, fingertip grip players but, again, if your palms sweat during gaming I feel it'll be a PIA for claw grippers. Side note: they no longer have software support for macOS, only Windows, and forget about Linux but all the buttons are recognized by the OS anyway. If you want a good gaming mouse that doesn't require software for RGB settings look at Glorious' offerings.",
      "rating": 4.0,
      "verified": true,
      "author": "Rafael",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Broke after a little over a year",
      "text": "Loved this mouse... I owned one a long time ago that lasted me years!... But this one barely lasted 12 months... about 6 weeks ago I started having issues with it double clicking, someone recommended using an air can to clean the mouse.. I did that and it worked for about a week.. blew it out again and it worked for another week... this went on with the window of it working getting shorter and shorter until a few days ago... No matter what I do it double/triple clicks... Totally useless and a waste of $50....",
      "rating": 1.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Stopped working",
      "text": "One week after the return window on Amazon closed, the mouse stopped working properly. The infrared is out and the speed of the mouse is like light-speed. Now control over the courser anymore. POS. Not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "TAG",
      "helpful_votes": 2,
      "publication_date": 20200321
    },
    {
      "title": "Pretty decent",
      "text": "Cheap, really all you need instead of those fancier gaming mice. Also comes in white, which is somewhat rare. Texturing on the left side gets dirty which is annoying. Really, I’d rather it just not be there so it’s easier to clean (getting between the grooves is annoying). It’s not like your hand is going to slip unless you’re some crazy sweaty mofo anyways. Note the braided cable — I don’t have anything else that matches this, so it looks out of place and doesn’t really add anything. Nitpick, I know. Would be nice to have a detachable cable, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Skorupski",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Requires internet connection",
      "text": "This mouse only works properly when connected to the internet. I have a triple monitor gaming setup so mouse defaults to extra slow with not online. When not connected to the internet you cannot change mouse speed, acceleration, etc. This mouse is not good for large hands.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca A. Bellanca",
      "helpful_votes": 3,
      "publication_date": 20190126
    },
    {
      "title": "Im done with razer forever",
      "text": "Razer synapse is quite possibly the worst driver ever written in software history, it is complete garbage, it never works and it has never worked. Im done forever with you razer, your products dont work because your worthless drivers break everything.",
      "rating": 1.0,
      "verified": true,
      "author": "naughtyusername",
      "helpful_votes": 4,
      "publication_date": 20180902
    },
    {
      "title": "Was good for a year and a half.",
      "text": "Update 2: It's been about a year and a half since I bought this mouse and the siding has started to peel off, it looks like it was just cheaply glued on. Update: It's been a full year with almost no issues. The only problem I've had is whatever driver that runs the lighting on the mouse has crashed a few times making the light not work. Restarting the software fixes it immediately though. I was reluctant to buy this, as most people say razor products are the best products or the worst products depending on luck. Mine has worked very well for several months now and seems to have been worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "EchTop Contributor: Pokémon",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Been using these guys for 10 years.",
      "text": "While the Naga has gotten worse to me over the years, I love the Death Adder. I miss the old school texture, but it also made the mouse look pretty worn after a year or so. This mouse fits like a glove and when I'm not playing an MMO, I use it. I think I've only had to buy 2 over the last 10 years, and I've needed 3 Naga so even with its cheaper price, I feel like its more sturdy. There's a version 2 out now that I look forward to trying, but for now, this is still my favorite mouse and there is really nothing bad I could think to say about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Orr",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "razor software enhancement applications and accounts are faulty.",
      "text": "We set up an account for the Razor devices that we purchased. And we purchased four Razor Death Adder Elite mice. When I tried to log into the account after setting up the account and registering one of the four mice, the online application would not recognize my email, my password, and my login code. I could not change the account since the email was not recognized by the application so the application would not send me a change password message. I cannot log into the application to register the product or to keep my razor.com account current.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "First one lasted 10 years",
      "text": "Got my first DeathAdder ten years ago when I first got into PC gaming. Only issues I had with it in those 10 years was double clicking and scroll wheel problems but these were after 7-8 years of use. The older models were a little heavier, which I liked, but the new model has come cool improvements! Everything seems much more grippy and ergonomic. They added two new programmable buttons behind the scroll wheel which is great! The rgb logo is a nice update as well. I suggest this mouse over the other Razers with 30 buttons because that's what keyboards are for.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ Clark",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Great while it works. Bad customer service.",
      "text": "I love this mouse while it’s lasted. It’s sleek and cool, comfortable and compliments my other razer products through lighting and style. However, as a lot of other people have posted, it’s developed a clicking issue. It’s gotten progressively worse and sometimes it doesn’t even register 1 out of 10 clicks without having to press really hard. Customer support beats around the bush and will do anything to not have to replace it!!!! They want you to clean it or buy a new one!!! I need this thing RMA’d or is simply not buy another product from this company.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenny",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Cad and cam",
      "text": "Used for cam and cad software. Had a small wireless mouse and it would cramp my hand and didn’t respond fast enough for mastercam and solidworks for me. This mouse is so much better. And it looks professional, more than the other gaming mice in my opinion. I also use a 3D connexion space mouse at the same time. So it’s nice to have two programmable buttons on the space mouse and two on this mouse. Can’t wait to get around to macros for the two thumb buttons",
      "rating": 5.0,
      "verified": true,
      "author": "Lazer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Simple, sleek, sturdy",
      "text": "Had to upgrade from my old Deathadder as it was too damaged over the years. The V2 has a much better build. The very cozy rubber I had to superglue back onto the old mouse is now all one piece on the V2 so it stays together better. Aims sharp as a knife and is very light. The mouse is balanced, no one side drags when you pick it up. I'm a pretty serious gamer so I hold high standards, and this passes for sure. There's also new DPI buttons on top that I use for gaming.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Overpriced mouse with a very poor quality",
      "text": "This is not my first mouse from Razer, and I can say the DeathAdder Elite is worst than my last one (DiamondBack) which I switched because the scroll button started to do problems. My problem with this mouse is that the clicks feel very mushy and annoying, right click started to rattle and so did the side buttons plus the thumb grip fell off after approximately 5 weeks of use. I strongly recommend that anyone won't buy from Razer anymore because they don't only overprice their products, they have durability that is fairly equivalent to a cheap $10 mouse while it costs $50+",
      "rating": 1.0,
      "verified": true,
      "author": "Guy Bashan",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Came back home",
      "text": "Deathadders were the only mouse I've used for basically my whole life they just were perfect for me. Then I got talked into trying out their lancehead which seemed great for a while. Now I've come back to try out the V2 and damn the feeling my hand felt basically instantly and how much better it felt in the days after has brought me back into the deathadder cult 110%. These things are spooky perfect for me, size, grip, weight -they are just awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "The mouse is fine, its the software that makes it bad.... (DONT BUY THIS MOUSE!)",
      "text": "The software that is bundled will randomly update (disabling the mouse, while it updates) randomly even while in game. The software REQUIRES you to log in, and will randomly log you out after an update even if you have the save password checked. the software is the poorest thing about this mouse. there are better mouses that dont require weekly updates that cause your mouse to be disabled during gameplay...... DO NOT BUY THIS MOUSE.",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Hicks",
      "helpful_votes": 2,
      "publication_date": 20190830
    },
    {
      "title": "Amazing ergonomics, super satisfying to use; only slight downside is ability to pick up",
      "text": "I love this mouse (I have only had it for about a week now). If I do not come back to edit this, then that means it has lasted. The ergonomics are amazing, super comfortable and lightweight. The only small downside for gaming is that due to the shape it is not exactly the BEST for pick ups, though it is certainly doable (my previous mouse was thinner at the bottom than the middle, so pickups were easy. This mouse is kind of the same thickness at the bottom as the middle). So, overall, super great mouse, I love it for work and I think it made me better at the game I play.",
      "rating": 4.0,
      "verified": true,
      "author": "mtfisherim",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "I should have known not to bother with Razer",
      "text": "Absolute junk with a wheel that got ruined within weeks. The construction quality is atrocious, and the ergonomics are also terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "audioman",
      "helpful_votes": 6,
      "publication_date": 20180406
    },
    {
      "title": "Great until now...",
      "text": "Loved the mouse at first. Very comfortable and love the RGB. Worked super well up until now and I've only been using it lightly for less than a year. The right click has started to choose when to work and not work. So while playing my games which usually require a right click for aiming or whatever else, it doesn't always work and screws up the game play. So now looking for another mouse and using a 5 year old Logitech for the time being which is sad that it still works but this newer Razor doesn't...",
      "rating": 3.0,
      "verified": true,
      "author": "Timesplitters4ever",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Started having double-click issue",
      "text": "*Update* *Original Review* I've never owned a Razer mouse until now and it's great so far. Had a few Logitechs in the past and those never last more than 6 months so hopefully Razer won't disappoint me. *Updated Review* After less than 2 months of using this mouse, the right click started to do a double-click intermittently. I am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Linh Hoang",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Broken Out of the Box",
      "text": "I am an old school game at 33 years of age. I have been using the DeathAdder Elite for the last 5 or so years. I was having some issues with mine after 5 years, so I bought a replacement. As this product is advertised as new, I really find it hard to believe that quality control would allow a product in the box that doesn't work. I ordered a new one, for the exchange on the return. Hopefully, the second one is not a dud. I will change my review if need be when I get my replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Daddy Fatsacs",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Not worth the price",
      "text": "I can't recommend. The software it installs is really annoying and it's difficult to set up hotkeys. Also the mouse wheel click is extremely stiff. The worst is I've had it exactly one year and the rubber treads are coming off the side. Of course it's outside the return window now so I really have no recourse. Razer acts like it's a tough gamer brand that justifies its expense, but the Red Dragon stuff I bought around the same time has held up way better.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Delung",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Wicked fast!",
      "text": "This is my second Razer DeathAdder, I had the Elite for several years, but it died in a recent move (not the mouse's fault, LOL). So this time I opted for the v2, it's every bit as good, wicked fast and a really nice grip to it. I like the larger size, as I have arthritic hands and the smaller size mouses cause my hands to cramp. I'm not even interested at looking at different brands of computer mouse, this one is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "I Love Reading Romances",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Consistent click issues across Razer brand",
      "text": "I just went through my 5th Razer deathadder mouse, each one begins having a double-click issue after around a year. The deathadder is by far my favorite mouse, fits my hand well, performance is great (for about a year). I increasingly dislike products with an engineered expiration date. No longer recommended, moving on to a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "ehhh",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Doesn't play nicely with Windows 7 - hot garbage",
      "text": "This mouse is garbage. I share a Windows 7 PC with my significant other and when we switch user profiles this mouse just dies. It doesn't respond to movement or clicks in that scenario. We have to manually unplug and re-plug this mouse in when we want to switch users because it stops responding. I wish I had returned this mouse in the return window to get my money back, this fancy looking mouse is not worth $40 or even $5 with how inconsistently it works in this multi user windows environment.",
      "rating": 1.0,
      "verified": true,
      "author": "Berry, Dingle Q.",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "The software needs some work but...",
      "text": "The software needs some work as far as the registration goes. The mouse is amazing for gaming if that's all that concerns you just know that the software is not optional and you have to register for Razer and then you can continue to the LED effects and the DPI settings. Speaking of which, this mouse is quite sensitive and very accurate. I got this one for my brother and I haven't heard anything but good things from him since Christmas and at the low price of freakin $24, you better jump on this hype train and grab yourself one or even two!",
      "rating": 5.0,
      "verified": true,
      "author": "Zane",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Questionable longevity",
      "text": "I've been using this mouse for about three months and was mostly pleased with it, the Synapse software is annoying sometimes but that's not a major problem. However, after about three months of moderate daily use the mouse wheel suddenly stopped scrolling. The wheel just spins freely and I can no longer use it to scroll up and down. I have had $10 mice that lasted for years without issue so this should not be a \"you get what you pay for\" thing. Poor material/build quality is my guess. Probably won't bother with Razer hardware again.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucas",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Still satisfied after 2 months",
      "text": "I've used this mouse every day for about 2 months. It still performs well and is still in very good condition, even having been dropped a couple times. I remain happy worth my on sale purchase (paid 25 USD). I would pay as much as 30. My rating does not consider the software required. I do not like it, have much to say about it, but in the end, it's a different product than the mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Roman",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "a mouse to die for!",
      "text": "I am taken aback by this mouse. I was scared to invest $30 in a mouse(my PC came with a mouse and keyboard) but as soon as I started using it, I was in love. the white is stunning, the white back light gives it the perfect touch. My friends think it's a beauty, my mom loves the way it feels and it doesn't hurt her wrist like my other mouse. the wire is beautifully braided and the USB came with a cover, it even has Velcro if you want to tie up your wire. i love, love, love this mouse!",
      "rating": 5.0,
      "verified": true,
      "author": "Marteel",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Good but shortlived",
      "text": "I really like this mouse, I've purchased quite a few because I enjoy everything about it except for one thing. And that thing is probably why I've had to purchase 3 of these over a few year span. The left click just starts working intermittently, at which point the mouse is useless. I've used mice that last years and years, so I'm not sure why this one falls so short. I'm on my third one, I expect it to go out after a year or two as well, at which point I'll probably finally look into another alternative.",
      "rating": 2.0,
      "verified": true,
      "author": "Person A",
      "helpful_votes": 2,
      "publication_date": 20191219
    },
    {
      "title": "Okay, but not that good.",
      "text": "Literally doesn't work when I plug it in. I downloaded the \"razor synapse 3\" on my Alienware 13 with windows 7 & it just doesn't run. I thought i was getting a deal with 20$ off, but now i just feel robed. My brother got it to work on his, but it wouldn't let him customize the lights. It's still a decent mouse, so i guess I won't return it, but I don't think I'll ever buy another razor product that's not one of their headsets. Terrible experience. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Sleeper",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Good mouse although a little large",
      "text": "Good gaming mouse and this is the cheapest price I've found from anywhere. Gave this to my brother as a gift. The lights are cool. There are a couple of customizable buttons for your thumb. The cord is very high quality with a flexible braid cover the whole thing. The tactile feel of all the buttons are great with a good click. Only complaint about it is that the mouse is physically larger than most mice. Other than that it's a good entry gaming mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Tan",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Already going on the fritz!",
      "text": "I've only had it two months and it's already shot (and I don't use it that much). It's not nearly the quality of the first one I bought. Crap all in all.",
      "rating": 1.0,
      "verified": true,
      "author": "Silo13",
      "helpful_votes": 2,
      "publication_date": 20200327
    },
    {
      "title": "The best mouse just got better",
      "text": "A new updated design, mouse feet improvements, better and more durable grip, and heftier side buttons, 16000dpi, and chroma integration. This mouse truly is one of the best for the price you pay. Unfortunately, it was shipped one of those shipping package things, and not a box. So the nice razer box/packaging was a bit scuffed up. I would say I get slightly annoyed at how my scroll wheels start to go after about 6-12 months, but that's my own fault, since it's one of my most used buttons for the type of applications I use. The warranty always covers this, so I'm not worried as long as I have a spare mouse on hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon Customer",
      "helpful_votes": 0,
      "publication_date": 20180227
    }
  ],
  "product_meta": {
    "title": "Razer DeathAdder Elite Gaming Mouse: 16,000 DPI Optical Sensor - Chroma RGB Lighting - 7 Programmable Buttons - Mechanical Switches - Rubber Side Grips - Matte Black",
    "description": "Size:Mouse| Style:DeathAdder Elite| Color:Classic BlackEquipped with the new eSports-grade optical sensor that has true 16,000 DPI and true tracking at 450 Inches Per Second (IPS), the Razer DeathAdder Elite gives you the absolute advantage of having the fastest sensor in the world. Engineered to redefine the standards of accuracy and speed, this incredible mouse sensor crushes the competition with a Resolution Accuracy of 99.4 percent, so you can land more killing blows with pinpoint precision.1000 Herz Ultrapolling.",
    "rating": 4.6,
    "feature_bullets": [
      "The #1 Best-Selling Gaming Peripherals Manufacturer in the US: Source - The NPD Group, Inc., U.S. Retail Tracking Service, Gaming Designed: Keyboards, Mice, PC Headsets, and PC Microphones, Based on dollar sales, Jan. 2017- June 2020 combined",
      "High-Precision 16,000 DPI Optical Sensor: Offers on-the-fly sensitivity adjustment through dedicated DPI buttons (reprogrammable) for gaming and creative work",
      "Immersive, Customizable Chroma RGB Lighting: Includes 16.8 million colors w/ included preset profiles; syncs with gameplay and Razer Chroma-enabled peripherals and Philips Hue products",
      "7 Programmable Buttons: Allows for button remapping and assignment of complex macro functions through Razer Synapse",
      "Ridged, Rubberized Scroll Wheel for Maximum Accuracy: Small, tactile bumps increases grip and allows for more controlled scrolling in high-stakes gaming situations",
      "Durable Mechanical Switches: Supports up to 50 million clicks, backed by a 2 year warranty"
    ],
    "specifications": {
      "Wireless Type": "Radio Frequency",
      "Number of USB 2.0 Ports": "1",
      "Brand": "Razer",
      "Series": "Deathadder Elite",
      "Item model number": "RZ01-02010100-R3U1",
      "Hardware Platform": "PC",
      "Operating System": "Microsoft Windows",
      "Item Weight": "4.6 ounces",
      "Product Dimensions": "2.9 x 1.69 x 5 inches",
      "Item Dimensions  LxWxH": "2.9 x 1.69 x 5 inches",
      "Color": "Classic Black",
      "Batteries": "1 AAA batteries required.",
      "Manufacturer": "Razer Inc.",
      "ASIN": "B01LXC1QL0",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 27, 2016",
      "Customer Reviews": "4.6 out of 5 stars14,004 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#544 in Video Games"
    },
    "categories": [
      "PC",
      "Accessories",
      "Video Games",
      "Electronics",
      "Gaming Mice"
    ],
    "price": 68.95
  }
}