{
  "website_summaries": [
    {
      "verdict": "The best budget-friendly way to get a terabyte worth of storage from Western Digital.",
      "pros": [
        "Durable exterior makes it easy to carry the hard drive around without damage",
        "Comes with automatic backup and hardware encryption software"
      ],
      "cons": [
        "Reformatting the hard drive can be difficult on Mac computers using Disk Utility"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Hurricane Harvey No Match",
      "text": "After being underwater for 8 days during the Hurricane Harvey flooding in Houston I figured all my backup data was destroyed. After purchasing a new Imac I plugged-in the external hard drive and it fired right up. I apparently didn't lose anything and it has been working flawlessly ever since.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 95,
      "publication_date": 20171013
    },
    {
      "title": "Works with Xbox one for more storage",
      "text": "1 terrabyte storage. Comes with its own special 3.0 usb cable, and it's spefically made for it. Do not damage the cable. Works flawlessly with Xbox one system had no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "WUEBBZ007",
      "helpful_votes": 12,
      "publication_date": 20180826
    },
    {
      "title": "Twice bitten, never again.",
      "text": "While trying to install the external drive on my laptop my anti-virus software started scanning and now this external drive is not detected on My Computer as being connected. All other external devices that I attach to this USB drive are detected so it has to be this WD drive. This is the second My Passport that I bought. The first does not auto backup like it should. I have to manually copy each folder or file. Long process since it does not auto backup. I had my grandson look at it (he is a computer tech) and he could not resolve either of these issues. So it's not just me.",
      "rating": 1.0,
      "verified": true,
      "author": "Papa Ed",
      "helpful_votes": 42,
      "publication_date": 20170625
    },
    {
      "title": "Spend just a few dollars more",
      "text": "Limited compatibility. Made worse by poor customer service. For many this will probably be fine. In limited applications it functions without error. But a major point of an external HD is flexibility. For anyone outside the narrow band of compatible setups, it won't work. But your real problem will be the compete lack of service from their customer \"service.\" My seagate drives have not let me down. I shouldn't have taken the bait.",
      "rating": 1.0,
      "verified": true,
      "author": "RBB",
      "helpful_votes": 10,
      "publication_date": 20180525
    },
    {
      "title": "Surprisingly slow. For 7 hours, it has been ...",
      "text": "Surprisingly slow. For 7 hours, it has been going on at the speed of between 30 and 48 kb per second. My systems: Win7 Pro 64 bit, Dell Precision 7500 3.19GHZ (two processors) with 24 GB RAM, USB 3.0. I have about 10 other USB drives, all running at least 100 MB per second. 30 to 48 kb per second is a floppy speed of the 1990's.",
      "rating": 1.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 11,
      "publication_date": 20170825
    },
    {
      "title": "Good device, lousy directions",
      "text": "As far as a backup device, I am sure this will be fine. My gripe is that there was absolutely no instructions in or on the box that this came in, so I didn't know if it was \"plug'n'play\" or if I had to download software, which turned out to be the case. WD has to realize that we all didn't grow up with a computer in our crib and that a little direction goes a long way.",
      "rating": 3.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 30,
      "publication_date": 20170306
    },
    {
      "title": "Died after 2 years",
      "text": "Was in the process of backing up my data and started getting file errors that it couldn't access the source file. Then I couldn't access the drive altogether. Tried it on 2 different laptops and multiple ports. The activity light just constantly blinks and if I click on the drive it says it is inaccessible. Going to take a sledgehammer to it and try another brand. Just purchased the military grade AData drive.",
      "rating": 1.0,
      "verified": true,
      "author": "Petey",
      "helpful_votes": 5,
      "publication_date": 20190820
    },
    {
      "title": "Rough Ride, Easy Exit",
      "text": "The device didn't work. Very hard on my USB port. Even worse, when I spoke to a support person (whose accent I could barely understand), the serial number was not one they had. Best part was the return, which was easy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20171218
    },
    {
      "title": "Latest version of software DOES NOT WORK. WD touts ...",
      "text": "Latest version of software DOES NOT WORK. WD touts it's Discovery software (which you need to use the device). It does not load. Wanted to use WD backup software. It does not work. Contacted support in India (difficult to understand). They had me download WD Backup from website. That works, but I have no idea whats been downloaded. I know quantity and date only. I was told they have a software problem and were working on it. I'll give them a few days to fix. If not fixed, back it goes. I use a Windows 10 PC.",
      "rating": 1.0,
      "verified": true,
      "author": "Buster Brown",
      "helpful_votes": 9,
      "publication_date": 20171014
    },
    {
      "title": "lightly used,  but now a brick",
      "text": "I bought this as a back-up device in Dec 2017. I used it once a month to back up my laptop, so I've used it maybe 20 times. In between uses, it was stored in a drawer. Yesterday, I started to get \"Input/output error (5)\" on every file. The file type changed from NTFS to \"microsoft basic data\" after chkdsk didn't work. It was downhill from there. I tried to repair it using testdisk, but gave up after the tool estimated 48 hours to repair and the estimate was still increasing. Now it won't even mount. A total brick. Thank heaven I didn't ever need to restore files from it.",
      "rating": 1.0,
      "verified": true,
      "author": "Evelyn Brengle",
      "helpful_votes": 3,
      "publication_date": 20190716
    },
    {
      "title": "Didn't work for me",
      "text": "It worked great for a couple of weeks then it started giving me error messages saying it wasn't properly disconnected last time the system was shut off. The thing is it was never unplugged. Now I am transferring all my stuff back to the system and disconnecting the external hard drive as it's preventing me from downloading new games with the same error message showing up even after it's been repaired 4 times.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180330
    },
    {
      "title": "It works ok",
      "text": "This was an easy set up. Also set up the auto back up which is nice. I use for work and it is easy to access. I use it to store photos and my only comment is i can not scroll through photo after photo (arrow buttons) when i view photos that are stored on this disk. I have to open and close each one. Somewhat of a pain. I can scroll though photos in folders on the C drive no problem. Does not work with photos stored on this disk. I am using windows 10 file manager/viewer. But i still like it and it solved my storage problem.",
      "rating": 3.0,
      "verified": true,
      "author": "D Roe",
      "helpful_votes": 3,
      "publication_date": 20171115
    },
    {
      "title": "Extend Your PlayStation 4 Memory as Easy as 1, 2, 3!",
      "text": "I own the original launch PS4 500 GB & got sick of having to delete games from my console in order to play new games! Western Digital is top shelve hard drive manufacturer! Set up is a breeze, simply open box after your Amazon 📦 is delivered, remove the Hard Drive from OEM packaging, plug the USB 3.0 Cable into PS4 front left port, go to settings, memory & it will format Hard Drive and inable it to function as an extended memory! Set up took maybe 1-2 minutes. I no longer have to delete my content to play new games! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Prestige PRIME Shopper",
      "helpful_votes": 4,
      "publication_date": 20180918
    },
    {
      "title": "Less reliable than the Toshiba Canvio Connect II",
      "text": "I bought two portable disk drives in December 2017 - this unit and a Toshiba Canvio Connect II. Once a week I back up my laptop to one of them - I alternate so that if one goes bad, I have another available. So each one has been used around 44 times. This WD unit got slow and difficult two weeks ago. It could not be read, and would not back up. I thought it might be some kind of one time error, or corrupt file, or something. So I reformatted it, and it worked again. Today the same thing happened. Meanwhile the Toshiba is performing with no problems. So I'm throwing this one away, and buying another Toshiba.",
      "rating": 1.0,
      "verified": true,
      "author": "Privacy",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Compatibility issues??",
      "text": "I’ve used WD products for years, but am overall disappointed in this model. The read/write speeds seem especially slow, and I keep getting errors saying that “... file is in use” when trying to initiate a transfer. I’ve been through all of the troubleshooting steps, but noticed that every time I’m trying to transfer more than 5GB of content, I get this “in use” error, regardless of the file type. I’m returning this drive and going to try the newer 2019 model with USB-C connection. Hopefully I have better luck with the newer drive like I have with WD in the past.",
      "rating": 2.0,
      "verified": true,
      "author": "N.K.",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great HDD",
      "text": "I recently received this WD 1TB My Passport HDD. I also have an older model but was running out of space and needed another one. These HDD's are perfect for portable storage. If you ever have an issue with your computer and need to back up files, I highly recommend these. They are password protected so if plugged into another device it can't be opened. You also have the option to have it recognize the computer you use/set it up on and won't require a password if that's what you choose. Overall, it's perfect for what I need it for.",
      "rating": 5.0,
      "verified": true,
      "author": "LindsayDD",
      "helpful_votes": 5,
      "publication_date": 20171111
    },
    {
      "title": "Fast and Flimsy.",
      "text": "While I love Western Digital, I am not impressed with the build of this drive. It feels light, plastic, flimsy, and looks great, but what good does that do me if the drive fails. Thankfully, this is only an archive drive backup so if anything ends up on it, its already backed up somewhere else. It has a very sleek polished look and is definitely very small. The speed of the drive however is quite impressive (for now) and definitely holds up. I have only had this for a few weeks so we will see how it goes.",
      "rating": 2.0,
      "verified": true,
      "author": "PurchaserFLGuy",
      "helpful_votes": 3,
      "publication_date": 20180716
    },
    {
      "title": "As others have said, they just die at a ...",
      "text": "As others have said, they just die at a month into usage. Mine is less than 2 months old, and is now dead. Wasn't dropped, it just died.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 9,
      "publication_date": 20171201
    },
    {
      "title": "Great for backups",
      "text": "What I like about this external hard drive is that I can partition it. I copied my computers system backup from partition D to a partition on the HD. I also did a system image back up and also individual files such as music, pictures, and documents to the main partition. I'll do backups as the system and files change. I'm running windows 10.",
      "rating": 5.0,
      "verified": true,
      "author": "N3vino",
      "helpful_votes": 4,
      "publication_date": 20180828
    },
    {
      "title": "So far so good.",
      "text": "I've had this external hard drive for about 2 and half months now and everything is fine so far. It's size makes it easy to store and very portable. I use it to backup files for school and to free up memory on my laptop. The only con I've experience is the software needed to use the hard drive. Unfortunately I'm unable to use it at school because it needs a special program in order to function and downloading programs on campus computer isn't permitted. Therefore I'm limited to using it on my personal devices.",
      "rating": 4.0,
      "verified": true,
      "author": "Sabrina",
      "helpful_votes": 4,
      "publication_date": 20170318
    },
    {
      "title": "doesn't stand a gentle drop",
      "text": "This is really the worst one I have ever had. This hard drive is super vulnerable, the entire case is made of thin plastic. I just had a very gentle drop yesterday, and it cracks. After that, the hard drive doesn't work any more. Called customer service, they don't want to replace it for me, as there is a small crack. I don't understand, the entire thing is plastic, how can you expect it to be perfect. They also won't help recover your data. Their third party service providers charge you 120 per hour. I will never never by any WD product in my life.",
      "rating": 1.0,
      "verified": true,
      "author": "Chengyu Huang",
      "helpful_votes": 7,
      "publication_date": 20171102
    },
    {
      "title": "RETURNED -- Too complicated for basic Apple MacBook backups",
      "text": "Bought this item to replace a Passport External Hard Drive Backup that was plug-and-play, (I remember having it installed, set-up and a backup schedule configured ... in 15-minutes) but, it died after 6-years of use. So, I bought this item, the new version of the same thing I had, to replace it. RETURNED IT. After a couple of hours fussing with it, fighting with it, cussing at it ... I just gave up ... IT JUST SHOULDN'T BE THAT DIFFICULT.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin L.",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Works well with Mac Book Pro",
      "text": "This portable hard drive is extremely user friendly and easy to install on Macbook Pros. I ended up buying a second one after loving my first so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Haley Martin",
      "helpful_votes": 6,
      "publication_date": 20180720
    },
    {
      "title": "Peace of mind at a reasonable price",
      "text": "My daily indispensable companion, my computer started giving me warnings that maybe my hard drive is about to fail. I've already got my photos, music, videos and correspondence individually backed up, but the thought of having to re-install everything was daunting. I bought My Passport to image the whole drive. The price was certainly affordable and Amazon's shipping got it here in a couple of days while I was still thinking about it. The bottom line is peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Condon",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "The best portable drive on the market",
      "text": "The best portable drive on the market. After 30+ years of servicing computers for a living - and 14 years of doing data recovery in the Dallas, Texas area, the only brand of hard drive I use / sell is Western Digital. They have the best performance and reliability. Period. While these pre-built mobile drives are not the high end of the WD range, they are reliable and reasonably priced. You can only do better if you buy the Black drives and put them in your own enclosure, which is a lot more expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Warren Harris",
      "helpful_votes": 3,
      "publication_date": 20170227
    },
    {
      "title": "Best portable HD",
      "text": "If you're like me, I rely heavily on portable hard drives because I need the extra space. I have several portable hard drives and they are all Western Digital hard drives. WD is the brand to go to when you need hard drives. They're good quality and reliable. Some people have had problems with their drives and probably they were unlucky and got a malfunctioning one. But from all the WD my passport hard drives I have (I have 5 already), they have worked perfectly fine. They're ready to use for PCs, so just plug it in and start transferring files.",
      "rating": 5.0,
      "verified": true,
      "author": "JL7390",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Absolutely Perfect!! WD 1TB Black has exceptional Speed! Great Quality!",
      "text": "This WD 1TB Black My Passport Portable External Hard Drive is perfect if you have a slightly older computer and you'd like to back up things from photos, files, videos whatever it maybe you can back it up! it also comes with 256-bit protection with a password for that extra layer of protection! Cheap, Solid Quality, Wonderful Price!",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Stratford",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "What kind of sorcery is this???",
      "text": "Well what can I say its amazing so far. Does everything as advertised. I'm not sure how protected the HDD is but it feels nice and sturdy. I'm not willing to try and find out though. Its really nice to have 1tb of storage from western digital to backup all my data so when the cheap brand hard drive dies in my laptop I still have something to rely on. My laptop hard drive died about a week ago and sadly it was too far gone to create a new backup. but because of this hard drive I havent lost all of my progress from my drawings and can later go back to them",
      "rating": 5.0,
      "verified": true,
      "author": "jordan",
      "helpful_votes": 2,
      "publication_date": 20180123
    },
    {
      "title": "passport works perfect as a time machine backup and a windows backup",
      "text": "i used this an an additional media server on my network and it also servers as a backup server for my pc files with a batch migrate file. whih for those who dont know is a file that copies all windows files and folders and organizes them in folders on destination drive auyomatically. i did a time machine backup and restore on my mac. i had to clone my existing time machine drive and copy it to the new one to get it to work as a time machine drive. the diso uility app on macbook did not work on this drive.",
      "rating": 5.0,
      "verified": true,
      "author": "jake",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "PlayStation memory extention",
      "text": "I am a gamer and I was actually going to extend my memory internally because the 500GB PlayStation does not allow you to keep adding games to your system. Normally you have to delete and reinstall the games each time you wanna play them. The save data is still there, just not the game it's self. I watched a few youtube vids and saw that the external memory is actually a better idea, because down the line if I wanted to use the external memory for something else, I could... I think this makes for a great extension to the memory for PlayStation. I got the 1TB one because I only have a total of 9 games at the moment.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 3,
      "publication_date": 20170413
    },
    {
      "title": "Too many drawbacks",
      "text": "WARNING! The data on these drives cannot be recovered if the enclosure fails. The drive controller uses hardware encryption by default. Each controller is unique and therefore not interchangeable. The srive itself is integrated with the controller so it cannot be re-housed. Wish I knew before.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Nice Cheap External Drive",
      "text": "I just got this because it was a cheap external drive with a lot of capacity. It did come pre-installed with WD backup software that may be useful if that's what you bought this for, but I personally had no need. I hooked this up, formatted it, and used it to create images of my two drives for backup purposes using Macrium Reflect. Didn't take super long to do despite the size of my drives, so this guy seems to be pretty speedy at least. Don't otherwise really have anything to complain about.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "(W)onderful (D)rive",
      "text": "I'm hooked on Western Digital. I have several WD drives and all of them still work. Two of my drives are over ten years old. A co-worker once lamented to me that his WD external drive stopped working. After some questioning, he admitted that he accidentally dropped it on the floor. I thought that's like blaming the glass for breaking and spilling wine on the floor when you let it slip through your fingers. Take care of your equipment and it will take care of you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Died after 4 months",
      "text": "I have this external harddrive in a taped on case to my computer case so there's no chance of it falling off, and it rarely needs to be unplugged. Worked fine until this morning it starts clicking like a disc is scratching. My computer wasn't even on so I turned it on to see what was up: internal disc fatal error. Never dropped it, no issue with power supply, no yanking it in and out of the usb port, nothing. Just died with months of work on it after only 4 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Low cost, reliable backup.",
      "text": "Unless you are archiving movies and/or other MB consumptive data, a Terabyte is a vast amount of space. To make it portable, and the size of my smartphone is nothing short of astonishing to this old schooler who started off on a Timex Sinclair. I'll use this to store my data during a change of operating systems, selectively restore some, scrub the rest and use for backup from then on.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey D. Blais",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Great and Portable External HD",
      "text": "Very happy with the size and portability of this HD. Although I will only be talking about the HD and not the portability because I bought this HD more to have it always plugged in to my computer. I have no issues with it. I cant even hear it. I only know its plugged in because I can see it on my computer. It works amazing. I am using it for all my drop box files and backup. Very happy with this and I will recommend this HD to anyone. Also the size is awesome. Its nice and small and fits anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob L.",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Very Good USB 3.0 HD. Easy to use and fast!",
      "text": "Works fine with my aftermarket USB 3.0 PCI card and Dell XP420 Windows 10. Just plugged it in and started using. Didn't bother to reformat. Speedtest shows nearly as fast as my internal HDs and (surprisingly) faster than a Class 10 Ultra USB 3.0 memory stick. Running 24/7 for several months now. UPDATE: 01/2019: Drive failed after just a year and a half. Not a good record there. Still under warranty, but anything on the external drive was lost. (mostly lots of backups of multiple computers but some archival storage.)",
      "rating": 3.0,
      "verified": true,
      "author": "R. Grokett",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Not buying again, but customer service was ok.",
      "text": "Bought this to back up my macbook. The first one I received was unable to be formatted, immediately failed, and was determined to be a hardware issue. The customer service at Western Digital eventually resolved the problem and sent me a new one, however it was extremely frustrating as they only work through email instead of getting on the phone to troubleshoot. Took about two weeks to finally come to the conclusion it was not functional. I was pleased they honored the warranty and sent a new one. The second one worked great for about 3 months. However it recently stopped working with Time machine and I am frustrated trying to fix these issues. I will not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "This little Hard Drive, will do big things in a tiny space.",
      "text": "I purchased this WD 1TB Black My Passport HD to use a long with a digital tuner for the purpose of recording antenna TV. It`s a great Hard Drive. My wallet is bigger and thicker then this Hard Drive. You have to see it to believe it. It`s not just for TV use as it states. I have five episodes of Empire on it, to watch when ever I want. How can you beat that. So, for my use of recording TV, it`s fantastic. Size, price, and multi use, I`m happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Prime Minister",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "The solution I needed",
      "text": "My laptop only has a 256 GB SSD, so this was a great buy for the price. I've read that I can install another hard drive into my laptop, but I don't feel comfortable doing that. I'm a college kid and gamer so 256 GB is literally nothing when you think games like WoW take up 70 ish gigs. I can also store photos and I love that this drive includes a cloud based back up. If/when the drive dies, I'll always have access to my files. This is really a smart purchase if your current system doesn't have enough space and you want to free up space by using a spare drive/cloud back up.",
      "rating": 5.0,
      "verified": true,
      "author": "Shae B.",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Understand you need to modify to work with 2017+ MacBook Pro",
      "text": "The description indicates it works with MacOS, but the drive is an NTFS format. Despite a claim on the WD website, my My Passport was not configured to include HFS+. If you use time Apple Time Machine to backup your data, this is not a plug and play so you'll have to do some work to get it to go. Believe I was mislead by the product description. Maybe I am not enough of a technical expert; however, is working for me now.",
      "rating": 2.0,
      "verified": true,
      "author": "Kram",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Based on past experience.",
      "text": "I have a 1Tb WD Elements drive that has given excellent service as a backup storage device. So, when I wanted to replace a noisy NetHDD from Iomega I naturally looked at another WD. The Passport was on sale making it the same price as the Elements so I bought it even though I don't expect to use the included backup software. So far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "tlbrad774",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Fast and Reliable",
      "text": "Arrived just in time since my nine year old Seagate Free Agent suddenly died. Definitely an improvement with usb 3.0. Made an image backup using AEMOI software of a Windows 10, 320gb hdd in less than 20 minutes with another 10 minutes to verify. Really great stuff to own. However, caution is advised not to misplace your usb power/data cord since the device end appears to be proprietary. My older Seagate usb 2 power/data cord would not fit. Otherwise, exceptional product and I will probably buy another within the next several months. You can never ever have enough backups. Western Digital is the best.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Nice drive, had some trouble installing on Windows 10",
      "text": "Overall working well now, but did have some challenges on installation. Was able to figure it out myself but initially almost sent it back because it was too frustrating. I'm not really sure what the issue was but initially it would just stall while trying to backup. I looked on the internet and apparently some others have this problem. I uninstalled the software and reinstalled it, and now it has worked flawlessly for a month.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Harlow",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Used on a PS4",
      "text": "As the title says, used for my PS4 (and had to give up a precious USB port). It was super simple to use, plug in, let PS4 format and boom you are set. It seems to have NO problem running with the console, and I see no delay in it pulling info, or writing info onto it. The black color and slight pattern makes it look almost like a mini PS which I find cute (yah I am a nerd like that). Totally recommend for someone needing more console space that doens't want to open their unit and just wants an add on.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Kind of confusing",
      "text": "Product worked fine but I found instructions to be a little confusing. The first back-up took a really long time and there was really no indication what was going on. Had a few stops & starts because I didn't know if it was even working.",
      "rating": 3.0,
      "verified": true,
      "author": "R Bivone",
      "helpful_votes": 4,
      "publication_date": 20170420
    },
    {
      "title": "so far so good",
      "text": "so far so good, the black and blue ones I bought fully passed all three western digital hard drive utility tests. The two white ones I had to return, since they failed the full drive test, they hung up at 90%. They are lightweight, small, and fast. Good harddrive magnetic backup in addition to flashdrive backups. Time will tell if they hold up reliably. they are inexpensive also.",
      "rating": 5.0,
      "verified": true,
      "author": "chente",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "As expected",
      "text": "Works just how youd want it to! Be careful not to accidentally reformat and lose all your stuff! I did because I was trying to use it to take data off my phone, which it did not work for, and ended up erasing all the data on the hard drive. Totally my fault and it was fine because I had the data elsewhere so no loss.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin schuster",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Perfect for Xbox one",
      "text": "External hard drive for my xbox one. Setup was around 2 minutes. The xbox immediately recognized the drive. Formatting took less than a minute and I was up and running",
      "rating": 5.0,
      "verified": true,
      "author": "Jason4783",
      "helpful_votes": 4,
      "publication_date": 20161127
    },
    {
      "title": "Works with XP with a little help",
      "text": "I had to use two WD downloaded programs to reset the drive to all Zero's then format it, but it now works on Windows XP. I needed to back up data to move to a new computer, As Microsoft's end of support has rendered my old computer as junk. Wow, if the car companies can figure out how to do this, just think how many more cars they could sell!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Braun",
      "helpful_votes": 3,
      "publication_date": 20170129
    },
    {
      "title": "Great Playstation Storage Boost",
      "text": "Got this as a gift for my husband because we kept running out of space on our Playstation and it works great! It was really easy to hook up and everything runs great off it. I'm interested in taking over to a friends house and seeing if I can play my games that I have stored on it on their machine but have yet to try it. :)",
      "rating": 5.0,
      "verified": true,
      "author": "robin",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Lasted just over a year",
      "text": "Got one year and 3 months out of this before it died, not from heavy use either, I would plug it in maybe once a month to back up anything worth saving then leave it in a drawer. Expected more from the price but not overly surprised.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony B.",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great for computer backups",
      "text": "Perfect for backup. This is my third one as I give mine to grandchildren who have problems understanding the benefits of a monthly or better backup of the entire system. Having only about 350TB used, I can put a full backup and file history updates on the drive. As I found out some time ago, having a backup is worth the cost and time.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard S",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Like it",
      "text": "It's compact and does the job I need. I needed to take stuff off the computer because my pc may crash and I'd never see those docs or pics on it again so I got this. It's an old laptop and lately it has been freezing and wiping out. The WD is easy to use and compact. I got a case for it. I had another brand and it dropped and never worked again so be very careful with these. They tend to get shocked from falls and bumps and that is not good. So far, I'm happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyvwell",
      "helpful_votes": 2,
      "publication_date": 20170508
    },
    {
      "title": "Excellent external solution at a great price - great for traveling or simple backup solutions",
      "text": "I haven't done any benchmarks on this but it has much faster access speeds over wireless than our very old WD 3.5 inch external drive. It's very a nice, compact design and very quiet. Just plug it in and go. I have it connected to our Netgear router and shared as both a Windows share and Apple Time Machine backup location, which works great so far. Only drawback is the cable length - it's really short so if you want to hook it up permanently and stash it somewhere out of site you might need to invest in a longer one.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Pierce",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Fast, transparent encryption included on this model",
      "text": "These WD drives INCLUDE on-drive encryption that is secure and easy to use and doesn't involve installing a product like VeraCrypt. Not all WD drives have this built-in (optional to use) fast encryption, but if you need encryption, this is the fastest, most transparent way to do this. No idea why other drives don't do this. Again, be sure the model you are looking at offers the encryption feature.",
      "rating": 5.0,
      "verified": true,
      "author": "sjd",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "WD 1TB Black My Passport  Portable External Hard Drive - USB 3.0 - WDBYNN0010BBK-WESN",
      "text": "WD 1TB Black My Passport Portable External Hard Drive - USB 3.0 - WDBYNN0010BBK-WESN Comes packaged from manufacturer with cords. I have had no problems with this device and works well as a BackUp drive. I am not associated with the seller nor did I receive any product or monies for my independant review 181027 1520",
      "rating": 5.0,
      "verified": true,
      "author": "Runion",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Not so easy to use",
      "text": "I managed to accomplish my main task, copying a lot of photos from Dropbox. Not really sure how I did it. Product is not intuitive. There was no progress screen. Didn't know it was working until it told me it was finished. The instructions on the web site are totally mysterious, made no sense to me. It refused to work at all until after I registered it--kept cycling the log in screen. I would like to use it to copy some things from my hard drive, but will have to devote several hours to trying to figure out how.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Excellent Portable Drive",
      "text": "Needed a portable drive that I could store all of our photos and videos for quick access from anywhere. This drive is fast (USB 3.0) and has some security (passcode encryption) which helps you feel like your data is safer if you accidentally loose it. I have owned several WD drives in the past and never had any problems so hopefully this one will last for some time!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "Requires powered hub",
      "text": "Note - if you are using a USB hub it needs to be a powered USB hub. those seem to be getting harder to find. This was for my MS Surface that only has one USB so a hub was an additional expense. I put all my files under sub folders of /DATA and that way there is one and only one folder to backup. /DATA is about 1 GB now so this drive will hold 1,000 or so backups. At 4 times a week this should last me five years.",
      "rating": 4.0,
      "verified": true,
      "author": "David Bailey",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "So far So good.",
      "text": "I like this brand much better than the Seagate one I had that died after about a year. I have to WDs and they are working fine. Better quality in my humble opinion. I don't know about tech support, I never had to use it. So I gave them the benefit of the doubt and a 3 star in that category.",
      "rating": 5.0,
      "verified": true,
      "author": "dd",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Always Buy",
      "text": "If I ever have to buy a portable external drive for my company I always buy these, so when I was buying one for myself I figured why not get the same. These are easy to use, just plug it in and move your files to it. I've never (knock on wood) had a problem with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Racheal Roofe",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Perfect Windows/Mac compatibility",
      "text": "My fourth Passport and all are still going strong. Used this one to copy another external drive from a Windows computer to use on my Mac and all translated perfectly without having to do any formatting etc. I’ve returned other brands that were a pain or impossible to get to work between systems, never a WD Passport!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael L. M.",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Stops running on PC",
      "text": "I bought this product a few months ago and have ran two backups since I got it. When I tried to open it recently, the application simply did not open. The physical drive is connected and healthy - just the software is not functional. Even after running all the WD Drive Utilities/Discovery diagnostics, nothing seems to work. It is essentially unusable at this time. I have been unable to find a solution to this online, and many others seem to be experiencing the same problem. You can check the many online support tickets about this problem or just take your money elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Vicky",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Died after 30 days ....",
      "text": "Died after 30 days .... I'm amazed there are so many positive reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "P D",
      "helpful_votes": 4,
      "publication_date": 20180801
    },
    {
      "title": "Nice and small, works great",
      "text": "My old, big and clunky hard drive was crashing, so I bought this little thing, and it was great out of the box. Plug n play, and I easily transferred everything off my old drive to this one, and there hasn't been a problem. It's small and inconspicuous, which I like. Some people complain about the small cable, but I think it's perfect. My computer guy suggested this, and I'm very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy L. Williams",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Hello, I just bought this product, the references ...",
      "text": "Hello, I just bought this product, the references were that it was new, it arrived sealed and in apparent conditions, but at the time of using it it did not work, it requested that I changed it or a refund of the money in its defect. Thank you very much.",
      "rating": 1.0,
      "verified": true,
      "author": "José Luis Morales Rodríguez ",
      "helpful_votes": 4,
      "publication_date": 20180318
    },
    {
      "title": "Works great, tons of storage",
      "text": "I have never had an issue with this drive in the 2 or so years I've had it. I've used it all that time to store photos and videos and haven't even made a dent in the storage space. This is great for backing things up if you're not interested in a cloud-based option.",
      "rating": 5.0,
      "verified": true,
      "author": "MPerron",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Inexpensive and easy to use.",
      "text": "I'm not really sure how to review a product like this. I needed portable disconnectable storage for a project and bought this drive. When I plugged it into my computer, it connected right up and worked perfectly. The case did not get hot; a good sign as heat is often the Achilles heel for small portable drives. Assuming it doesn't fail me down the road, I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Low use, Stopped working - bricked after 2 years.",
      "text": "As a backup HDD, you don't expect to use the device very often but when you do, you expect the device to work. This EHDD gets plugged in occasionally to back items up or to access old files. I burnt all my old CDs and put them on here too. 2 years later it just stops working. Windows 10 hangs and doesn't read the drive. Windows 7 says I need to format the HDD before using. This is worse than Apple's planned obsolescence. At these their device work slow. My HDD and all my files are bricked. Gonna have to pay for a data recovery specialist.",
      "rating": 2.0,
      "verified": true,
      "author": "n8",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Very Happy With This Product",
      "text": "I had to give up my old computer for a new one and get all my data transferred over. I needed a little help since I hadn't restored from My Passport before. A Western Digital tech really helped me out. Now I believe I have the confidence to do it myself next time and feel comfortable about it, so I bought a new one to back up my new computer. I highly recommend My Passport as an external backup.",
      "rating": 5.0,
      "verified": true,
      "author": "DBG",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Formatting cross platform is tough, but works after some work.",
      "text": "A little difficult to format in such a way that would accept both Linux files and windows files at the same time, but got it working without more than a couple hours of googling. Overall very fast and does what it needs to do. For those wondering, I used this to transfer files from a Linux computer (mint 18.3) to a Windows 10 one, and it worked after formatting it a certain way (I forget which way)",
      "rating": 4.0,
      "verified": true,
      "author": "Aminimouse",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Not Working at all",
      "text": "I have bought this product On April 2018 to do back up for my old PC. I haven't used until last week (December 2018) and found the hard drive is not been detecting in any computer. It is complete waste of Money. So always try first as soon as you received the product from Amazon to make sure its working condition. very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "jp",
      "helpful_votes": 2,
      "publication_date": 20190101
    },
    {
      "title": "Incompatible with macbooks",
      "text": "I’ve had to return two of these now, both used from the amazon warehouse. They’re supposed to be compatible with macs, but it looks like the way they’re formatting them at the warehouse is making them incompatible. For the two I had, when I tried to erase and format, and they became unreadable by my computer.",
      "rating": 2.0,
      "verified": true,
      "author": "asizzle",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Nice drive but their own backup SW doesn't recognized the drive!",
      "text": "The WD backup can't find it's own drive as a backup target on my brand new Win 10 laptop. After spending a couple hours trying all their suggestions I just deleted their app and used the Windows backup SW instead which didn't have any issues with finding and using the drive to backup.",
      "rating": 3.0,
      "verified": true,
      "author": "TH",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Software does not work",
      "text": "The backup software does not work! I tried several times; even had a friend who is a techie try. Ended up downloading some free backup software. So, I use the drive but not the software it came with. By the way, I am on Windows 10",
      "rating": 3.0,
      "verified": true,
      "author": "Kathleen E.",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Simple and works great.",
      "text": "I use to store all permanent files including photos. So far it has been easy to use and capacity far exceeds my needs. Hoping it is reliable and so far working great. Planning to buy a second one to back up these important files. Have not utilized Tech Support so cannot rate.",
      "rating": 5.0,
      "verified": true,
      "author": "crabapple",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Works perfectly, never had an issue",
      "text": "I use it for additional space on my Xbox One. Transferring games to and from it is quick and easy, I don't run into any issues with it being a separate HD, whether it be lag or something else. Very good, reliable, and since I set it up the one easy time, I haven't had to mess with it at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorkin",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Big storage in a small package. Easy!",
      "text": "Compact, USB powered storage, great for simple PC backup solution. Set it up through Windows Backup, and forget about it. If your PC is on and this is hooked up, your backups get done whenever you set them up to run.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Miller",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Good solution for backup of important data",
      "text": "This is a nice external drive, as it comes with the WD backup software on the drive. You install the WD backup software and setup a backup schedule that works for you. In the event of an internal disk failure, you can replace the disk, install your OS and then recover all files backed-up to the WD drive.",
      "rating": 5.0,
      "verified": true,
      "author": "Lefty",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Works well so far",
      "text": "I thought it'd be a little bigger but that's fine. It looks nice and I bought an Amazon Basics case to keep it protected. It fits well and the cord can be stored with it. I bought a 1TB model and it's holding all of my family pictures, homeschool folders and some other files I'd like to keep safe. I lost a lot on my old laptop so I feel better now having this as a backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Chey",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Simple and efficient",
      "text": "I have a couple of these now on my ancient Imac which blew it's internal drive years ago. About 4 times the capacity of that drive and much faster it seems to me. I use one as the main hd, and the other for Time Machine backups. You can't beat cheap and simple so far as I'm concerned.",
      "rating": 5.0,
      "verified": true,
      "author": "geezerdly",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Outstanding buy!!!",
      "text": "Bigger in size than my other WD Passports but still does the job very well. Never disappointed when you buy Western Digital. Simple plug and play once the software loads. Makes storing and transporting files, videos, photos or anything else very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "napolifred",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Great device and price point",
      "text": "I originally bought this to backup PC files. And to transfer data from memory cards and thumb drives using the Kingston MobileLite Pro 6,700 mAh, but despite the videos demonstrating this possible, this drive could not be recognized. Power requirements were not the issue. I like this for the PC backup capability and it works well for that purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "tbee2003",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Worked great! If my computer crashes I can reinstall everything ...",
      "text": "After backing up my computer I wish I have spent a bit more money to get a 2 TB drive. My laptop has three 2.0 usb ports and 1 3.0 usb port. Using the 3.0 port significantly speeds up the transfer of data! I put a mirror image of my hard drive using the backup function in windows 7. Worked great! If my computer crashes I can reinstall everything from my Passport.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Y Shin",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "good product",
      "text": "it was confusing in the beginning to setup and use it for Mac and Windows, but there is many youtube video explained who to setup the WD, if you could not understand the instructor note .",
      "rating": 5.0,
      "verified": true,
      "author": "Talal Abuhulaibah",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "Worked at first, then took a dump",
      "text": "This was more of a pain than it was worth. After a few months it started having issues starting up/being read by my laptop. I didn't have any vital information stored on there, but still it was disappointing having to deal with problems so soon with this. I do not recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Poor College Student",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "This is an inexpensive easy to use storage device",
      "text": "This is an inexpensive easy to use storage device. I used it to save my media, game saves and settings for devices from an older computer to move to my new one. It's great for holding movies as well. I'd buy this again and recommend it to anyone looking for simple easy portable storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinny",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Manufacturer will not honor Amazon's published 3 year warranty",
      "text": "I own two of these drives, one operates perfectly, the other one died. Amazon's published warranty is 3 years and WD stopped honoring the warranty after one and a half years. This is the only forum with Amazon or WD where I can post a complaint to get support, I hope. I would improve my rating if this problem was solved.",
      "rating": 1.0,
      "verified": true,
      "author": "wayne nelson",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "no problems",
      "text": "how does one review a back up drive, it installed without issue in windows 10, it sits there quietly being sent weekly backups from my computer...I guess, the fact that its problem free is a positive review, no smoking or screeching noises is good, no nasty messages is better...well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Justbob30",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Great tech support",
      "text": "This works very well and, what's always important to me, tech support is great! My need for tech support isn't that there's a problem with the item; it's that I always need tech support for everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce B.",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Four Stars",
      "text": "Great drives. Small, fast and durable. I dropped mine on the floor and it still works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Just A Guy",
      "helpful_votes": 3,
      "publication_date": 20170701
    },
    {
      "title": "Excellent portable backup drive",
      "text": "As an aerial photographer who is always in the go, I needed a spare external HDD that I could take anywhere to offload my 4k content so as not to fill up the HDD on my laptop. I've been extremely pleased with this product and will likely buy another in the very near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Excellent and affordable hard drive",
      "text": "This hard drive is at a pretty good price point and I picked it up for $50 for 1 terabyte of storage. The transfer speeds are pretty good but if your transferring big files like videos I'd recommend an SSD.",
      "rating": 5.0,
      "verified": true,
      "author": "Chigozie",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Extremely Slow Backup Drive",
      "text": "Just received my 1T Passport External Drive from Amazon today. Very slow on my Lenovo Windows 10 laptop. Still waiting for it to finish backing up 78 GB. Only 1.5 GB completed in over 90 minutes. Also, I setup folders for each of my 3 computers so that I could backup each one into it's own folder. The software does not allow you to specify a folder on the drive or maybe I somehow missed it. Not very excited about this purchase. Next time I'll invest a bit more money for an SSD.",
      "rating": 3.0,
      "verified": true,
      "author": "Darrah Haarklau",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Needed an external HD",
      "text": "After researching on the internet for external HDs, this particular one was mentioned in most reviews. It has worked just fine since I purchased it. It serves as a backup HD for three different PC and a laptop and so far I have had no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Coldfinger  67",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Works great with my AirTV Player.",
      "text": "Works great for dvr recording on my Sling AirTV Player. There is a place to plug in the portable hard drive into the AirTV Player so I can now record my over the air channels. Love it! Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Software is useless, it is a free addition",
      "text": "Software is useless, it is a free addition, but if this is not your first back up drive you more likely already using better software. My biggest problem that computer will not star if I forgot to unplug the drive before restarting it or turning it on.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Krasko",
      "helpful_votes": 2,
      "publication_date": 20170428
    },
    {
      "title": "Tiny compact stylish fast external hard disk locked",
      "text": "Very small fast and stylish, lock work nice. Using it on the go with a GPD Micro Pc as media games hard disk, work fast and good , gaming on it is perfect, running online games like Smite, Overwatch in it no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Hector Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great Big Hard Drive",
      "text": "I got this hard drive to run back ups for my pc, my computer quickly recognized it and it was easy to set up. It runs smooth and doesn't make a sound and of course the size of storage is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Draven",
      "helpful_votes": 0,
      "publication_date": 20190407
    }
  ],
  "product_meta": {
    "title": "WD 1TB Black My Passport Portable External Hard Drive - USB 3.0 - WDBYNN0010BBK-WESN",
    "description": "My Passport is the trusted, portable storage that perfectly complements your on-the-go lifestyle. Designed to fit in the palm of your hand, there’s plenty of space to store a massive amount of photos, videos, music and documents. Perfectly paired with WD Backup software and password protection, the My Passport drive helps keep your files safe.",
    "rating": 4.5,
    "feature_bullets": [
      "Auto backup with Included WD Backup Software",
      "Password Protection with hardware encryption",
      "Trusted drive built with WD reliability",
      "USB 3.0 port; USB 2.0 compatible; System Compatibility: Windows 10, Windows 8.1, Windows 7; Requires reformatting for Mac OS X operating system",
      "3 year manufacturer's Limited Warranty"
    ],
    "specifications": {
      "Wireless Type": "Radio Frequency",
      "Number of USB 2.0 Ports": "1",
      "Number of USB 3.0 Ports": "1",
      "Brand": "Western Digital",
      "Series": "My Passport",
      "Item model number": "WDBYNN0010BBK-WESN",
      "Hardware Platform": "PC",
      "Operating System": "Windows and Mac",
      "Item Weight": "6 ounces",
      "Product Dimensions": "4.33 x 3.21 x 0.64 inches",
      "Item Dimensions  LxWxH": "4.33 x 3.21 x 0.64 inches",
      "Color": "Black",
      "Flash Memory Size": "1",
      "Manufacturer": "Western Digital",
      "ASIN": "B01LQQHI8I",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 10, 2016",
      "Customer Reviews": "4.5 out of 5 stars1,960 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#168 in External Hard Drives"
    },
    "categories": [
      "Data Storage",
      "Computers & Accessories",
      "Electronics",
      "External Hard Drives"
    ],
    "price": ""
  }
}