{
  "website_summaries": [
    {
      "verdict": "Convenient features for a value price. The top choice for budget-conscious campers who don't want to sacrifice comfort or quality.",
      "pros": [
        "A basic model that stands out for its ability to self-inflate",
        "Pillow firmness is adjustable",
        "Users love the lightweight design and waterproof cover"
      ],
      "cons": [
        "Occasionally requires additional inflation after several hours of use",
        "Care must be taken not to puncture it when inflated"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "beware: pillow is useless but is part of the length",
      "text": "The pad itself seems well constructed and decently thick. The pillow is uncomfortable at any level of inflation, and be warned that it is counted in the length, so the best way to use the pad is probably to inflate the pillow slightly and then turn it around so it is at your feet rather than your head. Would have been better to leave off the pillow or add extra pad instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Rafael",
      "helpful_votes": 23,
      "publication_date": 20170604
    },
    {
      "title": "It's super easy to inflate",
      "text": "The instructions were simple and clear and it's packaged very well... It's super easy to inflate. It took a more that a few minutes for it to completely inflate and you do have to blow up the pillow section but once inflated it was very firm and comfortable. Overall very,very nice,and super comfortable. Works very well for sleepovers too :) Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert O",
      "helpful_votes": 9,
      "publication_date": 20170402
    },
    {
      "title": "Great sleep mat",
      "text": "This is really neat for those who don't need a lot of padding under their sleeping bag. I bought this for my granddaughter for sleepovers. It's easy to inflate - just open the valve and it does it itself. Close the valve until ready to deflate - then open valve, fold in half, and roll up tightly (deflate pillow as well), and then use straps to hold together to put in the included bag. Nice and small package for traveling!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Williams",
      "helpful_votes": 3,
      "publication_date": 20170625
    },
    {
      "title": "Not your pillow top mattress at home but it surficed",
      "text": "This sleeping mat was ok when I used these for the first time on a tenting trip. The mat did self inflate but I found it better to allow them to self inflate as much as they could on their own then I did manually blow air into it to give a little more cushion. They are not like sleeping on a pillow top mattress bed but I would say they are better then sleeping on the plain ground. I did purchase two and used the provided snaps to attach them together. The mat did deflate easily to repack into the storage bag.",
      "rating": 3.0,
      "verified": true,
      "author": "M. McPhee",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Very comfortable compared to other hiking mats",
      "text": "I purchased this for a backpacking trip with my girlfriend. This was perfect because we also purchased a double sleeping bag and this pad was the perfect size! very luxurious compared to other hiking pads, it is very comfortable and even has little inflatable pillows! with that being said, beware of the size. It was a lot larger compared to other sleeping pads and didn't fit in my pack so I strapped it on to the outside (pictured). But the benefits of having such a comfortable sleeping pad was worth the extra size.",
      "rating": 5.0,
      "verified": true,
      "author": "Niles Getz",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "very high quality cost ratio",
      "text": "my son got a super nice Inflating Camping Sleeping Pads, but three times more expensive and a little bit lighter. I am pretty happy with this one. it has a high quality reliable material to inflate well, hold the pressure, and feel comfortable. the pillow is convenient as well. note that i have an average height. the pad is a little bit short placing my heels outside of the pad. I feel comfortable that way since i use it on a SUV floor. pay attention if you are tall or use it against a freezing cold floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Denis W.",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Comfy",
      "text": "I liked these pads, but did use as a second layer with a large pad underneath it. Easy to inflate and deflate and get back into the bags. Set up three different camp sites and was a pro by the last day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Jo",
      "helpful_votes": 2,
      "publication_date": 20190415
    },
    {
      "title": "Does the job",
      "text": "We bought the twin size 2person sleeping pad and it’s alright. The pillow isn’t very comfortable but that’s ok. Opened all of the air valves to self inflate and realized that u have to manually blow air into it to fully inflate. Even after all that, it’s not very cushioning about 1” which is ok but not as it’s advertised. It feels less dense than its single-pad counterpart which we also own. U quickly feel the pressure points. If you’re car camping try to get a 3”",
      "rating": 4.0,
      "verified": true,
      "author": "Ken M.",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Deflated some. Sucky pillow",
      "text": "The pillow is pointless unless you want to strain your neck all night. I blew it up about half way and woke up in the middle of the night to my ear being sore so I just used a different pillow. The pad is good. It kinda deflated a little bit each night I've used it, however it is semi soft on it's own so even if it deflated all the way it wasn't the worst thing in the world. All and all it did the job but I was ready to sleep in a real bed again after a few days on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah Myers",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Much easier than blowing up an air mattress.",
      "text": "I bought this after having some horrible nights sleep camping last summer due to deflating air mattresses. I wanted something that wasn't going to pop or get a hole in it and leak out air over night. This was surprisingly comfortable, and my fiance didn't seem to complain about it either, which is a plus! It wraps up nicely, and that is a huge plus for me. Looking forward to using it again.",
      "rating": 5.0,
      "verified": true,
      "author": "HGS",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Good but large footprint",
      "text": "The mat is great. Takes a bit of time to get to max inflation. The only issue I have is that it is quite large when folded. It isn't heavy, just a bit bulky. I bought an inflatable one that's gets to the size of a soda can when put away vs this one that is about the size of a big nacho cheese can. Otherwise it is easier to fold and put away because you can snap the buttons together to hold it in shape while you roll it up. The inflatable one gets all crazy and slides around so it's hard to get a tight roll without rerolling several times.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony Morgan",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Perfect for car camping",
      "text": "Bought it so the wife and i could go camping and was suprized on how well it performed. it fits me and my wife perfectly (im 6ft) it had just enough inflation to keep us off the ground and dry. exactly what I wanted. its just two individual foam pads glued together but they are seperated into two air chambers. so you can fold them ontop of each other if you want a lush single person camping experiance. was easy to deflate and roll back into the bag. kinda big for a backpack but perfect for car camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Garth Devlin",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Pretty cool idea but this thing sucks",
      "text": "Pretty cool idea but this thing sucks. The valve for the pillow will poke your eye while you are sleeping and it pops out a lot so you wake up to a deflated pillow. Adjusted the level of air multiple times and could not get it to where it was comfortable. Also sleeping bags are polyester as well so this makes for a slick surface. Found myself having slid off the dam thing like 30 times. Made for a very long uncomfortable night. Stick with the foam pads.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20170830
    },
    {
      "title": "love the functionality and ease of use",
      "text": "love the functionality and ease of use. however, i found it super uncomfortable to sleep on. for reference, i used it under my sleeping bag in a tent. it felt just like i was sleeping on the hard ground. was hoping this pad would provide a little cushion. I should add that my husband loves the pads and he would rate it 5 stars. All depends on your sleeping preference.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180529
    },
    {
      "title": "Very nice!  Well worth the extra money",
      "text": "While this mat is very thin, while inflated it offers a ton of comfort, even if you lay on your side! Not to mention, it's a great barrier between you and the ground for the colder nights. The mat has snaps going down each side that I was able to use to snap onto my U.S.G.I Modular Sleep System to ensure you are always on top of the mat even if you toss and turn during the night. Great quality. Update: No longer holds air. Useless. Didnt even use it that many times.",
      "rating": 2.0,
      "verified": true,
      "author": "Youhozz",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Best sleeping pad",
      "text": "Used this for the first time last night camping and man i was impressed. I slept on my back and sides and it was comfortable all around I did sleep on sand which made it better. The built in pillow is great I adjusted it to how I wanted it and I got really good sleep 5 star product you won't be let down. I am 5'4 180lbs I slept great but I'm sure anyone will. Probably the biggest thing I carried on my hiking backpack but it's not heavy just a tad bit big but I'm not complaining comfort is key, highly recommend this oh yeah and it's very easy to inflate. 🤙",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandro ",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Check it immediately for flaws",
      "text": "Ordered as a birthday gift for my son who us in Boy Scouts. Used it once in backyard a d it deflated through the night. I thought maybe he didn't tighten the valve. Tried a 2nd night and same thing. Found the seal around the valve was leaking. Unfortunately the return date was exceeded by 7 days. Try it out immediately when you get it, even if saving as a gift for someone.",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Beat out the air mattress",
      "text": "Bought 4 of these for my husband and sons for camping. They self-inflate well, and an extra puff or two of air makes them perfect. These are about an inch thick when fully inflated and were more successful at minimizing ridges and roots on the ground than my air mattress that was over 3 inches thick.",
      "rating": 5.0,
      "verified": true,
      "author": "Sealpup Mama",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "The pillow is a plus but you can leave it out if you don't like the air pillow feel",
      "text": "Takes a couple minutes to self inflate into an inch thick or so, you can also blow into the valve to increase firmness, but I think there is only till certain point you can blow before hearing from cracking sounds. Planning to add this to camping cot. The pillow is a plus but you can leave it out if you don't like the air pillow feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Chang",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "DO NOT WASTE YOUR MONEY",
      "text": "This is SO UNCOMFORTABLE. I literally took a knife to it after I was done camping because I didn’t even want to take it home with me.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily Snowdon",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Comfortable, but slippery",
      "text": "These are pretty comfortable and easy to inflate/deflate. The pillow has to be blown up manually, which isn’t a deal breaker. The only beef I have is that they are super slippery with a nylon sleeping bag on top of them. It’s like a banana peel on an ice rink.",
      "rating": 4.0,
      "verified": true,
      "author": "adRAD",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Pillow is uncomfortable, width is to narrow for the average American size.",
      "text": "Easy to inflate mat, difficult to deflate. Pillow is uncomfortable and hard to inflate and deflate. Very narrow, more for a skinny person. For larger people, with the provided snaps, This would be more comfortable if you had four, two snapped side by side, or one ontop of the other.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Perrigin",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Comfortable!",
      "text": "I bought this for my son, his comment: \"Haven't gotten to use it for camping as yet, but expect it to be comfortable when I do finally get to go.\" He did air it up and laid on it in the yard. The first one ordered leaked. Returning it was easy and ordered another to replace it.",
      "rating": 4.0,
      "verified": true,
      "author": "Butterfly Lady",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "I am happy with this mat/pad",
      "text": "Overall, I am happy with this mat/pad, but it felt a bit uncomfortable sleeping on it during my second camping trip. However, I might not have given the pad enough time to inflate properly since I was tired after a long day of hiking and wanted to fall asleep quickly. I will update this review after my third camping trip, but so far, I like this product. It is compact and it was super easy to deflate.",
      "rating": 5.0,
      "verified": true,
      "author": "Rad",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "Dissapointing",
      "text": "I was really excited for this product and slept on it for two nights this summer and I was no better off than a yoga mat. My self inflating colemans offer far more cushion.",
      "rating": 2.0,
      "verified": true,
      "author": "Erin Barela",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "I bought a second one",
      "text": "Great car camping... Maybe backpacking mat. As the headline says, I bought a second one. I'm notorious for forgetting my pillow... The built in one prevents me from having to sleep on a rock. I have two now and they snap together which is convenient.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Quality mat",
      "text": "Definitely worth the money! Nice mat, inflated to provide good support under the sleeping bag, compact, and it goes back into its carry bag without difficulty.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Reyes",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Comfortable extra padded sleeping pad for your camping trips",
      "text": "great for that added comfort with that extra padding to sleep comfortably. Self inflating. Just open the nosel located at the foor of the pad and it does all the rest. You do have to blow up the pillow though. As for deflating you have to open nosel and roll the air out and then close the nosel again to keep it deflated while in storage. Aslo comes with a travel bag and elastic securing bands to keep it from unrolling before you are ready to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia George",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Lots of comfort under a sleeping bag in a small package (Great Dane approved!)",
      "text": "We bought these to replace our old ones that our Great Danes decided were theirs on a camping trip. No ... not for sleeping ... these spoiled furkids like them for laying around outside the camper to make a soft spot to survey the camp site and people watch. We have used them for years when we tent camp and they are compact and really make a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "real gypsy girl",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Easy to Use",
      "text": "My pre-teen uses this to camp with her troop and its been perfect for her. Its easy for her to roll out and easy for her to roll up and put it away.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Mitchell",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Easy to carry",
      "text": "Bought this for camping. So easy to blow up simply by blowing air into it. The pillow and the mat are separated into two holes, so you can adjust the thickness of the pillow and the mat separately and this is so convenient. The pad is lightweight and easy to inflate. Perfect for hiking or a go bag. It held air and was fairly comfortable. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Ziqi",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Great purchase!",
      "text": "I used the mat for camping trip in Utah and in Grand Canyon and I was really happy with it. When not inflated, it’s nice and compact, doesn’t take much space in the bag. When inflated, it’s comfortable to lay on even with my back issues. The cushion was quite firm, so I deflated it a bit and it was not a problem. It’s easy to pack it back after use. Very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Nice for car camping.",
      "text": "Durable and well padded. Probably a bit heavy for back packing, but well made and packs nice. I got the inflatables pillow but would have probably preferred the one without. Air pillows just don't work for me. The snaps are nice for linking pads.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben Kickert",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Started leaking on second use",
      "text": "Product worked great the first time. Comfortable and fit perfectly in 2 person tent. But it has started leaking so every night you are on the ground by morning. I'm pretty bummed and trying find the leak so it can be patched.",
      "rating": 2.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "270lbs and 5'11\"",
      "text": "I'm a 270lbs 5'11\" man......and it is AMAZING slept very comfortable on the HARD FLOOR. The pillow does deflate a little but a neck pillow will solve that issue",
      "rating": 4.0,
      "verified": true,
      "author": "Jram179",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "This is a simple and easy to use sleeping pad",
      "text": "This is a simple and easy to use sleeping pad. Rolls up and fits back nicely into original bag. Not much for padding, but slightly softer than the floor/ground.",
      "rating": 3.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Worth buying if you limit on space and weight.",
      "text": "It did work well especially for how small it is when rolled up it's perfect for when I'm using it for, I have a small boat and I can sleep at the bow of the boat and put a cover over myself it was exactly what I needed to keep me off the fiberglass and give me a little extra comfort .",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony A.",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Keeps me warm at night !",
      "text": "It actually works! Inflating the head part is the only thing that takes a bit of work, the rest is pretty easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nima Jahromi",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "May be a good product.",
      "text": "These sleeping mats seemed to be very durable, but, they were just too bulky for our needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Comfortable",
      "text": "I got this for an overnight zoo trip wanted something that would be comfortable. This gives to just enough padding to be comfortable. My program does a lot of overnight stays where we have to sleep on the floor and I will definitely take this when I going camping. Worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Serves it's purpose.",
      "text": "Not easy to inflate unlike what is commented on in the packaging and advertising. Inflating the pillow was a bear. And it did not self inflate as stated but required me to blow into it to inflate. Comfortable enough though once inflated.",
      "rating": 4.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great backpacking pad for the price!",
      "text": "Few trips so far, no issues, insulates well and surprising comfort. Pillow was best under inflated, you might say it has adjustable firmness.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "not for small",
      "text": "pretty bulky for what it is. takes up more space than my tent. opted not to bring last trip. ill sleep on the ground if it means saving this much space in my pack for other things",
      "rating": 3.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "it's been terrific to sleep on in a tent or on top ...",
      "text": "This one is hard to beat for the price. I haven't had the opportunity to throw it on any type of rough terrain that would pose a picture hazard, however, it's been terrific to sleep on in a tent or on top of an Army cot. I *really* appreciate the pillow included. One less thing to ruck!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Very comfortable.",
      "text": "In my 40’s a sleeping pad is much more important for backpacking trips. This is lightweight, packs reasonably small and is very comfortable. It self inflated to about 80%, and you have to blow the rest of the way. Deflating is also fairly quick and easy.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hudson",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Perfect addition to my sleeping bag",
      "text": "Perfect addition to my sleeping bag. It is easy to inflate/deflate and easy to stow away. it is light enough to attach to my hiking backpack without adding too much weight to it. I'm buying more for my camping buddies.",
      "rating": 5.0,
      "verified": true,
      "author": "A1PrimeReviews",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "One Star",
      "text": "Horrible, used 1 night and pillow deflated and did not hold air anymore, would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "DRC",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Easy to use",
      "text": "Compact... Easy to use... A little thin but does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Destry C.",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Ok not great",
      "text": "Doesn’t inflate well on its own, have to manually add air.",
      "rating": 3.0,
      "verified": true,
      "author": "kristin",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Doesn’t stay inflated",
      "text": "Does not stay inflated through the night no matter what. Didn’t work the first time I even used it",
      "rating": 1.0,
      "verified": true,
      "author": "Zee",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Good Quality!",
      "text": "Quality really worth this price! Actually I bought this not for camp but for my friend who visits my school and stays in my dorm, so I didn't have a very high expectation when I choose the product. But this one is totally far better than I expected! No flaw at all. I would like to bring it with me if I go camping some day.",
      "rating": 5.0,
      "verified": true,
      "author": "Micole Wen",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "It works. What more do you want",
      "text": "It’s perfectly comfortable and easy to use. Don’t over inflate the pillow section unless you like having a sore neck. I’ve had a perfectly comfortable Nights sleep on it every time I’ve used it.",
      "rating": 5.0,
      "verified": true,
      "author": "RD1022Amazon",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Did not self inflate",
      "text": "I purchased 3 of these for a sleepover. All three did not self inflate. I was very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "they are very comfortable and extremely compact",
      "text": "I really wish we would've had this when we were camping last year with our smaller car, they are very comfortable and extremely compact. They easily compare favorably to our way bigger air mattresses (that we paid more money for) that we used last year.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt Stepp",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Very disappointed. However the mattress portion of the sleeping mat ...",
      "text": "The inflatable pillow started leaking after about 20 uses. Very disappointed. However the mattress portion of the sleeping mat is still holding up. Fits someone under 5'9\".",
      "rating": 3.0,
      "verified": true,
      "author": "Htw",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Needs a little more padding",
      "text": "It looks just like the picture, but didn't provide as much padding as I expected. Then again it was better than sleeping on the ground.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindra",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "we love to camp and this is an efficient piece of ...",
      "text": "we love to camp and this is an efficient piece of equipment we have. I love that its self inflating and it' very unique. it also works very well to keep you warm becauss it is slightly raised up a bit from the ground. overall very comfortable to sleep on and easy to carry around. 10/10 would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Tears very easily",
      "text": "Had it spread inside the house on the carpet for testing. It developed 3 small tears possibly due to something between itself and the carpet (which I couldn't find). I can't imagine this would last outdoors even for a single use.",
      "rating": 1.0,
      "verified": true,
      "author": "Vinod P.",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "It's one of those \"roll over & you're off the ...",
      "text": "It's one of those \"roll over & you're off the mat\" kind of mat. Just wasn't for me so it was returned immediately after I had opened it & tested it",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "works gret with a cot",
      "text": "Tired of sleeping on the ground, I got this pad and a cot and it worked great.",
      "rating": 4.0,
      "verified": true,
      "author": "Mer10",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Worked well for about 5 nights.",
      "text": "Got maybe 5 nights of use before a hole appeared in the seam near the nozzle so it cannot be repaired. Self Inflated well when working, was comfortable when working, but it's not longer working. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Bobby P",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Best sleep I've had camping in years!",
      "text": "Recently used this on a two day hike through a mountain train in Maine, and as a person who hates camping, this MADE my trip. It was comfortable, and super simple. I'm a big guy, 6'3\" and 280, and this had me very comfortable. It also packed light and was smaller than my last inflatable mattress (Old army one). The best feature for me as the easy pack up, it deflated in under 15 minutes, while I made breakfast. No struggle. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "P",
      "text": "Nice pad to start with... easy prep and use; However, from the get go, air would slowly leak from pad. And, after 2 weeks of use, air simply does not even stay in the pad and just goes flat within a couple of hours. Will return this pad tomorrow.",
      "rating": 1.0,
      "verified": true,
      "author": "JC1749",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Best camping/sleeping pad out there",
      "text": "This is perfect for camping or having guests over. We use it all the time. The inflating pillow is a nice bonus as well. THank you!",
      "rating": 5.0,
      "verified": true,
      "author": "rsawnti14",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Surprisingly comfortable. Self -inflating option is a really good addition",
      "text": "Surprisingly comfortable. Self -inflating option is a really good addition. The size is small enough for comfortable traveling and yet big enough to get a nice night sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Light weight warm but noisy",
      "text": "i bought this sleeping pad for this summer camping. It is comfortable even when sleeping on my side. I was very nervous that it would pop on my first couple nights, since the material is so very thin. also bad is very noisy and any movement will keep up your neighbors.It does a great job reflecting body heat back to you .",
      "rating": 5.0,
      "verified": true,
      "author": "Review",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "A good nights sleep.",
      "text": "Best Buy. Great little pad. I’ve had a few over the years and this one is the best.",
      "rating": 5.0,
      "verified": true,
      "author": "EdwardTeach",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "I love it. I am planning on a camping trip ...",
      "text": "I love it. I am planning on a camping trip with friends, so getting all the camping gears. This self-inflating sleeping mat is perfect size for me. I love the color and I can fold it in half and role it up to save storage space. The inflatable pillow saves me hassle on bringing extra pillow to the trip. great product",
      "rating": 5.0,
      "verified": true,
      "author": "Meiyan Zheng",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Light Weight Great for scouts to carry",
      "text": "It does self inflate some. However it does require you yo blow air into and close it quickly to keep it filled to the max. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "PI1Day",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Love this pad!",
      "text": "I have only given this a test run but found it works well and is comfortable. It is also to easy to deflate and repack. Compact size allows it to be carried in most packs. Kids love it so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Z",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "great value, has been durable",
      "text": "great value, has been durable. used it on 2 trips and has done well. good weight for the price. packs well.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian P.",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Good for it's price.",
      "text": "Extremely light-weighted and easy to use. My son love it. Self-inflation works not that fast yet but with additional manual blowing - good mat",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "His was great and is still performing well after several more uses",
      "text": "Seems to be hit or miss. My boyfriend and I each bought one for a camping trip. His was great and is still performing well after several more uses. Mine, on the other hand, never stayed inflated through a night.",
      "rating": 3.0,
      "verified": true,
      "author": "TheFluffinator2000",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Fantastic for the price!",
      "text": "Just got back from an overnight trip in Lake Tahoe California and used this pad for the first time. It worked great, and for the price you really can’t complain unless it doesn’t hold air.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Great product. Had an issue with one of our ...",
      "text": "Great product. Had an issue with one of our mats holding air and the company immediately responded with a new mat. Very impressive and will definitely be doing more business with SEMOO. Thank you!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Perfect for camping.",
      "text": "Perfect for camping. Bought these for my kids instead of having to fill up an air mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy S.",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Great value",
      "text": "Very good value. Had no problem sleeping on it for a few nights camping. I'm sure some more expensive ones would be more comfortable, but this is definitely a great if you are looking for something cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Meh",
      "text": "It’s barely better than sleeping without a mat at all.",
      "rating": 1.0,
      "verified": true,
      "author": "L. K. Scott",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "The pad worked great on a backpacking trip",
      "text": "The pad worked great on a backpacking trip. Easy to inflate and deflate. Fairly comfortable. You can adjust the fullness of the pillow to suit your comfort level. Very light and compact.",
      "rating": 5.0,
      "verified": true,
      "author": "Steph Stein",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Mattress and pillow were okay",
      "text": "The pillow was very uncomfortable to sleep on and the pad was not as thick as whst I wanted it to be.",
      "rating": 2.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Inflated easily; pillow inflation may be adjusted for comfort",
      "text": "Inflated easily; pillow inflation may be adjusted for comfort. It Packs relatively small and worked for well for our 14-year old daughter on our hiking trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 3 Busy Kids",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Portability",
      "text": "This is a very comfortable item, I have used it on rocks, grass, gravel, and even carpet for the heck of it. I would give it 5 stars but it takes up a lot of space even after being deflated. There should be some sort of air pump that comes with this to pull the extra air out.",
      "rating": 4.0,
      "verified": true,
      "author": "Hunter dishongh",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Good quality! Like the texture!",
      "text": "Hooray!!! My family have a plan to go to beach next month, this is gonna be part of our gear. I was afraid of stinky smell when I bought it but it turned out no smell at all! Very high quality and easy to use. It'a very comfy when laying down on it, especially light weight! I am so pleasant for my purchase. Yeaaa!!",
      "rating": 5.0,
      "verified": true,
      "author": "AA Karen",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "One is leaking",
      "text": "After using for half a year, one of them is leaking air.",
      "rating": 2.0,
      "verified": true,
      "author": "Triton822",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Where’s my straps ? Great product though",
      "text": "I love my air pad, but it’s missing the straps, where can I get my straps ?",
      "rating": 3.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Good Quality Sleeping Mat",
      "text": "Tried this sleeping pad. Self-inflation works like magic. Just leave it for an hours or so it becomes pretty well inflated. If you want it to be firmer, just blow air in it to the firmness you desired. To test out the comfort level, I put a few Lego-duplo under the mat and could seldom feel it. But it is a small size sleeping mat which fits small adult or children.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Not-really Self Inflating",
      "text": "The sleeping pad did not really self-inflate. I had to manually inflate the pad and the pillow, but once I did, the pad was fairly comfortable. It also folds up and fits back into the bag with no problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert ",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "This was a good pad. It kept me warm from the cold ...",
      "text": "This was a good pad. It kept me warm from the cold ground (coldest at night was in the 40s), and I woke up without any problems with my back.",
      "rating": 4.0,
      "verified": true,
      "author": "Derill",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Buying a padded mat is probably a better investment.",
      "text": "The air doesn't really make a difference. Not worth the price. Buying a padded mat is probably a better investment.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Good piece for hiker/biker etc",
      "text": "Needs to be a little wider for a bigger shoulder guy. Good piece for hiker/biker etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick Kearns",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Ok but no so confy as expected.",
      "text": "Ok but no so confy as expected. Next time I would tried another kind of sleeping matt, maybe a full inflating one (small to carry and -hope so- more confortable for sleeping)",
      "rating": 3.0,
      "verified": true,
      "author": "Maria D.",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Good quality",
      "text": "You have to blow up the pillows. But works just like my old ones when I was younger. Will fit in my kayak just fine",
      "rating": 5.0,
      "verified": true,
      "author": "Yasmina Morgan",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Good price",
      "text": "This is a very affordable mat. It was not that comfortable for me.",
      "rating": 3.0,
      "verified": true,
      "author": "TinyRhino",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Three Stars",
      "text": "ok, not as cushion as I thought. takes a while to deflate though.",
      "rating": 3.0,
      "verified": true,
      "author": "A. F.",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Four Stars",
      "text": "much better than dirt and stones, works easy and simple",
      "rating": 4.0,
      "verified": true,
      "author": "Tuvia Ben-Nisan",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Gift recipient seems happy.",
      "text": "I ordered this as a gift and my brother seems to like it fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Bookarian",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Nice for camping",
      "text": "The camping bed is easy to assemble, and works very well. I like the size and shape, and when I sleep on it, it’s very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Zhao Zhao",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "It's really good for crashing in the working place",
      "text": "Bought this for camping. But used it for my store too.It's really good for crashing in the working place. Looks thin but actually very soft and thick. Very helpful. Good quality . Very easy to inflate too. Of course 5 star!",
      "rating": 5.0,
      "verified": true,
      "author": "Alee",
      "helpful_votes": 2,
      "publication_date": 20170417
    },
    {
      "title": "Not a good pillow.",
      "text": "The pillow part is not a good substitute for a real pillow. The mat is fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Megakowski",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Unique yet comfortable",
      "text": "I got this to have an extra sleeping mat around the house. The self-inflating factor is unique. It's nothing like I've ever experienced before. The inflatable pillow is very comfortable as well; it cradles my head perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Su Lynn Tan",
      "helpful_votes": 0,
      "publication_date": 20170703
    }
  ],
  "product_meta": {
    "title": "SEMOO Self-Inflating Camping Sleeping Pads Lightweight Comfort 1.2 Inch Thick Water Repellent Coating Mats Great for Indoor Outdoor Backpacking Hiking",
    "rating": 4.1,
    "feature_bullets": [
      "√SELF-INFLATING DESIGN: Self-inflating/deflating free-flow valve; 1.2 inch thickness when fully inflated with inflatable pillow; Ideal for Camping, Backpacking ,Hiking, Travel & Trekking, and Picnicking",
      "√DURABLE AND COMFORTABLE: Waterproof polyester taffeta, ABS quick flow valve, high-resilience sponge filling. Vigorously massage the pad to expand when first used. For increased firmness, pad can be manually inflated by blowing into the valve. Close valve to maintain firmness",
      "√CAN BE A DOUBLE SLEEPING PAD: two mats can be buckled together to make an extra large sleeping space",
      "√LIGHTWEIGHT AND COMPACT: Compression straps for compact storage and easy transport. with package size of 16 X 7.9 X 7.9inch and package weight of 2.3 lbs",
      "√100% SATISFACTION GUARANTEE : Each of our inflatable sleeping mats has been through 72-hour leakage inspection before shipping."
    ],
    "specifications": {
      "Date First Available": "May 28, 2019",
      "Manufacturer": "SEMOO Business",
      "ASIN": "B07SC61BCQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sleeping Pads",
      "Outdoor Recreation",
      "Self-Inflating Pads",
      "Sports & Outdoors",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": 19.99
  }
}