{
  "website_summaries": [
    {
      "verdict": "The perfect model for anyone wanting the option of having a large, portable clock for a wall or desk.",
      "pros": [
        "Divides the day into five cycles for people struggling to differentiate between morning and evening",
        "Clocks comes with a battery backup in the case of a power outage",
        "Does not use batteries",
        "One-year warranty"
      ],
      "cons": [
        "Customers wish this clock had an alarm feature",
        "Dimmer than some buyers expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pretty Face, but...",
      "text": "A pretty, useful face = three stars. Timekeeping = 0. The clock loses approximately one minute per week. This clock is plugged into a decent 120 volt 60 cps domestic power line. Circuitry to drive a clock from 60 cycles/second is an inexpensive no-brainer. All my other inexpensive clocks are good to +/- 1 minute per six months.",
      "rating": 3.0,
      "verified": true,
      "author": "brutus inquisitor",
      "helpful_votes": 12,
      "publication_date": 20170928
    },
    {
      "title": "Love it...not just for seniors...",
      "text": "Gave this to my 90 yr old mother who was using the daily newspaper solely to orient herself for the day...calendars don't work if they can't determine the day. I love that this clock also gives the \"part\" of the day, especially when seniors take a nap and wake up, they don't know what time of day it is. I'm not 90 but I'm thinking about getting this clock for myself as is everyone I've shown it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 15,
      "publication_date": 20161214
    },
    {
      "title": "Really helps my mom keep days and time of day straight",
      "text": "This clock has reduced the problems my 88-year-old mother has been having keeping the days straight. It's also been a blessing because it notes the time of day: in Ohio in December, it's dark at 6 AM and 6 PM, and Mom was getting really confused. I've put one upstairs in her bedroom and another downstairs in a central location. The one in her bedroom \"coordinates\" with her 31-days-of-the-month pill box, so it helps with pill-taking, too. The day-to-day of dealing with a loved one's dementia can wear one down--no matter how much one loves the person--and even little helps like this clock provide relief. Thanks so much for developing and marketing it.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Chaucer",
      "helpful_votes": 8,
      "publication_date": 20161214
    },
    {
      "title": "Great clock for memory impaired or orientation impaired",
      "text": "This is the best dementia clock out there. There are many similar clocks, but this is the only one that says it is \"BEFORE DAWN\" after midnight and not \"morning\" or \"night\". My elderly mother gets up at 2:30am and if it said morning on the clock she would get dressed for the day. Pre dawn let's her know it's not time to get up. Everyone at her memory care unit commented how wonderful it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl S",
      "helpful_votes": 7,
      "publication_date": 20170204
    },
    {
      "title": "I LOVE this product",
      "text": "I LOVE this product. It is very easy to set. The clock is about 8\" x 7\" (the size of a standard mouse pad). If this clock was $20, I would buy several. No complaints. A very good product. I had seen one before I bought, so I knew what I was getting. You will love it also. Buy with confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180316
    },
    {
      "title": "Help put your loved ones mind at ease",
      "text": "This was recommended on a Dementia/Alzheimer’s Facebook group that I joined to assist us in caring for my father. Sadly, he wasn’t able to use it. However, we have a dear friend who was able to use it for her father after losing her mother to this challenging disease. It makes all the difference to have all this information available for them. I can only imagine how confusing and frustrating it must be to not remember the things that once were no effort to recall. I highly recommend it for anyone caring for a loved one living with the challenges that come with Dementia/Alzheimer’s.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Dansie-Janzen",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "DayClox",
      "text": "I ordered DayClox for my friend who has memory loss and it has totally changed her life and mine. Before DayClox I would receive between 5-8 calls a day asking what day it was and where she was suppose to go that day. With DayClox sitting on her kitchen table next to a large calendar she always knows what month, day and time it is. We filled in her calendar with her weekly events and now it's easy for her to look at her DayClox at the date then checking her calendar to see what she needs to do that day. She loves it. Highly recommended for people with moderate memory loss.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra L.",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Never met a clock that didn’t keep time",
      "text": "I wanted to like this clock I did. It was perfect right out of the box, then I noticed the clock losing time. I thought we had a blackout so I unplugged it and plugged it back in. Every day it would lose an hour. By day 4 I had enough of this clock. I emailed customer support to remedy the issue with the clock. By the time. Customer support got back to me I already returned it to amazon. Please read all of the reviews including the negative ones also.",
      "rating": 1.0,
      "verified": true,
      "author": "glam girl",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great! Now we know whether 6",
      "text": "Great! Now we know whether 6:00 is dinner or breakfast. Helps eliminate all the phone calls to ask what time of day it is. Helpful for dementia patients. My mother enjoys it and tells me what time it is when she calls me. Her caregiver needed one for her grandmother. Sets automatically, but does not change for daylight savings time, so there was quite a family discussion that weekend! An improvement over the ones that just tell the time. This clock is wonderful! Mom wants me to send one as a gift to all her friends! She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Product evaluation",
      "helpful_votes": 2,
      "publication_date": 20170325
    },
    {
      "title": "Searching for a clock like this for several months!!!",
      "text": "Great product for dementia patients or elderly. Mother in law, who is 90 never knew what day it was to dress accordingly, particularly on the weekend. But now she no longer seems confused about the day of the week. I like that the day of the week is listed first in bold letters so its the first thing she sees. Very Bright so she has to notice it. The digital clock that she had before had the day in bottom corner and she only noticed the time. Hoping it continues to ease her frustration at a time when her short term memory has declined.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Very Impressed!!",
      "text": "Received this afternoon and all I did was plug it in and the \"time, day, date, afternoon\" all was read easily. Purchased for my sister who suffers from dementia, as she will ask frequently for the day, date and time before taking her medications out of her pill box. Showed her where the DayClox was sitting in the living room and she was able to take her medications on her own with confidence. She was very pleased with her ability to do this task without assistance.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy Ray",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "I Know What Day It Is!!!!",
      "text": "My Mom has Alzheimer's and is lost without knowing the date and frequently calls me to know what day it is. My husband found this clock and ordered it for her. She called the day after we put it her assisted living apartment super excited. She knew exactly what day and time it was and that she could drink coffee and not go to physical therapy because it was Saturday. Thank you for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Huckeba",
      "helpful_votes": 5,
      "publication_date": 20161220
    },
    {
      "title": "Just plug it in and enjoy!",
      "text": "My dad suffers from dementia and this click has been a God send for him. After returning a similar clock of a different brand, I was sooo happy to find one that works. It is incredible how comforting it is for dementia patients to be reassured of the day, date and time (and I don't have to repeat myself ;)",
      "rating": 5.0,
      "verified": true,
      "author": "DChap",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Your elderly relative needs one (or two) of these clocks!",
      "text": "We purchased this for my 91 year old mother-in-law who lives in a skilled nursing facility. Her vision isn’t what it used to be and neither is her memory. This click enables her to read it from across the room with its large display and also tells her the day of the week. Wish we had found this 2 years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "MSPINK",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Great clock!",
      "text": "This is the second clock I’ve purchased from this company for my aging mom. Easy to read for my mom with dementia. Our first clock was purchase 5 years ago and suddenly died. Customer Service is great. I reached out to them personally and they responded timely. I would buy again and again. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "CynBur",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "What day is it?",
      "text": "This clock is a godsend. My mother has dementia and lives at home. Repeatedly during the day she tries to orient herself as to the date, time, day etc. I placed this clock within a few inches of her desk where she is able to see for herself the stats for the day. It has helped her immensely. I completely endorse this clock. It also has a timer to set for medication administration or any other need.",
      "rating": 5.0,
      "verified": true,
      "author": "Supsy500",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "A Must Have For Anyone With Memory Challenges",
      "text": "This clock gave my mom a great sense of security when she lived alone. She is very independent, but the days can run together when you are home bound. Highly - recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris P.  Bacon",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "It also has a battery back up that works great! Thank you for making such a wonderful product",
      "text": "Purchased this for my Mom for Christmas. She really likes it. With her severe vascular dementia she never can remember when what is. Living in assisted living she looses track of time. This will help her tremendously. It also has a battery back up that works great! Thank you for making such a wonderful product.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela W.",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "All the other information is displayed in a good size. I mounted it on the wall above ...",
      "text": "Very helpful in answering many of my wife's questions regarding date, day of week, etc. I wish that the date was larger. All the other information is displayed in a good size. I mounted it on the wall above the TV where she can easily see it.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 3,
      "publication_date": 20161228
    },
    {
      "title": "Great help for seniors",
      "text": "A great purchase. My mom is 93 and can’t remember the day and month. This really has helped her so she doesn’t feel so confused all the time. A great price. When we plugged it in all we had to do was set the time. The rest was set already. It looks great and came very well packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "It is a great digital clock/calendar",
      "text": "This is what I bought for my 100-year-old grandmother who has dementia. It is a great digital clock/calendar. The fact that it says MORNING, AFTERNOON and EVENING on it is so nice. It is big, not hard to read at all and has worked great ever since we plugged it in. It is nice that it lets her see what day it is, the time and also the date all in one place.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey",
      "helpful_votes": 2,
      "publication_date": 20180109
    },
    {
      "title": "Date & Time Clock",
      "text": "This was a gift for my elderly parents who sometimes have difficulty keeping track of day/date, and it's one of the best gifts they've gotten in their upper years. They are actually interested in a second one so they will have one in both ends of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Claffy",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "WORKS GREAT!",
      "text": "We purchased onefor my Dad who is in a convalescent home. He has dementia & would call at random hours during the middle of the night. He has still called a few times since we bought it, but he is not as confused on day & time like he was previously. My mother liked it so much that I bought another one for her! Definitely worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "We highly recommend this clock for anyone",
      "text": "We bought this for my mother who lives alone and has some short term memory loss. It is so helpful for her and she uses it daily. Then, our sons, one a physician saw grandma's clock and loved it. So, they are both getting them for Christmas. My husband also bought one for his office desk and gets daily comments and questions about where he bought it. It is a useful buy for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161214
    },
    {
      "title": "Get this early",
      "text": "If someone you love has memory issues ... get this early! Mom stopped the repetitive asking of what day it is... and whether it's day or night. It gave her a little confidence too when she DID know date and time without asking... placed it where she sits most often.",
      "rating": 5.0,
      "verified": true,
      "author": "Blessings Abound",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Easy!",
      "text": "I like that I was able to plug into the wall and it worked! The time/date were accurate. My elderly father got a kick out of it so I ordered one for my mother!",
      "rating": 5.0,
      "verified": true,
      "author": "cards135",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "The perfect gift",
      "text": "I bought this item for my 93 year old client for her birthday. She couldn't remember what the date or day was. Then she started getting morning time mixed with day time so this was a big help to her and she love it. Displaying day of the week time of day with morning, evening or night. Bright enough for her to see when lights are out. The perfect gift",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "What time is it? Get this clock to do find out!!",
      "text": "Easy to set up. Light weight and can stay on a bed frame with Velcro. Ideal for seniors I bought this for my own father",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "The product is wonderful when it works.",
      "text": "My girlfriend's mother loved her clock, her visitors also liked her clock. Unfortunately it stopped working in the latter part of March. It was not changing the dates, that did not help her as she is 87 years old. I am trying to see if there is a warranty or a replacement policy in effect. My purchase was in January.",
      "rating": 2.0,
      "verified": true,
      "author": "Wally Perez",
      "helpful_votes": 3,
      "publication_date": 20180331
    },
    {
      "title": "This is by far the best item I've purchased in a very long time",
      "text": "This is by far the best item I've purchased in a very long time. My mom loves her new clock. She has trouble with what day it is ect....since her stroke. This clock has taken so much confusion away from her. I absolutely love it. Keep up the good work and thank you so very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelley",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "This has been so useful for my 77 year old mother to keep up ...",
      "text": "This has been so useful for my 77 year old mother to keep up with the days and times of the week! It is large, bright, and easy to understand! Thank you for inventing this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Farquhar",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Perfect for seniors",
      "text": "My dad was getting disoriented on what time of day it was here in the northwest winter. He loves this clock and doesn’t have to ask Alexa 100 times a day what time is it?! Very easy to read with the black background",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Thank you for a product that works great for my vision impaired 83 year old mother-in-law",
      "text": "Thank you for a product that works great for my vision impaired 83 year old mother-in-law! Now she knows at a glance the time of day, am/pm, and the date. Very happy with the 2 we ordered for her.",
      "rating": 5.0,
      "verified": true,
      "author": "mpeterson",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "The clock was for a 100 yr old lady who ...",
      "text": "The clock was for a 100 yr old lady who has a mild dementia and it is a source of comfort her. It has everything she needs for a quick orientation to time and place.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith E. Stone",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Good product when my spouse had Alzhiemers",
      "text": "Good product when my spouse had Alzhiemers. That reason no longer exist but I like it. Really good at night. Must be plugged in which is a drawback.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Matson",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Brand is defective",
      "text": "Day clock are the worst. Were out of good brands. Settings are arbitrary. Even my physicist partner gave up.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Easy to read - easy to set",
      "text": "Purchased this for my 90 year old Mother. She is very happy with it. It is so easy to read and if she is napping during the day she knows instantly if it is morning or evening. This can be difficult for some people when the days are short and it is dark so much of the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindy",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Perfect for Seniors and Kids",
      "text": "Welp this thing is clear as a bell. Crisp information jumps out at you. The display is just like in the photo. Seems well built enough. It will keep the time and date even if unplugged to relocate. It came with the correct date and time (for me EST) out the box. Bought for a senior but also wouldnt be bad for a kid also.",
      "rating": 5.0,
      "verified": true,
      "author": "Smiles",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Works great so far",
      "text": "Works great so far. The electricity went out for several hours and when it was back on the clock didn't need to be re-set. My mother has some early stage dementia and this helps her know what day it is. I highly recommend this for seniors who have difficulty with memory issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "GREAT ITEM - ALL INFO ON CLOCK - Super helpful.",
      "text": "I ordered one of these for my husband, who has Alzheimers. Afterwards, I order another for myself - I can see all information at one glance, which is helpful after retirement, when the \"date\" is not repetitively before you and involved in computer entries, etc. Only wish it also ran on Batteries!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tumbleweeds",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Best product for seniors.",
      "text": "EXCELLENT product. Elderly father was having trouble with time and dates. This clock helps him track calendar days, and more importantly, morning from evening.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny Frame",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Substituted clock not as good",
      "text": "This is the second clock I purchased in like two months. After buying the first one I repurchased another one but the second one came and was a different model. The most important part of the clock for my Father was the words shown as Evening, Morning etc.and the second clock even though I hit repurchase came without that option.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "We liked this clock but it was for my 92 year ...",
      "text": "We liked this clock but it was for my 92 year old mother. She is confused with night and day. This clock goes to predawn at midnight and goes to morning at 6:00am. How many people call from midnight on predawn? I call it night. Company can not change this.",
      "rating": 4.0,
      "verified": true,
      "author": "Granny's Scrapbooks",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "This is awesome for my 91 year old mother",
      "text": "This is awesome for my 91 year old mother. Big, easy to read and can be hung on wall or placed on table, counter. Have had it only a short time but it seems well made and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "PT",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Excellent product to help as a reminder of all the ...",
      "text": "Excellent product to help as a reminder of all the aspects of time. Our father after a stroke was struggling in remembering what day it was or what time of day. He would be two days ahead or behind. This item really helped and continues to be a great tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Hansford",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Game changer",
      "text": "This clock has been such a welcome support for my elderly mom. She loves the large format and now always knows the day of the week which is quite helpful for her. Being retired hard to remember which day it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizbeth",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Great product!",
      "text": "Got this for our parents who are in their 70s. They love it especially, the day of the week. My mother has memory issues and she said she finds herself asking my dad about day of the week. Looks good in their kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine Drugan",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "... on my neighbors House and thought it would be perfect for a friend whose memory is beginning to slip ...",
      "text": "I saw this on my neighbors House and thought it would be perfect for a friend whose memory is beginning to slip and has difficulty remembering what day of the week it is.Christmas gift so I can't tell you if the recipient is asexcited about it as I am.hey if my family is reading this I would love one of these clocks",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Rooney",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "... old mom for Christmas and it has been the best thing, she can now keep track of days ...",
      "text": "I gave this to my 92 yr old mom for Christmas and it has been the best thing , she can now keep track of days as well as the time. Large enough without being annoying for guests. It was perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda M.",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Accurate and easy to read. Excellent product",
      "text": "Perfect for my mother with early dementia. Helped her know the date and time.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah S Rupp",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "We are very pleased with the DayClox",
      "text": "our 97-year old Mother LOVES the DayClox! She has macular degeneration and its the first clock she's been able to see. Also, it helps remind her what day it is and the \"morning\", \"afternoon\", and \"evening\" indicators are very helpful. The clock picked up the correct day, date and time as soon as we plugged it in - didn't have to set it. We are very pleased with the DayClox!",
      "rating": 5.0,
      "verified": true,
      "author": "Cecilia Downing Benz",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "mom's favorite!",
      "text": "This is mom's favorite! We had wished the light was more dim at night, but it's become a bit of a security/night light and hasn't seemed to impact sleep at all",
      "rating": 5.0,
      "verified": true,
      "author": "davem",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Got one for my mother-in-law and almost kept it.",
      "text": "Got this for my mother-in-law. I think my wife's going to get me one as a present. We set it up in our kitchen for a couple of days till be brought it to mom-in-law. I really do like it!! Easy to see, the day of week is handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Breaux",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "It has big numbers so she can see it easily, and she hasn't call anyone to ask \"whats ...",
      "text": "My 87 year old mom was having a hard time remembering what day it was and having to call family members to ask,so I got on line to try and find something I thought would help her , How lucky I was to find this day clock. Mom really loves it. It has big numbers so she can see it easily,and she hasn't call anyone to ask \"whats today\"!!!!!! THAT'S WHY I GIVE IT 5 STARS. MY MOM SAID THANK YOU DAY CLOCK",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Currey",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Easy to read",
      "text": "At first I thought it was to small but that was not the case. Works well for my husband who gets confused if its morning or evening.",
      "rating": 5.0,
      "verified": true,
      "author": "Michell Martin",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Date and time easily viewable",
      "text": "My mother loves this because she now knows the correct date and time at a glance and can see it across the room!",
      "rating": 5.0,
      "verified": true,
      "author": "cmj",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Already pre-set from the factory; all that is needed is to plug it in!",
      "text": "This is an excellent gift for anyone who needs to see, in large letters & #s, what day & time it is. Have bought 3 so far, for my husband (who has ALZ), mom (age 95) & aunt (age 88). They all love it; 'encourages independence. 'Especially helpful when they take their meds. Can be kept in bedroom since illumination is not too bright.",
      "rating": 5.0,
      "verified": true,
      "author": "A.M.H.",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Most useful Clock",
      "text": "This is a great clock, it is the 2nd one we have in our house. I purchased it for my Mom, but a lot of time I find it quite helpful also. Who doesn't forget the day or date?",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Junk!!!! I bought 2 and both ...",
      "text": "Junk !!!! I bought 2 and both keep freezing and going black only way to fix is to unplug them.",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry K.",
      "helpful_votes": 4,
      "publication_date": 20171120
    },
    {
      "title": "Perfect for elderly!",
      "text": "Great gift for my elderly grandmother. Helps to keep her days straight.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim M.",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Perfect Clock for Elder",
      "text": "My father is in the hospital and was having some trouble telling the time/date/part of the day. This clock helped immensely. This is such a helpful thing for anyone needing a clock with large numbers and letters.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Li Lammert",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "This is a very useful tool for her",
      "text": "Mom is now 86 years old and has Dementia, Her biggest problem is confusing daytime with nighttime, With this clock and the Day Cycles, anytime she is unsure she now just looks at her clock. This is a very useful tool for her. Something like that sounds very simple, but is sometimes a little scary for her, so having this clock is a must for her! Thanks DayClox, Al Treaedwell",
      "rating": 5.0,
      "verified": true,
      "author": "Big AL",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "and the design is good. Now",
      "text": "It works exactly as designed, and the design is good. Now, can you also get Mom to pay attention to it??",
      "rating": 4.0,
      "verified": true,
      "author": "Gary  Kurzban",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "A really useful product",
      "text": "An elderly neighbor told me recently that she was having trouble remembering what day of the week it was. I went looking for a digital clock that would tell her, and this was obviously the best choice -- clear and uncluttered, with the information she needs and nothing extraneous. I ordered it and gave it to her, and she's delighted -- as am I. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Charles L. Felsenthal",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Dayclox Memory Loss Digital Clock",
      "text": "My dad turned 87 and this was just what he needed for his 87th birthday., This is very helpful. As the time changes and daylight savings time is over he will know the difference between 5:30pm and 5:30am. (as it is dark usually at both times of the day in late fall and winter months). I have also recommended this clock to other persons who have a family member with dementia.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Great Purchase",
      "text": "Best Purchase I Have Made For My Mother!!! This clock is wonderful, and SO EASY. Easy to set, easy to read, just FANTASTIC!!! I would recommend this clock to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kym Casey",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Great for the elderly",
      "text": "Ordered for my 87 year old dad, who has slight dementia. He loves it. Keeps him from getting up too early. My Mother is grateful also! Easy to see, great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy R.",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "DayClox",
      "text": "I bought this clock for my 90 yo mother who has memory loss. Mom can now clearly see the date and the day of the week. This clock is wonderful!!",
      "rating": 5.0,
      "verified": true,
      "author": "Né",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Added Feature",
      "text": "I really do like this clock. The numbers are large and easy to read. The added feature is that it shows Morning, Afternoon, Evening and Night. This is valuable for someone who is starting to have confusion.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Rosenbaum",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Great to put by bed as it dims at 7PM",
      "text": "98 year old mother loves this clock! Can be seen from across the room and is very clear. Great to put by bed as it dims at 7PM. Not only gives time, date it tells morning, afternoon etc. No confusion!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne-Marie Katz",
      "helpful_votes": 2,
      "publication_date": 20161216
    },
    {
      "title": "Great clock bought it for my mother in law good ...",
      "text": "Great clock bought it for my mother in law good price very well made. May buy one for myself. Fast delivery to",
      "rating": 5.0,
      "verified": true,
      "author": "larry pingitor",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Greatest amount the clock world",
      "text": "This is worth every penny. Very well put together and stands out for easy reading. Not like those other squared off time face clocks. Very highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Kent",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Yes!",
      "text": "This is perfect for my Dad's house. The display is bright, clear and large enough to see well without overpowering the room. So thankful I found this!",
      "rating": 5.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Great clock for retired people",
      "text": "Love the clock when I plugged the power in it set its self... I use the clock to keep track of what day it is, the display is large so you can put it any where in the room and read clearly.",
      "rating": 5.0,
      "verified": true,
      "author": "james b.",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "It was defective and support was not easily accessible. Glad I tried again",
      "text": "This was my second try for this type of clock. The first one was a different company. It was defective and support was not easily accessible. Glad I tried again. This was a breeze to set. It does exactly what it says it does. Perfect for someone who needs help with keeping track of days and times.",
      "rating": 5.0,
      "verified": true,
      "author": "ShrewdShopper",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "I like the feature of “ glow in the dark” my ...",
      "text": "I like the feature of “ glow in the dark” my mother is Home Bound and the clock is very vibrant",
      "rating": 5.0,
      "verified": true,
      "author": "The Rose",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Love it!",
      "text": "I chose this one because of the \"before dawn\" designation for the hours between 12 AM and 6 AM. I thought it may be confusing to see \"night\" for these early morning hours as most of the memory aid clocks display. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "MRS",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Great find!",
      "text": "I got this for my dad when he moved into an assisted living facility due to dementia. It is awesome! It really helps to keep him on track with date and time. I would recommend it to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "TSue84",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Perfect for an elderly adult",
      "text": "Perfect for an elderly adult. This is just what my 88 year old mother needed to keep her straight. She loves and depends on it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy W",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Excellent product!!!",
      "text": "Excellent for the person with memory issues. Also good for anyone having difficulty keeping track of days.",
      "rating": 5.0,
      "verified": true,
      "author": "SuzieO",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Excellent clock I wish there was a place to put ...",
      "text": "Excellent clock I wish there was a place to put batteries in case the power went out but there is not it only plugs into the wall",
      "rating": 5.0,
      "verified": true,
      "author": "LThomas",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Good guality..",
      "text": "Bought for a friend... It set time and date automatically... She loves it...",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Mark",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Five Stars",
      "text": "Lasted 18 months. Lost 2 minutes per month Buy from an extended warranty !",
      "rating": 1.0,
      "verified": true,
      "author": "gs",
      "helpful_votes": 3,
      "publication_date": 20170113
    },
    {
      "title": "Great Clock",
      "text": "This clock is awesome! My mother has vascular dementia with mixed alzheimers. This clock helps her to remember what day and time it is.",
      "rating": 5.0,
      "verified": true,
      "author": "E. D. Allen",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Is a wonderful item, easy to read and understand",
      "text": "Was purchased for my 93 year old mother. Is a wonderful item, easy to read and understand. It is most helpful to her for her reminder when medicine is due.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Helton",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "great for seniors",
      "text": "great for my father who has dementia. when he asks what the time is or day we tell him to check his clock.",
      "rating": 5.0,
      "verified": true,
      "author": "lzstll",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "This DayClox is a bright and easy-to-read addition to our home!",
      "text": "Fast and easy set-up ... Within minutes out-of-the-box, you can have it keeping you informed! Easy-to-see at anytime of the day!",
      "rating": 5.0,
      "verified": true,
      "author": "BJC",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Buyer be aware.",
      "text": "We were very happy with this product for 6 weeks when it suddenly went blank - and nothing we can do can get it started again. Sent an e-mail to GeriGuard and never heard back from them. You should be very cautious when considering this product.",
      "rating": 5.0,
      "verified": true,
      "author": "KER",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Great Product.",
      "text": "Just had to plug it in. Didn't even have to set the time. Looks great. Very clear to read with the white against the black. I really think this will help.",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Five Stars",
      "text": "My 92 year old mother loves it, and so do I.",
      "rating": 5.0,
      "verified": true,
      "author": "veejay",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "It does not change automatically at Daylight savings time.",
      "text": "Bought it for my 91 year old Mom. It's helpful as long as she remembers to look at it!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan S",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Bought for my Sister-in-law who is in the beginning stages ...",
      "text": "Bought for my Sister-in-law who is in the beginning stages of Dementia. So far it has been a tremendous help.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward J. Hickman",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Wonderful clock for anyone",
      "text": "This clock is awesome for everyone! Big numbers and bright enough to see easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Candace K Mirman",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "They love that they can see the clock from multiply rooms ...",
      "text": "Bought as a gift for my Sr. parents. They love that they can see the clock from multiply rooms in their house!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "I love the clock",
      "text": "I love the clock, it gives a good touch to the room. I would like if it included radio or had more functions, but it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "laura",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Excellent product. Very happy with it",
      "text": "Excellent product. Very happy with it. No I can just tell Mom to look at the clock instead of repeatedly telling her the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Dalton",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "What was really wonderful was, I opened the box",
      "text": "This has really helped our 96 year old grandmother that lives with us. What was really wonderful was, I opened the box, everything was already set up with time etc. All I had to do was plug it in!",
      "rating": 5.0,
      "verified": true,
      "author": "S. J. Mundorf",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Five Stars",
      "text": "Perfect for my mother that has some problems remembering dates and times.",
      "rating": 5.0,
      "verified": true,
      "author": "jmks",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "It is a very good clock for my husband",
      "text": "It is a very good clock for my husband. I just hope I don't have to replace it every year. This is a replacement one because the other one we had (1 of 2) the screen went black, out. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Reside",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Mom loves them. Bought two, one for the ...",
      "text": "Mom loves them. Bought two, one for the bedroom and one for the family room on top of the TV. Has partially reduced mom asking, \"What day is it?\"",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Biesiada",
      "helpful_votes": 0,
      "publication_date": 20180210
    }
  ],
  "product_meta": {
    "title": "DayClox Updated Memory Loss Digital Calendar Day Clock with Day Cycles & Battery Backup",
    "description": "What makes this DayClox memory loss digital calendar day cycle clock so unique is that both the day and the month are fully spelled out, along with the cycle of the day! Many elders suffering from memory loss due to stroke, dementia, Alzheimer's or just advancing years, may have difficulty processing abbreviated words. Most clocks available today will abbreviate the month & the day. For example, November becomes Nov & February is Feb. The same is true for days of the week - Wednesday, is often displayed as Wed & Saturday as sat. This may be fine for the rest of the population, but for our loved ones with dementia, early stages Alzheimer's or just simple advancing years, these abbreviations are often too confusing to process. This day clock displays complete words only, no abbreviations. This clock bold and clear display is a great for elderly or vision impaired. This quiet reminder clock or 8\" digital calendar day clock has the clearest & easiest to read display available. This clock has everything! It displays the full day, cycle of the day, time & date and it's not just for people with memory loss or as a dementia aid. Anyone can enjoy this wonderful clock. It makes a great gift. It's sleek & contemporary design will look great anywhere in your home or office, sitting on your desk or counter or wall mounted for everyone to enjoy. The dementia clock can be viewed as a dementia aid, dementia product or even an Alzheimer's product. It assists dementia patients or early state Alzheimer's patients. This day clock is a self-help tool for people who get confused with abbreviations & with am & pm notations. With no confusing abbreviations. Many seniors suffering from memory loss due to dementia, stroke, Alzheimer's or just advancing years, often have difficulty processing abbreviated words. The preset cycle’s times are: Morning 6:00 am - 11:59 am / afternoon 12:00 noon - 4:59 pm / evening 5:00pm - 8:59 pm / night 9:00pm - 11:59 pm / before dawn 12:00 midnight - 5:59 am.",
    "rating": 4.7,
    "feature_bullets": [
      "This DAYCLOX unique 5 CYCLE DIGITAL CALENDAR DAY CLOCK clearly spells out the full DAY of the Week, CYCLE of the Day, MONTH and DATE in large, bold letters - with no confusing abbreviations. Many seniors suffering from memory loss due to dementia, stroke, Alzheimer's or just advancing years, often have difficulty processing abbreviated words.",
      "Each day is divided into 5 CYCLES, MORNING, AFTERNOON, EVENING, NIGHT & BEFORE DAWN which is perfect for those struggling to differentiate between AM & PM notations. The preset Cycles Times are: Morning 6:00am – 11:59 am / Afternoon 12:00 Noon – 4:59 pm / Evening 5:00pm – 8:59 pm / Night 9:00pm – 11:59 pm / Before Dawn 12:00 midnight – 5:59 am.",
      "BATTERY BACKUP - in the event of a loss of power to the clock, the clock will maintain the correct time internally, without displaying during outages.The accurate time will then display correctly after power is restored or the clock is plugged back in. Clock will clearly display the words BEFORE DAWN from Midnight – 5:59 am. Most other clocks will either display ‘MORNING’, which may result in many seniors getting out of bed to start their day in the wee hours of night.",
      "Great for the ELDERLY, the VISUALLY IMPAIRED & people with Macular Degeneration. The sharp, non-glare clear display can be seen from across the room. IDEAL CLOCK FOR PEOPLE OF ALL AGES! The words Dementia, Alzheimer's or Memory Loss are ‘not’ printed on the clock itself so it makes a great gift for those special loved ones, especially Grandma & Grandpa. It is quickly becoming a perfect Senior Care and In Home Care necessity.",
      "Available in ENGLISH only. Overall Dimensions: 8.5\" wide x 6.75\" high x 1\" deep (4.5\" deep with Kickstand) 8\" diagonal display screen. Can be easily set to 12 hour or 24 hr (Military Time). This Memory Loss Digital Calendar Day Cycle clock can be used as a Desk clock or Wall clock. The clock requires an A/C adapter (US adapter included) to operate. Does not run on batteries. One Year US warranty - void when used outside USA."
    ],
    "specifications": {
      "Product Dimensions": "12.7 x 8.1 x 2.4 inches",
      "Item Weight": "1.35 pounds",
      "Manufacturer": "DayClox",
      "ASIN": "B01M648TWR",
      "Item model number": "3512709",
      "Customer Reviews": "4.7 out of 5 stars322 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#366,415 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specification met": "Certified frustration-free",
      "Warranty Description": "Contact seller for full details of clock's 1 year limited. Warranty is void when clock is used outside of the usa.",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Home Décor",
      "Clocks"
    ],
    "price": 52.95
  }
}