{
  "website_summaries": [
    {
      "verdict": "Great starter kit for younger users and casual hobbyists. Does not have the sensitivity of other models, but will still discriminate between valuable metals and junk.",
      "pros": [
        "Minimal assembly and instruction required",
        "Lightweight, ideal for younger users",
        "Easy-to-read display"
      ],
      "cons": [
        "Does not feature a pinpoint function",
        "Must be protected from harsher weather/elements"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Functional and Versatile",
      "text": "As a beginner's model, this detector is perfect. It offers a host of unique features and it is well suited for someone who is just becoming involved in such a hobby. The use of high-quality materials, a lightweight feel and an ergonomic design round out the benefits. I am also very happy to state that I have already found a host of coins and other items. Considering that I have only had this detector for two months, I could not be happier. I would definitely recommend this unit to anyone who is looking for a cost-effective and yet powerful metal detector.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 51,
      "publication_date": 20180308
    },
    {
      "title": "Great Metal Detector for starting out",
      "text": "PRO:Great Metal Detector for starting out. worked good at the beach easy to use and assembly. Audible signals are extreemly clear on coin and jewelry targets CON:: Never let internal parts get exposed to the elements, must be kept dry and dust free.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Novello",
      "helpful_votes": 59,
      "publication_date": 20170828
    },
    {
      "title": "Beginner, likes her first metal detector",
      "text": "Hi, just opened and put together. Took about 15 min . Fairly easy to assemble. Was reading instructions s , when family member \"jumped the gun\" and took it outside without finishing g instructions . Within minutes found a nail, a piece of tin trash, and an old triangular piece of iron . That's without knowing anything! Just read instructions and will go back outside and try again! I really like it and am very excited to \"treasure hunt\" on my four acres! Great product with my limited knowledge and experience for under $200.00!",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Paquette /Scott Southworth",
      "helpful_votes": 64,
      "publication_date": 20170813
    },
    {
      "title": "Good first metal detector",
      "text": "Nice little device, works very well for me. It's not supposed to be used near salt water, but I had it on the beach in NH and was finding things (mostly pieces of lobster traps) fairly well, even in damp sand. It went a little nuts near the salt water. Haven't found anything great yet, but it keeps me busy at the beach.",
      "rating": 4.0,
      "verified": true,
      "author": "toria82",
      "helpful_votes": 25,
      "publication_date": 20171021
    },
    {
      "title": "Works 80% of the time",
      "text": "Detects a good amount of traces correctly but also 20% of the time it doesn't and you find there to be absolutely nothing. That can be frustrating, especially if you just spent 30 minutes digging up dirt like the movie \"Holes\" just to left without any reward...not even a small one.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean P.",
      "helpful_votes": 18,
      "publication_date": 20180522
    },
    {
      "title": "Great for it's price range",
      "text": "Great for it's price range. Easy to use. Quite effective. I do wish that it had a pinpointing function like the Ace 300 but a handheld pointer solves that issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Donnie Fulwood",
      "helpful_votes": 46,
      "publication_date": 20170212
    },
    {
      "title": "Five Stars",
      "text": "This detector works great love the ear phones makes it easy to locate items",
      "rating": 5.0,
      "verified": true,
      "author": "Red Mare",
      "helpful_votes": 19,
      "publication_date": 20170429
    },
    {
      "title": "Nice product for the money.",
      "text": "Detector arrived fast well boxed. Extremely easy to assemble batteries were included. Very lightweight for carrying , display is easy to understand I plan on using the detector this weekend very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ohio Rose.",
      "helpful_votes": 38,
      "publication_date": 20170113
    },
    {
      "title": "Missing headphones",
      "text": "I just received mine today I was excited to get it open and set up. There are no headphones and the coils is super loose. I tried to contact seller I just got a return option. I just want the headphones.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole Oria",
      "helpful_votes": 8,
      "publication_date": 20180601
    },
    {
      "title": "GREAT metal detector for beginners 👍🏼👍🏼👍🏼👌🏼👌🏼👌🏼",
      "text": "Awsome Awsome Awsome I luv my Garrett ace 200 it was well worth the money I’ve had it like 2 months now and already found gold ring and silver jewelry and even some civil war era 3 ringer bullets 👍🏼👍🏼👍🏼 I would strongly recommend for beginner Detectors..",
      "rating": 5.0,
      "verified": true,
      "author": "Josephine Saucillo",
      "helpful_votes": 5,
      "publication_date": 20190512
    },
    {
      "title": "Very nice and easy to understand and use.",
      "text": "This is a great way to get started in metal detecting. I haven't been able to get out with it much due to weather but it didn't take long to familiarize myself with it and understand it. I can't wait for the weather to warm up soon and take it out again. Update: it works really well, I took it down to the river and it gets it pretty close to the object but it was difficult to find everything I detected, so I purchased a pinpoint detector but haven't had a chance to take it out yet. I am still very happy with this detector.",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy Bunton",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Great product!",
      "text": "Product has met it's description. It's light enough to use without having to take a break. It's depth was greater than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Mersdorf",
      "helpful_votes": 4,
      "publication_date": 20180627
    },
    {
      "title": "Excellent choice, if you want a bargain",
      "text": "This detector will find you a tub full of relics !!! Excellent choice, if you want a bargain price",
      "rating": 5.0,
      "verified": true,
      "author": "a. g. johnston",
      "helpful_votes": 5,
      "publication_date": 20180210
    },
    {
      "title": "Disappointed",
      "text": "Works good but too many regulations about where they can be used.",
      "rating": 3.0,
      "verified": true,
      "author": "Laversa Carlin",
      "helpful_votes": 4,
      "publication_date": 20180812
    },
    {
      "title": "Having a great time.",
      "text": "Good product for a beginner. Simple to use and accurate.",
      "rating": 4.0,
      "verified": true,
      "author": "Rappopo",
      "helpful_votes": 4,
      "publication_date": 20180516
    },
    {
      "title": "Problem with the extension",
      "text": "I had a problem with the extension so I called the company and asked for a manual and a replacement part. I received the manual but not the replacement part. I finally got the extension to release so I could complete the assembly. The unit seems to work ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Willie L. Puckett",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Even detects, wood, air, human, stone",
      "text": "This thing goes off everywhere. Wood, air, stone, human, metal. This is real junk I hope it was a defective one. I'm sending this worthless garbage back. I hope the other one isn't as horrible",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Mirra",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Spot On!",
      "text": "Husband purchased this to help locate tools and parts strewn across a hay field after a storm blew down two large buildings. He found it to work well and easy to operate. What more can you ask for?",
      "rating": 5.0,
      "verified": true,
      "author": "karen h",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Awesome!!!",
      "text": "Great detector!. Haved used various models over the years, this Garrett is easy to use, sensitive enough and great for the beginner to advanced digger. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181016
    },
    {
      "title": "Easy and fun to use.",
      "text": "I recently had a new roof put on my house. I first used a rolling magnet to pick up roofing tacks and nails. With the metal detector, I found many hidden in the grass and in the flower beds around the house. Now I am ready to find some real treasure!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven L. Hentzelman",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Good buy for the price",
      "text": "I bought this for myself as I was wanting to get into metal detecting. Easy to put together and operate. The first time I used it I found two civil war artifacts.",
      "rating": 4.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Not cheap material",
      "text": "Easy to use reliable my grandkids love it and its durable. Ive bought two of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Vernice",
      "helpful_votes": 2,
      "publication_date": 20190106
    },
    {
      "title": "Headphone in cheap",
      "text": "Headphone in cheap. The wire was cut when delivered. The Detector works great.",
      "rating": 3.0,
      "verified": true,
      "author": "scott kelley",
      "helpful_votes": 4,
      "publication_date": 20180412
    },
    {
      "title": "User Friendly Metal Detector big hit with Eight year old!",
      "text": "Got this for my eight year old son for Christmas. It was easy to assemble and set up and he was put with on Christmas Day! So many cool features and he has taken to taking it out in the yard by himself. Looking forward to the spring thaw for even better hunting!",
      "rating": 4.0,
      "verified": true,
      "author": "Film buff in NY",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Unsure",
      "text": "Haven’t given it yet it’s a Christmas gift but the box is all beat up and honestly making me nervous that the product will be the same!",
      "rating": 3.0,
      "verified": true,
      "author": "Rochele",
      "helpful_votes": 2,
      "publication_date": 20181209
    },
    {
      "title": "Awesome!",
      "text": "Bought this for my son for his birthday and he loves it. He uses it all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Well made and easy to use",
      "text": "Great starter bundle!! Easy to use and tons of fun!! Well made too.",
      "rating": 5.0,
      "verified": true,
      "author": "DrMarioPepper",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Did not get what I paid for!",
      "text": "Product seams to be good and as advertised on problem with products. Seller on the other hand advertised as having headlights upon opening there were no headphones.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Daulton",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "It seems well made",
      "text": "So far I haven’t found my fortune but love the anticipation. Just got it but I see many adventures in my future.",
      "rating": 5.0,
      "verified": true,
      "author": "sharon Feathers",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Good buy",
      "text": "Daughter bought this. She loves it. Found a few coins on the beach and some other metal objects.",
      "rating": 5.0,
      "verified": true,
      "author": "m_bnielsen",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "worst detector I ever owned. depth indicator is very inacurate and impossible to x spot",
      "text": "Its light weight that's all I can say about it. I regret the purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Baker",
      "helpful_votes": 2,
      "publication_date": 20190709
    },
    {
      "title": "Don.t work",
      "text": "I was very dissapointed in this product, it would not fine a dime, penny, nothing. I tried several new batters",
      "rating": 1.0,
      "verified": true,
      "author": "Baseball King",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Good product",
      "text": "Still learning how to use it but it did pass a few test runs on known targets at different depths. Glad I chose to spend the extra money to get the brand vs a cheaper one and can’t wait to hit a beach some where",
      "rating": 4.0,
      "verified": true,
      "author": "David otten",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Excellent quality machine",
      "text": "Well packaged, quick delivery. This was a gift for my significant other and she loved it! It’s perfect for a beginner or intermediate user. She’s already used it at a local park and found a treasure trove of bottle caps, pull tabs and antique nails😀",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Camper",
      "helpful_votes": 6,
      "publication_date": 20180206
    },
    {
      "title": "buy it",
      "text": "But it, you won't be disappointed...unless you're are not new to the hobby then I suggest you go up a few pay ranges.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "works good.  Nice screen easy to read.",
      "text": "Works everytime. We found survey rods buried on land. located pipes and went treasure hunting. Found a few coins and old farm tools. Nice buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce Surbaugh",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "A gift for a 9 year old for Christmas",
      "text": "A perfect gift. The 9 year old uses the metal detector frequently and looks forward to using it at the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Tinsley",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "practice with different items",
      "text": "lite weight, easy to assemble takes a little practice to distinguish different items",
      "rating": 4.0,
      "verified": true,
      "author": "paul szarowicz",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "This metal detector has met my needs. I’m new ...",
      "text": "This metal detector has met my needs. I’m new to it all but it found me several quarters and even a ring the first time I used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Five Stars",
      "text": "If your using if just for fun very much worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Go ahead and buy a pinpointer too",
      "text": "I bought this for a gift to my wife. She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Five Stars",
      "text": "I like Garrett It's dependable and it really suits my needs good starter.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Tapley",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great product!",
      "text": "This was a gift for my boyfriend. He put it together in no time and started using it right away. He loves it and can't wait to use it this weekend on our weekend trip to the mountains.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie J.",
      "helpful_votes": 3,
      "publication_date": 20170525
    },
    {
      "title": "Works well.",
      "text": "My husband and grandson use this all the time. We did end up buying the pointer later on.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn2671",
      "helpful_votes": 3,
      "publication_date": 20171226
    },
    {
      "title": "Five Stars",
      "text": "Bought it as a gift which was a big hit.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 2,
      "publication_date": 20170829
    },
    {
      "title": "Looks like child’s toy",
      "text": "Not worth the money. Looks like a child’s toy. Came unsealed and open upon delivery. Unsure if we received everything. I would not waste your money.",
      "rating": 2.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 4,
      "publication_date": 20171208
    },
    {
      "title": "Five Stars",
      "text": "Used it in a \"test\" mode to recognize the display and sounds and it worked.",
      "rating": 5.0,
      "verified": true,
      "author": "daddy-o",
      "helpful_votes": 2,
      "publication_date": 20170925
    },
    {
      "title": "Enjoyable hobby",
      "text": "Having fun finding things and for the price well worth getting as a starter.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Hunting for treasures",
      "text": "This was a Christmas gift for my 12 year old grandson and he loves it ....he used it Christmas day and I now have several holes in my yard lol hunting for treasures...I wanted to get him outside again and this is just what it took to do the job....thank you...",
      "rating": 5.0,
      "verified": true,
      "author": "Staciew",
      "helpful_votes": 20,
      "publication_date": 20161226
    },
    {
      "title": "Perfect",
      "text": "Perfect for a beginner like me simple and easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Lee Payton II",
      "helpful_votes": 11,
      "publication_date": 20170329
    },
    {
      "title": "Five Stars",
      "text": "My grandson loved this gift and cannot wait to use it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "... first metal detector and so far everything is working great. Its easy to use and seems to be ...",
      "text": "This is my son's first metal detector and so far everything is working great. Its easy to use and seems to be pretty sensitive in finding objects. We'' be putting it to the test this week in the mountains and next month at the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank L Ducar",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Garrett ACE 200 Metl Detector",
      "text": "this was a Christmas gift and was loved. she went out and used it soon after opening it.",
      "rating": 5.0,
      "verified": true,
      "author": "SaLarr",
      "helpful_votes": 6,
      "publication_date": 20161226
    }
  ],
  "product_meta": {
    "title": "Garrett ACE 200 Metal Detector with Waterproof Search Coil and Treasure Sound Headphone",
    "description": "Size:ACE 200 w/ HeadphoneGarrett ACE 200 Metal Detector with 6.5\" x 9\" Waterproof Coil, Garrett Treasure Sound Headphones, Instruction Manual, Batteries and a Two-Year Warranty. \n\nWith the quality and performance of the ACE 200, you can begin finding treasure right away, in your own backyard or wherever you travel. \n\nThis lightweight, easy to use metal detector is ideal for Coin Hunting, Dry Beach Hunting and Fresh Water Hunting. \n\nWith the quality and performance of the ACE 200, you can begin finding treasure right away, in your own backyard or wherever you travel. Easy to use for any age!",
    "rating": 4.5,
    "feature_bullets": [
      "Garrett ACE 200 Metal Detector with 6.5\" x 9\" Waterproof Coil, Garrett Treasure Sound Headphones, Instruction Manual, Batteries, and a Two-Year Warranty",
      "New Digital Target ID: 0 to 99 scale offers target information",
      "New Camlocks for increased stem stability",
      "New Includes Pulse-Width Modulation audio: sharper, more responsive audio",
      "Light weight with big performance at a small price"
    ],
    "specifications": {
      "Product Dimensions": "5.98 x 5 x 9.02 inches",
      "Item Weight": "5.09 pounds",
      "Manufacturer": "Garrett",
      "ASIN": "B01M19DMVN",
      "Batteries": "4 AA batteries required.",
      "Customer Reviews": "4.5 out of 5 stars229 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#37,375 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Metal Detectors",
      "Outdoor Power Tools",
      "Garden & Outdoor"
    ],
    "price": 185.9
  }
}