{
  "website_summaries": [
    {
      "verdict": "Earns the top spot on our list for its exceptional light, no-hassle installation, and commercial-grade construction.",
      "pros": [
        "Solid build, perfectly bright light, and simple installation",
        "Light appears brighter than others models, including fluorescents",
        "Links easily to others if you need more than one"
      ],
      "cons": [
        "The pull chain seems a bit short"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pleased with purchase",
      "text": "Ordered 8 of these for my pole barn (40' x 32'). All 8 arrived in good shape. Installed them today. Install was easy, lit up the barn well. Pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "J I",
      "helpful_votes": 23,
      "publication_date": 20170728
    },
    {
      "title": "Reliability issues and no established RMA process",
      "text": "I bought 3 of these lights and was very happy with the amount of light and ease of installation. After a few months of very light use I am now seeing two of the lights have flickering bulbs and today one of the lights has a dead bulb. Update: the warranty on these lights is supposedly 5 years. I contacted the seller about warranty, they asked me what was wrong, I responded, and now nothing. It appears they have no intention of making good on the product warranty. Update2: contacted that manufacturer (vasled.com) and got the same response - nothing. The warranty is a lie.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Mattioni",
      "helpful_votes": 49,
      "publication_date": 20180617
    },
    {
      "title": "Let there be light....",
      "text": "OK, our project was a 2400 Sq. ft. shop area. I bought 3 different makes of lights and settled on these as the best. The only thing I wish was different was how they link. Another brand had different cords and connectors to link them, even allowing them to be flush with each other. That being said, we flush mounted these to the ceiling leaving about an 8\" gap between lights and strapped the extra cord out of the way. Their design made this easy to do. Shop now has plenty of light! Out of the 28 lights, only one was damaged and that being only slightly damaged. Yes we would use these again.",
      "rating": 4.0,
      "verified": true,
      "author": "David Kozlowski",
      "helpful_votes": 4,
      "publication_date": 20171008
    },
    {
      "title": "These are awesome.",
      "text": "These are awesome. I wanted LED light fixtures to replace 300w halogen fixtures (2x 150w halogen bulbs) over the work benches in the garage. Both these LEDs and the halogen fixtures are nominal 4800 lumens. These LEDs are much bluer than the halogens (the 5000k bulbs I was looking for) and appear to be throwing far more light, even though the lumen ratings are equal. Disregard the mess on the work bench, and look at the light output. I liked the first one so much, directly after I took the photo, I ordered a second, to replace the left-hand halogen in the photo below.",
      "rating": 5.0,
      "verified": true,
      "author": "D. P. Long",
      "helpful_votes": 2,
      "publication_date": 20170901
    },
    {
      "title": "Perfect for fluorescent shop light replacement",
      "text": "Includes all hanging hardware. Easy to set up; Has VERY bright light (says 4800 lumens and it looks it). Color is on the white end of the spectrum (5000 kelvin) which for my aging eyes doing work at my work bench is very helpful. I hung them very high up near my garage ceiling and it works perfectly to illuminate everything underneath. Some may find it too much like the light in an operating room, that is, bright rather than warm. Installed two linked together to substitute for fluorescent shop lights in my unheated garage and I couldn't be happier. Near instant on regardless of temperature. If like other LED lights, will last longer that I will.",
      "rating": 5.0,
      "verified": true,
      "author": "dmichael",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Bright",
      "text": "These lights are bright and light weight. Just changed out the old fluorescent 4 foot light fixtures with new Led models more light a ton less power and no buzzing. What's not to love? I highly recommend these lights for all the above reasons. I had ordered a different brand and had to send them back because of shipping damage. Thes four-foot lights come well packaged and were delivered on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike L",
      "helpful_votes": 2,
      "publication_date": 20170508
    },
    {
      "title": "Great shop and garage light.",
      "text": "LIght weight, plastic vs the usual metal fixture. As simple as can be, two very bright shop lights in a fixture. Comes with a chain. I am especially pleased (reason I picked this one) with the AC plug on the opposite end for connecting several together. Quality is very nice. NOW, how long will it last? I'll write back if it dies too soon. I expect to get years of service from this light, and I'll be buying more. 2018-05-22 Update - I bought another one. Nice light at a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "John R. Welch",
      "helpful_votes": 2,
      "publication_date": 20171003
    },
    {
      "title": "As advertised",
      "text": "The lights are as advertised. Bright and straightforward to install and use. I purchased two of them to replace two incandescent ceiling lights in the garage. From night to day. The only two critiques I'd offer would be (1) have somebody whose first language is English redo the paperwork that comes with the lights and (2) replace the chains and hooks with something more substantial. I realize that these lights are lightweight (in pounds and ounces) and that the chains and hooks are adequate for the job, but they are... cheezie. Other than that, all good.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Mellott",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Nice light, but not quite as advertised",
      "text": "Very bright, pretty much like daylight. Knocked off a star for two reasons - (1) one of the provided chains had a link break, it just pulled apart at the seam when I was trying to raise the light higher. Maybe earlier models came with decent mounting hardware, but the ones currently shipping do not! Also (2), I guess this might be standard, but the outlet on the light is not controlled by the pull chain - so if you want to link up a bunch of shop lights and expect to illuminate the entire work space with a single switch throw, then wire them all centrally or look for another product.",
      "rating": 4.0,
      "verified": true,
      "author": "The Third Bird",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Easy to mount and light up the work area",
      "text": "My ceiling is standard drywall. I needed to flush mount the lights and wanted to anchor them into studs. This basically meant that I couldn't use the hardware provided to attach the lights. I basically had to create new holes 24\" apart in the aluminum housing and screw them directly through the drywall into the ceiling joists. This was a simple operation and much easier than trying to line up the pre-drilled holes and using the plastic anchors provided. Lights went up in no time and work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D. Tracy",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "WOW! To coin a phrase from a movie \"Bright Light\"",
      "text": "I finally got around to installing these. Simple enough as power and hanging hooks already in place. ONE was brighter than the two fluorescent shop lights. I put another next to the first and wrapped the cord with a zip tie. I put up the third and now I can see very well. actually too well. Now I have to clean better. I turn off the third unless I'm doing work in that part of the garage. The units are very light and easy to install. Now to see how long they last. I'm going to convert the fluorescent to LED tubes. Seems easy enough. Added photos but I don't think it will show as good as live.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Young",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Great Product. Arrived quickly",
      "text": "Great Product. Arrived quickly,well packaged. These are the best thing to happen since sliced bread. I unpacked and had all 4 of these installed in my shop in no time.. Love the light weight and chains to hang them with. Just plug into outlet and have great light. These are really great for me as I'm retired and being able to have great light is wonderful. My brother is going to replace his lights in his garage with these after checking mine out.. Really are great lights and I don't think I went wrong with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Milholen",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Work well! Nice and bright!!",
      "text": "I got them at A discount through A tech bargains web site I subscribe to so they were only about 35 buck's per light. Well worth the price. Put them in my pole barn to replace the 10 200W incandescent lights I had in there. Better lighting and cheaper to run. In addition I don't have to drag out A ladder to change A bulb 5 or6 times A year.With 14 foot sidewalls and being 65 Y.O. acrobatics I don't need! When I see A good sale online I will buy 8 or 10 more for the other side of the barn.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Ronan",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "I think they are awesome lights. I purchase 2 to test",
      "text": "I think they are awesome lights. I purchase 2 to test. Purchased 2 more after I installed them. They are so bright and easy to hang are screw the to the beams. I recently ordered another for another project. I will be getting 2 more. Here are some before and after with only 1 light.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 4,
      "publication_date": 20171127
    },
    {
      "title": "Great lights!",
      "text": "This lighting is perfect for my garage workshop! There is one small thing that kept it from a 5 star. The anchors provided are really crappy. I had read this in previous reviews so I was prepared with my own. The chain and clips provided are nice and sturdy though. I wish the pull chains and electrical cords were a bit longer, but again, I can fix that. They put out a really great amount of light. I put 2 across the front of my 2 car garage and will be adding 2 more in the back.",
      "rating": 4.0,
      "verified": true,
      "author": "Michele Fisher",
      "helpful_votes": 3,
      "publication_date": 20170425
    },
    {
      "title": "And Bam! It was lit like it was outside.",
      "text": "Again Bernon was Wowed... he had CFLs mounted overhead in his garage and whereas they provided light, not enough to make working on the bench a good thing... All that has changed with the introduction of this LED shop light he mounted above his bench. No more second guessing whether that was a 45° or a 22.5° cut he was suppose to make.",
      "rating": 5.0,
      "verified": true,
      "author": "Buzz",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "A very good product with easy installation",
      "text": "I purchased this light for the easy installation of using the standard plug in. I will screw in a small male / female plug in existing light sockets and plug'er up. I like the metal two hole hardware hangers along with the chain already assembled (and with clips) for hanging. I haven't installed it as it, but I have taken it from the box to check it out. I plugged it to an electrical outlet and was nicely surprised at the led light improvement from what I presently have. I purchased this light for a trial run and I am sure I will be ordering more.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry M.",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Flickering.",
      "text": "This light keeps flickering and you can not change the bulb. This is my second light, to be fair the first time the company French May replaced it but this time I am still waiting for them to contact me after I sent them an email. If they stand behind their product I would buy again but if not I WOULD NOT.",
      "rating": 1.0,
      "verified": true,
      "author": "ROBBIE R.",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Metal mounting holes instead of soft pvc.",
      "text": "Light is very bright, just as I expected. After purchasing another brand that was just as bright I noticed the other brand's mounting point for the chains was the plastic or pvc light ends. I did not like that. The Linkable LED light mounting point is the metal body itself instead of the softer ends. So, the metal chain mounting points is what sold me. I would have given this light 5 stars except for one negative thing about this light, a short cord. This cord looks like about 4ft. and I had to buy an extension. It should have at least a 6 foot cord in my opinion.",
      "rating": 4.0,
      "verified": true,
      "author": "RGonzales",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "It works...",
      "text": "The lights work. I had purchased the same ones last year and needed a few more for the shop. The last ones were better. Mounting hardware has changed slightly and is cheaper quality. The issue is these new ones all slightly hum or buzz at times. Others notice it. It's not overly loud and doesn't appear to affect the light output. Other than that they're exact copies of previous ones. I assume the manufacturer changed to a cheaper driver board for these to increase profit. it i hadn't installed them already I would return them.",
      "rating": 2.0,
      "verified": true,
      "author": "gamecock88",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Super lighting and great customer service!",
      "text": "These lights are top notch from illumination right on down to the hardware package that is included. Superior to T8 bulb replacements. This is a ready to go assembly. Simply hang and plug in. Well constructed. I ordered another immediately after installing the first. Terrific lighting for basement, garage, or work area. And excellent customer service. They are with you from order placement to follow up after delivery. And a great value at that. I'll be replacing any remaining incandescent or fluorescent lighting in our basement with these. Nice to have great lighting at a great price. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "bigwig",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Best overall shop light in comparable 40w applications",
      "text": "After experimenting with several brands and variants of linkable LED shop lights like these (Feit Electric, Sunco, etc) for my garage, I determined this to be the brightest and best overall \"quality of light\" for my purposes - vehicle washing, detailing, and general maintenance. I tried other options with similar lumen ratings, but preferred this fixtures \"shade\" of light, despite the slightly higher price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "The perfect utility shop light",
      "text": "This is the best purchase I could have made for my garage. The old fluorescent tube lights were just a pain - never worked properly. The LED Utility Shop Light took all of 5, maybe 10 minutes at most to unpack, install and turn on, and it works beautifully. I almost wish I needed more that one, just so that I could have the pleasure of installing another one. Oh - and the garage is so well lit now!",
      "rating": 5.0,
      "verified": true,
      "author": "Expat",
      "helpful_votes": 2,
      "publication_date": 20170418
    },
    {
      "title": "Very bright without breaking the budget.",
      "text": "Just right for above my garage workbench. Seems sturdy and is very bright without being harsh. A lengthy amount of chain for hanging, hooks for attaching to ceiling, and an easy point for strong attachment to make a secure fixture. Chain operation is a nice touch. The cord could be a little longer by 2 or 4 feet, but all in all, a great value and an excellent addition to the shop area.",
      "rating": 5.0,
      "verified": true,
      "author": "twogrnthmbs",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Good replacement for those old fluorescent tube fixtures",
      "text": "I used this to replace my 4ft fluorescent fixture over my workbench in the garage. It’s brighter than the original fixture but not obnoxiously bright. Very light weight and easy to install. I did have trouble with the first unit sent to me. The light flickered. The replacement fixture worked fine, and the free return process was uneventful.",
      "rating": 5.0,
      "verified": true,
      "author": "PAR",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Very bright, lightweight, great construction, no sharp edges.  Excellent product!",
      "text": "I am impressed with this unit. It replaces an old sharp-edged metal version that must have been 35 years old. This one is lightweight, plastic (which is good), and very bright. It's \"instant on,\" too. And, bright! Did I say bright? Much more output than the previous traditional fluorescent tubes. I gather one can daisy-chain the units together but I only needed one. I'd buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles G. Gage",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Great product",
      "text": "Decided to wade in gradually, so instead of the 6 or 8 I thought I'd need I purchased 4. Everything went fine! Bright, easy to install, no complaints... until I went to order another 2 and see they are no longer available? I guess that's what happens when Amazon rates something as \"best\". The product is a 5-star product, but I had to deduct a star for availability. I see that there are many other similar alternatives, linkable, but are all linking methods compatible? Edit: within a few days they were back in stock so I ordered 4 more. Changed to 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Yeager",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Hopefully it will last a good, long time",
      "text": "I just finished hanging this and the second one that is still on its way will be overkill for this project. Very bright. The power cord is much too short, though. I didn't notice that it was stated in the description at 44\", but not a deal-killer. It's shorter by at least a foot compared to the fluorescent that I am replacing. Hopefully it will last a good, long time!",
      "rating": 5.0,
      "verified": true,
      "author": "TonyN",
      "helpful_votes": 2,
      "publication_date": 20170523
    },
    {
      "title": "New Shop Light",
      "text": "This is a great shop light. The light gives off a lot of light. It has two led light strips, with a pull chain switch. The light comes with some good hardware for mounting the light. The light is as bright as my old fluorescent light. Now a would like to have two or three more of these lights.",
      "rating": 5.0,
      "verified": true,
      "author": "ftamemphis",
      "helpful_votes": 4,
      "publication_date": 20170417
    },
    {
      "title": "Like daylight in my shop",
      "text": "This is the only light I have currently in my 12x18 workshop and it does a surprisingly good job lighting the space by itself. When I first plugged this thing in I was blown away. When I have the extra funds I'll be getting another just so there are less shadows, but it isn't really necessary for simple work. I don't know why anyone would use anything else. It's way brighter than fluorescent and costs a fraction of the electricity.",
      "rating": 5.0,
      "verified": true,
      "author": "Parking Lot",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Using in my shop - provides very bright light and ...",
      "text": "Using in my shop - provides very bright light and let's me view saws and wood products without any problems - However I wish it would have come with a parts list so I could purchase another and interconnect. Very little paperwork. I was also a little surprised as it has LED tube lights vice the small LED lights am used to seeing - no problem just a different design.",
      "rating": 5.0,
      "verified": true,
      "author": "Iowa Gal",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "I Have Seen the Light!",
      "text": "Bought these to replsce the halogen light fixtures in my wood shop and could not be more pleased! They are much brighter and provide a lot more even light and - best of all - I can stand under them and do not feel any heat coming ftom them (the old lights felt like sun lamps). The new fixtures cost less than I would spend on replacement bulbs in a year. Great product, great value. The only negative is that the hanging chains could be heavier/stronget.",
      "rating": 5.0,
      "verified": true,
      "author": "Skip Greenwade",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Like daytime at night",
      "text": "Very pleased with this light. It's bright, energy efficient, and easy to install. I direct wired it to a switch in my tack room in one of my barns. I'm anxious to see how it performs in the real cold of winter, but right now it handles wet, foggy conditions way better than the fluorescent fixture that I replaced. I'll try and give an update this winter when it gets down to zero or below. The old light sometimes wouldn't even come on in bitter cold.",
      "rating": 5.0,
      "verified": true,
      "author": "truktruk",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "What I expected except for shipping damage",
      "text": "light weight, easy to mount either flush or hanging and can be daisy chained with power chord reach 44 inches. Ordered two, but one was damaged during shipping. Box was ripped and the light manifold was twisted slightly and dented. But the light worked. Since these are going in the garage, the appearance does not matter. Lights are bright, come on quickly and very light in weight. Will likely buy again for storage room. Four stars only because of shipping damage, otherwise product is 5.",
      "rating": 4.0,
      "verified": true,
      "author": "Eli's coming",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Excellent product",
      "text": "Easy to install, light weight, and most of all, bright. Put it up with minimal assistance from my wife in about ten minutes using my own anchor screws because I prefer the style and am familiar with them, plugged it into an existing conventional ceiling light using an adapter socket with two plugs so that the light would operate with the wall switch, and voila: Let there be light!",
      "rating": 5.0,
      "verified": true,
      "author": "Les Sogol",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Good lights.",
      "text": "Good lights. Pretty bright, nice white light. Come on right away with no flicker. Absoloutly no hum at all. The chains don't look very sturdy, they're kinda thin. Also wish it spread the light out a little more. I'm using this on a pretty low ceiling (only around 8 ft ceiling) and the light is directed more downward. Wouldn't be a problem with a higher ceiling though. I like how the bulbs are secured with a guard around the connections, both For aesthetics and because the lights won't easily fall out if they are bumped. For the price, these work great.",
      "rating": 4.0,
      "verified": true,
      "author": "Coulter Livforpeeps",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "one pretty badly so",
      "text": "I ordered 4 of these lights and they arrived quickly and the packaging was intact and not beat up but the metal shrouds on 3/4 of them were tweaked, one pretty badly so. I plugged them all in and they seem to work great. I'm not going to return them since they're going into my garage and returning them is somewhat of a hassle.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason 8ch",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "It was very easy to attach the chains to hang it (they were ...",
      "text": "This arrived on time. It was very easy to attach the chains to hang it (they were included in the package). I replaced an old fluorescent shop light with this one. I was amazed how much lighter this was than the old one - in a weight sense. Hanging it was simple, and it gives much more light than the old, replaced shop light. I have ordered three more of these to replace my other three fluorescent shop lights. My garage will be so much brighter.",
      "rating": 5.0,
      "verified": true,
      "author": "George W. Ball",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "FrenchMay LED Shoplights",
      "text": "These FrenchMay LED shoplights are the best: excellent build, excellent performance, very light, linkable, user-friendly. As of this writing, I have installed 6 of them in my basement. Thanks to these light fuxtures, my basement is no longer a dreaded dungeon. RoseMyst, the vendor, is the best -- offering very responsive support, complete with a customer-friendly attitude. You'll thank me.",
      "rating": 5.0,
      "verified": true,
      "author": "alphamoosedog",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "Great product, packaging could be much better",
      "text": "The product itself is great, but the packaging is bare minimum. Mine came slightly damaged, but not bad enough to bother with returning it (for another one that's likely to have the same issue). Just a small crack on it. Works great & good for the money otherwise",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Easy instal. Varying characteristics.",
      "text": "I have bought a total of four of these in two pairs. The first set is very bright and has a nice white light as indicated on the packaging. This set purchased ~6 months later (same labeling) is not as bright and doesn’t have the same color temperature. They are a little warmer. It’s easy to tell the difference since they are installed in the same garage. These are still a great solution and provide a very bright but pleasant light.",
      "rating": 4.0,
      "verified": true,
      "author": "BalanceSD",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Bright and light weight",
      "text": "These are nice lights, they are light in weight and easy to hang and let me tell you they are good and bright. I changed from eight 100 watt incandescent to eight of these. What a difference it has made. I will probably not see a big savings in money because the consumers energy company has a minimum charge on my barn so they will get their money one way or the other but at least I can see better.",
      "rating": 5.0,
      "verified": true,
      "author": "Timmy K",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Set up six of these in a garage where I ...",
      "text": "Set up six of these in a garage where I used to have flourescents. Being in a seldomly used utlitiy space/workshop I'm less concerned with the energy efficiency since they're only used a couple hours/week at most than I am the quality & quantity of light they throw off. One of the six did generate a noticeable hum but it was quickly traced to the exterior housing vibrating and a couple quick shims took care of it. There's no sound/hum at all generated by the lights - more than I could say for the flourescents. Being linkable they were a very quick install.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter C.",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Easy to mount and connect and give bright light to work by.",
      "text": "I used 2 of these lights in the electrification of my one car detached garage built in 1979 without electricity. They light up the space with bright light and allow me to use this garage as a work shop for the first time since I bought this property back in February of this year. They are very easy to mount and connect to electrical power.",
      "rating": 5.0,
      "verified": true,
      "author": "Honestbroker9",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Bright and works with limits",
      "text": "Have been looking a long time for replacements for the 4x200W incandescent lights in my garage. 4 stalls, 13 foot ceilings. 800W lights it well. Based on the one unit I tried I'd need 8-12 of these. Do the math ... So until I'm not allowed to buy the 200w IC anymore they're my picks. Will keep looking though.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Dunn",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Wonderful fixtures right out of the box",
      "text": "After making several frustrating purchases from a local warehouse lumber yard (and returning them) I found these lights. Wonderful fixtures right out of the box, they are basically throwaways but if they'll last 10-15 years I'll be fine with that. Nice bright and balanced light, perfect for my basement workshop which is about 10' x 12', even with the furnace blocking part of the floor the room is flooded with light using only three fixtures.",
      "rating": 5.0,
      "verified": true,
      "author": "BillyCz",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Super little light.",
      "text": "Very bright light. Came quickly and was packaged quite well. Easy to install. I used it flush against a 1x2\" mounted in my ceiling of my shed. What a difference it made. Good LED shop lights are a bit pricey but worth every penny spent. This product and seller were great! Would buy again and recommend to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Perfect replacements for fluorescent shop lights. And brighter.",
      "text": "These are solid shop lights. I bought four to replace lights in my workshop. They're brighter than the fluorescent lights that they replaced. And now, there's no fear that one of the bulbs will shatter. They turn on instantly, hum for a second and go silent and remain bright. Chains are just the right length as well. Hopefully they last.",
      "rating": 5.0,
      "verified": true,
      "author": "Orest Mandzy",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "A nice upgrade to my woodshop",
      "text": "Well designed, and including every imaginable part that might be needed for installation. The lights are significantly brighter than the fluorescent lights they replace without the 60 flickering. My shop is a much safer space. My only note is that the product is rather flimsy.",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon Haber",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Small change, works great",
      "text": "I had a small problem with this product in the hanging position as it would shortly after turn-on start making a buzzing noise. I found I could quiet that by running zip ties through the fixture holes and hooking into that instead of metal to metal. Works great now, no buzzing.",
      "rating": 4.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "1 cracked, 1 led w wire inside tube and 1  a slight different...",
      "text": "Just hung them. Easy to install and plenty bright. Only 1 star bc I ordered 4 lights at the same time and the housing and hardware are slightly different between the 1 and the other 3 (e.g., different mounting hardware, different color pull chains, mounting hole different shapes and locations, and the housing for one was slightly a different shade of white).... Also one arrived w cracked end housing (but seems to work fine) and one has a wire inside the led tube that is casting shadows. What gives?!",
      "rating": 1.0,
      "verified": true,
      "author": "Troy Sparks",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "they are instant on and no humming like some fluorescent lights",
      "text": "These lights are very bright. Lots of light output and lighter in weight than fluorescent fixtures. The light tubes aren't replaceable so when they go out you will have to replace the whole fixture, but they should last for many, many years. Also, they are instant on and no humming like some fluorescent lights. Happy I bought these. I'll be buying more of these after I use up all my fluorescent bulbs that I still have.",
      "rating": 5.0,
      "verified": true,
      "author": "William McGee",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Highly recommended. (Have a longer pull chain ready.)",
      "text": "I agree with the majority of the reviews... Great light. Nice & bright - lights up my 2-car garage (and shop) quite nicely. I had already purchased a longer pull chain & connector waiting the arrival of the light. It went up quickly. Took the most time locating the studs in the tall garage ceiling. The sturdiness is about what you’d expect for the price, but the illumination is what sets it apart. I’d highly recommend this light.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Wenger",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "As advertised, light, bright and a simple update to existing fixtures!",
      "text": "Replaced lights in two closets. One light in a small closet gave three times as much light as a single bulb under-cabinet type fluorescent fixture. I replaced two dual bulb (4 foot 40 watt each flourescent) with two of these - wow! Now we have to get the carpet cleaned. Really nice! Light and bright!!",
      "rating": 5.0,
      "verified": true,
      "author": "JerryP",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Cords are 4'... so plan ahead for it.",
      "text": "Love these lights! I have 8 of them in my garage and 10 of them in my barn.... so far. Just wish the cords were a little longer than 4'. 6' cords like the older fixtures I am replacing would have been ideal. Just making due with a few small extension cords to reach the spots I am placing them.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Sherwood",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "BETTER packaging would probably save them money",
      "text": "The ONLY downside on these lights is high rate of damage in shipping. Order 4 for every 3 you need and return bent ones. I had no issues with lights working, only sides being bent badly on 2 of 5. I was able to straighten 1 of these enough to keep and 2 others were so minor a little push and the bend is gone. BETTER packaging would probably save them money.",
      "rating": 4.0,
      "verified": true,
      "author": "taverentech",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Nice qualitity; easy to install!",
      "text": "I had converted my old shop lights to LED but realized that I needed one more for a dark area in my basement. This really did the trick and was able to power another light off the outlet on the end of this unit. I may get a couple more for my garage as the LEDs are not affected by the cold as most fluorescent lights were.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve C.",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Simple Installation",
      "text": "I like this fixture. It is simple to surface mount to a ceiling, as the mounting holes are accessible without any disassembly. It is very bright. It has a power cord installed and ready to use. It has a standard outlet in the opposite end from the power cord to plug in another light fixture.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Daniel",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "they were easily installed and have been working properly ever since",
      "text": "Although the lights came a day late, they were easily installed and have been working properly ever since. I love the 4800 lumen fixtures that appear to be almost twice as bright as the fluorescent lights that they replaced. The packaging was bullet proof. Installation was a breeze with the provided chains with clips.",
      "rating": 5.0,
      "verified": true,
      "author": "JBrough",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "It lit",
      "text": "They lose one star because it buzzes loudly. If you squeeze the metal it goes away a little but then comes back. But it's bright and lights up my 8 by 10 area nicely I'll probably buy another to make it brighter and deal with the noise later with tape or something.",
      "rating": 4.0,
      "verified": true,
      "author": "Curtis H.",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Makes a buzzing sound similar to the old time florescent types.  Terrible unless your deaf.",
      "text": "Makes a buzzing sound similar to the old time florescent types. Terrible unless your deaf.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Meffert",
      "helpful_votes": 3,
      "publication_date": 20180418
    },
    {
      "title": "it's LED - energy saving, brighter and instant on",
      "text": "This Linkable LED Utility Shop Light is much lighter compared to my old fashion fluorescent fixture. Nonetheless, it's LED - energy saving, brighter and instant on, a huge plus for me. Everything is provide to hang it quick and easy. The additional outlet on the side is another feature that I really like. I bought it when it was on sale so I think it's an excellent value for what I paid.",
      "rating": 4.0,
      "verified": true,
      "author": "AZshopper",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Good garage light.",
      "text": "I installed these in my garage flush on the ceiling. They provide lots of light and the slim profile allows them to be installed where another light wouldn't work. Mine are not linked together. I wanted a corded unit and a pull chain. I can't assess how long these will last, but I'm sure it's a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward T. Wilson",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Light up your space.",
      "text": "I think this light is a good buy. The chains were a bit difficult to hook up but that could be \"operator headspace.\" The light is very bright and I like the fact that I can add additional lights by simply plugging them in. I had a ceiling outlet where a garage door opener had been so it worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "These lighting fixtures are the best!",
      "text": "I can’t remember the last time I got this excited about a lighting fixture! I previously had 4 2 tube 10 foot florescent fixtures in my garage/workshop that the ballast went out or the tubes died or whatever so they needed replacing . The brightness of these fixtures is amazing. It is truly instant on and instant off. Installation was incredibly simple. Going from 80 feet worth of fluorescent tube to 32 feet worth of these with five times the light, there’s nothing more I can say except I’m going to get a few more!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill N.",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Great light",
      "text": "I purchased a similar light (different manufacturer) from Amazon before this one. I worked great at first but then quickly failed. I returned it to the seller. I then bought this one. So far, it works great. Assuming that it continues to work I will be very pleased. It is lightweight, easy to install and provides great light.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Got this to replace a 4 foot, 4 tube ...",
      "text": "Got this to replace a 4 foot, 4 tube florescent fixture in a basement laundry room. This light is brighter and very white (excellent for around the washing machine). I avoided issues with the mounting hardware by simply drilling three holes in the back and screwing it directly to a joist.",
      "rating": 5.0,
      "verified": true,
      "author": "The Old Crackpot",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Nice, bright, and easy to install",
      "text": "The lights are bright with good color. (I would say the description of brightness and color is dead on.) The provided hardware makes them easy to install and the daisy chain feature makes connecting multiple lights quick. (I ordered two of these.) I would definitely buy them again. (Contact with the seller was also excellent.)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Flimsy cheap material",
      "text": "The lamp gives off great light but is cheaply made. I used the manufacturers chain to hang it, bump it and it came crashing down. The links just pulled apart. The housing is very thin, worse yet the clips that hold the bulbs in are very easy to bend and break. For the price it should be made much stronger.",
      "rating": 2.0,
      "verified": true,
      "author": "Mgolombiecki",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Bright lamps for your work place.",
      "text": "I really like the brightness and the daylight color temperature. Makes my machine shop far more pleasant to work in. Very easy to hang and replace existing lamps, too. Lamps were well packed and shipment was fast. Free shipping with Amazon Prime. Good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Telford",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Shop light.",
      "text": "My husband installed this fixture in our crawl space under our home. The area is quite large and we use the space for storage. The light is quite bright and very efficient to see in most of the space. This is much better than the tiny utility light that the builder installed.",
      "rating": 5.0,
      "verified": true,
      "author": "ghosty girl",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Bright and dependable in cold weather!",
      "text": "I waited to post a review because I wanted to see how dependable they were. They are easy to install. I love these lights and have already ordered more! Using them to light up my garage attic! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Yeager",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Its ok",
      "text": "Goes up easily - it is very light, pretty cheap but works. Not the greatest but will probably add a second to give me a little more light and use the linkability (though another brand would likely work too).",
      "rating": 4.0,
      "verified": true,
      "author": "DLH",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Works fine, but makes a terrible buzzing noise.",
      "text": "As described, and easy to install. Bright cool white illumination. Has a terrible buzzing noise coming from it though... Tap it and it goes away, but will eventually come back. I was hoping to order more for my garage, but this was a deal breaker.",
      "rating": 1.0,
      "verified": true,
      "author": "Jerred",
      "helpful_votes": 3,
      "publication_date": 20180122
    },
    {
      "title": "I'm pretty satisfied with the purchase and planing to buy another ...",
      "text": "I was little worried about color tone. But it's natural day light tone with little warmth in it, not too yellow not too blue. And it's really bright with surprisingly low heat. I'm pretty satisfied with the purchase and planing to buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "kamui",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Mounting is not strait forward.",
      "text": "The light is bright and works as advertised. The mounting hardware, not so much. The chains have a snap hook which is too big to go through the holes in the light cover. I bent them slightly closed so I could hook them up. Also, the mounting screws were so soft that they stripped out as soon as they encountered resistance in wood. I use some other screws. Otherwise, OK.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Koble",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Great LED shop light.",
      "text": "I hung this above my art table in my studio. I wanted daylight spectrum, so this worked well. It puts out plenty of light too. It was easy to hang and the LED tube does not hum. I have been using it now for about a month and all is well.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Hunter",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Easy peasey",
      "text": "Replaced old fluorescent gas lights in dark basement laundry room. This LED light is much brighter. Didn't use the chain kit, mounted directly to joists and allowed for better light coverage. Had the unit in place for a few months with no issues whatsoever. Plan on an extra set of hands for install, too long for one person to mount properly.",
      "rating": 5.0,
      "verified": true,
      "author": "DLoc",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Could not be happier with the difference in light that this puts out ...",
      "text": "Could not be happier with the difference in light that this puts out compared to the older ones I had. Light weight and easy to install. Only recommendation would be to make the power cord longer as most people install 1 per bay in the garage/pole barn. This would make it easier to link them together.",
      "rating": 5.0,
      "verified": true,
      "author": "William Harris",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Great light!",
      "text": "This light is exactly what I was looking for to install in my closet. I flush mounted the light with two-sided tape and plugged it in. So bright! I have several other places I want one of these lights. It is nice looking, easy to install and provides an abundance of bright light. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Hudspeth",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "excellent color rendition for artists who are concerned about color ...",
      "text": "Very bright, excellent color rendition for artists who are concerned about color shifting by other types of lighting. Good value, good quality and very light weight compared to the old fluorescent fixtures with their heavy ballasts.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou Kief",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Damaged housing",
      "text": "Item was damaged straight out of the box. I am replacing with free shipment back to seller. Hopefully the next light I get is not damaged.",
      "rating": 2.0,
      "verified": true,
      "author": "Neil",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "The shop lights arrived in excellent condition, on time",
      "text": "The shop lights arrived in excellent condition, on time. I really appreciated that everything was included to make the installation quick and easy. All three lights were hung on my 11 foot ceiling and ready to use in little over and hour. The linkable feature saved much time and money. I now have a brightly lit workbench.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Good Choice!",
      "text": "Bought this for use in a studio for an Artist friend. Liked it as soon as I took it out of the packaging. Nicely made and neither looks nor feels cheap. Good light, stays cool and is ez on electricity. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom j Dolan",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Packaging problems",
      "text": "The lights are OK so far, I bought three. One of them was badly bent due to worthless packing., I managed to straighten out the damage and the light works. Not much to look at but it is for my shop which isn't much to look at either. Would urge a rethink of the packaging for shipment.",
      "rating": 3.0,
      "verified": true,
      "author": "Roger N. Fry",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great product at a great price.",
      "text": "Great product at a great price! Replaced my fluorescent T8 fixtures with these! What a difference!!! Bright white lighting flooded the room. Installation was plug and play after hanging on existing hooks! Buy these they are great. Good build - can be daisy chained. Comes with outlet built in.",
      "rating": 5.0,
      "verified": true,
      "author": "Friar Tuck",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "Very easy to install and very bright",
      "text": "Very easy to install and very bright! I actually used it to replace by electric garage door opener's light bulb so when I pull into my garage it is much brighter. (I used a socket-style electrical plug adapter in the garage door opener's socket)",
      "rating": 5.0,
      "verified": true,
      "author": "SE1964",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Good bright light, now I can see again",
      "text": "I mounted this light over a potting bench in my walk out basement. It replaces a T12 fluorescent unit. It is much brighter than the T12 and I plan to buy more like this one to go in our attic. Good utility light. Comes with hanging hardware including ceiling fittings and screws.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. B.",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Nice while it lasted.....",
      "text": "One side failed after a month. I returned this item.",
      "rating": 2.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 5,
      "publication_date": 20171011
    },
    {
      "title": "Half the lights work! 👎🏼",
      "text": "I received my lights today, cut open the boxes installed the 4 lights that I ordered (hardwired) when we turned on the power we found 2/4 fixtures were not working properly half of the lights were not lit, The one that's working right looks great but I would not recommended. I can't return either because the boxes are gone assuming they would work properly we tossed them and the plugs are cut off the lights",
      "rating": 1.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 11,
      "publication_date": 20170925
    },
    {
      "title": "Complaint",
      "text": "I had purchased 5 of these lights a while back. On one light the end came off and the two bulbs broke at the end. It still worked but impossible to fix. The new light came in and it hooked away from the end so then end wouldn't break away. It now takes a double hook to mount. They learned at my expense. I have four of the single chain mounts and I'm just wondering if more will break.",
      "rating": 4.0,
      "verified": true,
      "author": "Fred B. Ashby, Jr.",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Good product not so good customer ser",
      "text": "Bought two of these units liked them so much, ordered two more. Last two came in and one was missing the hanging hardware, three emails and two promises that it would be shipped out....after three weeks of waiting, went and bought chain an hooks ($8.00) to hang them. Seemed like a small bag of hooks and chain wasn’t that big of deal to disappoint a customer that will be looking for a couple more of these units in a few months.",
      "rating": 3.0,
      "verified": true,
      "author": "Alan Schroeder",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Happy with my purchase.",
      "text": "Very bright, very light weight. It was perfect for my garage. The pull chain is a bit short but it was easy enough to MacGuyver some extra length on it. I only bought one, but I like that If I got another, it can be chainlinked into the one I already have. Easy to recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "TheCleansingTide",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Short delay on turning on the lights",
      "text": "Not sure why, but there’s a short delay to turn on the lights. My old lights from a different brand would turn on instantly, but these have a second or longer delay. It might not bother some people but I would prefer my lights to turn on instantly. The power cord is also short.",
      "rating": 2.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Let there be (LED) light!",
      "text": "Great product, came on time and as described, works great I have a 1300 square ft garage with 12ft ceilings and I purchased 4 lights and they light it up plenty. I am very pleased with the quality and these were one of very few that could flat mount directly to the ceiling.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Bright light and white in color--very nice. Installation was a little more difficult than it ...",
      "text": "Bright light and white in color--very nice. Installation was a little more difficult than it needed to be. Slot along the long axis of the light to take up slop when drilling holes and installing screws, but no slots on short axis for sideways slop",
      "rating": 4.0,
      "verified": true,
      "author": "Detroit Dad",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Great fixtures, good price!",
      "text": "I have a shop where lighting is crucial and I ordered 4 of these which I installed without a hassle. They came with all the necessary chain hardware which made installation a breeze. All I had to do was daisy chain them in sequence and plug the first one in and voila! Good lighting for all...makes it feel like daytime at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Sergio",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "I have two to start and they seem pretty bright and work well",
      "text": "I just received the lights a couple days ago, and I installed them in my garage. I have two to start and they seem pretty bright and work well. They are much brighter than the previous fluorescent lights that I had. I’d recommend this product to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Scotty",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Very nice - bright & well designed lights",
      "text": "Works great, the lights are very bright, the hardware to hang the unit is well done and works great as well. I'm tempted to replace all my old fluorescent units with more of these. I use these in my workshop for woodworking and in my art studio. The light is great.",
      "rating": 5.0,
      "verified": true,
      "author": "PMF",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "really Bright",
      "text": "These lights are replacing fluorescent shop lights in my garage. There is a huge difference in the brightness between fluorescent and these LEDs. they also work in temperatures that the old ones did not. I gave these lights a 5-star rating and would highly recommend them. The lights arrived on time and work as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200102
    }
  ],
  "product_meta": {
    "title": "bulbeats 4FT LED Shop Light- 50W Large Coverage Garage Light, 5000K, 5500lm, Plug and Play, Pull Chain, Suspended Mount, Non-linkable Garage Light for Office, Workshop",
    "rating": 4.6,
    "feature_bullets": [
      "【Super Bright & Energy Saving】50W 4FT LED shop light with 5500lm, can be easily replace for 350W ceiling lamps or 220W halogen lamps, energy saving up to 75%.",
      "【Commercial Grade】 Shop LED light with highest standards by testing for optimal performance and safety. ETL and DLC listed. 4 FT / 48 IN long, 5000K daylight, CRI 80+, 120V. Non Linkable",
      "【High Performance】 The shop light base made of premium aluminum, excellent heat dissipation, special process width milky PC cover to avoid yellowing and large luminous area coverage, makes the light more uniform and comfortable.",
      "【Easy To Install & Wide Applicability】 Follow installation guide for a quick and easy setup, mounting hardware included (5' Cord | 10\" Pull Chain Switch)! Directly suspend from the ceiling for instant bright light in your garages, basements, warehouses, and storage area.",
      "【Reliable Warranty】 No harmful substances, no radiation, 100% environmentally-friendly, 100% safe and easy to install. We persist in product quality and provide you reliable warranty. Please contact us if any issue, we’ll reply within 24 hours."
    ],
    "specifications": {
      "Brand": "Bulbeats",
      "Manufacturer": "Bulbeats",
      "Item Weight": "5.5 pounds",
      "Package Dimensions": "50.39 x 8.27 x 5.31 inches",
      "Style": "Modern",
      "Color": "White",
      "Shape": "Linear",
      "Material": "FE+PC",
      "Number of Lights": "2",
      "Voltage": "110 Volts",
      "Special Features": "Plug and Play",
      "Shade Material": "PC",
      "Light Direction": "Downlight",
      "Power Source": "AC110V",
      "Switch Installation Type": "Suspended Mount",
      "Type of Bulb": "LED",
      "Luminous Flux": "5500 Lumen",
      "Wattage": "50 watts",
      "ASIN": "B07ZRKNVDN",
      "Customer Reviews": "4.6 out of 5 stars820 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#63,034 in Tools & Home Improvement",
      "Date First Available": "October 30, 2019"
    },
    "categories": [
      "Bay Lighting",
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Commercial Lighting"
    ],
    "price": 40.99
  }
}