{
  "website_summaries": [
    {
      "verdict": "Sturdy and inexpensive poles with adjustable height that locks well.",
      "pros": [
        "These telescoping poles can be used for downhill skiing, cross-country skiing, or hiking",
        "Though the shafts are aluminum, they are fairly durable",
        "The adjustable height and reliable locking mechanism means you don't need to worry about getting the right poles for your height"
      ],
      "cons": [
        "Some customers complained of the rattling sound these poles can make"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "All in all I was quite pleased by the weight",
      "text": "I see what someone else means about the poles being a little \"loud\" as if the springs or something jiggle in the inside when the poles hit the ground, but I don't think it's that big of a deal. My poles arrived earlier than expected and I immediately took them out for a 22 mile hike. All in all I was quite pleased by the weight, the quality, the size, and even the fun carrying case they came with!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Pugh",
      "helpful_votes": 6,
      "publication_date": 20170606
    },
    {
      "title": "They are \"noisy\" meaning when in use they sound like they are about to fall apart",
      "text": "Not particularly impressed with these poles. They just don't seem as well built as others I have had, or tried. They are \"noisy\" meaning when in use they sound like they are about to fall apart. The locks work fine, but I do question the durability. I returned them because the grips are kind of large in diameter and they were for my wife. She didn't like the size, and said her hands were sweating because of the grip material. They aren't the worse ones out there, but there are definitely better for around the same price point.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Kiser",
      "helpful_votes": 3,
      "publication_date": 20170517
    },
    {
      "title": "Great Buy",
      "text": "Was looking for some hiking sticks to take on my trip to Colorado to go through the mountains. These worked out perfectly. Basically they met the requirements I was looking for. I wanted to be compact, lightweight and store easy. Check, check and check! Something I didn't realize I would enjoy was the fact that they have measurements on the side so every time I can get them to exact length that feels comfortable without having to guess and check each time. Overall, very satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Baby PhD",
      "helpful_votes": 4,
      "publication_date": 20171027
    },
    {
      "title": "Daughter loved them in the mountains!",
      "text": "We used these this last weekend on the trip to the mountains. My 9 year old daughter always likes picking up big sticks while on trails to use as \"walking sticks\", so I figured she would like these. They definitely didn't disappoint. She used them the entire time we were out. They seem pretty sturdy, and are pretty easy to lock at the height they needed to be at . Think I might need to get myself a pair now so we can match!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 3,
      "publication_date": 20171017
    },
    {
      "title": "Climbed Grays Peak with these.",
      "text": "This was my second time using trekking poles for a climb ( Pikes Peak 14ee, not my own poles), this time Grays Peak (14er with these poles). What an incredible difference trekking poles make especially on the descent! Grays Peak is terribly rocky and loose rock at that. These poles were perfect. Caught me many times as I am not graceful or sure-footed in the least! Easy to adjust between ascent (shorter) and descent (longer). For the price, I highly recommend! My fiance used a pair from REI that cost 3 times as much with no difference in functionality that I could see.",
      "rating": 5.0,
      "verified": true,
      "author": "Bunny",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "She said they’re good and holding up well",
      "text": "Purchased as a gift for a friend who likes to cross country ski. She skis recreationally a few times a month. She said they’re good and holding up well. Will update with more specifics if I hear anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen Miller",
      "helpful_votes": 4,
      "publication_date": 20171023
    },
    {
      "title": "Not recommended",
      "text": "I don't travel to mountainous places often, but whenever I do I notice that these stick are not useful for person above 90 kg, these legs close into each other immediately... But my 60 KG girlfriend didn't have any problem",
      "rating": 3.0,
      "verified": true,
      "author": "Levani",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "These sticks rock!",
      "text": "Love these hiking sticks! Used them on my trip to South America where we hiked the Andies! Comfortable hand grip and very lightweight. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "PolokingH2O",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Overall pleased with compactness and quality.",
      "text": "Bought these as they are a little more compact than my existing poles and fit better in the suitcase when traveling. The noticeable differences that I like over my other poles are the locking mechanism for adjusting heights (other poles required screwing pole piece to tighten or loosen which became difficult with age), the carry bag, and padding on the interior of the wrist straps. I haven't noticed them being any louder than my other poles as other users have reviewed.",
      "rating": 5.0,
      "verified": true,
      "author": "SteveH",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Greast poles",
      "text": "Great poles for walking on any terrain. I've enjoyed them tremendously. They are easy to travel with. Not hard at all in the hands",
      "rating": 5.0,
      "verified": true,
      "author": "ab7337",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Five Stars",
      "text": "I can’t believe the price. REI has similar products for $139.00.",
      "rating": 5.0,
      "verified": true,
      "author": "T Komar",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Function as promised",
      "text": "I've been using the poles for about a month now for downhill skiing and they work great. They are strong and light, and the clamps hold the length in position with no problem. Haven't used for hiking yet, but plan to do that also. Very pleased with the performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Daren S. Lucas",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "I really like these poles",
      "text": "I really like these poles. Unfortunately, one of the screws that stabilize the top part disappeared shortly after delivery and I have not figured out how to replace it. Any suggestions?",
      "rating": 4.0,
      "verified": true,
      "author": "Estella 2",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "So far, so good!",
      "text": "I haven't used that yet, but I'm pleased with the way the way the handles feel, as well as the accessories that came with them.",
      "rating": 5.0,
      "verified": true,
      "author": "xterradee",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Helps her to walk because she had bad back with Five surgeries",
      "text": "Bought them for my wife and she loves them. Helps her to walk because she had bad back with Five surgeries.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Sawyer",
      "helpful_votes": 2,
      "publication_date": 20170604
    },
    {
      "title": "however I like the fact that they adjustable so I get the ...",
      "text": "haven't actually used them yet as I am waiting on the ice, however I like the fact that they adjustable so I get the correct height.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Christian",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "These poles are awesome. The adjustable feature is a must for multiple ...",
      "text": "These poles are awesome. The adjustable feature is a must for multiple uses.",
      "rating": 5.0,
      "verified": true,
      "author": "DixxieSS1984",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Pretty well designed but some slippage occurred which was fixed ...",
      "text": "Pretty well designed but some slippage occurred which was fixed by torqing the screws hard, which may result in some wear. The swing arm that locks the segments will probably be the first to go.",
      "rating": 4.0,
      "verified": true,
      "author": "Herald N.",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Five Stars",
      "text": "They are great. Use them to hike up and down their mountain while I am hunting",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "They look like they are going to be easy to use They ...",
      "text": "They look like they are going to be easy to use They are a present and am waiting to be able to give them and hear feedback on how he liked them or not",
      "rating": 5.0,
      "verified": true,
      "author": "D. McMillon",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "Hiking",
      "text": "Not happy with stick. The bottom broke very easy on BURLY less then a mile hike. First time use.",
      "rating": 1.0,
      "verified": true,
      "author": "Santa Sandia",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Pleased!!",
      "text": "Bought this as a gift for my friend and she is very impressed with the item. Being a keen walker she is pleased with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20171014
    }
  ],
  "product_meta": {
    "title": "TerraTHEO A6 Hiking and Trekking Poles (Pair) - Durable & Lightweight - Ergonomic Grip and Ultra-Lock - Trekking, Nordic Walking, Cross Country Ski Sticks",
    "description": "TerraTHEO Poles are the Strongest, Lightest, & Most Portable poles available! These compact poles are perfect to take on backpacking trips, mid-winter skiing and summer hiking adventures! \n\nWhat’s Included? \n♦ 2 TerraTHEO Trekking and Skiing Poles with nonslip EVA Foam Grips, Wrist Straps, Ultra-Lock Extenders, and Tungsten-Steel Tips \n♦ 2 Rubber Tips \n♦ 2 Mud/Snow Baskets \n♦ BONUS: Carrying Bag with Strap \n\nSpecifications: \n♦ Collapsed size: 24 inches (60.9 cm) \n♦ Extended size: 53 inches (135 cm) \n♦ Weight: 9.5 ounces per pole – Just over 1 pound for both poles!",
    "rating": 4.3,
    "feature_bullets": [
      "DURABLE & LIGHTWEIGHT - Made with Aircraft-Grade Aluminum, they are made of the highest quality materials, making them both strong and easy to carry!",
      "TELESCOPIC HEIGHT ADJUSTMENT - TerraTHEO Poles are perfect for Hikers and Skiers of all shapes and sizes! Quickly adjust to your proper height for a customized fit!",
      "ULTRA-LOCK TECHNOLOGY - You'll never again have to worry about your poles collapsing when you need them most!",
      "COMFORT GRIP - Our ergonomic EVA Foam Handles conform to your hands and keep your hands cool and dry, unlike cork and rubber!",
      "LIFETIME GUARANTEE - TerraTHEO stands behind their products and provides a Lifetime Guarantee for your Poles! Special Offer for our Amazon customers!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "27.1 x 5.3 x 1.8 inches; 1.4 Pounds",
      "Date First Available": "December 22, 2016",
      "Manufacturer": "TerraTHEO",
      "ASIN": "B01MY0Y9YE",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Trekking Poles",
      "Camping & Hiking",
      "Sports & Outdoors",
      "Outdoor Recreation"
    ],
    "price": ""
  }
}