{
  "website_summaries": [
    {
      "verdict": "This is an excellent choice if you're looking for a krill oil pill that's easy to swallow and won't cause any fish burps.",
      "pros": [
        "1,000 mg of krill oil per serving",
        "Doesn't leave a fishy aftertaste or cause fishy burps",
        "The pills are small and easy to swallow",
        "Affordable price for how much you get"
      ],
      "cons": [
        "You must take 2 capsules at once in order to get the full serving"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "NOT 1000mg. DECEPTIVE  LABELING.",
      "text": "** MISLEADING PACKAGING** CAPSULES ARE 500mg EACH. NOT 1000MG AS LABEL READS. DECEPTIVE ADVERTISING.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Smith",
      "helpful_votes": 214,
      "publication_date": 20190306
    },
    {
      "title": "For myself and my dog!",
      "text": "This krill oil is great, I've ordered it 3 times now and I can't say that about any other salmon/krill/fish oil6 I've tried in the past. Both myself and my dog take this daily, my skin and hair is beautiful (I'm 40 y/o) and his skin and coat are amazing. The gel pills don't leak, are possibly flavored as they are a pleasant and almost sweet flavor. Its also a great price for the quantity. My dog suffers from dry skin and this along with MCT oil has made him SO shiny with no more dandruff. I've tried MANY other fish, salmon and krill oils and none compare to this brand!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Joyner",
      "helpful_votes": 85,
      "publication_date": 20190426
    },
    {
      "title": "but I can tell you that the taste / smell is not as bad as other reviewers stated",
      "text": "I have only taken them for a month so far, but I can tell you that the taste / smell is not as bad as other reviewers stated; I have a sensitive sense of smell and these did not offend me at all. I usually buy Mercola products, but with my new budget, this seems to be the best quality for the price. Could be coincidence, but my mind felt sharper and I was not aware that it could with this supplement. I had no poor reactions from this product whatsoever, the price is great for the quality. Be very careful when choosing anything that comes from the ocean; this is a high quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "The Tompanman GnomeTop Contributor: Pets",
      "helpful_votes": 117,
      "publication_date": 20170630
    },
    {
      "title": "recommended by my heart doctor instead of more meds",
      "text": "I am not saying it is better for everyone to start taking Krill Oil or any other over the counter med instead of prescription, but it may not hurt to ask your doctors advice. I have some very challenging health problems, to say the least, and on a recent visit to my heart doctor, he suggested that I might want to start taking Krill Oil instead of one of the prescription medications I was taking. He said they are about the same and would save me a lot when it came to paying for one of my medications. I am feeling fine and saving a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Thankful to my doctor!",
      "helpful_votes": 59,
      "publication_date": 20181102
    },
    {
      "title": "I had really bad swelling and inflammation during my last pregnancy and so ...",
      "text": "I take this daily to prevent inflammation. I had really bad swelling and inflammation during my last pregnancy and so far during this one I’ve had pretty much none. My carpal tunnel was so bad last time around. I was so miserable and in constant pain for over a year. I’m down to my last few weeks and I’m just now starting to notice that my feet swell up a little if I’m on them for too long. I work 10 hour shifts on my feet and it’s to be expected. Will definitely keep taking this supplement probably forever.",
      "rating": 5.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 56,
      "publication_date": 20180407
    },
    {
      "title": "Body filling Omega greatness! 60 day amount same price as competitors 30 day!",
      "text": "Very good deal. We use these 2 pills 2 times a day and they are easy to swallow with a pleasant vanilla scent/flavoring. Great brain and body filling Omega! Also, twice the amount 60 day supply for the same price as the competition offering 30 day.",
      "rating": 5.0,
      "verified": true,
      "author": "Chromatic",
      "helpful_votes": 55,
      "publication_date": 20180613
    },
    {
      "title": "Smelly but we shall see how they work when I go see my doctor again in six months",
      "text": "Ok, at first I was put off big time, the smell of them is gross. But if it's healthy and needed to keep me that way I can live with the smell. Also I never burped them up even after several hours so it's all good.",
      "rating": 5.0,
      "verified": true,
      "author": "Mountain gal",
      "helpful_votes": 32,
      "publication_date": 20170504
    },
    {
      "title": "RED GUARD!?",
      "text": "Loved the product & the price! Not a lot of fishy aftertaste & smell. Second time purchasing so that would stand for something!",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy W. Rivers Jr.",
      "helpful_votes": 27,
      "publication_date": 20170814
    },
    {
      "title": "NOT 1000 mg softgels - Deceptive",
      "text": "These tablets are not 1000 mg. They are 500 mg each. You have to take two of them. When I purchased these, the words \"(90 servings)\" were not in the title. These words were added later. It just said \"1000 mg\" and \"180 softgels\". The details were only in the fine print, inconspicuously labeled on the bottle. It makes no sense to label the bottle with the \"serving size\", because that could be whatever you want. Clearly intended to deceive.",
      "rating": 1.0,
      "verified": true,
      "author": "bkm83442",
      "helpful_votes": 19,
      "publication_date": 20190405
    },
    {
      "title": "Not fishy!",
      "text": "Taking this for high triglycerides/cholesterol. These gel caps contain ethyl vanillin which is used as a flavor additive to mask the fishy smell and taste. While it doesn’t completely eliminate the smell, the caps taste like nothing but vanilla. Ethyl vanillin is used in food and drinks to enhance natural vanilla flavors. I’m not a fan of fish so these gel caps are perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 13,
      "publication_date": 20180914
    },
    {
      "title": "Great product with not-so-great side effect",
      "text": "I liked this brand of krill oil. It was much cheaper than the Sports Research krill oil I previously purchased and seemed to be of the same quality. The pills were the right size and easy to take. No overwhelming fishy smell either. However, I noticed that about 3 hours after taking this supplement I would use the bathroom and have really weird, odd smelling urine. It may not be a big deal for some but the smell was so off-putting, I'm changing back to the Sports Research krill oil. It's almost twice the price, but at least I didn't have this weird side effect!",
      "rating": 3.0,
      "verified": true,
      "author": "Lucy D.",
      "helpful_votes": 9,
      "publication_date": 20181026
    },
    {
      "title": "Sad about the side-effects",
      "text": "I was excited to try this after seeing such great reviews on the product. Unfortunately, I cannot tolerate the side effects of the bloating, gas and diarrhea from it. I even tried taking just one a day and still had the same issues. Guess it's not for everybody.",
      "rating": 1.0,
      "verified": true,
      "author": "G_Lere",
      "helpful_votes": 20,
      "publication_date": 20181031
    },
    {
      "title": "Is it just me or do they smell like chocolate?",
      "text": "I really like these - small pill, smells good, no fish after taste. I did lots of research before buying these over traditional fish oil or other products and I’m so glad I did. I’m healthy, so they haven’t “fixed” anything for me, but as a daily preventative supplement boost, I’m sold! I’ve never tried MegaRed so I can’t offer a comparison.",
      "rating": 5.0,
      "verified": true,
      "author": "PaelyJade",
      "helpful_votes": 17,
      "publication_date": 20180404
    },
    {
      "title": "Good value, no aftertaste!",
      "text": "Regular sized capsules, easy to swallow. I did not get any fishy aftertaste that other reviews complained about. Seems like a good value in $/pill-mg. Doesn't explicitly state that it's been purified to remove any potential mercury, but from what I've read, it doesn't seem to be an issue for the small Krill shellfish.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Robert D., Bay Area, CA",
      "helpful_votes": 20,
      "publication_date": 20170703
    },
    {
      "title": "great side effect",
      "text": "Very good Krill oil. Decided to try this in the place of our regular fish oil. In a week or so my wife noticed that her eyes were not drying out and some other private areas were also more moist than they had been. We'll be using this from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Jernigan",
      "helpful_votes": 9,
      "publication_date": 20190315
    },
    {
      "title": "Time will tell",
      "text": "I left a comment some time ago. I had a question which has since been cleared up. I am still completely satisfied. I intend to continue taking them for the purpose of improving my health. I have a checkup about every 6 months. I hope to see some improvement over that time. My daughter has been taking fish oil to help with pms and it does, but it often gives her indigestion. Since we switched to krill oil she has not had indigestion.",
      "rating": 5.0,
      "verified": true,
      "author": "R. DuMond",
      "helpful_votes": 8,
      "publication_date": 20181010
    },
    {
      "title": "If the product is going to be absorbed into the body.",
      "text": "Well for one thing's the pills were a good size to swallow overall the product is not good it does not absorb into the body. Leavin the supplement to keep seating in body. Is not healthy for you",
      "rating": 1.0,
      "verified": true,
      "author": "noob",
      "helpful_votes": 11,
      "publication_date": 20191012
    },
    {
      "title": "No Smell, 500 MG Capsules",
      "text": "Received yesterday. The good: Contrary to other reviews, there was no smell and the taste was not fishy. The surprise: From reading label on bottle I thought the capsules were 1000 MG, they are not. The capsules are actually 500 MG and directions indicate you should take two a day. The label on bottle is misleading; I thought I was receiving a 180 day supply when actually it is a 90 day supply.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave C.",
      "helpful_votes": 11,
      "publication_date": 20180920
    },
    {
      "title": "Excellent product A+++",
      "text": "Love this Antarctic krill oil - taste isn't bad at all like you'd normally expect with this type of product. After less than 2 weeks of taking it every day, my joints already feel better. This is definitely a keeper!!",
      "rating": 5.0,
      "verified": true,
      "author": "fortheloveoftheunborn",
      "helpful_votes": 8,
      "publication_date": 20190110
    },
    {
      "title": "Excellent health benefits and no fish taste.",
      "text": "Hi everyone, I have always taken fish oil for the omega 3, 6, and 9 benefits. I came across this brand of Krill oil and found it interesting. I researched the product and liked what I read and the reviews other people had to say about it. So, I too decided to give it a try and am beyond glad that I did. Since I first started taking Bronson Antarctic Krill Oil I can truly say that I feel sharper and more full of energy. The best part is that, there is no fish after taste or smell when you take the Krill Oil. My wife tried it out, and now she too takes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Guy",
      "helpful_votes": 8,
      "publication_date": 20190103
    },
    {
      "title": "Smaller size, easier to swallow & no fishy after taste!",
      "text": "I love that these are smaller size pills ...about the third of a typical fish/krill oil pill but still high potency. No fishy after taster either.",
      "rating": 5.0,
      "verified": true,
      "author": "KLGB",
      "helpful_votes": 12,
      "publication_date": 20180524
    },
    {
      "title": "Thankful I found this...",
      "text": "I researched for a while and I'm glad that I went with this product. I couldn't take the stairs at work due to pain in my knees and hips that had begun about a month before. I took two of these tiny capsules and I kid you not, within a week and a half I have back the elevator key. I am two thirds through the bottle and I'm happy to report that I'm not experiencing any adverse effects and I'm ready to walk all over Italy. I keep a photo of the bottle because I've recommended it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "SuBo",
      "helpful_votes": 6,
      "publication_date": 20190514
    },
    {
      "title": "My doctor says",
      "text": "It seems to be an excellent product my doctor suggest I take it and she says my blood work proves it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Dougherty",
      "helpful_votes": 9,
      "publication_date": 20181102
    },
    {
      "title": "Won't buy again",
      "text": "I've taken krill oil for years, and tried these due to the price. I know some complain about the \"fishy\" smell of krill oil, but it's never bothered me. What does bother me is the vanilla smell in this product. It is nauseating to me. It's suspicious they have to disguise the smell of their krill. I'll go back to my previous brand without the vanilla smell. I quit taking after a couple days, so I cannot say if these are a good quality or not, but will say my arthritis seems worse since starting these.",
      "rating": 1.0,
      "verified": true,
      "author": "M Lee",
      "helpful_votes": 5,
      "publication_date": 20190418
    },
    {
      "title": "These will work but give them 2+ months",
      "text": "If you take krill oil ....these are , in my experience, the best you are going to find out there right now. Combine this with Chondroitin and 2000mg dose vitamin C and Lysine and you are in Dr Linus Paulings prescription for long life and MORE IMPORTANTLY....my own experience for a much improved joint pain regimen. TAKE GLUCOSAMINE AND CHONDROITIN. IT WORKS. IM CONVINCED OF IT. 20 YEARS OF EXPERIENCE. IT WORKS FOR ME AND ALMOST EVERYONE I KNOW OF. NO JOKING AROUND. GOD BLESS",
      "rating": 5.0,
      "verified": true,
      "author": "Jegs911",
      "helpful_votes": 4,
      "publication_date": 20191107
    },
    {
      "title": "Small size, no bad smells or taste.",
      "text": "I haven't taken them long enough to know how they're working...don't have follow up with doctor for bloodwork til November. I Like that the capsules are not huge like fish oil usually are. These I can take, no aftertaste or upset stomach. If they accomplish what mt Doctor wants, I'll give them 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "cincy grammy",
      "helpful_votes": 5,
      "publication_date": 20180307
    },
    {
      "title": "I take these every day",
      "text": "I've been allergic to seafood since I was about 9. I used to love it, ate fish, crab, and shrimp all the time. I grew up in DC/Maryland and had family near the shore, so crabs were a big part of my life until allergies kicked in. A few years ago, I started taking Megared Fish Oil in with breakfast and dinner and this with lunch. Since then, my allergy has radically decreased in severity. I'm basically iocaine powdering myself, building up a natural resistance so that I can once again eat seafood without risk of dying. Added benefit: these seem to help level out my depression. Wins on all points.",
      "rating": 5.0,
      "verified": true,
      "author": "David Hankla",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Love The Taste of this Supplement",
      "text": "I have tried several other Fish & KrillOils and they all left bad taste in my mouth. NOT THIS ONE!... It has a pleasant smell and taste. I would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 4,
      "publication_date": 20190305
    },
    {
      "title": "Less expensive than others",
      "text": "These were less expensive than the other brand I had purchased and seem to work just as well. I didn't realize they were supposed to help with pain relief so I didn't rate this.",
      "rating": 5.0,
      "verified": true,
      "author": "Nita Helping Hand",
      "helpful_votes": 4,
      "publication_date": 20190510
    },
    {
      "title": "Great Smell!",
      "text": "I'd been taking Red Krill Oil from a different company for years and there was always a slight fishy aroma to the capsules. These smell like old time vanilla ice cream I had as a child and are very easy to swallow. I checked the ingredients to see what could create such a wonderful smell and its Ethyl Vanillin. I had my wife smell it and she remarked that it was like eating a bowl of ice cream and she wonders if from the smell, she just gained 5 lbs. I look forward to taking these wonderful smelling capsules each morning! Whoever came up with adding this heavenly aroma to a normally fishy-smelling product should be heartily congratulated!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary H.",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Works for me",
      "text": "I know that krill is an excellent source of omegas and antioxidants. I have used Bronson brand for two shipments now, and I wouldn't be without it. My Dr. says my blood work is very good, my heart is very good, for a lady that is 72 years young.",
      "rating": 4.0,
      "verified": true,
      "author": "cubagal",
      "helpful_votes": 4,
      "publication_date": 20180515
    },
    {
      "title": "love this product",
      "text": "Consult your doctor first!!! I stopped taking Cholesterol reducing medicine & started taking this. Blood work shows no increase after several months. One pill in the morning and one at night.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 5,
      "publication_date": 20180612
    },
    {
      "title": "Great Product!",
      "text": "Great product! I’m hoping this helps lower my cholesterol level as I can’t take statins. If you have GERD or IBS I suggest starting with 1 pill a day at night rather than in the morning on an empty stomach. They will bother your stomach at first if you’re sensitive. This is a quality product! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "SisuGal",
      "helpful_votes": 3,
      "publication_date": 20180907
    },
    {
      "title": "Part of a healthy regimen to rebuild a body stressed by medications",
      "text": "Since my Mom has started taking this krill oil we have seen marked improvement in her health. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190309
    },
    {
      "title": "Minimal taste and tolerable by someone who hates fish!",
      "text": "Easy to take. Best fish oil product so far based on aftertaste! Very mild and infrequent occurrence of tasting fish after taking supplements. I am nauseated by taste of any fish and tried many supplements that I could tolerate. Sometimes noted shortly after taking but so mild I have purchased for many months now. Using for natural pain relief with fibromyalgia. I can not say it helps pain like commercial antiinflammatories would quickly treat a headache, for example, but in general I believe it helps overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190513
    },
    {
      "title": "Why does it taste of vanilla??",
      "text": "I've used several of Bronson's products in the past with good results, so I figured I would give these a shot. They seem to be of high quality. BUT.... the packaging makes one think that one caplet is 1000IU, which it is not. And there is the taste.... I dont understand how a fish/krill product can taste of vanilla. I'm not a huge fan of \"fish burps\", but \"vanilla burps\" after taking krill oil is bizarre.",
      "rating": 3.0,
      "verified": true,
      "author": "clay g.",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "They help. 👍👍",
      "text": "These make a pleasant difference in my joint pain. You need to take them everyday. In about a week you’ll notice the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonJunky",
      "helpful_votes": 3,
      "publication_date": 20190718
    },
    {
      "title": "Better for you than fish oil",
      "text": "Switched to krill oil on doctor's advice, fish oil has tendency to increase calcium according to cardiologist. Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sondra",
      "helpful_votes": 3,
      "publication_date": 20190518
    },
    {
      "title": "Excellent Krill Oil",
      "text": "I have been taking this supplement for the past three months. I love the vanilla smell and have no worries carrying it with me and all my daily supplements. And haven’t experienced any burps or after taste.",
      "rating": 5.0,
      "verified": true,
      "author": "Selina",
      "helpful_votes": 5,
      "publication_date": 20181207
    },
    {
      "title": "Great small cap",
      "text": "This is great so much smaller than regular fish oil. Love this. Also add flax and primrose oil to your diet and do your research for fish and shrimp, these days salmon has one of the highest levels of heavy metals if you have chronic pain nausea go problems any kind of tremor get tested for heavy metals it’s a simple blood or hair sample ask your doctor . God bless",
      "rating": 5.0,
      "verified": true,
      "author": "stacy",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Good Product",
      "text": "So far I don’t notice a difference between taking this or not but it’s only been a couple weeks and my older brother highly recommended Krill",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190514
    },
    {
      "title": "Going to explore around but this product was fine.",
      "text": "It's hard to rate products like this because it's hard to say if they really work or not sometimes. I got this product because I'm on my feet, constantly moving at work with a lot of stress on my body. Overall, I would say I think this product helps with keeping up with the pain in my neck, and shoulders. But sometimes the pain in those areas become so bad and I need a pain killer to move on, now I would say that has become less since I have been taken these every morning which is a plus. But Ill probably try a different brand and see if anything changes but it could just be me.",
      "rating": 4.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "No fish smell from bottle -after cutting open -you have the real deal",
      "text": "bottle I got --has NO--- smell of fish- I couldn't belive --most -review - a terrible fish smell - this bottle my be really fresh -- or new formula- small easy to swallow - have never taken krill oil --as in the past -taken fish oil ---so will have to see how .they work -good reviews on that part --just cut one open -- O my -really fish smell - cod liver oil -now I'm really impressed with this krill oil --also no after taste--",
      "rating": 5.0,
      "verified": true,
      "author": "Loretta Oberdorf",
      "helpful_votes": 4,
      "publication_date": 20171124
    },
    {
      "title": "Good Stuff",
      "text": "Gout Gone ! Other side effects have been less pain in other joints. Now able to get my work out on at 49 years old and lose some serious weight that needed to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim A",
      "helpful_votes": 4,
      "publication_date": 20181231
    },
    {
      "title": "KRILL IS A THRILL",
      "text": "Being that I have seen the Nephilim in person, I use this Krill oil to cause my cholesterol levels to surpass even the most ferocious hybrids that ever walked the Earth. This Krill oil causes me to revert back to the days of Enoch when the Giants had a foothold in the human race. But lo, the Krill oil revealed by Angels saved the promised seed and bloodline, causing the book of Deuteronomy to even question its own inspiration. Krill is my fortress.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Gomez",
      "helpful_votes": 2,
      "publication_date": 20191203
    },
    {
      "title": "I'm tired of marketing fakeouts about the number of pills",
      "text": "I think it's a good product but when you compare this with others, keep in mind that when they write that to get the 1,000 mg they claim is in the bottle, you need to take two capsules, effectively doubling their stated price. Why don't they tell it what it is, the pills have 500 mg each. But then again, unlike some other companies,they do indicate that this is two servings. But why not say it's 500 mg?",
      "rating": 3.0,
      "verified": true,
      "author": "Rani Lueder",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "I recommend it",
      "text": "2000mg a day great for those with high cholesterol. I've gained an improvement after a month's use. Blood pressure stays constant in normal range.",
      "rating": 5.0,
      "verified": true,
      "author": "DragonflySummer",
      "helpful_votes": 4,
      "publication_date": 20180703
    },
    {
      "title": "Not sure how it's helping?",
      "text": "I heard great benefits about krill oil and maybe it's because I haven't taken it long enough or consistently but I don't see any benefits. The aftertaste is horrible and it's hard to swallow since the pill is quite large. I forget to take it because someone told me that I have to take it in the morning after a meal so it's easy to forget. I don't think this is for everyone.",
      "rating": 3.0,
      "verified": true,
      "author": "PoppyLove",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Higher potency",
      "text": "I just started using this brand so have little to report, and I changed brands when I learned the difference between the brand I was taking which only contained 350mg Vs 1000mg. Also, not much difference in size and easy to swallow!",
      "rating": 5.0,
      "verified": true,
      "author": "john a sahadi",
      "helpful_votes": 3,
      "publication_date": 20190523
    },
    {
      "title": "Easy to take",
      "text": "I have been taking this for about a month. Easy to take, no fishy aftertaste. It's too early to see if it helps lower cholesterol. Another 2 months should tell the story. Joan Nolan, Berlin, NH",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170126
    },
    {
      "title": "Trusted brand, great product.",
      "text": "I hadn’t seen Bronson vitamins in ages. I grew up on their various supplements. After receiving them, I was pleasantly surprised to see they’re still great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "MGeis",
      "helpful_votes": 4,
      "publication_date": 20180422
    },
    {
      "title": "Okay, I guess",
      "text": "These are okay, but taste a little bit rancid. I tend to chew them before swallowing. I still take them (2 capsules daily) though. I keep them in the refrigerator (although it says to store at room temperature) as here in Florida the house can get pretty hot if I remember to turn off the a/c when I go out. I'll probably try another brand next time to see if they taste any better.",
      "rating": 3.0,
      "verified": true,
      "author": "Dickens",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Satisfied",
      "text": "This product is very good . I used cod liver oil for all my life , but this is a great improvement . I will continue to use this product",
      "rating": 5.0,
      "verified": true,
      "author": "Stash",
      "helpful_votes": 3,
      "publication_date": 20181128
    },
    {
      "title": "Omega 3 without fishy drawbacks",
      "text": "I have taken this product for only a week and I am happy with the results. No fishy smell or burps. Small easy to swallow capsules.",
      "rating": 5.0,
      "verified": true,
      "author": "Roaddog 87120",
      "helpful_votes": 3,
      "publication_date": 20181205
    },
    {
      "title": "Good Product",
      "text": "The capsules have a fishy smell in the bottle but I have had no problems digesting them.",
      "rating": 4.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 7,
      "publication_date": 20161119
    },
    {
      "title": "Each caplet is ONLY 500 MG Clever DECEPTION",
      "text": "NOT such GOOD DEAL when you realize each tablet is only 500mg",
      "rating": 3.0,
      "verified": true,
      "author": "Da Man",
      "helpful_votes": 4,
      "publication_date": 20181205
    },
    {
      "title": "Yuck, stay away!",
      "text": "Horrible additives! Smells like artificial sweeteners! The smell of the product gives me a headache, let alone ingest! Read ingredients!",
      "rating": 1.0,
      "verified": true,
      "author": "April C.",
      "helpful_votes": 7,
      "publication_date": 20190103
    },
    {
      "title": "Great ! No after taste ez to swallow",
      "text": "I use this product for heart and brain health. I feel great and also it has helped my triglycerides come back down to normal levels plus when I get my blood pressure checked it’s always within normal limits. I buy this every month I don’t think I can go without it!!️",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklyn",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Great benefits from this small capsule!",
      "text": "These are not for pain relief , have no flavor, two questions that required stars. What they are good for is providing 1000 mg of Omega 3 and I feel the benefits everyday as I am no longer on Cholesterol medication, and I feel my heart is greatly improved by this product. I have taken control of my own health and feel better for doing it. This product is an important ingredient in my quest to not be a slave to numerous prescriptions.",
      "rating": 5.0,
      "verified": true,
      "author": "GailB",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Good value and no fishy taste",
      "text": "Good value, no fishy taste. Researched lots of brands like this one most. Nurse recommended...Dr. Approved",
      "rating": 5.0,
      "verified": true,
      "author": "D Sherlock",
      "helpful_votes": 2,
      "publication_date": 20190424
    },
    {
      "title": "Just as you would expect",
      "text": "These are exactly as I expected. I take them twice a day and this seller has the best price and quantities available. I will order from this seller again. And as promised there is no fishy aftertaste.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 4,
      "publication_date": 20170719
    },
    {
      "title": "Good product. but with deceptive labeling",
      "text": "The product seems to work well with no fishy smell or aftertaste. My only problem with the product is that the label says it is 1000 milligrams. Off to the side it states that the serving size is 2 capsules. The capsules are actually 500mg.",
      "rating": 4.0,
      "verified": true,
      "author": "Brer Rabbit",
      "helpful_votes": 2,
      "publication_date": 20190502
    },
    {
      "title": "All stuck together",
      "text": "I just opened my bottle and all of the pills are stuck together...literally. It's not cool.",
      "rating": 1.0,
      "verified": true,
      "author": "Dietz Meuller",
      "helpful_votes": 6,
      "publication_date": 20180924
    },
    {
      "title": "my favorite brand of fish oil",
      "text": "I've tried many brands and prefer this one. The pills are smaller than most with the same milligrams plus it's just a higher quality product",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 2,
      "publication_date": 20190402
    },
    {
      "title": "No bad aftertaste!",
      "text": "No bad after taste. As a matter of fact kinda milk chocolatey even?! The quality is just as good or possibly better then the Omega Red brand. I take krill for my heart and cholesterol but I feel like my whole circulation and mind are positively affected! Love it! No more Lipitor for me, been taking krill for a couple years now. Great product. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "David Salas",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "I feel this is the best I've found",
      "text": "Repeat customer here. I feel this is the best I've found.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20180521
    },
    {
      "title": "Works great on lowering cholesterol.",
      "text": "No aftertaste. My cholesterol has gone down considerably since taking kril oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 3,
      "publication_date": 20180817
    },
    {
      "title": "Value pack",
      "text": "Just found out that I’m allergic to it and didn’t know it , reordered but will ship back, great product if u don’t have a reaction to it",
      "rating": 1.0,
      "verified": true,
      "author": "LINDA SINCLAIR",
      "helpful_votes": 2,
      "publication_date": 20190329
    },
    {
      "title": "Best value available",
      "text": "It is difficult to find Krill oil gel caps that are economical and provide the recommended mg of Krill oil in addition to Astaxanthin. I used to buy Mega Red, and these make much more sense.",
      "rating": 4.0,
      "verified": true,
      "author": "Montana Harper",
      "helpful_votes": 2,
      "publication_date": 20190425
    },
    {
      "title": "I agree; memory has improved",
      "text": "Stinky smell but I can endure for the much lower price. Was wondering why I can think better and am getting more work done these days. I agree with the positive bloggers that it does improve memory. Am reordering today.",
      "rating": 5.0,
      "verified": true,
      "author": "Pauline T. Moulder",
      "helpful_votes": 4,
      "publication_date": 20170510
    },
    {
      "title": "Smelly but worth it",
      "text": "Fishy odor that comes with these are STRONG. But I bought them for my health not to smell. Very happy with product. One little krill pill compared to 3 or 4 fish oil pills is worth it",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 4,
      "publication_date": 20170128
    },
    {
      "title": "No bad aftertaste",
      "text": "I can't say that these have changed my health and I don't feel any difference, but that's pretty much the norm with this type of supplement. They are easy to take and have no fishy burps or aftertaste, so it's a win for me! I have to take 3 a day to reach my 2750 mg of Omega my doctor suggests, so it's nice that these are smaller in size than the other huge fish oil pills I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "mandican",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Solid quality",
      "text": "I have been taking fish oil for years. I recently upgraded to this krill oil and have been very pleased with the quality and my bodies reaction.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Hamilton",
      "helpful_votes": 2,
      "publication_date": 20190430
    },
    {
      "title": "Less likely to contain toxins such as mercury",
      "text": "The headline says the reason to use krill oil over fish oil. Of course, there is no way for the average user to know the true contents of the product or its efficacy, but krill oil seems safer in regard to toxins. I like the addition of another antioxidant in the product. Look me up in 20 years and I'll tell you how close to 100 I am.",
      "rating": 4.0,
      "verified": true,
      "author": "Morris C. McKee",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Excellent Product",
      "text": "I've tried several (OTC's) Omega3 Suppliments however, Non of them gave me the arthritic joint pain relief this particular brand has giving me. Taken Together with a good quality (Vit.D3) its a Miracle worker. - I Recomend This Omega Krill Oil To Anybody Suffering From Cronic Joint Pain.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean K. King",
      "helpful_votes": 2,
      "publication_date": 20191015
    },
    {
      "title": "Healthy Heart",
      "text": "I love that the pills are easy to swallow. I received the product quickly. I use this product for healthy heart function, since my job is very stressful",
      "rating": 5.0,
      "verified": true,
      "author": "Faithful ",
      "helpful_votes": 3,
      "publication_date": 20181125
    },
    {
      "title": "To better health:",
      "text": "I was pleasantly surprised with this product products in the past you definitely had a residual oil on the outer pill which was a distraction from the outcome to which is better health",
      "rating": 5.0,
      "verified": true,
      "author": "Lakrzy001",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Good value",
      "text": "Good value. I cannot attest to exact content like mg content, etc. I have no way of testing. Seems to do the job as I have been taking krill for maintenance over the years.",
      "rating": 4.0,
      "verified": true,
      "author": "AAA",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Krill oil, fishy to me",
      "text": "Unfortunately I am very fussy about fish tastes or smells. It did smell to me and I belched up fishy taste. Ugh! I had high hopes. Fortunately for my husband he now has a bottle of krill. I will go back to my old krill oil, that really doesn’t smell or taste. I don’t know if it helped with pain since I only took it once",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Bronson Krill Oil",
      "text": "The pills are small enough that they are easy to swallow (about a half inch). There is no strong fish odor or taste so far. A key factor for me is that the capsules were intact when delivered. I am pleased with these and would recommend this Krill Oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Bingo Bill",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Radiation free",
      "text": "Ever since the Fukushima meltdown ive gotten really really bad fish oils. Im pretty they sure were laced with isotopes from the meltdown. This one made me feel better. Unlike the other radiation laced brands that made me feel like i had cancer in my toe nails",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree B.",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Great!",
      "text": "I don’t think there’s any taste to these and they’re small and very easy to take. Don’t be misled by the reviews saying they’re not 1000mg. As the label states the SERVING SIZE is 2 and the AMOUNT PER SERVING is 1000mg. Good way to get omega 3s.",
      "rating": 5.0,
      "verified": true,
      "author": "C. E. Wright",
      "helpful_votes": 2,
      "publication_date": 20191202
    },
    {
      "title": "The Krill Oil Tablets are working well!",
      "text": "There is a slight fishy smell to the pills, which makes me feel even better about taking them. The pills are easy to swallow. I can feel the difference in my joints.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherita L. Thomas",
      "helpful_votes": 2,
      "publication_date": 20190504
    },
    {
      "title": "Good product",
      "text": "This is a good one! It's clean & the extra strength is nice to have. I have my own cleaning business, so I need to help my joints any way I can.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "Good tasting product",
      "text": "Product doesn't taste nasty like fish oils. However, I didn't see much improvement in my cholesterol levels despite a healthy diet using this product.",
      "rating": 4.0,
      "verified": true,
      "author": "mike covello",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great results",
      "text": "Over all I really like the pill so far, I feel a difference in my joints, but it's only been a few weeks so really need to 5ake longer for a better review. I also have been giving it to my son's dog that has lupus, I really see a difference in his coat.",
      "rating": 5.0,
      "verified": true,
      "author": "Dena W.",
      "helpful_votes": 3,
      "publication_date": 20191114
    },
    {
      "title": "Good Stuff for health",
      "text": "I am 72 yo and my health is more important to me now than ever before. This product helps my peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Da Grump",
      "helpful_votes": 2,
      "publication_date": 20181022
    },
    {
      "title": "No fishy smell or aftertaste",
      "text": "Bloodwork results say it all, these are a great supplement to help with your cholesterol. Would and have recommend/ed.",
      "rating": 5.0,
      "verified": true,
      "author": "chicmumma",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Krill Oil Capsules",
      "text": "Been taking this oil for awhile and like the results I've had., No problems with this and arrived right on time with good packaging. Would suggest the company add the fact these are 500mg capsules and the dosage is two per day. Good price. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Krill Oil, excellent",
      "text": "I have been using this product for a while now and I have noticed that my knee no longer is a cause of pain. I will continue and recommend using this brand. I do not notice a scent and it's also very easy to swallow as well. It's a very good product.",
      "rating": 5.0,
      "verified": true,
      "author": "KatzKiss",
      "helpful_votes": 2,
      "publication_date": 20191204
    },
    {
      "title": "Fine",
      "text": "Don't know if it is helping me, but I do know when I don't take it...I feel worse.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris DIYer",
      "helpful_votes": 3,
      "publication_date": 20180424
    },
    {
      "title": "I take these for chronic depression and swear by them!",
      "text": "I've been using this product for about a year and I am very pleased with it. I have it on a subscription.",
      "rating": 5.0,
      "verified": true,
      "author": "ChooseyShoesy",
      "helpful_votes": 3,
      "publication_date": 20180314
    },
    {
      "title": "Great product",
      "text": "Really good price for the product and quite effective. I actually give one of these daily to my dog as well as taking one myself. I notice less pain overtime and hopefully it will how to keep my heart healthy though I really don’t have issues. But I guess that’s the point! I do notice my dog moving more freely since he has been on these, he had knee surgery just over a year ago and after several months of these krill oil capsules plus tumeric he has done much better. Highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "MJB",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "The vanilla flavor is awesome no fishiness",
      "text": "I think these are the best price Krill oil supplements out there. The vanilla flavor is awesome. They are the least fishy is tasting omega 3 supplements I've ever taken. I will be buying these again. I would suggest anybody who does not like the smell or taste of Regular fish oil Supplements to try this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigworm420",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Came with capsules broken and leaking. Too late to returned",
      "text": "Disappointed. Looks as if it was stored in extreme heat. Discarded when discovered.",
      "rating": 1.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great product!",
      "text": "I've been taking Krill Oil for years and this is the best quality and quantity I've been able to find at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Thompson",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "A MUST HAVE",
      "text": "This can relieve chest pain, helos with your eye sight, and of course heart health, anti-aging, and detoxifier.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Not as effective Mega Red",
      "text": "After changing to this product from Mega Red my tryglicerides went up in blood test. Going back to Mega Red.",
      "rating": 1.0,
      "verified": true,
      "author": "Scotty",
      "helpful_votes": 3,
      "publication_date": 20190726
    },
    {
      "title": "Easy To Swallow",
      "text": "This product is easy to swallow. I take two each morning. They are 1000mg. Others are 500 mg and require 4 per day to have the same effects. I have just started taking this product and will update after a month's use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Rea",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Allergic reaction/I’m not allergic to shellfish",
      "text": "I have taken krill oil before as Mega Reds, so I thought I would try this cheaper one. I’ve never had a shellfish or any allergies, but this made me break out in a rash on my hands.",
      "rating": 1.0,
      "verified": true,
      "author": "Randolph V. Rome Jr.",
      "helpful_votes": 3,
      "publication_date": 20191031
    }
  ],
  "product_meta": {
    "title": "Bronson Antarctic Krill Oil 1000 mg with Omega-3s EPA, DHA, Astaxanthin and Phospholipids 120 Softgels (60 Servings)",
    "rating": 4.6,
    "feature_bullets": [
      "SUPERIOR QUALITY: Heavy Metal Tested, Non GMO, Gluten Free and Soy Free. Bronson uses best ingredients available. Laboratory tested NON-GMO. All Bronson products are tested in our state-of-the-art cGMP registered facility in New York.",
      "100% PURE ANTARCTIC KRILL OIL: We only use superior sourced krill harvested in the waters of Antarctica. Our Antarctic Krill Oil supports healthy cholesterol levels and helps to maintain healthy blood pressure within a normal range.* 1000 mg per serving (2 softgels).",
      "OMEGA-3 ENHANCED: Provides Omega-3 Fatty Acids, Omega-3 Phospholipids and Natural Astaxanthin.",
      "TRUSTED SINCE 1960: The pioneers of Bronson Vitamins were a group of pharmacists who witnessed the benefits of vitamins and mineral supplementation firsthand with their patients. Bronson Vitamins have been consistently mentioned by top medical professionals since our inception in 1960.",
      "1 YEAR SATISFACTION GUARANTEE: We back our products up with a 365-day hassle-free money back guarantee. There's no risk when you order now!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "4.6 x 2.5 x 2.5 inches; 4.8 Ounces",
      "Item model number": "No Model",
      "Date First Available": "October 19, 2016",
      "Manufacturer": "Bronson Labs",
      "ASIN": "B01MCWCO2Y",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Vitamins & Dietary Supplements",
      "Supplements",
      "Health & Household",
      "Essential Fatty Acids",
      "Health, Household & Baby Care",
      "Krill Oils"
    ],
    "price": 27.99
  }
}