{
  "website_summaries": [
    {
      "verdict": "A very affordable alarm clock that comes in fun colors and is extra durable.",
      "pros": [
        "Features a large display and a nightlight function",
        "Alarm increases in volume over 60 seconds",
        "Includes a shock-proof silicone cover",
        "Small design makes it great for travel"
      ],
      "cons": [
        "Can be hard to read at night without tapping the backlight button",
        "Runs on two AA buttons with no AC adapter option"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It turns off!",
      "text": "So this was working fine for my daughter. It slowly increased in volume, and so we liked that feature as it eased her into waking up. However, the fun ended when she discovered that if she just waited a minute or two after it went off, the alarm TURNS OFF. It only took her a week to figure it out, and she just lays in bed for a minute, waits for it to turn off, then goes back to sleep. What kind of alarm does that?!",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 20,
      "publication_date": 20181206
    },
    {
      "title": "Best Twelve Bucks You Can Spend",
      "text": "My first Plumeet alarm clock made it 5 1/2 years of daily use before giving up the ghost. Replaced batteries just three times during its life. Just bought another one (in a heartbeat). Self-dimming nightlight, gentle ascending alarm, long lasting, portable, ridiculously simple to set. Best twelve bucks you can spend.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Palmer",
      "helpful_votes": 15,
      "publication_date": 20190814
    },
    {
      "title": "Easy to Use, Convenient and Portable",
      "text": "I originally bought one of these clocks from Walmart, but it stopped working after my younger brother decided to bring it into the bathtub with him. After some time I decided to order one from Amazon, and it works just as well! What I like about these clocks is that they’re easy to set up and they’re convenient. I love that this clock is very portable. I usually sleep through my phone alarm, but this little clock almost never fails to wake me up. The settings are also incredibly easy to set up. I’m glad I decided to buy another one of these little guys.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi Castilla",
      "helpful_votes": 11,
      "publication_date": 20200201
    },
    {
      "title": "Nice and small",
      "text": "Nice small clock. Wife has it on the bathroom counter to keep track of time while she gets ready. Rubber or Silicone shell prevents water from affecting finish. Large display is easy to read",
      "rating": 5.0,
      "verified": true,
      "author": "AWS",
      "helpful_votes": 34,
      "publication_date": 20191124
    },
    {
      "title": "Perfect for the purpose",
      "text": "While I would not use this by my bedside I do on my desk. It's compact but easy to read. If the room lighting is dim, I push the dayglo button, and the LCD screen illuminates. Has time, date, and alarm time. Simple and battery friendly. Buy one. Would be great for kids and comes in cool colors.",
      "rating": 5.0,
      "verified": true,
      "author": "The Cloud",
      "helpful_votes": 14,
      "publication_date": 20181125
    },
    {
      "title": "Very happy",
      "text": "Adorable I love it. Easy to quickly set up. Love the material. Perfect as my bathroom getting ready don't lose track of time clock. Soft rubber outside easy to clean. Perfect pink shade. Perfect small size but with easy to see large numbers. Only thing I wish it had is a light sensor and nightlight. Wasn't a big enough deal though to choose another. This one is a very fair price. I also don't really need to see it at night, since it's my bathroom clock.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly M. Pettersen",
      "helpful_votes": 16,
      "publication_date": 20170318
    },
    {
      "title": "I like the soft rubber encasing",
      "text": "My nine year old daughter requested an alarm clock to get up for school and of course, I hopped on Amazon immediately. I like the soft rubber encasing, the ease of the directions and setting it up and also that the alarm is loud enough to wake her but not her brothers sleeping in the next room. The light feature is a nice touch and you really can't beat this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 19,
      "publication_date": 20160811
    },
    {
      "title": "Cheap clock, not worth it.",
      "text": "The photos online make this seem like a cute, novel clock. In fact, it is a waste of money. The screen only lights when you push a button and only the screen lights up, not the whole clock. It's hard to read the display. I am completely unsatisfied. The company says they want feedback if you aren't satisfied, but my comments fell on deaf ears. Do not buy this item!",
      "rating": 1.0,
      "verified": true,
      "author": "Elle B.",
      "helpful_votes": 2,
      "publication_date": 20190423
    },
    {
      "title": "Perfect for my 7 year old!",
      "text": "My daughter is so excited to have her own alarm clock! Technically I guess this is more of a travel alarm clock model but with a bright pink case there was no way I could pass this one up. It's not fancy, but functional is the point of an alarm clock, right? Programmed this without using the instructions! Love the separate buttons and toggles. With a few switches and clicks I had the clock up and running and an alarm set! Probably will purchase a second for my son.",
      "rating": 4.0,
      "verified": true,
      "author": "Patty Gordon | The MomMe Life",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "Don’t waste your money",
      "text": "I bought this alarm to use at home, not travel . I prefer the folding style for traveling. It is exactly what I wanted. The display is easy to read. I really like the ability to press a button to get it to light up to see the time during the light without having a lit display all the time. UPDATE: I wrote this review too soon. After 5 days, the light quit working. The next day the display quit showing. I am very disappointed. This is worthless.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "The Best Green Time Machine",
      "text": "Love this clock! I have a bad habit of knocking my alarm clocks off of my nightstand. This one is rubber coated, so it stays in place and is padded, should it fall. The buttons are a bit tiny to read and use, but overall, I'm super-pleased with this clock. There's a nice snooze button that also lights up with luminescent green in case you want the time after dark. It's easy on the eyes and doesn't wake anyone else up.",
      "rating": 5.0,
      "verified": true,
      "author": "Green Lover",
      "helpful_votes": 14,
      "publication_date": 20170917
    },
    {
      "title": "Great clock!",
      "text": "I bought one of these for my daughter and my son had to have one. We love these clocks and they are very easy for my kids to use.",
      "rating": 5.0,
      "verified": true,
      "author": "DIY123",
      "helpful_votes": 32,
      "publication_date": 20200527
    },
    {
      "title": "Simple to Operate, Functional, and Easy to Read",
      "text": "I have several of these, in a variety of colors, scattered about my house and in my office. They are super simple to operate, reliable, and easy to read. I rely on the one by my bed to get me up each morning, and I am a heavy sleeper. Haven't been late to work yet! I take one with me when I travel, and it is easy to pack and use anywhere. I highly recommend this bargain alarm clock.",
      "rating": 5.0,
      "verified": true,
      "author": "g3 from the UP",
      "helpful_votes": 14,
      "publication_date": 20170410
    },
    {
      "title": "Alarm doesn't ring long enough",
      "text": "We like the ease of setting the alarm, time and date. However, the alarm only goes off for the 60 seconds of the time you set it for. So for us we set it for 6:45 and the alarm only rings until 6:46....which doesn't wake up my kids.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Just ok",
      "text": "It's ok, I got it for my infant son's room so when I was feeding him at night I could see the time. But the screen doesn't stay lit all night, it's off very quickly. It was ok to use, it's just been a while since I have used anything but my phone as an alarm clock. It's soft and feels sturdy, just not 100% what I hoped it was and I probably wouldn't buy it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Amazing clock!",
      "text": "It's not a good habit to wake up late, and I hate the sounds on my iPad alarm, so I went searching for an alarm clock... then I found this. It gives you exact instructions of how to set up the clock, it's super cute and portable, kind of small (fits in the palm of an 11 year old's hand) it works great and the color is super pretty! I also love how it has a little light up button! Pros: - portable - works smoothly - light up/snooze button - shows time, date, and alarm time Cons: - silicon cover (dirt will easily stick on) - alarm lasts only one minute",
      "rating": 5.0,
      "verified": true,
      "author": "Rihanna nishat",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great for Kids!",
      "text": "My daughter started waking up in the middle of the night and asking what time it was. We got this for her and its perfect! You press the button and the back light comes on so you can see the time in the dark. Easy to use, easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Graham Harris",
      "helpful_votes": 10,
      "publication_date": 20190419
    },
    {
      "title": "Super tiny clock you can’t see at night",
      "text": "I guess I didn’t notice that this clock is a “ travel” clock. So I guess that would explain it’s small size. I was expecting a much bigger clock. The second huge problem is that in order to see the time in the dark you have to press a button to turn its light on to see it. I am hugely disappointed in this product. I feel like the pi was misleading.",
      "rating": 1.0,
      "verified": true,
      "author": "Greta Olson",
      "helpful_votes": 2,
      "publication_date": 20190529
    },
    {
      "title": "And I like that the light only last for a few second ...",
      "text": "The night light is really soft, but you can still read the time clearly. The display is actually quite large. And I like that the light only last for a few second then shut itself off so it does not disturb your sleep. It's also wrapped around with rubber-like material, so no worry for drop and broken.",
      "rating": 5.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 13,
      "publication_date": 20171018
    },
    {
      "title": "Super neat to get for you kiddos as a starter alarm clock.",
      "text": "I actually really like this, and so do my daughters. We took it out the box and set it up pretty fast. They’re excited to use it tomorrow morning when they get up. :) Worth the price. It’s really small, but the green color pops",
      "rating": 4.0,
      "verified": true,
      "author": "Tommi",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Great clock for kids rooms",
      "text": "Purchased this initially and had to exchange due to a faulty display. Replacement works perfectly well. Simple and does the job. I really wanted something that is not visible in the dark (distracting for a child during the night), but that would light up for a few seconds if needed (with a push of a button) - this is ideal.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer Val",
      "helpful_votes": 8,
      "publication_date": 20191014
    },
    {
      "title": "As stated",
      "text": "The button to push to see the time is a rather loud click but other than that it’s a good clock",
      "rating": 4.0,
      "verified": true,
      "author": "cnlittle",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Nettepoo’s review",
      "text": "I purchased this Clock in April 2019. Wasn’t pleased. However, the manager of the company Lawrence Fisher resolved my unhappy issue about the Clock. Mr. Fisher provided me with several options of creating happiness for me as a customer. A replacement Clock was given and my daughter and I are ecstatic customers. Thank you Lawrence Fisher!",
      "rating": 5.0,
      "verified": true,
      "author": "Teanette Weaver😞",
      "helpful_votes": 8,
      "publication_date": 20190624
    },
    {
      "title": "Perfect for younger kids",
      "text": "This alarm clock is perfect for my daughter! She loves pink and was really struggling to get up for school. The beeping is not too loud and starts slower and then the beeps increase. She can independently turn it off and on.",
      "rating": 5.0,
      "verified": true,
      "author": "Lunchbox",
      "helpful_votes": 15,
      "publication_date": 20170209
    },
    {
      "title": "Bright color as expected -",
      "text": "I'm happy with the bright pink that I chose...it sits on my computer desk. As for a travel clock, I believe I would choose a clock just a bit thinner. I had no trouble setting the clock, and it reads easily.",
      "rating": 4.0,
      "verified": true,
      "author": "sas",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Its a good clock though",
      "text": "Smaller than I thought and I wish I had actually read the description because it is battery operated and I would rather have a plug in. But it is very cute. It does not glow all the time. Just when you hit the light button. Its a good clock though.",
      "rating": 4.0,
      "verified": true,
      "author": "jessica",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Wish The Alarm Sound Was A Bit Louder.",
      "text": "Cute little alarm clock. I like the color, size, features, everything, except I am an extremely heavy sleeper, and I wish the alarm sound was a bit louder.. But I'm sure for normal people, it will work just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "SpookySelf.13",
      "helpful_votes": 2,
      "publication_date": 20180131
    },
    {
      "title": "Thinks twice. It's battery operated and has a faint alarm.",
      "text": "I should have looked more closely at the size and the capabilities. This alarm clock only runs on batteries and only illuminates with the press of the top button. The alarm is so faint it doesn't wake my daughter. She slept through it several times.",
      "rating": 3.0,
      "verified": true,
      "author": "Kim Koch",
      "helpful_votes": 3,
      "publication_date": 20170428
    },
    {
      "title": "Today's Date?",
      "text": "All I wanted was a small battery powered black clock for the master bathroom that displayed the date in addition to the time. The unit has met all of my requirements.",
      "rating": 5.0,
      "verified": true,
      "author": "Dibbles of Kenmore",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "I have purchased several for several kids",
      "text": "I have bought this clock several times in several colors for my kids. They have held up well for ages three through 12. Very handy and the battery seem to last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanful",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Great for kids!",
      "text": "Great! Just what I wanted — nice and dim with big numbers for my 8 year old.",
      "rating": 5.0,
      "verified": true,
      "author": "MaryG",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Alarm not predictable...cannot depend on it",
      "text": "The alarm is not predictable as far as going off. One day it is fine the next day it does not make a sound. I did like the size, shape and color but it is not worth much if the alarm is not predictable",
      "rating": 1.0,
      "verified": true,
      "author": "nowords",
      "helpful_votes": 4,
      "publication_date": 20160922
    },
    {
      "title": "Buy it!",
      "text": "This little clock is awesome. Bought a pink one for my daughter and a green one for my son. So easy to program, perfect for their bedrooms. Excellent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Cute and good first alarm",
      "text": "Bought for my 9 year old daughter to have in her room. She loves it. She is able to set and unset her alarm without any help. She loves the dim Light it gives off too. Reasonably priced first alarm!",
      "rating": 4.0,
      "verified": true,
      "author": "mdb27",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Affordable, darling, practical",
      "text": "We bought this for our granddaughter and her fifth birthday. She really enjoys having her own clock and is quickly getting a better understanding of time. The bright pink color is perfect and as pictured, and the clock is very easy to set up. The only drawback is that batteries were not included.",
      "rating": 5.0,
      "verified": true,
      "author": "MWGal",
      "helpful_votes": 13,
      "publication_date": 20161019
    },
    {
      "title": "Clock",
      "text": "This clock fits on my dash next to the speedometer. It is easy to set-up, looks great. Easy to see. I like the backlight when driving at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Easy to use, and very sturdy",
      "text": "Nice little clock. Feels very sturdy too, with it's rubber case. Easy enough to set. Hard to see when not pushing the light button. I like the alarm sound, just a beep. Easy to hit snooze.",
      "rating": 5.0,
      "verified": true,
      "author": "JustMe",
      "helpful_votes": 7,
      "publication_date": 20200315
    },
    {
      "title": "Would not purchase again",
      "text": "The screen was never very good. Like weirdly warped or something? It’s for my small child and she never actually uses it so no big deal for us",
      "rating": 1.0,
      "verified": true,
      "author": "Scarlett",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Second Clock Like This!",
      "text": "This is the second one I've used. First one lasted for many years and finally gave up the ghost. It's not the greatest to look at, but it is an excellent alarm clock! Very reliable and easy to use and read.",
      "rating": 5.0,
      "verified": true,
      "author": "Starlight",
      "helpful_votes": 7,
      "publication_date": 20191223
    },
    {
      "title": "Defective.",
      "text": "I got one for my daughter and was rather disappointed after getting the batteries in, the back of the battery door wouldnt close with them in there. Had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Z.",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Nice bargain!",
      "text": "I really like this clock! I'm a truck driver and wanted a clock I can take on the road with me. I'm going to get a purple one next, so I can have both time zones that I drive in at a quick glance. Green for Mountain time & purple for Central time.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff mac",
      "helpful_votes": 7,
      "publication_date": 20190720
    },
    {
      "title": "Perfect size!",
      "text": "This was the perfect size alarm clock for my daughter night stand! We were looking for something easy to use and small yet small enough it wouldn’t take up a lot of space. It also was a fun color! Perfect for a young child ready for their first alarm clock!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20191012
    },
    {
      "title": "I received the wrong color",
      "text": "This clock works fine, is compact and easy to use. I ordered black and received lime green. Figured it was too big a hassle to exchange it.",
      "rating": 4.0,
      "verified": true,
      "author": "JLC",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Wouldn't buy it again",
      "text": "Back dosen't remain lit long enough or, maybe it should have had o function that light the screen up on the hour or every half hour. This item is of no use in a dark room if you are not able to press the back light button.",
      "rating": 4.0,
      "verified": true,
      "author": "Lamell",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "GOOD",
      "text": "Accurate time-telling. Lights up brightly, so you can tell the time in the night, then light goes off. Outside is rubberized so that if your knock it off the table, it won't be damaged. Good feature for travel, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Matthews",
      "helpful_votes": 7,
      "publication_date": 20191023
    },
    {
      "title": "Perfect for Kids",
      "text": "It's a bit tricky to set the alarm and time, but once you do, it's done. Great for kids. Durable and fun! It's small, about the size of a deck of cards. But works nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ennis",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "For my 8th year old",
      "text": "Got this for my 8 year old son. unfortunately the light doesn't stay lit up for long. just for a second. i was hoping the night light will stay lit all night long.",
      "rating": 3.0,
      "verified": true,
      "author": "Blk",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Simple and works great",
      "text": "7 yo wanted an alarm clock for his birthday, so this is what he got! I set it all up for him and he sets it at night before school. Easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsie stevens",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Clock",
      "text": "Worked for 6 weeks. Now it stopped working. Tried several sets of batteries, even took batteries out of something working to try. Still nothing. Update: Seller reached out and refunded for product.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Snooze times are mislabeled!",
      "text": "Description say 8 minute snooze, it is not. It has a 5 minute snooze. Even the box it comes in says 8 minutes, but the instructions inside say 5 minutes. Other than that it’s fine, you get what you pay for.",
      "rating": 4.0,
      "verified": true,
      "author": "Emt509",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Does not ring loud enough, and returning it is a hassle.",
      "text": "Bought for $14, received it and realized that it rings too softly to wake up kids. Tried to return it and was being charged $6 for return. Not impressed at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony Osa",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Cute",
      "text": "Very cute..perfect for my 9yr old daughter. She loves it! easy to use...lot of knobs behind to provide a lot of control.",
      "rating": 5.0,
      "verified": true,
      "author": "Srikki",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Thank you",
      "text": "I like it the only problem is that the clock only lights up when you touch the button it’s not always lit. So it is hard to see.",
      "rating": 3.0,
      "verified": true,
      "author": "Karyn",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Seems to be mostly for travel",
      "text": "This is going back. Nice for travel, but I needed this for my kids room. It doesn't plug in and is so light, it will be toated away from the night stand.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Very happy with this for my daughter",
      "text": "This is great for daughter. She's getting the hang of setting it herself. It gets tossed around her room so she can track her reading time etc and holds up well.",
      "rating": 5.0,
      "verified": true,
      "author": "MEG",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "DO NOT WASTE YOUR MONEY!!",
      "text": "Constantly needs new batteries. Light doesn’t work and can barely see the time, date and alarm on screen. Wish I didn’t buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Great alarm clock!",
      "text": "It’s great for kids, it’s my daughters first alarm clock. The sound gradually gets louder and faster, so it’s not a harsh sound to wake up to. My only complaint is that the button on top doesn’t turn off the alarm it snoozes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Mendiola",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Pretty color, hard to set, not very bright time",
      "text": "Not very bright. This is with new batteries (not included) it's hard to set but the color is pretty and the alarm is loud.",
      "rating": 4.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Nice compact digital clock",
      "text": "Nice compact design. Using in a emergency portable ham radio “go box”. Only improvement I would like to see would be a dual time display option.",
      "rating": 5.0,
      "verified": true,
      "author": "David K",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "its ok but no use to me",
      "text": "i thought this has the backlight on it. but you actually have to press the button up top to turn on the lights that dont stay lit for more than 4 seconds. whats the point, i purchased this so i could see the time in the middle of the night in my dark room when i wake up. but its of no use to me now.",
      "rating": 2.0,
      "verified": true,
      "author": "Naa ny",
      "helpful_votes": 3,
      "publication_date": 20160906
    },
    {
      "title": "Wonderful little clock!",
      "text": "Great little clock. I might get another one for other rooms in my house, but I'm trying not to be obsessive.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Omari Robbins",
      "helpful_votes": 2,
      "publication_date": 20180610
    },
    {
      "title": "My daughter loves it",
      "text": "It's so cute! My daughter likes her room very dark so it's nice that this clock isn't always on. There is a pink backlight that can turn on with the touch of a button.",
      "rating": 5.0,
      "verified": true,
      "author": "Gooddaysunshine",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Great Product",
      "text": "I use this in my classroom. I have it on my sign out desk for the restroom. The light feature is nice and the numbers are large.",
      "rating": 5.0,
      "verified": true,
      "author": "John Winand, Jr.",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "For the price it works",
      "text": "My niece did like this clock she got for her birthday. Her Mom and I did think it was a little small, not very clear when ordering just exactly what size this clock is.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew S.",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Don’t waste your money",
      "text": "The lighting for the time and date go in and out pending how it’s held. Also the light up/snooze light won’t work either. Super disappointed. For $13 it’s not worth wasting the gas to take it to an Amazon drop off to return and to find something to pack it in. Don’t buy it!",
      "rating": 1.0,
      "verified": true,
      "author": "blondiec-21",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great little alarm clock",
      "text": "We use this for our 4 year old daughter. She loves it. It is small, covered in soft silicone, and bright pink. It is easy to set, has one alarm, and a snooze button that also illuminates the face. The alarm is a beep that is not to annoying, but loud enough to wake most people.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Augustine",
      "helpful_votes": 0,
      "publication_date": 20160830
    },
    {
      "title": "Perfect for Travel",
      "text": "Plumeet Easy Settinf Digital Travel Clock is the perfect portable lightweight alarm clock. It works very well and the light is bright enough to see in a dark cabin on a cruise!",
      "rating": 5.0,
      "verified": true,
      "author": "NikkiNYC",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Almost a good one",
      "text": "Like the clock but it is hard to turn off. It might be because of my long nails (?)",
      "rating": 3.0,
      "verified": true,
      "author": "Joann Landers",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great alarm clock",
      "text": "I like the big numbers easy to read. Very easy to set time, date and alarm time. I also like that you can see if the alarm is on. The alarm that wakes you up is not overly load but is very persistent and no problem with the clock waking you up. Just the right size if you use it at home or take it as a travel alarm on your trips.",
      "rating": 5.0,
      "verified": true,
      "author": "CathyL",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Simple Clock",
      "text": "I bought this my 10 yr old daughter to use in her bedroom. She loves it!!! Simple to use, child friendly, awesome pink color, loud alarm clock, and a super cute size. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda E",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Got this for my son. Only con is that ...",
      "text": "Got this for my son. Only con is that you can't set the alarm for weekdays only. Other than that, no complaints. Works well and he has gotten in the habit of turning it on every school night.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Saunders",
      "helpful_votes": 4,
      "publication_date": 20160525
    },
    {
      "title": "Doesn't work",
      "text": "Well it arrived on Friday. I set it up for my 9 year old daughter. She loved it until Sunday the alarm didn't go off. Then Tuesday the screen went blank. Changed the batteries and nope still not working. It is cute but ultimately a piece of crap!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kinzi",
      "helpful_votes": 2,
      "publication_date": 20161101
    },
    {
      "title": "Cute, just what we needed",
      "text": "Excellent and cute! daughter loves it for school and looks cute in her room.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimp",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great simple clock",
      "text": "Bought for my son who loves Minecraft. Simple, easy to read, great color.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren P",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Cute clock!",
      "text": "This alarm clock is very easy to read and an added bonus is that the light does not stay on all the time. The only drawback is that it is not really useful as an overseas travel alarm as it is a 3\" cube. It is a bit tricky to re-set the wake time, but other than that it works well.",
      "rating": 4.0,
      "verified": true,
      "author": "research4u",
      "helpful_votes": 2,
      "publication_date": 20160406
    },
    {
      "title": "Great for my 9 year old daughter",
      "text": "My daughter loves this little clock. It is very small and the alarm is not very loud, however it still wakes her up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Hansen",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Does the job",
      "text": "It’s a nice product for the cost. It’s light wait and easy to use. My daughter loves it and that’s what matters! I used double a batteries for this product. The clock actually has a pink cover case on it.",
      "rating": 4.0,
      "verified": true,
      "author": "sabrina a",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Perfect!",
      "text": "Perfect little alarm clock! Had others, they were too bright, too loud, too hard to set! This one has a light that only goes on when you tap it!",
      "rating": 5.0,
      "verified": true,
      "author": "Max 908",
      "helpful_votes": 2,
      "publication_date": 20170720
    },
    {
      "title": "Nope!",
      "text": "Waste of money. The only thing on this clock that works right is the great rubber case.. The switches on the back for resetting time and alarm is super glitchy, not very bright and all around cheaply made.",
      "rating": 1.0,
      "verified": true,
      "author": "Chazz",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "GREAT COLOR",
      "text": "Liked most features would be easier to read if light stayed on a bit longer. Liked feel of clock",
      "rating": 4.0,
      "verified": true,
      "author": "goldendove9",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Cute Light but Dim",
      "text": "Cute clock. Battery operated only and light dim. Probably better for travel",
      "rating": 3.0,
      "verified": true,
      "author": "Ladytiffknee",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great little clock!",
      "text": "I use it for a bedside alarm clock. I bought it for its small size.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "FAST SHIPPING! works great!",
      "text": "So cute! So simple. My daughter loves this!! Great for a child's room!",
      "rating": 5.0,
      "verified": true,
      "author": "TC335",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Alarm on clock stopped working within a week a getting it.",
      "text": "I bought this clock to help my granddaughter adjust to her new kindergarten time schedule. It does keep time, but the alarm quite work almost immediately! Save your money and invest in another well made clock.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda J.",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Decent clock Small size",
      "text": "It was hard to set it at first Nice color purple Nice backlight",
      "rating": 4.0,
      "verified": true,
      "author": "jackiet",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Easy to use. Perfect display! Happy with my purchase.",
      "text": "Happy with this purchase. Easy to set up and does the job! No more being late to work for me :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "not my fav",
      "text": "It is hard to set the time on it and the alarm. The numbers are nice and big but It wasn't my favorite thing.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "5 Star",
      "text": "I bought for my 8 year old daughter. The perfect brightness. Very easy to read. And easy to use. She hasn’t slept through the alarm and has been up on time since purchasing!",
      "rating": 5.0,
      "verified": true,
      "author": "D.W.",
      "helpful_votes": 7,
      "publication_date": 20190528
    },
    {
      "title": "Great product",
      "text": "My son loves it. Easy to use & matches his room theme.",
      "rating": 5.0,
      "verified": true,
      "author": "mamastook",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Exactly has described",
      "text": "Easy to set up. Nice color. Works great. Good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Romans",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Simple and cute",
      "text": "Easy to set up. An office down the hall has the one in pink and I was inspired to get it for our office's waiting room for clients filling out paperwork.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Display issues...",
      "text": "I bought this alarm clock for my 9 yr old daughter and it seemed like every time she touched it, the time would go absent or the alarm would reset. After 2 days of this, I just tossed it in the trash. We replaced the batteries and it still kept doing it so it had to go. It is easy to set and easy to read though...",
      "rating": 1.0,
      "verified": true,
      "author": "Vicky",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Odd display",
      "text": "When you look at the clock face directly the display is super faded - as if really old batteries were put in. But if you look at it tilted at an angle is it really clear. Returning.",
      "rating": 2.0,
      "verified": true,
      "author": "A.J.N.",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "I keeps the time as set, and I hear ...",
      "text": "I keeps the time as set, and I hear the deep from my daughters room as expected. Doesn't always get my kid out of bed, but I understand this was not in the product description. It looks cute on her shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "A.Valentine",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Great alarm clock",
      "text": "Bought it for my daughter. She loves it and it serves its purpose -the alarm wakes her up in the morning",
      "rating": 5.0,
      "verified": true,
      "author": "Ms",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Great alarm clock for kids",
      "text": "We bought this for my six-year-old son. He loves to turn it on each night. He jumps up in the morning and is much easier to get ready for school. He loves being woken up by the alarm versus Mom or Dad.",
      "rating": 5.0,
      "verified": true,
      "author": "Cara Dyksen",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Big numbered and easy to use.",
      "text": "My 4yo wanted a clock in her room and this was both a good price and big numbered so when she is ready to tell time, this will be an easy thing to use. Its also got easy off switches for the alarm so she you know when its off.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn c.",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Cute clock",
      "text": "Love this clock so much I will be buying more in the future. It small and portable so I take it everywhere around my house. At night it comes in handy because I have it right next to me and easily can check the time.",
      "rating": 5.0,
      "verified": true,
      "author": "TABITHA",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Nice simple digital clock",
      "text": "Needed a little clock for work, and this one was perfect for my needs. And it's purple. Light, small, simple, easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Bartroff",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Not a nightlight clock but still does the job",
      "text": "It’s small but works as it should. I wish the colored light was more of a night light and not so temporary, you have to push a button to get it to light up and it stays illuminated for about 5 seconds.",
      "rating": 4.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20190817
    }
  ],
  "product_meta": {
    "title": "Plumeet Digital Alarm Clocks Travel Clock with Snooze and Green Nightlight - Easy Setting Clock Display Time, Date, Alarm - Ascending Sound - Battery Powered (Green)",
    "rating": 4.3,
    "feature_bullets": [
      "Kids Alarm Clock: Cute size, lightweight,easy to set perfect for kids,teenager and adult,you can put anyway on bedroom,desk,kitchen,office or carry for travelling.",
      "Large display number to read of 3.0'' screen, displays month, day and year and the time in both Military and AM and PM of night light and 12/24 hours format.",
      "Just a few buttons, simple settings. The backlight only lights up 5 seconds, snooze button reaches a crescendo and snooze function (8 minutes snooze).",
      "Pleasant beeping (not too harsh) and the knobs & switches in the back of the clock are clearly labeled run on 2* AA 1.5V batteries ( NOT INCLUDED).",
      "Protective and shock-proof silicone cover can be brought anywhere and help protect the clock from minor falls. Great Thanksgiving and Chirstmas gift"
    ],
    "specifications": {
      "Product Dimensions": "3.1 x 2.4 x 3.1 inches",
      "Item Weight": "4.6 ounces",
      "Manufacturer": "EleMall",
      "ASIN": "B01A6N8XS6",
      "Item model number": "EM-008-GR",
      "Customer Reviews": "4.3 out of 5 stars1,001 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#20,889 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Number of Pieces": "1",
      "Batteries Required": "No"
    },
    "categories": [
      "Alarm Clocks",
      "Home & Kitchen",
      "Home Décor",
      "Clocks"
    ],
    "price": 15.99
  }
}