{
  "website_summaries": [
    {
      "verdict": "Perfect choice for wheeling your pet around airports. The faux lambswool liner will also keep your dog comfortable.",
      "pros": [
        "Owners appreciate the flaps that can be zipped up or closed off for privacy",
        "Well-constructed  and has thoughtful details, like a detachable handle"
      ],
      "cons": [
        "Some customers found that the carrier was smaller than anticipated and couldn't fit their pet inside"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Smooth ride and great features!",
      "text": "Great carrier with a lot of useful features like the flaps that roll up and the detachable handle. Really easy to manuever this carrier with my dog inside of it since the wheels glide very smoothly and the front two wheels swivel. I love that it comes with a cozy lambs wool liner that is machine washable. I highly recommend this for traveling with your pet!",
      "rating": 5.0,
      "verified": true,
      "author": "Rustalini",
      "helpful_votes": 36,
      "publication_date": 20161122
    },
    {
      "title": "Rejected by United Airlines at EWR",
      "text": "We bought 2 of these for our 2 cats to travel on United. We were rejected at check-in because the length is 20\" and the max in-cabin size is 18\". Because of the hard plastic by the wheels, the carrier cannot squeeze to 18\". Needless to say, it was a complete disaster at the airport -- an extremely stressful day for us and the cats. Luckily we were very early to the airport and one of us had was able to run out and buy cheap replacements, otherwise we would not have been able to fly. The description says refund of flight fees for pets if rejected, but there's no contact information to get to them to claim the refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Gina S",
      "helpful_votes": 18,
      "publication_date": 20190218
    },
    {
      "title": "Unless you have a very small cat or a teeny dog, forget it",
      "text": "There is NO WAY any dog larger than a small Chihuahau should ever be put in this thing. My 11 pound mini schnauzer was smushed inside and there would have been no way to travel with her like that. Returned it for the WPS Removable Wheeled carrier and it worked like a charm!",
      "rating": 1.0,
      "verified": true,
      "author": "JGrey",
      "helpful_votes": 13,
      "publication_date": 20171111
    },
    {
      "title": "Perfectd Airlline Pet Carrier",
      "text": "The pet pet carrier for airline travel. VERY easy to us! Comfortable for pet (9# maltese mix). Fit well under seat. Wheels worked perfectly and it pulled easily. Highly recommends.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamzy",
      "helpful_votes": 13,
      "publication_date": 20170210
    },
    {
      "title": "I've seen better options. I am not returning it because I ...",
      "text": "This carrier is far too small for any animal over 10 pounds. I have a 17 pound cat and there was no way I could squeeze him in. It is a well constructed carrier for air travel but probably not something you would not want your cat or dog to travel in by car or for the occasional vet visit. There is no head room for an animal to stand and very little ventilation. I've seen better options. I am not returning it because I don't want the return hassle and was lucky enough to have a neighbor who could use it for her very small cat.",
      "rating": 2.0,
      "verified": true,
      "author": "nclady",
      "helpful_votes": 8,
      "publication_date": 20180205
    },
    {
      "title": "Recent travel on Southwest",
      "text": "Bought the large for my 16 lb fur baby, recently traveled on Southwest without issue. This carrier doesn't fit completely under the seat but the airline allowed it both ways. Pros: light weight, roomy, wheels work well. Cons: snaps on handles are defective and don't snap securely, limited pockets.",
      "rating": 4.0,
      "verified": true,
      "author": "Stevens",
      "helpful_votes": 11,
      "publication_date": 20170421
    },
    {
      "title": "Totally Awesome Carrier with Wheels!",
      "text": "Traveling with a pet is stressful, I've done it with a carrier that didn't have wheels and it was difficult carrying my dog through big airports - so I bought this one with wheels and it was totally awesome! I can't say enough good things about how much easier it was to get thru the airport rolling my dog next to me! She sat there with her head out of the carrier and enjoyed the ride. It was a tight fit under the plane seat in front of me, but it did fit and she sat through the whole flight (one 4 hours and another 6 hours) just fine looking up at me or sleeping (most of the flight).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Worth the extra money",
      "text": "I travel with my cat a lot who also gets anxiety in airports. This is amazing, the sides that close work perfectly. The wheels are great quality and roll easily. It rolled right under Delta's seats perfectly without needing to be squished down even though they're only about 8-9\" tall. When you take out the bottom two linings there was plenty of room for my cats bed as well. Definitely worth the money if you travel with a pet often or have trouble carrying their carrier. Zipper closures and pockets are a plus to ensure they can't squeeze out like with velcro and so you can store a few things.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Brodzik",
      "helpful_votes": 4,
      "publication_date": 20170708
    },
    {
      "title": "it is well made and rolls very easily. My dog seemed to like being inside and ...",
      "text": "Just received the carrier today, it is well made and rolls very easily. My dog seemed to like being inside and riding around, short test run. The true test will be the plane trip!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela J. Sullivan",
      "helpful_votes": 16,
      "publication_date": 20161118
    },
    {
      "title": "GREATEST pet carrier",
      "text": "This is the best pet carrier I've ever owned . I broke a rib so I was anxious about how I was going to manage my 10 pound bishon through the airport. I was able to pull the carrier easily through the airport , the carrier fit well under the Southwest seat , and my dog was super comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven J. Deblock",
      "helpful_votes": 10,
      "publication_date": 20170830
    },
    {
      "title": "Love these",
      "text": "I purchased 2 of these to travel with my 2 shihtzus (one 8.5 lbs, one 14.5 lbs). They are well made, sturdy, and have traveled well on the 2 trips we have taken. The larger dog is a little cramped, but he's fine. They roll smoothly and are easy to pull along. There is plenty of ventilation and they fit under the seat fine. I give my dogs a bit of CBD oil and they sleep through the whole 3.5 hour flight in these. I'm very happy with this purchase and we will continue to use these.",
      "rating": 5.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Good product. Sturdy.",
      "text": "Just received the carrier yesterday. The opening is kind of small but was able to lure my 18 lb dog into the carrier. Kept him inside for a few minutes before letting him out. Later in the day, we put him in again and went out for about an hour. He had no problem with it at all. I roll him around the house. The wheels are smooth. Fingers crossed that everything will be ok when my daughter takes him on the plane.",
      "rating": 5.0,
      "verified": true,
      "author": "bet",
      "helpful_votes": 5,
      "publication_date": 20171031
    },
    {
      "title": "2/ 8 pound dogs had a wonderful trip on Southwest to Phoenix Az",
      "text": "Both Yorkies fit in there, 2/ 8 pound dogs had a wonderful trip on Southwest to Phoenix Az, From Spokane Washington., Fit under seat very well, and was easy to back into its slot under the seat in front of me, I had a window seat. Never had to lift carrier with both dogs. Pulling it was easy, no problems with tipping, or in any way did it get out of control. When it was delivered and opened up both dogs wanted to get in and were seen napping in it over the next couple days. I haven't ween any negatives to it. Bellesmom2",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170929
    },
    {
      "title": "A challenge to use",
      "text": "This is a great product in that it rolls well... where it isn't great is that neither end opens really 'flat' so that there is an ease to inserting my pug.As a matter of fact it was a nightmare. Feedback for Sherpa, one side of the carrier needs to open totally so you don't have to squeeze your pet in because it really freaked my pug out, unlike her Sherpa carrier with no wheels which does have a side that FULLY opens to allow a larger entry/ exit for your pet. Also, my pug girl was 15 lbs. in case that helps anyone deciding on this item.",
      "rating": 4.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "In this case, small is the new large",
      "text": "As described. Although, I have a 20-pound three-legged terrier mix and the ad says the carrier accommodates up to 22 pounds. I took my dog on the plane and never zipped up the carrier. it was too small for him, but the largest available. luckily, flight crew was cool and the dog wound up in my lap except for planing and deplaning. Think a smaller, lower to the ground hound for this carrier. the carrier itself is perfect and well-made. it just can't meet airline under-the-seat requirements and accommodate more than a small (10-14 lbs) or lower center gravity (dachshund) pet if flight crew enforces rules.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Roth",
      "helpful_votes": 13,
      "publication_date": 20170109
    },
    {
      "title": "our first trip with a pet",
      "text": "our 11 plus pound pet was just fine in this carrier. we sat in business/first and did not have an issue with the size of the bag. It is extremely well made and the pull strap helped a great deal in moving the pet through the heavily trafficked airport. Be sure to check with the specific carrier you are flying. the dimensions are a bit larger than some commercial airlines allow. we practiced for a number of weeks before flying , getting the pet comfortable with the product. height is a consideration , as your pet may be too tall for the item.",
      "rating": 5.0,
      "verified": true,
      "author": "bokababe",
      "helpful_votes": 2,
      "publication_date": 20180323
    },
    {
      "title": "It was a disappointed as its description lack to info is that this ...",
      "text": "It was a disappointed as its description lack to info is that this is not for any dog. I have a chihuahua mix at 18 pounds and he didn't fit inside. The heights is for a very short dog. I was luck to have order another brand petsfit. Otherwise I would e out of luck.",
      "rating": 1.0,
      "verified": true,
      "author": "Dayse",
      "helpful_votes": 4,
      "publication_date": 20170813
    },
    {
      "title": "Five Stars",
      "text": "This make the ong walks in airports so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Sgrif",
      "helpful_votes": 8,
      "publication_date": 20170209
    },
    {
      "title": "Great for those who cannot lift and transport a pet-containing ...",
      "text": "Great for those who cannot lift and transport a pet-containing carrier--like me. It was easy to pull my cat Bella in this carrier. However, the carrier itself was heavier than I thought it would be....although very sturdily built. Definitely well made--not flimsy. My one complaint is that the zippers did not work so easily and need to be worn in. Of course Bella resisted going in the carrier. I had to turn it on its side vertically and drop her in.....kicking all the way.",
      "rating": 4.0,
      "verified": true,
      "author": "ccanavey",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Weeee Through the Airport",
      "text": "Our first time traveling together. It was not tall enough. Thank goodness they didn’t make me zip him in. It would have been long enough but at 23lbs his head stuck out the entire time. The bag maneuvers so easily, the zipper on top was our life saver! Fit easily under the seat in front of me. Wheels helped the bag slide right under. Easy through security too. You can see, he was not happy that he could not be in my lap. So I do recommend this bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Great quality, but I was disappointed.",
      "text": "The carrier is definitely excellent quality, fabric is sturdy and the base is stable. BUT, the measurements are the outside measurements. My dog did not fit into the carrier with adequate moving room. He did meet the stated measurements, The \"youThink\" carrier is bigger, but not near the quality of the Sherpa. If there is a bigger model I would purchase it. I ordered the large, unfortunately I had to return it.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Archer",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Perfect for traveling!",
      "text": "This pet carrier was perfect for my airline travels! My Maltese is 11 years old and very small. He never would have been able to keep up with me if he was walking. He could see out all sides of the carrier and it was smooth and easy to pull along. It fit comfortably under the seat. I love it! My dog doesn't mind it at all either. I highly recommend this carrier.",
      "rating": 5.0,
      "verified": true,
      "author": "lja",
      "helpful_votes": 3,
      "publication_date": 20170513
    },
    {
      "title": "Great but zipper is too tight",
      "text": "This worked great for strolling through the airport and took away any shoulder strain from carrying. I have a 16lb cavalier that was fine in it. He was able to turnaround. We lost the flag on the return trip. Cons: no storage space for travel feeding supplies, zipper tight for front entrance.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "This new and greatly improved Sherpa carrier is amazing. The wheels are great and the whole thing ...",
      "text": "This new and greatly improved Sherpa carrier is amazing. The wheels are great and the whole thing fits under the first class window seat. Previously, the wheels on the Sherpa I had were useless. I generally end up carrying my dog as I transferred planes. With the new Sherpa I could quickly and efficiently pull my dog thru the airport",
      "rating": 5.0,
      "verified": true,
      "author": "Bj2401",
      "helpful_votes": 3,
      "publication_date": 20171117
    },
    {
      "title": "BEST BY FAR",
      "text": "Best investment ever, turns on a dime and I was alone traveling with these two from Hawaii to Florida. They were the most popular dogs in the airports. It was such a breeze to use one hand to pull them. How convenient is this. Plus to pull them around town is nice as they are now 12 years old.",
      "rating": 5.0,
      "verified": true,
      "author": "kaiofhawaii",
      "helpful_votes": 2,
      "publication_date": 20190108
    },
    {
      "title": "Love this carrier.",
      "text": "My little island rescue dog is long and short (think dachshund although she's likely a Chihuahua/Schipperke mix.) She weighs 17 pounds. She fits perfectly in this medium carrier. The fact that is rolls makes it a game changer, 17 pounds is a load to haul on your shoulder after a while. The lining is very soft, the mesh is substantial, not thin. We fly Delta and this carrier doesn't fit all the way under the seat but close enough and the flight attendants did not comment about it. I definitely recommend this carrier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Nice carrier. Practice lots at home to get the pet accustomed to it prior to flight.",
      "text": "The product was nicely constructed and rolled well at the airport. It also fit nicely under the middle seat of the Southwest Airlines flight. The dog however hated it. We made it the first flight but when we tried to board the second flight he wouldn’t stop barking. We had to spend the night in a city away from home and ultimately got a doctors note for an emotional support dog so the dog could fly on my mothers lap instead of in the carrier. He enjoyed that!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Cahanin",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Great soft carrier w/ wheels",
      "text": "I ended up leaving my expensive carrier at my parents home when I was in the middle of moving. I decided to buy this one and have no regrets. Very good soft pet carrier. Good quality, I took it abroad 2 American Airline planes. Fit perfect, it also flexible enough to fit under small seats. My dog, Kato (8-pound Chihuahua), loves it and had plenty of room. This is his second trip that he had to take with planes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180114
    },
    {
      "title": "My cat didn't cry!",
      "text": "I travel with a cat - this is great the big issue I had was that it needs a better handle to pull thru the airport. It has a tendency to get a head of you or rolling towards you that you kick it while walking. The other issue is -it takes a bit getting under AA seat (I can't speak for other airlines) after a bit of push/pull it fits. The thing I loved was the windows to the side can be closed as well as it's on all 4 wheels. My cat has high anxiety so traveling is highly stressful, but this is the best out of 4 carriers I have tried.",
      "rating": 4.0,
      "verified": true,
      "author": "chewzyb",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "The wheels turn easily and roll smoothly",
      "text": "The wheels turn easily and roll smoothly. Having had Sherpa bags before, I'm disappointed that the ends don't open fully to allow easy entrance and exit for the dog. Thank goodness for the top that opens.",
      "rating": 4.0,
      "verified": true,
      "author": "Abbey",
      "helpful_votes": 9,
      "publication_date": 20161219
    },
    {
      "title": "Great Price",
      "text": "Perfect for my 14 pound shih tzu we used it for 2 flights so far and she loves it. Tip try to introduce your pet to the carrier weeks before traveling so they can familiarize with the carrier and not be nervous",
      "rating": 5.0,
      "verified": true,
      "author": "FabiolaOcasio15",
      "helpful_votes": 2,
      "publication_date": 20190522
    },
    {
      "title": "Wonder wheels",
      "text": "Worked very well with the pet travel agenda. Nice wheels going well with the whole airport flow. Fit perfectly under first class airplane seat. My dog seemed to be cool with it. Liked the airplane acceptance guarantee that came with the purchase. I was sold with that feature. Minimized the stress of being denied boarding for some kind of non compliance drama that can easily happen during travel. I have since used it for long car rides.",
      "rating": 5.0,
      "verified": true,
      "author": "mjbell",
      "helpful_votes": 2,
      "publication_date": 20171002
    },
    {
      "title": "Easy to travel with",
      "text": "My chihuahua loves it, and I had no problem traveling by American airlines twice. They need to use metal zippers because the puppies had chewed the zippers of my first bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabina",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Much Smaller Than The Non Wheeled Large Carrier",
      "text": "The dimensions on this are the same as the large regular sherpa carrier. Unfortunately, the description doesn't me tion that the wheels and base are included in those dimensions so you end up with a carrier that is significantly smaller than the regular size large. Our frenchies fit easily into the regular large but not this one. Just double check your pets size and be aware this fits more like a medium.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190205
    },
    {
      "title": "Beagle approved! 2nd purchase more features!",
      "text": "Purchased for traveling with my 13\" show beagle. I cannot drive due to disability so use Lyft to get around almost everywhere. I have an existing sherpa bag minus wheels. This bag not only has wheels, I really like the addition of the roll down privacy side \"covers\". Another huge new addition is a bottom vinyl tray with 1\" sides that the fleece liner attaches into!",
      "rating": 5.0,
      "verified": true,
      "author": "Magic",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "I bought this for my mother in law to bring ...",
      "text": "I bought this for my mother in law to bring her dog to Florida. She was down there for two months, it broke on the way home (the second time it was ever used). So now I can’t return it, because I missed the window of time :(",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Chawla",
      "helpful_votes": 5,
      "publication_date": 20180318
    },
    {
      "title": "Traveling with your pet",
      "text": "My dog and I went on an Airplane trip and this was the perfect!! My old Sherpa did not have wheels and it and the dog would get pretty heavy lugging it thru the airport. I will always have a Sherpa with wheels! What I don’t like about it, before you check in your luggage or if you have a carry on, there is not a band to hold it on top of your luggage/ or slip thru your luggage handle like the sherpas do with no wheels on them.",
      "rating": 5.0,
      "verified": true,
      "author": "Washington",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Love this product!this",
      "text": "This product is perfect for taking a cat to a vet. All comforts included. It is sturdy and lightweight compared to the metal carriers. It’s easy to move around- the spinner wheels are a really great addition and that you can pull on the ground saves your back. I have an 18 pound cat and he can really be a handful. I have no complaints about this product; it’s the best.",
      "rating": 5.0,
      "verified": true,
      "author": "HapHandy",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "It’s easy to cart my spoiled dachshund through the airport",
      "text": "My little dachshund is not so little anymore so carrying her through the airport was rather difficult. Now I just wheel her through like a little Trojan horse. She just sticks her little head out and enjoys the ride. The only thing that prohibited my giving it a 5 star rating is that the zippered side opening do not zip all the way down so she had to enter through the top of carrier.",
      "rating": 4.0,
      "verified": true,
      "author": "Katy Kattelman",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "I was able to fit both of my dogs comfortably into one",
      "text": "I was able to fit both of my dogs comfortably into one. We flew SW and had no problem with the carrier restrictions. It was their first time flying and they both have anxiety, so I was skeptical about putting them in separate carriers, so I bought two for just in case. They flew just fine in one carrier with rooms to move around, and it was a 5hrs flight! I have a yorkie/chihuahua and a min-pin/dachshund.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Le",
      "helpful_votes": 2,
      "publication_date": 20171109
    },
    {
      "title": "Poor Quality",
      "text": "I purchased this carrier to transport my puppy through the airport. Based on the reviews I thought the carrier would be of better quality, however, I was so disappointed. The zipper to the top opening gets stuck and does not glide easily, and the carrier does not pull evenly across the floor. It actually turned over with the dog in it twice as I was trying to pull it through the airport. I would not recommend this product. I really did want to like it!",
      "rating": 1.0,
      "verified": true,
      "author": "Rochelle Trafton",
      "helpful_votes": 2,
      "publication_date": 20190819
    },
    {
      "title": "Sturdy wheeled pet carrier but only 8” Height while zipper is closed.",
      "text": "Overall very good for general transport with mesh open and dogs head popping trough top zippered opening. Nice, sturdy and comfortable for a small dog sitting or laying down. Please note that the wheels take away from height giving only a usable interior height of approximately 8” ( while zipper is closed). Sides are bendable and the pet carrier fits underneath airline seat. If you are Looking for stand up height 12” then the original large Sherpa bag (without the wheels) is better!",
      "rating": 4.0,
      "verified": true,
      "author": "JYL2019",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Perfect!",
      "text": "Bought this for my 15 lb cat. He's just too heavy to carry all over the airport. So this carrier on wheels was perfect. He fit comfortably and I was able to pull him around. I sat in the window seat and it fit under the seat in front of me just fine!!! Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopaholic",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Love this, so easy for me",
      "text": "Love this, so easy for me. Plenty of room for my chihuahua. And she loves it too;she doesn't mind riding in it at all. And Southwest (the airline I use) says it's perfect for their planes.",
      "rating": 5.0,
      "verified": true,
      "author": "Chi mom",
      "helpful_votes": 2,
      "publication_date": 20180410
    },
    {
      "title": "Rolls nice, Luka loves it.",
      "text": "When we get the Sherpa carrier out, Luka gets excited...he knows he's traveling with us. This is the third carrier we've owned. It rolls better than others and fits nicely on the plane, car or shopping cart. Durable, light-weight, perfect for my best friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane Sparks",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "The clasp on the long handle doesn't work",
      "text": "Hi, I like this carrier, although it is smaller than the equivalent without wheels and weirder to get the cat in. My problem is that one of the clasps that attaches to the carrier does not work. Thus, I cannot use the handle to truck the carrier! Big problem, please help!",
      "rating": 4.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "They don't make'um like they use to............that's for sure.",
      "text": "Very cheaply made and doesn't turn easily like the old Sherpa I bought in 2006. I returned it!",
      "rating": 2.0,
      "verified": true,
      "author": "Petra Karn",
      "helpful_votes": 5,
      "publication_date": 20170429
    },
    {
      "title": "Great carrier, but not for mini poodle",
      "text": "This is a beautiful and well mad carried, BUT my 10 poung mini poodle has long legs and was not able to stand up in this one. I was very dissapointed, but I guess Sparky will not be flying anytime soon, because he won't fit under the seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Cooperstown nana",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Sturdy Travel Bag!",
      "text": "I have sued the Sherpa travel bag fo our dog for over 20 years! It fits nicely under the seat on the airplane. Th long strap allows you to pull the bag thru the airport. New wheel type on this bag...will probably last even longer than my other bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Z",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Function & ease",
      "text": "This is great for smaller pets to fly with. The wheels make it easy to go from one concourse to another without having to carry it. My terrier weighs 17 lbs and I would not be able to carry her through the airport. It works great",
      "rating": 5.0,
      "verified": true,
      "author": "Roxie",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Sherpa carriers are the best",
      "text": "Can't go wrong with a Sherpa pet carrier. Never had any problems. High quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "ScrappyMir1",
      "helpful_votes": 3,
      "publication_date": 20180504
    },
    {
      "title": "pet carrier fits easily under the seat in front of you on the plane.",
      "text": "My teacup Australian Shepard was very comfortable but he is 13 pounds and the fit was perfect. The label says up to 22 pounds but I doubt it would be comfortable for a 22 pound animal as i think it would be a tight fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Very sturdy and roomy!!",
      "text": "This is the only carrier that fits my 18.00 corgi and is also approved by the Southwest Airline for the cabin. The wheels also saved my back from breaking as well. Overall, it’s a very sturdy and great pet carrier!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anh Do",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "My dog loves his carrier",
      "text": "Excellent dog carrier! My 18 lb dachshund spent 8 hours in this due to a flight delay & he did great. recommend upgrading to a seat with more legroom because it was difficult to pull the carrier out from under the seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Jillian",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Very happy with it",
      "text": "This worked perfectly for my 14# cat who is used to a carrier. Rolling one was new to us. Did not seem to bother him and it was easy to pull inside the huge airports.",
      "rating": 5.0,
      "verified": true,
      "author": "clara",
      "helpful_votes": 2,
      "publication_date": 20180823
    },
    {
      "title": "Great way to carry your fur babies through the airport...on wheels.",
      "text": "This is the best! Fits under the seat and is easy to navigate through airports. Good ventilation, roomy (I can fit 2 small dogs for short trips).",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonHumm",
      "helpful_votes": 2,
      "publication_date": 20180218
    },
    {
      "title": "Two Cats, One sherpa",
      "text": "I was able to fit my two cats in here while traveling. One is 12lbs and the other is 6lbs. There was enough room for the both of them but since there were two cats they didn't have much room left over. It is a tiny bit higher than airlines require but you can just push down the top for it to fit!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "You Want This One!",
      "text": "I can't say enough good about this bag. This is my third over several years and the quality is so much better than the other models. Not only did I love it on a recent trip with my 4 month old sheepdog puppy, the puppy loved it. It became her favorite game leading up to our trip, jumping in and out, carrying it around. The wheels rolled like butter. Can't say enough good.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Sherpa on wheels - a great travel solution for my pup",
      "text": "This pet carrier was accepted by two airlines (Delta, United) for under seat use and, most importantly, seemed comfortable for my dog, a 16-lb Westie. It was very convenient as well for wheeling him around the airport, and he seemed to enjoy it. My only criticism is that it is not \"tip-proof.\" One has to pull it very carefully to avoid it tipping over.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170327
    },
    {
      "title": "Nice but small",
      "text": "It’s a good carrier but measure your pet. I had a Sherpa that by eye looked like this but by 16 lb dog was too big to fly in this. It’s for really little dogs",
      "rating": 4.0,
      "verified": true,
      "author": "Courtwend",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Teh biggest dog you can comfortably fit in this is a yorkie",
      "text": "Teh biggest dog you can comfortably fit in this is a yorkie. My 5 month old mini golden doodle didn’t even have a chance to fit. Aside from size issues, it’s sturdy and awesome if you have a small dog.",
      "rating": 4.0,
      "verified": true,
      "author": "A.S",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Kitty learns to love to travel!",
      "text": "I couldn't even carry the 19 lb cat without a carrier. With this carrier Exeter (kitty's name) and I whizzed through the airport terminal with great ease. Exeter loved it, especially when he was moving. He didn't cry at all. This is a cat who cries all the time in his conventional crate.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "The interior is not 16\", the overall is. Subtract a couple of inches for the wheels.",
      "text": "Luckily Tucker didn't mind being stuffed inside, as it made him lie down and chill. He was somehow able to turn around as well, probably due to the soft sides. It was a breeze to get through airports, and he liked having his head out to see the sights, though I wouldn't recommend it for the narrow aisles of the airplane.",
      "rating": 4.0,
      "verified": true,
      "author": "Eileen M. Lastrina",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Love it",
      "text": "It does seem to be a little smaller that the previous non-wheeled version but much lighter and much easier to move around. Fits under the seat like a dream. Would recommend and have recommended it to other friends who travel with the fur babies",
      "rating": 5.0,
      "verified": true,
      "author": "GAA",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Doesn't make any difference IF I love it - Lulu",
      "text": "Doesn't make any difference IF I love it - Lulu, my cat, thinks it a fine thing. She is a good traveler, car or plane, and this wheeled carrier will make it much easier for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 3,
      "publication_date": 20170223
    },
    {
      "title": "so happy that I chose this bag",
      "text": "so happy that I chose this bag. bad shoulder so this is perfect for airline travel. opened it and my little Maltese jumped right in and went for a ride in it. well made with an adjustable strap to adjust to your height. the only negative is that you may have to be careful as you pull it ,it may tip over if you are walking fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "I really like the maneuverability",
      "text": "I really like the maneuverability, the size and the durability. It should be perfect. But, the \"pet on board\" flag was not in the box. I don't know if I would use the flag, but if they advertise it, they should include it.",
      "rating": 4.0,
      "verified": true,
      "author": "Christi Zimmerman",
      "helpful_votes": 2,
      "publication_date": 20180105
    },
    {
      "title": "Would like a better handle",
      "text": "There is not a lot of control. It slides all over and bumped every seat on the way out but rolling is so much better than Carrying my full grown dog now.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Fits well under airplane seats",
      "text": "This is a great carrier. Fits well under the airplane seat, rolls well and my 16 pound Shihtzu fits well in it. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "drheam69",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Very nice!",
      "text": "I did have to return this through no fault of the product. My pet was simply too tall for it, but I would highly recommend as an alternative to a carry type. Well made, wheels looked strong and solid....",
      "rating": 4.0,
      "verified": true,
      "author": "Di",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Worth the price!",
      "text": "Like the quality of the product. And the inside is comfortable for dogs upto 10 pounds max . Wish there was a sturdier pull out handle instead of the belt . Tough to maneuver at airports",
      "rating": 4.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "I wheeled her like that all through the airport she was very comfortable",
      "text": "My 9 year old Shih Tzu is 20 pounds. I flew the red eye from LA,California to Florida and one lay over. My dog slept most of the flight. When we were got off the plane. My Shih Tzu poked out her head and rested her two front legs on top of the dog Carrier. I wheeled her like that all through the airport she was very comfortable. I love this dog carrier.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne Maxwell",
      "helpful_votes": 2,
      "publication_date": 20180312
    },
    {
      "title": "Great carrier.",
      "text": "The wheels helped so much. Easy to navigate at the airport and inside the JetBlue halls. I practiced with my dog a couple of times before the trip.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Encarnacion",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Good setup",
      "text": "Very good setup & bought two carriers for plane rides. Hoped they were a bit better quality. I would gladly pay more money because they work great for plane rides.",
      "rating": 4.0,
      "verified": true,
      "author": "Nat",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Real nice carrier",
      "text": "We have purchased many different carriers for our dog. So far I really like this carrier. The quality of the product is very good. Is to get the dog in and out and it rolls easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Home cook",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Nice carrier",
      "text": "Carrier is as described and my pet seems to like it. Wheels are quiet and roll smoothly. Only complaint I have is the pole and flag were missing from the box. Would like to get them.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Hawley",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Mom and Mini Mutt Love It!",
      "text": "Got one of these for my mom so her mini mutt could come with her when she visits. She loves it! The fact that she can just pull it is great because with her bad back she wouldn't be able to carry a bag and the dog through the airport. We taught her how to use the website and now she can make sure that it's \"Guaranteed\" on the flight. So helpful! And Mr. Mini Mutt seems to like being in there too, he actually slept in there the whole trip! Two thumbs and four paws up!",
      "rating": 5.0,
      "verified": true,
      "author": "Quita",
      "helpful_votes": 7,
      "publication_date": 20161213
    },
    {
      "title": "Laying room only",
      "text": "Great material. But my little terrier can not stand. Must lay down at all times when placed in this carrier",
      "rating": 4.0,
      "verified": true,
      "author": "rod man",
      "helpful_votes": 2,
      "publication_date": 20170817
    },
    {
      "title": "Pet carrier on wheels",
      "text": "This item arrived quickly! It is exactly as described and exactly what my Mom wanted for her little dog. Pulls easily and has plenty of mesh openings for the pet's enjoyment and comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Cullinan",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Five Stars",
      "text": "Excellent buy, east to transport my little one through the airport",
      "rating": 5.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 2,
      "publication_date": 20180505
    },
    {
      "title": "Great Quality and Perfect for Flying",
      "text": "This carrier was perfect for flying my fairly large cat cross country on American Airlines (Feb 2019). The wheels were exactly what we needed to get her through the airport. Good quality and fast delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "ChinnyMama",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": ":( I had to return",
      "text": "My only issue was the wheels they were going left and right and I wish it was a little smaller I had to return it mainly because of the wheels",
      "rating": 3.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Makes life easier",
      "text": "Surprisingly nice! The material seemed cheaply made at first glance but it’s held up well so far! Love that the wheels are 360 and I don’t have to pick up and physically manipulate the carrier. Fits my 2 8 lb chihuahuas and makes traveling with them a breeze!!",
      "rating": 5.0,
      "verified": true,
      "author": "BA",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Big carrier but it fits behind the aircraft sit",
      "text": "My husband traveled in Alaska and deltha airlines same day and he was able to put this carrier behind the sit. My cat was comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Yanni",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "We generally travel with our baby and dog . This made our travel so much easier",
      "text": "Really good . My dog loves it . He falls asleep right away",
      "rating": 5.0,
      "verified": true,
      "author": "Seema",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Not Worth It!",
      "text": "I bought a large carrier for a 12 pound Morkie, who is a little long. Not only is it tiny, the roof collapses on his head. I do NOT like this product! I will be returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Riley",
      "helpful_votes": 4,
      "publication_date": 20170426
    },
    {
      "title": "Great buy!",
      "text": "This carrier more than met my expectations. Very easy to maneuver and my pet was comfortable. It made travel easy and fit perfectly under the seat in front of me.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrissyATL",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "I like it",
      "text": "I like it. I like the style. It would be nice if we could last forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Levin",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Glides effortlessly",
      "text": "This is the perfect size for fitting under airline seats. My dog loves it and feels safe and secure when we travel. I needed one I didnt have to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Allen",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "wheels are so much easier",
      "text": "Brought dogs on round trip flights in this carrier--one carrier per dog. Rolled them through parking lots, airport terminals, and right onto the planes. Smooth rolling, SO much better than carrying them on your shoulder while schlepping. Some large fit on Allegiant air pretty well. Bag sticks out a little from under seat, but no biggie.",
      "rating": 5.0,
      "verified": true,
      "author": "Avery Scott",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Sturdy and well made",
      "text": "while this carrier is a tiny bit bigger than the airlines (Allegiant) specifies for carry-on pets, it did fit under the seat in front of us; we liked that it could be pulled instead of carried; and it has openings on each end as well as the top. Overall a well made product that we will use again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Perfect Fit",
      "text": "This carrier was great. Fit under the seat just fine. The wheels were really great, I could even roll it behind me when on isle of the plane.",
      "rating": 5.0,
      "verified": true,
      "author": "Monet gril",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Five Stars",
      "text": "Love the travel carrier. My puppy gets in every time I ask her to for our airline trips",
      "rating": 5.0,
      "verified": true,
      "author": "bestros",
      "helpful_votes": 2,
      "publication_date": 20170611
    },
    {
      "title": "Poor imitation of Sherpa",
      "text": "My original Sherpa on wheels was stolen. This was obviously less expensive so I ordered two. It is far inferior. Bad knock off. Poor plastic materials. Poor zippers. Badly made. Please returning both!! No wonder so much cheaper!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Seventy-something fashionista",
      "helpful_votes": 2,
      "publication_date": 20180829
    },
    {
      "title": "Perfect Rolling Carrier",
      "text": "Bought this carrier for a 17 pound dog, we have not used it at the airport yet, that's for next week. But we have taken Jasper around the neighborhood in it and he loves it!! Plenty of room for him, the hard plastic bottom with the Sherpa pad is wonderful. It pulls very easily and does not tip over. You can't go wrong with this carrier!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Gillogly",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Very great way to take a cat anywhere.",
      "text": "We have a 22 pound cats so this is so much easier to take him to the car to travel places.",
      "rating": 5.0,
      "verified": true,
      "author": "Evey",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Easier for weaker people",
      "text": "Perfect for our elderly friend who travels a lot by plane with her 12 lb shitzu!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey K",
      "helpful_votes": 4,
      "publication_date": 20170106
    },
    {
      "title": "Great travel bag",
      "text": "This is a great bag. My dog loved wheeling around the airport with her head sticking out. She is very accustomed to being in a stroller so was not anxious in this bag.. It did not fit really well under the seat though but it worked as I kept the front part sticking out a little bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170921
    },
    {
      "title": "Much better price than department stores",
      "text": "Just like the one sold in pet stores for a much better price. Wheels glide smoothly and my dogs seem to tolerate it well.",
      "rating": 5.0,
      "verified": true,
      "author": "E. B.",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Sherpa is the best for travel. The wheels make a huge difference when you're in a hurry in the airport.",
      "text": "Sherpa is the best for travel. The wheels make a huge difference when you're in a hurry in the airport. Small dog can feel very heavy when you're running through the airport carrying it question or carry on.",
      "rating": 5.0,
      "verified": true,
      "author": "imollyq",
      "helpful_votes": 0,
      "publication_date": 20180819
    }
  ],
  "product_meta": {
    "title": "Sherpa on Wheels Pet Carrier, Black",
    "description": "Size:One sizeTakes the weight off your shoulders. The new and improved SHERPA-On-Wheels&trade; utilizes easy-glide recessed castor wheels for smooth, quiet, steady motion. The detachable handle can also be used as a shoulder strap and features a padded support for comfort. Carry it or pull it, it's great either way. The SHERPA-On-Wheels features a stylish light-weight design. Made from high-quality black nylon. A travel bed tray slides in and out for easy cleaning and includes a soft, cozy, machine-washable faux lambskin liner. The carrier has mesh panels and roll-up flaps on three sides for ventilation and privacy. Top and side entry flaps make it much easier to comfortably load pets in the carrier. A large side zippered pocket can hold your important pet travel documents. This carrier features a patented spring wire frame that easily slides underneath airline seats. The SHERPA-On-Wheels is part of the Guaranteed-On-Board; Program and is approved for use on many major airlines. Available in one size and black.",
    "rating": 4.4,
    "feature_bullets": [
      "Pet carrier with recessed wheels for easy-glide motion",
      "Adjustable shoulder strap converts to a padded pull handle",
      "Four mesh panels for ventilation, roll down privacy flaps, top and side entry with locking zippers, machine washable faux lambswool liner and Pet on Board flag for better visibility",
      "Guaranteed-On-Board Program and approved for use on many major airlines",
      "For pets 19” in length x 9.5” in height and up to 22 pounds",
      "Do NOT select the carrier size based on weight only. Choose the carrier size based on your pet’s measurements first, then make sure not to exceed the maximum weight limit.",
      "Carrier measures 20 inches; L x 12.25inches; W x 10.5 inches; H",
      "Carrier is intended for safe and comfortable travel; the pet will not have excess room to move around, stand or sit up with the top closed",
      "Pet carrier with recessed wheels for easy-glide motion",
      "Adjustable shoulder strap converts to a padded pull handle",
      "Four mesh panels for ventilation, roll down privacy flaps, top and side entry with locking zippers, machine washable faux lambswool liner and Pet on Board flag for better visibility",
      "Guaranteed-On-Board Program and approved for use on many major airlines",
      "For pets 19” in length x 9.5” in height and up to 22 pounds",
      "Do NOT select the carrier size based on weight only. Choose the carrier size based on your pet’s measurements first, then make sure not to exceed the maximum weight limit.",
      "Carrier measures 20” L x 12.25” W x 10.5” H"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "20 x 12.25 x 10.5 inches; 5.5 Pounds",
      "Item model number": "Q98792",
      "Date First Available": "September 23, 2016",
      "Manufacturer": "World Wise Pooch Planet",
      "ASIN": "B01M0XNQ0Q",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Carriers & Travel Products",
      "Dogs",
      "Hard-Sided Carriers",
      "Pet Supplies",
      "Carriers"
    ],
    "price": ""
  }
}