{
  "website_summaries": [
    {
      "verdict": "An impressive model dedicated to providing your child with the greatest safety equipment and protection.",
      "pros": [
        "Installation is particularly simple",
        "Fits infants tight and snug for extra security",
        "Straps easily loosen and tighten",
        "Build keeps infant's head from shaking and moving in car",
        "Large canopy"
      ],
      "cons": [
        "Canopy can get caught under the seat's handle",
        "Heavier than some buyers expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "One button handle!!",
      "text": "I am currently 7months pregnant with my second baby after 11yrs. I've done countless research on carseats even gone to stores to test them out and feel them. When I saw this car seat it was love at first sight. The new born mesh like insert is super soft and breathable compare to chicco keyfit 30. Very large canopy. I love the one button handle! Clicks in and out of base easily while feeling very secure. This base itself is great. So happy I snagged this on Prime day for under $130.00 when orginial price is $199.00. Only con is not many colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Linnette M.",
      "helpful_votes": 25,
      "publication_date": 20190717
    },
    {
      "title": "Worth it",
      "text": "First time parents here. Did a lot of research. We picked this car seat for many reasons. Especially the one button release for the carrying handle. But It came in the mail and it’s every thing we expected. Light weight and easy to use. With tons of support and safety mechanisms. We are very excited to use this for our little boy in a few short months. Seems very worth the price tag.",
      "rating": 5.0,
      "verified": true,
      "author": "Nichole",
      "helpful_votes": 22,
      "publication_date": 20190411
    },
    {
      "title": "Very expensive but very worth it",
      "text": "This is a replacement for a much cheaper car seat of the same manufacturer and what a difference. I is better padded, much stronger and feel a lot safer. The sun shade can be lowered further which provides more protection area than the old one. The extra bonus is the fact you can use just one hand to move the bar to carry the seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 20,
      "publication_date": 20180903
    },
    {
      "title": "Product arrived broken",
      "text": "Product arrived broken. I wouldn’t put my newborn in this to save my life.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennessa Peterson",
      "helpful_votes": 13,
      "publication_date": 20191006
    },
    {
      "title": "Car-installation technician approved!!",
      "text": "I did my research on car seats for quite some time before deciding to get this one, and got a better deal on it via amazon than elsewhere. I took this to a safety car installation tech at our local fireplace to show me how to properly install and use it. The technician commented how impressed she was with the seat, it has some safety features other seats don’t have. There are a couple things about the seat I didn’t know how to utilize so I was really happy I took it to the car seat installation and highly recommend others do the same! Great seat! Lots of cushion and body/head support.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 9,
      "publication_date": 20190708
    },
    {
      "title": "Best seat on the market",
      "text": "After trying 3 different seats we have finally found the perfect one! We love this seat it is absolutely wonderful. Don’t waste your time buying anything else. This seat is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 11,
      "publication_date": 20190210
    },
    {
      "title": "Love this Car Seat!",
      "text": "I did a lot of research when buying a new pumpkin seat for my third child. My first graco seat expired and was an older style, so i decided to upgrade. This seat is so nice with the button on the top middle. I also LOVE the herringbone print. It’s so cute. I like that it’s not black, it doesn’t get sooo hot in the summer. I also like the newborn insert. It gives good head support for the small babies. Lastly, the new base is a lot nicer than the old style cheaper based. If your looking at this one and debating, just buy it! It’s totally worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190912
    },
    {
      "title": "Love the features! Best in my opinion.",
      "text": "I love this car seat! Compared to friends who have other popular brands, I feel like this car seat has better head protection. (See pic for side panels by my daughters head; she’s 9 months now but it has been perfect even as a newborn!) Her head doesn’t flop back and forth or down when she sleeps. The canopy on this seat is excellent because it extends forward more than most which I love. All around, in my opinion you can’t beat this seat!",
      "rating": 5.0,
      "verified": true,
      "author": "MalLori",
      "helpful_votes": 6,
      "publication_date": 20190715
    },
    {
      "title": "Very nice car seat",
      "text": "Very nice car seat. It’s a bit bigger and heavier but since it’s so roomy my 10 lb newborn baby had enough room in it. He is 26 pounds, 10 months old and still fits easily in it. He falls asleep in it every time and shows no signs of him being uncomfortable in it. It removes easily to clean. Love this car seat. I purchased a compact umbrella stroller to go with it and it snaps into it perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "maria",
      "helpful_votes": 7,
      "publication_date": 20180810
    },
    {
      "title": "The Best",
      "text": "I had to purchase an infant seat in a rush when my car was stolen with our car seat installed in it on Christmas 2 days before my son was born. The upside was that I chose this Graco seat that has a beautiful herringbone pattern & is SO easy to install. The car seat tech at the hospital said that out of the 100s or variations of Graco infant seats available, this is his #1 choice for safety and installation ease. It is compatible with my Graco Jogger stroller.",
      "rating": 5.0,
      "verified": true,
      "author": "Britt",
      "helpful_votes": 7,
      "publication_date": 20190126
    },
    {
      "title": "So lovely but beware it is heavy!",
      "text": "The car seat looks amazing. Fabric is nice and not that scratchy type that others have. The button is what prompted me to buy this seat for our 5th little one coming this summer. Playing around with it and the handle button sticks a bit. So easy to install base in a vehicle! Only complaints are, super ugly huge warning labels right where baby’s head will be and this seat is extremely heavy! I weighed it on my scale and without the base it is 10.4 pounds! I’m Coming from the super lightweight maxi cosi I had for my last baby so this is a huge difference and I just might have to return it for that reason",
      "rating": 4.0,
      "verified": true,
      "author": "Prdmom22",
      "helpful_votes": 4,
      "publication_date": 20190516
    },
    {
      "title": "Love!",
      "text": "Love, love love! Just got this today and love it! The infant insert is very cushioned and well made. My favorite thing is the extended canopy! Complete protection from the sun (and strangers) lol. Only downfall I would say is the car seat is a little heavier but overall love it! I love Graco products. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 6,
      "publication_date": 20200203
    },
    {
      "title": "Good solid safe carseat.",
      "text": "This car seat works awesome and is easy to install. We had a preemie baby and was 4 pounds 9 ounces when he was allowed to go home. The hospital helped make sure he was a little more snug by putting a couple rolled towels under the padding insert on the sides. Other then that minor adjustment it worked perfect for his size. My wife and I don't think the weight is too bad. Yes the canopy fits through handle snug but to me that is a minor issue. My number one worry about car seats is SAFETY of baby. I order all terrain J is for jeep stroller to go with since it will snap right into it.",
      "rating": 5.0,
      "verified": true,
      "author": "Derrick Reynolds",
      "helpful_votes": 5,
      "publication_date": 20180908
    },
    {
      "title": "Wiggles in base!",
      "text": "I’m very disappointed in this car seat. As we speak we are on our way home from the hospital and the car seat jiggles in the base. Why? How is that even remotely safe? I am hoping to return it and get something better as soon as we get home because there is no way this car seat is safe.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret Renn",
      "helpful_votes": 8,
      "publication_date": 20190119
    },
    {
      "title": "The canopy really is a HUGE flaw",
      "text": "I just got this car seat today for my baby that is due in July. I was so incredibly excited, but was also nervous about the canopy from reading a couple of the reviews, but took the risk anyway. Well, although I love literally everything else about the car seat, the canopy is so disappointing. Makes it really difficult to adjust the arm bar because the canopy is so bulky. They are basically the same exact size, so they clash rather than smoothly flow together. I see a lot of difficulty with it in my future, and am sadly thinking about returning it. This carseat would be amazing if it wasn't for that. It really needs to be redesigned.",
      "rating": 3.0,
      "verified": true,
      "author": "Sara Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "A safe and sturdy option",
      "text": "Bought this car seat after a car accident ruined my original one. Wanted something inexpensive but also safe and comfy. I love this car seat about a million times more than my original - it’s light, easy to use, and holds a higher amount of weight, which is awesome since I’m not ready to give up the removable car seat for a while longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190601
    },
    {
      "title": "Graco infant seat",
      "text": "Was exactly what I was looking for and super cute! Love the colors, looks super comfy. I usually get Chicco brand so was nervous to choose a different brand, but absolutely love it! Thank you for such quick shipping! Can't wait for my baby boy to get here any day now!",
      "rating": 5.0,
      "verified": true,
      "author": "Alena Budris",
      "helpful_votes": 5,
      "publication_date": 20190113
    },
    {
      "title": "Handle doesn’t clear canopy :[",
      "text": "This car seat seemed great off the bat; secure padding, easy install, good looking overall but when it came to functionality it flunked the test for me. I was so excited about the extended canopy with the extra mesh strip that unzips for you to be able to see baby through the canopy but the HANDLE DOES NOT CLEAR THE CANOPY. Also, I didn’t realize you had to use both hands on each side of the seat to move the handle. You really need three hands to maneuver the handle over the canopy and unfortunately I only have two so I’m returning this item :[",
      "rating": 2.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Love the base!",
      "text": "Very nice! I have no complaints but It is a little on the heavy side. If I had to do over I would try to find a more light weight one. Especially since my baby was born heavy to start with! The insert is very soft but is fleece and it’s a hot summer here so I feel like it might be a little hot. The base does not wiggle at all!!! When the nurses helped us to the car and inspected the seat they said it was the tightest fit base they have ever seen!",
      "rating": 4.0,
      "verified": true,
      "author": "kasey",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Fantastic",
      "text": "I love this car seat. We have had ones in the past for our older children that were very difficult to install. My husband loves how easy it is to get this one in and out of the vehicle. I like that I can hear the click to know the seat and base are properly attached. Love that I can just lift it out of the vehicle and pop it onto our Graco stroller without ever waking up little one. As are almost all carrier type car seats, it's heavy. Seems to be the only negative.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly I.",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Safety seat",
      "text": "Beautiful product, it’s everything I could ask for in a car seat. I love the great features on this one. Well padded with great support, easy to use, sturdy, the foot extension is great as my kiddo is long! I removed 1 star because the handle doesn’t go all the way back it sticks and is difficult to maneuver. I waited so long to receive this and my son will be needing this to get discharged from the hospital.",
      "rating": 4.0,
      "verified": true,
      "author": "Yvette B.",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Good with some problems",
      "text": "The button for the handle is the main problem. You can't push it and get the handle back all the way. It goes to the middle, then you have to release and push again for all the way back. The button to tighten and release the straps is hidden--covered by the seat padding. The seat base also cannot be leveled in bucket seats.",
      "rating": 4.0,
      "verified": true,
      "author": "KriStall",
      "helpful_votes": 2,
      "publication_date": 20191213
    },
    {
      "title": "Good head support",
      "text": "The car seat is a very nice car seat but if you have a big baby it will outgrow it within a month, very nice for smaller babies has a good head support",
      "rating": 2.0,
      "verified": true,
      "author": "Kayla ",
      "helpful_votes": 7,
      "publication_date": 20180908
    },
    {
      "title": "Favorite Infant Seat",
      "text": "I love this car seat so much. I had the regular snug ride 35 from my first, but I’m so glad I upgraded to this one for our new baby. It’s so easy to use, and seems very comfortable. I got it on sale, but I would pay full price for this. The canopy is also really nice, it’s quiet so I can move it up and down without waking up the baby. Also, the one button to move the handle is so convenient. But it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashton",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Erm....IN LOVE!",
      "text": "Lord I love it! My third child, 6/7th carseat, so far my favorite! It's actually a lot nicer in person, the fabric seems easy to clean, the newborn insert looks very supportive for the Teddy bear I put in it to visualize my newborn who is not here yet. Very much in love with it. You can tell it is quality! Easy to use, the push button adjustment on center handle is a huge plus, easy grip clip on back of head rest part to attach and detach from the car seat base. The straps are easily adjustable and standard. Excited for the stroller part of it to come tomorrow!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MumOf3",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Not true to description. Heavy.",
      "text": "Very displeased with this from the moment I took It out of the box. In the pictures it looks like it’s going to be more of a black/white color but instead it was Tanish. Colors aren’t the biggest deal in the world. But the handle visor on it also had a small tear in it and wasn’t very easy to lift up and down and the handle can’t even be pushed down over the visor or whatever you call it. It’s also very heavy. I’m going to try and sell this and get a different model As it’s too close to my due date to try and send it back and wait for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Dominica",
      "helpful_votes": 2,
      "publication_date": 20191014
    },
    {
      "title": "BEST THING I BOUGHT FOR MY BABY",
      "text": "When I brought my baby home from the hospital, I was so overwhelmed to leave the nurse's care. But, I also was so excited to finally have her on my own. My husband was in charge of installing the base - and WOW! it was SO easy. It's only 3 steps and it's in. I expected it to be so much more complicated after chatting with some of my friends who have other brands. I love the audible click that the base makes when I install it, it really helps me to know I did it right. I wish I could hear the click with all things parenting lol!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassidy S.",
      "helpful_votes": 3,
      "publication_date": 20180817
    },
    {
      "title": "Love this car seat!!",
      "text": "Love this car seat! My daughter started to HATE being in her old car seat to the point where she would scream the entire time she was in it. Which was very unusual considering she's a pretty happy baby. I felt like she was uncomfortable so I looked into this one and she loves it. It's a lot comfier for her, so much easier to adjust the straps and lighter than her last one. I would definitely recommend this to friends and family. The one thing I would change is how the handle hits the shade cover but it's not a super big deal",
      "rating": 5.0,
      "verified": true,
      "author": "adriana",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Love love love!! Safe, comfortable, supportive.",
      "text": "I love this car seat! it hugs my baby like a glove and he loves it too. It’s well padded, super easy to install, and baby just looks more comfortable than in his previous seat. The head support keeps his head secure and safe —- no side slumping. i’d give it 10 stars if i could.",
      "rating": 5.0,
      "verified": true,
      "author": "chrmts",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Great quality, easy install, sturdy seat, no rethreading!",
      "text": "This seat is great. It is sturdy and easy to install. It's easy to move the head rest up and down. NO rethreading was a major selling point. I like the click tight base install. This seat has alot of cushioning and my baby seems to like sitting in it. The only thing is bc it has the larger head protection(which is one reason i bought this seat), it does make my LO sweat during the hotter days. This is nothing that would keep me from buying it again, but just an fyi.",
      "rating": 5.0,
      "verified": true,
      "author": "amanda mcfadden",
      "helpful_votes": 3,
      "publication_date": 20180626
    },
    {
      "title": "Good for preemie",
      "text": "We had a scare at 31 weeks of pregnancy and thought our little one was coming early. One of the nurses suggested we look for a carseat that accommodates a preemie. This one is rated for a 4 pound baby. Now that baby is here, she has reflux-completely covered this seat in puke. It is not that hard to disassemble and wash. She's only 6 weeks old, so will update the review later if there are issues with durability later. It is extremely easy to install the base, but feels very sturdy once installed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Pineda",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Everything's great - but...",
      "text": "Almost exactly what we wanted. Great carseat at a decent cost. The only thing that could be better is if it had an angled handle for easier carrying.",
      "rating": 4.0,
      "verified": true,
      "author": "SamuraiDaddy84",
      "helpful_votes": 2,
      "publication_date": 20200129
    },
    {
      "title": "Love!",
      "text": "So i just got this in a couple days ago and i already LOVE it! My baby is born in a couple weeks and i already know it’s going to be great. It looks and even FEELS safe and sturdy.. I’d say it’s worth the price!! To me, money doesn’t matter when it comes to my babies safety! I bought the graco duoglider double stroller with this and it clicks in perfect! Super excited about this car seat!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Unfortunately it didnt fit our stroller and according to description it should’ve.",
      "text": "This is an amazing product but it didnt fit our stroller and according to the description it should. Unfortunately we had to buy another one but if this one fits your needs its a great one. Its well made, soft , elegant and small.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Great Car Seat",
      "text": "This is a great seat, the base is very easy to install and once it’s in correctly it’s VERY secure. Barely a wiggle. I love the height adjustment system as well, no messing with straps. The quiet shade is wonderful and I love the feel of the fabric. Make sure you READ your manual to correctly fit your child in the car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie Brechbill",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Easy to use",
      "text": "After countless hours of researching car seats I finally landed on this one. It only took a few minutes to install and I was able to purchase an extra base for my husbands vehicle. I love how far the canopy comes down to help keep the sun out of my daughters eyes (and to keep unwanted hands from touching her while out and about). The only complain I have about it is the lack of space between the handle and the canopy. If you want to pull the canopy down you have to wiggle it passed the handle. It has great safety ratings though and my daughter seems cozy in it. Overall it’s a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Desarey",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Annoying",
      "text": "The giant stickers are ridiculous. Other brands with the same head support don't have them right on the head rest. Its ugly and sticky and annoying. The tightening belt is stuck. Will not tighten snug to baby. Canopy and handle are stuck to eachother as other reviews said. Doesnt bother me so much but the other things are irritating. Love how it snaps to our graco stroller. Quick and easy. Love the stroller.",
      "rating": 2.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Amazing car seat and travel system",
      "text": "I cannot imagine using another car seat after using the Graco SnugRide SnugLock 35. I feel like our little guy is so safe and cozy in his car seat. It was easy to install, and easy to tell that you have installed correctly. I also love how this car seat easily clicks into his stroller. It makes traveling with an infant a breeze, which is seriously hard to do. Buy this car seat, you will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "lulup33",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Nice carseat/ doesn’t latch to cart",
      "text": "I love the support this seat has. Love the style and it fits with the graco jogger. I don’t like that it doesn’t attach to a grocery cart. Also the base gets loose and needs readjustment almost weekly. I’m not sure if it just doesn’t hold the seatbelt tight enough or what.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great car seat that works with other Graco products.",
      "text": "This car seat is very comfortable, easy to carry around, and feels very safe. We used it with our double seater Graco stroller, and it was seamlessly compatible. The best part about this car seat is how far the sun visor extends. There's an extra foldable flap that provides even more sun protection, almost to the point where it covers the entire inner carriage.",
      "rating": 5.0,
      "verified": true,
      "author": "Borsalino A.",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Love it!",
      "text": "We’re so happy with this car seat! It’s lightweight, secure and stylish. I love the vent on the sun cover. I can see what others mean about the handle and sun cover being so tight but it hasn’t really been an issue. No regrets. And we love it with the Graco SnugRide car seat carrier “stroller frame” so we don’t have to use a full stroller for wheels.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristyn L Meade",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Waste Of Money!",
      "text": "My daughter absolutely hates this car seat. This car seat is very uncomfortable for her. She can’t stretch out in it because of the head support and you can’t remove it from the car seat. We go on 3 1/2 hr trips and she gets very cramped and starts crying. I was so excited to start using this car seat. Very Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kali",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Great Car Seat",
      "text": "Only con maybe is my baby seems like she is too tall already for it, but to be honest i think this is all USER ERROR lol. Other than that i actually prefer this one over the other Graco one we have. Easy to click in and out, cover is big to block sun and rain. material is good. I think with the tallness is because i still have the head thingy in making the shoulder strap be off alittle. Overall personally I do recommend this Car Seat",
      "rating": 5.0,
      "verified": true,
      "author": "Patty K.",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Love it!",
      "text": "I have the stroller that goes with this. It is so easy transferring baby around. It looks very stylish. Washed the cushions a few times due to baby accidents. I love the screen in the shade. I am now searching for a convertible car seat now that my baby is growing and needs more room to move and will save this for the next child.",
      "rating": 5.0,
      "verified": true,
      "author": "John L",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Carrier very easy to put in and take out, seems very safe for child",
      "text": "This model has every feature you could ever imagine wanting or needing. It was a bit daunting figuring it all out. It gets good reviews for safety and reliability from customers and professional testers, and seems like it will protect the child. No complaints so far. Not cheap, but you don't look for bargains when it's for your baby's life.",
      "rating": 5.0,
      "verified": true,
      "author": "xgrep",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Sturdy! Glad I chose this.",
      "text": "This is the best seat infant car seat for the price. It is very sturdy. I was going to splurge on the Britax since I am a huge britax fan but thier click tight seats do not preform as well as other brands despite being easy to install. I looked up crash test ratings and this one did better... and it is cheaper!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Happy with it",
      "text": "Very satisfied with this seat. We used it for 8 months. The pictures show his carseat fitting at the hospital and then just before switching. He probably could have stayed in it a little bit longer, but it was getting snug width wise for him.",
      "rating": 5.0,
      "verified": true,
      "author": "M16",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Great carseat",
      "text": "Bought the open box one, perfect condition, good quality love it!",
      "rating": 5.0,
      "verified": true,
      "author": "cmb",
      "helpful_votes": 2,
      "publication_date": 20200125
    },
    {
      "title": "Amazing Amazing Amazing",
      "text": "Love this car seat and the color! We ordered Haven. My son loves this carseat and rarely cries in it. The only downside is it does get me really sweaty especially in the summer. Easy to use. Sometimes gets stuck in base. Easy to dissemble to wash after any accidents. Clips in easy to the citymini gt stroller. We have the non-extended version in the other car and the extended fit is definitely a bonus!",
      "rating": 5.0,
      "verified": true,
      "author": "Alisa",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "GREAT",
      "text": "AMAZING. I got lucky getting this on sale, but you won’t regret it. It’s super stable and you can tell just by holding it, and I Love that it can extend for taller babies as they grow. Regardless if it was on sale, the full price would still be WORTH the purchase and this can last for your upcoming children in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy M.",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Canopy and handle interfere with each other",
      "text": "Most of the reviews were positive so I was really excited for this car seat. Unfortunately, I was very disappointed. The canopy is too large and interferes with the handle. It was a struggle to adjust the handle and pull the canopy forward because they just get in the way of each other. I know I’m not going to be able to deal with this the entire time. I really love Graco products, so I was surprised at the way this was designed. I’ve just purchased the platinum car seat instead. Hoping it will be much better!",
      "rating": 1.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Did not come with latch belt to secure into the car.",
      "text": "Super frustrated with this purchase. The seat itself is great! However, I received it without the latch belt that is needed to secure the base into the car. I have contacted Graco several times via phone and email to have one sent with no solution and now no response. After the first phone call I was talk it was a warranty claim, submitted all requested info, was asked to provide pictures and a few other things, immediately provided, since I can not get anyone on the phone or a response via email. The carseat doesn't do me a lot of good if it can not be buckled into the car.",
      "rating": 1.0,
      "verified": true,
      "author": "amanda2013",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Buy this you will never regret it 🥰",
      "text": "I’ve been looking for an affordable Safe yet good quality I been canvassing in all stores and I gave up and look in here instead, it’s worth the price excellent quality super classy expensive look I can’t ask for more very satisfied costumer here my due is May i’m so excited to put my baby girl in it highly recommended 😍🥰😘",
      "rating": 5.0,
      "verified": true,
      "author": "Ylaine",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "100% Graco",
      "text": "Snugly fit my 6lb baby into it, she doesn’t love being in a car seat but she doesn’t hate it either. She’s only 2 weeks now so I’ll update if my view changes. I have 2 convertible Graco seats for my 2 year old and 2 Graco strollers and that’s all we buy so I’m sure I’ll love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly T",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Great car seat!",
      "text": "I love this car seat! So easy to use and install. My favorite feature is the one button for the handle release. I also love the material on the canopy and how far down the canopy comes. It’s great for blocking the sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Bex",
      "helpful_votes": 3,
      "publication_date": 20181111
    },
    {
      "title": "Mother Approved",
      "text": "Best seat we've gotten yet... and we have 5 kids. Bought for a preemie. He was 4lbs 9oz and it held him snuggly for being so tiny. Material is soft and durable. It's bulky but that's what comes with non flimsy safety seats. Would buy again, hopefully won't have to though.",
      "rating": 5.0,
      "verified": true,
      "author": "April ",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Best Car Seat",
      "text": "I like that the button to move the handle is in the middle instead of on both sides, i like all the support and cushion in the car seat, the straps are easy to adjust. It's a very high quality car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Caylee",
      "helpful_votes": 2,
      "publication_date": 20181022
    },
    {
      "title": "Overall happy with purchase",
      "text": "Love this car seat! My son looks comfortable in it and love that he has more room to grow. My only complaint is that the handle that has the red button to make it go down can sometimes get stuck and I would keep trying to get it to where I want it to be but great overall.",
      "rating": 5.0,
      "verified": true,
      "author": "Erwin",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Heavy",
      "text": "This is definitely leaning towards the heavy side of car seats. We tend to struggled with the head pillow a lot and adjusting the hight of it. Fashionably it’s great! But functionality, It’s too much of a hassle to put our son in and out of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Mum2boys",
      "helpful_votes": 3,
      "publication_date": 20190406
    },
    {
      "title": "Great car seat great value",
      "text": "I had bought another car seat and just wasn’t impressed by it. I saw this one on sale so I figured I would buy it for my suv and put the other seat in hubby’s truck. The quality on this seat is outstanding. It’s SO easy to get in and out of the base. I wish I would have just bought 2 of these!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Love",
      "text": "Purchased these and the stroller for newborn twin nephews. Haven’t used the stroller, but their parents say it’s is life saver and easy to use. These seats though....amazing! Comfort of knowing they are securely snug and safe whenever I take them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Beth Wentz",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "3 month old in crash",
      "text": "Me and my 2 sons were in a wreck two days ago. Someone turned and ran into us off guard. My 3 month old was in this seat. It held him in like bubble wrap and he doesn't even have one bruise on him! I'm so happy we researched this seat and made sure to go with our guts. Thank you Graco for protecting my precious babies!",
      "rating": 5.0,
      "verified": true,
      "author": "Brogan Hicks",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Love it!! 5 stars",
      "text": "Love this car seat SO much this is my second baby and we went with a Graco last time but it was not as nice as this seat love the infant head support insert it is top quality and my little man loves to be in his car seat! I do however wish it were not so heavy but then again my little man is chunky lol",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine ",
      "helpful_votes": 2,
      "publication_date": 20190301
    },
    {
      "title": "HIGHLY recommend",
      "text": "I love this carseat. The single button on the handle is way more handy than I expected. I love how easy it is to adjust the headpiece.",
      "rating": 5.0,
      "verified": true,
      "author": "Stasi",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Heavy and can’t remove to clean",
      "text": "A little heavy and baby keeps sliding down and is hunched. Very protective if baby stays put and easy to adjust. You can’t remove anything to wash which is unfortunate, wish I would have known so I could purchase another but it’s too late.",
      "rating": 3.0,
      "verified": true,
      "author": "Jamie ( :",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Amazing!!",
      "text": "I LOVE this car seat!! The handle moves with ONE button! Who has time or hands to grab two buttons simultaneously to move the handle, surely not this momma of three! I love the newborn padding inside. The extra head support is great!! Even as a newborn, I never had to worry about his head rolling side to side. It is extreme easy to take apart and clean. You don’t have to undo the straps to take the covers off to wash. The shoulder straps move with a button behind the seat. So there is no taking the straps out to re thread them through for growth. This is by far my favorite infant car seat that I’ve ever had!",
      "rating": 5.0,
      "verified": true,
      "author": "Richelle",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "So stylish and comfortable",
      "text": "This car seat is extra padded for babies comfort. We can’t wait to bring our newborn home in this car seat",
      "rating": 5.0,
      "verified": true,
      "author": "Cris Johnson",
      "helpful_votes": 2,
      "publication_date": 20200310
    },
    {
      "title": "Baby lvo",
      "text": "This carseat is easy to use. I like that it comes with a base include. My child sleeps throughout entire errand trips when I use this carseat. I also bought the snug rider stroller attachment so my child never has leave the seat unless it's time for a feeding or changing.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Love it!",
      "text": "We love this car seat! It’s lightweight which is important when looking at car seats because once you add a baby they get really heavy! I love the sleek look of it. I also liked the insert when they’re smaller to keep them snug but that you can remove it when they get bigger. It’s not super wide either so having a narrower car seat is nice and easily fits in a variety of vehicle styles.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Easy!",
      "text": "So easy to use, we got the wheels to make it into a stroller and it works like a dream. So much easier than what we had for our first child.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Wallace",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "stitching is already coming apart:/",
      "text": "I just bought this for my newborn and it hasn’t even been used for an entire month and the stitching is already coming apart in a few different spots. My baby fits snug in the seat which I like, but I feel it’s falling apart way too quick.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 2,
      "publication_date": 20181009
    },
    {
      "title": "Padding around the head does not come out.",
      "text": "I would not have bought this car seat had I known the padding around the babies head is part of the car seat meaning it does not come out. When my baby gets a little bigger (8,9,10+ months) I won’t want all that padding in there but it looks like I have no choice.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Safe and comfortable car seat",
      "text": "I absolutely love this car seat. I have 2 of them! So easy to adjust, and my baby is comfortable and falls asleep immediately when I put him in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Pace",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Best thing base installation is super East",
      "text": "This is great quality product as all other Greco they safety is best ... my new born son seats comfortably in there... installing the base is super easy unlike other sell at seat when you have to use lot of muscles",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Great infant seat",
      "text": "This infant seat is working out great for car and stroller",
      "rating": 5.0,
      "verified": true,
      "author": "jeff binschus",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "It’s heavy, but great!",
      "text": "This car seat is beyond safe, easy to use, and overall amazing. My only complaint is that it is heavy! I absolutely love the one hand adjusted handlebar, which was my main reason for purchase. I wish it could be this amazing and safe but weigh 10 lbs less.",
      "rating": 4.0,
      "verified": true,
      "author": "MeaganTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Heavy but seems sturdy",
      "text": "Maybe it's because it's my first car seat, but I think this one is heavy!! I also thought the base install was confusing and figuring out how the seat attached/detached was confusing. Still have yet to use it with baby... But again, maybe it's because I'm new to this!!",
      "rating": 3.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Get it while it last!!!!! Dont think twice!!!",
      "text": "This car seat is magic😍😍 Its very easy to snap in the stroller. Easy to take out. My baby loves it, I had to get the seat because my baby was born 9lb and 22 inches so he is growing fast and taller, l also love this seat because you can customize his confert and can extend his leg room, I sooo recommend the car seat. Something that is going to last is worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Great Quality",
      "text": "Really nice car seat, baby isn’t here yet so it has not been used but the quality is amazing. Lots of cushion and I love how the shade is quiet when you pull it down and can be pulled down further than most car seats. The one button handle is also nice! Will try to update after baby uses it.",
      "rating": 5.0,
      "verified": true,
      "author": "csmall",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Worth every penny.",
      "text": "Put simply, this carseat is amazing. As a father of 5 children, I've owned several different carseats. This is by far my favourite. Base installation is the best I've ever seen, it's super quick and there's absolutely no question about the security of the base. My only gripe with this carseat is the lack of brackets on the backside of the carrier to attach it to a shopping cart. Every other carseat I've owned had these, and the lack of makes shopping precarious.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Super safe with padding Comes with base. Long sun visor.",
      "text": "Amazing padding for baby. Sun visor is long and fully covers baby and has air vent. I feel sooo much safer driving with my daughter in this car seat. Comes with the base that is super easy you just lift the handle and pull the seatbelt over it and then close it on the belt. Works my with click connect double stroller. Great value !",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl F.",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Great seat",
      "text": "I love the amount of support it has, and especially love the adjustable straps that don’t require you to take the seat out and rethread straps when baby grows! Just slide and lock",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Neal",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Great for larger babies",
      "text": "This is a great seat for larger babies! Love the additional head support! Love the center button on the handle! (As opposed to two-handed, one on each side, handle adjustment on the other one I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana Lloyd",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Easy to install and use",
      "text": "Great fit for baby. The carrier is much heavier than I remember with my other child though. Will be a challenge carrying twins in carrier when they are closer to the 25 or 30 lb mark. The weight of the carrier is the only reason I gave it 4 stars",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Extra sun shade!!!",
      "text": "We recently had our 4th and needed to get a new car seat. This one doesn’t disappoint! My favorite feature is the Sunnis unzips allowing for extra length to block the sun from baby’s eyes!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie P",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "For future use 💖",
      "text": "I have yet to unbox, but it’s definitely what we needed for baby when she comes! Will be unboxing before my return date to make sure it’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Ally Cat",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great car seat!",
      "text": "Love this car seat! Love the head support, breathable canopy and easy one button handle adjustment. I wasn’t a huge fan of the color in the stock photos but it is much prettier in person.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenna",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Canopy difficult to open and close, and hard to get the handle around the canopy.",
      "text": "It looked nice, but the canopy was very difficult to open and close around the head of the seat, but then the handle could not go over the canopy. I ended up returning it without even trying it in the car the canopy situation was so bad.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Very durable and comfortable",
      "text": "This is a really nice car seat. It has a lot of cushion and support and looks like it will be very comfortable for baby. The reason I gave it 5 stars is because it is a little on the heavy side. Though, it is very durable. Also, I can see how the canopy could be annoying to some people. It is close to the handle, but I feel like my arm slides under the handle pretty easily even with the canopy there. Overall All I am very happy with this car seat.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Great Car seat",
      "text": "Got the Oakley color bc we are actually naming our 2nd child Oakley,and of course it's beautiful and looks durable. Easy to install, and not too heavy. It can also attach to our Graco jogger stroller.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara B.",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Beautiful and lightweight",
      "text": "Beautiful car seat with really soft inserts. Very light weight wich is appriciated. Fits into graco strollers and most bases.",
      "rating": 5.0,
      "verified": true,
      "author": "Eve",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Great carseat",
      "text": "This car seat has been so easy to use. Easy to reposition the belt as baby grows. There is no need to undo straps like old school car seats. Also love the ability to adjust the belt with the red button between the feet of child.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ison",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Highly recommended!",
      "text": "I love how deep the cushions are on this carseat. Offers maximum side impact protection. Very soft and comfortable for baby? Easy to install and stays in place. Light weight and easy to carry! I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Shanlowe",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Fantastic at a great price!",
      "text": "Gorgeous car seat! Seriously love the one button Handel and removal of the car seat from the base is very easy and smooth. I do think the “click” once the seat is attached to the base is pretty loud but it dose sound Secure 💛 can’t wait to see my baby in it when she gets here in March!",
      "rating": 5.0,
      "verified": true,
      "author": "Trayton Schroeber",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Love the seat...but canopy is annoying",
      "text": "Knew the problem of the canopy getting stuck on the handle before I purchased from other reviews, but decided I could live with it. Other than that it’s a great seat. Just can’t believe that Graco didn’t fix the canopy issue beforehand. The snug lock base is by far the easiest to install!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Lovely car seat",
      "text": "The car seat is beautiful. This is my second pregnancy and I instantly fell in love. The head support makes me comfortable knowing my newborns head won’t be falling while driving. The color is beautiful !",
      "rating": 5.0,
      "verified": true,
      "author": "JA",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Worth the price! Graco does not let you down!",
      "text": "We love this car seat! The fabric is thick and very comfortable for our little one. Highly recommend pairing this with the baby jogger. It’s so easy to use and very versatile. One of my favorite things on our baby registry. Our baby girl loves her stroller and car rides in this seat!",
      "rating": 5.0,
      "verified": true,
      "author": "Micah",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Wasn’t sure about this seat at first, but I love it now!",
      "text": "The snuglock feature is AMAZING. Coming home from the hospital 2 weeks ago with a brand new baby I was frustrated when I couldn’t get the straps to tighten properly and was considering buying a different seat and returning this. However, after giving it time the straps are now easy to tighten and loosen and this seat is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Raechel Todd",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "5 stars !",
      "text": "I am obsessed with the quality and the color. It is super cute and honestly easy to put together I use the attachable stroller with this as well and it just snaps on I highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan H.",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "I was impressed the second I opened the box!!!!",
      "text": "Super quick to install and latches so tightly to the seat even with only the seatbelt! The straps don’t detach to grow with baby, it’s a simple pinch/slide in the back. The insert surrounding baby’s head is solid and makes me feel secure knowing if we get in an accident baby will be safe and sound. Back of the handle hinges are hollow making it easy to hook and pick up even with a heavy/bigger baby. The carrier itself is heavy, but worth it to know it’s so solid!! I wish I had this before baby #3!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Johnson",
      "helpful_votes": 0,
      "publication_date": 20191210
    }
  ],
  "product_meta": {
    "title": "Graco SnugRide SnugLock 35 Elite Infant Car Seat | Baby Car Seat, Oakley",
    "description": "Style:SnugLock Easy Install| Size:With premium comfort| Color:OakleyCLICK. That's the sound of a secure install. The Snug Ride Snug Lock 35 Elite Infant Car Seat has a hassle-free, worry-free installation for rear-facing infants using either vehicle seat belt or Latch. In three easy steps you can feel confident you've got a secure install. To further make installation a breeze, the In Right Latch provides a one-second connection and the base with its 4-position recline and easy-to-read level indictor helps eliminate installation guesswork. The Simply Safe Adjust Harness System lets you adjust the harness and headrest height together, so it's as easy as it is safe. The Safety Core absorbs crash forces in the event of a frontal crash. Clean up is a breeze with the Rapid Remove seat cover. Click Connect technology provides a secure one-step attachment to all Graco Click Connect strollers making it easy to create a custom travel system that best fits your lifestyle. The Snug Ride Snug Lock 35 Elite helps protect rear-facing infants from 4 - 35 lb and up to 32\".",
    "rating": 4.8,
    "feature_bullets": [
      "Snug Lock Technology features a hassle Free 3 step installation rear facing car seat helps protect infants from 4 to 35 pounds and up to 32 Inches quick and Easy clean up with the Rapid Remove cover; Head must be more than 1 inch from the Top of the headrest Infant car seats Made 2011 or after",
      "Simply Safe Adjust Harness System adjusts headrest and harness together to prevent rethreading Safety Core absorbs frontal crash forces",
      "Adjustable base with 4 recline positions and Easy to read bubble level indicator In Right Latch system for a one second Latch attachment",
      "Rotating canopy with window and visor provides shade and sun Protection for baby removable newborn head and body Support cushions baby",
      "Check Your local and state laws, as well as AAP and NHTSA recommendations, for car seat usage Engineered & rigorously crash tested to meet or exceed US Standard FMVSS 213; Machine washable seat cushion and canopy; metal and plastic parts may be cleaned with mild soap and Cool Water; Buckle may be cleaned with a damp cloth; Harness straps may be cleaned with a damp cloth"
    ],
    "specifications": {
      "Product Dimensions": "29.09 x 18.31 x 16.22 inches",
      "Item model number": "2001875",
      "Is Discontinued By Manufacturer": "No",
      "Minimum weight recommendation": "4 Pounds",
      "Maximum weight recommendation": "35 Pounds",
      "Material Type": "Plastic, Metal",
      "Number Of Items": "1",
      "Style": "SnugLock Easy Install",
      "Batteries required": "No",
      "Orientation": "Rear Facing",
      "Rear-facing minimum child weight": "4 Pounds",
      "Rear-facing maximum child weight": "35 Pounds",
      "Item Weight": "18.8 pounds",
      "ASIN": "B01MQHKVX3",
      "Customer Reviews": "4.8 out of 5 stars1,744 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#1,616 in Baby"
    },
    "categories": [
      "Car Seats & Accessories",
      "Baby Products",
      "Car Seats",
      "Baby",
      "Infant"
    ],
    "price": 179.99
  }
}