{
  "website_summaries": [
    {
      "verdict": "A stylish, lightweight jacket that's perfect for cool to moderately cold temperatures. Consumers who find heavy jackets cumbersome will appreciate this design.",
      "pros": [
        "Garners enthusiasm for the warmth it provides despite the incredibly lightweight structure",
        "Resists water in most conditions",
        "Comfortable fit isn't bulky and doesn't restrict movement"
      ],
      "cons": [
        "Sizes tend to run large",
        "Some faulty zippers reported",
        "Not ideal for wearing in frigid temperatures"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bought the XXL and felt it was a little short ...",
      "text": "Bought the XXL and felt it was a little short and baggy in the torso. I am 6'3\" and it could have been an inch longer in the arm and torso. The jacket is warm and did well on the 20 degree day that I test it. I will likely return.",
      "rating": 3.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 3,
      "publication_date": 20171229
    },
    {
      "title": "5- hood are not usage",
      "text": "this is my second jacket thermobol..this is the best that I have..I winter in a vest and jacket go and I'm comfortable.but the hood is not suitable at all,it is large and has no adjustment,a light wind just takes it off your head..therefore I recommend buying this jacket without a hood",
      "rating": 5.0,
      "verified": true,
      "author": "Good to Good",
      "helpful_votes": 2,
      "publication_date": 20171015
    },
    {
      "title": "Perfect Jacket",
      "text": "I purchased this jacket for my husband as a Christmas gift. He’d been talking about a co-worker who owned one all fall. We searched the stores high and low to no avail. I was ecstatic to find it on amazon during the holiday season. He loves it. He’s been able to wear it on winter days out here in NY when the temp is above freezing. He says it kept him warm. He loves the style and appreciates that he can wear it to work in the city and still look business casual. What he really enjoys most about it, is how light it feels on.",
      "rating": 5.0,
      "verified": true,
      "author": "C.R.C.",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Not as advertised",
      "text": "Size: Medium, Color: Conquer Blue (Past Season). The description and the pic on the web page shows that the jacket has internal chest jacket, leading to my purchase. The one I received did no have it. I returned it via Amazon Fulfillment.",
      "rating": 2.0,
      "verified": true,
      "author": "Linh L.",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Great buy!",
      "text": "I was somewhat skeptical of how well it would do in cold temperatures, but was pleasantly surprised on how warm it keeps you. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "air232",
      "helpful_votes": 4,
      "publication_date": 20171203
    },
    {
      "title": "Awful stitching",
      "text": "For the price of this jacket I expect more Quality in the stitching of this product, yes its warm and very lightweight but i doesnt look durable",
      "rating": 1.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Warm, packable, but fits large!",
      "text": "Fits quite large. My husband probably could have gone down a size. Husband says it's quite warm in our cold winters. Great for packing since it balls up quite small.",
      "rating": 4.0,
      "verified": true,
      "author": "Observe_the_cat!",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Kept me warm while winter back-packing.",
      "text": "I wasn't paranoid about it getting wet from rain or sweat. Kept me toasty while hanging around at camp in 30 degree temps.",
      "rating": 5.0,
      "verified": true,
      "author": "WILL",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Great jacket for the money",
      "text": "Great great lightweight but very warm jacket! My son loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tolstoy",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Super light weight and provides the warmth needed on the ...",
      "text": "Super light weight and provides the warmth needed on the move. I love how compact this jacket can become. Quality is great as the stitching is consistent and havent seen any fill leak out. Great jacket for around the 40's.",
      "rating": 4.0,
      "verified": true,
      "author": "FelixZ",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Fits well. Deep outer pockets",
      "text": "Love this jacket. Only wish for more inside pockets. Other than that it is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelsey K. McCall",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "my 5th thermoball",
      "text": "I find these wonderful, amazingly warm for how light they are. I have to remind myself not to over dress when going out in the cold with one on. Layering is easy if needed as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Stan III",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Love this coat",
      "text": "Its a great jacket for people who dont like super heavy coats.",
      "rating": 5.0,
      "verified": true,
      "author": "THEODORE M ZIMMERLY",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "... you'd expect from North Face warm jacket that is easy to",
      "text": "What you'd expect from North Face warm jacket that is easy to pack",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "It’s North Face!",
      "text": "The quality of North Face come shining through I got this coat specifically for the hood. Glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael F. Chase",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Crappy Quality Control",
      "text": "Sent me a black and red coat that said it was a Thermoball, but did not have the Thermoball design. I tried to search for the product number on the tag and it came up with something weird, I think the jacket was a bootleg.",
      "rating": 1.0,
      "verified": true,
      "author": "Neil Coon",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "TOO BIG!!! IF YOU ARE XL ORDER L",
      "text": "WAY TOO BIG...ALL MY T-SHIRTS AND JACKETS ARE XL AND FIT ME PERFECTLY. THIS IS TOO BIG!!",
      "rating": 4.0,
      "verified": true,
      "author": "Marco Avanzi",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "the fit is as described",
      "text": "I bought it for my son he really liked the fit. is very happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Qualey",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Would have liked for the sleeves to be a little longer",
      "text": "My son is 6ft and the sleeves were an exact fit. He has plenty of room. Would have liked for the sleeves to be a little longer. A larger size would have been to big.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheba",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Five Stars",
      "text": "Jacket is very very stylish and will make you glad you purchased, sizing is on point!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Phil",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Dont listen to other reviews",
      "text": "Ordered a size down as per other reviewers and coat was too small. Order true to size!!",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Walther",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Great jacket.",
      "text": "Awesome. So high quality, so pliable and moveable. Really nice. Warm and rolls nicely in a bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Alexander",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Four Stars",
      "text": "Seems to run a bit large. I returned an XL for a L and it fit just right.",
      "rating": 4.0,
      "verified": true,
      "author": "Chargo",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Wrong color",
      "text": "Ordered a matte green xxl. Received a charcoal grey xxl jacket.",
      "rating": 4.0,
      "verified": true,
      "author": "joseph viggiano",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Size",
      "text": "The size I ordered was XL but it was size bigger too loose fit",
      "rating": 1.0,
      "verified": true,
      "author": "Faisal Asghar",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Three Stars",
      "text": "This is better for cold temperature but not for below zero degrees temperature ..",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Light weight and warm",
      "text": "Just got the jacket and I love it. Perfect for cool Bay Area nights, currently it’s 49 degrees out and I’m comfy with just a T-shirt underneath. I’ve got a Nupste but it’s not cold enough for that yet and makes me sweat indoors, I can wear this thermoball inside without being uncomfortable. I would say that the jacket runs a bit big. I’m 5’10” 185 lbs. with a 34” waist and glad I bought the medium size. It fits perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ Poquiz",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Do not buy. Counterfeit product. Duplicate. Cheap Imitation. Money lost.",
      "text": "This is a counterfeit product. Do not buy from this seller. This north face jacket is atleast supposed to keep you warm at 10 degree celcius but this is not the case. This works at max as a wind sheeter. This is the most expensive clothing purchase of my life and can’t believe its a total waste and a counterfiet product. I wish I can get a refund for this.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "There are better north faces than this one",
      "text": "It's a underwheliming coat, it felt like it was gonna rip at any second. Very shocked that it was a north face with such bad quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Smith",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great jacket, worth the price",
      "text": "Great fall jacket so far, we’ll see how it performs in the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "HBailey",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "falls apart and you starts to get pin holes",
      "text": "I received this as a gift and it is starting to fall apart and you start to get pin holes and the material comes out. The return on the website requires that you submit purchase date, receipts, Etc. For the money being spent they should back there product no matter what. Tks Rob",
      "rating": 2.0,
      "verified": false,
      "author": "bob b",
      "helpful_votes": 0,
      "publication_date": 20190331
    }
  ],
  "product_meta": {
    "title": "The North Face Men's Thermoball Hoodie",
    "rating": 4.3,
    "feature_bullets": [
      "100% Nylon ripstop with durable water-repellent (DWR) finish",
      "Water-resistant, insulated jacket packs into its own hand pocket",
      "Lightweight ThermoBall insulation retains warmth when wet",
      "Standard Fit, 15D nylon ripstop, Hood binding for a better fit, Hem cinch-cord, Media compatible",
      "Covered, secure-zip hand pockets, and internal chest pocket",
      "Lightweight, durable VISLON center front zip"
    ],
    "categories": [
      "Men",
      "Novelty & More",
      "Novelty",
      "Clothing, Shoes & Jewelry",
      "Clothing",
      "Hoodies"
    ],
    "price": 125.0,
    "specifications": {}
  }
}