{
  "website_summaries": [
    {
      "verdict": "A good option for basic readings, but others on our list are more versatile and universal.",
      "pros": [
        "Offers readings for a variety of diagnostic codes",
        "Easy to use – has a large screen and vivid readings",
        "Works with most 1996 and newer OBDII compatible vehicles and light trucks"
      ],
      "cons": [
        "Instructions lack details",
        "Doesn't work on some large trucks or all listed vehicles",
        "Pricey, considering it is a fairly basic tool"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Use the compatibility checker before purchasing!",
      "text": "This scanner does NOT work for all GM vehicles. On the manufacturer's website there is a compatibility checker, which I found while doing my own research. This listing needs to include the link to the compatibility checker so people can see if it will actually work for their vehicle before purchasing it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 20,
      "publication_date": 20181228
    },
    {
      "title": "Sticky sticker on screen",
      "text": "A sticker on the screen that you basically have to scratch up the screen to remove the residue really is a bummer. Do they not have Quality Control to check the product before they release their products?",
      "rating": 2.0,
      "verified": true,
      "author": "Fernando O.",
      "helpful_votes": 10,
      "publication_date": 20171222
    },
    {
      "title": "abs and srs reset is very limited.",
      "text": "The size of the screen is good but very dissapointed in the fact that it does not reset my abs or srs error. Yes it says it does to most obd2 vehicles but r not specific on which ones, and it has limited programs for checking cars computer. They should have left out the oil light reset and freeze frame as a normal guy like me not being a mechanic will not use it. Abs and srs reset is what is really needed for a non mechanic.",
      "rating": 4.0,
      "verified": true,
      "author": "el tigre",
      "helpful_votes": 4,
      "publication_date": 20181205
    },
    {
      "title": "Read the reviews and read up on the product.",
      "text": "Couple of issues one you have to log into Amazon to read instructions. It would have been nice to have a little something to let you know what the ovals mean that are blinking when you have a code. Two, I can't get it to do an o2 test. It tells me not compatible with this vehicle. 2006 Nissan Frontier. I want to be able to view live data and you can't. If you just want something to turn the light off buy something cheaper. If I could I would return it but I can't waited to long.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Great for checking Readiness Codes",
      "text": "If you're having problems getting your engine to set all the readiness codes for SMOG - this tool is an amazing help. I have a 911 and let the battery die. Major PIA to get the codes to set. This helped me from having to go back and forth to check if it was ready or not. To all those having issues with a 911 pr probably any Porsche here is my advice: Doe the Porsche readiness driving pattern. Then do then the BMW readiness driving pattern. The BMW has one where you have to go from 60 to 20 with the car in gear, no brake, gas or clutch. I think this is what set the EMT for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Chapel",
      "helpful_votes": 2,
      "publication_date": 20181019
    },
    {
      "title": "Does what it supposed to do. Price was reasonable.",
      "text": "Just received today 06-07-20 n used on my wife's 10 dodge grand caravan check engine light on. Read that cat o2 censor was bad. Cleared light for the time being, till it comes on again, till she has it replaced. Then used on my 02 Chevy blazer to where my service engine soon light was on, evap.fuel system canister is bad n will need replaced,cleared light again for the time being. Very easy to use n very clear screen reading even in direct sunlight. Very pleased so far with ease of operation n read out display. I'll give it 5 stars for those reasons. So far I would recommend this diagnose tester.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave P Customer",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Showing codes I can't find onilne - software not opening on PC",
      "text": "Received codes U1118 1/2 Permanent Lost Engine Varian Message and U1119 2/2 Permanent Lost IPM Variant messages but couldn't find what these meant. Downloaded PC software and installed but could not get to open on my PC. Rebooted, re-installed still not working on Windows. Tried tech support at 5:30p PDT (open til 6) but got a message they could not answer, they called back but I missed the call. Disappointed in out of box experience, reporting of error codes that I am not seeing in lists of codes for my vehicle, documentation supporting the product, software and support experience. Returning.",
      "rating": 2.0,
      "verified": true,
      "author": "G H.",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "It Arrived",
      "text": "This Diagnostic Tool came in an unopened package. It contained the tool and the OBD2 cable. INNOVA expects me to print the 88 page users guide.I will also have to go purchase the USB cable. When I finally got through to the company they said it's because everyone should have that cable/ BS",
      "rating": 2.0,
      "verified": true,
      "author": "Ken  Johnson",
      "helpful_votes": 3,
      "publication_date": 20190312
    },
    {
      "title": "Cheap plastic film screen that will be damaged on removal of the advertising sticker",
      "text": "Whoever had the bright idea to put a cheap sticker on the plastic film screen is bereft of rational thought. No matter how hard I tried to keep the sticker intact during removal, it would tear. The force of the sticker on the screen pulled up folds and I couldn't help but scratch it in trying to remove the little sticker pieces. Absolutely intolerable cheapness from a hundred dollar tool.",
      "rating": 2.0,
      "verified": true,
      "author": "Adam H.",
      "helpful_votes": 5,
      "publication_date": 20180927
    },
    {
      "title": "Innova OBD II Scan Tool, is Great for early Pro and/or \"Shade-Tree Mechanic\" too.",
      "text": "I am a retired N.I.A.S.E. Auto Tech. Even though I am still using another OBD II Scan-Tool (older), this Innova Scan - Tool was hard to pass up. Have not really used it yet, Still in Container/Package. But, I look forward to using it, as it has been rated well. Thank You, Innova, in CA. It was an End-of-Year Gift from my wife. Thanks to Her Too! (Also, was Packed very Well and Arrived Promptly. Thank You.)",
      "rating": 5.0,
      "verified": true,
      "author": "m.f.",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Read SRS Codes on my 2007 Silverado 1500 Classic",
      "text": "Got the dreaded \"Service Airbag\" message and warning light. Dealer wanted $100.00 just to read the code. Plugged this baby in and within a minute had identified the problem (Front Impact Sensor - Driver's Side, apparently a common problem on the 1999-2007 models). Picked up the part locally - for half what the dealer wanted for OEM part at the counter - and had it fixed in less than an hour. Total cost for scanner plus part was far less than the dealer quoted to do the work so I essentially got the scanner for free.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave K.",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "Dissatisfied customer... try a better scan tool",
      "text": "Does not work well Says no communication almost every time I have tried to use it Also does not work with 2008 mercedes s550",
      "rating": 1.0,
      "verified": true,
      "author": "Neil E Totman",
      "helpful_votes": 5,
      "publication_date": 20180604
    },
    {
      "title": "Paid for itself after one use",
      "text": "I have a problematic daily driver and I was fed up with going to a shop to have CEL light reset. This tool combined with a Chilton manual helped me get my vehicle's gremlins sorted out. I've used the ECM and ABS ECM functions and they're both easy to get to and get the codes. Some of the other functions take a little getting used to and to navigate around. Overall I like this scanner and I would definitely buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "vintagetruckguy",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "A quality product!",
      "text": "Quality at a reasonable price. Works on all 5 of my vehicles. Would of appreciated an enclosed manual, but the seller made it known that I had to download the PDF, which was OK with me. I have already recommended it to 4 different friends. I really appreciated the fact that the ad had a PDF available to review which years/models this unit would work with. Thanks for provided a good product at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike on the 45th Parallel in northern Michigan",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Okay for the price",
      "text": "I bought it to read and reset a trouble code on a 2010 Ford Fusion. It does not reset the \"change oil soon\" message as it is supposed to and I don't quite understand why after the repair was made and the \"check engine\" light is out that trouble code come up as \"PERMANENT\" and can't be erased no matter how many times I pressed the erase button. In short I would say if I were a professional mechanic I would buy a better model.",
      "rating": 3.0,
      "verified": true,
      "author": "GaryD",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Works great.",
      "text": "I had an old version of the 3100 and all it did was give codes, no ABS, and hard to get it to hook up. Was reluctant to get an upgrade, but decided to give it a try since I was having ABS light on. The same day I got it I read my code and it told me the front left wheel sensor was bad....no just a code number. I took it to my son's house to look at a problem he was having and again it specified the exact problem...not just throwing the error code for me to have to find online. One day and two correct diagnosis. I'm happy I upgraded to the 3100J....night and day difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Ztex",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Great Diagnostic Tool",
      "text": "I purchased a Innova 3100j about a month ago! Because I keep having the check engine light come on a 2001 Camry hooked up the 3100j it diagnosed the problem I replace that part the car has been running much better with no check engine light! Very Satisfied with diagnostic tool it allows me to reset the fault code, it diagnosed all faults not only on that car but a couple of other older family cars! Easy to use and straight forward.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Wanna know what's bugging your ride?",
      "text": "I was at a dealer repair shop for a recall service and mentioned that my \"check-engine\" light was on. The service writer said he could run a \"complete\" test of the system for $400 bucks! WHAT ? Seriously, you must think I'm a real rich idiot.... This little beauty will keep you out of the poor-house. Awesome to help friends with the same issues.",
      "rating": 5.0,
      "verified": true,
      "author": "GreenHead",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Nice Scanner",
      "text": "Great scanner pays for its self, let's me get repairs done faster..only complaint is the display sticker they put the screen didn't come off easy, rips off in pieces and leaves behind residue,if not careful you will scratch the screen. Note:Bought a cheap hard-shell firearm/pistol case to store it in & protect it from future damage.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Saves Money $$$$",
      "text": "I have 2007 Impala at almost 200k miles. This device has probably already saved me $500 in diagnostic fees. It's totally worth it if you have an older car that needs constant love, or if you just like to fiddle with cars.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Very good deal to get the job done",
      "text": "The only con this has is a slightly clunky menu system and non labeled buttons. You just have to trial and error your way through. But it works perfectly and is plenty fast for doing what it says it does. Just verify on the company site that what you plan to use it with is compatible.",
      "rating": 4.0,
      "verified": true,
      "author": "CigarObsession",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Works well and has a lot of nice features.",
      "text": "Needed a code reader that read airbag and ABS lights. Works great and definitely a great value buy (go for this version instead of the newest).",
      "rating": 5.0,
      "verified": true,
      "author": "Levi",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Wouldn’t shake a stick at it.",
      "text": "Worth it if for nothing else except to know when the garage might be giving you the runaround. Worth it also for knowing if you need to get your vehicle to a garage right away or if it might be able to wait till you have time and money to address.",
      "rating": 5.0,
      "verified": true,
      "author": "A.W.",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Doesnt work as stated",
      "text": "looked on multiple places on their site and amazon where it says that is was complaint with my vehicle. does not work for 2 out of the three features i bought it for. only can read obdII no srs or abs. could have spent 20 bucks on a cheapo and gotten the same results. nice display, its a shame the info on the shiny screen is useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Redbird",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Good Product but Not User Friendly",
      "text": "This unit is not very user friendly. The manual that came with it is not well written to follow instructions. This is my first OBD and cannot compare it with another. I use a computer and handy with electronics, sorry my opinion on this one is not positive.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Great OBD diag tool",
      "text": "Bought this to replace my very old OBD reader. Used on my 2005 Escalade, 2012 Acura and 2009 Toyota. Great little tool to diag your own car without having to pay someone else to read your codes. Highly recommended!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Sullivan",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Not what I was expecting",
      "text": "I was replacing a cheap monitor that gave me real time graphs of running perimeters. The basic use for such a unit in my book. Innova has lots of monitors and a pay program to get what I had in my manual. None of which I needed. The guide book is over 100 pages. I had to scour the web site to find it. No information at all in the packaging. I'll be returning the unit.",
      "rating": 1.0,
      "verified": true,
      "author": "John Jaruzel",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Does the same job as scares half the price",
      "text": "Does the same job as scanners half the price. Every time i try to use the advance features like abs system it says my cars aren't compatible",
      "rating": 3.0,
      "verified": true,
      "author": "Roberto Flores",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Awesome price for a name brand reader with ABS and ...",
      "text": "Awesome price for a name brand reader with ABS and SRS. Was able to clear my ABS light after replacing blown seat belt tensioners. The manual is online, but figured it out just experimenting with it a bit. A good purchase and good upgrade from my 5-year old reader.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark H. Cloutier",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "WORKS GREAT..,.",
      "text": "Used it to diagnose my van and my nieces car... Works great.... My neighbors are now coming to ask me about it..... Greatest thing I got so far...",
      "rating": 5.0,
      "verified": true,
      "author": "Darryl Walker",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Worth the $",
      "text": "Product arrived on time, exactly as described. Pulled codes on my 2002 saturn sl. Pulled both cel codes and abs codes, i wish it came with a hard case but other than that its a great code reader. It is by no means the cheapest code reader but it is a great one, worth the extra few dollars, i will update if any issues in future",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Garage Mechanic",
      "text": "I work on all my own stuff and if it's something I can do, I'll do a friend's car. This OBDII scanner has everything I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Great scanner for a DIY'er",
      "text": "Great scanner for a DIY'er!!! Item arrived quickly and worked as described! My only suggestion is to make sure you go to Innova's website to check device compatibility with your vehicle(s) before purchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim A.",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Very easy to use.",
      "text": "While I have used this on just vehicle, it found several codes, was easy to use. Most importantly it deleted an abs code which some code readers cannot do.",
      "rating": 5.0,
      "verified": true,
      "author": "miketex1",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Worked well",
      "text": "Feels cheap compared to my older Innova but I needed one to do the SRS on a 2002 honda accord. It worked perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "rustycorvair",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "The online web site is great and walks you through the repair",
      "text": "Having a 2007 Acura and a 1999 F150 this tool is a must. The online web site is great and walks you through the repair. If you save just one hour of labor at a dealer it will pay for itself. I could have saved $1000.00 in dealer labor if I would have purchased this a year ago. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "jimmy ricks",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "poor product",
      "text": "This programmer claims it could clear codes for my 06 grand prix. It would only read the codes could not clear them and it did not come with the batteries or the usb cable to connect to a PC upgrade the firmware. I returned the scanner.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Maxwell",
      "helpful_votes": 2,
      "publication_date": 20181214
    },
    {
      "title": "This is the scan tool to get!",
      "text": "Excellent tool! Easy to use. Best thing I love about it is you can clear any codes, drive with it plugged in and know exactly when the drive cycle is completed (you go from yellow light to either green light, which means your vehicle is ready to pass the emissions test or red light which means you still have work to do). If it remains yellow, keep driving.... My 1997 Ranger took about 5 miles of freeway diving, 5 miles of surface road driving and about a mile of neighborhood driving before it went to green.",
      "rating": 5.0,
      "verified": true,
      "author": "William Doak",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Easy to use",
      "text": "Best one I have found yet. Easy to understand. Worked great on an 07 Silverado and 04 Grand Am. Read ABS faults with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "WILLIAM",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Reads abs on kia!!",
      "text": "I got this for my 2011 Kia sorento v6 and this help my find what abs sensor was bad.. I have a bluedriver which I love but would not read Kia abs",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan lincecum",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Firmware update Bricked the device (See Photo). Must admit ...",
      "text": "Firmware update Bricked the device (See Photo). Must admit I was surprised, really thought this was a quality product. Gave it 2 Stars because it worked prior to the firmware update. Will return and try something different, Jim",
      "rating": 2.0,
      "verified": true,
      "author": "J Hess",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Great price",
      "text": "This did all the things I wanted in a new machine. My old one didn't do new brake systems for analysis so it was time for an upgrade. Did it all for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Oly",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "easy to use",
      "text": "OBDII, ABS & SRS all have worked well on multiple cars I own. Even ran a battery test on my Deville and it told me the charging system was working, but my battery was bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe M",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "worked for what I wanted it for..",
      "text": "2004 hyundai santa FE 3.5L threw SRS code. WAs able to read and turn off light. Dealership wanted as much as this reader just to check the code.",
      "rating": 5.0,
      "verified": true,
      "author": "Someone",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Fair deal",
      "text": "Easy to use. Decent price. It covers several vehicles but it’s not “The one” for your shop",
      "rating": 4.0,
      "verified": true,
      "author": "Isaac",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "This tool is a little slow with the response time ...",
      "text": "This tool is a little slow with the response time during operation. It lags a little when you are going though the menus. Overall its a decent reader but I would probably go with a cheaper Innova for someone looking to get one.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon P",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Will read abs codes",
      "text": "It does as it should. And will clear abs and brake codes. I had to upgrade from my cheap one since it wouldn't do abs. Def worth it. Just dont tell your friends unless you dont mind reading everyone's codes",
      "rating": 5.0,
      "verified": true,
      "author": "Kilton",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Highly Recommend",
      "text": "Great little scanner. Worked perfectly on my 2003 Lexus IS300. Also used the battery tester on a 2001 Town and Country (Worked). Erased a speed sensor code on my friend's 2011 Tacoma. Erased a code on Scion Xb as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ferdanko",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "exactly what I needed",
      "text": "I needed to clear and fix my air bag sensor and this helped me find the srs code. Also helped me clear all the codes including srs.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Toyota Compatible",
      "text": "Works great with my 2007 Toyota RAV4 even though Amazon says it's not compatible. I had and SRS light on and it showed me DTC B1801, which with a little Google search lead me to a couple videos and an $11 replacement clock spring which solved the problem.",
      "rating": 5.0,
      "verified": true,
      "author": "James Madison",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Cheaper than going to the dealership to read airbag codes",
      "text": "Not all that intuitive but a bit of banging around on the buttons will get you were you need to be. I probably could have downloaded the manual but who has time for that...",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Pasteris",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Simple to use",
      "text": "Simple to use. Next one I get will have the live view of numbers. This one only saves stats when code is thrown (such as fuel info, temp, ect.).",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "A LITTLE SLOW BUT GETS THE JOB DONE EVERY TIME",
      "text": "A LITTLE SLOW BOOTING UP BUT SAVES TIME GUESSING WHAT THE NUMBER OF EACH CODE MEANS SO IT MAKES UP FOR ITSELF IN THAT MANNER. PRICE IS GREAT ALSO",
      "rating": 4.0,
      "verified": true,
      "author": "TERRENCE THOMPSON",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Works like I wanted",
      "text": "Been looking for a good scanner for the price and this fits the bill. Only wish it came with user manual, had to download from website.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Jacobson",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Easy to use",
      "text": "Easy to use. Quickly cleared a spurious airbag light that had to be cleared after fixing a faulty connection on the passenger side seatbelt tensioner.",
      "rating": 5.0,
      "verified": true,
      "author": "gjones",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "great tool",
      "text": "the first time I used the tool, I was able to reset my engine service light without any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "randyl",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "No matter what I tried I just could not get ...",
      "text": "No matter what I tried I just could not get it to sync or register with my computers. Most reviews I had read were very positive. I likely had a unit that failed to make the grade.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Great tech tool",
      "text": "Purchased for my father a mechanic and he said it’s the reader out there for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Fleming",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Good for KIA Sorento esp, abs,",
      "text": "Great. I deleted my esp, abs warnings on KIA Sorento 2014",
      "rating": 5.0,
      "verified": true,
      "author": "DM/DC",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "1 of the best",
      "text": "1 of the best on the market however they add a decal over the display which leaves a gummy residue",
      "rating": 3.0,
      "verified": true,
      "author": "AA1PR",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Make sure this unit is compatible with your vehicle",
      "text": "We will see how compatible this thing is with other vehicles I’ve only tried it on my Nissan product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Great product",
      "text": "Easy directions to follow. Great product to have for the DIYer.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Rios",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Reader works well.",
      "text": "It would be nice if it came with a carrying case and a manual, but the reader works like a charm. I'm very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "drjim",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Connector is illuminated for easy connection. If it came with a manual I ...",
      "text": "No manual but after about 15 minutes you can get the hang of operating. Connector is illuminated for easy connection. If it came with a manual I would have given it 5 stars",
      "rating": 4.0,
      "verified": true,
      "author": "WA3ERQ",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "This worked great to read/erase airbag codes on my 09 Pontiac G6",
      "text": "This worked great to read/erase airbag codes on my 09 Pontiac G6. It even gave me an explanation for the codes. The price was unbelievable for what you get. Would totally buy again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "great",
      "text": "Easy to use. Nice screen. Works with all my cars.",
      "rating": 5.0,
      "verified": true,
      "author": "dave miami",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "2005 GTO and the 3100J",
      "text": "I got this to reset the airbag light on my 2005 GTO. It will not communicate with my ABS or SRS as advertised. I called support, I was told they would look into the issue, a 2 week waiting time. It did communicate with my 2014 F150 SRS and ABS. Engine codes were accessible on the GM product but from all the reviews and my experience I think the 3100J has issues with GM SRS and ABS codes.",
      "rating": 2.0,
      "verified": true,
      "author": "mark76127",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "will not stay connected to dtc",
      "text": "connector for dtc will not say connected , have tried on 2 cars but will read ether of them waste of money!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Liz W.",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "this will save you alot",
      "text": "i purchase a car from private person and scan the car and i found out they reset the light on the car and also there was no info available because of the reset this was indication of trouble",
      "rating": 5.0,
      "verified": true,
      "author": "DLAMORA",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "A must have item.",
      "text": "Reads well, a good quality, and delivered as promised. Can't do much better than that!",
      "rating": 5.0,
      "verified": true,
      "author": "william&Tammie",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "the stiker on the screen, BAD idea!!!",
      "text": "The sticker on the screen, the glue was so strong the screen scratched removing it with my finger nail! I am VERY disappointed with this product, I haven't even used it and it is already damaged!!! Very unhappy!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Steven Fraser",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Didn't work completely as advertised.",
      "text": "Tells me the errors in the PCM on my Jeep, but doesn't clear all of them.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "need better info and instruction",
      "text": "need better info and instruction, work fine on 2017 Subaru Forester, 2005 mazda6 , 2007 Toyota Camry but erratic on 99 Isuzu Trooper.",
      "rating": 3.0,
      "verified": true,
      "author": "Vic_PDX",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Doesnt include live data",
      "text": "For the price it should have come with live data",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy G.",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "About the innova 3100j it worked fine finding the issues on abs",
      "text": "Ill give a 4 starts due to the fast shipping which arrived 1 day prior as expected. About the innova 3100j it worked fine finding the issues on abs, srs and engine light but the reset option worked only for the engine light. When you try to reset abs, oil light or srs it will show \"successfully deleted\" but lights wont come off.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Item is not working",
      "text": "This item does not work correctly when I hope to wire up only one sigh of the light is getting connection not working 100% need to send back and you need to send me a new 1 thank you how do I go about doing that?",
      "rating": 1.0,
      "verified": true,
      "author": "Paxton Williams",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "SHOWS THE AIR BAG SYSTEM PROBLEM",
      "text": "Shows the problem for the air bag system and can reset, research can be done by the diagnoses.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Not usable",
      "text": "Good luck using it with a cheap sticker that can’t be removed",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 2,
      "publication_date": 20181013
    },
    {
      "title": "Its ok",
      "text": "It can pull up codes clear them. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "charles phillips",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Pro grade at Discount price..",
      "text": "Very stable nice display and many features Im am satisfied with the quality and price was awsome...",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Great little scanner",
      "text": "Bought it to diagnose a bad speed sensor on my Jeep. Told me on the screen my problem and even which sensor needed replacing. Cheaper than taking it to the dealership. Didn't work on a VW though.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve L.",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Scanner is good but online software is horrible",
      "text": "5 stars to the scanner and -5 to the software. Read ABS codes in 2011 MDX no problem. It was a $15 fix. Already paid for itself.",
      "rating": 4.0,
      "verified": true,
      "author": "VBSA",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Paid for itself in one week.",
      "text": "Alot in a little tool. Had it just a couple weeks and fixed 3 vehicles already. Saved hundreds of dollars already.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Do Not Buy",
      "text": "Item is junk advertises can work for SRS systems and ABS systems and did not work. Called customer support and got no where other than laying over $200 for a paperweight",
      "rating": 1.0,
      "verified": true,
      "author": "Jared Christensen",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Car guys will love this unit!",
      "text": "Very good unit with many very useful features. I would buy it again any time.",
      "rating": 5.0,
      "verified": true,
      "author": "Forest Dweller",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "used it and it works great, at first watching the video was a big ...",
      "text": "used it and it works great, at first watching the video was a big help on youtube , at 69 I'm a little slow at using it but it sure is a big help finding and solving problems.",
      "rating": 5.0,
      "verified": true,
      "author": "kenneth w. little",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Work like a pro, easy to use",
      "text": "Used it with Highlander to clear my ABS issue and worked absolutely fine. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "kashif Rasheed",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Important tool to have.",
      "text": "I love it. It actually tells you more about your vehicle then what the description says.",
      "rating": 5.0,
      "verified": true,
      "author": "Dominic Jason Jenkins Jr",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "America Only",
      "text": "This might be a good product, but don't buy it if you are outside the USA. It is only good for vehicles available in America.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170801
    },
    {
      "title": "USB cord",
      "text": "I received it quickly and it works great but I did not received the USB Cord to upload the data on my computer and I am not sure who to contact to get this sent to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Not worth it",
      "text": "Innocas website says this model 3100j will work on 2005 honda crv to clear oil change reset light. It does not work and cannot clear the reset light. Really regretting buying this.",
      "rating": 2.0,
      "verified": true,
      "author": "Dino Palangic",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Very handy tool, I really like it alot.",
      "text": "Saves lots of money when you can diagnose CEL Light yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "greggler",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Five Stars",
      "text": "Great for running codes, read around 20 and translated to easy repairs and saves huge dollars!!",
      "rating": 5.0,
      "verified": true,
      "author": "bigtuna189",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Three Stars",
      "text": "Sent it back for the 3160g due to REAL TIME DATA ACQUISITION!",
      "rating": 3.0,
      "verified": true,
      "author": "JLW",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Five Stars",
      "text": "great replacement for my older malfunctioning one..works great with quick readout..",
      "rating": 5.0,
      "verified": true,
      "author": "D .T. Russell",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Good Product",
      "text": "I posted earlier about a screen issue and residue, i feel dumb, it has a thin film on it that you have to remove. Plug it in and works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam David",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Poor Product. Buy something else.",
      "text": "It did NOT work. I called Tech Support, they said it's defective. So.........just send it back.......I'm supposed to pay the shipping. Also, the manual is online....all 105 pages of it.... So I guess they think you should have a laptop in the vehicle or printout 105 pages. Good marketing. Not good product. I'll be interested to see if I am contacted by the manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Fla",
      "helpful_votes": 4,
      "publication_date": 20170825
    },
    {
      "title": "Worked for me",
      "text": "I called their tech support number to make sure it would read the SRS and ABS codes on my 2012 GMC Sierra. Tech support person was knowledgeable and helpful. Received the scanner, put the batteries in, and connected it to my truck. Read my SRS code, fixed the wiring on the truck, and used the tool to clear the code. No more problem. Worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "ElkHuntingDad",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Nice entry level product",
      "text": "So far so good, I am not able to read the ABS code on my GMC though.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Five Stars",
      "text": "this reader works wonderful saves money for the automotive enthusiast. Good investment",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180707
    }
  ],
  "product_meta": {
    "title": "Innova 3100j OBD2 Scanner / Car Code Reader with ABS, SRS, and Service Light Reset",
    "description": "The all-new 3100j is the perfect entry-level tool designed to empower any consumer or technician when it comes to vehicle maintenance and repair. This code reader works on all 1996 and newer OBD2 cars, light trucks, SUV's, hybrids, and minivans. Refer page 34 in the user manual for troubleshooting steps.Don't remove the advertising sticker but rather the protective film covering the entire facing of the tool.",
    "rating": 4.4,
    "feature_bullets": [
      "Quickly reveal the cause of \"Check Engine\" light warnings on any 1996 and newer OBD2 car, light truck, SUV and hybrids",
      "Read and erase ABS & SRS light trouble codes on most OBD2 vehicles",
      "Battery & alternator tests check the performance of a vehicle's charging system",
      "Oil Reset feature provides step-by-step reset procedures for most 1996 and newer OBD2 vehicles",
      "Freeze Frame shows engine conditions such as fuel trim, engine coolant temp, etc., at the time the Malfunction Indicator Lamp turned on. The 3100j will save the last 3 vehicles scanned.Also, the 3100j does not have Live data or bi-directional functions",
      "Note:Please refer to the user manual before use,Refer page 34 in the user manual for troubleshooting steps"
    ],
    "specifications": {
      "Manufacturer": "Innova",
      "Brand": "Innova",
      "Model": "3100",
      "Item Weight": "8 ounces",
      "Product Dimensions": "10 x 8 x 1.5 inches",
      "Item model number": "3100",
      "Batteries": "3 AA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "3100",
      "Cover Included": "CanOBD2 Code Reader w/ABS",
      "ASIN": "B01MR7FZS1",
      "Customer Reviews": "4.4 out of 5 stars533 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#40,505 in Automotive",
      "Date First Available": "January 18, 2017"
    },
    "categories": [
      "Code Readers & Scan Tools",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Diagnostic, Test & Measurement Tools",
      "Automotive"
    ],
    "price": ""
  }
}