{
  "website_summaries": [
    {
      "verdict": "Built strong for outdoor use and features accurate reporting of available power.",
      "pros": [
        "Waterproof and heat-resistant",
        "Described as handy and useful",
        "Works especially well in cars and boats, providing protected charging capabilities",
        "Features two ports"
      ],
      "cons": [
        "USB port has been known to suddenly fail"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good addition to an old boat.",
      "text": "I wanted to monitor battery voltage to insure the charging system is working and this device does the job. If you need more accurate reading use a good volt meter. The two charging ports turned out to be a must have because dead cell phone are major problem for the grand kids. The hardest part in the installation was finding a 1 1/8\" drill bit. Durability is to be determined, in use only two months.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle  Berghuis",
      "helpful_votes": 9,
      "publication_date": 20190812
    },
    {
      "title": "Great item",
      "text": "Fits like a glove. I was a bit hesitant with this item, but I still went ahead and bought it. This fits perfectly well as replacement of the cigarette lighter outlet. I installed it on my 1998 Olds cutlass. The volt meter was a bonus, not sure if it reads accurately as a multimeter,but it will give you a ball park of how much voltage you have under load or idle. The voltage read out can be seen even with the lid closed.",
      "rating": 5.0,
      "verified": true,
      "author": "kwiksilber",
      "helpful_votes": 17,
      "publication_date": 20170817
    },
    {
      "title": "Works great.",
      "text": "I used this to replace the 12v cig lighter accessory in my Honda Pilot. It has been way more useful than the other outlet and now I can charge 2 phones at once. It is also a cool addition to see the voltage as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott B",
      "helpful_votes": 13,
      "publication_date": 20180611
    },
    {
      "title": "That was unexpected and very cool to find out",
      "text": "This power outlet port has a sleek look when closed. The voltage meter is accurate on mine down to the tenth of a volt. When I'm charging the battery with a known accurate charger the display of both show the same to a couple hundreths of a volt. When powered the voltage display will show through the port cover that is a translucent smoke color. That was unexpected and very cool to find out. My phone charges at 1600ma when at 30% charge according to a battery app. That is about the same as my wall power supply. Very pleased for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "That guy",
      "helpful_votes": 17,
      "publication_date": 20170423
    },
    {
      "title": "Easy way to add cell phone charging outlets in RV",
      "text": "Handy product. Installed in my RV below the kitchen counter to make it easy to charge cell phones at night. Voltage readout is a bonus-- more precise battery level than the normal \"4 lights\" on the RV control panel.",
      "rating": 5.0,
      "verified": true,
      "author": "C. J. RHEA",
      "helpful_votes": 16,
      "publication_date": 20171127
    },
    {
      "title": "Nice unit for my camper",
      "text": "Compact, easy installation, accurate. I needed a dual usb that would run on 12V when I could not run my generator at night on my camper. This unit wired in to my power panel on a spare circuit. Seems to work great. Hoping it lasts!",
      "rating": 5.0,
      "verified": true,
      "author": "zart1953",
      "helpful_votes": 9,
      "publication_date": 20190429
    },
    {
      "title": "Charges phones fast",
      "text": "I installed this in my 2004 Silverado 1500. It was easy to install. Took less than 10 minutes. I use this mainly for charging my Galaxy Note 8. It charges my phone very quickly. Both ports are 2.1 amps. So it doesn't matter which one you use. Both will charge quickly. I installed mine on battery power and the display is on all the time. No issues with battery drain. I went on vacation for 6 days and when I got home my truck started up easily. Great product. I highly recommend everyone get one.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph S.",
      "helpful_votes": 12,
      "publication_date": 20180621
    },
    {
      "title": "Works like it's supposed to",
      "text": "Have been using this for a couple weeks now. Install was simple. Works great. Accurate voltage within +/-0.5v",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Brothers",
      "helpful_votes": 14,
      "publication_date": 20180419
    },
    {
      "title": "Nice.",
      "text": "This seems to work fine, the USB connectors are snug, install was easy. I have it wired hot 24/7, and have watched the battery voltage over a week go from 12.7 to 12.5 with just the voltage readout on and no M/C use, so very little current draw and not necessarily a problem if hot 24/7. Of course, better if switched.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Seigo",
      "helpful_votes": 7,
      "publication_date": 20170801
    },
    {
      "title": "Works great! I mounted this on the side of my ...",
      "text": "Works great! I mounted this on the side of my bug out trailer so I could monitor the condition of the batteries in my solar setup. It's also nice to have 2 quick charging usb ports handy outside the trailer as well. It's hard to see in the last photo but when the cover is installed you can still see the voltage thru a clear window on the cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Culpepper",
      "helpful_votes": 5,
      "publication_date": 20170725
    },
    {
      "title": "Survived the elements on my boat",
      "text": "I put this on my small aluminum boat so that I could charge my phone and portable bluetooth speaker. It has survived dozens of trips to sea and still works like new.",
      "rating": 5.0,
      "verified": true,
      "author": "rkm",
      "helpful_votes": 3,
      "publication_date": 20190706
    },
    {
      "title": "Seems decent",
      "text": "I wanted a volt meter in my side by side. I looked at a few different options and this one appealed to me the most. Having more that one purpose in a side by side is nice packs more in less space. The cover is nice as I know its going to be exposed to some harsh conditions. Hope it holds up. Voltmeter seems to function properly I actually haven't tested the USB yet. I plan to update this after some use.",
      "rating": 4.0,
      "verified": true,
      "author": "N6WOLF",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Worked for Only Three Kayak Trips",
      "text": "I kayak fish and I purchased this item to measure the voltage on my fish finder battery and to charge my phone via the USB socket. Things started off well for the first two trips. After the third trip I noticed that the voltage readout no longer worked. I checked the USB port and it no longer charged my phone. I pulled the fuse but it looks good. I hooked up the device directly to the battery and it still doesn't work. The same battery runs my fish finder and shows a voltage readout of 12.4v. Did I get a lemon?",
      "rating": 2.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Simplest Electronic did not work",
      "text": "I ordered this in preparation for a boat rebuild, as all know rebuilds come with many challenges and delays. I am now rewiring and low and behold the simplest item does not seem to work. I have power to it, I have a 5 amp fuse in between this item and the main power supply line. When I connect my tester to the prongs it does read voltage of the boat battery (12.3) but no readout and when I plug into the usb ports with a cell phone I have nothing. Doubt it is returnable now and it has been 8 months sitting on my shelf.",
      "rating": 1.0,
      "verified": true,
      "author": "R G C",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "This is exactly what I need for our RZR, ...",
      "text": "This is exactly what I need for our RZR, keep the phones charged up and keep tabs on the system voltage at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "aguy",
      "helpful_votes": 6,
      "publication_date": 20170104
    },
    {
      "title": "USB ports died after a month.",
      "text": "Died after two months of use. The voltage readout is still good but the usb ports no longer work. Bummer. I will be replacing it with the same style but one without the voltage readout- that led display is very bright and bothers my eyes when driving at night.",
      "rating": 1.0,
      "verified": true,
      "author": "STEMaphile",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "No instructions. Poor packaging. Fitting issues",
      "text": "Packaging looks like it came from a rummage sale! If removing and older “lighter plug” you may have to refit the opening slightly. It’s not a big deal to do; super easy with a stepper drill bit, or you could use a round file. Don’t expect to read that in the instructions... you would have had to bought “the premium” charger that have come with poorly translated English to have received that. :-)",
      "rating": 3.0,
      "verified": true,
      "author": "Jerry ",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Unusable",
      "text": "I wanted to love this product. It had such good reviews, however on close inspection I can clearly see that the insides are mis-aligned with the port opening and that the USB device would not plug into it. I would need to get a sharp object in there to try and \"force bend\" it to the correct alignment which I'm not keen to do. Not a good start. I'm returning this and getting the other one I had ear-marked which turns out to be less expensive in any case (and recommended by Amazon).",
      "rating": 2.0,
      "verified": true,
      "author": "Richard O.",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Nice if it worked longer than 2 months",
      "text": "Worked nice for 2 months then stopped working. Volt meter is nice feature and seems usb ports were working fine. After 2 months the whole thing just stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "Oahu 911",
      "helpful_votes": 2,
      "publication_date": 20180216
    },
    {
      "title": "Very easy extra charger USB install !",
      "text": "Product speaks for itself... easy to mount solidly, I like the round nut system since it ties better then regular inserts, more durable that way. Then connect two wires and there you go you have a double USB charger..",
      "rating": 5.0,
      "verified": true,
      "author": "Hugo R.",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Works great",
      "text": "Put this socket charger in my pontoon boat , works great . Charges two iPhones quickly and voltage meter is a nice feature. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron  L.",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Accurate voltage reading",
      "text": "Nice to have voltage readout and can be read through the lid. I checked it with a good volt meter and the reading was accurate to the 0.1V place. I installed this in my RV so I could monitor the battery when not plugged in to AC. Charges my phone fast (Galaxy S6).",
      "rating": 5.0,
      "verified": true,
      "author": "D. Chuck  Dunbar",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "As advertised",
      "text": "Seems like it is well made. Digital display is bright and clear. USB charging ports worked great. Easy install in a 2019 Maverick X3.",
      "rating": 5.0,
      "verified": true,
      "author": "Slofts",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Use other connectors, awesome otherwise",
      "text": "This is awesome and so simple to install. Pull the fuse for your cigarette lighter, cut the 2 wires, connect and be done with it Only problem is the crimp clips or whatever you call them aren’t the beat quality so I would recommend using other ones",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Mendola",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Perfect replacement for cig lighter",
      "text": "With everything having USB connections, this device makes upgrading your charging port options simple. This is the second one I have bought and replaced cig outlets on my motorcycle and P/U truck. Makes life connected so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Works good, wish it was brighter",
      "text": "Works good but I wish it was a little brighter or the cover was lighter (it is a pretty dark charcoal color) to be able to see it on a sunny day.",
      "rating": 3.0,
      "verified": true,
      "author": "barbedwireart",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "So versatile",
      "text": "This is the 3rd one that I’ve bought for various projects. This one went in my boat for additional charging.",
      "rating": 5.0,
      "verified": true,
      "author": "G J M",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "The flat water/dust caps",
      "text": "The cover caps dry out and break off within a few months. Cheap plastic poor quality and construction. Now water and dust will get into the USB charger plugs. Have it on my Quad runner. They need to sell just the caps just for replacement. Do they? Wont buy again!",
      "rating": 1.0,
      "verified": true,
      "author": "Dissatisfied consumer",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Only one of the USB outlets functions.",
      "text": "Purchased this product and installed it in my car. Only one of the two USB outlets works. I do not see a place to contact the seller about this other than to return the item. I'll be returning the item once I get it out of my car. Test before you install.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris Osborne",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Marine Dual Port Charging Station",
      "text": "I like this dual charging port, for my phone & guests. I'm not impressed with the digital voltage readout as it's impossible to see if there's any sunshine.",
      "rating": 4.0,
      "verified": true,
      "author": "Herb Mindt",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Oversized",
      "text": "Not the same size as standard cigarette lighter. Found out after it was too late to return.",
      "rating": 3.0,
      "verified": true,
      "author": "Timothy T.",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Cleaned up extra wires in motor coach!",
      "text": "Installed in my motorhome on the passenger side to give access without having wires crossing over to drivers side. Easy to install and works and looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "F. M. Hegler",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Works at 27V",
      "text": "Hooked this up to my system running at 27V. Worked great. Previously ordered a different one which was supposedly good for a 24V system that melted after hookup. This one is quality. Only gripe is that voltage reading is normally slightly high, however when you are charging a phone the voltage reading becomes more correct.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Good Quality",
      "text": "Nice quality plastic, but a bit larger circumference than a standard cigarette lighter outlet so I had to ream out the hole from the old power outlet.",
      "rating": 4.0,
      "verified": true,
      "author": "Pleased or Not",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Exactly what I needed!",
      "text": "Replaced a 12volt outlet on my motorcycle and the need for an additional usb charger that kept vibrating out of the socket. This fit the same hole, the same wiring, and works and looks beautiful!",
      "rating": 5.0,
      "verified": true,
      "author": "Justin_R_Davis",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Buy With Confidence",
      "text": "Purchased for my ice fishing battery box and works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great value. I love the voltage readout.",
      "text": "I installed this on my 1990 Carver so I can use my phone for navigation. The diameter of the charge was NOT the same as the cigarette lighter I replaced, which came as a surprise. Perhaps newer vehicles and boats have a different size lighter ...? Also important, know that the wiring is polarized, so it wont function if you have it wired backward. All in all, great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas P.",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Works great!",
      "text": "Used this in my boat to charge my phone and monitor my accessory battery!",
      "rating": 5.0,
      "verified": true,
      "author": "BassGuy",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Works great. I replaced my 12V cigarette lighter in an ...",
      "text": "Works great. I replaced my 12V cigarette lighter in an older car and now have two useful USB slots. The voltmeter is nice as the car sits at times and this allows me to easily see if the battery needs charging or not.",
      "rating": 5.0,
      "verified": true,
      "author": "Bipolarbear",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "One Star",
      "text": "Does not put out advertised amperage. Will not charge my phone",
      "rating": 1.0,
      "verified": true,
      "author": "Tooez2",
      "helpful_votes": 2,
      "publication_date": 20170521
    },
    {
      "title": "Does exactly what it is supposed to. GREAT PRODUCT!",
      "text": "Installed on an older motorcycle I'm converting to an adventure bike, charges my phone fast and voltmeter seems accurate. Also like how you can keep the dust cover closed and see the voltmeter. Very smart design. Would definitely buy again for a future project!",
      "rating": 5.0,
      "verified": true,
      "author": "Cory",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Love this upgrade",
      "text": "This is amazing and easy to fit! Used 2 t-taps to connect to the cigarette lighter positive and negative, works like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Great product and easy to install.",
      "text": "This is a great product. It easily installed in a 2012 MB c250 and in a 2004 Nissan Titan.",
      "rating": 5.0,
      "verified": true,
      "author": "Raoul H Potier",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Nice product... but it’s 2.1 and 1.0 port",
      "text": "Its a great quality product... use a good quality plastic, easy to install, responsable seller, the only bad thing is that the product claim tu be 2.1 amp in both sides but the truth is that one it’s 1.0 the other one it’s 2.1 ... but everything else it’s great I’m very satisfied whit the produc and do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "George R.",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Requires removal of Cigarette Lighter Assembly",
      "text": "Not a plug-in for existing cigarette lighter. Not obvious from Amazon write up that installation requires removal of entire factory-installed cigarette lighter assembly. Depending on your auto, this could require a lot of work/time.",
      "rating": 1.0,
      "verified": true,
      "author": "VS",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Five Stars",
      "text": "Installed this in my truck where the cigarette lighter used to be. Works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve M.",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Great product. will work for my needs",
      "text": "Great product. will work for my needs switching for cigarette lighter adapter to just USB connections.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Will destroy your phone!",
      "text": "Killed my phone with too much voltage. Don't be like me and risk a $700 phone with this junk! Thank God I had insurance, but still cost a hundred bucks to replace.",
      "rating": 1.0,
      "verified": true,
      "author": "Big Texas Butters",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Every SxS needs one of these.",
      "text": "Almost too simple to install, two wires. Great way to keep an eye out on voltage, and charge my cell phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Savin yours",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Five Stars",
      "text": "Works as it should. Good to see what the Alternator and Battery are actually putting out.",
      "rating": 5.0,
      "verified": true,
      "author": "Hollis",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Works as advertised",
      "text": "Works good. Replaced my cig lighter. It was a little tight, had to shave off some plastic from OEM bezel but nice snug fit and works good. Lights up well but not overwhelming. Good to go",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "NOT WHAT THEY CLAIM",
      "text": "JUNK !! Quit working in less than 2 weeks.....first voltage light flickers then quit but usb was working then a couple days later it quit also ....NOT WHAT THEY CLAIM IT TO BE!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "wingnit",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "hooked it up, and it burned out the second ...",
      "text": "hooked it up, and it burned out the second time I cranked my truck. not durable. not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas Hunter",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Not durable",
      "text": "Shows voltage. The third time I used it, it stopped charging on the upper port. The lower port shows charging but it takes forever to increase 1%.",
      "rating": 1.0,
      "verified": true,
      "author": "Raul Pou",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Great",
      "text": "Works great. Now I can keep my devices charged while I'm out on my boat.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy b.",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Good quality",
      "text": "Nice little item it comes in handy on the Golf Cart",
      "rating": 5.0,
      "verified": true,
      "author": "David F.",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Good and easy install!",
      "text": "Installed this meter + charger, on my 2014 150cc bike. Looks great and was easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "A excellent product",
      "text": "I'm off this product to put on my boat cuz I had nowhere to charge my cell phones I got home and I found it at my doorstep I put it on within 15 minutes it was installed and working great looks excellent on the boat",
      "rating": 5.0,
      "verified": true,
      "author": "Buggy masters",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "... my experience with this type says all should be good.",
      "text": "Did not install yet my experience with this type says all should be good.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill P.",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Five Stars",
      "text": "Great item! great functionality, and very neat and clean installation.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward C. Fremaux Jr.",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Great lighter replacement.",
      "text": "Don’t know about the durability but always shows the voltage.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane M.",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Five Stars",
      "text": "Beats my broken cigarette lighter for powering up my cell",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Three Stars",
      "text": "Display is hard to read at a distance (3 feet)",
      "rating": 3.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Typical offshore crap. Slow prime shipping",
      "text": "as advertised. Nothing special but functions ok. Typical offshore crap. Slow prime shipping.",
      "rating": 3.0,
      "verified": true,
      "author": "Colleen T.",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Works great!",
      "text": "Works great! I love the voltage meter, so I can see if my battery is dying.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Nice upgrade",
      "text": "Nice upgrade! Almost OEM fit just had to lightly file old OEM spot and then spliced hot and negative wire. Installed into HD Ram Used a multimeter and step down transfer and successfully and accurately measure volts down to 7.28",
      "rating": 5.0,
      "verified": true,
      "author": "Mega Cab",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Four Stars",
      "text": "Need a big hole for this other then that works as advertised",
      "rating": 4.0,
      "verified": true,
      "author": "C. Wirth",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "About what you would expect",
      "text": "Feels a bit cheap but seems to work as advertized didn't check amperage of us.",
      "rating": 4.0,
      "verified": true,
      "author": "Raymond  Jacobs",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Exactly what I wanted",
      "text": "All that I expected. Charged phones very quickly. Looks HiTech. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Perry K.",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Great value USB charger",
      "text": "Wired this to my tractor works well and keeps the battery charge in view!",
      "rating": 5.0,
      "verified": true,
      "author": "WelshRugbyMan",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Its a must have!",
      "text": "I love it! tells me Battery Volts and charges my phone quick. Took about and hour to install but that's Jeeps fault!",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Kesler",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Difficult to read voltage through cover or from more than ...",
      "text": "Difficult to read voltage through cover or from more than a few feet away (with or without cover on). Cover hinges broke after only a couple of months of light use. Neat idea, but needs improvement.",
      "rating": 3.0,
      "verified": true,
      "author": "William E.",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "product stopped working after a week",
      "text": "Installed product worked fine for a week. Just got to the boat and it does not work. Power to the terminals is good. Will not purchase again. FYI am replacing 5 other charging ports.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Z.",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Great outlets!",
      "text": "I have now bought 3 of these (2 orders) for my sailboat. Charges fast, installs easy, and the display keeps you on top of your battery status.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Five Stars",
      "text": "Easy to install, works great to charge my phone and my tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "FiremanSpock",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Five Stars",
      "text": "Nice little device, using on my boat to keep eye on battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Burton",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Yea i can charge things..",
      "text": "Nice product but only works when engine is off. Charger and volt meeter work fine till the bike is started then no meter and no charger.. My Bad.. Had a bad ground wire.. works like described..",
      "rating": 5.0,
      "verified": true,
      "author": "Da Builder",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "I think they are not clear in the product specifications.",
      "text": "This charger takes hours and hours to load. In an hour it only charges 12% of my telephon. I think they are not clear in the product specifications.",
      "rating": 3.0,
      "verified": true,
      "author": "elias",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Great outlet socket",
      "text": "Great outlet socket, perfect fit. Take a few minutes to install and perfect fit with my car. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "shimmy",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "Good value so far",
      "text": "So far it looks promising, well packaged and feels durable",
      "rating": 5.0,
      "verified": true,
      "author": "Blake wheeler",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "1A so a better deal when charging smartphones",
      "text": "Works as intended. Most products have one 2.1 amp charging port and a second 1 amp charging port, this one has both ports 2.1A so a better deal when charging smartphones",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandre Molteno",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Great Socket",
      "text": "The socket works great, I put it in a golf cart. Love to know battery voltage and the two sockets work great",
      "rating": 5.0,
      "verified": true,
      "author": "d&k",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "As advertised",
      "text": "My device knows it's a charger, which is why I got it, doesn't think it's hooked to a computer. Very nifty charge display. Comes with shielded connections. What's not to like.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "but with a die grinder I widened the hole and it went in great and works great",
      "text": "The diameter of this unit was larger than the stock cigarette lighter of my Isuzu flatbed, but with a die grinder I widened the hole and it went in great and works great. I had to make a bracket to mount one in my car.",
      "rating": 5.0,
      "verified": true,
      "author": "spring f. maxfield",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Quick battery reference!!!!!",
      "text": "Great addition to my boat !!! Dual ports for phone charging and volt gauge let's me monitor battery while not running !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay B.Sweatt",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "one pice was used not old.",
      "text": "I bought 2 pices of the product. One is working as promised, the second is used (not new as promised) with soldering marks and the +/- where opposite to the marks.",
      "rating": 3.0,
      "verified": true,
      "author": "yosi",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Charges phone rapidly",
      "text": "Charges my Nexus 5X rapidly on both ports, which is what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Alpine Hans",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "It’s a good price",
      "text": "It’s small And easy to use I use it to charge my phones",
      "rating": 5.0,
      "verified": true,
      "author": "RONALD WHITENER",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Good Quality Product",
      "text": "Received in good condition. Quality is good. Phone charges fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Noble Peter A",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Easy install. I like the digital voltmeter",
      "text": "I have this mounted on the outside of my RV. I hope it really is waterproof. Easy install. I like the digital voltmeter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Awesome product, the digital numbers will not drain your ...",
      "text": "Awesome product, the digital numbers will not drain your battery if your car does not auto shut offs the plug then replacing it and installing this socket. Always remove the fuse when working with live wires.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellz",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Works good and looks good",
      "text": "Works great and looks good too. Easy to install with the included crimp connectors. Used it on a. Luetooth boombox to keep track of the battery voltage",
      "rating": 5.0,
      "verified": true,
      "author": "Spencer Hutton",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "Works",
      "text": "Works as claimed. Use a 7/8 hole saw to cut a clean hole, wire it to turn off with the key.",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Good thing I checked it on a volt meter before ...",
      "text": "Defective and doesn't work. The meter portion doesn't light up and the USB chargers don't work. Good thing I checked it on a volt meter before I tried to install it. Worthless junk",
      "rating": 1.0,
      "verified": true,
      "author": "B Newton",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "One Star",
      "text": "not for ACC socket in car....you must wire it up.",
      "rating": 1.0,
      "verified": true,
      "author": "Board Games Rock",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Incorrect advertisement.....dont buy.",
      "text": "It does not show the voltage as described, don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Blayne Martz",
      "helpful_votes": 2,
      "publication_date": 20170214
    },
    {
      "title": "Cool gadget.",
      "text": "Out of the 2 that I bought, 1 worked great. The second one was .17 of a volt off. In a vehicle, a battery is about 12.7 volts. When I would get in the display would read 12.5. So I bought a new battery. I still had the same issue, so I checked the voltage at the meter and that is when I discovered that the voltage reading was off. The second one is spot on. 50/50 on this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 5,
      "publication_date": 20170810
    },
    {
      "title": "works like a charm. simple, and great build quality.",
      "text": "Works great! It's a nice accessory to have for my boat. Build quality is perfect. I'm hoping the rubbery plastic cover stays intact after being in the sun for a season. I like the fact that I can see the voltage through the plastic cover. A note on boat voltage: I have an older evinrude with an unregulated stator, which at throttle will send extra current through the system. I would not have my iPhone plugged in at faster RPM's. If you have a newer engine, or a rectifier, no problem. I have an inline fuse, but still... older chargeback systems were designed way before modern electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Works well and is easily read in the sunlight",
      "text": "We installed this in an experimental open-cockpit aircraft to replace the existing analog volt meter and give us a place to charge our phones. Works well and is easily read in the sunlight. As of this review, we have used it for about 6 months and both ports are still functioning well!",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus C Baker",
      "helpful_votes": 3,
      "publication_date": 20180615
    },
    {
      "title": "WORKS as advertised!",
      "text": "Installed in our Class A motorhome at the driver's instrument panel. Will use it for charging navigation device, and cell phone. Installation is same as adding a cigarette lighter plug in the panel. Drilled a 1.125 in. diameter hole in ABS plastic panel just above an existing cigar lighter plug and it matches nicely. The voltmeter reads chassis battery voltage which is very helpful to monitor alternator output and voltage regulator. Item has cover that allows reading voltage thru it. Very rarified with product.",
      "rating": 4.0,
      "verified": true,
      "author": "Vinnfizz",
      "helpful_votes": 0,
      "publication_date": 20181013
    }
  ],
  "product_meta": {
    "title": "LiDiVi Quick Charge 3.0 Dual USB Car Charger Socket with Colorful Voltmeter & ON/Off Switch, 12V USB Outlet for Car Marine Boat Motorcycle ATV Bus Truck and More - Black",
    "description": "LiDiVi 2 USB Power Socket Charger, the handy charger features a dual-port(2.1A each) design, which allows for charging two devices at the same time. Quickly charge smartphones, tablets, accessories and more. \n\nWhy you can choose our car charger?\n\nLED Voltage Display\nMonitories the vehicle's battery and electrical system automatically and indicating the car voltage in the screen, you will know the health of battery while driving.\n\nDual USB Fast Charging Technology\nTwo ports output 5V/2.1A, that's enough to charge two iPads simultaneously!\n\nOvercharge Protection\nMeets CE/ROHS certification, charges safely, without risk of overheating or damaging devices. \n\nWaterproof Design\nwith IP66 waterproof grade, allows it do good job on boat! \n\nProduct Features:\n1. Condition: 100% Brand New\n2. Power input: DC 12V-24V\n3. Power output: 5V 2.1A/2.1A\n4. Product Dimension: See image 7\n\nPackage Include:\n1* Dual Ports USB Charger \n2* Blue Terminal \n\nNOTE:\n1. The voltage reading will be visible only by connecting to the battery.\n2. The voltage also can be read when the cover is engaged.\n3. This USB charger socket does not support Qualcomm quick charge.\n\nPlease feel free to contact us via e-mail regarding our products or service. Thanks a lot!",
    "rating": 4.5,
    "feature_bullets": [
      "COLORFUL VOLTAGE DISPLAY – Upgraded version 12V usb outlet with colorful voltmeter, technological appearance, displays the real-time voltage status of your vehicle, let you know the health of battery while driving.",
      "ON/OFF SWITCH – Features a on/off switch which controls the voltmeter and usb ports, save power and prevent the battery being drained when leave unused.",
      "QC3.0 DUAL USB – LiDiVi dual USB charger socket has two 18W / 3A QC3.0 fast charging ports, which is 4x faster than conventional chargers. Backwards compatible with Quick Charge 2.0 & 1.0, suitable for all popular USB devices.C",
      "WIDE APPLICATION - Fits for 12-24V car, boat, marine, motorcycle, ATV, RV etc. This usb socket is suitable for charging iPhone 8/ 8 Plus/ X/ 7/ 6S, Samsung Note 9/ Galaxy S9/ S9+/ S8/ S8+/ S7, iPad, android tablets, power banks, video games controllers, sports watch etc.",
      "SAFETY PROTECTION - Certified by CE & ROHS with Over-charging, Over-current, over-heating and Short Circuit Protection to ensure safety, meanwhile, built-in Smart IC ensures the circuit won't be burnt out if wrong wiring."
    ],
    "specifications": {
      "Product Dimensions": "2.05 x 1.12 x 1.7 inches",
      "Item Weight": "0.8 ounces",
      "ASIN": "B01M0GR0FQ",
      "Item model number": "GSG2016UV-4.2A",
      "Customer Reviews": "4.5 out of 5 stars320 ratings4.5 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "Wireless",
      "Colour": "Blue",
      "Manufacturer": "LiDiVi",
      "Date First Available": "September 16, 2016"
    },
    "categories": [
      "All Departments"
    ],
    "price": ""
  }
}