{
  "website_summaries": [
    {
      "verdict": "Excellent 4K video with access to over 3,500 streaming stations.",
      "pros": [
        "Lost remote finder is a lifesaver",
        "Remote has gaming controls and headphone jack for private listening"
      ],
      "cons": [
        "Can be quirky and occasionally freeze or overheat",
        "May have compatibility issues with some 4K TVs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "The Roku Ultra includes just about every media-streaming feature you can think of, at a premium price.",
      "pros": [
        "Speedy performance",
        "Supports 4K HDR video",
        "Advanced remote with headphone jack and microphone"
      ],
      "cons": [
        "Added features don't quite justify the premium over the Premiere+"
      ],
      "aspects": {},
      "publication_date": 20161014,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Buggy Mess",
      "text": "After 6 months this is now a one-star review. The Roku now gives the purple hdcp screen error 75% of the time. I've tried multiple HDMI cables and every port on my 4k tv to no avail. Roku 3, I miss you. Roku Ultra, wish we'd never met. Works great but occasionally a purple screen with \"DHCP unautherized\" will flash on screen for a second. Goes away fast but it's strange, amazing box aside from that. **Update** Taking away more stars as the purple screen happens more and sometimes there's a green bar on the left of the screen like it can't determine the correct screen size. Hate that this Roku is like this because I loved my roku3.",
      "rating": 1.0,
      "verified": true,
      "author": "Alaskan Cajun",
      "helpful_votes": 5,
      "publication_date": 20170614
    },
    {
      "title": "Used to be Great Now Unstable and Terrible Support",
      "text": "I have owned many Roku devices over the years and have liked all of them a great deal until I recently purchased their \"top-of-the-line\" Ultra. It has been nothing but trouble for the past three months and recently after a Roku Software Update (8.01) it flashes off and on. The Roku support is pretty poor. They take you through the usual troubleshooting and then tell you that they'll research the problem. There's no offer of a return/warranty replacement...you're just stuck. There's a serious problem in their Q/A group and Customer Service department. Time to buy something else from a better manufacturer.",
      "rating": 2.0,
      "verified": true,
      "author": "Ken Esq",
      "helpful_votes": 5,
      "publication_date": 20171203
    },
    {
      "title": "Satisfied with product",
      "text": "We have Roku, Apple TV and Amazon Firesticks in household. Each has their own pluses and minuses but this one is one of the best for ease of use, available channels/feeds and function. I like the voice function and speed of operation.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Hagan",
      "helpful_votes": 11,
      "publication_date": 20161212
    },
    {
      "title": "The Roku Ultra is astonishing!",
      "text": "The Roku Ultra is astonishing! Easy to install &a set up, very fast streaming from HBO, Amazon Prime, Netflix and all the channels from Spectrum, my tv provider. This tiny box is the best thing since HD TV! The Roku remote has a headset jack and I hook up my Sony portable speaker while walking on my treadmill... Love it! I only wish they would add Bluetooth capability.",
      "rating": 5.0,
      "verified": true,
      "author": "BigBird",
      "helpful_votes": 5,
      "publication_date": 20161227
    },
    {
      "title": "Worth it if you don't mind brief loading interruptions and lack of local content",
      "text": "I'd like to give it 5 stars but clearly this streaming media option is in its infancy. The connection and streaming are very good, but it can be confusing searching for content. There needs to be a unified content screen. I'm saving at least $100.00 after cutting my satellite service (+150.00/mo). Never needed all those stations that we didn't watch. I pay $5.00 extra for live CBS. I also pay a small amount for Amazon Prime, Hulu and Netflix. Huge variety to chose from. I expect that this media experience will get better with time and competition.",
      "rating": 3.0,
      "verified": true,
      "author": "JMCalifornia",
      "helpful_votes": 2,
      "publication_date": 20170810
    },
    {
      "title": "I am happy with my purchase",
      "text": "I had to place unit on a stack of coins because of the amount of heat the unit producted. I often had to remove then reinsert the cord because unit would freeze, and Thanksgiving Day, my daughter-in-law informed me that the TV screen was totally green and the remote stopped working. I was quite angry because the Roku power to bes gave no indications that an upgraded model to replace the 1st ultra was being introduced for sale 2 weeks before I made my purchase. In the end, I chose to stick with Roku and gamble on the stick +. I am happy with my purchase. My ultra now sits in closet.",
      "rating": 1.0,
      "verified": true,
      "author": "EbonyEyez",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "First experience with a streaming device. Get one!",
      "text": "A friend was a \"key executive\" at \"some cable company\" and told me about this device years ago. While I used to experiment with cutting edge stuff, I don't much anymore and waited until they matured more. My patience was well served since my expectations were blown away! I have a Sony XBR900E and the two work great together! Yes the Sony streams, but I like the idea of dedicated, task based devices. I use some of the functionality of the Sony too. Need to learn how to get access to my Sony Ultraviolet movies on the Roku. Licensing may dictate using the Sony, but seems I'm covered in any case. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Peterson (aka BabyBoomBBQ)",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "TRY THIS ROKU - YOU WON'T BE SORRY!!",
      "text": "I absolutely love this Roku. We had one of the first ones, but when we heard about the features of this one, we ordered it right away and have not been disappointed. The ability to listen via ear buds connected to the remote is awesome. That way if there is someone else in the room, you do not disturb them.",
      "rating": 5.0,
      "verified": true,
      "author": "DSull",
      "helpful_votes": 6,
      "publication_date": 20161130
    },
    {
      "title": "Roku vs apple TV",
      "text": "I bought both the Roku Ultra and the new apple TV to trial. both work well for streaming, as long as you have enough download speed. I like the roku remote better than the apple remote. and, I like that amazon is available on the Roku. I have a lot of apple products, so having the apple tv available to stream movies from my apple account is awesome, as well. I use both for Plex, and both perform well. If you don't need apple integration with other devices, then this option is cheaper and does the job well. If you want 4K, then Roku is the way to go. All in all, the Roku wins at this price point.",
      "rating": 4.0,
      "verified": true,
      "author": "cutter23",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "Functioning flawlessly!",
      "text": "This product is working great! We purchased this to run the Spectrum TV APP and functions flawlessly! We were having issues using the same APP thru a Samsung 4k TV and this has not had any of the issues particularly the watercolor effects we randomly received. The remote is powerful and on the latest model really convenient being able to control both the volume and power for the TV. Might seem minor but we have disconnected our satellite service and confidently gone to full streaming for everything. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott G.",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Roku Ultra HD and 4K",
      "text": "I set our bedroom up with Roku four years ago. We had satellite systems throughout our home but I enjoyed the vast amount of free stations available using the Roku. After watching Roku in our bedroom my husband decided he wanted it in the living room. Now they have the Roku with HD so he was thrilled. It works great! So easy to install. Picture quality on our Smart TV is perfect for us. I took it with us when we visited our daughter and grandchildren. After seeing the stations available and quality of the picture they purchased one! Highly recommend Roku with HD!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "D. B.",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Replaced a 4th Gen AppleTV with this",
      "text": "Yes. YES!! I moved from a Roku3 to a Gen4 AppleTV when the sling app became available on the Apple. The Roku3 worked great, but we're an apple household and it seemed to make sense. The Slimg app on the appleTV was miserable. It had problems that didn't seemed to get fixed. When the RokuUltra came out offering 4K, I figured why not. I love it. It's silent like the 3 and has essentially all the features the AppleTV has. I'm not going back when it comes to streaming TV. Thank you Roku.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian McIver",
      "helpful_votes": 2,
      "publication_date": 20170106
    },
    {
      "title": "Better than negative let on.",
      "text": "We all look at the reviews and you will see a few negative ones. I had issues with my new 4K Roku. It was turning on and off. I saw the same problem listed in the negative reviews. I wanted to point out that I was having that problem when l had my 4K Roku hooked up to my 1080 TV. Once I hooked it up to my new 4K TV, the entire problem went away. I have to wonder if the negative reviews were hooked up to 1080 TVs. When you hook up your new 4K Roku to a 4K TV, this product worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "vince yates",
      "helpful_votes": 4,
      "publication_date": 20170329
    },
    {
      "title": "Great product. Beware it doesnt have web browser",
      "text": "Package all Good as expected. Didnt Knew That roku Dont have a web browser but its my fault. Anyway you can tell its a premium product. Update: i cant access the my feed option nor the search engine, and i dont Know why. Will give it 5 stars Again when i salve this. Also cant use voice search. And the app isnt available on my country (and surfing the web i found That in most contries isnt, even Canada!). Other than my particular issues, take note That you cant search the web using roku. Youll need to screen mirror from a laptop, tablet or smartphone.",
      "rating": 1.0,
      "verified": true,
      "author": "Santiago",
      "helpful_votes": 6,
      "publication_date": 20170922
    },
    {
      "title": "Poor quality design from a good company",
      "text": "The unit is under 4 months old and has up to date firmware. Many apps lag subtitles up to 3 seconds. The unit is now flickering all the time. I've had all the Roku models and have recommended these units until now. The downloads are also capped at 3.5 mb a second and unit blanks the screen as if it is resetting the screen resolution all the time. If you want 4k try another unit this is a bad purchase. I tried the 3 and it still works at a perfect 1080p as usual.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry L.",
      "helpful_votes": 12,
      "publication_date": 20170221
    },
    {
      "title": "Audio popping and clicking",
      "text": "Go to Google and search \"Roku Ultra audio popping.\" You will find forums of thousands of owners complaining about audio popping and clicking regardless of their audio setup. The product was great otherwise, but the issue with the audio is real, and Roku refuses to fix it. They often shut down support forums due to \"name calling\" in an attempt to stop all the complaints. Until this issue is fixed, STAY AWAY. Amazon was wonderful in accepting my return, and I went with an Amazon Fire... and have been happy ever since.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Hoek",
      "helpful_votes": 2,
      "publication_date": 20170917
    },
    {
      "title": "Cut cable television!",
      "text": "My family recently got rid of cable television because we were forced to switch to Spectrum and they raised our bill by $40 and have no interest in keeping us as customers. Though we are still forced into using them for internet service. This box is now the media hub in our living room along with our Playstation 4. We started using Playstation Vue and like it so far. All of the channels we want without hundreds that we will never watch. The apps on Roku are great, the box works great, and we do not yet regret our decision.",
      "rating": 5.0,
      "verified": true,
      "author": "Myron TTop Contributor: Lego",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Unfortunately had a bad experience",
      "text": "Unfortunately had a bad experience. My LG tv gets a dark screen and then doesn't recognize the input. At first I thought he was the cable so I replace the cable and still experiencing the same issue. Then I thought it was a TV but I only had a problem with Roku. went online to troubleshoot and it turns out it’s a known problem with Roku boxes. The screen goes black or the input is not recognized by the tv while a show or movie is loading to play.",
      "rating": 1.0,
      "verified": true,
      "author": "Yonny Pena",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Roku has opened up a whole new world of entertainment for our family -- the earbud jack on the remote is awesome!",
      "text": "Works great. We used to access Netflix, amazon prime video, and Hulu from our surround sound system but it got a weak signal due to a bad antenna and was always buffering or stopping in the middle. We eventually stopped using it because it was too frustrating. The roku doesn't have any of those issues. It is lightening fast and produces great picture and sound. Even better, there is an earbud jack on the remote so my husband can easily use earbuds and even move around the house while he does. This saves me from having to listen while he binge-watches showes I don't care about and I can read my book or talk on the phone in peace.",
      "rating": 5.0,
      "verified": true,
      "author": "Mestubby",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Unreliable",
      "text": "I used it for about a few weeks and returned it, the unit too often just locked itself from any remote input, the only solution was to unplug the power, wait and power it again. I had to do it each morning and a few times per day. Finely decided to return it. Got the Amazon Fire TV, hopefully it will be more reliable.",
      "rating": 1.0,
      "verified": true,
      "author": "George Z. R.",
      "helpful_votes": 9,
      "publication_date": 20161221
    },
    {
      "title": "Good Picture but 4K Needs HDCP 2.2 Port",
      "text": "Better picture quality than Roku 3. Beware that 4K quality is not available unless you have an available HDCP 2.2 compliant port available. My Samsung U9000F series that is just 2 years old had only one 2.2 port (HDMI #3). Without a 2.2 compliant port you will be forced back to standard 1080P. This Roku is mostly used as a backup for the smart tv functions like Netflix and Amazon. I hope to access the Plex server on my Qnap NAS through the Roku. The Roku Channel is nice in that it has a number of free movies that look like they will change and be updated.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack Dallas",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "This Roku Ultra advertises that it has the Optical Audio - IT DOESN'T",
      "text": "I purchased this Roku Ultra not only for all that the Roku does, which we do like, but also because this model said that it comes with an optical audio. It says this in the description and in the images. When we got the packaged and opened it up, we realized that it didn't have the optical audio. We returned it right away. Don't waste your time purchasing this item. If you are not interested in the optical audio, you can find the same model here in Amazon at a better price.",
      "rating": 1.0,
      "verified": true,
      "author": "ANA QUESADA",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Excellent features, picture quality",
      "text": "Excellent features, picture quality, and after a few firmware updates, the loss of audio upon TV restart was resolved, too. Convenient for its wireless and wired interfaces and even optical audio output. Remote works without needing line of sight, and has a useful headphone jack, perfect for silent viewing, or while exercising. 4K is, of course brilliant, and it even support HDR.",
      "rating": 5.0,
      "verified": true,
      "author": "Elteto",
      "helpful_votes": 2,
      "publication_date": 20170426
    },
    {
      "title": "Roku update causing audio dropouts",
      "text": "Roku did it again with their version 8 update. Totally hosed Netflix audio. Drops out after a few minutes and requires a restart of the Ultra. Then drops again. Roku customer support is horrible and they continue to release bad updates and then deny there's a problem. Avoid if you intend to watch Netflix.",
      "rating": 1.0,
      "verified": true,
      "author": "JAMES",
      "helpful_votes": 2,
      "publication_date": 20180811
    },
    {
      "title": "Poor support. Bricked within 12 days of use.",
      "text": "I was planning to buy an Amazon Fire TV but it was out of stock so after reading a few good recommending reviews, I bought a Roku Ultra. Unfortunately, the search function didn't work and I didn't get a solution from the Roku support. But it wasn't the worst. After only 12 days of use, it bricked. I haven't updated the software or anything else that could cause the problem. Maybe it's bad luck or just poor quality control from the manufacturer. My advice is to go with other streaming devices.",
      "rating": 1.0,
      "verified": true,
      "author": "Geraldo Giovani Pinho da Ponte",
      "helpful_votes": 3,
      "publication_date": 20171017
    },
    {
      "title": "Quality Function and Easy Setup!",
      "text": "I am not a tech guy. I purchased 2 quality units, one for each television and plugged them in. Followed the easy steps and have wonderful working system. Told the old cable system to take the high price of their offerings and I am enjoying better programming and more of it for less cost. The system seems to have AI, as it learns my preferences and brings me similar programming and back to the favorite places again and again! What an improvement this makes!",
      "rating": 5.0,
      "verified": true,
      "author": "bendito",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Can Decode Dolby D+ to Dolby D",
      "text": "This Roku does the one thing that I really needed - it can take Dolby D+ audio (from Netflix, Amazon Prime, etc.) and decode it to Dolby D 5.0 for my soundbar that does not support Dolby D+. As far as I can tell, this is the ONLY Roku device that can do this. Like all Roku devices, setup was easy and connection to WiFi was no problem. For what I need, this is definitely a 5-star device.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil_O",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Best Device Yet",
      "text": "This little device combines all of my accounts under one roof: Amazon, Netflix, and Spectrum. I have tried other devices like TIVO and Western Digital, and Slingbox. This is the first device that consistently has worked with my home network and is super responsive. The ear phone feature is GREAT for the people that want to sleep but the TV is too loud.The WiFi on it is great compared to the other devices on the list. I have ordered a second Roku for my guest bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Rim",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Boots up poorly and freezes often.",
      "text": "I've had this Roku for about 2 years now. I'm so annoyed with it that I searched this purchase just to write a review! I also own 5 others. This is the only one that's an Ultra, and the only one that consistently disappoints me. At least 50% of the time I have to reboot it when I turn the TV on. Also, it buffers very poorly. Rather than just displaying a lower resolution it freezes or shows a progress bar. One day I am going to go Office Space on this thing. The other cheaper Roku models work great! My favorite is my TCL Roku TV, which is nearly flawless.",
      "rating": 1.0,
      "verified": true,
      "author": "mike e bell",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "I'm happy I got the ultra vs the 4",
      "text": "First Roku got for 4K ability. Endless app choices fast setup. I'm happy I got the ultra vs the 4. Worth $20 more maybe not but for my needs nice fit. I wanted a UHD capable unit this was a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "M R",
      "helpful_votes": 4,
      "publication_date": 20161216
    },
    {
      "title": "So far, so good",
      "text": "I went for the 2106 version (4640) to get the optical audio out connection. It is connected directly to a Samsung UN65KS8000 for video and through optical audio to a 1080p AVR that lacks ARC. The Samsung has caused problems for some. The Roku needs to be changed from 12bit to 10bit color in HDR through a secret menu. The Samsung also turns off its optical audio output in some modes. Its ARC is not so reliable. Hence, separate audio out from sources is important. The Roku is fast and just as easy to use as my Roku 3, but with 4K. I control it with a Logitech Harmony One.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerrym303",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "This older Model 4640 has the Optical still...",
      "text": "Was looking for Older Roku Ultra with Optical, this one still does. I noticed it in the 5th stock photo & was worried I would get a newer version but I got the one I wanted and work the same to me as the newer model just with Optical.",
      "rating": 5.0,
      "verified": true,
      "author": "Video Guy",
      "helpful_votes": 3,
      "publication_date": 20190810
    },
    {
      "title": "Has issues",
      "text": "The Roku ultra has issues detecting my wifi and frequently shows a message that hdcp is not supported before playing video. Sometimes I have to restart it to get it to work. I know it is not the TV or the cable the Roku premier works fine I upgraded for HDR support but feel like I downgraded. Update: the Roku stopped putting out an HDMI signal entirely. Update: I contacted Roku support, they wanted me to send it back before they send me a new one. I got a prepaid label and tried to schedule a pick-up and FedEx says the tracking number is invalid.",
      "rating": 1.0,
      "verified": true,
      "author": "msondag",
      "helpful_votes": 2,
      "publication_date": 20170218
    },
    {
      "title": "netflix movies with audio track 5.1 via optical out works!",
      "text": "This is exactly what I need to get the 5.1 audio track from Netflix movies thanks to the previous reviewers pointing out this unique audio output of this unit. I have an older audio system costing 100x of this and was trying to avoid replacing the processor unit to work with netflix movies. This does the job and I can enjoy 5.1 movie sound track with it.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Nguyen",
      "helpful_votes": 4,
      "publication_date": 20161126
    },
    {
      "title": "Just awesome!",
      "text": "This thing rocks! I live with a light sleeper so being able to hook up headphones to the remote is genius! And the remote-finder button has come in handy a couple times already.I have found so many free things to watch that I'll never have time to watch them all. This Roku is fast and very easy to use. It has a port for an micro SD card but I have over 20 channels and haven't seen anything about the internal memory being low. And it was a little cheaper buying it here than from Roku's website.",
      "rating": 5.0,
      "verified": true,
      "author": "Cam!",
      "helpful_votes": 2,
      "publication_date": 20170322
    },
    {
      "title": "Audio Issue",
      "text": "Like others, I find the only problem is audio. I bought it for the earphones. But the sound from the earphones cuts in and out repeatedly unless I restart the unit. After the restart, it works fine until the next time I use it. So it has to be restarted with each use. Otherwise it works fine. Update Jan. 6: FINALLY got a competent senior Roku advisor who resolved the sound issue: 1. remove batteries from remote 2. Unplug Roku for 1 minute 2. Replug Roku 3. After Roku restarts, replace batteries in remote (will automatically repair) 4. Problem solved",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 2,
      "publication_date": 20161231
    },
    {
      "title": "Watch Version type, Though it was the latest. Wrong",
      "text": "Really disappointed to have received an older version at a higher price point. I thought I was receiving the new 4660 version. I did not...",
      "rating": 1.0,
      "verified": true,
      "author": "Robert J. Lovell",
      "helpful_votes": 5,
      "publication_date": 20171027
    },
    {
      "title": "Great Customer Support!",
      "text": "I bought this after my DVD player with Wifi from a name brand company, and the streaming service stopped working after a year and a half. I contacted the company and they basically said too bad. That's the last time I wanted their product. I've had this now for about 2 years since with no issues but when things seemed weird to me, I've called them with great customer service! That makes the world of difference!",
      "rating": 5.0,
      "verified": true,
      "author": "g",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Search button on the remote is terrible",
      "text": "The Roku Ultra is decent, but there is one terrible feature that nearly ruins it for me. They decided to put a search button right above the pause button, and half the time I hit the search button by accident. The problem is that this exits the current app and takes you back to the home screen. Since the Roku does not support multi-tasking, this means you must re-load the app and navigate back to your show. Very annoying. Roku, please provide an option in the menus to disable the search button.",
      "rating": 3.0,
      "verified": true,
      "author": "BattleGnome",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Great picture quality.",
      "text": "Really enjoying this new ultra. The sound and picture quality are both great. Even normal resolution looks better from the Roku than my Apple TV, Direct TV stb, or streamed content from my oppo BDP-103. Even my wife asked me if I did something to make the tv look better. She didn't notice when I replaced our old tv with a new one that was 20\" bigger for almost a week. So her comment says a lot. The 4K works really well. Though it took some fiddling to set up. It's been pretty solid since. Very happy overall.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ White",
      "helpful_votes": 2,
      "publication_date": 20161208
    },
    {
      "title": "New Roku Ultra Is The Best",
      "text": "this player is fantastic, the sound is great and the picture superb will highly recommend it to all my friends. one of the most innovative players I ever seen. I as a consumer appreciate this product and Amazon for selling top of the line electronics",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Ricco Castellanos",
      "helpful_votes": 2,
      "publication_date": 20170701
    },
    {
      "title": "Love it.",
      "text": "I have been using a Roku for a few years and I use it as the main control for all my streaming needs so when I eliminated cable I upgraded to this model and could not be happier. The ease of setup make it easy to use and the JBL earbuds and volume control make this unit very appealing. Several family members are already considering purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "bobliwienski",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "The worst I can say about the change is that it ...",
      "text": "I cut the cable a month ago. While the Roku was my choice and I wouldn't go back, it is a different experience than I have known. The worst I can say about the change is that it takes a lot longer for me to find something I am interested in watching. That said, I can always finds something eventually, which was not the case with my old cable. I would recommend the switch but advise that it is different than surfing channels on cable. Still worth it to me.",
      "rating": 4.0,
      "verified": true,
      "author": "John M.",
      "helpful_votes": 3,
      "publication_date": 20170414
    },
    {
      "title": "Might need a firmware update",
      "text": "They changed the button position for enter which sent me to voice search every time. I own 3 other Roku's so it took some getting used to. The missing star is some glitchy behavior with the remote's headphone capability. A few times the only way to get the sound to work was to reboot the entire thing. Also I had a period where it kept kicking me back to the home screen and had to reboot. I probably should of sent it back but it seems to work most of the time. These seem to be firmware related so hopefully an update fixes them permanently. On a positive note it is faster than my other Roku's.",
      "rating": 4.0,
      "verified": true,
      "author": "DaveOzric",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Buyer beware of HDCP error",
      "text": "Worked fine for 3 months. Now I am getting HDCP unauthorized error and I tried several ways to get the issue fixed. tried new cables, followed ROKU website instructions , googled and youtubed, but unable to fix the issue. I am not sure what else I can do and there is no support from ROKU except disconnect and reconnect.... ROKU must address this issue immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Trinity",
      "helpful_votes": 2,
      "publication_date": 20171220
    },
    {
      "title": "Great, until it breaks, good luck getting customer service to help you!",
      "text": "Worked for a whole six months. Now anything played off the roku has a weird sound distortion. Doesn't matter if it's played through my tv speakers or the sound bar, it sounds as if I am underwater. What makes matters worse is ROKU's customer service is complete crap. Over the last two weeks they've tried to blame my TV, soundbar and xbox (even though the xbox has never been connected to the roku), they simply won't fix it. DO not buy anything from this company.",
      "rating": 1.0,
      "verified": true,
      "author": "nhcc02",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "A good companion for our 4K TV",
      "text": "We recently bought a 55\" 4K TV and got the Ultra to replace our Roku 3. Bumped up our Netflix subscription to 4K. We enjoy the Ultra as much as we have the Roku 3. The only problem we've had is that the remote occasionally unpairs itself, but it's a simple thing to get it re-paired. The Ultra connects to our home's 5GHz network with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall Ainsworth",
      "helpful_votes": 2,
      "publication_date": 20170401
    },
    {
      "title": "Individual services like Hulu, Vudo",
      "text": "Works as described. Many free channels and programs available. Many channels still require a satellite or cable service to \"piggyback\" the content. Individual services like Hulu, Vudo, Crackle, Netflix, etc. require additional subscriptions which will inevitably add to usage cost.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Ricks",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Sluggish, audio inconsistent, reboots",
      "text": "I upgraded from a 2013 model of the Roku 3 (\"R3\"), which worked fine. The Ultra's interface is sluggish compared to the R3, Audio varied widely by channel (much more so than it did with the R3. On a few occasions, while working with the remote, various channels would become unresponsive, which would be followed by the device rebooting. Since no other current Roku has an Ethernet connection and a USB plug, I'll be going back to the R3 for the time being. I've also ordered a FireTV, since that device seems to get new channels before the Roku (and in some cases, instead of it).",
      "rating": 2.0,
      "verified": true,
      "author": "Tom Barrister",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Another satisfied Roku customer",
      "text": "I simply love the Roku streaming media players. This is my second Roku. I bought the least expensive model (and loved it) as I was unaware I was going to get a 43\" 4k UHD TV. I decided to buy this one to match my new TV as the price from Amazon was really great! So easy to set up and it works so well I can't say enough good things about it. If you're looking for a streaming media player, look no further. This one will not disappoint you.",
      "rating": 5.0,
      "verified": true,
      "author": "RedTiger",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Great device. Easily identified an old 720p TV after ...",
      "text": "Great device. Easily identified an old 720p TV after an HDMI to DVI conversion. Audio converted from SPDIF to anlog headphones jack by an external conversion. RF remote works great - the device is located behind the wall in the next room, and no problem controlling. The headphones audio jack on the remote is a great feature, allowing to hear while some one next to you is sleeping. Wasnt able yet to connect the streaming from PC options, but many intyernet channels are available. Some channels are not listed through the device, and can be added using the web site on a PC. Just search for what interesets you.",
      "rating": 5.0,
      "verified": true,
      "author": "Niv Urbach",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Good Streaming Device",
      "text": "I have been using my Roku Ultra for about a month. I am not using 4K, so I can't comment on that. The Roku was easy to setup and get working and I use it daily. I know other users have reported picture quality issues and the unit running hot. I have not had any problems with my device. So far it has performed flawlessly. I am using it hardwired as well. I have not tested it on WIFI.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon1234",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Roku Ultra",
      "text": "Works very good. Hard Drive connected is a pain. The list is large icons, hard to navigate. Networked computers do not see the hard drive so I cannot add movies easily. It does see that hard drive while on another computer just fine so I use it that way. NIC connection is great as that is way faster than WiFi. Can load channels via the website on the computer, they pop up on the Roku in a few moments after restarting the Roku. I like it so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Moefugger",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Check carefully if you want digital optical audio out",
      "text": "Amazon provided the model 4640R with digital optical audio out, as I expected. Yay! I can connect digital sound to my audio system and hdmi video to my display. Be aware that the current Roku Ultra model (4660R) that you would get from Roku directly or possibly from other sellers does NOT have the digital optical audio out even though the Ultra name is unchanged. As far as I can tell, the other specs and the supplied remote are identical. If optical audio out is important to you, check carefully what you are buying.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Prime Customer",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Great Item and seller but BEWARE of the unrelated activation scam for 100.00",
      "text": "I love the Roku and the seller BUT I HATE THE ACTIVATION SCAM - BEWARE!!!! After getting the device and started setup I was asked to go to a website to activate. When I entered the code it gave an error and said to call a number. When I did they said it would cost 100.00 for a one time charge to activate. This was a scam. They gave their name which was Hern IT. I usually can catch a scam but these people were good. Do not use the link displayed on your screen to activate. Go to the real Roku. I canceled my card after a friend showed me what had happened.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Joyce",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "We really get the use out of this thing!",
      "text": "Some Smart TVs don't carry the channels we subscribe to - but what you can't get through your TV company, you can subscribe to HERE! We love our Roku! It hardly EVER 'crashes', and our favorite pay-for channels run better (than I can't say or someone in my house'd be offended, but let's say a different box. Plus, if you ever drop and destroy a remote - you can easily buy accessories (that happened to us), and it didn't break the bank! Thank you, Roku company!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Johnson",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Roku ultra is faulty...beware",
      "text": "About ready to throw this thing out the window. This device is faulty out of the gate. Keeps cycling trying to install software update. Downloaded fine once or twice then reboots and starts the same crappy process again and agsin stating can't connect. Roku support doesn't have a clue even though it seems to be a very common problem for them based on the internet searching I did.",
      "rating": 1.0,
      "verified": true,
      "author": "JBB",
      "helpful_votes": 2,
      "publication_date": 20170817
    },
    {
      "title": "Garbage.",
      "text": "16 months after purchasing, we began to experience HDCP errors. I bought **3** brand -new, fast-as-possible HDMI cords. It's not the TV, it's not the port itself - I've moved around all of my devices, and *only* the Roku Ultra is reporting these issues. My PS4 is fine, my Chrome_cast is fine, but this thing is a piece o' poop.",
      "rating": 1.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 2,
      "publication_date": 20190205
    },
    {
      "title": "Excellent for the tasks assigned!",
      "text": "I had a Roku 3 that started out a bit \"buggy\" but settled down and worked flawlessly thereafter. But the purchase of an OLED 4K TV meant that my Roku should be capable of delivering 4K streams of content! I decided to go with Roku's top product and had to wait for production as they weren't yet available. Got it, plugged it in and haven't looked back! No problems whatsoever... nice unit!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Vernon",
      "helpful_votes": 2,
      "publication_date": 20161207
    },
    {
      "title": "Buggy and glitchy!",
      "text": "I was very happy with my Roku 3, but they dropped the ball with the Ultra. From Netflix crashing the system, to multiple AV pops with DD and flashes with 4k... Returned the 1st unit, but 2nd unit does they same. No Roku, its not my network, cable or equipment. Your device is buggy and I've wasted enough time with your tech support.",
      "rating": 1.0,
      "verified": true,
      "author": "W. Lee Hendrick",
      "helpful_votes": 3,
      "publication_date": 20170212
    },
    {
      "title": "A very good device; spotty performance on many of the free apps",
      "text": "Very quiet machine, none of the delays appear to be because of the machine, and the voice recognition works pretty well (amazing it works at all!). I subscribe to amazon prime and netflix. The youtube app is great. All three of the preceding load very well, even over a somewhat limited bandwidth connection (download 3 Mbps/upload 1 Mbps). Besides youtube, most of the other free apps (accessed through the roku app) take a pretty long time to load, and many experience significant midstream pauses.",
      "rating": 4.0,
      "verified": true,
      "author": "Don Montgomery",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Too many pauses",
      "text": "I expected to stream as well via Roku as from Netflix and Amazon Prime directly. The advantage of Roku, I thought, would be to give my housemates access to Fox News (via a DirecTV NOW app) and some sports programming. Unfortunately, with a wired Internet connection to the Roku Ultra at 55-to-60 mbps, the experience was unbearable. Running 5-minute timed trials, counting flickers and measuring pauses, my results averaged 0.9 interruptions per minute with each interruption averaging 3.6 seconds. An explanation is beyond me and of course YMMV.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Very unreliable 4k HDR playback",
      "text": "Crashes all the time. 4k HDR doesn't really work. It doesn't matter what TV or what cable we use, it throw up a HDCP 2.2 error. At this point, we just stream straight to the TVs (Vizio and Samsung) because the Roku Ultra only works well with 1080 content. We wish we never bought it.",
      "rating": 2.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 12,
      "publication_date": 20170228
    },
    {
      "title": "Excellent streaming box!",
      "text": "This is a great little box for streaming and the remote is nice & simple as well. Bought in 2017 and have never had a problem...ever! SOO much better than going through the DVD/TV for streaming...I was amazed at the difference in visual quality. Very impressed...& recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "# IT'S OKAY #",
      "text": "My only complaint is that it chews through batteries every month. I think it continues to draw power when not actually being used. Not sure why else it would chew through so many batteries. It seems to work best if I remove the batteries when not in use. Also, it will occasionally freeze. I can usually recover from this by just removing the batteries from the remote and putting them back in. Hopefully, this issue gets addressed.",
      "rating": 3.0,
      "verified": true,
      "author": "Raymond",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Needs to reboot a lot! Problem solved.",
      "text": "Needs to reboot almost every time I use it! Added 9-7-18...After using the Roku for some time now I have discovered that if you return it to the Home page at the conclusion of the use period the need to reboot is eliminated. The remote is better than the old one but seems to need a few more buttons with useable functions. The buttons that take you directly to a service ie. Netflix are completely unnecessary and could be eliminated. All in all, we like the Roku Ultra.",
      "rating": 4.0,
      "verified": true,
      "author": "Philip",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Reliable, Fast, Easy to use",
      "text": "The most important features to me: reliability, speed, and an easy to use, intuitive user interface. This has all of those things. I think having the headphone jack on the remote is simple genius, and I've used it multiple times when my wife is napping on the couch or something. This device is easy to setup, quick to use, and the picture looks great on my tv.",
      "rating": 5.0,
      "verified": true,
      "author": "L Robinson",
      "helpful_votes": 2,
      "publication_date": 20161209
    },
    {
      "title": "Roku Ultra is tops.",
      "text": "The Roku-Ultra replaced an OLD (steam-powered) Roku box that had to be replaced to allow me to access Acorn. The new box with interesting and usesful features is a great improvement over the old box...which I loved from day-one. I'm happy as a clam with the new Roku Ultra!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Dowd",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "First Time TV Streaming",
      "text": "After research and shopping, I purchased this Rocky Ultra. Dish TV was cancelled, local digital broadcast obtained. Not looking back... Local TV plus Roku streaming allows me to watch all the programs I had before, on my schedule. With my daily schedule changing to an other than conventional 9-5 one, this media choice has been tremendous. Movies, TV, etc. without conforming to media's 20th century thinking!",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth J. Dunlap",
      "helpful_votes": 3,
      "publication_date": 20161221
    },
    {
      "title": "Well worth the money.",
      "text": "I love Roku. This is the 2nd one I own. Even though tv has some of the capabilities, it's so frustrating and slow. The Roku is very much faster and the interface is cleaner. Voice interface is accurate enough, as much as I expect. I have AppleTV, Amazon FireTv, and Roku. I ALWAYS use the Roku.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim.Moor",
      "helpful_votes": 2,
      "publication_date": 20170130
    },
    {
      "title": "Device appears to be fine, but somehow can't get the software upgrade to ...",
      "text": "Device appears to be fine, but somehow can't get the software upgrade to 7.5 (and the associated \"new\" features). It's been two months. Yes, I've contacted customer support. Apparently there's nothing they can do. Nice. You'd think they might prioritize their most expensive units for the upgrade. Apparently not. So, five stars for the product and 2-3 for support. Maybe someday. Update: Finally the OS 7.5 update arrived (end of Jan '17). Device now works as advertised. I don't use the ROKU remote so I can't comment on that.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry M.",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "the unit has allowe me to enjoy all the major series",
      "text": "has been working ok for a long time now. I do a lot of streaming on netflix, the unit has allowe me to enjoy all the major series, from 1080 to 4K e.g. House of Cards, Walking Dead, Narcos, and many many more. Great product and much recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "African-Brand",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "it is a good device, but it takes a few seconds to ...",
      "text": "My Roku 3 got broken and for replacement, I was choosing between Roku Premiere + and Roku Ultra. I decided to go ahead with Ultra version because of the remote controller finder (the remote is so small and always gets lost). In general, it is a good device, but it takes a few seconds to get a clear picture when running Netflix or Hulu. Sometimes, \"HDCP not authorized\" error pops up but disappears in a second or two.",
      "rating": 3.0,
      "verified": true,
      "author": "Elman",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "USB DRIVE option that provides less power than old ROKU 3!",
      "text": "Here is the deal. If your old ROKU 3 can power a hard drive and your NEW, MORE POWERFUL ROKU ULTRA is not being able to power the same hard drive, you have a problem! Apparently, there is also a ROKU ULTRA out there that has more power to power the USB HD, this is not. Very disappointed so far.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter H. Togel",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "JUST LIKE RINGTONES FOR CELLPHONES",
      "text": "I CAN MOVE THIS FROM ONE TV TO THE NEXT. CABLE IS SO OVER RATED .. JUST LIKE RINGTONES FOR CELLPHONES. GREAT THING IS I GET TO CHOICE WHAT I WANT TO SEE. RATHER IF ITS A MOVIE OR TV SERIES I MY HAVE MISS I DON'T HAVE TO WAIT TO SEE WHEN ITS GOING TO SHOW NEXT (MY FAVORITES) I CAN CATCH UP ON MY TIME . BEST IDEA SINCE CABLE CHANNELS BECAME OVERRATED AND PRICE TO HIGH TO PAY. THANKS TO ROKU , NETFLIX I DON'T HAVE TO PAY A CAR NOTE FOR ENTERTAINMENT ON A MONTHLY BASES AND EXTRA FEES.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Remote Battery Life?!!!",
      "text": "I am starting out with three stars, because I purchased two of these units a couple of months apart, and both of them have the same problem of extremely poor battery life in the remotes. The only way to save a new set of batteries from going completely dead after about two days, whether in use or not, is to remove the batteries. I have not been able to find a Roku support resource to inquire and seek help about this problem, even though there are many reviewers who have complained of the same problem. If someone from Roku can help me with this, I would greatly appreciate it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Good 4K. Easy to use. Resets needed.",
      "text": "Streaming 4K Movies through Roku VUDU are great and there is little risk they won't default to 1080P (HDX). Same movies through Samsung 4K Bluray (8500) may play just HDX. Roku streams through a Yamaha receiver. Roku needs to be rebooted (power off 10 secs then on) more often than I like (after freezing or a \"lack of bandwidth\" error . . . 50 MPS bandwidth connection) but I would buy it again. Universal all in one remote produces multiple clicks on Roku if button push is even a little too long. Frustrating. I use the cell app remote rather than the Roku remote. Works great and always with me.",
      "rating": 4.0,
      "verified": true,
      "author": "Snickers Freak",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Great product. I replaced an older Apple TV and ...",
      "text": "Great product. I replaced an older Apple TV and there is no comparison. I am not an Apple person to begin with so my review is slightly slanted away from Apple products. But the Roku Ultra is a great product and love it. It was easy to set up and use. I like the fact that you can add different content to the device. I am thinking about getting one for my vacation house.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerard Tarabokia",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "It's so hard finding a streaming box that plays nicely with as many services as possible",
      "text": "It's so hard finding a streaming box that plays nicely with as many services as possible. The point anywhere remote and ethernet port were big selling features for me. The one thing I don't like is the buttons on the remote: they are pre-programmed and labelled, so you're stuck with them FOREVER.",
      "rating": 5.0,
      "verified": true,
      "author": "Earthican",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "A step in the right direction to dropping cable TV!",
      "text": "Purchased 3 of these. The voice recognition is key to find shows across Netflix, Hulu, HBO, Showtime, Amazon, and other services. Just say \"Breaking bad\" and all streaming options are displayed. Can act as a Chromecast for video streaming. However all 3 of mine stopped working as a Chromecast streamer. I am hoping an update will repair. My advice is to not rely on it for this feature, but instead use a Chromecast. I would gave it 4 stars, as I also want way to easily integrate over-the-air TV (integrate into HomeRun device), DVR shows, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael J. Murphy",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Lots of problems to be solved.",
      "text": "Constantly forced to unplug the unit, or reboot the unit because the screen locks up with a green screen. Choosing a different screen resolutions does not change the issue. This is happening on both of the Roku units I've purchased. And, it's happening on both televisions I'm connected to. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "MLK",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "I love this thing",
      "text": "I switched over to this Roku Ultra after getting an email from Sling TV that they were no longer using the ChannelMaster interface that I had been using about a month ago. This is so much better it's ridiculous! Everything about it seems superior, from its speed of response to quality of construction, especially in the remote control, which works much better than the ChannelMaster did. Thrilled to be using this now...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "love",
      "text": "although we did move from the roku to amazon fire stick, roku is great. we do sometimes still use it and it works great. you can get lots of access to shows and movies. Only thing I can see some people not realizing is that to get access to anything on the roku, u must have an account for each app u use. ex: Netflix, hulu. Sling, etc. but I knew this when buying so it wasn't a problem for me . I would recommend to others but not before the Amazon Fire Stick.",
      "rating": 5.0,
      "verified": true,
      "author": "maurac",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "King of this mountain",
      "text": "I have nothing but good things to say about the Roku. Generally I am a tinkerer and I REALLY loved the Kodi on a Raspberry pi, but my family not so much. I would change the UI, add new features, move things on a whim This plays all my files on my network through Plex and Emby, gives us cable via PlutoTV and SlingTV. Some of the games that you can install look REALLY dated but, who plays games on TV anymore?",
      "rating": 5.0,
      "verified": true,
      "author": "Vernon Williamson",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "This is an EXCELLENT product. One word of advice",
      "text": "This is an EXCELLENT product. One word of advice: connect it with a high quality HDMI cable otherwise you will get security errors. I had put it on a normal HDMI cable which was causing problems, they I connected to another much better HDMI and the problem was gone. This is very easy to use, very easy to navigate, the Android apps for both tablets and phones are excellent. It is also very fast and responsive. Very satisfied with it much better than the other systems out there. Definitely worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos A.",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Extremly buggy",
      "text": "This is the worst line of rokus to be released yet. I've had nothing but issues and their customer service is horrible. I recommend trying another device other than roku",
      "rating": 1.0,
      "verified": true,
      "author": "CG",
      "helpful_votes": 3,
      "publication_date": 20170319
    },
    {
      "title": "I use it on a smart TV because even though the television has a lot ...",
      "text": "I bought the Roku on Wirecutter's review/recommendation. I use it on a smart TV because even though the television has a lot of the same features the Roku does, the Roku UI is vastly superior.",
      "rating": 5.0,
      "verified": true,
      "author": "Kosal Dao",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "I prefer Roku over all my other streaming devices.",
      "text": "Bought these for the 5.8Ghz band support as the older Rokus only supported 2.4Ghz wifi. The new place had a TV that was only getting about 1.5mb Wifi on 2.4ghz. Now with using the 5.8Ghz, I get 72mb download tests. No more Netflix buffering, not to mention. These support the Netflix Profiles while some of my older Rokus do not.",
      "rating": 5.0,
      "verified": true,
      "author": "David Brown",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Terrible. Bought this because I was a previous Roku ...",
      "text": "Terrible. Bought this because I was a previous Roku fan. Constant hdcp unauthorized issues. Roku always just blames the hdmi cable. I've tried 4 of them including the one on their website with the same results. Now it wont sync dts audio unless night mode is on. Just another firmware issue roku won't admit to having. There are better products.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Hanlon",
      "helpful_votes": 3,
      "publication_date": 20170305
    },
    {
      "title": "Hi 4K & better HD",
      "text": "I didn't think it could get any better. But alas, Roku did it again. Only thing I dislike is the remote. Ok is in the spot where the search button is now. So I keep searching by accident. Also they got rid of the Amazon quick button replacing it with Hulu & Showtime. I'll get used to it.",
      "rating": 5.0,
      "verified": true,
      "author": ".",
      "helpful_votes": 2,
      "publication_date": 20170127
    },
    {
      "title": "Good unit",
      "text": "I bought a new TV to replace my 11 year old set. I had a Roku 1 for the old set and gave to my granddaughter. While my new TV is not 4K ready, this Ruku works great with it. If in the future, I get 4K ready TV, I'll be Roku Ready. I prefer Roku over Amazon stick.",
      "rating": 5.0,
      "verified": true,
      "author": "SusieQ",
      "helpful_votes": 2,
      "publication_date": 20170507
    },
    {
      "title": "Roku crooks",
      "text": "Don't by Roku ultra Audio issues with popping noise. Called Roku and was advised to buy new hdmi cables. Of course that was just a guess on their part and it didn't work. There customer support is a joke. Thank god for amazon who helped me",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Sutton",
      "helpful_votes": 4,
      "publication_date": 20170214
    },
    {
      "title": "Like many other owners",
      "text": "In the process of warranty. Like many other owners, performance issues exist with this model. Random high pitch squeek during video streaming, power cycles after idle. Probably getting out of the Roku game after this.",
      "rating": 1.0,
      "verified": true,
      "author": "SWFL",
      "helpful_votes": 2,
      "publication_date": 20170829
    },
    {
      "title": "We save more that $720/year now.",
      "text": "We cancelled Dish and now subscribe to Netflix and Hulu using our Roku. We are saving around $60/month... $720/yr!!! We had the basic cable package before. Streams from our wireless box at the other end of the house without any problems. Now we watch what we want to watch, whenever we want to watch it! A win/win.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim D",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "NOT SO \"STREAMY\"",
      "text": "Set it up just find. It installed HD alright then started giving errors that it didn't support it. When I switch back and forward from my source input to my TV it doesn't always remember that I'm connected to the Internet, even though I have the Roku device attached to my router via an RJ45 cable (hard wired). Some applications such as Sling do not load and cease up the Roku. My Roku 3 operated flawlessly.",
      "rating": 3.0,
      "verified": true,
      "author": "Victor Ramon Mojica",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Should have bought Roku before.",
      "text": "I was looking for an additional Amazon FireTv unit. They are no longer available and the latest reviews were not that great. Decidecd to try this and i am glad I did. More features and works better than the original fireTv which I also liked. I am very happy with this unit. It seems like I Should have bought Roku from the beginning but I do not know how much change there has been. .",
      "rating": 5.0,
      "verified": true,
      "author": "shippreck",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Worth the expense",
      "text": "Great app loading speed. Transitions seamlessly between apps and menus. After a few months I noticed that the sound in a few of the apps had gotten noticeably quieter then before. I have read through other users that by switching audio settings from 5.1 surround to stereo and then back again, it solves this problem. Temporarily. Might be a rocky software issue. Unit still works just fine, this only a minor nuisance",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "This is a fine product that works as advertised",
      "text": "This is a fine product that works as advertised. It's vastly superior to a ChromecastUltra. I travel a lot and many motels don't have a WiFi signal that is strong enough for streaming. I thought that with a Pixel phone and a Chromecast that I could use the VZ signal to stream, but Google designed it so that won't work. You must have a different WiFi signal to use the Chromecast, but the VZ signal runs any Roku without a problem. Features vary on the various Roku models, but I own 3 and all work very well",
      "rating": 5.0,
      "verified": true,
      "author": "Forrest",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "I am so disappointed..",
      "text": "I purchased the Roku ultra mainly for the voice command feature on the remote which enables you to find movies easier. After receiving this product from Amazon, it was discovered that the feature does not work. I have tried several troubleshooting options, all of which were futile. Also the product did not come with a manual, which made it even more difficult to figure a solution to this problem. I am so disappointed..",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry Adams",
      "helpful_votes": 2,
      "publication_date": 20170309
    },
    {
      "title": "But oh I love the earbuds feature",
      "text": "Always loses its pair with the device. Its silly. Suddenly remote just wont work and everything has to be reset. But oh I love the earbuds feature. You can literally plug them into the remote and not disturb your family. The pairing issue was maddening however. I have bought other streamers. My amazon fire never does this, my samsung hub never does this. Those are on other TVs. Roku get your sh--- together!!!!!!!!!! :)",
      "rating": 2.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20170626
    }
  ],
  "product_meta": {
    "title": "Roku Ultra - HD and 4K UHD Streaming Media Player with HDR, Enhanced Remote with Voice Search",
    "description": "Looking for our ultimate streaming player? Meet the new Roku Ultra for HD and 4K Ultra HD TVs. It comes fully loaded and delivers a powerful streaming experience with a quad core processor, 802.11ac dual band wireless, and the latest streaming technology. Immerse yourself in the action with brilliant 4K* Ultra HD at 60fps for ultra smooth video, or stream full 1080p HD. See incredibly rich and realistic color detail with vibrant HDR.* Stream just about anything with access to 4,500+ paid or free channels. And get incredible features like a lost remote finder and a point anywhere remote with voice search, gaming controls, and headphones for private listening. *The 4K experience requires a compatible 4K TV and 4K content. HDR requires a compatible HDR TV and HDR content. Such content will not be available on all channels. Check with the 4K channel partner for specific bandwidth requirements to access its 4K content.",
    "rating": 4,
    "feature_bullets": [
      "Works with virtually any TV",
      "High definition streaming up to 720p HD",
      "1000+ channels with movies, TV shows, music, sports & more",
      "Free app for iOS and android",
      "Built in wireless (WiFi b/g/n)"
    ],
    "specifications": {
      "Brand Name": "Roku",
      "Item Weight": "1.2 pounds",
      "Product Dimensions": "1.4 x 3.3 x 1.7 inches",
      "Item model number": "Roku Ultra",
      "Batteries": "2 AA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color Name": "Black",
      "Specification Met": "",
      "ASIN": "B01M05030B",
      "Customer Reviews": "4.0 out of 5 stars1,634 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#24,854 in Electronics",
      "Date First Available": "December 4, 2015"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "Streaming Media Players"
    ],
    "price": 189.99
  }
}