{
  "website_summaries": [
    {
      "verdict": "Comfortable boot that keeps feet warm and dry. If you love the way UGGs feel, these won't disappoint.",
      "pros": [
        "These have the comfort many people have come to expect from UGGs",
        "Manage to have good insulation without being clunky",
        "Keep feet dry"
      ],
      "cons": [
        "Run small so order half to full size up"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pretty sure these are FAKE",
      "text": "These were sadly fake, I think. They said \"UGG Waterproof\" instead of \"UGG Australia.\" The tissue paper was also wrong (plain, no UGG logos). The box did not have an UGG sun on it. The \"leather\" seams were also not well sewn together, and normally, you expect better of UGG shoes, given the price. Over all, very disappointing. PLEASE be vigilant, as these can be very well faked. (see photos)",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 35,
      "publication_date": 20180128
    },
    {
      "title": "Received one fake pair",
      "text": "Received a counterfeit version. I ordered 3 colors to try (2 from Zappos and one from amazon services). The Zappos boots came with authenticity inserts, qc code on left boot, and ugh box. The otter color from the 3rd party did not. Also, the “leather” was clearly of inferior quality. Tan shoe is authentic, otter color is not. You can see clear differences in label, box, and left insert tag. Be careful!!",
      "rating": 1.0,
      "verified": true,
      "author": "Virginia",
      "helpful_votes": 33,
      "publication_date": 20180118
    },
    {
      "title": "Beware: I received fake UGG boots",
      "text": "I unfortunately received a fake pair of UGG boots. Please make sure your pair has an authentic tag sewn in on the left boot. The pair I bought did not. Also the inside of the real boot should feel smooth, not rough and scratchy like the fake pair I received.",
      "rating": 1.0,
      "verified": true,
      "author": "Morethanconqueror ",
      "helpful_votes": 26,
      "publication_date": 20171230
    },
    {
      "title": "Fake UGG! No authenticity label sewn on the boots ...",
      "text": "Got this from What is Hot seller. Fake UGG! No authenticity label sewn on the boots. The bar code on the box is fake! The leather on the side of boot are two pieces not one piece as shown in the picture!",
      "rating": 1.0,
      "verified": true,
      "author": "C. LEE",
      "helpful_votes": 19,
      "publication_date": 20180103
    },
    {
      "title": "Great for Polar Vortexes!",
      "text": "I just moved up to Massachusetts from Texas in September of 2016, and was told by a friend to buy good snow boots. I thought these were pretty expensive, but it turns out they were absolutely the best purchase I have made since I got up here. My feet stay completely warm and dry in these boots, and the traction of the rubber is very helpful when navigating this crazy polar vortex I have moved into. If you need good snow boots, buying these is a very good decision. Would totally buy again if presented with this decision again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Dickerson",
      "helpful_votes": 10,
      "publication_date": 20170115
    },
    {
      "title": "100% Fake",
      "text": "When I tried them on, they were a bit snug, but fit as expected. However, when I first stepped out, the top of my toes started to get a chill almost immediately. I thought that maybe if I walked around in them, they'll warm up. Sadly, it wasn't the case. I wore them all day in 17 degree weather and my toes were halfway numb by the time I got home. The fur is rough, and the lining is incredibly thin, so it's no wonder my feet didn't warm up very well, and at times at all. Avoid buying these from here.",
      "rating": 1.0,
      "verified": true,
      "author": "Paolina",
      "helpful_votes": 6,
      "publication_date": 20180114
    },
    {
      "title": "THEY ARE AUTHENTIC, I took these to a uggs store to confirm",
      "text": "I’m changing my review on these boots, I was very skeptical about its authenticity because the front label on them was different from the picture, the label of the boots I received say “uggs waterproof” the picture say “uggs Australia” and the label of the left boot doesn’t have a QR code to scan but everything else checked out so I took them to the uggs store and confirmed THEY ARE AUTHENTIC, I verified this with the store employee and looking at their boots inside the store, apparently they don’t have the QR code anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs George",
      "helpful_votes": 4,
      "publication_date": 20180406
    },
    {
      "title": "Awesome boots",
      "text": "I love these boots. Incredibly warm, comfortable, and proven to be waterproof. They have a really good lugged outsole that grips snow and ice pretty well. I got 1/2 size larger to accommodate thicker socks. You could probably get your normal size if you plan to wear them barefoot or with a thin nylon type sock. I'm that person who's feet are always frozen in the winter, but these boots keep my feet warm and dry. The only nitpicky complaint I have is that the laces tend to come undone, so I have to double knot them. Other than that, I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "NYC0731",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Authentic boots, but I can't exchange for a larger size and they run small",
      "text": "I wish I did like these boots, but unfortunately the combination of my toes getting cold while trying them for several hours wearing only thin socks (meaning they're too small, despite me ordering half a size larger than usual) and that the box was not original (for the price, come on!) means I'll be looking elsewhere, as there's no more size 9's for me to go up another half size and exchange. I do believe these are authentic Ugg though, because I tried the scan tag on the left boot and it brought me to the official Ugg website. Too bad Amazon is out of stock of anything aside from 5 and 5.5 (are they not being made anymore?).",
      "rating": 3.0,
      "verified": true,
      "author": "mikaela",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "DON'T BUY .. Poorly made",
      "text": "Poorly made , The seams nearest to the laces wasn't even together . Glue was noticable in spots . If you want to be sure you get real boots , Buy from the UGG web page . I done just that .. It was actually a $20 price difference",
      "rating": 1.0,
      "verified": true,
      "author": "frank dancsecs",
      "helpful_votes": 4,
      "publication_date": 20180107
    },
    {
      "title": "Practically perfect!",
      "text": "I absolutely love these boots! At first I was hesitant to buy bc of the high price and comments about possible fakes. However, my code checks out (so they're real). These boots are comfortable straight out of the box, super warm, and truly waterproof! I've walked across large areas of mud and standing water, and I've crossed shallow creeks in them and have yet to get wet feet. The only reason I'm not giving 5 stars is bc the boots are very squeaky. I thought they would stop once broken in, but I've put many miles on them and they still squeak, particularly one of the soles.",
      "rating": 4.0,
      "verified": true,
      "author": "DK ELLER",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "FAKE FAKE FAKE!!!",
      "text": "FAKE FAKE FAKE!!! No uggpure wool inside, instead thin synthetic. Also made in Vietnam, and should say Made in China. Check authenticity. These are FAKE!!! Shame on you Amazon for allowing fakes!",
      "rating": 1.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 8,
      "publication_date": 20180117
    },
    {
      "title": "Definitely authentic.. beautiful boots runs small",
      "text": "Received today. Normally wear 7.5 women ordered size 8, fits snuggly but works. Won't be able to wear thick socks but that is ok as the lining is very warm and soft. I have another pair in black from last winter and really loved them same size but this pair seems to be a little smaller reason for 4 stars instead of 5. Can't wait to see how they fair this winter when I travel North to Canada. They are authentic and come with verification code and I did check Ugg website directly to confirm not counterfeit.",
      "rating": 4.0,
      "verified": true,
      "author": "Aly M",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Warm, fit like a glove and lighter than expected",
      "text": "Just received them yesterday and weather is on its way this weekend including snow. Very timely. Fit like a glove like all UGG products. I have wide feet so I appreciate UGG for their wider than normal fit. Very warm and surprisingly light boot. Will write more once I wear in the weather and see how water tight, warm and comfy they are. Nice dark brown color.",
      "rating": 5.0,
      "verified": true,
      "author": "Anastasia Yeager",
      "helpful_votes": 2,
      "publication_date": 20180118
    },
    {
      "title": "In Love With My 1st Pair of UGG's!",
      "text": "I love these boots, they are my first pair of Uggs! But they do run a little small, but not so much that I can't wear them! If I take the sole insert out, they fit perfectly and even a little loose...so they work just fine for me! I haven't had a chance to wear them all day yet, our weather started warming up. So I'm anxiously waiting for a chance to wear them, hope I don't have to wait until next Fall/ Winter!? That would be a bummer for sure! Lol",
      "rating": 5.0,
      "verified": true,
      "author": "MsAbigail",
      "helpful_votes": 3,
      "publication_date": 20160221
    },
    {
      "title": "Run Small",
      "text": "I bought two pairs and one was real and one was fake. The sand was real but the otter color was fake - packaging and all. However, these run small. All my other Uggs are size 5 but these I have to return and probably get a 5.5. They are very warm though, a bit heavier than the normal ugg boots but that's a given. The sole is kinda curved at the front which takes some getting used to but the traction is good. You have to tie the laces super tight though if you don't want them coming undone.",
      "rating": 5.0,
      "verified": true,
      "author": "Ntkhanh",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Good Investment",
      "text": "I had these boots in my wish list for about a year. I finally decided to invest in these after seeing my sister wear hers year after year. I got them during the New York winter \"bomb cyclone\" storm. They were warm, and I was able to walk in the snow comfortably. Happy I got them.",
      "rating": 5.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Hope they live up to the hype",
      "text": "while these are more stylish than the North Face brand [which is what I was looking for-warmth/fashion at a reasonable price], I found the area in the toes quite constricting. I ordered another pair a 1/2 size up to adjust for this, but they too are constricting. They don't hurt, but I guess that's what I'll trade off for the fashion --now if only they keep me warm while shoveling out of another 'noreaster'.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Love this boot",
      "text": "These are the most comfortable warm boots ever. If I didn't get to purchase them because of my uniform allowance I never would have gotten to experience these boots. I would definitely save up to buy these myself if work didn't buy them for me! I've snowshoed in them, rain, cold whatever! These winter boots are fantastic! Tried to buy more last year but were sold out everywhere! The only thing is the fur on the inside wears out pretty quick. But you can buy sherpa inserts to replace it for pretty cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "Darian",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "BUY!!",
      "text": "My 1st pair of UGGS and I am in love. These boots have kept my feet warm and dry. I live in Boston with a long commute in all winter weather elements. I am blessed to have been able to find my size especially since 6 1/ 2 goes fast! If you are having doubts get them you will be impressed. I got a compliment from a co-worker the 1st day I wore them into the office. They are super cute and comfy also light!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy F.",
      "helpful_votes": 36,
      "publication_date": 20150221
    },
    {
      "title": "but they did great! Very warm and completely waterproof",
      "text": "This was the first winter for these boots for me, but they did great! Very warm and completely waterproof. I was surprised how light they are for durable boots. They kept my feet very warm without issue. Highly recommend these! I'm normally a size 9 in most shoes and a 10 in ugg boots. The 9.5 worked very well. Color is true to the picture. I love the grey!!!",
      "rating": 5.0,
      "verified": true,
      "author": "epb2678",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "I received fake Uggs.",
      "text": "The boots I received were fake. Good fakes, but fake nonetheless. The two more obvious tells were the front tag saying just \"Ugg\", instead of \"Ugg Australia\", and also the Vibram soles had a more gold colored Vibram marking, instead of the brighter yellow. They may be real Vibram outersoles, but a lower quality than the ones Ugg uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Kellogg",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "This boot runs at least one and half sizes too small",
      "text": "These boots run VERY small. I usually wear a size 61/2 so I initially ordered a 7 after reading a few reviews. I finally ended up wearing a size 8. This size gives me enough room to insert an orthotic and wear a thicker sock. It is a really cute boot with a low profile. If you would like to see how it looks on watch Orphan Black. The character Alison wears it in the earlier episodes. This is how I found the boot in the first place.",
      "rating": 5.0,
      "verified": true,
      "author": "JZ",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Super Cute",
      "text": "I got the real deal! Love them super cute .. I got mine last winter & I’m still wearing this winter & I love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Mutherof4",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Good boot - warm, comfy, waterproof, not clunky.",
      "text": "So far, so good. The interior footbed has already formed to my foot - not sure how long it will wear. I like them very much. They are not huge around the toe box like my Sorrels. They used to have a mulberry colour - wish they still did. THe variations on black, brown and an ivory are really limited. They make so many great colours, why not in this boot? It's only January, but I have no complaints. Warm and comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "ChgoLaw",
      "helpful_votes": 0,
      "publication_date": 20160113
    },
    {
      "title": "Great boots",
      "text": "I absolutely love these boots, I got them for a couple of reasons. Living in the part of California that I do we don't get any snow but within a 2 hour drive to some snow resorts. We have been getting tons of rain this year so I thought I could use them for the rain and for the trips to the snow. I couldn't justify spending the amount that these cost me for just a few trips to the snow, but for rainy days and cold days it helps reduce the guilt. Definitely going to last me a long time, would recommend these to my friends and family members.",
      "rating": 4.0,
      "verified": true,
      "author": "Reading Addict",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "I LOVE THESE BOOTS",
      "text": "I LOVE THESE BOOTS. They took me all around Iceland with warm feet! They are a tad more snug than I would have liked, so I wear them with normal athletic socks as opposed to my wool winter socks, which I probably wouldn't need anyway bc they are so warm! I've walked through puddles in them and they are truly waterproof. Worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Boots for Snow Angels",
      "text": "I could sleep in these boots, they are that comfy! Yet they have rugged construction for use in snow, sleet and mud. These boots are fully lined with generous layer of sheep's wool--I wear them without socks. The soles are athletic type, with plenty of arch support. The wooly tops unfold upwards for extra coverage in deep snow. While the demand made me wait over a month for these boots, they are well worth the wait and the money. I consider them an essential investment for wintry wear, and they happen to be super cute as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Lily Pad",
      "helpful_votes": 2,
      "publication_date": 20150211
    },
    {
      "title": "Beautiful shoes, keeps my feet warm",
      "text": "One of the best buys for me. They run small. I ordered a size 10 and 11, and the 11 is perfect. I wear a size 9 1/2 wide. This cream light tan color is wonderful, i get compliments on these shoes everytime i wear them. They keep my feet warm and i have good traction in them. I would highly reccomend this Adrchomdria boot from UGG. I smile everytime i think of my beautiful boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Geneva",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Buyer Beware",
      "text": "If these are authentic Ugg’s the quality is poor. I ordered the bone color and it appears that they were painted on over the seams. The seams on the top of the boot (at the toe) are not the same color as the rest of the boot, they are almost pink. From a distance, these look great. I really don’t have the knowledge to determine if they are authentic or not. Not only is the quality suspect, but they are just too small.",
      "rating": 2.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Best winter boots ever",
      "text": "I love these boots so much that these are my second pair in a month. I live in the north east and we have been hammered with one snow storm after another this year and these boots have enabled me to walk my 7 miles in the icey streets with no socks and below zero weather and they are warm and comfy.. I'm 59 and these are by far the best pair of functional winter boots I've ever had. I shovel all my own snow and am very active. These boots have kept me from having to mall walk and get fresh air while walking for exercise",
      "rating": 5.0,
      "verified": true,
      "author": "beach girl",
      "helpful_votes": 3,
      "publication_date": 20150210
    },
    {
      "title": "was goin to vermont and needed waterproof boots good for the snow and will keep my foot dry ...",
      "text": "was goin to vermont and needed waterproof boots good for the snow and will keep my foot dry and warm so i turned to these. uggs always live up to their promise of keeping ur feet warm and so comfortable to wear. these boots were definitely waterproof and warm. they are slightly heavier than regular uggs so it is definitely only recommended during snow weathers.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 3,
      "publication_date": 20151122
    },
    {
      "title": "I love my boots",
      "text": "I love my boots! They are extremely warm and my feet stay nice and toasty, In this freezing cold weather. I've have gone through snow and slush and nothing has gotten through these suckers! I am a size 8 and at first, they were a little snug, but now they fit perfectly, once broken in! Thank you UGG for such a durable, reliable, and comfy boot! P.S. Did I mention I LOVE MY BOOTS! Of Course, I did! lol",
      "rating": 5.0,
      "verified": true,
      "author": "Lily",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "It is a really nice looking boot",
      "text": "This was a Christmas gift for my grown daughter, mother of 2, who plays outside a lot with her 2 children in the cold New England winters. I was looking for something that would be really warm but not too bulky and clumsy. It is a really nice looking boot, fit perfectly, comfortable and mostly really warm. My other daughter has had this boot for years and swears by the warmth snowmobiling in the Maine winters. I did buy a half size bigger than her shoe size and she was glad I did. Great boot.",
      "rating": 5.0,
      "verified": true,
      "author": "daisey",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Love the boots",
      "text": "Love the boots. Very stylish and warm and fit as expected. The only reason for the 4 stars is because for the price purchased, I wish they were made in Australia and not in China .",
      "rating": 4.0,
      "verified": true,
      "author": "Euro style lady",
      "helpful_votes": 2,
      "publication_date": 20180122
    },
    {
      "title": "Beautifully made. Feel great!",
      "text": "Having read a lot of other reviews, I’ve gone a half size up with my purchase. The boot does fit a little too big, so I could have gone with my actual shoe size easily. But this will work too. They are very comfortable!!! Also appreciate the fact that they don’t feel and look bulky like most winter boots. Now all I need is snow to test out the warmth of them :))",
      "rating": 5.0,
      "verified": true,
      "author": "Olesya Z.",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Ugg Adirondack II boot",
      "text": "I LOVE THESE BOOT!!! I read a lot of reviews before ordering & am glad I did, as they do run small. I ordered one size bigger than I normally wear & hoped they would be wide enough to fit my wide foot. They do & I love them! These boots fit great...look great....feel great! They are toasty warm in cold weather & are waterproof, although I haven't tested that out except to walk through heavy dew in the brush. They're a bit pricey, but I think the quality will hold up & I'll be enjoying them for many years. So happy with my first pair of UGGs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20131204
    },
    {
      "title": "Love these",
      "text": "I had a of these previously that I wore out completely. These are a little bit narrower even though exactly same model and size, hoping they will relax but otherwise great boots.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Ugg Adirondack boots",
      "text": "I haven't really worn them anywhere except in the house yet so don't know how they will be when I actually put them to the snow/ wintery weather. They feel comfy but the shoe ties are somewhat of a nuisance because I really have to get them loosened up so I can't get my feet in them. They seem nicely made and will, no doubt, last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Buzybtwin",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "Best Boots Ever",
      "text": "My most favorite boots EVER. Totally worth the money. Waterproof and super warm. Very comfortable. These were my go-to boots all winter. I have a brown pair and a black pair. Ugg makes great, long lasting boots. I’m a huge fan and I totally recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "LaurenLovesDogs",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "my wife loves them",
      "text": "Got these for my wife who desperately needed some nice warm winter boots. they came highly recommended from a co-worker who has more boots than than the US army. Well, my wife absolutely loves them. She says they are the most comfortable and warmest winter boots she has ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "FAKES",
      "text": "These were FAKE boots!! Felt something wrong with them as they were a bit stiff and not like the ones I had tried on in a local store. After looking at them closer there was a split in the leather between where the laces were and the top of the boot. An actual open hole which I did not expect from UGG. Other boot had a silver line showing in same place apparently a sewing guide. Poor sewing on both boots. Will not buy anything UGG on Amazon again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "I get all warm and fuzzy",
      "text": "Wore these all over Europe over during winter where the weather got as low as -1oC/30oF. The fuzzy lining kept my feet warm and they are super comfortable to walk over cobblestones or whatever terrain you're walking on. I had no problem walking in puddles or over snow. I'm usually a size 7 but like the extra .5 for thick socks.",
      "rating": 5.0,
      "verified": true,
      "author": "Meryl V.",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Cute Warm & Cozy",
      "text": "YES and YES I would definitely buy these boots they are worth the money. I order these boots last week and got them today I couldn’t wait to get home and try them on WOW they feel so good on my feet and look good too. And yes you don’t really need to where sock if you don’t want too they feel that warm. The weather forecast in Boston MA is saying that we are going to get snow over the weekend I can’t wait to where them they will look so fashionable with my clothes. All the reviews are pretty much saying the same thing. That these boots are AWESOME!!!!!!!!!!!!!!!!! BIG THANK YOU AMAZON",
      "rating": 5.0,
      "verified": true,
      "author": "loren",
      "helpful_votes": 0,
      "publication_date": 20130220
    },
    {
      "title": "Great in -10 degree weather 10hr shift",
      "text": "Been working outside at the airport in -10 degree weather. My normal winter boots did not cut it. The warm shearling on the inside is perfect for any temp down to zero. Below that add a second pair of socks if you’re spending hours outside like I do at work.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabrielle",
      "helpful_votes": 2,
      "publication_date": 20180108
    },
    {
      "title": "I noticed they are slightly larger around the ankle/top of foot but they are ridiculously comfortable, warm & weather/water resi",
      "text": "I went to the store to try these on prior to purchasing through Amazon. I noticed they are slightly larger around the ankle/top of foot but they are ridiculously comfortable, warm & weather/water resistant. Besides being cute, they are totally functional for jersey winters.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerri Guerriero",
      "helpful_votes": 4,
      "publication_date": 20160211
    },
    {
      "title": "Warm and waterproof for harsh winters",
      "text": "These are great boots, I live in a place that feels like the North Pole (we have snow on the ground for several months), and these boots are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Ang",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Warm and snuggly",
      "text": "These shoes are snuggly and definitely warm. Well made for rainy, slushy, icy weather. They fit a bit narrow on the top and don't provide the best arch support but I have a very high in-step. I wear a 8.5 and they are just a tad large but am assuming the size 8 would have been a just right fit which could be tight as well. Otherwise, I recommend these shoes. Definitely a great investment.",
      "rating": 4.0,
      "verified": true,
      "author": "M.E.Z",
      "helpful_votes": 3,
      "publication_date": 20160127
    },
    {
      "title": "Great snow boots!",
      "text": "These boots got me through two New York winters! I always felt warm and I never worried they would leak. They’re also super comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Astudent",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Worth every cent",
      "text": "Made extremely well; heavy-duty/durable; warm and water-proof; true to size. I've only had them about a week, but in Michigan winter's, they are ideal and I am thoroughly pleased with the performance. I purchased the otter color, but think I would have preferred the sand. I think the sand would look a bit more feminine, but if you don't care about that, the otter is a good color to go with black or brown outer-wear. I highly recommend these boots. They are a bit pricey, but you won't be sorry you spent the money.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Thebert",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "Love, love, love!",
      "text": "Love, love, did I say love???? These are very comfortable on. Order 1/2 size up. If you have wide feet. They are so very soft and warm! Happy birthday to me!",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "They are beautiful and oh co comfortable but they do run small",
      "text": "They are beautiful and oh co comfortable but they do run small. I have a huge foot and could not fit in to their biggest size, size 12 (even though i usually wear a 11 and sometimes a 12. I found some almost identical in mens, also UGGs so wish me luck!",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica Maas",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "the boot is amazing and comfortable",
      "text": "After reading reviews and seeing the boots run big, I went with a size up for my normal size. I would not choose this option for the next time as they are just too big for me. Other then that, the boot is amazing and comfortable! And warm!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn M Taylor",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Damaged and a long wait",
      "text": "I got these boots after 3 shipment dates. I finally got them and they have a scratch on them. not worth the hassle of sending them back because who knows when I’ll get my money back. I’ll just suck it up as a loss I suppose.The boots are very nice looking,feel great and appear to be authentic uggs. I’m just very disappointed after waiting so long the boots are damaged.",
      "rating": 1.0,
      "verified": true,
      "author": "Tosha",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Clunky",
      "text": "I had been wanting a pair of these for so long and finally splurged. I somewhat regret having done so as they're a bit large and clunky. Ugg boots are a favorite for winter, but I am not entirely happy with these.",
      "rating": 3.0,
      "verified": true,
      "author": "Q as in Queen",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "We must have 10 pair of Uggs in the house and we love them all",
      "text": "Bought these boots for my 18 year college daughter. She was a bit miffed when she opened the box and I didn't get her the boots she asked for but when she put them on she immediately changed her mind. After wearing them for a month or so she loves them! We must have 10 pair of Uggs in the house and we love them all!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Anderson",
      "helpful_votes": 4,
      "publication_date": 20150224
    },
    {
      "title": "True to size!!",
      "text": "I was hesitant to purchase my true size due to other reviewers saying to order half a size up. I have several other UGG shoes that are all size 8 so I decided to order my true size and I'm glad I did! The boots fit great even with socks on (although they are so warm socks are unecessary). I have about half an inch between my toe and the tip of the shoe. If you have other UGG products (mine are as old as 2009) then stay true to that size. You can't go wrong!!",
      "rating": 5.0,
      "verified": true,
      "author": "Texas",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Love the boots",
      "text": "Love the boots, warn and cozy and not to heavy, if you have to run in these you can. They do run small, I normally wear a size 8.5 but I had to get a 9.5 so I suggest you go up a whole size. Good quality, well built, and you should be able to rock these for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Trinket",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Nice Winter boots!",
      "text": "Great boots but I have not worn them out yet. I ordered a whole size larger than my shoe size so as to accommodate a medium cushion sock and the fit is perfect. They do not feel too heavy or constricting. I think they will be very warm once the snow starts. I was lucky to get a great deal on these.",
      "rating": 5.0,
      "verified": true,
      "author": "alfataz",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Sufficient for cold days",
      "text": "Warm boot and comfortable. I wear an 8 and even though it seems to run a little small it fit better than an 8/12. I just wear thin socks because the furry inside absorbs a little of the foot space.",
      "rating": 4.0,
      "verified": true,
      "author": "Dea",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Great but Photo color off",
      "text": "These boots are definitely as described and great quality that you expect from UGG. The product photo for 'Otter' is definitely off. They are the 'Chestnut' color. Significantly lighter than the photo.",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Money well spent NO REGRETS!!",
      "text": "Excellent purchase, money well spent. These boots are very warm and mines fit perfect. I am a true size 9, most boots I wear 8.5, so I was skeptical about ordering a 9 in this boot. Glad I did the fit is comfortable but I do not wear socks, I wear opaque stockings all winter. In Detroit, we have been hit with some good inches of snowfall and I shovel and walk through snow and stand out in the cold but my feet stay warm and dry. I keep them on during an 8hr desk job and my feet are never hot...Kudos to UGGS!!",
      "rating": 5.0,
      "verified": true,
      "author": "Justand",
      "helpful_votes": 3,
      "publication_date": 20150214
    },
    {
      "title": "So glad I purchased these just in time for winter",
      "text": "So glad I purchased these just in time for winter. Keep my feet so warm and i don't even need to have socks on. No sweating, warm, and comfortable for all day use on my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "WW1977",
      "helpful_votes": 2,
      "publication_date": 20161207
    },
    {
      "title": "Best buy",
      "text": "Best boot for Syracuse winters. Keeps my feet warm while hiking and standing outside With my students for bus duty. Highly recommend. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilal830",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "A Bit Snug, but comfy",
      "text": "Warm and comfy. Excellent shipping time.....I normally wear a size 7.5, but I purchased a size 8.5 for comfort- and they fit a bit snug. There was also a weird stain on the back of the boot???? maybe a dye",
      "rating": 4.0,
      "verified": true,
      "author": "Miss B.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Love these boots!",
      "text": "I love the color and the quality! I bought a pair directly from Ugg in black and when I saw these in grey at a great price, I had to get to get them. So glad i did too because I love this color a lot better. They are warm and comfortable. If I can find a half size bigger I would get a 7.5 instead but these are still great and I don't need thick socks anyway as these boots kept my feet very warm. They held up great to the last winter we had.",
      "rating": 5.0,
      "verified": true,
      "author": "Gracie Kozak",
      "helpful_votes": 0,
      "publication_date": 20141008
    },
    {
      "title": "great warmth",
      "text": "Excellent boot. I wear a 9.5 and have a somewhat wide foot. So, when I ordered this boot I chose a 10 assuming I would be wearing thick wool socks with it and would need the extra room. Um, its still a lil big but I don't mind as my feet stay completely dry and warm. I live where it frequently gets 0 or below in the winter with snow, freezing rain etc and am perfectly happy with this attractive yet functional boot.",
      "rating": 4.0,
      "verified": true,
      "author": "CH",
      "helpful_votes": 0,
      "publication_date": 20131216
    },
    {
      "title": "Couldn't ask for better cold weather boots",
      "text": "Unbelievably warm and comfortable - I drive a pilot car, so at times I'm in some serious cold and/or snow waiting with a load. I've never had my feet get cold or wet. Plus, they are actually really cute! They do have great traction; I'm a total klutz and I've only slipped once (wet ice in Iron Mountain, Michigan). For the conditions I've found myself in at times, they were exactly what I was looking for. They fit as I expected them to; I put them on and wore them straight out of the box with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Warner Sibling",
      "helpful_votes": 3,
      "publication_date": 20160122
    },
    {
      "title": "warm & comfy",
      "text": "I love these boots. They are very warm and comfortable. However, I'm giving them three stars for two reasons: the tab on the back of the boot that is supposed to help you pull the boot on, ripped after a week of wear and the boot is a little small. All of my other UGGS are size 7 & fit fine..although I don't wear socks with them. Maybe that's the reason why they fit small. I like wearing socks with my winter boots.",
      "rating": 3.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20150206
    },
    {
      "title": "They are simply more comfortable for walking",
      "text": "I tried the Kamik Momentum and Columbia Ice Maiden snow boots before finding these UGG's. They are simply more comfortable for walking, more warm in ice and snow, fit and look better! Love them!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Lopez",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Disappointed",
      "text": "These boots are stylish and water proof, but they do not do a good job at keeping your feet warm. They keep your feet warm for about 30 minutes in mild snowy conditions but after that your feet go numb. Disappointed because they are supposed to be high quality and they are pretty expensive.",
      "rating": 3.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "UGG  Adirondack Boot II",
      "text": "I love this boot!!! Fits as expected and kept me warm which was totally unexpected. I also like the color which is heavy cream color rather than the pinkish color shown in the picture. They match my coat. I've had such poor luck with boots in the past. I was out today in 10degree F weather with 40mph winds. The ONLY part of me that was not cold were my feet. Toasty all day long. I thoroughly recommend these boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Crochet Hook",
      "helpful_votes": 0,
      "publication_date": 20140124
    },
    {
      "title": "Great Boots!!",
      "text": "GREAT boots. These UGGS got me through a tough Northeast winter in 2016. Digging 20+ inches of snow was great. My feet were warm and toasty and not wet when I took them off.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCharstar",
      "helpful_votes": 3,
      "publication_date": 20161103
    },
    {
      "title": "Fakes",
      "text": "I discovered this is not made by UGG. I am very disappointed. If I would’ve known this when I first bought it I would’ve returned them and bought a real pair of UGGs",
      "rating": 1.0,
      "verified": true,
      "author": "Sh",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Stylish Authentic UGGs, (but run very small)",
      "text": "They are very cute and the ones we received or authentic Uggs without a doubt. Well made and very stylish. However they run easily a full size small.",
      "rating": 3.0,
      "verified": true,
      "author": "CLD",
      "helpful_votes": 2,
      "publication_date": 20170122
    },
    {
      "title": "In loooove with the UGG!",
      "text": "Holy shipoopy, I looooove these boots. Warm, cozy, waterproof, nice tread, easily wiped off. I used these in Alaska when we lived there and wore them all winter everywhere I went. Yeah, they're great, I highly recommend them and I'd buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Too small",
      "text": "Just received them yesterday and tried them on this morning and left one is way too small and tight. Leather was tight and hard too. Will return and just go to stores shoe shopping after Christmas. Def. not keeping as the price was $ 230.00. Wish they had a half size larger in my size but they didn't :(",
      "rating": 2.0,
      "verified": true,
      "author": "pmeyers",
      "helpful_votes": 2,
      "publication_date": 20161221
    },
    {
      "title": "Love, love my boots",
      "text": "Love, love my boots. I have been searching for a long time for the perfect winter boots. I have purchased other brands and had to return them because the bottom part of the boot was so stiff that it hurt my heel. These boots are super comfortable and the bottom part is flexible. Very warm and waterproof. I finally found my boots",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Would recommend to a friend!",
      "text": "Comfortable, warm, and waterproof. We got a mini blizzard of 9 inches right after I received these! Seem to be great quality that will last for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Great Winter Boots",
      "text": "these were a gift for a woman with small feet (5.5), big arch and high instep-it's had to find shoes and boots that fit comfortably. But these are great!! Great quality and fit. Happy all around!",
      "rating": 5.0,
      "verified": true,
      "author": "Ktqt789",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "... size to accommodate my thick socks and they fit great! I absolutely LOVE this boot",
      "text": "I went up a half size to accommodate my thick socks and they fit great! I absolutely LOVE this boot! I've worn them all day at work as well as hanging out in Downtown Chicago New Year's Eve and they are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Also not positive I love the vibram soles as they make the design a ...",
      "text": "Cute but toe hit the end of them in this size. Also not positive I love the vibram soles as they make the design a bit clunky. So for the price not perfect enough which is why I returned them",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Great winter boots!",
      "text": "I love these boots. Because of others comments, I ordered a size up since the inside is so thick and warm, plus I wear thick socks when I wear them, especially out camping and sitting by a campfire. They are the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue Richardson",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Warmest Boot Ever!",
      "text": "These fit true to size! I LOVE these boots. They are so warm. Worth every penny. I was worried about spending so much, but very glad I did. My feet do not get cold anymore!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Brumley",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Highly recommend following the UGG sizing chart (on UGG website)",
      "text": "Highly recommend following the UGG sizing chart (on UGG website). Because of the sheep's wool lining I ordered a full size higher (9.5) than my regular shoe size. Fit is perfect ... these boots are very well made and WARM. I wear with heavy winter socks and there was no break-in required. This product is worth the higher price.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Traveler",
      "helpful_votes": 0,
      "publication_date": 20160405
    },
    {
      "title": "Comfy cozy winter boot",
      "text": "Beautiful warm boot fits great true to size. If you want to wear a thick sick go up a half size. Just in-lace laces to get into it easily. Comfy fleece all throughout.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 2,
      "publication_date": 20160212
    },
    {
      "title": "A bit on the big side",
      "text": "Love these but just a tad too big. Didn't want the hassle of returning. Glad I didn't go with the size the measurement told me too or I'd really be in trouble",
      "rating": 4.0,
      "verified": true,
      "author": "Cyndi A Truscott",
      "helpful_votes": 5,
      "publication_date": 20160202
    },
    {
      "title": "Very comfortable",
      "text": "Very comfortable. Wore it all day when I got it and never had any issues. Keeps my feet warm. Definitely worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Damaged!!",
      "text": "These arrived totally damaged!! It’s like someone tried to color in the stitching to match the boot. Looks so tacky!!!",
      "rating": 1.0,
      "verified": true,
      "author": "NinaG",
      "helpful_votes": 2,
      "publication_date": 20171231
    },
    {
      "title": "Buy with confidence. These are real Uggs❕",
      "text": "After receiving my Adirondacks I was a little confused about if they're real or not. I usually get my Uggs from the Ugg store, first time buying online. I went to the Ugg website look through the official retailers where Amazon and 6pm are listed. First thing I did was scan the qr and voilà❕ Yes, they're genuine Uggs. Perfect boots, perfect price😉",
      "rating": 5.0,
      "verified": true,
      "author": "paulina isabella scott",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Five Stars",
      "text": "Awesome pair of boots! They fit like a glove met my expectations",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Creel",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "These look great, but the inside edge where the material of ...",
      "text": "These look great, but the inside edge where the material of the cushion leaves a gap at the edge. My toes felt like they were surfing in books. I could not wear them.",
      "rating": 2.0,
      "verified": true,
      "author": "Stacy H.",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "comfortable.",
      "text": "I never had any desire to buy Uggs...changed my mind! Needed a warm shoe for a all day outdoor event coming up...been wearing them around town, unbelievably warm, lightweight, comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen K. Riddel",
      "helpful_votes": 2,
      "publication_date": 20170116
    },
    {
      "title": "Have to break them in",
      "text": "I like how warm it is; although they were tight at first, after wearing them all day during school, they eventually felt comfortable enough to walk in",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "These boots are my absolute favorite EVER! Extremely warm",
      "text": "Ugg recently changed their sizing...i used to be an 8.5 or 9 but in the last year I've had to order 10. These boots are my absolute favorite EVER! Extremely warm, comfy, and best of all waterproof!! Just make sure you get your correct size.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "She has never had boots like these and were well worth the money",
      "text": "My wife loves them. She has never had boots like these and were well worth the money. If anyone is looking for quality and price, please do buy from these people. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Yottabytes Consulting LLC",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Her fourth pair of Uggs. Never disappointed.",
      "text": "Valentine's gift for my lovely wife. She LOVES them. Warm and toasty all day long out in the tundra of Massachusetts, Alaska. :)) I've gotten two pair of Ugg Slippers and two pair of boots. She is very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Couto",
      "helpful_votes": 3,
      "publication_date": 20150219
    },
    {
      "title": "So I was a little disappointed, that these were not from the original company",
      "text": "I have a friend who own a authentic pair with lamb skin, I had planned on buying a pair in 2016, then I got real busy and I forgot to visit, the web sight, my mind and now these will do, So I was a little disappointed, that these were not from the original company.",
      "rating": 3.0,
      "verified": true,
      "author": "Nita  Reeda",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Kicks",
      "text": "I love these, so warm and comfortable. I wish I can buy them again. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "HFeesah",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Five Stars",
      "text": "These are amazing!! Worth the money. I don't wear socks with them on occasion. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "JOJO",
      "helpful_votes": 0,
      "publication_date": 20180214
    }
  ],
  "product_meta": {
    "title": "UGG Women's Adirondack II Winter Boot",
    "description": "Removable and replaceable UGGpure insole that keeps feet dry and cozy. Exclusive vibram outsole and a repeating lug tread pattern that provides maximum surface contact for traction and malleability at the footbed natural flex points. If you are unsure which shoe size to purchase, please follow the following steps-1.Draw a straight line, longer than your foot, on a piece of paper. 2.Place the paper on a flat surface. Stand on the line with your heel and longest toe centered on the line. If measuring a child's foot, it may be easier to hold the paper up to their foot. 3.Place a mark on the line at the tip of the longest toe and at the back of the heel. 4.Repeat steps 1-3 for the other foot. 5.Measure the distance between the marks. Taking the larger of the two measurements, use the conversion chart to find your correct shoe size.",
    "rating": 4.5,
    "feature_bullets": [
      "100% leather",
      "Imported",
      "Dyed Sheep Fur (Fur Origin: United States/United Kingdom/Spain/Ireland/Australia)",
      "Rubber sole",
      "Shaft measures approximately 7\" from arch",
      "UGG 1906 Adirondack Boot Black Grey SIZE 5"
    ],
    "categories": [
      "Snow Boots",
      "Women",
      "Shoes",
      "Outdoor",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 130.74,
    "specifications": {}
  }
}