{
  "website_summaries": [
    {
      "verdict": "6 brilliant blue LED lights and plenty of accessories make this endoscope perfect for home improvements, auto repairs, and anything that requires a tiny camera.",
      "pros": [
        "Scope can get into tight and darkly lit spaces",
        "Accessories – such as magnet and hook – come with an storage case",
        "Comes with 1.5 foot cable and waterproof camera",
        "Picture is very clear",
        "Saves hours of work for many users",
        "Customer support is excellent"
      ],
      "cons": [
        "The WiFi can be a bit spotty and may require an occasional reconnection",
        "Battery runs out faster if using light on full power"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Sporting an extra-long cable, a wide level of smartphone compatibility, top-tier resolution, and an inexpensive price, this inspection camera is certainly worth your consideration.",
      "pros": [
        "Extra affordable",
        "Excellent 1280p resolution",
        "Long 11.5-foot flexible cable",
        "Waterproof",
        "Works with iOS and Android via WiFi",
        "Can connect to multiple devices at once"
      ],
      "cons": [
        "While this model doesn’t include a zoom feature, there is plenty to appreciate for the price"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It saved me hundreds of dollars!",
      "text": "I had a water leak in my wall. I didn't know where it was and the Endscope enabled me to find it by drilling 1/2 inch holes in the wall. I was amazed when I found the water pipe with the hole in it (see image). Hiring a plumber could have cost me over $500 , but I was able to isolate the problem and fix the leak for less than $100 (including the cost of the scope).",
      "rating": 5.0,
      "verified": true,
      "author": "Zooman",
      "helpful_votes": 381,
      "publication_date": 20171123
    },
    {
      "title": "Diesel proof too!",
      "text": "Worked perfectly to help me get a gas can protector cap out of my tractor gas tank. Handled a half hour deep in diesel gas, no problems!",
      "rating": 5.0,
      "verified": true,
      "author": "IndianaBowhunter",
      "helpful_votes": 248,
      "publication_date": 20170915
    },
    {
      "title": "The required app has 2 stars and doesn't work",
      "text": "Ok, you got me, the 4-5 star reviews sucked me in... and then I realized the REQUIRED app has 2.1 stars. How is this possible? If only 2 of 5 people can successfully use the app, then there's no way almost 5 of 5 people love this product. Has to be a scam. So anyway, I downloaded the app. Spent 30 min trying to figure it out (it didn't work, and i'm moderately tech-savvy) and decided to send back for a refund. Would NOT recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Hazard",
      "helpful_votes": 64,
      "publication_date": 20180823
    },
    {
      "title": "Don't buy this if you need it for an immediate project",
      "text": "I spent many hours trying to get this to work with some combination of: either of two iphones, a Fire tablet, or a Windows 7 computer; and two different app stores. I never succeeded. The instructions are terrible. Because I needed to get my home maintenance job done, I gave up, went to Home Depot, and bought an endoscope for $100 that has a built in display and doesn't require connection to some other device. The Depstech tool may a god thing. Perhaps I could get it working in another few hours. But putting electronics configuration in series with real work proved to be a poor idea.",
      "rating": 1.0,
      "verified": true,
      "author": "David Walden",
      "helpful_votes": 56,
      "publication_date": 20180528
    },
    {
      "title": "This is a must have product for progressive ammo reloaders. I love this lil camera",
      "text": "I bought this inspection camera for my Dillon XL650 bullet press to be able to inspect brass bullet cartridges while reloading them. It does a fantastic job in my humble opinion it really enhances my ability to resolve issues with primers that did not get ejected or brass that has issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Martorana",
      "helpful_votes": 209,
      "publication_date": 20170407
    },
    {
      "title": "Garbage",
      "text": "Absolute china garbage. Typical cheap product roulette, worked ok for 10 minutes. Turned it off, and could never connect to it again. Reset button doesn’t work, uninstalled app and reinstalled app. tired of this cheap china garbage, enjoy the return, don’t bother asking me if I updated my phone os or ask me to modify my router options to pretend you want to help, manufacture knew this was barely working when they designed and shipped them",
      "rating": 1.0,
      "verified": true,
      "author": "oggi",
      "helpful_votes": 44,
      "publication_date": 20181215
    },
    {
      "title": "Blurry, foggy image. Never could use it.",
      "text": "Blurry, foggy image. The seller actually refunded on it, to their credit, without being asked. But the device is still of no use to me whatsoever. It just sits in a drawer. With a much higher quality lens it would probably be fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Sick of being tricked",
      "helpful_votes": 31,
      "publication_date": 20191217
    },
    {
      "title": "Battery only last a couple of minutes. And if ...",
      "text": "Battery only last a couple of minutes. And if I turn off. It won't turn back on unless I put it on the charger.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Kendricks",
      "helpful_votes": 42,
      "publication_date": 20171229
    },
    {
      "title": "Works for 13 seconds at a time...",
      "text": "Took a while to get this up and running. The instructions are written in an unknown language - sort of a cross between English, Chinese and Pig Latin. I finally got the thing working on my Android phone, but the camera freezes every 13 seconds. I have to turn off the camera (which disconnects the camera from the phone's WiFi), close the app, restart the app, turn on the camera, manually join the WiFi to the camera, and all for another 13 seconds of lousy quality video. Returning this thing as fast as I possible can.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 25,
      "publication_date": 20181203
    },
    {
      "title": "This thing Rocks",
      "text": "Really impressed with the Depstech Wifi Endiscope. Thought it was a great buy. Helped me unclog my Dryer vent... Really well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "superchuck333",
      "helpful_votes": 342,
      "publication_date": 20170130
    },
    {
      "title": "This Endoscope is fantastic!",
      "text": "This thing is really great. At first, I could not figure out how to increase the intensity of the light. However, there is a little dial on the main box/end piece of the Endoscope. Once turned, the light was bright enough to \"see\" down my drain. My issue...Drain Flies. This product help me identify where those little \"you know whats\" were located. It was driving me crazy as to where these things were coming from and this product found them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. T",
      "helpful_votes": 50,
      "publication_date": 20171119
    },
    {
      "title": "Worth Every Penny.",
      "text": "This is my second, and different endoscope I've purchased. I must say this is worth every extra dollar over all the others. They aren't joking about the benefits of 30fps, it is like night and day. The enhanced 30fps microchip is extremely helpful if you are using this to look inside a wall, without it, if the camera moves quickly it is hard to tell which way it moved so you can make a correction. The video is more like a movie than a skippy time-lapse video. The wireless transmitter is much stronger than my last one, I use this as a security camera at night, the signal goes through several walls, its great! I recommend this big-time.",
      "rating": 5.0,
      "verified": true,
      "author": "Beckwith",
      "helpful_votes": 24,
      "publication_date": 20171111
    },
    {
      "title": "Phone application broken beyond usefulness, no pc support. Useless.",
      "text": "App doesn't work 99.9999% of the time, look elsewhere. They totally ripped off auky(and whoever they ripped off) word for word on the packaging. Is that a joke? Feels Terrible, low grade abs... Nice length, but attachments are gimicks. Good waste of money. Zero support for proper devices, relys on wifi, needs to be charged way too often, over priced. Ect.... Ect... Ect... Why.",
      "rating": 1.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 17,
      "publication_date": 20181016
    },
    {
      "title": "Horrible picture quality inside and outside",
      "text": "Horrible picture quality inside and outside. can barely make out your face when it is right in front of u",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Paulsen",
      "helpful_votes": 24,
      "publication_date": 20180104
    },
    {
      "title": "Best Borescope I've tried in this price range",
      "text": "Con First: WiFi only connection, which ties up internet access on my phone while connected to this scope. Not a huge deal. That said, I've tried two other USB OTG connection borescopes in this price range. This one is easily twice as good as either of those. The picture is much clearer. I used this to retrieve a bolt deep in the bottom of the hydraulic case of my tractor, taped to a retrieval claw. Saved me having to tear it all apart just to find the bolt. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JMD",
      "helpful_votes": 111,
      "publication_date": 20190502
    },
    {
      "title": "Get new version!!!",
      "text": "Bought it to make cylinders/valves examination in engines via spark plug holes. The scope head is small so it goes into cylinders no problem. Valves examination with 45 degree angle mirror attachment - forget about it. It's Impossible. Image quality is no good. Returning it. UPDATE!!! This company stands for their products! Get new version of this endoscope!!! It’s awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Baleia",
      "helpful_votes": 22,
      "publication_date": 20170520
    },
    {
      "title": "Password problems",
      "text": "This seems to be a very good uni, resolution is excellent and seems to be soild !! Be sure to use only the password that is printed on the sticker that is fastened to the device and don't try to \"modify\" it as seems to be suggested when you open the app, if you do ....you're screwed and the camera will never work again, at least that was my experience. The seller was very good in making it good with me. GREAT seller !! Thank you !!",
      "rating": 5.0,
      "verified": true,
      "author": "Del",
      "helpful_votes": 13,
      "publication_date": 20170504
    },
    {
      "title": "Great inspection camera!",
      "text": "All I can say is wow! Wish this was a 5mm camera end but the 8mm is fine. Connects easy to iPhone and takes great images. Fits in spark plug hole for cylinder/piston inspection.",
      "rating": 5.0,
      "verified": true,
      "author": "kyle",
      "helpful_votes": 35,
      "publication_date": 20171005
    },
    {
      "title": "A good product for the price",
      "text": "I used this with a iPad and it produced surprisingly bright and sharp images. The depth of field is very limited - between about 2 and 6 inches - but within that range it works very well. The built in LEDs are plenty bright, in fact I never used them at full brightness except when the battery began to run down. For the price it seems very well built. I had no problems with setup or maintaining a solid WiFi connection over a distance of a few feet. The battery life is pretty limited and it takes a long time to charge, but that wasn't a problem for me.",
      "rating": 4.0,
      "verified": true,
      "author": "JimMar",
      "helpful_votes": 10,
      "publication_date": 20170823
    },
    {
      "title": "Quality matters",
      "text": "It's light weight and otherwise cheesy like many things from China. The app worked well which was the biggest surprise of all but the quality of the image was marginal. I was looking for the end of a \"mule\" tape in a conduit so I could grab it with a claw I have. It was a lot to manipulate, scope, phone, claw and I dropped the scope a short distance. The shock load of the fall ended the WiFi - dead, dead, dead. It wasn't a bad fall and should have been expected in the design requirements but I guess not. Caulk it up to another cheesy Chinese product Amazon seems to like selling.",
      "rating": 1.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 8,
      "publication_date": 20181003
    },
    {
      "title": "Not quality expected",
      "text": "Not very good depending on intended use. It does provide a picture but not the expected resolution as set in app. Even at 1920x1080 the picture is poor. So it isn't good for inspecting internal wear on engine parts but will provide a clear enough picture to locate plumbing drain blockages or retrieve a ring that fell down open drain. Just be aware of that and if you are a mechanic, engine builder, etc buy something more expensive i tended for those applications.",
      "rating": 1.0,
      "verified": true,
      "author": "David M Vandenbush",
      "helpful_votes": 3,
      "publication_date": 20200822
    },
    {
      "title": "I like it! First weekend I got it I used ...",
      "text": "I like it! First weekend I got it I used it to check out a blown up kx125. The mirror attachment for the camera kind of sucks though, the straight view is much better. Easy to connect to.",
      "rating": 5.0,
      "verified": true,
      "author": "Daven J Wood",
      "helpful_votes": 38,
      "publication_date": 20170415
    },
    {
      "title": "Doesn't work after only one use.",
      "text": "I bought this endoscope in July. I wanted it primarily to look into sink and tub pipes to identify any problems before calling a plumber. I used it once in July. I went to use it again tonight and it's totally no good. The light comes on, but it doesn't connect to the computer or phone. In \"settings\", I can't change or modify anything. It won't connect to wifi. I have a cheaper, flimsier endoscope from another company that at least works, although the pictures aren't as clear as I would like. Anyway, I get an error message when I try to connect to my phone or computer. Wish I hadn't wasted my $35.00 on this piece of s--t. 😡",
      "rating": 1.0,
      "verified": true,
      "author": "Marcy James",
      "helpful_votes": 5,
      "publication_date": 20190113
    },
    {
      "title": "Work perfect one time quickly became non functional.",
      "text": "Worked great out of the box, charged it, started it up, connected to the wifi network, and ran the app. Got a nice clear picture. Using it to see behind the engine of my truck for an automotive repair. It began freezing up. Then I'd wait... and wait... and it came back on. Which made what I was trying to accomplish take way longer than it should have. Then when I went to use it again to finish my work... nothing but a blank screen. Connects to the network just fine. App launches but won't actually connect to the device. Returning as soon as possible",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190203
    },
    {
      "title": "Good value.  Weird video formatting issue.",
      "text": "I bought a $200 unit from a big box that didn't have a clear picture and was just 'ok'. I returned it and ordered this product. It was less than 50% of the cost of the other and 200% better! Great quality picture and simple interface. My only gripe with it is that if you save the videos it can take, they aren't in a file format supported by iPhone. Which is a pain - can be solved by downloading a video conversion app. But why? Depstech - fix that feature and this is 5 stars and I am raving. As is, satisfied and feel like I got good value.",
      "rating": 3.0,
      "verified": true,
      "author": "Dave K",
      "helpful_votes": 8,
      "publication_date": 20180404
    },
    {
      "title": "Did not like. (read details)",
      "text": "I returned this item. The screen was not as clear as advertised. It was hard to control (really no control). It can be useful for some applications I guess. I tried several applications and I was not impressed. There was not focus point. It was hard to see exactly where the scope went. I realize that the cost was a big factor because if you want a scope that has controls, you will pay allot more money. For me the length was probably too long for any real useful application and the lack of focus was not good and was a deal breaker. Sorry for the not so good review.",
      "rating": 2.0,
      "verified": true,
      "author": "GI consumer",
      "helpful_votes": 8,
      "publication_date": 20171004
    },
    {
      "title": "wifi speed too slow",
      "text": "When I tried to connect my phone to the wifi on the camera, it found it easily enough but said it was waiting for the internet signal to improve. When I checked the speed for that connection it ranged from 65 to 72, even after fully charging and making multiple attempts. Simple fact is that this device is not going to work for me. I am going to return it. After searching online for more about this model (WF010-3.5) I realized that this is a fixed focus that will not focus at less than 1.5 inches, and while it claims to be submersible, it has a very limited exposure time. Not really submersible. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "SHEILA",
      "helpful_votes": 4,
      "publication_date": 20190205
    },
    {
      "title": "DO NOT BUY THIS CAMERA CANT SEND SIGNAL WELL THROUGH IT'S WI-FI",
      "text": "If its in any sort of lighting it looks terrible. I turned off all cellular data, used the camera's wifi, turned off the wi-fi inside the house, tried different resolutions, etc. It just keeps making a ghost image that flickers and changes on the screen. Making it impossible to use. No option to connect it to the phone with a cable. Going to be returning. Will stick to just regular inspection cameras that don't connect to a phone. Clearly this technology hasn't been perfected yet.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190318
    },
    {
      "title": "Very pleased",
      "text": "I had a Depstech for an older Samsung S6, and it was terrific. When I upgraded to an S9, I faced the new USB-C. This new Depstech solves the problem completely with the wifi version as well as the USB-C adapter. I have used the cam for everything from checking inside birdhouses, to looking inside walls and examining the inside of my mouth when I've had dental surgery! Very handy gadget to keep around.",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Reviewer",
      "helpful_votes": 4,
      "publication_date": 20181115
    },
    {
      "title": "UPDATE: Disappointing out of focus and nonfunctional applications",
      "text": "Update: The seller sent a replacement of the newer design. Camera focuses better now. Feeding it down a drain or into a vent and trying to see is still hard. A skill to learn how to maneuver it correctly. I'm pleased with the newer design. Disappointing. Thing doesn't focus at all leading to everything you trying to do just being a black or white fuzzy mess. Don't think you're going to be able to do anything with this. App and connection are actually well and works smooth.",
      "rating": 3.0,
      "verified": true,
      "author": "Dodds",
      "helpful_votes": 4,
      "publication_date": 20180521
    },
    {
      "title": "Good for a few uses. Then toss.",
      "text": "I build or fab just about anything. I also buy tools constantly. This is my second sub $100 scope and both work ok for the first few times. Its always in its case in a safe place. Definitely handy and pays for itself fast at its price level. But really. I want it to work as ok as it does for more than a few times. Build quality is pool and connection is shoddy to none at this point making it almost useless and has me looking for another without spending $500+ for something I so rarely use.",
      "rating": 1.0,
      "verified": true,
      "author": "DAVID",
      "helpful_votes": 2,
      "publication_date": 20200716
    },
    {
      "title": "Defective?",
      "text": "Followed all the steps carefully, multiple times, on multiple phones. Tried resetting the unit, can't get it to work. Wifi network shows up in the phone, and I can connect to it and it accepts the password, but the unit just keeps blinking the blue LED about once per second, no communication traffic is indicated by the LED. The Depstech ap launches, and when I click \"Start\" it gives an error that the device is not connected. When I made the purchase I received multiple messages from the vendor promising to help if there was any issue, and stating how important my satisfaction was... however when I made multiple requests for assistance I received no response. I'm returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Ric Turner",
      "helpful_votes": 2,
      "publication_date": 20200709
    },
    {
      "title": "Understand why it needs WiFi.  But why does it need internet (connect to cloud) to work?",
      "text": "First, the application didn't work. And how this thing itself can have such a high rating when its app is barely 2-stars makes no sense. Second, it not only needs wifi access to the camera, but it want to *spy* on you by forcing you to connect to internet. Okay, what if you want to use this somewhere you dont have internet? Can't be used. Third, the camera at end is GIAGANTIC. You'll have to make at least 1/2\" or larger hole to get into where you want to look.",
      "rating": 1.0,
      "verified": true,
      "author": "Groundhog Day",
      "helpful_votes": 2,
      "publication_date": 20200524
    },
    {
      "title": "Works well enough if you follow instructions",
      "text": "It needs an app, and a proper charge to actually work. Downloaded the app, followed the instructions and got an initial connection to the camera, but then the battery died and all I got was a black screen. Charged the camera, followed the instructions again and it worked like a champ. It's been a huge help for working on my car and being able to check some things without having to pull everything apart (for my case pulling an O2 sensor to check the wastegate of a turbo for cracks). Solid enough device for the money, just make sure its charged, use the right app and follow directions and it should be fine for whatever you need it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Pryoplasm",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Don't waste your money",
      "text": "While you will find reviews that like this unit, I can assure you it is quite subpar. The software is buggy. The wifi connection is unstable. The resolution is poor. The light barely reaches a couple of inches from the camera. I would absolutely return it, but unfortunately waited too long to try to put it to actual use...which I will regret to the tune of the 42 dollars it cost me to have a useless hunk of plastic...",
      "rating": 1.0,
      "verified": true,
      "author": "M Keeling",
      "helpful_votes": 2,
      "publication_date": 20200918
    },
    {
      "title": "No durability. Good picture, bright light, crappy charging port connection",
      "text": "Charging port is not well connected. Used this twice and now the micro USB connection is loose inside the unit. Only fix is to resolder the connection on the board inside the camera. So.... Good camera, works well, not durable at all. UPDATE: Rating bump to 4 Stars for outstanding support. DEPSTECH Customer support reached out to me after reading my review, and since I'd already purchased a replacement camera (Another DEPSTECH), offered me a full refund. They're also going to be working with their engineering dept to see how they can improve the durability of the charging port.",
      "rating": 4.0,
      "verified": true,
      "author": "thebaren",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "I returned the item after a few days",
      "text": "I could not get the borescope to sync with my phone, which is necessary to view an image from the camera. The instructions were useless. They read as though they were translated into English from a different langauge. They were clunky and unclear. I looked for videos online to help me. I followed the steps that were depicted in the videos, but still I could not get the scope to sync with my phone. I would not recommend this device to others.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg Terwillerger",
      "helpful_votes": 2,
      "publication_date": 20200404
    },
    {
      "title": "Incredibly invasive app permissions, privacy policy",
      "text": "Read the privacy policy for the desptech-view app. Some highlights: \"(3)Equipment information .... we will collect your device model, IMEI, ... MAC ... (5)Personal information based on normal use and services... when you use business functions such as photographing and recording, we will need to obtain your camera and album permissions. When you select and click [agree / open] in the pop-up window, IT IS DEEMED THAT YOU AUTHORIZE US TO ACCESS AND OBTAIN YOUR PERSONAL INFORMATION. If you refuse to provide, you will not be able to use this function.\" This tool is not useable without granting these permissions. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "G. Chu",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Oops.  It works.",
      "text": "Did not work with any of my phones. Did not work with any phone in house. The app did not even see the attached device. Did not return cause i thought it would work once i updated phone, but NOOOOOO! That was my original 1 star review. But it worked finally with other software. not the best but it will do.",
      "rating": 3.0,
      "verified": true,
      "author": "joseph smith",
      "helpful_votes": 5,
      "publication_date": 20170918
    },
    {
      "title": "Wasn’t blue tooth and did not navigate bends",
      "text": "The product was not able to connect to my phone via Bluetooth. I bought this product to navigate plumbing pipes and found it very difficult to use. The camera did not focus well when down the pipes and was very difficult to navigate. I was unable to get the camera around bends despite the fact that this endoscopy was advertised as being good for such things, I was unable to direct it once it was in the pipes. Still a decent endoscopy for the price and had a great length; the battery life was also a plus. Hoping to try it on different projects but won’t be using it for plumbing again.",
      "rating": 2.0,
      "verified": true,
      "author": "JJW",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "FANTASTIC!",
      "text": "Quality and price is great! We are using this at the present time to monitor our Bluebird clutch of 4 eggs. We will continue to monitor the babies when they hatch. This item is a fantastic find. It has so many uses for viewing places you can not normall see. HIGHLY RECOMMEND! I wanted to add....you can also take video..we can't wait to see our little baby bluebirds.. ALSO, CUSTOMER SERVICE IS FANTASTIC TOO....they even emailed right after we ordered and the item had not been recieved yet...can't get better than that!",
      "rating": 5.0,
      "verified": true,
      "author": "Restor",
      "helpful_votes": 2,
      "publication_date": 20190721
    },
    {
      "title": "Returned",
      "text": "Thought i had a really useful tool for a great price...not. It's junk. Camera quality is decent considering the price and cable and led lighting is good. The box that contains the rechargeable battery, on/off switch, dimming wheel, charging port, and \"brains,\" is junk...light plastic with glued in charging port. After first use I plugged the charging cable into the port, charged, and when I removed the cable, the entire insert came out and remained on charging cable connection. It was then that I noticed it was secured with a simple drop of glue. Returned for refund.",
      "rating": 2.0,
      "verified": true,
      "author": "BCM",
      "helpful_votes": 3,
      "publication_date": 20180418
    },
    {
      "title": "For the price, this is amazing",
      "text": "I almost bought an endoscope unit with handheld screen and connect camera, instead I bought this for use with my phone. Good decision so far. I've used it to see into the top of an engine and a fuel tank (beware spark/fire risk!). Picture quality isn't as good as say a pro' mechanic tool (Snap on eg), but will so for most home and DIY uses for sure. Not sure how it takes to being bent round very sharp corners multiple times, but I've not had any issues. Lasted over 10mins so far without charge for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph I'Anson",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Great!",
      "text": "I recently purchased this product at the same time I purchased a different brand, The DEPSTECH product works great and easy to setup. I was not too concerned about downloading the APP, it requested the normal needed info about my phone. However, the other brand \"KimCam\" sold by Family Security didn't work after using it in water, and their APP seemed a little too privacy invading. I was concerned about it, I noticed that my security cameras monitor were rebooting as if someone was hacking into the WiFi connection. I uninstalled and removed all trace of KimCam APP from my phone and computer. I'm not sure what took place but the DEPSTECH App didn't request as much info.",
      "rating": 5.0,
      "verified": true,
      "author": "WillyRay",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "CHECK IT QUICK - CAN'T RETURN IF OVER 30 DAYS!!",
      "text": "Busy at work and didn't test until after 30 days. Loaded software and saw app work, hooked up \"wireless endoscope\" and only got blank screen. No response to email to company. Entered wifi passwork just like other products but software would not connect. UGH! So: Now I have $35 item doing nothing. AVOID THIS ISSUE BY TRYING THIS BEFORE 30 DAYS RUNS OUT!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "CloselyChecking",
      "helpful_votes": 3,
      "publication_date": 20180820
    },
    {
      "title": "Great Camera!",
      "text": "Really glad I bought this camera. I've been running network cable through my house and I wouldn't have been able to do it without this. Works great and it's one of those things that you probably won't need often, but when you do, you'll be glad you had it. One note, if you do plan on using it for an extended period of time, with the light on the highest setting, use a small battery backup plugged into it. That way, you don't have to worry about using the internal battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Quarts",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Used this several times now.",
      "text": "For a home owner inspection tool, this product works very well. And having the output image wirelesly transmitted to a smartphone is awesome. One knock on its advertised features, is that the built in wire to stiffen the product, will start bending after being extended even short distances (3-4 feet) horizontally. So to try to reach out horizontally even half way of the over all length of wire provided, additional ridged material is needed to support it.",
      "rating": 4.0,
      "verified": true,
      "author": "CCDAMEEK",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Hardware: Good. Software: Needs work.",
      "text": "The device itself appeared to work okay, however the mobile application doesn't allow the camera feed to show on devices like the Google Pixel/XL. The app will load and the phone can connect to the endoscope's wifi network, but there is no video feed, only a black screen. Any attempt to change settings in the app is met with a \"Failure\" error written in a non-english language. Had initial trouble getting it to work with a Galaxy S6, but eventually got the video feed to come through.",
      "rating": 3.0,
      "verified": true,
      "author": "Ian Stotts",
      "helpful_votes": 2,
      "publication_date": 20180318
    },
    {
      "title": "Great camera",
      "text": "First of all the camera works fantastically. All you need to do is download the app, I used an iPad rather than my phone. The instructions were mostly clear, Chinese to American translation, but not a problem. I didn’t bother changing the default user name or password, but I suspect it would be easy to do; the app was very clear on how to do this. In all honesty I probably had it working within 5 minutes after the app was downloaded (which only took a minute or so). All in all the camera worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "mnord",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Amazing! Works without a hitch.",
      "text": "Wow, what a class act. I got this literally an hour ago and have already downloaded the app, made it work, filmed a hidden space behind my cabinet, and texted the saved video to a friend. Almost everything about this product WORKS! Imagine that. I say \"almost\" because the app download did not go without hitch as I declined to give the app control of my cell phone. It is manufactured in Orwellian China, after all. Nevertheless, after restarting the app, there was the camera video image on my cell phone, ready to be recorded! How wonderful to find technology that works BETTER than expected, rather than being a struggle. Hats off to Depstech, may you live long and prosper...",
      "rating": 5.0,
      "verified": true,
      "author": "Thor Albro",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Nice camera great price",
      "text": "Nice little camera did what I bought it for and then some. I needed to check my tub drain and plunger out then when I was wanting to check the evaporator coils in my ac I was able to feed this through a small hole and see what I needed to without having to remove a few panels, it also came in handy under the hood of my car. Let's me inspect places I couldn't see with out the car being raised. Easy to check under couch/recliner for items that fell through. I'm sure I'll get more use. The price is also excellent for what you get. Easy to install app and link up to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford K",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Nice idea. Not good for small, dark areas",
      "text": "It's a good idea. Not bad for inspecting larger diameter areas. I tried it on a bicycle frame to check for internal rust. Not happy with it because 1. The light isn't bring enough to illuminate a dark area. 2. When you get close to objects, it is always out of focus. 3 the camera is a little too long. 4 it's hard to rotate the camera to get a 360 view of a pipe or tubing. 5. The picture quality is also meh",
      "rating": 3.0,
      "verified": true,
      "author": "Lexicon Devil",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Best WiFi camera scope I've seen!",
      "text": "Unbelievably cool! I was a bit skeptic at first, but decided to give it a try. Once I received the Endoscope, I paired it to my Android device and was able see the image on my cell phone. I purchased this device because I'm remodeling our master bath and was running new wiring under the floor, but wanted to verify where the service lines were (electrical/plumbing/HVAC..ect.) This thing is amazing! I was able to locate my plumbing and electrical conduits and I only needed to drill one hole into the floor as opposed to removing the whole floor. I was really impressed with the overall quality. I recommend the Depstech wireless endoscope.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Motta",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Not an HD camera",
      "text": "Works, but not a clear picture. Description states 2 mp and HD, but not close to that. Don’t expect an HD picture,but it is a usable picture closeup. Changing resolution settings just change picture size,not the quality of the picture. I get a Better picture with usb scope, but not nearly as handy. I will keep it, but not happy with description and was expecting a better picture.",
      "rating": 3.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 3,
      "publication_date": 20180626
    },
    {
      "title": "Great little endoscope",
      "text": "This scope is excellent for any application where visual access is otherwise limited or impossible. The depth of focus is superior and the image quality is very good. The software that is recommended for use with this also does the job with no issues. The only negative comment that I have is that battery life is on the short side. If they could increase this by 50% it would be fantastic. I just recently purchased their WF-060 and it has incredible battery life and some very nice additional features including even higher image quality. Finally, their customer service is 5 Star! Very responsive and quick. They truly care about their customers.",
      "rating": 5.0,
      "verified": true,
      "author": "kermit80526",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Worth it and I would buy it again.",
      "text": "I like this unit. I’ve been meaning to get one for awhile now I saw this one on sale and decided to get it. Picture is clear small enough to get most anywhere and will hold its shape. That’s a good and a bad thing at times but no reflection on this product just different things are needed for different jobs. I have used it more than I imagined I would and now I don’t ever intend on being without one.",
      "rating": 4.0,
      "verified": true,
      "author": "gradyshades",
      "helpful_votes": 2,
      "publication_date": 20171203
    },
    {
      "title": "Exactly what I needed...for things I never knew I needed it for",
      "text": "As a mechanic and general stubborn DIYer, this inexpensive little endoscope is a lifesaver! The hook, 90%, and magnetic end me that this thing can be useful in ANY situation. The app isn't super easy to figure out as it is clearly badly translated to English and the formatting is...unusual. but, once you connect your camera to your phone over wifi, its easy as pie. If you're having trouble connecting, it ia the same basic setup as connecting to a go-pro or a smart bulb. You just connect to the devices wifi (it will show up in available networks) and type in the password (12345678) and you are set!",
      "rating": 5.0,
      "verified": true,
      "author": "ThatGuyJake",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Perfect for tight/odd spaces",
      "text": "This product is exactly what I needed to run some cabling through the walls. With it being pliable, I'm able to squeeze into tight and odd corners. Picture quality was surprisingly good. The variable brightness was also a nice touch. The camera does run unexpectedly hot to the point you don't (or shouldn't) touch it. One thing I'd like is for a longer battery life. Getting about 15 minutes of run time with the brightness at about 50%. This time was the average for four full charges. While you can simultaneously charge and use, just would like a bit of freedom without the need to carry a USB cable for charging.",
      "rating": 4.0,
      "verified": true,
      "author": "Alecs",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Cycle your WiFi to make connection.",
      "text": "This product is everything the description said it was plus so much more. It paid for itself many times over in the 1st hour of use. Running new fuel lines under the floor of a 50' Ketch with no schematics. Wire snake continually hit obstructions one wrong blind move could cost $1,000's. Professional estimate was Labor 8 hours @ $125 per hour. Job was totally finished in 2 hours w/no drilling of bulkheads. The ability to take still photos along with video was indispensable all the while watching the progress . The signal would not show on my device so my suggestion is to Cycle your wifi to find the signal. A simple Off / On did the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "CaptJ",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "BUYER BEWARE SERIOUS ISSUE",
      "text": "This product will NOT work unless you use their app on your phone. When you launch the app it wants you to connect to your local wifi. We see no reason that an inspection light should be required access to our router. The app has some suspicions features. The app wants your router name, password, and the app has a feature to reboot your router. We contacted the company asking direct questions for the reason behind these features but their reply avoided answering our questions. This item should just be bluetooth and your phone connects to it period. Once they have your router password they have direct access to anything on your network. BEWARE!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine McNeil",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Camera is good, cable is average or below",
      "text": "Camera works as described, I wish the cord was a bit more stiff. It does hold shape if you bend it but does not hold its own weight; not stiff past feeding in a couple of inches",
      "rating": 3.0,
      "verified": true,
      "author": "Hos",
      "helpful_votes": 5,
      "publication_date": 20170814
    },
    {
      "title": "Cool little camera for the price!",
      "text": "Bought this camera initially to check a hollow space we discovered beneath our linen closet in the home we recently purchased to see what exactly was there. My wife noticed a strange chemical type smell in the closet, and we figured using a camera like this to investigate was better than ripping off wall paneling, shelves, etc. The camera was very helpful! Turns out nothing of interest was in the space other than some old spider webs & dust bunnies. The video quality was clear enough to see everything going on in there, and I’ve actually used it now a few times for lost screws when doing projects. Very happy with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Casper",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Not so great",
      "text": "Works OK. Software is pretty bad. You can't reset the device to the defaults so if you ever forget your password or can't log in due to an error it's rendered useless. Support was helpful and sent a replacement, but the replacement sent smelled so strongly of some sort of chemical I couldn't use it. This wasn't a problem with the original item.",
      "rating": 2.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 6,
      "publication_date": 20170511
    },
    {
      "title": "Never know when you'll need it",
      "text": "Although this is something you won't use every day, it is very handy to have around the house. I purchased it to locate a fan issue in the vent system in my car. I was able to snake it through the system and find and remove the leaf that was causing the fan noise that was driving me crazy. I've used it several more times under the dash. It's useful around the house as well, it get's in those cracks and crevices to see what's actually going on. It's a bit clunky to use, but after you get it set up, not too bad. Just switch everything on and jump on the camera's wifi.",
      "rating": 4.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Good video quality and good build.",
      "text": "The endoscope works very well as it should. The additional pieces thread on and stay on like they should. Battery life is good, so long as you don't need to run full brightness all the time. But then again a quick recharge and your good to go. I've found that connecting to the app is often troublesome. My work around was simple. Have my device forget the wifi info, reconnect to the wifi, input the password and it sync's up and displays the video feed. The app connectivity is the only negative I have for this endoscope.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean C. Sherburne",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Great Product",
      "text": "Haven't had a chance to actually use but have tested it out. Very simple to operate and get set up. I bought it during the July sale , not any particular reason. Came quickly, has great instructions and comes with a magnet and hooked pick up tools. Light brightness is adjustable. Can take both video and stills. Wire is somewhat stiff so it can be configured in different positions. Wish I had this a month ago! Can't attest to battery length but sure light has an effect. Surprised by the quality for the price. Using on iphone XR. Wire has plenty of length.Highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Chet K.",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Very Handy Tool",
      "text": "This endoscope has helped me immensely at work as a mechanic for a major airline. Bought it for home, but use it at work all the time. You see, apparently flight attendants really like dumping red straws down galley drains and clogging them. This endoscope has really helped finding them and helping to clear drains. Will continue to keep it in my toolbox. Easy to connect once you set it up. Uses wifi, then open the app. Short field of view, but perfect for what it's used for.",
      "rating": 5.0,
      "verified": true,
      "author": "AMT wrench",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "very weak usb connector",
      "text": "The camera, the light, and the image quality are actually quite good. I've had it for 6 months and use it maybe 5 times until it stopped charging. Thinking the problem was with my usb cable I removed it only to find the entire usb portion of the device came out stuck to my usb cable. Now there is no way to charge it and it's useless. Even if it had a removable battery I could still make do.",
      "rating": 3.0,
      "verified": true,
      "author": "amaz_user",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Open up a hidden world for 36 bucks",
      "text": "This is really cool. I remember hauling a couple of suitcases full of Olympus gear years ago to do much less. I have checked the cushions of my couch and recovered $1.09, wiring in a blind junction box on hard to reach attic stud, and of course my ears, nose and throat. I don’t expect the battery to last long, so I’m running it off a li-ion battery charging pack. I will find as many DIY project uses for this as I have for the phone camera in the years to come... It really is an impressive piece of hardware. Well worth $36. My platform is iOS 12. Oh, most importantly: my wife approves... Thanks for reading.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Norris",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Works As Advertised Right out of the Box",
      "text": "Excellent Product - Hooked up to my Droid 2 and it worked right away with high quality pics. Would recommend for any phone or computer as it acts like it's own Wi-Fi transmitter, connects instantly with standard Play Store App. Plan to use at work for internal generator inspections with the ability to shoot still photos and video.",
      "rating": 5.0,
      "verified": true,
      "author": "GarGold",
      "helpful_votes": 3,
      "publication_date": 20170417
    },
    {
      "title": "nice picture. Difficult to direct in tight spaces",
      "text": "Works well, nice picture. Difficult to direct in tight spaces. Needed to locate a water leak in my RV. Worked, found leak and affected repair. If you use it for long periods of time, just connect to an external smartphone charge battery for longer battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "Garrette",
      "helpful_votes": 4,
      "publication_date": 20171214
    },
    {
      "title": "Good value",
      "text": "For the money, I like it. When the light is on maximum the camera housing gets very hot, so much so I don't keep it on maximum for long out of concern for damaging it. Also, the variable light intensity control is touchy. It's like a mechanical volume control on a small radio. For most of its range of movement, about 3/4, the intensity is low. Then in the final 1/4 it ramps up rapidly to maximum. It's not easy to get a \"middle\" light intensity. I guess this is just the design, and not a defect. In the next version I hope they improve this function.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob Dobbs",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Temper expectations",
      "text": "These low priced bore scopes are everywhere, priced 100x less than professional borescopes. Is it reasonable to expect similar performance & versatility? This unit has issues, mostly w/app but it’s cheap so Ive kept it and use as best as suited. Have had to close & re-open app when images freezes - using iPhone 8+ with current iOS 11.4. The macro focusing is terrible. I’ve tried several competing brands and they are all similarly poor in close quarters. Non macro applications, the light is reasonably effective and image quality better than all similarly priced units.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael McDonald",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Works as advertised.  Keep finding \"needs\" for it.",
      "text": "It's definitely useful. The cable is stiff, so it can be difficult to get it to go where you want. A more flexible cable would have it's own flaws. Most challenges are user-failures. It takes effort to orient your brain to the pic and interpret what youre seeing. Best focus is ~6\" in front of the camera, so I frequently found I was too close to focus. Battery is sufficient. Light is great. Wi-Fi connection is easy. In 2 months I've used it to check plumbing a few times, fish wire through a stud,,and inspect under avoid top deck. Can't imagine not having an inspection camera now. It's a nice go to.",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Incredible fiber optics for the money.",
      "text": "Good instructions although printed very tiny. Once I paired it with my android for WIFI (must go to play store for the app) I just entered the factory default password and good to go. Be sure to crank up the resolution to 1080. It's fun to play with at first but its a serious tool for serious jobs. I haven't got that far yet. I'm pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Spanky McFarland",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "Garbage product wasting of money and time to use this product. Do buy!!!!!",
      "text": "I have very bad experience to use this product. Image is not clear and not able to take picture close to the object. Once increase the brightness then no clear picture. if reduce the the darness then picture is not able to see. Wifi disconnection from your phone very common. Connect agan and againn. Battery life is too short, to charege again and again. OVER all EXPERIENCE WITH THIS CAMERA IS NOT GOOD. WILL NOT RECOMMENT TO BUY THIS. Thanks",
      "rating": 1.0,
      "verified": true,
      "author": "zubair hassan",
      "helpful_votes": 2,
      "publication_date": 20200921
    },
    {
      "title": "Poor quality image but probably worth it at that price point.",
      "text": "Granted they tell you straight up when you purchase this camera that it's a 2.0 mega pixel camera so you know what you're getting. Don't expect a high resolution image for a camera like this at this price point. Value for money this is a decent buy but if you need detail you may want to look for something a little more professional. I found that this camera worked well for my needs which didn't require high resolution. I did find however that the app was a bit buggy and that the camera ran really hot because the light is always on.",
      "rating": 4.0,
      "verified": true,
      "author": "Aleks Pausak",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Awesome!",
      "text": "Purchased this item in an attempt to find a dead rat in our work truck. I was skeptical how well it may work for $40. I was overwhelmingly impressed. The picture quality it’s very good. Look it’s not 4K but it’s not standard definition either. It did exactly what I needed it to. We were able to look in places we could not have without disassembling the entire truck. We found the dead rat because of this device. The photo I posted does not show the rat as I know I wouldn’t want to look at it but it is a photo taken while using the device in nooks and crannys we could not have seen without it.",
      "rating": 5.0,
      "verified": true,
      "author": "PAUL M FOUQUIER",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Does not work with iPhone 11",
      "text": "I followed instructions to download DEPSTECH-View from the App Store and I was able to connect to the device WiFi but I just get a blank screen. When selecting camera or video options, the app just closes immediately without any error. I have the latest iOS version 14.0.1 and it just doesn’t work. I sent an email to tech support but so far no response yet. I guess this will be going back for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Vinny",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Endless uses, quality product!",
      "text": "Used it to run wiring through walls, check for exhaust leaks in hard to see areas... The possibilities are endless, I am sure to find more! Set up is easy, pair your phone or tablet to the WiFi of the camera and download the app. Can use it plugged in to power or wirelessly when charged for remote locations. Camera and cable are water proof, power pack is not. Light on dimmer switch and also came with a mirror and a hook attachments. Heck of a deal, I just wish I would've gotten a longer one for drains.",
      "rating": 5.0,
      "verified": true,
      "author": "Yashua201",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "GREAT PRODUCT !!!",
      "text": "Was easy to set up; basically downloaded the app, (for iPhones turn off your cellular and bluetooth), turn on your Depstech, go into your phone’s WiFi’s choices and when the Depstech wifi appears choose it and type in password. Now go into the depstech-view app you downloaded and you’re ready to go. Worked great to follow plumbing to look for a possible leak. Saved us big bypassing a plumber when that wasn’t the culprit. Wished the image was a bit sharper but, definitely good enough to tell what was what inside the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "NonnaDonna",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Broken app means broken endoscope",
      "text": "I'm sure my one star review will get buried, but before you buy: go lookup Depstech View on your app store. That's the only app that will work with this scope, and very few phones are able to use it at all. No settings or help or troubleshooting. You open the app and nothing happens. Save your money and buy from another company.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 3,
      "publication_date": 20200708
    },
    {
      "title": "Did not work - Black screen (never got an image)",
      "text": "Tried connecting to it via both Android and iOS. Connected to Wifi fine. Both apps didn't work. They just showed a black screen. No error. No feedback on what was going on. Nothing. Not sure if it's the software or device that is broken. It's clear the apps are pretty poorly designed (it kept screwing up the portrait/landscape mode on my iPhone), so I decided to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Great tool to investigate “behind the walls” issues of an old house!",
      "text": "It is extremely easy to set up and use. I used it to look for a possible plumbing leak behind a wall. It saved me from making a huge mess, I would have had to open an inspection/repair hole in a newly tiled bathroom wall! I was able to identify the plumbing issue and fix it without creating another disaster. It continues to help me inspect and learn about what is behind the walls, in the plumbing and in air vents within my old house.",
      "rating": 5.0,
      "verified": true,
      "author": "dr.m",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Slick boroscope",
      "text": "Got this boroscope because 1) it's a good price, and 2) I'm a part-time mechanic and I tend to lose parts/screws/nuts in the nether regions of engine bays. It's also easy to set up and use. Download the app (I've got an Android phone), and you're all set. I charged the unit when it first arrived for about three hours before I tried it out. Light is very bright (dimmable if needed) and cable easy to manage. Retrieved a 1/4\" nut driver socket from under a battery tray on first attempt using the magnet. Sweet! Got the case too; hard shell and plenty of room inside.",
      "rating": 5.0,
      "verified": true,
      "author": "R. S. Lytton",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Excellent.",
      "text": "Excellent and easy to use. Turn it on, connect to the Jetion wifi with your phone, open the Wifi View app and there you go. Simple. The camera is great but as others said has a fairly narrow focus range but it's not an issue for me. Really like the adjustable brightness on the LEDs. I had considered the version with an event longer cable, but frankly after you get too far you lose control of the direction of the camera so the length is fine as is. Bought it to inspect the ducts in my house HVAC but have already come up with other uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Wootywooty",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "It does the job, good value",
      "text": "Straight ahead, this is great. The mirror is a bit problematic. The edges tend to light up so brightly that what's reflected in the mirror is hard to see. At least, down in the cylinder of the engine I'm trying to examine. Overall, a good product, I'm glad I bought it, and good, prompt service from the company. By the way, for those having an issue with its battery life - yes, it's rather short for some jobs, but it will work plugged in, which gives unlimited work time. An external battery (like that marvellous Anker 22 amp hour monster) can keep you going all day.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Van Pelt",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Could not get to work",
      "text": "After spending hours trying to connect this device with the poorly written instructions, poorly filmed video, and reading other user's recommendations, I could not connect this device to my phone. I reached out to customer support and after 5 days, received a response with additional instructions which I followed, but with no such luck. I was surprised to see this as a recommended Amazon product along with the number of other good reviews. Beware, this is a very low-quality product! Buy your endoscope elsewhere!",
      "rating": 1.0,
      "verified": true,
      "author": "Petra",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "so far so good",
      "text": "after buying this, i read reviews that said it doesnt work unless in airplane mode or other stuff. I have so far not experienced any of that. while i haven't really used it yet other than just testing it when i first got it, I have had no problems getting this up and running and have been able to see it works without putting my phone into airplane mode. maybe it will have problems down the road, and if it does, i will do my best to update this review. but so far so good and im happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Alder",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "A quality tool to have around the home or Shop",
      "text": "I loved the easy of connectivity to my iPhone. Lots of times you get a gadget like this and it loses it appeal when you get frustrated just trying to hook the thing up to your phone. The flexible cord for the camera is plenty long for any normal use I can think of... The picture quality is great and the LED lights are bright.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "very good product worth the money",
      "text": "very good product, easy to use, large clear picture and video, easy connect to Andriod phone. some improvement suggest. 1. In the user manual, it should instruct the user to charge the wifibox first, I went with the manual first step, nothing happened, then I realized the wifibox had not been charged yet. 2. There is instruction how to charge the wifibox, but it does not say how long it takes to charge it. 3. There should be some sort of protection of the lens, like a rubber tube or cap, to protect the lens. I am very satisfied with this devise, I can do many things with it when working on car repair.",
      "rating": 5.0,
      "verified": true,
      "author": "CarFix44",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Great price for a great picture.",
      "text": "Great for the price, saves me time in the shop. Working flat rate, any time you can save is a must. Enabled me to save a few hours today checking a turbo for excess oil and some pistons suspected of broken skirts. I would pester my mates to loan me their high end scopes with brand names stamped on them from time to time, but now I don't have to (and some have asked me to use this little guy due to its ability to take a better picture for warrenty work). Will update this review if problems occur, if no problems occur I will keep my 5 star rating. Thank you for a decent product at a decent price.",
      "rating": 5.0,
      "verified": true,
      "author": "KzFusion",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great item!!!! read the review for a few details",
      "text": "I was trying to tighten the jack on an acoustic/electric guitar and used this to guide me placing the wrench on the inside part BRILLIANT!....looked behind the left rear tire of my 2012 Volkswagen to see what kind of fastener was holding the velocity sensor down (that fails and makes all the dashboard lights come on by the way)...BRILLIANT!. Left it sitting in the mailbox so we all could watch on a tablet someone walking up before we sprang out for a surprise party!....BRILLIANT!!!...aimed it up my nose and saw that on a 27 inch monitor....NOT SO BRILLIANT!!!!!!!!!!! works great... there is an adjustable light at the end...the cord to the lens is sturdy and holds its shape...",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Pauley",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "5.0 megapixel replacement is great! Thank you DEPSTECH",
      "text": "30 October 2019 Update. The first one i ordered seemed a bit too grainy for my application and I did not easily understand how to pair the camera to my phone. DEPSTECH contacted me regarding my 3 star review and very generously offered to replace my unit with a 5.0 megapixel one. Its great, and the manual is much shorter now, making it easier to see how simple the wifi connect setup is: install the DEPSTECH app, turn on the camera and select it in the smartphone WiFi settings. Type in the factory pre-set password, 12345678. Easy. Sharp image, capable of focusing to as little as 10 cm. Excellent for my automotive application.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Pretty useful snake-cam",
      "text": "No, I didn't poke it down snake holes, but did use it to inspect a gas tank fill that was restricted and to trace wires in my motorhome. The images are well lit and it works with my galaxy 8+. The wifi view app you need to use it could use some work as it didn't save pics at higher resolutions and it didn't save video but as a single pic. I didn't try out the screw-on end tools but can't see that they would be useful because they block the camera, except the for the 90 deg mirror. In all, I'd buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael W. Kelley",
      "helpful_votes": 2,
      "publication_date": 20171106
    },
    {
      "title": "No image, no support.",
      "text": "Spent a couple hours trying to get the camera to work without success. I could get the unit to connect to my phone by WiFi but no image would ever appear. Pinwheel juskept spinning. Reset, reloaded apps, fully charged, etc. No response from customer support so I sent it back. Looked promising but was defective out of the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Microbus",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "If you need good view of a small space, this is what you want.",
      "text": "Easy to connect, easy to use, helped me get a job done properly that I could not possibly have done without it. It's not one of my go-to tools for electrical and plumbing jobs. Only downside is that it will burn through the battery really quickly. Would be nice if if had a swappable battery like an Li-ion 18650. Fortunately is uses Mini-USB to charge; so it's easy enough to just plug it in and use it for an indefinitely long period of time. Product does what it says, well, and for a good price. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Otis",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "pretty cool company.",
      "text": "This company replaced my original purchased without my request based on my 3.5 star review. That’s pretty cool. The new one has much better resolution and for the price that’s nice. Hey, that rhymes. But nonetheless they went above and beyond and that says a lot about product and company integrity. P.S., I still thought the original product was worth the price and I thought the review was still pretty good so to do this is a lot. Thanks buddies. I wish all vendors had this amount of integrity.",
      "rating": 5.0,
      "verified": true,
      "author": "buyer",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Just ok",
      "text": "The picture Quality is pretty good and overall it’s a pretty neat concept. The two issues I had with it or one the light is not nearly bright enough. If you’re trying to look into a hole you almost have to use a flashlight in another hole so you can actually see. Also it said it’s flexible so you can use it to look up higher but I find that not to be true. I was trying to use it to look at a bird nest the top of our porch and it just kept flopping over so I had to tape it to a stick to get it to work",
      "rating": 3.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Works, and so does Customer Service",
      "text": "This is 5 stars for the scope that costs less than $40, obviously you can spend a lot more and get a lot more. But for a homeowner who occasionally needs a scope, this works fine. The instructions to connect to wifi in the printed booklet are a bit confusing, at least where I looked it didn't mention the need to connect the phone to the wifi prior to using the phone app, but when I wrote customer service they responded the next day with full instructions and a video covering everything. So I'm happy, the scope works, and idepstech is responsive. What more could you ask for $40?",
      "rating": 5.0,
      "verified": true,
      "author": "R. Leibforth",
      "helpful_votes": 0,
      "publication_date": 20190116
    }
  ],
  "product_meta": {
    "title": "DEPSTECH Wireless Endoscope, IP67 Waterproof WiFi Borescope Inspection 2.0 Megapixels HD Snake Camera for Android and iOS Smartphone, iPhone, Samsung, Tablet -Black(11.5FT)",
    "rating": 4.3,
    "feature_bullets": [
      "Endoscope with Wide Compatibility: This wireless WiFi endoscope can work with Android 5.0+ smart phone and iPhone with iOS 9+ system. Perfect for iPhone user who want do inspection work.",
      "WiFi Connection, Easy to Use: Download and install the compatible App on your device. No need extra adapter or cable, just connect with your smartphone via WiFi. Then start the App to begin your inspection.",
      "HD Inspection Camera: 2.0MP borescope offers you a wonderful experience of capturing a clear close range HD video in AVI format and image in JPG format with adjustable resolutions 640x480, 1280 x 720 and 1600 x1200.",
      "IP67 Waterproof, 8.4mm Diameter Probe: With 6 adjustable LED light and thin waterproof probe, this endoscope are suitable for various types of environment, for example, low-light or dark area, damp or wet area etc.",
      "11.5FT Snake cable: Armed with bendable semi-rigid cable which can bend and hold it's shape to access a wide variety of confined place, such as curved holes or pipes. 11.5ft long cable can extend to all corner of your house."
    ],
    "specifications": {
      "Manufacturer": "DEPSTECH",
      "Brand": "DEPSTECH",
      "Model": "4331891326",
      "Item Weight": "9 ounces",
      "Product Dimensions": "5.12 x 4.92 x 1.77 inches",
      "Item model number": "4331891326",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Exterior": "Machined",
      "Manufacturer Part Number": "WF010-3.5M",
      "Folding": "No",
      "Bulb Type": "1",
      "Lift Type": "Snake Camera",
      "Voltage": "1 Kilovolts",
      "ASIN": "B01MYTHWK4",
      "Customer Reviews": "4.3 out of 5 stars6,779 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#277 in Industrial & Scientific",
      "Date First Available": "November 29, 2016"
    },
    "categories": [
      "Borescopes",
      "Automotive Parts & Accessories",
      "Test, Measure & Inspect",
      "Inspection & Analysis",
      "Industrial & Scientific"
    ],
    "price": 35.99
  }
}