{
  "website_summaries": [
    {
      "verdict": "A whiteboard-type calendar with a magnetized back that can stick to your refrigerator or other metal surface.",
      "pros": [
        "Dry erase markers included",
        "Also can work with liquid chalk markers",
        "A good chore or appointment calendar",
        "Functional and practical",
        "Ships fast",
        "Three spaces in each date box help with organization"
      ],
      "cons": [
        "Product tends to bubble between the magnetic layer and the surface"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Mostly does the job",
      "text": "Pros: - like the layout - like having the lines - appreciate the multi-colored markers with eraser and magnet Cons: - Smaller than I thought; could be a challenge for a family of 4+ - markers (as stated in earlier reviews) are not great. They write fat letters (in an already confined space) and if you're writing multiple items on the calendar at the same time, they fade pretty quickly. NOTE: early reviewer talked about her \"disappointment\" with the calendar being shipped rolled up. I found this comical! How did she expect it come? Folded up?! In a large flat envelope? I unrolled it and had ZERO issues attaching it to my metal refrigerator.",
      "rating": 4.0,
      "verified": true,
      "author": "by Grant M.",
      "helpful_votes": 5,
      "publication_date": 20180905
    },
    {
      "title": "material is a good quality. The magnet for the markers is very ...",
      "text": "I’ve had this for about a month and noticed that the red marker leaves a stain on the board, the eraser will also smear that color all over the board. Just don’t use the red marker, i haven’t had the issue with the other colors. Overall the magnet is strong, material is a good quality. The magnet for the markers is very weak, I have a cup that holds them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20171231
    },
    {
      "title": "Absolutely love this product",
      "text": "Absolutely love this product! My husband and I were always writing messages on a paper calendar with limited space and not being able to make out what we wrote simply because of the numbers and lettering underneath. Trying to update a message was ridiculous, this magnetic calendar solved all of our problems, plenty of room to write, any message can be changed so easily and the magnetic pens make it so easy to keep track of a writing utensil. Securely sticks to refrigerator and clean up is a breeze. Love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Mair",
      "helpful_votes": 2,
      "publication_date": 20171206
    },
    {
      "title": "Don't expect a refund.",
      "text": "Its fine, but its too big for my fridge. When I tried to return it, I found out I would have to pay $11.99 for a UPS pick up or go find an amazon location drop off. Ridiculous. So in fact there would be no refund, I would be paying to send it back. Money down the drain. So now this will end up in the trash or sitting in box being useless. Thanks.",
      "rating": 2.0,
      "verified": true,
      "author": "Savannah Knudtson",
      "helpful_votes": 2,
      "publication_date": 20180716
    },
    {
      "title": "Great for what I need!",
      "text": "Purchased this so that me and my boyfriend can write our events on the fridge. I’ve used this for the month of August and so far so good. The magnet has held up great, no bending or peeling off. All the markers are easy to read when used on the calendar except the green is a little on the lighter side. I do find that the longer the marker stays on the board the harder it is to take off with just an eraser or cloth. I used a little dab of water on a paper towel and the marker/writing comes off right away, without a problem. Would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Makes Life Easier!",
      "text": "I ordered this magnetic calendar to place on the side of my refrigerator to help out my father who suffers from memory issues. It is large enough for him to see the day of the week from the table where he sits. I mark off each day as it passes with the erasable markers and write in his appointments so he knows what to expect for the month. The print on the calendar is large and clear and there is plenty of room for you to jot down any notes. Much better than a regular calendar hanging on the refrigerator like I used to have. Item arrived quickly and was a steal compared to the big box stores!!!",
      "rating": 5.0,
      "verified": true,
      "author": "RSN-CA",
      "helpful_votes": 3,
      "publication_date": 20170126
    },
    {
      "title": "Keeps our family organized",
      "text": "This dry erase magnet calendar helps keep our family organized. It’s a large size, taking up about half of our refrigerator width, which is great because there’s enough room to write in each square/day. The magnet is strong and holds securely. It also comes with 4 dry erase pens in black, blue, green, and red. Each pen has a small eraser attached to it, which is convenient and works well. Overall I have no complaints. It’s not as fancy as other calendars in terms of style, but it works well for our family.",
      "rating": 5.0,
      "verified": true,
      "author": "Jheneya",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Family Essential",
      "text": "Purchased this for my growing family. Helps us keep track of appointments and activities. Works perfectly. Easy to clean and lays smooth on our fridge. Size is just right- though I have found that you have to cram in your numbers for the days (but I think that’s because they don’t make an extra fine dry erase marker).",
      "rating": 5.0,
      "verified": true,
      "author": "William’s Mum",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Great calendar!",
      "text": "I love this calendar! The magnet is very strong and keeps the calendar from slipping. The included markers write very well and wipe off cleanly. It is large enough to be very useful, but not so large that it takes up a ton of space. I love the extra space at the bottom to write notes. This is a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Good board bad markers",
      "text": "Pretty much what you expect. Sticks to fridge really well and decent size (I’d say med-large). My only complain is that the dry erase markers suck. If I knew I could have gotten a different product and markers separately since I need to get new markers now anyways...",
      "rating": 3.0,
      "verified": true,
      "author": "Daisy K",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Great product, good price, educational",
      "text": "Great tool for grandchildren ages 3 to 6, entering appropriate info including month name, recognizing days of week (begins with Sunday ends with Saturday each grayed in color to identify weekend!) dates (numbers) on appropriate days...and room to draw or enter notes for birthdays, play dates, sport or dance days, appointments, weather, full moons, etc. Magnetic board and markers work great, love it!!! Good price!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth K",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Difficult to erase",
      "text": "Like other reviewers stated, it is difficult to erase. However, the magnet works great--the wrinkles from shipping quickly fell out once on my frig. The square sizes are good--not too big and not too small. I can easily keep track of 3 schedules. If I still had 4 kids at home, however, the squares would be too small. Overall, a good purchase and I would buy again. Would work great in a classroom as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon Vannier",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "As expected",
      "text": "So far so good. I like that the whole calendar is a magnet so it will stay in place on the refrigerator. The markers work just fine, and the ink seems to come off easily (some rubbed off when I accidentally put my hand on it). Perfect for keeping track of family and school activities. I did buy some other markers with fine tips so that I could write smaller in case we need to, but if not, then they are just replacements for when the current markers run out of ink......",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa P.",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Great medium-sized calendar for occasional reminders",
      "text": "I loved the fact that the calendar was so easy to stick on the fridge right out of the box. I think a dry eraser would make the product just a tad better, but that is the only minor issue. It’s the perfect size for someone like me who needs it for small reminders like paying bills, occasional appointments and shopping lists, but seems a bit too small for a busy family with lots of kids.",
      "rating": 4.0,
      "verified": true,
      "author": "samantha flory",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "This magnetic calendar was great! I don't know why it was so hard ...",
      "text": "This magnetic calendar was great! I don't know why it was so hard for me to find a dry erase calendar that stuck to a refridgerator and was the right size, but this one is! It shipped in a nice cylinder container too, so wasn't bent or folded when I got it. It erases well and has space on both the top and bottom for notes! So far it erases well and the markers are better than I expected, althought I'll probably have to buy replacement markers sooner rather than later. Make sure that you use thin tip markers. Overall, great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "World's Best Refrigerator Magnet!",
      "text": "This calendar magnet is the greatest. It fits perfectly, even on a side-by-side refrigerator door. The magnets on the pens are a little weak and may slide down a bit if you shove the door closed too hard, but this does not detract from the ease of use of the calendar.",
      "rating": 5.0,
      "verified": true,
      "author": "Elucubrator46",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Love it!",
      "text": "Fits great on one side of my double door fridge, markers stick on fridge too, just what the family needs so everyone can see what's going on. Liked it so much we ordered a second one to start filling in on next month's schedule too.",
      "rating": 5.0,
      "verified": true,
      "author": "mjb134",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Cheap product!!!!",
      "text": "If I could give it 0 stars I would. Used it got one month, tried to clear the board but marker stayed on and wouldn't come off. Will not buy it again. Cheap product!",
      "rating": 1.0,
      "verified": true,
      "author": "Lana Y.",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Great",
      "text": "It is nice. Adheres well to the fridge. Each pen has magnetic cap so they can line up on the side of board. I really like and it serves the purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Mcpherson",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "PERFECT Fridge Calendar!",
      "text": "I received this calendar literally A DAY after I ordered it. It came in a little rectangle box and was nicely packaged. I have been looking for a full (strong) magnetic calendar for our fridge at home and this one is exactly that! Came with 4 markers, all of them worked on the first try. 10/10 would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Perfect! Love it",
      "text": "Perfect! Love it! Exactly what I wanted and imagined. No extra work of hanging it on the wall. No corners that try to curl up. Went straight on the fridge. Big enough for family and business events. Keeps us organized. Great price AND includes four markers with erasers attached to their tips. Best deal ever. Would definitely recommend. I spent hours staring at various styles and shapes. This one was the winner.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary T.",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Usually with similar items like this that I've purchased in the past",
      "text": "This item is so convenient since there's no need to hang anything up on walls. I just placed the calendar and pens on my fridge and that was that. Usually with similar items like this that I've purchased in the past, the pens were garbage, but all of these pens work great and don't stain the calendar. Plus, you just can't beat the price! I'm very happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Love the size",
      "text": "Perfit size for the fridge, my kids love being able to see what is going on the whole month! The colors are hard to erase (maybe it is the markers that came with) but I just use a magic eraser and they come off just fine",
      "rating": 5.0,
      "verified": true,
      "author": "Annie H.",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "This calendar is perfect for me",
      "text": "This calendar is perfect for me. Nicely fits the front of my refrigerator and looks great. Wanted a simple calendar with note lines both within each day and in other places on the calendar. Was delivered without any dents or creases - would highly recommend a purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Dannette Williams",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "I love the concept of this calendar and it helps keep ...",
      "text": "I love the concept of this calendar and it helps keep me organized! I will say that the colored pens are hard to wipe off when something has been written for the entire month. I'm not sure if its just the pens it came with though. Expo markers might wipe off easier. Overall a good product though and I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Perfect for our family!",
      "text": "We love our new calendar! It’s perfect and EXACTLY what I was looking for to put on the side of our fridge. I wanted THIN, easy to erase, big enough to write, and something that wasn’t “farmhouse” or floral or that had weird scrolls and designs. Hard to find but they did it and I love it!! The magnet is great! Doesn’t slip, but easy to peel up if you need to.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Coordinate Family Events - EASY!",
      "text": "We LOVE this calendar! It arrived on time and is already color-coded with different family members events (and chores). Easy to use/wipe off/start again ... and right there on the fridge when we need to see how to coordinate family happenings. G'kids love drawing & coloring in holidays and birthday pics. Great product and very reasonable priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Apple4Me",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "I absolutely love it and am very pleased with the quality",
      "text": "I received this a few days ago and it is already a success in my family. It is on our refrigerator with all the activities we have happening this month. I absolutely love it and am very pleased with the quality. It also comes with 4 dry erase markers that have erasers and magnets on the lids so they are also hanging on the fridge!",
      "rating": 5.0,
      "verified": true,
      "author": "I<3Books",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Waste of money",
      "text": "Yes, it is magnetic. That's why it gets one star. Unfortunately, the dry erase markers are not very good. The notations made on the calendar fade off right away making this thing useless.",
      "rating": 1.0,
      "verified": true,
      "author": "GLEN M. ROBINSON",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Great size, does not erase 100%",
      "text": "Love that I can hang it on my refrigerator. However, after one month of using it, it is difficult to erase and have the board look brand new (market streaks are evident). The cloth that comes with it to clean is a joke. I will have to buy white board cleaner to remove all evidence of last months activities.",
      "rating": 4.0,
      "verified": true,
      "author": "Bgreen",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Sticks well, doesn’t clean off easy.",
      "text": "Doesn’t clean off as well as I’d like. Great calendar though! Will need a extra fine tip marker to be able to legibly write anything.",
      "rating": 3.0,
      "verified": true,
      "author": "andy j morgan",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Poor quality",
      "text": "The calendar arrived with bubbles in several of the squares making it unusable but the seller sent out a new one with not having to return the damaged one. Unfortunately the 2nd one has bubbles in it too. The product itself just isn't worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "Linda B",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Worth the price",
      "text": "This was exactly what I was looking for. It's the perfect size for my refrigerator and there's enough space in the blocks for what I need. It came rolled up but there were no creases once on my refrigerator. So far, there's no peeling or damage to the calendar. The only reason I didn't give it 5 stars is b/c the markers it comes with didn't last long (the precision of the tip was done after 1 use). However, I only like expo/school quality dry erase markers.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Overall Happy",
      "text": "I just recently received my calendar and am overall happy with it. My biggest fear was that the markers wouldn’t wash off the calendar (I have had one previously that I used for two months and then couldn’t get the marker off) and I tested it when I got it and didn’t see that as an issue (so far anyway). I did buy Expo markers instead of using the set that came with the board so I’m not sure if those would cause staining or not.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashton ",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Beats Walmart pricing",
      "text": "Works as advertised. Some reviews say it stains with some colors, girlfriend hasn’t erased anything yet so I’m not sure but seems to be decent. Markers don’t fall off when you shut the freezer door of the fridge.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Willard",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Dont have one get one",
      "text": "Got this a few months ago i love it would buy again its easy to use easy to clean and its been 4 months and the markers are stil usable i use them also daily this is a great way for me to get organise",
      "rating": 5.0,
      "verified": true,
      "author": "Mer2tastic",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Erasable calendar",
      "text": "This fit perfect on our side frig, easy to change and read. Erasable pens and eraser came with it. Well worth the money..",
      "rating": 5.0,
      "verified": true,
      "author": "IKat2u2",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Hang the markers pointing down",
      "text": "So far so good. For a while the markets weren’t working. I realized it was because I was hanging them on the refrigerator with the tips pointing up so all of the ink flowed away from the tip. I turned them upside down and now they are working great.",
      "rating": 4.0,
      "verified": true,
      "author": "Dirk",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "The magnetic strip is great, and the markers that come with it are ...",
      "text": "I bought this for my fridge and use it daily. The magnetic strip is great, and the markers that come with it are pretty good quality. its a great organizational product, and I'm very pleased with it! its not too big, and there is plenty of room to write in the daily squares.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole J",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Love it!!",
      "text": "Love my magnetic calendar! Perfect size even for my side by side fridge. The colorful dry erase markers are a nice added bonus. I also like that the calendar is lined. It helps me keep my \"to-do's\" and appointments nice and neat. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Phale",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Highly recommend",
      "text": "This is the perfect calendar for your fridge. I needed something for meal planning but after redoing my kitchen, i didn't want to hang something on the wall. I wish it was a little bit bigger but I'm being picky. My old wall hanging board was bigger but you can't beat the price and it really does do the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay E. Swanson",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great calendar!",
      "text": "This is a great quality product for the price. The magnet is strong, and the markers work well. The \"erasers\" on the markers aren't the best, but I can get most of the residue off using some cleaner.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Cain",
      "helpful_votes": 3,
      "publication_date": 20161229
    },
    {
      "title": "BLANK CALENDAR",
      "text": "Really disappointing. I thought it was an actual calendar already printed on the magnetic white board, but mine was blank. Wish this information would have been more clear before purchasing.",
      "rating": 1.0,
      "verified": true,
      "author": "Anne-Sophie Berger",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Just what I needed",
      "text": "Exactly what I was looking for. I’m a mom on the go and sometimes life gets hectic. I’m used to using calendars on my phone but it can be too much at times I like to see my week or month ahead somewhere physical. This is great for the fridge. The packaging is great so is the quality and price. I would definitely order from this seller again. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "bridget cook",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Great size and \"adheres\" nicely to fridge.",
      "text": "I love this calendar. the delivery was also very quick. The only minor complaint is that the dry erase markers are very light in color. Of course, I can always replace the markers with another brand.",
      "rating": 4.0,
      "verified": true,
      "author": "LRPATRICK",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "High Quality",
      "text": "Perfect size for the fridge and well made/designed. We use it to schedule and record kids' use of electronics, and it's great to set and keep expectations and structure. I highly recommend this for whatever structure you're trying to create.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Anderson",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Great Product!!",
      "text": "What a great product. Lies flat on the refrigerator, looks great and is easy to erase and change. It helps keep our family organized. We are planning to buy them for Xmas gifts for extended family.",
      "rating": 5.0,
      "verified": true,
      "author": "todd brockett",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "It's handy and convenient.",
      "text": "It seems to be all that I expected. Large enough and easily accessed for both my husband and me. The only detriment occurring now that I've used it for a full 2 months is that the erasing is becoming more difficult.",
      "rating": 4.0,
      "verified": true,
      "author": "chester hertling",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Great calendar!",
      "text": "It was what I was looking for. The size of each day was big enough to write multiple events.",
      "rating": 5.0,
      "verified": true,
      "author": "ONNAGA",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "LOVE LOVE LOVE",
      "text": "This was the best thing I bought. As someone who can't hang much in her home this magnetic one for the fridge is the best thing ever!! I have a busy schedule between work and school myself. I have a 4 year old daughter and I live with my parents and they have plenty of doctors appointments. this keeps our schedules in line and lets all of us know when we are available for things. I couldn't be more happy with this product. It has been a life saver and makes our lives so much easier and organized.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Thompson",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "No complaints",
      "text": "It stays on the side of the fridge.. we are able to erase it each month and start again.. it is pretty big",
      "rating": 5.0,
      "verified": true,
      "author": "veronica",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Cute calendar",
      "text": "I love the size of the calendar and it sticks great to the fridge. The only thing I dislike is that I wish the marks were thinner! It’s hard to write with them and it erases the writing below where you’re writing. Other than that it’s a great calendar!",
      "rating": 4.0,
      "verified": true,
      "author": "Brittanycarroll ",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Love this! Over all great product!",
      "text": "Love this! The whole backing is a giant magnet and even though it comes rolled up, it flattens almost immediately. I’ve read other reviews stating that the red marker leaves stains on the calendar, so I’ve just avoided it. The blue, black and green markers are great and are easily erased. Over all great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Kairah S.",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "Great magnetic calendar",
      "text": "Exactly what I was looking for. Perfect size, easy to erase and write on. Very helpful for reminders.",
      "rating": 5.0,
      "verified": true,
      "author": "lau",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Great product for the money!",
      "text": "This product is just what we were looking for. The flexibility/lack of hard plastic frame does not take away from the durability or functionality of the board at all. It is a nice size so we can easily keep track of our busy schedule, as well as a place for extra notes. I appreciate the magnetic dry-erase markers as well, so they are always close to the board.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Bass",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Works great! Markers don’t erase well though.",
      "text": "Works great on my fridge. The colored markers do not easily wipe off. Had to draw over it with black marker and then wipe it to get it off. Other than that, just what I needed!",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Wilson",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Attached to the refrigerator easily. Wish boxes were a little bigger because 4 ...",
      "text": "Have only had it up for a week. Attached to the refrigerator easily. Wish boxes were a little bigger because 4 people are sometimes putting in schedules on the same date. Solved the problem by putting an asterisk on the date and utilizing the space up top for the rest of the schedule.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Rice",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Good quality, lined day spaces",
      "text": "Exactly what I needed to keep track of ever-changing appointments. Good quality, large enough for multiple appointments on a day. Helps my dementia patient with orientation and daily activities.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Jo Dechaine",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Basic product, works well, with nice extras.",
      "text": "Magnetic and flexible with good adhesion. Great replacement for my previous one which had magnets only in the corners and kept falling off. Took a few tries to get it on straight, but once you do it stays in place. Comes with multiple markers in different colors which is nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiffany Johnson",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "It works like it should!",
      "text": "I painted a door with magnetic primer and a couple coats of normal paint and the calendar sticks perfectly. I actually purchased 2 of these both are great and the markers have worked flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Convenient",
      "text": "The only con is that by the end of the month the month the black marker is hard to wipe off but just add a little water and its gone, not to mention it's a big magnet so you cal use it to hold things around it",
      "rating": 5.0,
      "verified": true,
      "author": "Ki",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great",
      "text": "Super fast shipping. Comes rolled up but flattened out quickly once stuck to the surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy kolz",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great for on the fridge.",
      "text": "Great for on the fridge. Comes with markers and erasing cloth. Plenty of room to write , and wipes off easily",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah B.",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "👍",
      "text": "My grandma recently got sick and she had 101 appointments and between me my mom and my aunt no one could keep whos turn it was so the calendar was a god sent quite big to.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Good to help stay organized",
      "text": "This is perfect and just what the family needed to be aware of upcoming events",
      "rating": 5.0,
      "verified": true,
      "author": "Lotus Blossom",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Perfect for fridge!",
      "text": "This has been the perfect addition to our household. Organizes the monthly important dates on the refrigerator. Clean and slick appearance, I am so happy I purchased this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Just what I was looking for!",
      "text": "Just what I was looking for and the perfect size! It sticks firmly to my refrigerator and the pens included are just right with the little erasers on top. I'm very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Nerekjo",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Great calendar!",
      "text": "Great calendars! Sticks on well, markers have fine tip, and erase easily. I'll probably order a marker pocket like this one:",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory W. Pratt",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Perfect for Apartments",
      "text": "Perfect especially since it came with it’s own markers. I live in an apartment and this was a much better alternative to put something on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Exactly what it was described to be 🙃",
      "text": "Love it! Just what I was looking for! I do wish it came with a few more colored markers, but I can buy them anywhere. True to product description. &&& bigger than I expected it to be! Very happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "JACKiE",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Perfect for my fridge!",
      "text": "Came on time and wrapped so it was protected. It fits perfectly and the edges stay put, they don’t roll like some I’ve purchased in the past. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "denise feeley",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Large and High Quality Calendars",
      "text": "I bought two of these so I could outline the current month and the following month on my fridge. These are way more quality than I expected them to be and very large. I had to hang one on the freezer door and one on the fridge door because of their size, but that was no big deal. Very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Currier",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "very convenient!",
      "text": "It's very convenient. we like to see all the events on the month, which this calendar helps us to see everything! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mina",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "great buy",
      "text": "I like it. It's coming in handy for the family central station :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Sldgy",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "As advertised",
      "text": "Can't ask for much more than that. Got exactly what I ordered, in a timely manner. Sticks fine, erases easily. Zero complaints on this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken K",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "But this and get on track! Love it!",
      "text": "Exactly what I needed!!! Wipes clean easily. Very magnetic, doesn’t slip or move. Comes with easy wipe markers that have dry erase pads connected. You can also use your own dry erase pens with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Hull",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "One wasn't enough",
      "text": "Received a similar calendar for Christmas. I am the type to fill it out once and get too busy the next month to fill it out again. I bought two of these so I can have 3 months at a glance. It works great",
      "rating": 5.0,
      "verified": true,
      "author": "lt1jane",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Easy erase magnetic calendar",
      "text": "Works well. Fits on my fridge. Everyone in the household can easy add/edit/delete events.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "It doesn't fall off",
      "text": "I bought a regular magnetic calendar but it kept falling off of my refrigerator. This has worked like a charm and doesn't fall off.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Sevier",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Happy mom",
      "text": "Great calendar! Gave 4 stars because you most definitely need to buy expo markers. Ones that are in this set erase terribly. Arrived rolled but flattened with no issues.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Williams",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Great for the price",
      "text": "Good size and perfect for planning with family or roommates. Very easy to clean. Only downside is that the markers definitely aren't the greatest but they get the job done for now. I'll probably purchase Sharpie erasable markers when these wear out.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh Guigar",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Perfect",
      "text": "Perfect for the on the go family and just simply staying organized! Greatly magnetic!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Lozon",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Not so good",
      "text": "The magnet on the markers is so weak the makers fell down all the time. The product doest look like nicely made.. I would not recommend it",
      "rating": 2.0,
      "verified": true,
      "author": "Nilesh K",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Good way to stay organized.",
      "text": "Good value. Works well. Actual item matches product description. I like the magnetic, colored pens. They're handy to store next to the calendar and are good for color coding.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Nice and thin",
      "text": "Nice and thin, great size! The whole calendar is a magnet that sticks very well and each marker has a magnet so they can stay right along side.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Great for monthly planning",
      "text": "Love this product. I write my work schedule on it every month so my dad will see when I get off work at 5 or I work later evenings. Easy to erase. The only thing is the pens fall off the magnet, but if you stick them back on, they stick for a while",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Great",
      "text": "Perfect for writing all my families appointments and activities. Wish I ordered one sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenifer D. Schiller",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Perfect size",
      "text": "Great product, perfect size for an office file cabinet or refrigerator",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Great product",
      "text": "I love this! It came in a small rectangular box, the calender itself was rolled up but easily spread out and stuck onto the fridge. The markers came in the box as well in small bag. The markers all worked and can be easily erased and they do not leave a stain on the calender, which is nice. I would totally recommend this product to anyone who needs a little organization to their schedule.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Wasnt as advertised",
      "text": "I bought this with the understanding the calendar was on the board. This product is simply a white flexible board with a magnet on the back. Unable to use",
      "rating": 1.0,
      "verified": true,
      "author": "Dean Discenza",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Works good",
      "text": "Love how much room for each day there is. Have to scrub a little at the end of the month to clean it off.",
      "rating": 4.0,
      "verified": true,
      "author": "Niccole Simmonds",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Works as supposed to, markers dry though",
      "text": "Works as supposed to, only thing markers run dry fast, I turned them upside down so hopefully that solves the issue",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Runge",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Very Spacious",
      "text": "It is great and the days are large enough to write out multiple tasks. The color markers make it easy to organize priorities. I love it am thinking of purchasing a 2nd one for the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Toni",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Perfect for busy family",
      "text": "Quality calendar - better than others we’ve purchased for higher prices. Easy to clean, stays put on fridge. Large enough to hold info for busy family.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Good product",
      "text": "Perfect for what i needed it for. Hanging on my fridge. Nice size.",
      "rating": 5.0,
      "verified": true,
      "author": "Yak26",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Good product for price",
      "text": "love it only remark is markers are low quality but im just being picky good product for price serves its purpose",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina Leon",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Product Good",
      "text": "Cleaning is a tad hard if writing has been on there for a little bit. Have to be careful when writing or will smudge the days beside",
      "rating": 5.0,
      "verified": true,
      "author": "Memori M.",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Great calendar, poor markers",
      "text": "The dry erase markers are terrible. I had to order a separate package",
      "rating": 2.0,
      "verified": true,
      "author": "Bridgett  Ester",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Good quality product",
      "text": "I enjoyed my purchased. The packaging was excellent. The magnetic board is made of a good quality material. It includes four different color of dry erase markers.",
      "rating": 5.0,
      "verified": true,
      "author": "beka",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Put this on my fridge and I like how it's low profile and stays in place",
      "text": "Put this on my fridge and I like how it's low profile and stays in place. The markers are ok but I just use my own expo markers.",
      "rating": 5.0,
      "verified": true,
      "author": "amysnice",
      "helpful_votes": 0,
      "publication_date": 20180426
    }
  ],
  "product_meta": {
    "title": "Magnetic Monthly Calendar, White Board, Planner, for your Refrigerator or Office 17\" x 13\" Inches ● Includes: Perpetual Dry Erase Calendar- Planner ● 4 Magnetic Color Dry Erase Markers! & Cloth Eraser",
    "description": "Color:White\n\nMagnetic DryErase Calendar Whiteboard Organizer:\n\nTAKE ORGANIZATION TO THE NEXT LEVEL. NEVER MISS AN IMPORTANT DATE AGAIN\n\nGreat For:\n\nSchool, Classroom, College, Dorm, Home, Office, Work,\n\nCan Be Used as a\n\nCalendar,\n\nMonthly Planner,\n\nSchedule Board,\n\nMessage Board,\n\nMemo Pad,\n\nChore Task Chart,\n\nBulletin,\n\nTo Do List,\n\nMade to fit on ANY Kitchen Refrigerator, Thanks to its sturdy Magnet.\n\nKeep in track of school schedule, Teaching Kids, activities, behavior chart. To build good habits.\n\nThere is ample surface to allow you and your family to effortlessly write, Notes, erase, rewrite and exchange ideas, & messages.\n\nWrite Down Your Grocery list, Arrange Household Chores, Track Spending Habits, Plan Ahead for Bill-Paying and Meal planner as a menu board, create a family hub, organize interest and gym class, To-do list appointments, messages and any upcoming Birthday or Events, you want to remember.\n\nReusable & Durable:\n\nErase your magnetic calendar surface with its eraser and get a fresh start! Number each day of the month and stay on track of your plans, for many years to come!",
    "rating": 4.6,
    "feature_bullets": [
      "Our calendar set Includes: 4 Magnetic Dry-Erase Markers. Black, Blue, Green and Red!",
      "Stylish & Attractive: Your 17 x 13 inches Calendar will fit on any refrigerator, mini or full size. Your magnetic calendar will flatten onto your fridge with minimal effort.",
      "Versatile & Durable: High Quality Dry-Erase Board Calendar, Made To Last For Years of Planning!",
      "SAVE TIME: Organize Your Busy Family Schedule. This is a must have for your family.This planner will help you organize those family activities, grocery lists, appointments and busy schedules.",
      "Carefully Packaged: With our Magnetic Board, you can be confident that you'll receive an item packed in a sturdy box and in pristine condition."
    ],
    "specifications": {
      "Manufacturer": "DasKid",
      "Brand": "DasKid",
      "Item Weight": "12 ounces",
      "Product Dimensions": "13.65 x 3.25 x 3.25 inches",
      "Is Discontinued By Manufacturer": "No",
      "Color": "White",
      "Size": "Monthly Calendar",
      "Manufacturer Part Number": "DMC-004",
      "ASIN": "B01M01XVP0",
      "Customer Reviews": "4.6 out of 5 stars635 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#21,833 in Office Products",
      "Date First Available": "October 6, 2016"
    },
    "categories": [
      "Calendars, Planners & Personal Organizers",
      "Office Products",
      "Desktop Calendars & Supplies",
      "Office & School Supplies",
      "Desk Calendars"
    ],
    "price": 9.99
  }
}