{
  "website_summaries": [
    {
      "verdict": "Although these individual pods are pricier than others on our list, the fact that they clean, protect fabrics, and contain one of the most popular fabric softeners on the market makes them a top choice.",
      "pros": [
        "More than just fabric softener, these pods also contain detergent, softener, and a stain fighter to make your laundry tasks easier and more efficient",
        "Includes Downy, a top-selling fabric softener",
        "The brand's SmartSuds formula works well in high-efficiency machines"
      ],
      "cons": [
        "The scent may be too strong for some consumers",
        "A few reports of skin irritation after use",
        "Pods don't always fully dissolve",
        "Expensive compared to other pod softener products"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Use extra rinse for small loads",
      "text": "If you don’t use extra rinse for small loads, the pod will not completely dissolve and when you put in the dryer it will melt and distroy your clothes.",
      "rating": 4.0,
      "verified": true,
      "author": "Lpo",
      "helpful_votes": 64,
      "publication_date": 20180124
    },
    {
      "title": "Pleasant...",
      "text": "Smells nice, so easy to toss in! We far prefer these to measuring out liquid detergent. Some of us (read: me) like to use \"extra\", and quite often the given amount of \"extra\" had no bearing on reality or the clothes being washed - just my mood. These I can throw one in and manage to restrain myself from grabbing more... usually.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 39,
      "publication_date": 20171113
    },
    {
      "title": "I like the idea but they do not fully dissolve every ...",
      "text": "I like the idea but they do not fully dissolve every time and leave a residue of detergent on clothes. It’s happened about 3x already to me. I’m wondering if the temperature of the water helps dissolve it. I’ll be canceling my subscription til tide figures out the issue",
      "rating": 2.0,
      "verified": true,
      "author": "LeahV",
      "helpful_votes": 36,
      "publication_date": 20180316
    },
    {
      "title": "I usually buy the same brand in store and they worked great but these do NOT",
      "text": "I bought these on Amazon, I usually buy the same brand in store and they worked great but these do NOT. THEY 100% do not dissolve completely. Even in hot water. The amount of times I've had to let the \"clean clothes\" wash again to get it off is ridiculous. Not to mention when you don't catch it before it goes in the drier then becomes like plastic on your clothes",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 29,
      "publication_date": 20171115
    },
    {
      "title": "Tide pod Disaster",
      "text": "The tide pods where all over I had to throw it all away not to happy with my order",
      "rating": 1.0,
      "verified": true,
      "author": "michael s hyde",
      "helpful_votes": 22,
      "publication_date": 20180928
    },
    {
      "title": "RUINOUS AND DISASTROUS. DO NOT BUY!!!",
      "text": "These awful, terrible, no good, very bad pods (yes... intentionally incorporating the famous poem, as they have ruined MANY, MANY precious and expensive items of mine, thus ruining many of my days) should be recalled by Tide because of their systematic inability to dissolve in ANY temperature of water, leaving no trace of such failure to dissolve until washed items come out of the dryer and have shriveled pod plastic adhered to the items, thus ruining them. Eventually, I threw them away, as the problem is a CONSISTENT DESIGN FLAW, and not some technical glitch. DO NOT BUY... AT ALL (a better product btw)!!!",
      "rating": 1.0,
      "verified": true,
      "author": "A. Hartman",
      "helpful_votes": 7,
      "publication_date": 20200128
    },
    {
      "title": "THE AROMA!!! Is the BEST!",
      "text": "Tide did it once again! As you open the shipping box, you can smell the downy! These are so good! My clothes smell amazing and so does my closet. My only complain is that it's only 61 pods, I guess because of the downy. But, I wouldn't mind paying a few bucks extra to get their standard 81 like the rest of their pod line....",
      "rating": 5.0,
      "verified": true,
      "author": "LORD-RAMSÉS",
      "helpful_votes": 18,
      "publication_date": 20170801
    },
    {
      "title": "Yes, please",
      "text": "Tide and Downy, my two favorite products in one convenient pod. I read somewhere last year that Persil is supposed to slightly out perform Tide, but it smells more definitively masculine. Downy just smells like clean to me. You'd have a hard time beating this easy-to-use pod, too - toss it in the wash and you are done.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 12,
      "publication_date": 20180224
    },
    {
      "title": "Ruining Clothes",
      "text": "Used these and now clothes are constantly having blue stains on them that do not come out. Used in HE Front Load washer and they are garbage!",
      "rating": 1.0,
      "verified": true,
      "author": "Tony and Jenifer Laurvick",
      "helpful_votes": 7,
      "publication_date": 20190505
    },
    {
      "title": "Not great",
      "text": "I prefer regular Tide Pods after buying this. I still have to use separate fabric softener so it defeated purpose. Plus there's less Tide so clothes aren't as clean. Ive been buying Tide and Downy over 30 years both products are all I buy in fact for laundry, they are best on the market. However, this product combines the two. I thought it was great idea but it isn't. It's like shampoo and conditioner combined then neither works as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazonion Shopper",
      "helpful_votes": 3,
      "publication_date": 20200218
    },
    {
      "title": "Great product! Excellent service!!",
      "text": "I have been buying these through the Subscribe & Save program for about a year now. They have always arrived in great condition & they work fabulously! I love the extra scent of freshness that the fabric softener adds to our clothes! They aren’t nearly as messy as the liquid detergent either, and if I’m washing extremely dirty clothes, I just throw in a 4th pod or a tiny bit of dish soap. I also love that by using Subscribe & Save, I don’t need to worry about whether or not my preferred laundry detergent is in stock at the store.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 2,
      "publication_date": 20200627
    },
    {
      "title": "Been waiting so long for this scent!",
      "text": "I am sensitive smell and the April downy is my favorite. Why Tide took this long so make the scent is beyond me. Thank you Tide and please keep making this!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Davis",
      "helpful_votes": 14,
      "publication_date": 20170402
    },
    {
      "title": "All the pods  are stuck together",
      "text": "This is the 2nd delivery in a row That they are together I even get limited use of it or no use of it.",
      "rating": 4.0,
      "verified": true,
      "author": "VandaVisions",
      "helpful_votes": 5,
      "publication_date": 20190814
    },
    {
      "title": "Same Tide Quality but Read Directions",
      "text": "This is yet another great convenient detergent product. Same great Tide preformance... Just be careful to store the container in a dry location. I mistakenly/stupidly left mine in a damp humid basement. Overtime the pods started to stick together. What a mess!... As stated, this product, as many like them, are designed for convenience; just toss one or two in and your done. If your after value for your buck, stick with the liquid.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel B",
      "helpful_votes": 3,
      "publication_date": 20181129
    },
    {
      "title": "Cleans clothes great",
      "text": "I like these pods and the smell just not a fan of using more than one, they’re expensive when you factor in how many pods for each wash versus liquid soap. I have the Cabrio washer/dryer set and have noticed that sometimes the pods will leave a residue on quick washes so I don’t use that setting anymore with pods. My husbands work pants get really dirty and these clean them nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Don’t dissolve- clothes are a sticky mess",
      "text": "Not sure how these differ from the ones I buy locally but these do not fully dissolve and leave a sticky, slimey, gooey mess all over your clothes!!! They ruined my sons Ralph Lauren shirts after they went into the dryer with that plastic residue left behind.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Gift For You",
      "helpful_votes": 2,
      "publication_date": 20190912
    },
    {
      "title": "Very handy and does an excellent job on the clothes.",
      "text": "I prefer this detergent with fabric softener. Unfortunately my warehouse store no longer carries it. The Amazon price is as cheap as Walmart and I get it to my door for about the same price. It is really nice to not have to pick up different bottles of detergent, fabric softener and non-bleach booster. I never would have believed or tried this stuff if a friend had not recommended it. It might cost a tad more per load, but it is so convenient that it is worth the price..",
      "rating": 5.0,
      "verified": true,
      "author": "MartnGale",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great smell and price",
      "text": "So far this is the best tide pods i have bough. The smell is great and i usually need just one to wash my clothes",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Cole Pfeiffer",
      "helpful_votes": 4,
      "publication_date": 20180427
    },
    {
      "title": "Good product bad packaging",
      "text": "These are great clean good smell fine and so easy to use. That word of advice they cannot get any moisture or they will stick together and you cannot get them apart without ruining the whole batch I didn't leave the Box people let it monster. In it and I tried and tried everything to get them apart without busting them but doesn't happen so I have a bucket full of jelly I guess I'll try to scoop",
      "rating": 3.0,
      "verified": true,
      "author": "HPJ",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Love love love",
      "text": "Love love love love love this product!! Will always buy this laundry soap from now on! Smells great! Leaves the clothes smelling great soft and colors bright! Never have to buy fabric softer again .",
      "rating": 5.0,
      "verified": true,
      "author": "JoM75",
      "helpful_votes": 3,
      "publication_date": 20181219
    },
    {
      "title": "I wanted to hate but I love",
      "text": "I really wanted to hate these. Like, who is so lazy they can’t pour in a couple of laundry treatments? Me. If your that person that washes and dries and then actually folds all your laundry before it wrinkles... maybe you don’t need this easy button. But if you are like me, a working business owner mom with three kids, two dogs, a partridge and a pear tree and your laundry is lucky to make it to the dryer before it smells - much less a hanger... These are for you. All that soap, softener, stain reduced and smell good stuff that you me both know you’re not adding if it isn’t in a couple done for you easy tabs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jena Apgar",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Get ready for an OVERPOWERING scent",
      "text": "OMG. This subscribes to the theory that if a little fragrance is good, more must be better. This version of Tide delivers an overwhelming fragrance that clings to your clothes like no one’s business. I had to re-wash everything so we didn’t smell like we spilled a perfume bottle all over. Now I’ll have to either return this or figure out how to salvage the pods in some way. Uggghhh. A huge disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Philippians 4:13",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "My wife's hand won't fit to open it, so she does not want to order again",
      "text": "My wife is sort of small, 5' 3\", but I would not say her hand is unusually small. She can not fit her hand around the container to open it. The product itself is great, but she does not want it since she has to get me whenever she does the wash. I have never liked Tide, but this one is great. Too bad the container is going to keep it out of the house. I do the wash more than she does, maybe I will get some for my use.",
      "rating": 3.0,
      "verified": true,
      "author": "surprise",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Residue leftovers depends on your washer",
      "text": "I really like tide pods. They work fantastically with my washer at home. Clothes are clean and no residue; however, when I was in college and used them, they regular left a gross residue stuck to my clothing. So it really seems to depend on the washer. I would test out a few first with your washer before buying a whole container.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Get Downy without a washering machine dispenser",
      "text": "We left a house with a high efficiency, large capacity washing machine that has a fabric softener dispenser. Now we live in an apartment with a tiny, agitator washing machine with no dispenser for Downy. Tide worked before. Now Tide pods with Downy help us get our clothing both clean and treated with Downy.",
      "rating": 5.0,
      "verified": true,
      "author": "Country Doc",
      "helpful_votes": 2,
      "publication_date": 20180205
    },
    {
      "title": "Tide gave me a full refund!",
      "text": "I liked the idea 4-1 pods, but mine started to leak, dissolve the day I rec’d them. Amazon discounted my order but the manufacturer needs to repackage these and reinforce the pods. I probably won’t buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "John R. Lowe",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "and they smell great too.",
      "text": "So much easier to do laundry with these pods, and they smell great too.",
      "rating": 5.0,
      "verified": true,
      "author": "Arielle",
      "helpful_votes": 4,
      "publication_date": 20170918
    },
    {
      "title": "Very easy to use, extremely convenient",
      "text": "Very easy to use, extremely convenient . Haven't had any issues with staining clothes - just drop them in the bottom of the machine before loading clothes. Don't need to bother with a measuring cap or cleaning up drips of detergent anywhere. I thought the pods might burst or be fragile, but no issues whatsoever.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Lee",
      "helpful_votes": 2,
      "publication_date": 20181026
    },
    {
      "title": "Handy!",
      "text": "Tide Pods are an extravagant purchase, in my opinion, but we buy them nonetheless! So handy to use, and, you know, its TIDE, so your clothes get clean!! -but finding the blend with Downy included isn't always easy in my small-ish town, so I'm glad I can count on Amazon to carry that variety!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "We love the pods",
      "text": "We love the pods. April Fresh is the best scent. Regular not so great. Dean Gould: Greatest Sales Book Ever Written; join the fight against cancer.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Gould",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "Tide PODS Plus Downy 4 in 1 HE Turbo Laundry Detergent Pacs, April Fresh Scent",
      "text": "I LOVE THE FRESH SCENT OF TIDE. IT HAS BEEN A LIFE TIME PRODUCT FOR ME. THE PODS ARE A GREAT IDEA AND I DON'T WASTE THE DETERGENT. SMART IDEA TIDE.",
      "rating": 5.0,
      "verified": true,
      "author": "Giggles",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Not worth it. Won't buy again",
      "text": "Most of the time, the dark clothes have white stains left behind from the pods and the scent doesn't last more then a day. The stains and dirty on clothes come out the same way they went into the washer. Very disappointed in Tide.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 2,
      "publication_date": 20190516
    },
    {
      "title": "Reliable and that's what it says it's going to do which is get my clothes clean",
      "text": "This is about the same price as if you purchased it at Walmart but the plus that it's coming right to your door so it's one less thing I have to haul into the house. Tide is an excellent product however I will say that I don't use it every washing because it does tend to where the fabric material",
      "rating": 4.0,
      "verified": true,
      "author": "Tricia Maestre",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Yes Value...Real Savings...",
      "text": "As an old critter who can’t control the “more is better and much more is even more better”. These little packets of Tide save me money. When I load the laundry, normally I just keep pouring and pouring the liquid Tide in washer. My clothes get treated to 3x or 4x times what’s necessary. Love them PODS.",
      "rating": 5.0,
      "verified": true,
      "author": "Bidwell",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Easy and quick",
      "text": "Love the ease of these. They work great regardless of water temp. It arrived pretty beat up in transit but nothing was destroyed.",
      "rating": 5.0,
      "verified": true,
      "author": "DEB",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Love",
      "text": "Love these pods Came in faster than originally stated. Great scent and got them for a great deal",
      "rating": 5.0,
      "verified": true,
      "author": "Deja",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Tide is cool",
      "text": "You get what you pay for with Tide. Cleans the best and smells good too. The pods make it easy. They taste fantastic also.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Karman",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "It's tied, what else can you say",
      "text": "Despite product works exactly as the laundry detergent should. It is kind of nice having that little Downey Fabric Softener added to the packet oh, because I'm always forgetting to add the fabric softener. I do think you pay a little more just for the name",
      "rating": 3.0,
      "verified": true,
      "author": "cdewitte",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great for anyone who is really busy",
      "text": "These are great for the price. Most stores sell this size for more. You definitely get the best deal on here. I love the scent and that you can just throw it in the washer and your good to go ! The only issue I've had is where it get stuck in a blanket or shirt and the outer part didnt dissolve. Instead it would be sticky on it. So you have to rewash. This doesnt happen often. It also does amazing with keeping everything smelling fresh !",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Wells",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "The Gold Standard",
      "text": "Predictably awesome Tide. Products are made by Procter & Gamble in Cincinnati Ohio. They are American made and always have been a predictable laundry soap my entire life even before they were pods Procter & Gamble in Cincinnati Ohio.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert M.",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Works great and smells like the Downey I know",
      "text": "So far my conversion from Tide liquid and Downey to these pods has been great. I’ve done a weeks worth of laundry, so darks and athletic wear, white towels and bed sheets and everything has come out perfectly. These are all liquid pods and seem to dissolve with no problems (unlike what other reviewers have said).",
      "rating": 5.0,
      "verified": true,
      "author": "SBraun",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Tide Pods with Downey, hard to find",
      "text": "I love these pods. Had been having trouble finding them. Happy to have found them & shipped to me! They work great & smell great too. I like using these and gave up my Downey Ball (since my washer doesn’t have a softener dispenser)..",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "They break too easily, pondering whether I should keep getting these...",
      "text": "The \"pods\" are more like \"bubbles\" too fragile and they break on their own. This is more of a problem and defy their purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "Liliana",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Complet mess",
      "text": "This container came with pod open or leaking, make them sticking to one another. This is the firat time it has happened n hopefully the last",
      "rating": 1.0,
      "verified": true,
      "author": "carmen urena",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "My favorite scent",
      "text": "I have used tide for years, but I was so happy when they came out with the pods. I have limited use of my hands now so it's a necessity, not just a convenience. I have tried other varieties, but Tide plus Downy is still my favorite.",
      "rating": 4.0,
      "verified": true,
      "author": "Darling Nikki",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "It’s hard to mess this up.",
      "text": "I used this for washing and not consumption so some of you may consider this an incomplete review. I apologize in advance.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Grew up on Tide and Downy",
      "text": "When I was young girls would tell me that my brother smells so good. He didn’t wear cologne so I was confused. But they clarified that he would smell like laundry. Who knew? I grew up with this stuff and have never dared to change. Now it’s a two in one. Nice!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Young",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Convenient and great smell",
      "text": "Love these pods. The smell is amazing. These are perfect for those who are multi tasking while doing laundry. I usually forget I'm washing and have to run the rinse cycle again to add the softner, but not anymore. I throw these in with my clothes and set a timer and just throw the clothes in the dryer. So convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Namiko Minakata ",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "So easy to use and store!!",
      "text": "The pros? So easy to use! Simply size up your load and choose how many pods you need! Smell GREAT, can always count on my consistently perfect results with these pre measured lovelies. Perhaps not the most cost effective, but for a single person, the pods last a LONG time!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda VanBeek",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Wonderful sent",
      "text": "Excellent value and the aroma is awesome after taking it out of the washer and even after the dryer. It was improperly shipped and the top clip broke, but otherwise excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert X.  Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Static",
      "text": "I wanted to try the softner and soap combo. I think in the future I will go back to the soap and dryer sheets. This product leaves a lot of static in the clothes.",
      "rating": 4.0,
      "verified": true,
      "author": "CJC",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Great gift for a freshman",
      "text": "Freshman greatly appreciated the gift. We also provide $25 dollars worth of quarters. Very practical gift for a freshman female living in a dorm..",
      "rating": 5.0,
      "verified": true,
      "author": "Overcomer",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Easy to Use",
      "text": "It's nice to just drop this in the washing machine and run the load without watching time to add fabric softener. And the pods don't stick together even in 100 degree weather. However, I like the portion control of liquid Tide better.",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Too big for Detergent Tray of Inverter Washing Machine",
      "text": "They are too big/fluffy/puffy to fit in the 'detergent tray' of my new LG Inverter Direct Drive fancy washing machine, especially if I want to use 2 pods. They always leave residue in the tray, that I have to wipe away with a paper towel, after every wash. Very disappointing. Maybe if you don't have this type of limit on your machine, you can use. I've even tried removing the insert inside the tray, just caused the pods to not fully dissolve.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa C.",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "5 Stars!",
      "text": "The very best detergent! Great product great price and very fast shipping especially with everything going on right now. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Angel Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Love the smell",
      "text": "Love tide! I’ve tried knock off brands but nothing compares! Makes my whole house smell good like fresh laundry. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Smells great",
      "text": "Works and smells great just use a jew more pods than what it says on the container. I always use two to three just because I'm a dork with OCD and just want to think its clean and fresh . :)",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Finally",
      "text": "I just love this product bc I have sensitive skin. Since I've started to order this product no more breakouts from strong detergent",
      "rating": 5.0,
      "verified": true,
      "author": "Sephronia Bravo",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Stains!!",
      "text": "The pods work very nice and do their job efficiently. However, my clothes get stained really bad to the point that I’m scared to wash certain items. It sucks because there is no way to get the stains out so they are there forever and my clothes are ruined.",
      "rating": 2.0,
      "verified": true,
      "author": "Yelka Jiron",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good scent and downey keeps dog hair at bay.",
      "text": "Smells great, keeps my clothes clean and the added Downey inside each pod helps keep the dog hair from clinging to my clothes all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "LOVE!",
      "text": "I see the pods getting 1 star reviews for the way amazon is shipping the pods, the pods themselves work really well! I have a very active family, my husband works construction and both my kids are in a lot of sports, there is nothing the pods have not been able to handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "I love tide pods!",
      "text": "I love tide pods! My clothes and sheets felt and smelt clean, the only thing I would change is the floral scent is a little too strong for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Ally",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "The freshest clothes",
      "text": "I absolutely love TIDE. The pods are easy and simple to use. I find for best results to put the pods where the water can reach easily Clothes always smell fresh and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Wells-White",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "TIDE + DOWNY = HECK YES PLEASE",
      "text": "Why on EARTH wouldn't you get these? They reduce time measuring out laundry AND downy, they make your clothes smell good, they work well--why are you reading this!? Go get them! It's Tide and Downy in one, all you have to do is get dryer sheets!",
      "rating": 5.0,
      "verified": true,
      "author": "Wavecrest",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Can't live without it!",
      "text": "This was a great purchase. Love the item. The big package is great for a household of plenty. The smell is the best ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebeca Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Bad product",
      "text": "The pods stick together in the package, and when you try to pull them apart they break, spilling liquid everywhere. I was going to purchase the Amazon brand but decided to go with Tide because it’s a namebrand and I thought it would be better. I am very disappointed with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "George K Kline",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Exactly what you’d expect",
      "text": "There is no better detergent than Tide. Pods are super convenient and they made good childproof packaging.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi C Korsmo",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Very good price",
      "text": "I loved everything about the products washed my clothes very good and the downy smell lasted for a long time",
      "rating": 5.0,
      "verified": true,
      "author": "Abraham Rangel",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "4in 1",
      "text": "Subscription product, since it is 4 in 1. And after washing the clothes, they are not hard at all",
      "rating": 3.0,
      "verified": true,
      "author": "dreamung",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Loving the pods!",
      "text": "Never used Tide pods before but now I can’t imagine not using them! So easy! Having them on auto ship ensures I don’t run out, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacie A.",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "This cleaning clothes wonderful,l high recommend",
      "text": "I loved this laundry pods The smell is so goood! I already bought and always buy this laundry pods",
      "rating": 5.0,
      "verified": true,
      "author": "Edna Luiza",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Great stuff!",
      "text": "Who doesn't love Tide? This is the main brand we use at my household and always continue to buy more as needed. Can't beat it!",
      "rating": 5.0,
      "verified": true,
      "author": "InfiniteReality",
      "helpful_votes": 2,
      "publication_date": 20170607
    },
    {
      "title": "Love this product!",
      "text": "I wish they didn't come exploded... The shipping box was to small. Its are useless now. 🙄",
      "rating": 2.0,
      "verified": true,
      "author": "Kay dollars",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "A must have!!",
      "text": "Glad I purchased this tide pods! smell great 4 in 1 downy is my favorite! Will contine to buy this... scent stays on clothes!!happy camper.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosalinda",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "easy to use",
      "text": "Love Tide with Downy I can skip the fabric softener because it's already in this",
      "rating": 5.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Heavenly clean clothes!",
      "text": "Love love love Tide pods so refreshing and clothes so soft. The smell is heavenly!",
      "rating": 5.0,
      "verified": true,
      "author": "E wiggins",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "I❤️Tide pods",
      "text": "What would we do without pods. Keeps washing machine clean. No messy spills. No fabric softener to buy extra",
      "rating": 5.0,
      "verified": true,
      "author": "Happy legs",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Scent is not that strong",
      "text": "Scent is not that strong. I usually put more than one for a small load.",
      "rating": 2.0,
      "verified": true,
      "author": "Dharshanie Shivnarayan",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "SO easy to use",
      "text": "Love to have just one product with the softener inside. Smell is just plain fresh and I love that!",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great value for the money.",
      "text": "Glad I could find the pods on Amazon. Hard to find in the stores. Love the pods.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne J.",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Great Product",
      "text": "These pods are great for softness and clean clothes. Well worth the money..",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia Stromme",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "A great product by Tide",
      "text": "Another great product by Tide with the addition of fabric softener. A+",
      "rating": 5.0,
      "verified": true,
      "author": "James Andrew",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Trusted product",
      "text": "I wash everyday so I use three at a time. One or two for me doesn’t work well",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Krupp",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "What's not to like?",
      "text": "What's not to like? Quick convenient and no mess. I absolutely love the scent of these Tide Pods! I have yet to find a laundry detergent that works as well as tide, I will absolutely be buying this product again!",
      "rating": 5.0,
      "verified": true,
      "author": "MommyDearest",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Can’t go wrong with tide",
      "text": "Tide pods are the most convenient way to do laundry economical",
      "rating": 5.0,
      "verified": true,
      "author": "Аmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "As expected",
      "text": "Capsules are good overall, but sometimes leaves some soap stains on the clothes,",
      "rating": 3.0,
      "verified": true,
      "author": "H.R",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Nice and easy",
      "text": "Love the pods. No more lifting the heavy bottles. Just pop 1-2 in and done. Laundry smells good and no dryer sheets needed, downy is in the pod.",
      "rating": 5.0,
      "verified": true,
      "author": "Sassy",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Great smell",
      "text": "Just the same as in stores and you don’t have to go shopping",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Easy Washing",
      "text": "Works as well as any liquid. And gets triple the loads.",
      "rating": 5.0,
      "verified": true,
      "author": "Billsreview",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Never going to switch again",
      "text": "I really can see the difference in clean when I use Tide",
      "rating": 5.0,
      "verified": true,
      "author": "MaggieMurphy",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "... the fools eat these things they really do a great job. I usually use one pod per washer ...",
      "text": "Aside from all the media hype about the fools eat these things they really do a great job. I usually use one pod per washer which is about $.32. Very much worth the money. I never get any soap stains like with the powdered detergent. I have purchased these over and over.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Get more pay less",
      "text": "Love the fact i get more from here than at the store . only thing alot of the ones at the bottom busted open or we're leaking which left it a bit messy but all in all super pleased highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Gemini queen",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "These store well, work great, have a good price",
      "text": "Work as expected, good value for a standard name brand. No complaints or issues whatsoever",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Great Pods",
      "text": "I thought they will arrive all melted but they actually arrived in very good condition during the summer months of Chicago, and they actually last for the entire month, I have the subscription so this works great for me.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ Cotton",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "An amazing classic scent",
      "text": "I love using these pods. They smell is absolutely amazing! They are so user friendly. It seems like they last forever!",
      "rating": 5.0,
      "verified": true,
      "author": "Bree Lewis",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "So so good!",
      "text": "I love everything about these! Costco users have this scent but now they only have the original... price is way better at Costco but I love this scent so much I'll buy them here.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica D.",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Happy with Tide",
      "text": "Tide is the best. My clothes come out clean and smell really good. They are easy to use and dissolve well. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi Bingham",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Love using tide pods",
      "text": "Love using tide pods, because they are so simple to use. So simple to just toss them in the washer and these have such a great classic scent",
      "rating": 5.0,
      "verified": true,
      "author": "Juana",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Remember,  don't eat these you crazy teens.",
      "text": "Works great on my clothes, and the large size and getting this delivered is very convenient for my busy life.",
      "rating": 5.0,
      "verified": true,
      "author": "Kourt",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "It makes your clothes soft",
      "text": "This is the only soap that I buy and I will buy it again as soon as I run out.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Maxwell",
      "helpful_votes": 0,
      "publication_date": 20200624
    }
  ],
  "product_meta": {
    "title": "Tide PODS Plus Downy 4 in 1 HE Turbo Laundry Detergent Pacs, April Fresh Scent, 61 Count Tub - Packaging May Vary",
    "description": "Size:61 Count (Pack of 1)Tide PODS + Downy laundry detergent pacs offer the Tide clean you love, now with Downy Fabric Protect Stretch. Use these 4-in-1 laundry pacs to clean, protect colors, fight stains and protect your clothes from damage in the wash. The proprietary technology allows you to clean and condition your clothes in 1 step helping protect them from stretching and fading in the wash. And the innovative, multi-chamber design separates key ingredients until they hit the wash for maximum cleaning power.",
    "rating": 4.8,
    "feature_bullets": [
      "Only Tide PODS Plus Downy cleans and conditions in 1 step, helping protect clothes from stretching and fading in the wash",
      "Tide PODS plus Downy have the signature Downy April Fresh Scent for outstanding freshness. The tide PODS have been thoroughly tested on all sorts of laundry conditions and are safe for both whites and colors.The pods are also HE-compatible",
      "Tide PODS are small but powerful. They pack 6X cleaning power* with an innovative, multi-chamber design separating key ingredients until they hit the wash for maximum cleaning power (*Based on stain removal performance of 1 pac of Tide PODS vs 6 doses of the leading liquid bargain brand base variant in a standard top loading machine)",
      "Each Tide PODS is 4-in-1 including laundry detergent, stain remover, color protector, and Downy Fabric Protect technology. MEA laureth sulfate acts as a cleaning agent",
      "The special film that enables the 3-in-1 breakthrough technology dissolves in both hot & cold water. Tide PODS are formulated with quick collapsing Smart SudsTM, targets tough stains and works in both HE and standard washing machines"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.5 x 8.75 x 10.25 inches; 4.1 Pounds",
      "Item model number": "10037000977855",
      "Date First Available": "October 10, 2016",
      "Manufacturer": "Procter & Gamble - Pampers",
      "ASIN": "B01MFI1M6P",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Household Supplies",
      "Detergent Pacs & Tablets",
      "Laundry",
      "Laundry Detergent",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 19.21
  }
}