{
  "website_summaries": [
    {
      "verdict": "Its $150, £120 or AU$200 price tag certainly puts it in an exclusive class, but the Elite controller is one of the most customizable, comfortable and luxurious controllers we've ever used.",
      "pros": [
        "The Elite controller is an ultra-satisfying, high-end Xbox One and PC controller that offers an impressive amount of customization on its analog sticks, D-pad and triggers, and introduces back paddles",
        "The Xbox Elite app allows for even more personalization, including the ability to remap every button on the controller"
      ],
      "cons": [
        "It's tough to justify that hefty price",
        "The back paddles are very easy to hit accidentally if you're not accustomed to them",
        "Rechargeable batteries would not have been too much to ask"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 8.0
      },
      "publication_date": 20151022,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Waste of Time & Money",
      "text": "Damaged product. Don't waste your time!! Had two sent and both were damaged or not functioning properly. Paid for 2 day shipping only to have to send it back. These are not refurbished, obviously.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon Rouse",
      "helpful_votes": 83,
      "publication_date": 20170316
    },
    {
      "title": "Don't buy from this seller",
      "text": "This \"certified refurbished\" product came with a ton of thumbstick drift; complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Shane Krueger",
      "helpful_votes": 55,
      "publication_date": 20170624
    },
    {
      "title": "This product is used, but not refurbished. Left ...",
      "text": "This product is used, but not refurbished. Left bumper was broken; literally falling off of the controller. Left paddles were not functioning properly. Whatever button mapping was assigned to the upper left paddle, the lower left paddle also assumed this mapping, regardless of how I explicitly mapped it in the configuration. Will be returning the product and buying brand new instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Don G.",
      "helpful_votes": 46,
      "publication_date": 20170706
    },
    {
      "title": "Don't trust what you read",
      "text": "Normally don't like to give bad reviews but this elite controller that was refurbished doesn't feel like it was actually Certified refurbished it was in good shape as in no marks but it constantly loses connection and the y button is sticking I've only had it a couple weeks.i would not buy from these people as in this is something in my opinion easily find as a problem if properly tested before it was resold as a refurbished controller.",
      "rating": 1.0,
      "verified": true,
      "author": "Lance",
      "helpful_votes": 36,
      "publication_date": 20170922
    },
    {
      "title": "Thanks but no thanks.",
      "text": "Product came in damaged. As this was purchased as a gift i am so disappointed, but i mean not surprised i guess. Should've known to buy brand new from the manufacturer. I am making a return and plab to buy a brand new product from the Microsoft store. Thanks anyway.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 91,
      "publication_date": 20170210
    },
    {
      "title": "Wrong accessories sent",
      "text": "The add on accessories in the back were wrong. Instead of getting a left and a right piece we received two right pieces. So the extra switches won't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Michaela",
      "helpful_votes": 47,
      "publication_date": 20170813
    },
    {
      "title": "Still has stick drift.",
      "text": "Bought a refurbished control because I figured it would have already had drift issue, and been corrected. Wrong. Not even 30 days of use before drifting appeared.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabe",
      "helpful_votes": 33,
      "publication_date": 20170814
    },
    {
      "title": "What happened to 360 durability?",
      "text": "Got it and it had a faulty joystick the first day, there's an option to help reduce it but it's still present",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 49,
      "publication_date": 20170328
    },
    {
      "title": "same as others",
      "text": "Controller arrived and didn't work w/in hours of using it. I had just started playing a game when my right control stick started sticking...the play movement kept defaulting upwards. Obviously you cannot play games like this...had to return...and the part I really don't appreciate - I had to PAY to return the controller. To get my money back - I had to pay myself to return this. Sad. I should have saved money and bought the NEW controller instead of this refurb. I've never had a problem with getting refurbished items before...this is my first negative experience. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190120
    },
    {
      "title": "Great controller. Short lifespan. Overall waste of money.",
      "text": "I won't lie, this is the best controller ever. But the price is ridiculous given the short lifespan. LB, RB, RT, LT buttons are dislodging from the controller. I will never buy this again.",
      "rating": 2.0,
      "verified": true,
      "author": "Rel and Quartknee",
      "helpful_votes": 11,
      "publication_date": 20180224
    },
    {
      "title": "Poor quality",
      "text": "The joystick retaining ring fell off within a month, and the right bumper fell out two months later. Update: I have received a warranty replacement. We will see how well this one lasts.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard B.",
      "helpful_votes": 5,
      "publication_date": 20190313
    },
    {
      "title": "Inconsistent Performance",
      "text": "Perhaps it’s user error but difficult to program and inconsistent performance. Buttons don’t always function as programmed. I play FPS games. Since I lost 3 fingers on right hand many years ago, was hoping this controller would solve my obvious handicap caused by using standard controller. Unfortunately, it hasn’t and I wasted $150",
      "rating": 3.0,
      "verified": true,
      "author": "S G.",
      "helpful_votes": 2,
      "publication_date": 20191203
    },
    {
      "title": "Frustratingly gross and non functional",
      "text": "The controller is heavily used- calling it renewed is a stretch. LT sticks, LB was not properly connected and needed fixing, sync button was stuck inside the controller, clearly a used but never cleaned controller, and there are visible scratching (which on its own, wouldn’t be an issue). Since the sync was jammed and couldn’t be clicked, if I didn’t have the skill to fix it, this controller wouldn’t have worked. Luckily for me deconstructing the controller is literally why I got it. Just an FYI. If you are a germaphobe, just buy new.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh Allington",
      "helpful_votes": 2,
      "publication_date": 20191103
    },
    {
      "title": "Gross",
      "text": "This control came in the most banged up nasty shape I have ever seen scratches paint marks and sticky box and buttons gross.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Campodonico",
      "helpful_votes": 4,
      "publication_date": 20191019
    },
    {
      "title": "Not too good to be honest",
      "text": "Fresh out of the box, upper right paddle was a little worn, obviously the last user's hot key. The audio fizzed out about a week of having it so now I can't plug in any audio device, whatsoever without hearing Satan coming through. Other than that though everything else works.",
      "rating": 2.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 2,
      "publication_date": 20190728
    },
    {
      "title": "Didn't withhold the standards of \"Verified Refurbished\"",
      "text": "They say that the product will not have noticeable damage from 12 inches away. Which mine had a damaged LT button, wear on the handles, and obvious wear on the thumbs that could easily be seen from 12 inches. The battery section had some residue on the connection spots which is not the safest thing. This controller felt and looked like it had been used for years. Not worth the price at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190807
    },
    {
      "title": "Not worth the time",
      "text": "Returned 1 because the drift stick was faulty recieved another with the same fault. Either they returned the same controller or they just don't know how to repair the drift stick problem which isn't always dirt. This is a comman problem with these controllers.",
      "rating": 1.0,
      "verified": true,
      "author": "mrs a a knight",
      "helpful_votes": 3,
      "publication_date": 20190131
    },
    {
      "title": "Not worth the savings",
      "text": "Ordered the XBox one Elite controller in hopes to save a few bucks but it turns out you get what you pay for. The first one came in and the rubber started to peel off withing the first day of having it. Returned that one for a replacement and the seconded one came in as if everything was loose inside. I would have lived with it if I paid $20.00 but at $120.00 that is a No Bueno in my book. Save the money and just buy a new one or wait for the second version like me.",
      "rating": 1.0,
      "verified": true,
      "author": "Xterra_Shadow",
      "helpful_votes": 2,
      "publication_date": 20190904
    },
    {
      "title": "ELITE",
      "text": "First one I bought had a paddle button broken. Which is annoying because that is the point of the product really. I notified amazon and had a new one the next day with a few weeks to return to the broken one. The one I currently use is great. Just an awesome controller overall. The left analog stick is a little loose from the prior user but that is bound to happen with these. Treat them well and they treat you well.",
      "rating": 4.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Do not buy refurbished controllers!",
      "text": "Bought this controller and was excited to find one a bit cheaper. What a waste of money! The right stick drifts so bad that it makes it hard to play games! Now I have to buy another one!",
      "rating": 1.0,
      "verified": true,
      "author": "GCP",
      "helpful_votes": 4,
      "publication_date": 20181215
    },
    {
      "title": "They don’t test products",
      "text": "I bought one controller from them and immediately the left grip started to peel, and there was a drift in the right thumb stick. I returned it and ordered another one, giving them a second chance. That was a mistake. The left grip started peeling again, and the left D-pad didn’t work. This means that they didn’t even test the product after “fixing” it. The elite controller is a great controller, and I’ve never had a problem with peeling grips, meaning it was a fault of the company and not Microsoft. I recommend buying an Elite controller, but save yourself the hassle and buy from a company who cares about your time.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason A.",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Don’t buy from this seller",
      "text": "Hey I thought I could beat the odds. But this controller came twice and it’s been broken both times first it was the left stick, didn’t work. And then the syncing button on top of the controller was broken. But if I am paying so much for a controller, I was it to be perfect. DO NOT BUY FROM THIS SELLER!!",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathon Jackson",
      "helpful_votes": 2,
      "publication_date": 20191126
    },
    {
      "title": "Worthless",
      "text": "The A button stopped working sometimes, the grip is peeled back and it didn't even come with batteries. Don't buy from this seller. A second controller wast sent out. And now the head phone jack doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Guy",
      "helpful_votes": 3,
      "publication_date": 20191106
    },
    {
      "title": "Sellers read this",
      "text": "The joystick was loose and when ever you pick up the controller it rattles inside. DO NOT BUY TGIS PRODUCT BUY THE OTHER LISTING. I did not even play once with it before it started having issues. I bought another and the headphone jack stopped working",
      "rating": 1.0,
      "verified": true,
      "author": "Jm",
      "helpful_votes": 3,
      "publication_date": 20191025
    },
    {
      "title": "Total ripoff garbage",
      "text": "Absolutely the biggest scam of my life. Terrible quality. had the controller for less than three months. Gently used, we'll taken care of. The joystick pops off regularly, the RB button falls out, the headphone jack stopped working. The rubber grips stink. I literally smashed the damn thing into peices today as it's literally a worthless paperweight and the biggest waste of money I've ever seen. I'm very angry this product was even sold to me. I've been ripped off. I'll not be buying xbox anymore period. PS4 products are far superior.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "BUY IT NEW THEY DO NOOOOOOOT CLEAN OR EVEN OPEN RHE CONTROLLER",
      "text": "It is not \"refurbished\" they wiped it with a Clorox rag the inside is absolutely disgusting I opened it up after a week of my pause button getting stuck in and the thumb pad not working I ripped it apart (VOIDS ANY WARRANTY) and fixed it better than who ever refurbished it",
      "rating": 1.0,
      "verified": true,
      "author": "Evan justin",
      "helpful_votes": 2,
      "publication_date": 20190307
    },
    {
      "title": "It’s a preference not an advantage",
      "text": "You get what you get. You’ll have a slight more steady aim and more customization, but at the end of the day you need skill to get the job done. It’s extra buttons usage is only good for some people. Control stops may feel good but not necessary. Extended sticks are busy. Nice grip. Using the custom aim tech nice for right stick may be usefull. But at the end of the day I figured it’s best not to modify it for games like overwatch and maybe apex shouldn’t either. Fortnite might be very usefull. No plays cod.",
      "rating": 3.0,
      "verified": true,
      "author": "UNKNOWN",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Get new employees",
      "text": "Controller arrived today. Unpackaged everything, plugged it in and it doesn't work. You figured you're paying over $100 for something and they'd at least check if it worked right? Thanks for wasting my time.",
      "rating": 1.0,
      "verified": true,
      "author": "Zach Horton",
      "helpful_votes": 3,
      "publication_date": 20191114
    },
    {
      "title": "Controller looks and works like new",
      "text": "The controller was delivered just yesterday. So far, so good. My 12 yr old son was ecstatic and has been super happy since it arrived. I did buy the three year protection plan in case of problems or in case my son damages it. Whenever I buy purchase high dollar products from amazon, I try to get a protection plan. But so far I've never had a reason to use any of the plans. The controller arrived on the day promised, and the condition was fantastic. I haven't used it, but my son is very impressed and says all functions are working as described. Even the packaging the controller was housed in was like new.",
      "rating": 5.0,
      "verified": true,
      "author": "Truble06",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Disappointed",
      "text": "Love the controller, however sticks began serious drift and malfunction 2 months after purchase. Amazon customer support wasn't helpful either. The return window ended Dec 11th, I'm writing this the 14th and I couldn't even get a replacement / repair. I don't want my money back just a working product.",
      "rating": 1.0,
      "verified": true,
      "author": "joseph damelio",
      "helpful_votes": 2,
      "publication_date": 20191215
    },
    {
      "title": "I got a bad controller.",
      "text": "This review was not for the product itself, but the controller I received. It was broken. The up directional pad would press itself all the time. Basically, if I'm playing a game with a character that moves, that character would constantly be walking forward without any interaction from me.",
      "rating": 1.0,
      "verified": true,
      "author": "\"strozier\"",
      "helpful_votes": 2,
      "publication_date": 20191204
    },
    {
      "title": "I like the elite controller but...",
      "text": "Got it for a good price however, doesn’t work 100%. It came “certified refurbished” which usually means used but no issues. This controller goes through spells where it will not turn on. Sometimes it won’t come on at all, sometimes it won’t connect to the Xbox and sometimes it just cuts off mid game. Happy to have it when it’s working properly but it seems like the more I use it the less it actually does work properly.",
      "rating": 3.0,
      "verified": true,
      "author": "Tyler Smith",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Don't waste your money.",
      "text": "I bought 2 of these less than a year ago, one for myself and one for a friend after both of our elite controllers started having joystick issues (the internal components that relay the stick movement broke) causing the right stick to always move in a specific direction no matter where you actually move it (ie no matter which direction I move the right stick it always looks up) I figured we just got a bad batch and just ordered us new ones from here. It's not even been 1 year and both of our controllers are doing the exact same thing...",
      "rating": 1.0,
      "verified": true,
      "author": "colby tyler wood",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "DO NOT BUY REFURBISHED",
      "text": "This was purchased as refurbished and won't even turn on. I guess I got what I paid for. A hot steaming pile of refurbished crap. It looked brand new but what a disappointment to give it as a holiday gift and it wouldn't even turn on. Shame on them for sending a broken controller and causing a broken hearted recipient.",
      "rating": 1.0,
      "verified": true,
      "author": "Isabela Anneliese",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "PC Games BEWARE!!",
      "text": "Just as a warning to everyone who thinks this controller will just connect to your PC like it does your XBOX, you're wrong. This is the series 1 that didn't have bluetooth built in, so you have to get the $25 Xbox wireless adaptor. Unfortunately, the wireless adaptor has a software bug that causes the driver to get corrupted ever ~15 min and makes the entire system completely unplayable. This has been an ongoing issue for 4 YEARS and Microsoft still has not fixed it. TIDL: DO NOT BUY IF YOU ARE A PC GAMER!!! Get the series 2 instead and save yourself hours of headaches.....",
      "rating": 2.0,
      "verified": true,
      "author": "David Peyer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Adds functionality when playing online games",
      "text": "Really enjoy the added functionality that can be at fingertip reach through the use of the four paddles on the back of the controller. Excellent carrying case and full function USB cable. I have found zero problems with the controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Drinkard",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Not worth it.",
      "text": "We bought this in August 2019 and it's held up until about a month ago. I have seen so many other reviews with the same issue. My son used his own money for this \"elite \" controller and is very disappointed. We have two other controllers we have had for over 3 years with no issues. I don't recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "sydney",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Good controller and a cheap price",
      "text": "I have had one of these controllers that my wife bought me for Father's Day. I kept telling my wife, that she needs to try it. she was always hesitant to so I had seen that it was on sale and decided to surprise her with it. The 1st night she absolutely dominated and has only gone better with the controller. I deftly recommend this it!! Comes out to be a lot cheaper than a new 1 but it's just as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Gomez",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Don’t waste your time",
      "text": "The sent me a controller with a broken joystick first time, and then the sent a replacement controller with a broken paddle. They say the controllers are tested before being sent out but clearly they aren’t.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Well worth it.",
      "text": "My only gripe is that the left stick has a slight rebound problem where if I let go of one direction, it will go back to center and rebound to the opposite direction, turning my character around in certain situations (Dark Souls 2, Celeste, etc). Other than that, the controller is everything it said it would be and considering its refurbished, I'll deal with a slight rebound over any other issues that could've happened instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Evans",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Used and worn.  NOT refurbished.",
      "text": "The joysticks showed signs of prolonged wear. There was nasty skin residue inside and around the joysticks. The right bumper was loose. This product had not been refurbished.",
      "rating": 1.0,
      "verified": true,
      "author": "Johnny Swish",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Excellent controller",
      "text": "It has a lot of interchangeable attachments but my son was able to figure it out easily. First controller he hasn't broken right away, must be pretty durable! It looks cool and he likes it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Holmes",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Failed components!",
      "text": "Bought in August 2019. Spent $90 on the controller and another $50 for add-one. Headset jack went out in February 2020. I have original Xbox controllers (4years old) all of the components of which still work. It’s a piece of junk! This is the SECOND unit! The first one failed as well!",
      "rating": 1.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Trust the other reviews, don't buy it",
      "text": "Joystick started messing up instantly. Not properly refurbished, do not waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie Cotenas",
      "helpful_votes": 2,
      "publication_date": 20190330
    },
    {
      "title": "looked and felt like new controller",
      "text": "Could not tell was refurbished, looked and felt like new controller.",
      "rating": 5.0,
      "verified": true,
      "author": "wade",
      "helpful_votes": 4,
      "publication_date": 20171115
    },
    {
      "title": "DO NOT BUY",
      "text": "TONS of thumbstick drift. DO NOT BUY. Figured could save 50 by getting the refurbished one but its defective! Ive had my Elite for 2 years, dropped it plenty of times, and it still works better than the one they sent me! Time to buy from Microsoft.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaden Pacheco",
      "helpful_votes": 2,
      "publication_date": 20191203
    },
    {
      "title": "Poor refurbishment",
      "text": "Out of box never charged, left stick would get stuck, charger port is shaky left bumper sticks.",
      "rating": 1.0,
      "verified": true,
      "author": "Jodi Rysdyke",
      "helpful_votes": 2,
      "publication_date": 20191208
    },
    {
      "title": "Renewed/refurbished is a crock",
      "text": "Low stars because bought these “renewed” but they were all broken in some way and needed unscrewing and fixing with spare parts. Buy new if you can..",
      "rating": 1.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "It's definitely nice to have. Plus there's things you wouldn't think of.",
      "text": "I like that its analogs and d-pad are magnetic so they're easily interchanged. Also that you can shut off the paddles easily so it's mostly a regular controller if you dont want to use the paddles ATM. The only downfall to this controller is when you have the paddles enabled, and you go to set the controller down, it hits random buttons linked to the paddles. (I always set my controller on my thigh, on a flat surface its fine tho.)",
      "rating": 4.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Renew Products are junk on Amazon .",
      "text": "I have bought 2 of them . Terrible both of them had issues and with them . One the left and right buttons broke after a week . Never had a controller do that . The other controller the thumb sticks where loose and the controller was ghosting . Gold star did not even stand behind there product that they sold . Don’t buy from amazon gold star .",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Missing parts, no reply from seller",
      "text": "Gave this is a gift for Christmas, but when the recipient opened it, it was missing a part and one of the buttons wasn’t working. I contacted the seller through Amazon almost 2 weeks ago I have not heard anything back.",
      "rating": 1.0,
      "verified": true,
      "author": "B Martin",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Do not Buy \"Renewed\" products",
      "text": "I've used this \"renewed\" product for a little more than 90 days and I'm experiencing stick drift, of course this happens a week after the return period expires. Which gives them an excuse out of helping you and you're stuck with a broken product. You are better off buying a new controller don't waste your money on \"renewed\"",
      "rating": 1.0,
      "verified": true,
      "author": "W. Martinez",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "the item didnot work.",
      "text": "The remote control did not work when I received it. When I wanted a refund, a request had to be made to the company. They had me do a lot of checks, like try resting the device and go to our site and follow these instructions. When all failed and I again stated I wanted a refund, they would not reply to my request. I never got my refund and my kid is stuck with a inoperable remote. I would never by from that company.",
      "rating": 1.0,
      "verified": true,
      "author": "Donnie ",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Idk...",
      "text": "So the left stick moves when no one is touching it. Bad in games to have that happening.",
      "rating": 2.0,
      "verified": true,
      "author": "Brandon & Cat",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Amazing.",
      "text": "This controller came with little to no problems at all. The most “use” I saw from it was in the shell of the controller, which could be easily replaced by purchasing a replacement shell online for $10 (You’d still be saving $80 doing this as oppose to purchasing a new controller for that ridiculous “NEW” price. This is a steal.",
      "rating": 5.0,
      "verified": true,
      "author": "CarreS",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Awsome product",
      "text": "Everything about the controller is amazing besides the fact that the bottom right paddle requires some fighting to to get in and take out, otherwise, it's an amazing controller",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndi E.",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Terrible quality control",
      "text": "I've ordered a couple of these - they have arrived with defects. One had recessed battery prongs so it would no accept rechargeable batteries (I was able to fix this myself). The other had a defective right stick which would drift that I sent back for refund. Would not recommend ordering refurbished controllers from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Ohkawa",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Lasted 2 Months",
      "text": "I bought this controller two months ago. The left button has almost fallen off completely and the left joystick will randomly scroll up without touching it. I have bought refurbished before but have never had anything break this quickly with really modest use. I could not be more disappointed or frustrated with the durability of the refurbished controller.",
      "rating": 1.0,
      "verified": true,
      "author": "Mills",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "The refurbished Amazon elite controller had joystick drift and was unplayable for the price $120.",
      "text": "The controller came in with everything, but the right joystick had drift and made games unplayable.",
      "rating": 2.0,
      "verified": true,
      "author": "brian andress martin",
      "helpful_votes": 2,
      "publication_date": 20191107
    },
    {
      "title": "Don’t waste your time and money",
      "text": "Didn’t even get the the right controller waste of my time really terrible and unfortunate",
      "rating": 1.0,
      "verified": true,
      "author": "Mitchell ",
      "helpful_votes": 3,
      "publication_date": 20190810
    },
    {
      "title": "Go for the Series 2",
      "text": "While initially a great product, if you are going to drop more than $100 on a luxury controller, go for the Series 2. It is 10x better in every category, and has more options for tailoring how the controller feels and plays",
      "rating": 4.0,
      "verified": true,
      "author": "Jacob Hillberg",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Lasted 91 days",
      "text": "Grip came apart at the seam exactly 90 days after purchase. Return date ended yesterday. How is that for timing?",
      "rating": 3.0,
      "verified": true,
      "author": "Vinnie DAV",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Broke",
      "text": "The first day I used it the left analog was glitchy by the 2nd day it was totally useless",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 2,
      "publication_date": 20191103
    },
    {
      "title": "AVOID THIS SELLER AT ALL COSTS!",
      "text": "This was the worst purchase I’ve ever made on Amazon. Avoid this seller AT ALL COSTS! The bumper is off the controller... this is disgusting. How can you call a product like this “renewed”. I don’t believe I can trust 3rd party sellers on Amazon anymore if I am going to receive products like this. It didn’t even come with the wire. So much for $200 dollars",
      "rating": 1.0,
      "verified": true,
      "author": "edrian kokhabi",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Broken",
      "text": "The package arrived clean and the controller had all of its parts that were included. Everything seemed to be working correctly besides the right bumper, it still had the clicking noise but would not work",
      "rating": 2.0,
      "verified": true,
      "author": "Avalon",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Xbox gamers dream",
      "text": "I'll never go back to the old controllers after using the elite",
      "rating": 5.0,
      "verified": true,
      "author": "Mr D",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Great price and delievered fast!",
      "text": "Here within 2 days. Came in box with everything, except for batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Henson",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Prone to breaking",
      "text": "I’ve bought this controller 2 times, in both cases the controller works fine for about 6 months, and then buttons start to fail. On my first controller the ‘up’ button on the d-pad was inconsistent, then the left bumper failed. On the second controller the ‘up’ button on the d-pad was inconsistent again, and then the right bumper broke",
      "rating": 1.0,
      "verified": true,
      "author": "Emmanuel Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Broken thumb stick",
      "text": "Left thumb stick was broke. Didnt move properly from east an south position",
      "rating": 2.0,
      "verified": true,
      "author": "Damon",
      "helpful_votes": 2,
      "publication_date": 20191119
    },
    {
      "title": "Inferior waste of money",
      "text": "This is the second controller that I have purchased and it fell apart just like the previous one. This is not a gig against the seller, it is a problem with the product itself it is a inferior poorly constructed product that is extremely overpriced and brakes with little to no warning or reason I will never purchase another one again",
      "rating": 1.0,
      "verified": true,
      "author": "dennis leonard",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "You sure it's been refurbished..?",
      "text": "Left analog stick and left bumper only work about 60% of the time. Left stick is very hard to push and gets stuck all the time.",
      "rating": 2.0,
      "verified": true,
      "author": "Concerned Citizen",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Ok",
      "text": "Some paddles and buttons are already not working properly. Guess that’s what I get for a refurbished product.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott Deardorff",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Not what I ordered",
      "text": "I ordered this because I thought it was an elite series 1 and I got an unopened brand new series 2. Some might have been happy with this but its not what I need as the V2 only works as wireless and I need the V1 to use the wire to control the xbox with my setup. The V2 is useless for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Controller is terrible and they won’t fix it",
      "text": "I got a controller it was missing rubber all over and the controller drifts and the rubber on the joystick is missing!",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Werking",
      "helpful_votes": 2,
      "publication_date": 20190208
    },
    {
      "title": "Okay",
      "text": "Used it for a couple weeks and the right joy stick started to drift really bad.",
      "rating": 3.0,
      "verified": true,
      "author": "Jackie palmer ",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Bumper broke in 12 day",
      "text": "The top left bumper broke off in 12 days of have it",
      "rating": 1.0,
      "verified": true,
      "author": "Heather Guilllory",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Broken",
      "text": "It was broken when I got it and had to fight for a refund I still have not received. The RB button doesn’t work and hangs off the controller.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Need to double check all parts before using",
      "text": "The package came as it said. Only issue is the plug for the headphones does not work. Not sure if it's just mine,but it's a possibility.",
      "rating": 5.0,
      "verified": true,
      "author": "kari cunningham",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Dud!",
      "text": "Bought in mid August and in less than 7 months the controller has malfunctioned. When you spend this much money on a product you expect it to last longer.",
      "rating": 1.0,
      "verified": true,
      "author": "ahickman",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Not bad!",
      "text": "My kids love these controllers. Buttons do begin to stick after a few months so hope to find a way to fix that but love this.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Hughes",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Rubber grips pulling away",
      "text": "Rubber grips on the side are pulling away from controller making it difficult to hold",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Sullo",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Happy for this",
      "text": "At first had a hard time trying to get the feel of it but give it time and you can't tell",
      "rating": 5.0,
      "verified": true,
      "author": "quincy50",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Not worth buying refurbished",
      "text": "Not worth buying refurbished. I’ve had it for less than three months and buttons are breaking off. The cursor moves without touching the joy stick. The charger port doesn’t work. Just spend the extra money and buy new.",
      "rating": 1.0,
      "verified": true,
      "author": "ryan isaacs",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Do not buy bad products after 90 days",
      "text": "Very poor product. Dont waste your money. The controller stops working after 90 days just long enough for warranty to be up. They direct you to the manufacturer after they take your money for a faulty product.",
      "rating": 1.0,
      "verified": true,
      "author": "Veronica G Estrada ",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Perfect",
      "text": "I got this same controller brand new was great until a battery exploded in it and broke it so I got this and honestly the buttons feel better and the the analog sticks have more flickback to them this is a great product",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie Tonello",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Do not buy here.",
      "text": "The whole reason I bought a new controller was because the right directional stick drifted upward by itself. This one out of the box drifted upward. Please dear god. Buy new. This is selling faulty controllers. Spend the extra money and buy new.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Not renewed - Needed fixing out of the box",
      "text": "Still had some stick drift and the rubber like grip on the right side is coming off. I will have to repair it myself soon.",
      "rating": 1.0,
      "verified": true,
      "author": "Allen Devor",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Broken D-Pad + Missing back paddle",
      "text": "When my controller shipped, it came with a missing back paddle and instead had 2 of the same. Down on the D-Pad also does not work.",
      "rating": 3.0,
      "verified": true,
      "author": "Dylan WG",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Not worth the price",
      "text": "For as expensive as this controller was it should have lasted longer than 9 months! Very disappointing. I thought if we invested in a more expensive controller we would get better quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Amie Baker",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Good",
      "text": "No noticable defects on shipping like I thought there’d be. Some smudge marks, but it’s a controller and doomed to have SOME sort of grease stain on it eventually",
      "rating": 5.0,
      "verified": true,
      "author": "Tahi Dixon",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Want money back",
      "text": "Want a refund and doesn’t look like there is a way. Bought a white controller and black and they both broke within less then a year.",
      "rating": 1.0,
      "verified": true,
      "author": "Guy izzo",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "The reviews scared me, but the controller was fine",
      "text": "The controllet I was sent was in decent condition. No major issues. It came with all the right parts. I was worried having read other reviews.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Wagner",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Does what its supposed to comfortably",
      "text": "First things first THIS WILL NOT MAKE YOU IMMEDIATELY BETTER AT GAMING. But the hair triggers are good once you're used to them with my only real complaint being that they cant be uniquely hotkeyed to a new key when the controller is being used on pc",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Wilson",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "pricey and breaks easy",
      "text": "its a great controller but it broke way too easy and way too soon, and i had a lot going on so i wasnt able to return it in time",
      "rating": 2.0,
      "verified": true,
      "author": "Theslysmoker",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "My Son Loves it!!!",
      "text": "My 14 y/I son loves it. I purchased online Thursday and It arrived Sat morning as noted at the time of purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt D. ",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Buy the new version, not worth the money saved",
      "text": "Just buy the new version, couldn’t even bother to check and make sure the controller actually worked before it was sent to me. Not worth saving the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Tucker Aldinger",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Well worth the $",
      "text": "My nephew loved it! He treats it like a National treasure",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Stick drift",
      "text": "Came out of the box with pretty extreme left stick drift. Definitely not \"professionally inspected\". Don't waste your time",
      "rating": 1.0,
      "verified": true,
      "author": "Stoney Tyler",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "D-pad doesn't work",
      "text": "I thought everything was working fine up until I couldn't press right on the D-pad. Pretty sure refurbished means it's supposed to work properly",
      "rating": 2.0,
      "verified": true,
      "author": "david Faulkner",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Amazing",
      "text": "Absolutely perfect. I experienced very fast shipping and experienced 0 of the previously mentioned issues with other reviewers. Arrived in perfect condition with all parts and everything in order and hasn’t given me a single issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20191209
    }
  ],
  "product_meta": {
    "title": "Xbox One Elite Wireless Controller (Renewed)",
    "description": "Compatible with Xbox One and Xbox One S. Compatible with Windows 10 via USB or the Xbox Wireless Adapter sold separately Swap thumbsticks and D-pads for game-changing accuracy and speed Fire faster with Hair Trigger Locks Achieve greater control with interchangeable paddles and rubberized diamond grip",
    "rating": 3.9,
    "feature_bullets": [
      "Compatible with Xbox One and Xbox One S. Compatible with Windows 10 via USB or the Xbox Wireless Adapter sold separately",
      "Swap thumbsticks and D-pads for game-changing accuracy and speed",
      "Fire faster with Hair Trigger Locks",
      "Achieve greater control with interchangeable paddles and rubberized diamond grip"
    ],
    "specifications": {
      "Brand": "Microsoft",
      "Item model number": "HM3-00001",
      "Hardware Platform": "Universal, Xbox one",
      "Item Weight": "1.5 pounds",
      "Product Dimensions": "8 x 9 x 3 inches",
      "Item Dimensions  LxWxH": "8 x 9 x 3 inches",
      "Color": "Black",
      "Manufacturer": "Microsoft",
      "ASIN": "B01M4M9E2C",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 21, 2016",
      "Customer Reviews": "3.9 out of 5 stars599 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#18,154 in Video Games"
    },
    "categories": [
      "Accessories",
      "Controllers",
      "Video Games",
      "Xbox One",
      "Gamepads & Standard Controllers",
      "Electronics"
    ],
    "price": ""
  }
}