{
  "website_summaries": [
    {
      "verdict": "Excellent price point for a soundbar that also will look great displayed in your living room.",
      "pros": [
        "Easy to pair Bluetooth or NFC-enabled mobile devices with the soundbar to play music",
        "Offers multiple input options for easy connections",
        "Includes a \"sofa mode,\" allowing the subwoofer to be placed behind a sofa without sacrificing sound quality",
        "Nice-looking hardware"
      ],
      "cons": [
        "Sound quality isn't at the top of the market",
        "Some setups may suffer from audio lag"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pretty nice",
      "text": "If you have a small room, this kicks. Distorts at high volumes so don’t not treat as rock concert sound system. Cool small features like night mode and Bluetooth. Just a little weird not being able to see a screen or number for volume. U see a couple of blinks instead indicating when you’ve reached max or min. Volume. Something anybody could get used to really just because the touch buttons look so sleak. Overall for the size and the mobility of the subwoofer this is a good buy for a starter home entertainment setup",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 29,
      "publication_date": 20180429
    },
    {
      "title": "Maintains volume level.",
      "text": "It powers up and shuts down automatically with the audio source. It also maintains it's volume level even when cycled on/off. The sound is impressive and clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurence Howard",
      "helpful_votes": 31,
      "publication_date": 20180208
    },
    {
      "title": "Underwhelming sound!",
      "text": "I picked this up from an Amazon Treasure Truck at 50% discount. I read some online reviews and they sounded promising. After excitingly unpacking and setting up, the sound was absolutely underwhelming. The soundbar produced hardly anything better than the built in speakers of our 55” Samsung and the subwoofer was only noticeable when the volume was way up, almost in an unpleasantly loud setting. On the positive side, set up was a breeze, which was great, because it went back into the box for return.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Graf",
      "helpful_votes": 10,
      "publication_date": 20190915
    },
    {
      "title": "Small, powerful and discreet",
      "text": "This system is fantastic for small apartments or studios. The sub woofer can be placed very discreetly under a sofa, or on the side. Is only 4 inches thick, but it packs a punch. The sound bar is also small, but it delivers a crisp sound (it even has a button that enhances voice clarity). You cannot compare this to the sound delivered by a larger sub woofer and sound bar, so don't even try. But for those who lack the space to accomodate a large sub woofer coupled with a large side bar, or for those who refuse to pay much more for other systems this is a great option.",
      "rating": 5.0,
      "verified": true,
      "author": "ST",
      "helpful_votes": 21,
      "publication_date": 20170417
    },
    {
      "title": "Small, discrete, off-white blends right in!",
      "text": "My wife didn't even notice it was there - and that was the goal!! I wanted a small discrete soundbar to improve the dismal sound of my living room TV. I didn't want it to announce, \"SOUNDBAR!! LOOK AT ME!!! I'M RIGHT HERE!!\". The off-white color of this unit blends right in. The sound quality is much improved from TV speakers. Sure, its not the top top top of the line, but its a HUGE improvement from standard TV speakers. This is a great product, I wish white was more of an option in speakers",
      "rating": 5.0,
      "verified": true,
      "author": "pcpeggs",
      "helpful_votes": 5,
      "publication_date": 20180528
    },
    {
      "title": "Sending it back",
      "text": "The sound quality was awful - like a 1960s transistor radio. Extremely noticeable when a singer pronounces an \"S\". If it had cost $100, it would have been disappointing. At $350 it is an outrage. The only upside (for the 2-star rating) is that the sound bar is very thin. I couldn't get the USB input to work with an i-pod or a tablet. Might of been possible RTFM or tech support but not worth it when the sound is this bad. Sending it back.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert Ingersoll",
      "helpful_votes": 3,
      "publication_date": 20190917
    },
    {
      "title": "It's all about the bass...NOT",
      "text": "Very disappointing bass quality. Can't even hear it even in deep bass songs. Also the Bluetooth connection is choppy.",
      "rating": 1.0,
      "verified": true,
      "author": "R K",
      "helpful_votes": 7,
      "publication_date": 20180602
    },
    {
      "title": "Not worth the price!",
      "text": "**Update** I’ve had this thing for 10 days and it’s now completely dead! And the box got thrown out somehow. The sound bar will not turn on. Stay away! Don’t purchase this! Find something else! Total piece of junk!! $200 flushed right down the toilet! I should have believed the reviews. I purchased this because both the soundbar and sub-woofer would fit in the TV cabinet. Although the size works for us, the sound doesn't. Honestly, it's barely better than the TV's built in speakers. And the sub-woofer? I kept putting my hand on top of the speaker to see if it was on because I couldn't hear any base coming from it. This is really not worth the money!",
      "rating": 1.0,
      "verified": true,
      "author": "AC in ATL",
      "helpful_votes": 4,
      "publication_date": 20190711
    },
    {
      "title": "Sweet Little Soundbar",
      "text": "Awesome, awesome little soundbar. I am super glad I bought this product. The compact size fits in the spot I wanted. The sound is anything but compact though, giving awesome boom with the sub-woofer and great clarity at all ranges. The product was so easy to set up your mother could do it. Yeah, I am somebody's mother, but don't let that fool you. As a die-hard sci-fi fan and movie music buff a lot of my media needs good sound and this soundbar provides it. Also, it's easy to use the blue-tooth connection and switch between sound modes.",
      "rating": 5.0,
      "verified": true,
      "author": "Egad",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Large, dynamic sound with impressive dynamic range and earth shaking subwoofer!",
      "text": "I am a picky listener with an ear for dynamics and sound quality. This unit is a cost effective way to create a surround experiences without taking up space. For the $, this makes my 43\" smart TV sound like a theater. I have a small living room and its sharp, modern looking and this subwoofer will shake snow off your roof! Packs a good punch for your dollar. For my money spent, I am 100% pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "James E. Thomson",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Best mini sound bar for the price",
      "text": "Best mini sound bar for the price. Love the sound quality. I would recommend it to anyone that is interested in a sound bar for small room or secondary space. Best investment I have made.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20170602
    },
    {
      "title": "Good little sound bar",
      "text": "OK I knew this was not going to be equivalent to the more expensive ones but this was for my girlfriends room not the living room and space was limited. This little guy fit the space and we're happy with the sound and simplicity of the wireless sub. Its a breeze to hook up and puts out plenty of sound for a small room. Only complaint is no indicator for volume level, and that is a limitation of using the TOS link which does not carry a video signal. Overall happy with it and would recommend it for a simple setup. Maybe Sony could add a led indicator to show the level, but not a deal breaker.",
      "rating": 4.0,
      "verified": true,
      "author": "michael mete",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Awesome",
      "text": "This is my 3rd one I have bought. Great bass. Loud and clear. No big deal that it doesn't show volume with numbers. Love that you can also adjust sub woofer volume. Bought a $6 Amazon basic optical cable and it sounds as good if not better then my friends $600 sound bar. And I bought a LIKE NEW for only $89 with tax and free delivery. Very easy set up. Read manual on remote. This little thing ROCKS !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "rocker8",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Terrible Product and Customer Service",
      "text": "Disappointed with this purchase. Sony sound not as good as the much less expensive Samsung the Sony replaced. Update: sound bar quit working entirely 45 days after service. Neither Sony nor Amazon will stand behind this product. Would never purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan McElroy",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Yet another Sony letdown",
      "text": "Much like nearly all of the Sony products I've ever bought, this thing is DEAD and USELESS in less than a year. The subwoofer is 12 feet away from the main unit, with a clear line of sight, but it still won't stay connected and the sounds breaks up constantly. I have no other issues with any of my other wireless devices anywhere in my house. No more Sony for me!",
      "rating": 1.0,
      "verified": true,
      "author": "a-ron wilmingtron",
      "helpful_votes": 3,
      "publication_date": 20180704
    },
    {
      "title": "Sound and Easy",
      "text": "Moms the sound bar is easy to set up. I received mine on an Amazon Treasure Truck Sale. So it was a no brainer for me. I would just check prices so you are getting the best deal for this Sound bar.",
      "rating": 5.0,
      "verified": true,
      "author": "FrankeUno",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Great sound - Compact Package",
      "text": "I purchased this unit for the bedroom TV for better sound. Installation and connection to the TV were easy. Nice big sound from a compact unit that doesn't take up much space. Great value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "rfw1953",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Not big, but sounds rather good.",
      "text": "Got it on sale, super happy with it. When turned up loud the sound is substantially good for the size! When not loud the sound is also sort and not overbearing at all. Again it’s what I wanted and the size I wanted. Sony is very reliable in my previous experiences and once again! I said it’s not big right? I have other giant speakers. They produce massive sound. I didn’t want that with this....",
      "rating": 5.0,
      "verified": true,
      "author": "Yachky",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "No sound (or very little) from the subwoofer (sound bar is fair to OK)",
      "text": "I bought a soundbar with a subwoofer to hear and feel the sound from the subwoofer. Not the case with this product. I subsequently read the reviews of others having the same complaints, and they are true. Little or no sound comes out of this subwoofer. I did all of the troubleshooting tips, increased subwoofer volume to max, turned off night mode, etc but nothing worked. I have returned my unit for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Bj",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "But for me it's been great and was worth buying since the new TV speakers ...",
      "text": "I was a little worried with some of the reviews about the sound. But for me it's been great and was worth buying since the new TV speakers are just lame. If you want the bigger, louder bars, go for it but this seems to do the job just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "kw_46",
      "helpful_votes": 2,
      "publication_date": 20180101
    },
    {
      "title": "Better than advertised.",
      "text": "Have been using a Samsung TV audio for years. This completely resolves sound issues, particularly w/ voice clarity on movies. Sound is excellent. Setup easiest electronics setup ever (we use the optical out / in). Really excellent and very compact bar and sub.",
      "rating": 5.0,
      "verified": true,
      "author": "KBinPC",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Great small sound bar",
      "text": "Overall, this is a really great soundbar for the everyday person or family who just wants some great loud movies or music. It's not a Bose, but it's also not the price of one. It was 5 mins to set up and connected without issue to both the TV and the ipad. Really happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Spaulding",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Love it! Changed my tv experience",
      "text": "Sounds great and love that the remote has buttons for different effects: movie/music, nighttime, speech. I use all of them depending on the need. I installed it in less than 30 minutes; a more tech savvy person would take far less time. Bought this on sale off Treasure Truck and feel it is well worth the sale price I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackson",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Good but not great",
      "text": "Unit is compact and great for a small room. Does get very loud BUT the subwoofer does not really do much unless you are listening to something with heavy bass. Wish it did more. Had to set next to my couch as its too wide to fit under. I also noticed that this unit can not be used along with the TV volume up (for a fuller sound) as there is a slight delay on the soundbar which makes the sounds a bit echoey. Not sure if this is how they all operate. Good for those on a budget or in a small area.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle Moore",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Even when it worked it was meh.",
      "text": "Never really worked out of the box. Thought i was possibly hooking up the tv and box incorrectly but then features started failing one by one, then Bluetooth barely worked and was low pitched and then dead all together. Bluetooth was the only thing that worked out if the box and it worked for two whole weeks. Had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "S Hamilton",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Ok",
      "text": "Sounded good but the tweeters blew out within the first month. Must have been all the 90210 my wife was watching. Kelly’s whining killed it!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Eric Remington",
      "helpful_votes": 2,
      "publication_date": 20180731
    },
    {
      "title": "My ears said ewww..",
      "text": "My ears said \"shame on Sony\" the moment i turned it on and it took me 5 seconds to make up my mind to return it.. and i did. It might sound 'ok' in a small room but still, It isn't worth the amount it is listed for.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 3,
      "publication_date": 20180705
    },
    {
      "title": "Tandem sub and sound bar make a great team.",
      "text": "compact but still provides adequate sound quality. The sound bar itself is your standard work horse audio bar. But the sub that comes with it, they compliment each other so well, it almost seems too good to be true. That is until you go outside, or 2 rooms away and its suddenly not as powerful as it seemed. Which could be a good thing if you need a respectful sound bar, or dont need to blow yourself out of your socks when watching entertainment.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil Mahooters",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Garage product",
      "text": "This product sounds like a cheap Chinese knock off... I've owned multiple Sony Bluetooth speakers and sound bar over the years and this is a subpar product for Sony. I understand now why Amazon slashed the price on them, just trying clear inventory.",
      "rating": 2.0,
      "verified": true,
      "author": "Clayton ",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Sony's still got it!",
      "text": "I LOVE my new Sony Sound bar!! I got it from the Treasure Truck and I couldn't be happier with the sound quality especially for 1/2 price! ,🤩💯. I've been listening to my music on a Bose wireless SoundLink II. and I have to say Bose still has my vote for the overall sound quality but this Sony has nothing to be ashamed of, it puts out A LOT of clear full bodied sound. Definitely happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "KLY",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Poor sound quality and a steep restock fee for return.",
      "text": "After pairing this Sound bar to my Sony T.V. I noticed the sound quality was worse than the T.V.’s speakers themselves. The quality was weak and shallow. Also, F.Y.I. If you intend on returning the item, a $35 restock will be charged without previous discussion about the restock charge.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Sound bar = good / subwoofer = bad",
      "text": "The sound from the sound bar was crystal clear. I didn’t notice any lag issues as other people. But I couldn’t justify the price of this unit because the “subwoofer” was subpar. I couldn’t hear any bass coming out of it! I tried everything the book said, and while I could feel the tiny vibrations, it didn’t seem like it was putting out at full capacity. And yes, I turned the volume of the subwoofer all the way up. I could hear the sound bar attempting to put out bass but not the subwoofer. I went back to my old $50 Vizio sound bar that produces more bass.",
      "rating": 1.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Hey Before You Buy This!!",
      "text": "I was very disappointed by this sound bar. While listening to music it was impossible to find the right balance between low's from the sub and highs from the sound bar. The quality of the audio from the bar was quite good and setup was a breeze. The design of the unit was eye pleasing and compact. I don't see how people rated it as highly as they did?",
      "rating": 2.0,
      "verified": true,
      "author": "marcuslester",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "At $175 from the Treasure Truck, it's a steal!",
      "text": "Got this for a lower bunk using a 32\" tv. I scored it from the Treasure Truck for $175, and at that price, it's a steal! It has great, tight bass and gets very loud if you want it to be.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg G.",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Slim design for under tv install",
      "text": "This was exactly what I was looking for. It fits under the tv rather than in front of the tv. I have a new Vizio that has the feet on the sides so I was looking for a sound bar under 2.5 inches and this fit the bill. The subwoofer is about the size of an Xbox 360 so it fits in the media shelf out of the way. The sound is good and the highs are tuned so it is not screechy. The mids are airy and the lows are decent for tv watching. I don’t usually write reviews but this made me happy. I got this instead of the Vizio sound bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Sound Bar good product for the money",
      "text": "Very easy to install and get up and running. Brings great sound quality to my TV and fits nicely in my home.",
      "rating": 4.0,
      "verified": true,
      "author": "LSY",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "The subwoofer is a disappointment",
      "text": "Bought when it was on Treasure Truck. Not sure if I was expecting too much but it does not produce bass that is good enough for something that comes with a subwoofer... sometimes I even find products like google home mini sounds better than this... very surprised (definitely not in a good way)",
      "rating": 3.0,
      "verified": true,
      "author": "SW",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Boom Boom Bass",
      "text": "I love this little thing. Installation was easy. Works with my sound system as 1.1. The subwoofer is dope af. It easily fits under the couch. Can be felt and heard with powerful bass. BLuetooth connection is seamless. If this is something you meed when you order t you wont be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great product...really impressed!",
      "text": "I have had this product for about 9 months now and have thoroughly enjoyed the compact size, the quality and richness of the sound, and the subwoofer's bass response. I would definitely recommend this to anyone looking to have it in their bedroom, apartment, or dorm room. Works very well in medium to small rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Stewart Rogers-Adams",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Great product",
      "text": "This sound system is extremely easy to set up and operate. Connects very fast to your tv or Bluetooth device and I haven’t had any problems of audio dropping in and out or audio lag at all. It’s also surprisingly loud, for such a small bar and subwoofer, this system packs a huge punch. I’ve now got this same system in both my living room and my bedroom, and it fills both with sound with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Weak sound bar!!!",
      "text": "Not as good of sound as we antipathy for the money. Woofer very weak! $150 for this sound bar is plenty! Would like Sony to give me a better sound bar for the same price! Would not suggest this sound bar to anyone!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Worth every penny!  Great for a small room.",
      "text": "Sounds great in my bedroom with my 55”. Small, fits comfortably next to my dresser and cranks our super clear, loud noise. It is another remote to deal with, but not that big of an inconvenience given then bump in sound from just my tv speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris C.",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Good for the price, but not for me (I love bass).",
      "text": "Works great for the price, but it just doesn't have enough sound range. Theres like no mod base. Only highs, and kinda some lows. It just didn't cut it for me so I returned the item.",
      "rating": 4.0,
      "verified": true,
      "author": "Jorian Wulf",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "I did surprise.",
      "text": "At the beginning, I hesitate to buy Sony HT-MT300/B because of it's price tag, but after I received the unit and setup. I was very surprise, sound quality was good with the help of subwoofer. If you like bass sound, that this unit is good for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Alinur",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Grey market goods",
      "text": "Build quality subpar for Sony. That, with pictures stuck to box and bad grammar in manual leads me to believe these are not legitimate",
      "rating": 1.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Great sound!",
      "text": "Love the TV sound quality, and the ability to pair my phone with it via Bluetooth to listen to music.",
      "rating": 5.0,
      "verified": true,
      "author": "AW",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "It did sound better in the store but perhaps I need to mess ...",
      "text": "I had been eyeing it at Target fire a while but just didn't want to pay $350. Was do excited to see it on Amazon fire $198. this system was sitter way to set up. Only took me 2min. It did sound better in the store but perhaps I need to mess with the settings on my TV.",
      "rating": 4.0,
      "verified": true,
      "author": "MElissa",
      "helpful_votes": 2,
      "publication_date": 20171114
    },
    {
      "title": "PACKS A PUNCH!",
      "text": "I was very surprised when I started listening to music, I have yet to hear it with my tv but with the way it’s sounding so far I don’t think I’ll be disappointed, I was able to get this 50% off from the treasure truck and compared to my HomePod from Apple it’s much louder and the quality of the sound is great with the subwoofer. I do however have to say that without the subwoofer it would be flat. So make sure you have both on!",
      "rating": 5.0,
      "verified": true,
      "author": "Ricky Fuentes",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Great for the price",
      "text": "It has much better sound then the tv speakers themselves, and for the price I like them. VERY disappointed that they WILL NOT connect to my Alexa (echos). So far that is the only complaint.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Not bad but falls short for me.",
      "text": "Pros It sounded good for it’s size. It’s a good choice if you like the minimalist aesthetic more than you care about a theater quality experience. Bad I have a new Sony TV and couldn’t use its remote to control volume. Very annoying. I guess because it’s only an optical cable? My 8 year old Samsung tv and Yamaha soundbar work seamlessly together with only an optical cable. C’mon Sony. Returned.",
      "rating": 3.0,
      "verified": true,
      "author": "tdubs206",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "The Sony HT-MT300/B is a great set up..",
      "text": "I really like this sound bar and subwoofer. They sound really good, and are pretty loud for their size. I'm overall impressed with their functionality, and Bluetooth compatibility. I'm very satisfied with the product, and I would recommend it to anyone with a decent size space.",
      "rating": 5.0,
      "verified": true,
      "author": "Xavier Matos",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Good sound",
      "text": "Very good sound quality for my TV but not for music. Only con is that as your turning up the volume it doesn't show level change. Also wish I could work it with my TV remote. Silly I know but I don't like having to have another remote at hand.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "5 STARS",
      "text": "Game changer. Scored a sweet deal on this from the Treasure Truck and I couldn't be more satisfied. Fits perfectly bemeathy TV and the sun is compact with deep bass. Been using it as much to listen to music via the Bluetooth features as to watch TV. Stoked.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason B.",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Good value.",
      "text": "Great value. I actually mounted above my bed receseed inbetween the ceiling studs. So I needed a narrow one. It fits and works. It’s not Bose but gets the job done",
      "rating": 5.0,
      "verified": true,
      "author": "Burl ",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "My husband and I are over all pleased with our purchase and would recommend to our family ...",
      "text": "Much smaller then I thought and compared to our old Sony sound bar. Puts out ample sound and has a few different choice to pick with different base levels. My husband and I are over all pleased with our purchase and would recommend to our family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Blake Wilson ",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Loud popping sounds from subwoofer",
      "text": "After 3 months every day or so the subwoofer makes these loud pop sounds. I'm really disappointed of Sony as a brand. I need to contact Sony to see what they can do.",
      "rating": 1.0,
      "verified": true,
      "author": "Earth Worm",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Great Sony sound bar",
      "text": "This is the second Sony sound bar that I have bought. Like the options in selecting music or voice emphasis. Great unit for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "JCD",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Love it!",
      "text": "Absolutely love this product! It gets super loud with clear sound. I can put it in the living room and fill the whole house with sound, but I can also use it in my bedroom and have great sound without bothering my roommates",
      "rating": 5.0,
      "verified": true,
      "author": "111444555666",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Great sound at a low price!",
      "text": "Absolutely fantastic system. Easy to set up, clean sound from the speaker, mild subwoofer (which for the guest room Peleton bike sound is perfect) Some say the remote is too small. It has every button you need and is slim like a typical Sony remote. No complaints from me. Love the cream color of the speaker. Very classy and blends into surrounding extremely well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark B.",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Very easy to Install!",
      "text": "I would have given 5stars but I periodically get a popping noise that just started can’t figure out where it’s coming from.",
      "rating": 5.0,
      "verified": true,
      "author": "Lesismore",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Packs a Punch!",
      "text": "I think this little thing packs a good punch! If you dont have a huge space i.e. movie room, or something bigger, then I think this works quite well. The sounds quality is great, Sony has done a great job with this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Zapora",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Wow!",
      "text": "Bought this for my son for Christmas. Was shocked how loud and crisp the sound was.... glad he’s taking it back to college. I feel sorry for his roommates and neighbors!",
      "rating": 5.0,
      "verified": true,
      "author": "Tampa",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Mostly disappointed and don't use it",
      "text": "Sound is kind of \"tinny\" and setting on various sound types doesn't seem to help. Also, if you have the TV sound and sound bar on simultaneously, the sound timing is slightly mismatched. I've turned this off and stopped using it.",
      "rating": 3.0,
      "verified": true,
      "author": "Ansley Atlanta",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "There's no bass from the sub",
      "text": "Why there's a subwoofer without any bass coming out of it? I put my ears right on top of it and barely hear any bass.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam Doan",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Very Nice",
      "text": "It's a smaller sound bar, perfect for bedroom or mid-sized living room. Place the sub under the sofa and you get a great, warm, room-filling sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Pinky",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Nice sound and size, no remote control integration.",
      "text": "Nice sound for the size and easy to place in pretty much any place. But although my TV is Sony the remote cannot be used to control the soundbar. The only input is an optical one, no HDMI or HDMI ARC. I didn’t want one more remote.",
      "rating": 3.0,
      "verified": true,
      "author": "gabrielaas",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Worked as expected. Very good item.",
      "text": "We purchased with a new tv, but found we didn’t need it with the new tv, but it was excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Burton",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Nice sound and easy to use",
      "text": "Bought it last month and finally got to use it for the first time 2 days ago. What I can say is it does worth the money. Simple to install, simple to use. Took me 5 minutes to set it up, and another 1 minute to figure out how to make it work. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Good bass but the treble sounded really cheap and tin-like.",
      "text": "Well made by the higher frequencies almost hurt your ear because it was scratchy and cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "Renee B.",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Just Not It",
      "text": "did not find the sound quality to be as rich as my older Polk soundbar. this would give you a boost from your normal tv speakers but does not have very good bass at all. tested it out for about 3 weeks before i was convinced this was not enough of the kick i was looking for.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Tv Sound Upgrade & Bluetooth Music on site!",
      "text": "Great sound for a small room and very easy to set up and connects to Bluetooth automatically!! Love Sony products and this is a nice addition to my bedroom!",
      "rating": 5.0,
      "verified": true,
      "author": "nicole",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Good for the price",
      "text": "It's ok for a third tv. Doesn't compare to my high end Bose",
      "rating": 4.0,
      "verified": true,
      "author": "Yancy Darringer",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Where",
      "text": "I know this wasn't a tremendous amount to spend, but I expected better quality sound to come from a Sony system",
      "rating": 3.0,
      "verified": true,
      "author": "Johann Wallace",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Works great, really loud in a great way",
      "text": "Got it hook up on my new Sony xbr900f 2018 model. Make great sounds for my tv. Also great sounds with my PS4Pro and 4K player too",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Stearns",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "The sound quality is not as good as the Sony sound systems that I had before ...",
      "text": "The sound quality is not as good as the Sony sound systems that I had before this one. However, for the price I paid through Amazon truck, I still think it is a bargain.",
      "rating": 3.0,
      "verified": true,
      "author": "AF",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Great sound",
      "text": "I got this because I always need to turn on subtitles to understand voices over the background noise. So far it beat my expectations :)",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo AR",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Pretty nice",
      "text": "It may be small for a sound bar but it definitely packs a punch. If you're looking for an upgrade from basic TV speakers you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "boogie7926",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Four Stars",
      "text": "Good quality, wireless subwoofer is a plus. Mid-range is lacking leaving slightly tinny playback.",
      "rating": 4.0,
      "verified": true,
      "author": "johnny dollar",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Excellent Value and Quality",
      "text": "It really is a dynamic system and it was at a great price. I am using it instead of my ceiling speakers, as the bass under the sofa really adds to the experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Great for small space",
      "text": "This system is amazing! Perfect if your looking for a simple efficient surround system. It’s perfect for my living room. My only real complaint is The remote doesn’t sync with the tv so you have to use two separate remotes.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaiah's Mom",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "It was not 50% off",
      "text": "Great surround sound, works great but the ad said it was 50% at $199 which would mean that it retails for just under $400 which is not correct at all, it actually retails at $199. It is a quality product and i don't mind paying full price, i just don't like being told its a great deal when it's really not",
      "rating": 2.0,
      "verified": true,
      "author": "nick walden",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "great value",
      "text": "this product is great, Sounds really good at a resonable price",
      "rating": 4.0,
      "verified": true,
      "author": "kevin christensen",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Very disappointing purchase",
      "text": "Bought this from the Amazon Treasure Truck for half off and it was still completely not worth it. I'm no audiophile, but the sound is ridiculously tinny and far worse than the sound on my budget TV...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Good",
      "text": "I purchased this product back in June and I was very pleased with it. I give it 3 stars, however, because after about 3 months, the connector for the plug in the back of the unit broke and I am now unable to use it. It seems very fragile and would probably be best mounted on a shelf where small movements won’t cause it to break.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Movies OR music!",
      "text": "Sounds great whether you're listening to a blockbuster action thriller or your favorite playlist on Spotify.",
      "rating": 5.0,
      "verified": true,
      "author": "schubydoo",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Sasss! Great unit",
      "text": "Oh yeah! Plug this thang in and sit back , enjoy! Super easy, sleek design and takes up little space. Paired nicely in my 24x 16 room along with my 55” Bravia!",
      "rating": 4.0,
      "verified": true,
      "author": "Berenice A. Carstetter",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Great sound",
      "text": "Great product. Slim, easy to use and sounds great. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianna",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Very good purchase",
      "text": "Great setup and price made it even better (Treasure Truck deal). Good sound quality for a TV sound bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike F",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Awesome Sound Bar System!",
      "text": "Awesome sound out of a mini bar system. I’ve been looking at this for quite a while when it popped up on the Amazon Treasure Truck in Indianapolis. I was the first in line.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Moore",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Easy set-up",
      "text": "Bought an open box system from Amazon for $80.00 and I couldn't be happier. The system is brand new and it sounds great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Great sound for a compact soundbar and decent sub for it's size.",
      "text": "It delivers in sound and the sub was a nice add on.I use this for my kitchen TV due to the lack of decent speakers since the new TV's are so slim and I could't stand the poor sound quality. It fits my 24\" Samsung TV since the soundbar is compact it fits in front of the set and complements it.",
      "rating": 5.0,
      "verified": true,
      "author": "Salem Oregon Gamer",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Volume controls",
      "text": "Doesn’t allow you to see what level the volume is .... but it’s a fun surprise after the kids watch there shows!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Subwoofer weak, bar sounds great.",
      "text": "The subwoofer is almost nonexistent. Very low power. Sound bar sounds great.",
      "rating": 3.0,
      "verified": true,
      "author": "Luis Evangelista",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Love love love LOVE",
      "text": "This is such a neat little sound bar! It was super easy to set up, the sound is clear and easily adjustable with a remote. I am SO happy I purchased this one!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Excellent small sound bar",
      "text": "The bar sounds great and fits any bedroom well. I got it used for $89 and it is well worth that price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Delay with TV",
      "text": "The speaker sounded amazing when playing Bluetooth with my phone. However there was a major delay when plugged into the tv. Also there was a lot of static and choppy noise when you stood farther than about 5 ft from the speakers with your phone. Had to return. The size however is perfect ! Such a bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "JMS",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Okay but....",
      "text": "Its okay depending on the source of audio. Would never have bought it if it wasn't discounted. Decent for a small to medium roim",
      "rating": 3.0,
      "verified": true,
      "author": "Rizzo",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Five Stars",
      "text": "Fairly easy set up and a great sound for my home office TV",
      "rating": 5.0,
      "verified": true,
      "author": "Chip Henningsen",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Five Stars",
      "text": "Great value, sound is fantastic. Improved the sound for my Motor Home's TV & stereo. Bluetooth system works. great",
      "rating": 5.0,
      "verified": true,
      "author": "Sid ",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Quality Sound Bar at Price",
      "text": "Picked this up at the Bryant park Whole Foods as it was being sold on the treasure truck. I’ve loved the sound of these speakers make and the sub woofer has a setting that’s great for under the couch.",
      "rating": 5.0,
      "verified": true,
      "author": "tmm424",
      "helpful_votes": 0,
      "publication_date": 20191223
    }
  ],
  "product_meta": {
    "title": "Sony HT-MT300/B Powerful Mini Soundbar with Wireless Subwoofer, easy setup, compact, home office use with clear sound, Black",
    "description": "Color:BlackEnjoy great sound without sacrificing the style of your room with this powerful mini sound bar and slim subwoofer that blends in instead of standing out. Fill any space with theater-style surround sound and thunderous bass, while the 2-way flexible subwoofer tucks away easily between or underneath future. Stream music easily with Bluetooth and even control playback with your phone. It’s the perfect choice when style and sound matter. Input Output Terminals: Input: USB, Analog, Optical",
    "rating": 4.1,
    "feature_bullets": [
      "Straight from the theater to your home: powerful mini soundbar with easy set-up and clear sound for any home office or family room",
      "Stylish, compact design fits a wide variety of spaces, including a slim wireless subwoofer that conveniently fits under a sofa or desk",
      "Voice enhancement feature strengthens listening experience – ideal for TV content with hushed dialogue or conference call quality",
      "Surround yourself with S-Force PRO Front Surround sound. Subwoofer Size (W X H X D) 3.74 x 15.08 x 14.37 ( Inches)",
      "Connect and stream music easily via Bluetooth with NFC",
      "Enjoy music playback via USB",
      "In the box: AC Adapter, AC Cord, optical cord, Remote Control (RMT-AH301U), 2 AAA batteries"
    ],
    "specifications": {
      "Brand Name": "Sony",
      "Item Weight": "18.1 pounds",
      "Product Dimensions": "22.3 x 6.1 x 20.6 inches",
      "Item model number": "HT-MT300/B",
      "Batteries": "2 AAA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Output Wattage": "100",
      "Color Name": "Black",
      "Speaker Type": "Soundbar",
      "Impedance": "4 Ohm",
      "ASIN": "B01MRD7PCZ",
      "Customer Reviews": "4.1 out of 5 stars448 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#59,814 in Electronics",
      "Date First Available": "January 30, 2017"
    },
    "categories": [
      "Home Audio",
      "Electronics",
      "Sound Bars",
      "Speakers"
    ],
    "price": ""
  }
}