{
  "website_summaries": [
    {
      "verdict": "This serum is made with vitamin C and other skin-benefiting ingredients, and has earned more happy customers than complaints.",
      "pros": [
        "Formulated with a blend of plant-based oils, hyaluronic acid, and witch hazel to moisturize skin and protect against premature signs of aging",
        "Contains nourishing vitamin E. Some customers report brighter skin after using it",
        "Made in the U.S.A",
        "cruelty-free"
      ],
      "cons": [
        "Issues including puffy skin, blemishes, and irritation with use have been noted",
        "Some bottles contained serum that had a foggy appearance, suggesting oxidation had occurred"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Enjoy, Best $20.00 ever spent!!!",
      "text": "The results are unbelievable, Was a bit skeptical because all the reviews were from Caucasian women. I was slightly worried that my skin would not respond as well but I was quite mistaken. With or without makeup, my skin is bright, smooth and my spots are disappearing. One other result i am sure a number of people have not noticed is that your palms get softer too, i guess the residue on the palms makes it soft and supple.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayowa O.",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Definitely recommend",
      "text": "Have been using this daily for two months with sunscreen to protect against more damage. I'm seeing great results.",
      "rating": 5.0,
      "verified": true,
      "author": "Book Reviews",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "40yrs old but look 30 thanks to your VitaminC Serum",
      "text": "My search for an amazing serum is finally over. I just purchased my 3rd bottle and I am hooked! My skin looks flawless and I have been getting so many compliments about how great I look. My skin glows as if I just walked out of a spa treatment. A little goes along way, the bottle usually last me about 3 1/2 months. I use it every morning and every night. Thank you for his amazing product!",
      "rating": 5.0,
      "verified": true,
      "author": "jaime handley",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "I wasn’t even putting it on my eyes and they puffed up and became super itchy and irritated",
      "text": "Apparently I’m allergic to something in this serum because i had a major reaction to it after just using it for a couple days. I wasn’t even putting it on my eyes and they puffed up and became super itchy and irritated. I’m sure this doesn’t happen to everyone, but I will not be buying this again and I’m hoping to get a full refund. Adding a super embarrassing photo as well just to prove that it really did swell up my face.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 187,
      "publication_date": 20180328
    },
    {
      "title": "Waste of money !!",
      "text": "The only good thing I can say about this serum is that I like how it feels on my face. Not greasy at all and leaves your face with a \"tight\" feeling. I see no difference in the wrinkles or fine lines. If anything my laugh lines are way worse. I had been using Youthful Surge before trying this and defiantly buying that again. I just tried this because of the great reviews. I read reviews that said it was supposed to be clear. Mine is very cloudy and is far from clear. Waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "ErinMM24",
      "helpful_votes": 135,
      "publication_date": 20170910
    },
    {
      "title": "made my acne rage.",
      "text": "This product has broken me out horribly, and is not my first vitamin c serum, so I do not have sensitive skin towards vit.c/h.acid.I know when you start a new skin product you can expect and initial breakout but it's been a month and my skin has not calmed down. It's horrible, I only have acne flair ups around that time of the month and this has made my skin worse than it ever has been. Really upset as I do not wear makeup and had to go out and buy concealer to deal with the side effects of this serum.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 99,
      "publication_date": 20180124
    },
    {
      "title": "Not what I expected :(",
      "text": "My skin is allergic with this serum. Maybe it works for others but not with me. I'm 20 yo. My skin might be too yound to adapt this product. And now my skinface is terrible now. There is too many small red dots and some areas are burned. It's not smooth as before I use. So regretted :(.",
      "rating": 1.0,
      "verified": true,
      "author": "Tin",
      "helpful_votes": 81,
      "publication_date": 20170803
    },
    {
      "title": "Not much of an improvement in skin",
      "text": "I will keep this very short: Overall- fair Moisturizer- light Smell- None Skin irritation- None Color- foggy Acne improvement- No difference Skin lightener- None Use- Daily for a month Body part used on- Face & neck Wrinkles- No difference Does it work- honestly I did not see much of a change in my skin. Maybe it works for others but unfortunately I did not see a change of improvement in my skin. I would try it again just to see if maybe the batch I previously bought was a bad batch. Update: 04 Sep 2018- This Company sure knows how to make their customers happy! They offered me a full refund & a new product! Thank you so much TruSkin!",
      "rating": 3.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 49,
      "publication_date": 20180829
    },
    {
      "title": "PLEASE READ!! for those with QUESTIONS about the COLOR.",
      "text": "Went on truskins website to find answers about the color of the vita C serum and here's what I found. P.s I LOVE THIS STUFF!",
      "rating": 5.0,
      "verified": true,
      "author": "Iris Santiago",
      "helpful_votes": 67,
      "publication_date": 20171005
    },
    {
      "title": "Lightened cystic acne scars effectively",
      "text": "I'm always skeptical of any skin care product and claims it may make, but I have seen results from this. I've been using it twice a day for about three weeks and my skin does look better. I had some very red acne scars on my cheek and chin that look much better. They are still there, but they are much lighter. Some of my lighter, less severe scars are barely noticeable at all any more. It hasn't caused me to break out any more than usual (maybe even a little less, but it's hard to say), which is always a concern for me as I have oily, acne-prone skin.",
      "rating": 5.0,
      "verified": true,
      "author": "K.L.",
      "helpful_votes": 240,
      "publication_date": 20170601
    },
    {
      "title": "the only difference I notice after 2 months of daily ...",
      "text": "the only difference I notice after 2 months of daily use is the return of brown spots. Prior to using this, I used Obagi Professional 20% vit C serum. My brown spots lightened but were always still faintly there. Since using TruSkin, my brown spots have darkened and I'm seeing new faint ones! So I guess Obagi was working after all. Sorry, this stuff isn't 20% Vit C. The company did refund my money as they promised.",
      "rating": 1.0,
      "verified": true,
      "author": "junereview",
      "helpful_votes": 78,
      "publication_date": 20171103
    },
    {
      "title": "Awesome Customer Service",
      "text": "I didn’t see any of the results some of the other users did unfortunately :( I think I even broke out more from using it but can’t be sure. **Update** I originally gave this serum a rating of 2. The seller contacted me upon reading my review. Their customer service is absolutely amazing--we exchanged several emails back and forth and she took the time to help me figure out which of their products would be beneficial to my personal skin needs. Absolutely recommend purchasing from this company. I know I will certainly give them another shot :)",
      "rating": 4.0,
      "verified": true,
      "author": "Kevans011",
      "helpful_votes": 29,
      "publication_date": 20180619
    },
    {
      "title": "Give this a try!",
      "text": "So far, I'm a fan! I've noticed more even skin and a reduction in the apparence of freckles. Even my under-eye is looking better... and it's only been ONE WEEK!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Caruthers",
      "helpful_votes": 97,
      "publication_date": 20170630
    },
    {
      "title": "Not a substitute for higher end serums- but does ok.",
      "text": "I have only used this for a week- but so far its ok- not great but not bad. Compared to drunk elephant c serum or dennis grossman c serum- this falls short. I was hoping to find something that could replace those serums at half the cost. After using this for another 2 weeks, I think I will switch back to one of the better vitamin c serums and see how much of a difference it makes on my skin vs. cost.",
      "rating": 3.0,
      "verified": true,
      "author": "MR EH",
      "helpful_votes": 31,
      "publication_date": 20180130
    },
    {
      "title": "Amazing results & skin brightening!",
      "text": "Love love love this product! I’m completely 100% forever a customer! I’m nearing 30 & needed a good skin care regimen, as I’ve NEVER had one. I can’t believe my results! Not only has it taken away all dullness, it has reversed some sun damage! My before and after pictures are taken WITHOUT filters in the same lighting/same area of my bathroom. I’m HIGHLY SATISFIED!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather C.",
      "helpful_votes": 21,
      "publication_date": 20190127
    },
    {
      "title": "... about a week or so I've never really had horrible acne but this gave me under the skin pimples ...",
      "text": "Ive been using this about a week or so I've never really had horrible acne but this gave me under the skin pimples that hurt terribly. Any one else having this problem? Do I need to give it more time for my skin to get used to it?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 24,
      "publication_date": 20170821
    },
    {
      "title": "Not for me",
      "text": "After reading the reviews i was excited to receive the product seeing as how it’s been in my cart for a couple months. I’ve Been using this product for three days and it’s been a mistake. Immediately after using it my face is dry. I can literally feel my skin tightening as the product dries. There are dry patches on my face that I didn’t have before and nothing seems to help. Returning this product. **update** after posting my review the company has reached out to me and offered a full refund along with a different product free of charge. It’s good to know that they really care about customers satisfaction and not just the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 12,
      "publication_date": 20190113
    },
    {
      "title": "Definitely no noticeable change....",
      "text": "I am never one to use any type of serum for face or help with fine lines and wrinkles and this just reaffirms why I don't use products like these because they don't work. I've been using this product consistently since arrived once in the morning when I wake up and cleanse my face and once at night when I take a shower it is now March and I still have yet to see any kind of noticeable results in my face which is very discouraging. This just reaffirms my belief that products like these just really do not work no matter how consistent you use them.",
      "rating": 1.0,
      "verified": true,
      "author": "Phenomenally Me",
      "helpful_votes": 5,
      "publication_date": 20190321
    },
    {
      "title": "I never ever break out & about 2 weeks after ...",
      "text": "I never ever break out & about 2 weeks after I started using this, my skin turned into a disaster with cystic acne.",
      "rating": 1.0,
      "verified": true,
      "author": "Morey Jones",
      "helpful_votes": 14,
      "publication_date": 20180213
    },
    {
      "title": "CAUTION!!!",
      "text": "This did NOT work like the others say for my sister and me! It made both our faces irritated, dry and inflamed. My sister even did a spot check, but seemed fine. This is the only product we used in common. My skin feels irritated and flaky, but my sister said hers feeling like it’s stinging as if from a really bad sunburn. Be VERY cautious before you use!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Hanajun Chung",
      "helpful_votes": 9,
      "publication_date": 20180913
    },
    {
      "title": "Defective?",
      "text": "Was excited to use receive and use this product due to the reviews, however when opening the package this morning, it’s very cloudy and thick consistency. I’m not sure if this item is defective, not feeling comfortable using. May return for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Mira",
      "helpful_votes": 5,
      "publication_date": 20200720
    },
    {
      "title": "Creature of land of the lost face",
      "text": "I give 0 stars,but I have to give one 1. So the product is responsible priced. Dose smell nice. However I had a allergic reaction to truskin vitamin c serum. It got red itchy flaky. And one co-worker said what's wrong with your face? Did you get burned?. No thanks Sherri for your concerns. 😒 anyway I do have extra sensitive skin. It's like pepper. The serum is too strong for me. P.s . Was not going to leave a picture of my face as a reptilian creature. Looked like off of land of the lost.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie Kaiser",
      "helpful_votes": 6,
      "publication_date": 20190327
    },
    {
      "title": "Sticky, very drying, break outs everywhere, just ...",
      "text": "Sticky, very drying, break outs everywhere, and eyes puffed up as it caused an allergic reaction. Beware please b/c this product ruined my skin. It took 2 weeks for skin to get back to baseline. I have used other Vit C products and have never had this happen. You get what you pay for! Stick to reputable brands with truly organic ingredients. Pass on this one!",
      "rating": 1.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 9,
      "publication_date": 20180416
    },
    {
      "title": "and I am very pleased with what I am seeing so far",
      "text": "I have been using the Rose Water Toner and Vitamin C Serum for a couple of weeks now, twice a day, and I am very pleased with what I am seeing so far! The pores on my nose are noticeably smaller and I am starting to see my complexion even out. A few of the more faint dark spots have begun to fade. I am excited to see what happens over the summer since I live on the Southeast coast and frequent the beach during summer break.",
      "rating": 5.0,
      "verified": true,
      "author": "S.Hardy",
      "helpful_votes": 13,
      "publication_date": 20170515
    },
    {
      "title": "An OK Serum",
      "text": "I have used this twice so far. I'm 31 with some fine lines. I'm using this as part of a \"Korean Skincare\" routine. The product seems to work, but it's slightly sticky and doesn't blend in as well as other serums I've used. 2 weeks of use: I have noticed little difference in my skin after using this product for awhile. I wouldn't necessarily recommend this for an antiwrinkle regimine.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Odde",
      "helpful_votes": 8,
      "publication_date": 20171230
    },
    {
      "title": "I was skeptical but LOVE this stuff!",
      "text": "I purchased this in hopes it could help even my skin and brighten my dull color up. I didn’t have high hopes and figured at worse I wasted $20. But boy have I been surprised. Within a week I had a noticeable brightness and clarity in my skin color/appearance. I put this one, let it dry for a minute, then lather a homemade coconut oil/cocoa butter/essential oil lotion on top and my skin is just LOVING it! You CAN put this on first then proceed with your normal routine (moisturizer, make up, etc.) My husband is even wanting to start trying it on his skin so we will see if that helps his blotchy complexion!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Madson",
      "helpful_votes": 5,
      "publication_date": 20180927
    },
    {
      "title": "TruSkin Natural Vitamin C serious does not work!",
      "text": "This product absolutely did not work for me. It made my skin extremely dry and accentuated all the fine lines in my face. I had to purchase several different potent moisturizers to help my skin become less try and itchy due to this TruSkin Natural Vitamin C serum! Beware this product does not work and makes your skin extremely dry. It accentuates all your fines lines and wrinkles.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 7,
      "publication_date": 20180414
    },
    {
      "title": "Love this anti-aging serum",
      "text": "Just love this light rejuvenating serum... I'm 53 and live in dry colorado.... I need real moisture not just oil. This product helps to replenishment , smooth and moisturize my sad dry skin. No sticky or greasy feeling after applying. I've used this product for over a year, tried other products...but not the same result. I also have noticed a reduction of brown spots over a couple of months... be patient, results don't come overnight. I'm also celiac, can't have wheat in my skin care products. For over 50, research a good oral collagene and omega 3 product...they can help increase benefits to your skin too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170614
    },
    {
      "title": "Meh",
      "text": "So, I'm sure if this had been the first serum I'd ever bought, I'd have loved it. But I tried an $88 one first that makes my skin so clear and bright that my boyfriend thought I was wearing foundation when I woke up (Tata Harper Resurfacing Serum, from sephora). This truskin one is... Fine. It helps a little, and I even used it for two weeks just to be fair, and it just didn't do it for me. Also I have oily skin, and this stuff made me MUCH oilier.",
      "rating": 3.0,
      "verified": true,
      "author": "Cady Daemi",
      "helpful_votes": 5,
      "publication_date": 20180814
    },
    {
      "title": "My skin is beautiful",
      "text": "I see results and I am so happy March 15 vs June 29",
      "rating": 5.0,
      "verified": true,
      "author": "janisha",
      "helpful_votes": 6,
      "publication_date": 20200628
    },
    {
      "title": "Actually Works😯",
      "text": "I use it in the morning and at night in addition to the daily facial moisturizer and cetaphil daily facial moisturizer with sunscreen when im going about my day in the morning... In one week of use i noticed my acne scars are fading and my face seems to be getting clearer... The dark spots under my eyes from lack of sleep are firming up and are less noticeable... My skin is extremely sensitive and i breakout/allergic reaction to a lot of things... so ignore the reviews... Read the ingredients... And give it a try... You wont always find what works for your skin on the first try... What works for me might not work for you....",
      "rating": 4.0,
      "verified": true,
      "author": "ANASTASIA.NICOLE",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "Not sure what all the fuss is about",
      "text": "I decided to try this serum because of the positive reviews and affordable price. However, after using it for over a month, I'm struggling to understand what all the fuss is about. There's no noticeable difference in my skin and the product seems cheap compared to other serums I've used. I'd recommend buying the 1 fl oz. container if you feel compelled to try it out.",
      "rating": 2.0,
      "verified": true,
      "author": "Courtney L.",
      "helpful_votes": 4,
      "publication_date": 20181008
    },
    {
      "title": "Did not fade pale age spots",
      "text": "Have used other c serums with fair results but this one didn’t work at all for me. Ive started getting pale brown spots on cheeks and thought this would nip it in the bud. I have decently good skin and used the full bottle over about 2 1/2 months, saw no lightening of spots. Bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "amazonian",
      "helpful_votes": 4,
      "publication_date": 20190321
    },
    {
      "title": "Reaction",
      "text": "This serum turned my skin bright red and swollen. I also used a very thin layer under my eyes which caused them to swell. I might have had this reaction because I also use prescription topicals for rosacea. I'm glad so many others have seen great results, and I'm bummed it doesn't work with my skin",
      "rating": 1.0,
      "verified": true,
      "author": "HD70",
      "helpful_votes": 7,
      "publication_date": 20180710
    },
    {
      "title": "So happy this worked!",
      "text": "I recently suffered from over exfoliation on my face. I had a product that said \"daily exfoliating cleanser \" and it wasnt super gritty so I didnt really think I was truly exfoliating. I I kno better now. I found this product while doing research on how to heal the redness, sensitivity, pain with touch,and inflammation on my face. I've used this twice and I've seen soo much of a difference!! I'm so happy that with this product . My skin looks amazing and its definitely healed so much of my redness. Not only does my skin look improved but its beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Dess",
      "helpful_votes": 2,
      "publication_date": 20200507
    },
    {
      "title": "Made my combination skin break out.",
      "text": "I had tried Majestic Pure vitamin C serum which I thought was just OK. Majestic Pure's smells like vitamins and it was a bit sticky and orange in color. I thought I'd try a different brand so I found TruSkin Naturals Vitamin C. And Oh man, this makes Majestic Pure's seem like a miracle serum. The only difference that Tru Naturals has made on my skin is that I now have tiny red bumps on my face after a week of applying this. I tried to give it another shot for one more week but, again little red bumps appeared on my forehead and cheeks. I am not happy about this and I will not be purchasing again.",
      "rating": 1.0,
      "verified": true,
      "author": "Yein",
      "helpful_votes": 5,
      "publication_date": 20180409
    },
    {
      "title": "It's just ok, wouldn't purchase again",
      "text": "We are all reading about how Vitamin C can help our skin and overall complexion. I was excited to try this reasonably priced serum, but I can honestly say it wasn't that great after using the entire bottle. The product feels wonderful on your skin. It goes in nicely and provides great hydration and smoothness. However, that's about it. I have noticed my skin is a bit softer, but no other benefits with completion or skin tone. I didn't have any breakouts.",
      "rating": 3.0,
      "verified": true,
      "author": "AMG de Wet",
      "helpful_votes": 2,
      "publication_date": 20191117
    },
    {
      "title": "Looking good after using this product!",
      "text": "I have been using this for about 3 weeks and I am pleased with the results. I follow with the Retinol moisturizer from the same company and my skin looks glowing and healthy. The loose skin and wrinkles around my eyes are gone! I only use at night because my skin gets sun sensitive too much during the day. I hope this company comes up with a daytime moisturizer with sunscreen.",
      "rating": 5.0,
      "verified": true,
      "author": "Tashi's mom",
      "helpful_votes": 6,
      "publication_date": 20170430
    },
    {
      "title": "Meh",
      "text": "I have been using this product for about 2 months. I have not noticed any effects, positive or negative, on my skin. I have oily acne prone skin with large pores and dry patches on my cheeks and jawline. I have bad reactions to most skincare products. This product did not make me break out in acne nor in a rash, so that was a pleasant surprise. But it didn't give me beautiful, glowing skin either. I will continue to use the product because I don't see any harm in it, but I won't be repurchasing.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 3,
      "publication_date": 20190705
    },
    {
      "title": "Second time purchasing",
      "text": "This is the second time I have ordered the Vitamin C serum. I really like it. I think it has helped with the appearance of my skin. I am 38 and have sun spots. I think it has helped lessen the darkness of the spots. I think it also makes my skin look more plump and hydrated. I have had zero reaction (breakouts) to the product. The serum also does not have a scent which is nice, I am sensitive to smells. I will continue to order and tell others about it. I use it under my moisturizer.",
      "rating": 5.0,
      "verified": true,
      "author": "JKW",
      "helpful_votes": 3,
      "publication_date": 20200512
    },
    {
      "title": "Looks like curdled low fat yogurt",
      "text": "Not a fan. Looks like curdled low fat yogurt. After a few seconds it dries on my face and becomes stiff. Does not moisturize me at all, quite the opposite. I’m glad it wasn’t too expensive cause I won’t end using it anymore. I guess you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 6,
      "publication_date": 20180506
    },
    {
      "title": "Tightens, Plumps, Smoothes",
      "text": "Best Vit C serum I've used. Including the dermatologist office and department store brands. Takes very little product to cover face, neck, chest. After second bottle, twice daily use, my jawline tightened and smile lines plumped. My skin feels and looks softer. Foundation smoother. Their customer service is top notch. I've never had a single problem. Good product. The price is incredible! I hope everyone else has the same experience. (And...I have age 50+ skin complete with effects of sun bathing before we knew it was deadly.)",
      "rating": 5.0,
      "verified": true,
      "author": "Love my Lab",
      "helpful_votes": 6,
      "publication_date": 20170116
    },
    {
      "title": "Horrible breakouts!",
      "text": "This made me break out HORRIBLY. It's been a couple weeks since I've used it but my skin is still purging.",
      "rating": 1.0,
      "verified": true,
      "author": "She",
      "helpful_votes": 6,
      "publication_date": 20190215
    },
    {
      "title": "Not good for me.",
      "text": "This serum did not do well for me. First, it actually caused intense irritation in some spots and made my skin dry. Then, within two weeks, it turned so cloudy and bubbly, it scared me. I guess it went bad with bacteria. I gave up and threw it out. It could be that I had an allergic reaction to it since other people give it great reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Zee Lugo",
      "helpful_votes": 4,
      "publication_date": 20180510
    },
    {
      "title": "Light solution",
      "text": "I started using this product along with my skin care routine. I really love this product. It gives my skin a really nice healthy glow( not oily looking). This has to be used with a moisturizer. I usually clean my face, pat dry, then put on this solution. I wait a 1/2 hour before applying moisturizer. This solution is not oily - very light , but can’t be used alone. You still need to apply moisturizer. I bought a bottle for my daughter , but she has acne prone skin. She still has cyclic acne outbreaks, but not as severe.",
      "rating": 4.0,
      "verified": true,
      "author": "kim ",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Did NOTHING!",
      "text": "Did absolutely nothing for me. Finished the entire bottle and zero results. I bought a different brand of vitamin C serum and that worked wonders! Wasted money and time giving this one a try. I wonder where these reviews are coming from....",
      "rating": 1.0,
      "verified": true,
      "author": "Farzana M",
      "helpful_votes": 3,
      "publication_date": 20200514
    },
    {
      "title": "This serum is excellent",
      "text": "This product is amazing. I’ve been using it faithfully in the am & pm for almost 3 months now & the results are excellent. My pores are smaller, wrinkles appear to be less noticeable & my skin is smooth & soft. I’m 47 & still have random breakouts but this serum seems to get rid of any breakouts almost overnight. I would highly recommend this product. At first I was skeptical about trying this but I read the reviews & decided to give it a try. I’ve used more expensive serums in the past and this one does a better job than all the others I’ve tried at a fraction of the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Eh.",
      "text": "Smells terrible. Which i can handle but after using this regularly i’ve developed a HUGE cyst on my face that i’ve been battling now for a few months! And i’m NOT talking ‘huge zit’ people, you’d have to see this thing to believe it. 🤦‍♀️😭 I am not saying this is directly related to this serum, maybe it’s completely unrelated - but i’ve never had anything like this before so i figured it can’t hurt to put it out there. 🤷‍♀️Other than that i didn’t really notice much difference than any other HA moisturizer. :/",
      "rating": 2.0,
      "verified": true,
      "author": "Jeanette Taylor",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "I purchased it after reading many good reviews about this product in Amazon but I am ...",
      "text": "I bought the Vit-C serum from Amazon and was applying it during nighttime after washing my face. I have combination skin with a lot of hyper pigmentation and enlarged pores in my cheek area. I used it for almost a week and it made me breakout very badly all over my forehead and cheeks leaving my skin with more acne scaring than before. Now that I have stopped using it, my face is slowly clearing up. I purchased it after reading many good reviews about this product in Amazon but I am very disappointed after using it.",
      "rating": 1.0,
      "verified": true,
      "author": "Moubani Chakraborty",
      "helpful_votes": 4,
      "publication_date": 20180505
    },
    {
      "title": "Sensitive/Combination skin breaks out with this serum",
      "text": "I've tried this for two separate periods of time now since I bought it, and I have broken out in small red pimples, especially around my eyes?? both times. I am not pleased. I am also noticing that this product likely has such high reviews because a lot of people change their reviews to 5 stars after the company contacts them once they have posted a negative review (I searched 'break' for 'break outs' specifically and started to see this trend). I have sensitive/combination skin, but I never break out like this.",
      "rating": 1.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Add this to your skin care routine!",
      "text": "I have used a full bottle (lasted 2 months) and am ready to provide my review. I did not notice any change for the first month but in my second month I started to see that my skin was little brighter, less sunspots and firmer like it used to be when I was younger. I am a 56 years old woman and have made real effort to better take care of my skin. I use this in the morning after shower and at night before I go to bed. I then apply either sunscreen moisturizer or night cream on top. I just ordered my second bottle. I highly recommend this product to be added to your skincare ritual.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Not good for your skin",
      "text": "I have amazing skin. I was looking for something to brighten it. Since using it, I have a black line appear on my cheek. I spoke to a dermatologist and they said what ever this serum contained, he reacted poorly with my skin and made it more sensitive to sun damage. Not I have to use a skin whitener to correct the damage caused. It made my skin feel so tight and unmovable as if I had elmers clue on my face and it dried. And the packaging was crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200510
    },
    {
      "title": "I'm impressed",
      "text": "I'm a woman in my 40's and have struggled with acne, especially past age 36. I've been to the dermatologist and tried a variety of prescriptions, none of which have made a significant difference. I also take daily vitamins and spironolactone to help with the acne. I bought this for the fine line, wrinkle and skin firming benefits. It arrived two days ago and I used it as soon as it got here. Then again yesterday. To my surprise, not only has it helped with skin tone, and texture, my acne is vanishing. This is a must for me. No skin irritation so far. I use it before my prescription retna and let it set for 30 minutes to absorb.",
      "rating": 5.0,
      "verified": true,
      "author": "Pcan",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Made me breakout!",
      "text": "I usually don’t write reviews, but this product did not meet my expectations. I was really hoping that this would be one thing to improve my acne scars and blemishes. In the first month, I noticed a little change, so I just thought I’ll give it a little more time. NOPE. Soon after, my skin started to break out like crazy! I got white pimples in areas that I never had on my face before. Mind you I did not change my skin routine that may play a part of it. As soon as I stopped using the product, I noticed much more improvement and my pimples were gone. Therefore, I do not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Emma A.",
      "helpful_votes": 3,
      "publication_date": 20180507
    },
    {
      "title": "Loved this serum!",
      "text": "I added this into my rigorous skincare regime, using it two times daily (morning and night), from the day that I received it. My skin is overall pretty clear but I had a couple of dark spots (acne scars) that I wanted to get rid of. I noticed a difference in my skin on about the second week. After using the serum for several weeks, my skin is completely clear of dark spots and is fairly even. It’s much more clear and has this newfound glow. I plan to give the eye gel a try next!",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "WOULD NOT RECOMMEND! 😕",
      "text": "So I wanted to use this product before I wrote a review. I got it originally because it looked comparable to the ultra glow serum from Sephora, which is my go to serum. Unfortunately I was only able to use this a few times before throwing the bottle away out of frustration. This made my skin SO DRY it was unbelievable. I tried it a few more times to make sure and yep, every time ended in the same result. If you’re looking for a good serum I recommend the Ultra Glow Vitamin C serum from Sephora! It’s around the same price as this and good for sensitive skin! I will be sticking to that from now on.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley C.",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Best customer care out there!",
      "text": "I’m giving this product a 5 star because of their customer service!! I really wanted to have this product work for me, but due to sensitive skin, it dried me out. The company reached out to me personally to see if everything was working out, gave me tips on future vitamin C serums as far as levels goes. I’ve never experienced such amazing customer service like this before. I will definitely give them another try for any future products solely due to the fact that they really do care and want you to have the amazing results most people post on here.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine S",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Great serum!",
      "text": "I replaced this serum with a vitamin c serum that cost me about $20 a week, I was looking around on Amazon for an alternative and saw the reviews for TruSkin and thought I would try it out and it does not disappoint! I get lots of compliments on my skin since I have used the vitamin C and The Vitamin C cleanser. My skin is brighter, smaller pores and my skin looks tighter. I couldn’t be happier with my purchase. It’s nice they have a coupon you can use too!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Such a remarkable and refreshing product!  It's liquid sunshine!!",
      "text": "My first order contained the Vitamin C serum. I loved how it made my skin feel. Using the serum every other night, the difference was noticeable in just a few days. It's light weight, dries quickly and it not sticky once dry. It has a pleasant, cooling sensation when applied. My skin instantly felt so soft to the touch. I'm very happy with this product and look forward to seeing the long term results in the coming months. I will order again because Erica's support and customer service is phenomenal!! She was extremely responsive and helpful with my questions. I wish TruSkin would consider expanding their line to makeup products.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim, California",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "texture: slimmy with air bubble",
      "text": "I don't know why this product has such great reviews. I am studying esthetics. I don't like it. 1) Texture: so slimmy with air bubble. 2) packaging: no box packaging, only used bubble clear wrap. Vitamin C is sensitive to air , light , and heat then the product will become unstable which mean rotten. 3) I had sensitivity and inflammed on my cheek area on first 3 days . maybe because of my skin doesn't use to vitamin C. I stop using it on my face, but i use it on my neck and tummy stretch marks which has no problem",
      "rating": 2.0,
      "verified": true,
      "author": "May",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "It May Be Good for Someone Else - not me",
      "text": "I am still deliberating about the efficacy of this product. I bought this in response to reviews about the wonderful benfits of using Vitamin C on your skin plus it contains hyaluronic acid. I like the Absorb Health product much better (see below): Hyaluronic Acid Serum | 100% Pure Strongest Dose | Collagen Booster Anti-Aging |Top Wrinkle Remover Recommended by Dermatologists | 1/2oz. 1oz. and 2oz. | HA 100 (2oz) I will not reorder it.",
      "rating": 3.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 4,
      "publication_date": 20170906
    },
    {
      "title": "Pretty good!",
      "text": "—Feel free to ask me any questions about my review!— I’ve seen this all over Instagram so I had to try it. I’ve been using it for about three weeks now and I really like it. It leaves my face moisturized and glowing without being too oily. I haven’t noticed any major dark spots going away but I do feel like my skin tone is even. I hope my description was of use to you! —Follow @CassandraMercedes on Instagram for more amazing Amazon finds!—",
      "rating": 4.0,
      "verified": true,
      "author": "Cassandra Mercedes Hanes",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "I haven’t noticed any lightening effect which is fine, I’m not looking for that",
      "text": "I’ve been using this for over a month now as part of my morning routine. I’ve been using a multi step, Japanese inspired routine which has made a big difference in my skin overall. This comes after cleansing and toner for me and I apply a few drops over my entire face. It has a slightly gritty feel going on, but it absorbs quickly. I haven’t noticed any lightening effect which is fine, I’m not looking for that, just an extra layer of protection for my skin. It’s actually helped I think with healing small marks in my skin like acne scars as well. I will definitely keep using this.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah James",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Works well!",
      "text": "I have had troubled, acne, prone skin since I was 12... I am now 47..and still battle it..I had purchased a jade roller/micro-ball roller kit..and needed a serum. I read the reviews on the product..and decided to give it a go! After the first application of serum with the micro derm roller..I was sold..saw dark areas lighting..small pimples vanished...now after a couple of weeks ..my face has started a purge cycle..but expected..I will be definitely repurchasing this product again!",
      "rating": 5.0,
      "verified": true,
      "author": "❤️’s to Shop",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Scam",
      "text": "I was really excited about this serum as it seems to have multiple benefits, but I'm not sure that's correct. It's not rocket science when applying it. It made my face red, I have some weird discoloration on my cheeks that weren't there before and my cystic acne/scars haven't budged a bit. I think this is totally a scam and it just some weird liquid...do not buy if you have sensitive skin and or want weird color patches on your skin.",
      "rating": 1.0,
      "verified": true,
      "author": "Kendra",
      "helpful_votes": 4,
      "publication_date": 20180517
    },
    {
      "title": "Just as good as the expensive brands.",
      "text": "After having tried several supposed \"medical grade\" (expensive) Vitamin C serums, I like this one better! This serum works just as well to improve hyperpigmentation and brighten skin as the expensive serums. I've also found this serum to be stable- that is: it has never changed color or scent over its usage. I use this in combination with other products to improve my skin, plus sunscreen. I will purchase it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "This is a Wonder Serum",
      "text": "Yours is the best facial product I have used to date.. I have received complements of how youthful and my face looks .. I dont even need to wear foundation as it has done wonders for my dark circles and evened out my skin tone.. I have open pores on my cheeks and they are pretty much gone after just one and a half weeks of using TrueSkin Vitamin C serum.My only regret is that I didn't order more to be able to share with my friends, but that remains the plan... Totally satisfied customer..",
      "rating": 5.0,
      "verified": true,
      "author": "GILLIAN H. CHARLES",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Amazing product. I will purchase again and again!",
      "text": "I have loved both products I have purchased from TruSkin. I have the VitC Serum that I use twice daily and the retinal moisturizer that I use every other night. My skin feels softer and has a more even tone. I have been using the VitC serum on the backs of my hands and I can tell a difference there also. I will definitely purchase these products again! The customer service is better than any company I've ever dealt with. They truly seem to care about the effectiveness of their product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 40,
      "publication_date": 20170507
    },
    {
      "title": "Removed my freckles",
      "text": "It made my freckles disappear which I didn’t want so I’m sad about that. I ended giving it to a friend for free. However if you don’t want freckles or anything like that this would be the product for you. I have extremely sensitive skin and this didn’t burn. No smell. I don’t have any thing to say about the anti-aging qualities. I used it less than a week and noticed my freckles disappearing and stopped it immediately.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandy Gisela",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Caused little pimples everywhere - didn't work for me",
      "text": "This didn't work for me at all. I gave it about month and a half to try and see if it would work for mwe, but every morning I would wake up with more little pimples on my face. I've never been one to have a lot of acne so it was a shock to me. I stopped using it about two weeks ago and my skin has cleared up and is back to normal. It's a shame it didn't work for me, but it looks like it works well for other people so I wouldn't count it out.",
      "rating": 2.0,
      "verified": true,
      "author": "Ali McDonald",
      "helpful_votes": 2,
      "publication_date": 20200410
    },
    {
      "title": "Excellent Customer Service!!!Disappointing product, possibly a knock off.",
      "text": "UPDATE!: I must commend Erica, the seller. She reached out to me after discovering my disappointment in the product. She promptly refunded the cost of my purchase and sent out a new vitamin C serum. Included with the second bottle was information on what to expect and how to use the product. I’m impressed with the customer service of this company. My concerns were dealt with promptly and I’m excited to see the results from using this Vitamin C serum This is my first foray into Vitamin C serum. I really didn’t know what to expect, though I would have expected a bottle to be completely full. Half of this bottle was bubbles and air.",
      "rating": 5.0,
      "verified": true,
      "author": "holly salemi",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Holy Grail!!",
      "text": "This is the Holy Grail of Face serums!! I am a product junkie and have used some very expensive brands and not seeing the results I’m seeing with this. I’m 54 and have never had any work or procedures on my face . It took about three weeks but I noticed my skin almost glows. It’s now a must have in my face regimen .",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle anderson",
      "helpful_votes": 3,
      "publication_date": 20190402
    },
    {
      "title": "Truly amazing product",
      "text": "I had recently lost a family member. My eyes looked tired and more aged, almost overnight. I tried this and immediately saw a difference, the recent fine lines faded and I started to look more like myself. There are a lot of products to choose from. I hope this review helps, because this stuff actually works. I doesn’t make my skin feel dry or anything, but I still have to use a moisturizer after I apply it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladyvirtigo",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Waste of money",
      "text": "I bought this product based in the good reviews, they said is a very good serum that almost do miracles. Wrong! At least no for me. After a month of use everyday two times a day I don’t see any change. In the opposite it doesn’t feel like a serum, it’s consistency is watery and after it dries out my face feels thigh and dry, it’s like I’m just putting egg whites over it, disappointing. I don’t know why the excitement about it. It was just a waste of money. We get what we pay for.. watery egg whites!",
      "rating": 2.0,
      "verified": true,
      "author": "ErenLo",
      "helpful_votes": 2,
      "publication_date": 20180612
    },
    {
      "title": "I can feel and see a difference",
      "text": "I began using this serum 2 weeks ago. In the first 10 days when I applied it my skin soaked it and felt dry so I used moisturizer on top of it. Two weeks later I’m not using moisturizer after I apply it because my skin feels so soft and hydrated. My pores are smaller and my face is brighter. The first picture was on the first day I started using it. The second picture I am only wearing eyeshadow and lipstick. What you see is my skin without foundation or filters. I can see a difference and I want to purchase it again. I’m 46 years young.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Worth a try",
      "text": "Everyone’s skin is different. I have dry sensitive skin and delayed adult acne. I use veltin gel prescription to treat it. I used it in the day time and night time. Seems ok in the day time. The one time i used it at night it caused my skin type to break out. I do not use it at night anymore. I got it to smooth out my acne scars and lighten them. I cant really tell if its working, because my skin broke out. It has since started to clear back up after only using it in a day time routine.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabrielle Ross",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Amazing customer service",
      "text": "Unfortunately this serum made me break out. I have dry skin and rarely have blemishes and now I have 9 obvious pimples. It was worth a try, but did not work for me. Update: immediately contacted by customer service and offered a complete refund and another product to try. I am impressed with the follow up and sincere interest in finding a product that benefits my particular skin issues. You have nothing to lose here, worst thing that may happen are a few outbreaks, best thing, you may find a wonderful, never to be without, skincare product! I will continue to seek the perfect product for me.",
      "rating": 5.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 2,
      "publication_date": 20180810
    },
    {
      "title": "Love it. I bought for my teenagers too",
      "text": "My skin has cleared up so much. I wish I would have taken b4 and now. I did purge for 2 weeks. But I'm glad I read the reviews and hung in there. I wash my face with PCA gentle face wash then use PCA daily exfoliate face wash. I use a spin brush with led light (I purchased from amazon) while the exfoliate wash is on. , rinse with warm water and then cold water. Apply my toner then use the serum. When dry I use a moisturizer from great skin and spa.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Nice at first, not for everyone",
      "text": "Initially I really liked this product. Felt my skin looked refreshed and bright and had no side effects. Within a few weeks, I developed a recurrent peeling/burning rash around my lips that lasted two months. Didn't know what was causing it because it would come and go in cycles every 5 days. Eventually, by process of elimination, I found out it was this product I had an allergic reaction to even though i made sure not to let it get close to my lips. Finally, after 7 days of discontinuing, it resolved and hasn't returned. Had to throw it out, too bad. Definitely skin-test it first. Has potential if you don't have too-sensitive skin.",
      "rating": 3.0,
      "verified": true,
      "author": "april21",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Baby acne?!?! 😱",
      "text": "Do NOT use every day. It will cause a little rash of what I call “baby acne” (since it looks like the little bumps babies get. An esthetician told me too much vitamin c does that....I learned the hard way. Other than that I think adding this to my new regimen was ok and I’ll continue modified use.",
      "rating": 4.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 2,
      "publication_date": 20190315
    },
    {
      "title": "... not so expensive that claim to get rid of fine lines and renew skin that haven't worked",
      "text": "I have tried many skin products that are very expensive and not so expensive that claim to get rid of fine lines and renew skin that haven't worked. I got TruSkin Vitamin C, E & Hyaluroic Acid and Vitamin C with B5 Daily Facial Moisturizer. The fine lines around my upper lips and around my eyes have diminished greatly and my skin feels like silk, now that is really fantastic for a lady of 78 yrs. young. Sandra Davis, Palm Desert, CA.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20170522
    },
    {
      "title": "Rashes appeared when applied to face😞",
      "text": "I used this product before for dark spots on my face and it worked good.So I ordered another one and started using it after 20 days of receiving the product as I didn’t get the time.As soon as i applied it,I got rashes all over my face.So stopped using it for 2 to 3 days and my face was normal.So I again I applied to check if everything is normal but the same rashes appeared again.My husband also applied to check and he even got rashes and some burning kind of sensation on his face.So we both stopped using it.I don’t know what was the issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200719
    },
    {
      "title": "The jury is still out....",
      "text": "The packaging on this product is great, and it is very simple easy to use. However i am not sure if i like it enough to buy again. After almost 3 weeks of use (morning and night) i dont see much improvement on some sun spots I have on my face. I do like that it absorbs quite well into skin, and dries as a matte finish. I can easyly wear it under makeup. But my concern is that the consistency of the serun feels somewhat grainy... like a powder that has not dissolved well in the solution. I will keep using it until the bottle runs out and report back with more results.",
      "rating": 3.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 4,
      "publication_date": 20171203
    },
    {
      "title": "After 2 weeks decreased my wrinkles and significantly brightened my skin",
      "text": "This was my first experience trying any kind or serum for my face my wrinkles were showing more and my skin tone was uneven as well as dark circles under my eyes that would not go away.... im very impressed this is only 2 weeks of use, I had no breaking out or any skin issues associated with this product it went on nice and dried fast its smoothing my wrinkles and brightening my skin overall very nicely im very satisfied with this and will be ordering again.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Pence",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Love it",
      "text": "I have been using this product for a good 6 months now! I use it in combination with a retin A cream as well as an anti aging moisturizer. You apply the serum first before everything else so it can sink in. I am 35 years old and have very dry skin. Because of this I had tons of wrinkling on my checks when I smiled. My skin was dull and looked aged beyond my years. After 6 months of religiously using these products my face is SO much better! It looks supple and well moisturized. The wrinkling on my checks looks way better as well. I will continue to use!",
      "rating": 5.0,
      "verified": true,
      "author": "brandi calhoun",
      "helpful_votes": 2,
      "publication_date": 20181225
    },
    {
      "title": "So disappointed!",
      "text": "I had such high hopes after reading all the good reviews that this would work for me. So I bit the bullet and paid what I thought was way too much in hopes it would help. However, after using it for 2 weeks straight, I can tell zero difference in my skin. It doesn’t even feel softer, which is strange I think. I know it’s a chance anytime you buy stuff like this, and I guess this time it didn’t pay off for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "This freaking works!",
      "text": "This product has become a daily must for me. If I forget to put it on I’m turning the car around. Truth is all things take time, but the results are always worth it. The pictures are from June ‘19 to August ‘19. I’ve always struggled with skin problems and I am truly noticing the difference. The seller is amazing and extremely helpful. If you reach out the quickness and thoughtfulness of each email is amazing. Why wouldn’t you buy this product?! The bottle seems small but it’s just enough for you to see results. Buy this!! You will not regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "zan",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "It really works the way they say it does",
      "text": "I've only been using this a week and already my skin is brighter and my forehead looks smoother. My skin glows in a way that it hasn't for years. I have VERY sensitive skin and I haven't reacted at all to this serum, although it makes my face feel really tight after I use it. I use Ponds facial cream after I put the serum on and that helps with the tightness. I also am prone to breakouts around my chin and lips and have actually seen a decrease in any spots/pimples that I have. I've never really believed that a skin care item could really change your skin that much but this stuff is the real deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Wallace",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Didn't show any noticeable improvements for me",
      "text": "I personally didn't see any benefits from using this, but it didn't cause any ill effects either. Admittedly I could have stuck with it longer but it just felt like an unnecessary step in the routine after awhile. The packaging was very nice either way.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather G",
      "helpful_votes": 4,
      "publication_date": 20180614
    },
    {
      "title": "Didn't work out for my skin",
      "text": "I was looking for something to treat the dark spots on my face since having a baby, this didn't seems to help.I've had this for a couple of months now and while trying it I used drunk elephant and tatcha moisturizers on top of it. I have dry skin already, and for some reason this seems to make my skin drier? If you have dry, dull skin like me and want to fade dark spots I highly recommend Farmacy's Glow serum (pricey but imo soooo worth it).",
      "rating": 2.0,
      "verified": true,
      "author": "Breanna",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Magic potion",
      "text": "Where has this been all my life? This stuff is amazing! At 31 I am trying to take care of my skin more as I noticed my face looks \"tired\". I started to use this and saw immediate results. I apply it after washing/using a derma roller and follow up with applying moisturizer afterwards. My husband has even noticed a difference after using a week and has said things like \"your face is glowing\", \"your face looks radiant\", \"you look different, younger\", \"whatever you are doing is working\". Bottom line if you're in search of an anti aging serum, stop looking and buy this.",
      "rating": 5.0,
      "verified": true,
      "author": "J.D.M.",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "amazing",
      "text": "I wouldn't have believed this unless I tried it myself, but this serum has changed my face in approximately 4 days. Probably more like overnight. I had developed acne along my jawline about a year ago and nothing has helped. I tried acne medication, not taking acne medication, stopped using toner, changed toner, changed moisturizer, stopped using moisturizer... nothing helped. I also use a new clean washcloth every day and wash my face morning and night. I got this on Monday and today is Saturday and really, almost instantly, the acne has all disappeared. I really am shocked. This stuff is a miracle worker.",
      "rating": 5.0,
      "verified": true,
      "author": "HartLink",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "A forever customer!!!",
      "text": "Man oh, man where do I start. I have been struggling with blemishes and acne for years now and can say that I have tried possibly everything and nothing really gave me the results that I was looking for until I found this baby right here. This basically pure skin love in a bottle, I follow a routine every morning and night and this is apart of my routine of smoothing out my skin and even brightening up the blemmishes that are basically almost completely gone now. I am so happy that I choose this product and look forward to being a long time customer forever. Definitely recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "This should be called the Real Truth Serum!",
      "text": "absolutely love the serum, so far it is the next one I’ve used so far (I’ve used high-end such as Ole Henriksen and Sunday Riley, and cheaper ones found on Amazon at TJMaxx). I have dry, sensitive skin (mild eczema) and it gives my face and extra boost and hydration throughout the day. I use it before applying my moisturizer and before my sheet masks at night. I definitely recommend it to my close friends and all you strangers on Amazon. Thank you and purchasing again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "DreCam",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "TruSkin is the best!!",
      "text": "I truly believe that it’s a myth that you have to spend a fortune on skin care to see results. I have tried many different Vitamin C serums at all different price points, and I really believe that TruSkin is the best on the market. My skin looks brighter, feels smoother and I get compliments all the time. Although most people think I’m much younger, at 68 I needed something that was really going to make a difference and TruSkin is just that. Don’t think twice about ordering a bottle, just do it! You’re going to love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Palmar",
      "helpful_votes": 2,
      "publication_date": 20200808
    },
    {
      "title": "Good for the price. Read below.",
      "text": "I’ve been using this serum every night for over a month. It feels good on the skin, unfortunately, it’s not a miracle worker. My wrinkles are still here, my acne scars haven’t faded much, and my large pores still appear the same.. However when I stop using it, my skin does look duller (to me). Update: I updated my review to 5 stars for the customer service alone. When they read I wasn’t completely happy with the product they contacted me to refund me and offered to send me a different product to try out at no cost. I’ve never in my life had a company do that. I think they truly care to keep customers happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Marlene O.",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Be careful!!",
      "text": "I usually don’t write reviews, but I wanted to warn people of this product!! I’m usually never allergic to any products and I have combination skin with VERY rarely dry skin. I did a patch test and there was no reaction, so I put the product on my entire face and it made my skin SO dry to the point where my skin was nearly sliding off my face. I also got a rash on my entire face, making it look like my acne got worse. I’m sure this is a good product for many (based on so many positive reviews) but it didn’t work for me, so proceed with caution!! even if you don’t normally have sensitive skin!!",
      "rating": 1.0,
      "verified": true,
      "author": "lauren z",
      "helpful_votes": 2,
      "publication_date": 20200509
    },
    {
      "title": "It works un about 4 to 5 days you can see the difference 🥰",
      "text": "This literally cleared marks from my face after like 4 or days",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20201019
    },
    {
      "title": "Don’t be afraid to try something new!",
      "text": "I think every woman is nervous about adding a new step to their skin care routine. I did try a patch of skin first and prayed, that when I woke up it would not be a scary sight! I’m pleasantly surprised! I have used Obaji and all levels of professional grade skin care ointments and serums. I have noticed a positive difference in my overall glow, my pore size and slight skin imperfections. I highly suggest that you give it a try. Please trust this is my honest direct feedback. I still use all my other skin care at night, but love this new addition! Good luck!",
      "rating": 5.0,
      "verified": true,
      "author": "DHansbury",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Not for me.",
      "text": "I’ve been searching for a good vitamin c serum and was hopeful this would be it, based on all the great reviews. I used it up, wanting to give it a good shot. I did not notice a difference in my skin. I saw some reviews that said they didn’t think it made a difference until they stopped using it, but I didn’t notice a change even then. I found it pretty drying, but I live in Denver where the air is already pretty dry so maybe that was it. I was always itchy to put on moisturizer immediately after applying this because it made my skin uncomfortably dry.",
      "rating": 2.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200518
    }
  ],
  "product_meta": {
    "title": "TruSkin Vitamin C Serum for Face with Hyaluronic Acid, Vitamin E, Witch Hazel, 1 fl oz",
    "description": "Size:1 Fl. Oz\n\nWho needs artificial fillers and harsh chemicals when you can achieve amazing results without them!\n\nTruSkin Naturals is all about skin-friendly, ingredients\n\nIMPORTANT - This plant based formula naturally ranges in color from almost clear to somewhat cloudy from batch to batch. TruSkin Naturals chooses not to hide these natural variations with artificial colors and synthetic stabilizers to ensure the formula is kept as pure as possible and because the appearance of the serum has no impact on the effectiveness of the formula.",
    "rating": 4.3,
    "feature_bullets": [
      "Advanced Antioxidant Serum - An indispensable nutrient for collagen production, vitamin C synergistically blends with Botanical Hyaluronic Acid and Vitamin E in this advanced formula designed to target the most common signs of aging including brightness, firmness, fine lines, wrinkles, dark spots & sun spots.",
      "THE DIFFERENCE in skin treated with TruSkin Vitamin C Serum is striking. See thousands of reviews from real Amazon customers below rave about brighter, fresher looking skin, improved tone and clarity, smaller pores, less breakouts, fine lines and dark spots.",
      "Plant Based Formulation - Free of synthetic color additives, fragrance, and stabilizers, dynamic active botanicals like Aloe Vera, MSM, Botanical Hyaluronic Acid, Witch Hazel and organic Jojoba oil combine in a silky smooth serum that can be used day or night.",
      "Leaping Bunny certified CRUELTY FREE. Formulated and bottled in the USA.",
      "EXTENDED MANUFACTURER GUARANTEE - Love it or your money back! We understand it can take some experimentation to find just the right product for your unique skincare needs. If for any reason you decide this product isn't a good fit for your skin, we offer a 90-day money-back refund. No questions asked (in fact, you don't even have to return the bottle)."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.25 x 1.25 x 3.5 inches; 0.64 Ounces",
      "Item model number": "Best Vitamin C Serum",
      "UPC": "646437501880 689528876429 646437501866 820103239424 649558872600",
      "Manufacturer": "TruSkin Naturals",
      "ASIN": "B01M4MCUAF",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Serums"
    ],
    "price": 19.99
  }
}