{
  "website_summaries": [
    {
      "verdict": "This butcher block's large dimensions allow it to double as a serving tray.",
      "pros": [
        "Made of organic bamboo, which is a durable wood",
        "Usable as a serving tray as well as for cutting food",
        "Includes a drip groove to catch juices created while cutting",
        "Large size butcher block of about 18 by 12 inches"
      ],
      "cons": [
        "Only 0.8-inches thick, meaning it may warp over time"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent Quality & Price!",
      "text": "We run a small bed and breakfast and each room has a small kitchen. We like to provide cutting boards for guests and you cannot beat the quality of these boards for the price offered. Some people say not to put these boards in the dishwasher but we have never had any issues and we sanitize them in between each guest. There have been zero splinters from any of them as read in some of the other reviews and the quality is beautiful. It arrives wrapped in heavy-duty plastic with nice packaging that clearly shows the manufacturer put thought into. We are very happy with these cutting boards and will continue to purchase them for our guests.",
      "rating": 5.0,
      "verified": true,
      "author": "LCF",
      "helpful_votes": 184,
      "publication_date": 20180802
    },
    {
      "title": "KNOW HOW TO CARE FOR A WOODEN CUTTING BOARD BEFORE BUYING",
      "text": "Great cutting board great price. Always handwash and never put in a dishwasher or you are asking for troubles. Dishwashers get much to hot for a wooden cutting board and the detergents will only degrade the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Toadster",
      "helpful_votes": 188,
      "publication_date": 20180202
    },
    {
      "title": "Great product & seller",
      "text": "I won't lie... it took me over an hour to narrow down all the options Amazon had for bamboo cutting boards, but I kept coming back to the Royal Craft Wood listing and choose them. This morning they sent a note advising my shipment was out for delivery. They included tips for maintaining my board and direct contact info should I need them for anything at all. That email simply confirmed I made the right choice in a seller. Hopefully I won't need service, but I'm confident I'm in good hands if I do. As for the cutting board, it is beautiful, with a smooth surface and not a single flaw.",
      "rating": 5.0,
      "verified": true,
      "author": "JBean",
      "helpful_votes": 149,
      "publication_date": 20180115
    },
    {
      "title": "I love this cutting board",
      "text": "I love this cutting board. I was looking for one large enough to comfortably hold a 7 lb turkey breast for slicing for Thanksgiving. This worked really well! It has a generous cutting surface and a really good well for catching juices. And I can already tell that it’s much easier on my knives than my old wooden cutting board. When it was time to move the turkey to the table, the cutouts to grab the cutting board made moving the sliced bird a breeze. Bonus: it’s really beautiful. Right now, I’m still leaving it out on my counter just because it’s so pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Attorney mommy",
      "helpful_votes": 83,
      "publication_date": 20171125
    },
    {
      "title": "Very nice",
      "text": "A very nice cutting board. It just the right size for all of my cutting needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Tequila",
      "helpful_votes": 63,
      "publication_date": 20180206
    },
    {
      "title": "Excellent quality!",
      "text": "Excellent quality! Very happy with purchase! Just be sure to oil it well upon arrival...& before first use.",
      "rating": 5.0,
      "verified": true,
      "author": "Nickolas wheatley",
      "helpful_votes": 51,
      "publication_date": 20180625
    },
    {
      "title": "Professional Grade!",
      "text": "An awesome bamboo cutting board. The first I ever purchased and I'm in NO WAY disappointed. On the first day after opening the shipping package, I prepared my slow cooker for a vegetable and beef stew. Easy cutting of veggies on the board and easy clean-up also. This board replaces the acrylic boards I normally used. Very happy I made the decision to go to quality wood bpard.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Downes",
      "helpful_votes": 36,
      "publication_date": 20190222
    },
    {
      "title": "Love this cutting board! :)",
      "text": "I am very happy with my purchase. I was looking at similar cutting boards at Crate and Barrel and decided to chexk amazon for more reasonable pricing. This is a very solid board. Light weight. I love the grooves in the side to keep stuff from getting all over my counter. Only unpleasant thing was that when fiest unwrapped had a very strong vinegar smell, but a quick rinse took care of that.",
      "rating": 5.0,
      "verified": true,
      "author": "LindsvanleerTop Contributor: Pets",
      "helpful_votes": 78,
      "publication_date": 20170413
    },
    {
      "title": "Perfect cutting board",
      "text": "This is a great cutting board. Not too big and just the right size for everything I need it for. Received it before expected and the customer service follow-up is excellent. They advised me how to keep the board in great condition with food grade mineral oil and I look forward to using it for many years to come. Great product and service.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 57,
      "publication_date": 20180207
    },
    {
      "title": "Doesn't Dull Your Knives",
      "text": "Royal Craft Wood makes one hell of a nice cutting board , it's a heavy duty cutting board with milled out handles and a juice groove , cut in all the way around the inner edge ! This cutting board is heavy duty , checking in at a little over three-quarters of an inch . This is the nicest board I've ever owned and it will not dull your good knives like that UNV-40 plastic or teflon does . I have good knives that are sharp sharp and don't need them dulled after doing a few cuts . Royal Craft Wood . THANK YOU Willie Nicol",
      "rating": 5.0,
      "verified": true,
      "author": "William Nicol",
      "helpful_votes": 40,
      "publication_date": 20180317
    },
    {
      "title": "Great size for charcuterie presentations",
      "text": "Great looking board and can't wait to start using it for charcuterie. Received it in fine condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Saltwater guy",
      "helpful_votes": 44,
      "publication_date": 20180109
    },
    {
      "title": "TERMITES",
      "text": "The board had termites in it. After the first use, I noticed there were small holes and noticed the termites. I threw it away immediately. I never had any issues with termites before getting this board.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 35,
      "publication_date": 20180719
    },
    {
      "title": "Amazing replacement from my old cutting board!",
      "text": "This cutting board was definitely and upgrade in terms of sturdiness and the fact that this was way larger than what I had previously ;) . I can now have a reliable cutting board that has enough space for ingredients to cut to my hearts content!!! Highly recommend for the value and bamboo quality of this cutting board!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 27,
      "publication_date": 20190223
    },
    {
      "title": "I would've described it as large, not extra large",
      "text": "Absolutely love my new cutting board 😍 It's exactly how the seller described it. Highly recommended. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Francine",
      "helpful_votes": 25,
      "publication_date": 20190523
    },
    {
      "title": "Cheap boards that warp almost immediately.",
      "text": "My original board warped almost immediately, even though I treated it with mineral oil as directed. To the companies credit, they sent me a replacement at no charge. This second board also warped. They no longer lay flat on my counter-top and are useless. Spend a little more and look elsewhere. I have 3 other bamboo boards from other manufacturers that I've had for years without issue, but I bought this one for the juice groove. So I know how to care for my boards. This stuff is just cheap. I am baffled by all these positive reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Padilla",
      "helpful_votes": 39,
      "publication_date": 20180111
    },
    {
      "title": "Love it",
      "text": "Very big, very sturdy, kind of heavy but very beautiful",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Keyes",
      "helpful_votes": 33,
      "publication_date": 20180320
    },
    {
      "title": "It swivels around. It irritates me. It comes ...",
      "text": "It swivels around. It irritates me. It comes with tape to place underneath board but not practical when you have to lift board to clean.",
      "rating": 1.0,
      "verified": true,
      "author": "Alice Troup",
      "helpful_votes": 30,
      "publication_date": 20180216
    },
    {
      "title": "Good purchase, and good way to replace plastic cutting boards",
      "text": "Follow the care instructions and make sure you seal it with oil, and this cutting board will last a long time. No issues so far—does its job well for a good price and looks good while doing it.",
      "rating": 5.0,
      "verified": true,
      "author": "JWM",
      "helpful_votes": 27,
      "publication_date": 20180122
    },
    {
      "title": "Cracking",
      "text": "We had this cutting board for about a month and it started to crack. Very disappointed- it was such a good size :(",
      "rating": 1.0,
      "verified": true,
      "author": "Lynnellen",
      "helpful_votes": 21,
      "publication_date": 20180813
    },
    {
      "title": "Save yourself the drama and purchase from a quality seller.",
      "text": "Don’t let all the positive reviews about this product fool you, all the 1-2 star ratings are legitimate and often include photos. I wanted to give this company the benefit of the doubt and was unfortunately proved wrong. The board, fresh out of packaging, was full of splinters. Okay, I can deal with it. But, after the FIRST use, after being properly cared for via their instruction, the board is split in several places and essentially useless. Won’t deal with the hassle of returning and will not be purchasing from Royal again.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 18,
      "publication_date": 20180121
    },
    {
      "title": "Love it!",
      "text": "I love this cutting board. It cleans up very nicely and works great. I decided to mount mine to. the wall with folding brackets. When not in use I fold down. When I want to use it I fold it up and either cut veggies or have dinner.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 22,
      "publication_date": 20181015
    },
    {
      "title": "Cracks after a month of use!",
      "text": "The cutting board itself was very sturdy and attractive. I bought it for my new kitchen and within a month of usage, it already have shown cracks and it's falling apart. I have put mineral oil on it regularly to condition this cutting board and is thoroughly disappointed. After every wash, I leave it standing on the sink trivet to drain for fast drying and yet it still cracks along the board. Not sure how much longer it will be before it fully falls apart.",
      "rating": 1.0,
      "verified": true,
      "author": "MeowGurl",
      "helpful_votes": 5,
      "publication_date": 20200225
    },
    {
      "title": "My favorite for all kinds of food prep",
      "text": "This is the best cutting board I’ve found anywhere. Maybe I’m pretty easy to impress but this board is durable and tuff, but also easy to clean and stores easily. It dries fast after cleaning and there are only a couple of knife marks in the board after several months of use. BTW I use Cutco knives and they are fairly sharp. Others boards I own have cuts all across the board but not this one- go figure. I like the size that allows space for several different things to be on the board at once. Looks like it’s going to last for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Miller's High Life",
      "helpful_votes": 5,
      "publication_date": 20190803
    },
    {
      "title": "Nice cutting board.",
      "text": "The cutting board is very attractive and I leave mine on the counter all the time because it looks so good. It's easy to cut things on as it's plenty large. The one thing I didn't like was that it slid around when I was cutting so I got a package of little rubber self stick bumpers and stuck one on each corner on the bottom. No more slipping and sliding. The bumpers are available on Amazon and other places easy to apply.",
      "rating": 5.0,
      "verified": true,
      "author": "Beepee",
      "helpful_votes": 7,
      "publication_date": 20181016
    },
    {
      "title": "I was excited when I got my board in the ...",
      "text": "I was excited when I got my board in the mail even when I opened it and heard popping noises. I disregarded the noise as something else and moved on. About 30 mins later i noticed the noise was coming from the board itself and it was cracked all over.... what a disappiontment....",
      "rating": 1.0,
      "verified": true,
      "author": "Greg O.",
      "helpful_votes": 11,
      "publication_date": 20180106
    },
    {
      "title": "Great for serving as well",
      "text": "This cutting board is a staple in our kitchen. We use it everyday. We have cleaned and sanitized and cleaned some more multiple times with no cracking or warping of the wood. We wash daily and sanitize with clorox wipes. We also use a homemade fresh lemon salt scrub for odor and sanitizing. The board is heavy and sturdy. It is a good quality cutting board which we occasionally use as a serving platter. The board does not need to be oiled from what I have experienced. However if you want to keep that nice bright color wood, we find coconut oil works best for us. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Angelique D",
      "helpful_votes": 4,
      "publication_date": 20190613
    },
    {
      "title": "Sadly disappointed",
      "text": "I just recently moved to a new state and I was sad to leave my old cutting board behind with my previous roommates. I was really excited to get a new cutting board that was larger and had more surface space for cooking and chopping since I cook on a weekly basis for my meal preps. Was extremely disappointed and sad to find the cutting board that I order was chipping and cracking before any use. Returning the board for product damage. Sad to say that the board failed my expectations.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 7,
      "publication_date": 20190606
    },
    {
      "title": "Great Quality Board",
      "text": "This is a good quality cutting board. The wood is solid and sturdy. This is a dual sided cutting board. The back is adhered to the front, but make no mistake this is not a bunch of glued together little pieces of wood. One side has grooves to catch juices from meat. The other side is completely smooth and can be used as a serving tray. I use one side for raw meats and the other side for vegetables. It's a thick board....3/4. It cleans up easily....even wet flour that has begun to dry out is easy to clean. I really like this board. It's the best wood board I've owned. It doesn't warp!",
      "rating": 4.0,
      "verified": true,
      "author": "Trend",
      "helpful_votes": 2,
      "publication_date": 20200209
    },
    {
      "title": "I bought it for a different reason.",
      "text": "I like to put my toaster oven and slow cooker on a board on my counters. A left over from my Mom I guess. I did not buy this for a cutting board but for a under the appliance board. I liked the way it looked and that's what I use it for. I did notice when I took the paper off it had a big splinter by the handle cut out. I pulled it and it took wood away before it came off. Also had a long splinter of wood come off as I was running my hand over it. However, I bought this for a different reason. As a cutting board I can not rate it.",
      "rating": 3.0,
      "verified": true,
      "author": "ChefGirl",
      "helpful_votes": 2,
      "publication_date": 20190824
    },
    {
      "title": "3 months old, already cracking",
      "text": "Had this board about 3 months, and used it less than 5 times during that period. Each time I hand washed it, dried it, and left it sitting upright to air dry. Also oiled it twice with cutting board oil. The board has already developed a crack running lengthwise, which will eventually split the board in two. Already this crack is a problem as food and liquids get in there and make it difficult to clean. Not sure if I just got a defective board or they all end up like this.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Locke",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Board is small and the groove is useless",
      "text": "Good quality bamboo board, but it is small and the juice groove is too small to handle most cuts of meat. While it is probably my fault for not being more attentive to the dimensions of the board, in it's current configuration, it is much to small to be of much value to a substantial piece of protein. And, once again, even with a right sized piece of protein, the juice groove is really not useful - it should have been double the width and depth.",
      "rating": 3.0,
      "verified": true,
      "author": "Val",
      "helpful_votes": 3,
      "publication_date": 20181211
    },
    {
      "title": "Amazing quality for the price",
      "text": "I purchased the 18\" x 12\" board for $20 and have been using it about 4 months now. I cook at home practically every day using an expensive set of Henckels knives and have owned many hardwood and bamboo boards, and this one is certainly the best bamboo board among the many I have used. Resists stains (even turmeric), cleans up easily and it It rarely needs oiling. No issues so far with the laminates not staying fused like some other bamboo boards. The only improvement I'd suggest is non-slip rubber feet, but those are inexpensive and easy to attach yourself as I did. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Bamboo is very hard............",
      "text": "First, I did not want to pay hundreds of dollars for those thick cutting boards. The millionaire chef's can afford them. I, on the other hand, had a plan. After cutting and gluing two 3/4 inch a/c plywood panels, sanding and conditioning with butcher block oil treatments, attaching rubber feet, I now have a thick cutting board to die for. A little ingenuity, creativity and woodworking experience, this cutting board is the best. But you have to start with the best, doesn't have to be expensive, but bamboo is a very hard wood. Thanks to Amazon and a little imagination, I love to cook and love to use my new cutting board!",
      "rating": 5.0,
      "verified": true,
      "author": "Mattaniah",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "A cutting board, plus.",
      "text": "A few years ago my oldest son, who is (IMO) an excellent wood worker and craftsman, made a custom cutting board for me. That board was ideal, but this one may just be a little bit better (sorry, Darren!) because of the indentation on the underside, which provides “handles” which greatly aided moving the board while keeping it level, so nothing, not even the juice from veggies or meats, spills. What a clever idea!! Which gives this board its “plus”.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean kidwell",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Greatness in a cutting board.High quality board which can double as a serving tray. Bamboo is as durable, if not more so, than b",
      "text": "Beautiful board. Quality is top drawer. Size is perfect for that larger chopping/slicing job. I have been using bamboo boards for years now. They last......hold up as well or better than (Expensive) butcher block. Cleanup is a breeze. Try this board, you'll be pleased. It also can be used as a serving tray. Double duty. High quality board which can double as a serving tray. Bamboo is as durable, if not more so, than butcher block. Been using bamboo boards for years, This board is a great size for all chopping and slicing chores. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Herbster",
      "helpful_votes": 2,
      "publication_date": 20180715
    },
    {
      "title": "The board needs sanding in order to eliminate the possibility of getting splinters.",
      "text": "It's difficult to give a complete and accurate review, given that I have just recently received this cutting board. My initial observation is that it's a beautiful board. My immediate concern is the need for oiling and sanding in order to smooth the edges, and prep the board prior to use. I feel that the issue of sanding is a quality control matter that should be addressed by the manufacturer, prior to distribution. For example, I wouldn't buy a dress that required me to do the final stitchings. It's not an unreasonable expectation to assume a product should arrive ready to use, unless the product description states otherwise.",
      "rating": 3.0,
      "verified": true,
      "author": "SLW23",
      "helpful_votes": 2,
      "publication_date": 20181230
    },
    {
      "title": "Do not buy product!",
      "text": "The board looks like a factory second. I would recommend buying another cutting board. It looks like someone dropped the board and then try to cover it up with wood putty of a different color.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Lezynski",
      "helpful_votes": 3,
      "publication_date": 20200602
    },
    {
      "title": "Splitting after 6 months",
      "text": "I initially thought it was a good board. Cleaned up easily following the care instruction and didn't show too many knife marks. Oiled it regularly and never soaked it. However after 6 months it is starting to split as it is made up of numerous pieces each about 1 -2 inches wide. I'm afraid this will be a source of problem over time in terms of keeping material and food pieces out of all the small cracks. Thus guess I'll have to be looking for another board. It was a good size but for the price it should last longer than 6 months before it starts splitting.....",
      "rating": 2.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "bought for my son-in-law",
      "text": "My Son-in-Law cooks all the time. Elaborate dishes that require a lot of slicing and dicing of veggies and fresh herbs. This Ex-Large cutting board is perfect for chopping up Pork Shoulders or fine slicing steaks. He uses it at least once a week, usually more. He really likes the drain channel around the edges of the board. Sturdy enough to take weekly use, and cleans up easily. I am thinking about getting him another as he uses it as an appetizer sampler tray too.",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Small US business- great product and service",
      "text": "This cutting board is one of the best ones I've ever had. It is very nicely constructed and quite hefty. It has a juice groove and handles machined in the ends. Bamboo makes the best cutting board and is knife edge friendly. This cutting board is made in the USA by a family business and a veteran. The owner sent me a letter of thanks for supporting his small business 😁 I thought that was very cool. Awesome service too!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Excellent Quality, well crafted and designed to last!",
      "text": "A cutting board, nothing to get overly excited about, right? Wrong! This handcrafted cutting board is well designed and will probably outlast you. Easy to clean and maintain, it looks much better than the cheap plastic one it replaced and that's the idea; to have a cutting board that looks good so it can be left out on the counter at all times. My friend bought one of these for me over a year ago and I decided to get another for an opposite end of the counter. The two almost match precisely even though they are handcrafted! Absolutely perfect! Stop reading and pick this one up as you won't regret it!",
      "rating": 5.0,
      "verified": true,
      "author": "Digital Addict",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Excellent craftsmanship !",
      "text": "It’s not everyday that I will write a review but I must for this cutting board. At first I thought for the price I would receive some disposable cheap cutting board. However the design and craftsmanship of this cutting board have exceeded my expectations. Very sturdy, easy to flip sides and quick wipe down in seconds. I intend to keep this cutting board for a very long time, and that’s not something you can buy these days with cheap materials so easy to use by companies. I definitely intend to purchase more from Royal Craft Wood. Company is veteran owned 👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Big spoon",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Best cutting board ever!",
      "text": "My bamboo cutting board is better than any cutting board I have ever had. As a good British friend use to say \"It does what it says on the tin\". The follow up email I received from Royal Craft Wood was so helpful and informative. Rather than a lifeless appeal for a good review, I received a sincere letter with tip and information I could actually use. I highly recommend this product to my friends and family. Any anyone that is looking for a quality cutting board.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Owens",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Well made with lots of space. Bought again!",
      "text": "I’ve used this cutting board almost daily since February. I don’t put in the dishwasher. It’s very sturdy, well made, wide enough to cut many vegetables and seasonings so that each has its own ‘space’. Easy to lift to add directly into cooking pot. Love it and will definitely purchase another. Update: after the original purchase and the performance of the board. I bought a second one. Now I have two. One for meat one for vegetables! Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marlyn",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "This item is the you know what ha",
      "text": "I received a letter from Alex Arno ...a single veteran father who graciously asked me to leave a review of his cutting board and i felt honored to do so..there are tons of cutting board knock offs ..even some that are distant but this cutting board is light, easy to clean, safe, doesn't splinter and i use an OOU Chef's knife that is sharper than a who a thought it...bought here on Amazon...if your looking for an awesome cutting board...look no further Thank you Alex Gods speed!!!",
      "rating": 5.0,
      "verified": true,
      "author": "John Cleveland",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Bargain price! I'm happy with them. Just remember to maintain it with some food grade mineral oil.",
      "text": "The premium cutting boards I was looking at cost as much as a good higher end Wustof knife, around $150, so until I complete my knife set I won't be replacing the two Bamboo boards I bought from Royal Craft Woods, they work fine for now. one caveat though, they could be a little thicker, I'd have paid a few more dollars each for a bit more weight, they're not light mind you, but the biggest difference I see between these and the $150 boards is more weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "If you live i a dry climate, don't buy this board.",
      "text": "It is well-made and very nice to work on, but I live in Arizona and after about 2 weeks the board started cracking along its seams. I had treated it with mineral oil as directed, but it still had done that. My suspicion is that the makers did not use kiln-dried wood. I still use the board - the splitting stopped - just have 3 hair-lined cracks in the board. But If you live in an area where the humidity regularly goes down to single digits, I'd stay away from this board.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark E Conley",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Good and durable",
      "text": "This board is just the right weight for my counter. It is durable and takes the oil well. I bought some food grade oil to use periodically on it and so far it is fine. My knives have continued to be sharp after using it several times to chop all sorts of veggies, fruit and meats. I only use the one side and flip over for cleaning only. I keep a towel under the board just to keep it in place. This is a good quality board.",
      "rating": 5.0,
      "verified": true,
      "author": "Candylady987",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "This style of board ...",
      "text": "has long, end to end horizontal grain which, which unlike a smooth board, catches everything in the shallow grooves which requires constant cleaning with a brush a process that may not bother the tidy types but I find it annoying, the constant maintenance. That aside, it is a good size and reasonably priced. Compared to other styles and sizes which are laughably expensive: It's wood guys, not ebony. The bamboo is an OK substitute just maintenance-centric.",
      "rating": 4.0,
      "verified": true,
      "author": "MTFenster",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Two Stars",
      "text": "I've only had it 2 months and it is already splintering. *Edit: After reading my review they sent me another one. That was very nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Tamara M.",
      "helpful_votes": 8,
      "publication_date": 20170604
    },
    {
      "title": "The best cutting board I have ever owned! I highly reccomend.",
      "text": "I have had the cutting board for a few months now. It is fantastic. I wash it with water and soap, rinse and dry it off, and it's back to perfection. The grooves around the side are a great addition to the cutting board. They catch the juice from whatever I am cutting. -Meat -Fruit Juice For sure, I will be buying more products from them. The drying rack is next. If you are looking for great handmade quality items, this is your last stop. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Preston M. Holder",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Good size",
      "text": "Remember 60 years ago when all homes had a wooden cutting board built into the kitchen cabinets? It just slid out from under the counter. No more. It was time to replace my old cracked board and this was the choice. We all know that wood makes the best cutting board. Plastic is a feeding ground for bacteria. This guy wasn't too big or too small. It's just the right size and thickness. (Yeah, I know how it sounds.) If your kitchen cabinets don't have a cutting board built in then this is a nice option.",
      "rating": 5.0,
      "verified": true,
      "author": "West Texas",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Great - but we use it for a different purpose",
      "text": "We have just moved to a 400 square foot tiny house where space is at a premium. Do we use the cutting board simply as an Additional working surface on top of the stove. 20 X14 is a perfect fit so much so we have ordered a second one for the other side. Real easy to lift it off when we want to use the burners. Love the idea of bamboo. We have traveled in SE Asia have never cease to be amazed how bamboo is used.",
      "rating": 5.0,
      "verified": true,
      "author": "UK2CA2SD",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Doesn't hold up well over time",
      "text": "Bought this in February because we wanted a larger Cutting Board. This cutting board really doesn't hold up well over time. You could tell this is poor quality because the cutting board is already showing cracks and the wood is rough and splintering. I guess this just shows that you get what you pay for... Will probably shell out a couple of extra bucks for a better board next time.",
      "rating": 2.0,
      "verified": true,
      "author": "Linda C",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Its just what I wanted",
      "text": "I purchased this board to use on Christmas. I prepared a standing rib roast and wanted a board that would keep the juices from the roast contained and not spilling over onto the counter, it worked perfectly. On top of that, its gorgeous looking and received many compliments from my dinner guests. I knew I had made the right choice when I opened the shipping container and saw how beautifully the board was wrapped. You have one more very happy customer. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "canness",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Great cutting board & a work of art, as well.",
      "text": "I owned a hardwood flooring company for 35 years. Made many a cutting board from spare materials. Installed quite a few bamboo floors as well...during my time in business. Bamboo is incredibly strong...but it is also visually pleasing. I've always liked to cook, and the sanitary qualities as well as the look of this cutting board fits my life style. Also have a bamboo salt box that matches this item nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Thompson",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Didn't Last Long Sadly",
      "text": "Developed cracks even with hand washing. I've had good luck with other Royal products in the past but this one just didn't live up to their reputation. It's a shame because the size and weight was perfect for my needs and it was very reasonably priced. Not sure I'll risk it by going with another Royal board for the replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr.Mike",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Excellent product",
      "text": "I was a little skeptical as to how the board would be at this price, given the size. I ordered it and had it in a couple of days and was extremely pleased at the quality. The joinery was flawless, no sharp edges and the finish was even and uniform. I've paid four times the cost for other boards that didn't have the uniform surface this one has. I'd recommend it to anyone, it's held up incredibly well despite some hard use. I've even put it in the dishwasher without a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Earl B Free",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "A Wonderful Cutting Board",
      "text": "This cutting board is just as described. It is sturdy and looks Beautiful. It does not have feet on the bottom. So, it will slide a bit, or in my case spin. I wanted to get rubber feet for it. Yes, you could get the kind that screws into the bottom. I..... was afraid the screws might go in too deep possibly cracking the board. I found some adhesive feet here on Amazon, and they work Great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chifan7",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Disappointing . . .",
      "text": "I bought this product in early December and have only used it a handful of times. It was stored properly and cared for per the instructions of the manufacturer. On the 5th time that I used this I was resting a flank steak and noticed a crack down the left middle of the board which caused the steak juices to seep through the bottom. I have included photos of the crack. This is an attractive cutting board and it is disappointing that it broke after only five uses.",
      "rating": 1.0,
      "verified": true,
      "author": "ME Esquer",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Great Product",
      "text": "I love my bamboo cutting board so much that when my grand daughter got married I wanted her to have one too. Hers is a newer version with handles so she can even use it as a serving tray or cheese board. Just rub a little coconut oil into it before use. So easy to clean then with mild dish soap and warm water. Do not put it in the dishwasher though.",
      "rating": 5.0,
      "verified": true,
      "author": "Tippy2",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Top Notch!",
      "text": "We purchased the Royal Wood Bamboo cutting board about 4 months ago and we're completely satisfied with this product. It's far better than the plastic cutting boards we've been using. Heavier, sturdier and doesn't slide around the counter when it's being used. The surface is easy to clean and resistant to anything we've used on it. And it's quite attractive. We've even used it as a serving tray and cheese board. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Meyers",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Great Quality Cutting Board!",
      "text": "Thank you Alex for creating such a amazing cutting board. So happy to support a single veteran father and even happier to support an American company! The cutting board is quite large and sturdy! I love the quality of the bamboo making it more easy to clean and durable! I highly recommend this product if you’re looking for a large bamboo cutting board!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda N",
      "helpful_votes": 2,
      "publication_date": 20200627
    },
    {
      "title": "One of best cutting boards I have bought!",
      "text": "I really love bamboo cutting boards, and this is definitely one of the best crafted ones I have bought. The size is perfect, it's easy to clean, and it's very sturdy. I recently found out it was made by a small family business, and that makes me feel even better about this purchase. I think most of us Amazon customers figure everything we buy from them is likely made in China, but actually many small businesses in the US market their products through Amazon. It would be better, of course, if they could market directly to us, but with so many, that would be a challenge.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne Logan",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Great quality product and seller.",
      "text": "With so many cutting boards out there to choose from it's hard to choose the right one. I am happy to say this cutting board has exceeded my expectations. I have been using it daily for about 3 months now and can tell this board was built to last. There isn't a single flaw, it has a smooth surface and is very easy to clean. These are made in America by hard-working Americans. This isn't the typical cheap Chinese knock off you will find all over Amazon. I expect this cutting board to last me for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Great value, reasonable sized board.",
      "text": "First, this is not a premium cutting board. That being said, for what it is, a budget, low cost, high value bamboo cutting board made in china, it does its job well. If you are looking for an heirloom, get a boos block. Aside from that, theres not much to say. Wash and wipe after every use, this will last a very long time. If you really want to stretch it, get some mineral oil and keep the wood treated every few weeks or so.",
      "rating": 5.0,
      "verified": true,
      "author": "S.N.",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Bowed and thinner than expected",
      "text": "This cutting board is ok, but it came slightly bowed and because of that it slides on my counter when you try to use it. Also, I should have payed attention to the thickness of this cutting board before purchasing it; for its size it seems thin and that in addition to the bow makes it feel and look cheap. I will continue to use it for now, but once I find one I like more this cutting board will definitely be donated.",
      "rating": 2.0,
      "verified": true,
      "author": "CEZ",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Good everyday board",
      "text": "I use this everyday, I load the dishes in the washer; then wash the board. I leave the board across the sink to dry while I clean the counter and stove. About once a week when it is clean and dry I oil it. I have had it about 3 months it sucks up more oil than I am used to, so far even though it is thinner than I am used to it has no warpage.",
      "rating": 5.0,
      "verified": true,
      "author": "DannyS",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Poor quality",
      "text": "Good for cutting fruits and vegetables, but not for heavy duty. I tried cutting meat and ended up cutting bamboo threads with very deep cut marks. Fancy but not strong. solid wood would be much better.",
      "rating": 2.0,
      "verified": true,
      "author": "Khob Raj Bhandari",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "I love this chopblock!!!!!",
      "text": "I love the color and appearance of thos chop block. I love it so much that I like it washed immediately and towel dry it so I can always look at it on my counter! I hope my husband will buy me a second one exactly the same!!! I want one for only bread sandwhich making and one for onions and vegetables. I have had it definitely over a month and still love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus Aurelius",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Wow!!!",
      "text": "It is not often that a product exceeds my expectations. This cutting board is one of the rare exceptions. It is so beautiful, I didn't want to use it but I do all my food prep on cutting boards and with this one, I can do all my veggies at the same time. I would buy this over and over again if I had to.",
      "rating": 5.0,
      "verified": true,
      "author": "Linneann",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "The best cutting boards you'll ever own.",
      "text": "You will need food grade oil to treat the bamboo once a month. I also purchased silicone square feet to put under the board on each corner. It slides on the counter. So much better and easy to clean as well. I keep them out on my counter. One is next to my sink and the other one next to my stove. I can't live without them. They are perfect for all your food prepping. You can clean then with wipes or in your sink with Dawn.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Divine Light",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Good size. Buy food grade mineral oil to treat it before use",
      "text": "Good cutting board and a good size. They request that you treat it with food grade mineral oil once a month. It would have been nice to receive a small bottle of mineral oil with the board. Or at least the company could have given it the first treatment before shopping.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Heavy duty",
      "text": "The product is great. I haven't used it too many times but so far so good. Treated it for the full week with the bamboo oil because every bamboo board I've had gets all splintered. I'm mostly leaving 5 stars for the letter that came in the mail to make sure I was satisfied with the product. Very kind words from the founder. I was a homeless veteran myself for a while. Definitely feels good seeing our kind making an honest buck.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "How Will it Hold Up?",
      "text": "We bought this cutting board to use as an insulator under a toaster oven which gets rather hot on the underside. It is a perfect fit to the profile of the oven, looks custom made. Immediately noticed the board looks well=made and is very nicely finished. Check back in a few weeks as we will try to add our comments regarding its heat resistance.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Schmotzer",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Excellent cutting board!",
      "text": "This cutting board was bought before the holidays and it has done double duty through Thanksgiving and Christmas meals and parties. Its extra large size is perfect for prepping and serving. Easy clean up with hot soap and water. I don’t put it in the dishwasher. Be sure an treat it with food grade mineral oil when you receive it and once a month after that. This cutting board will be a work horse in your kitchen for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary D.",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Splitting with this brand",
      "text": "Immediately returned still in package/shrink wrap because it was delivered with a split 6” from the edge inward. This should not have passed quality control. I’ll purchase a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Cy Lee",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Seams splitting with minimal use",
      "text": "I love the size and grooves but am disappointed in the quality. I have used this twice since purchasing in October. There are cracks developing between the layers on both sides, likely where segments were glued. I do not soak my cutting boards in water. I have a smaller bamboo board (from TJ Maxx) I've used for years with no splitting. Wish I could get my money back as this one appears defective and I've missed the return window.",
      "rating": 2.0,
      "verified": true,
      "author": "Holls",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Split after 3 uses",
      "text": "I cleaned it according to directions and I could see it splitting in 3 different places after just 3 uses. There are about 2\" pieces that are glued together or something. They started spreading apart.",
      "rating": 2.0,
      "verified": true,
      "author": "jbug",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Board warped on us",
      "text": "The cutting is of good quality bamboo and we like the drip groove the circles the entire board. What we don’t like is that the board warped after being washed several times. It was never left in water or placed in a dishwasher, but hand washed and dried. The other thing that would make it better would to have some type of rubber grips/legs on the back of it, as it is a one sided cutting board for the most part.",
      "rating": 3.0,
      "verified": true,
      "author": "MEW651",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "I love this board!!",
      "text": "This product is a quality piece of work. The price was fantastic and the size is perfect. I thought I would get a larger one, but I didn't see one I thought was worth buying. Turns out, this was the right choice. It's certainly made well enough for me. Use it, wash it, let it dry thoroughly, treat it with some food grade mineral oil, and you're in business. Thanks Alex for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Stone",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Warped?",
      "text": "Mine seems to have a slight bow as you can easily spin it on the kitchen counter. Easily corrected with a kitchen towel under the board but still annoying. Corners were dinged up on arrival.",
      "rating": 3.0,
      "verified": true,
      "author": "SL",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Splintered right after one use!",
      "text": "I bought this bamboo board last week and treated it with mineral oil as per the instructions. But inspite of that this board had splinters all over after one use! I can't risk these splinters in my food!! This is unacceptable. I'm returning this board asap.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Scratch resistant and lovely cutting board",
      "text": "This bamboo cutting board is easy to clean with water and a soapy sponge, and easy to maintain with the food-grade mineral oil recommended. Also the cut-outs on the sides allow for secure handling. To keep the board from slipping on the countertop it can be placed on a damp kitchen towel. Seems much sturdier than the plastic boards I had been using.",
      "rating": 5.0,
      "verified": true,
      "author": "Les",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "My go to board for my baking needs.",
      "text": "I wanted a new large size board for all my baking needs because I didn't want to have any cross contamination from my other cutting boards I use for meat or veggies. This board is perfect for kneading dough, any flour that gets pushed out falls in the grooved edge. Love it !!! Definitely buying from this vendor again when I need a new one.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan K. Aschoff",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Do NOT buy!",
      "text": "WARNING: DO NOT BUY THIS CUTTING BOARD! It is cheap and bamboo and seems like a safe gamble for the low price, but alas you will literally be throwing your money in the trash. It arrived with a small crack, but I only needed it as a holdover for a couple months so I kept it and gave it a shot. It couldn’t even last that long! Completely fell apart and the cracks in it led to mold on the bottom where water seeped down through them. Save yourself!",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "At age 77, this is the nicest cutting board I have ever owned.",
      "text": "At age 77, this is the nicest cutting board I have ever owned. A word of warning, however, from my own mistake: I pulled on an attached loose fiber; & although it looks like a minor crack part way across the top of the board, it is not. I am looking forward to enjoying decades of using it & every little knife scratch reminding me of all the family & friends I prepared for while using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191110
    },
    {
      "title": "Amazing customer service",
      "text": "Initial review: This cutting board is a piece of garbage. Don’t waste your money!! My board came unfinished with it splintering off on the back of the board as well as it still has dust and wood pieces on it from when it was sanded. Used once and will be going in the trash. Save your money! Update: amazing customer service! Immediately resent a new cutting board that looks to be much better quality than the first. Took off one star because of how it was shipped to me it arrived damaged.",
      "rating": 4.0,
      "verified": true,
      "author": "Caitlin Allyse",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Fits my needs perfectly!",
      "text": "Well crafted, sturdy, and very attractive. Serves my needs and is so convenient to use. It is out on the counter all the time and will surely satisfy my needs, as well as being a pleasure to use. The routed juice groove was a little rough but that was easily corrected, and I'm totally pleased",
      "rating": 5.0,
      "verified": true,
      "author": "C. Doughty",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Top Quality",
      "text": "The quality of this cutting board is outstanding! It is heavy and solid. The craftsmanship is very beautiful, especially after I cleaned and oiled it. I will definitely buy other boards (different sizes) from this product line. I'm certain that I will get many years of use out of this board.",
      "rating": 5.0,
      "verified": true,
      "author": "Norris N.",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "I Want A Picture Of The Homeless Kitten That Is Hugged",
      "text": "Great Cutting Board. Sturdy, good craftsmanship. That said, I am going to need a picture of the homeless kitten that was hugged as a result of my review. The e-mail which had helpful care advice said: \"We will thank you and even find a homeless kitten to feed and hug it on your belhalf! :)\" Pics or it didn't happen.",
      "rating": 5.0,
      "verified": true,
      "author": "KnifeCrisis",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Board warped a little so it rocks on counter. Annoying.",
      "text": "This is a nice board with a nice finish, good size. I treated it with the recommended stuff for bamboo. It was never immersed in water, only quickly washed by hand. I don't remember if it laid perfectly flat when I received - I think it did? But it has developed a small warp so that it always rocks on the counter when I'm using it. I find that annoying. SO hard to find good wood or bamboo boards. Guess one has to pay more for better.",
      "rating": 3.0,
      "verified": true,
      "author": "Claudia V.",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Sturdy and beautifully made cutting board",
      "text": "I was looking for a very large cutting board to cover my stove top and this beauty fits really well. It's durable and extremely well made. I have so much space to work. It was also a bargain at the price. I got many compliments when i used it has a cheese and bread board. I use it in some way every day. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "SRB",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great for the price!",
      "text": "This board looks much more expensive than it is. I was impressed by the quality. I also purchased mineral oil and apply it regularly to protect it. The more use and subsequent cleaning/oil the board gets the better it looks — honestly! I rinse it with warm and apply light dish soap if necessary, then let dry, apply an even coating of oil, and leave to sink in (overnight does the trick).",
      "rating": 5.0,
      "verified": true,
      "author": "Haley ",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Cracked already 😟",
      "text": "I received this cutting board on Saturday and by Wednesday I noticed a crack in it already! I would like to return it and get another one but it seems like they are currently unavailable right now so I don’t know what to do. I also ordered the same brand in their set of 3 and so far so good! They are beautiful and I am enjoying them.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian J. Smith",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Get a large cutting board it's worth it.",
      "text": "The board came in record time and is beautiful. I bought an expensive carving knife and wanted a wooden cutting board to preserve the cutting edge of my knife. Very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "tony bukauskas",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Large But Easy to Handle",
      "text": "I don't think of it as \"extra large.\" To me, it's just the right size for handling meat or cutting vegetables. The size and the groove (to stop liquid spread) make me more comfortable handling meat. The hardness makes me more comfortable that washing is thorough. The side \"handles\" are very helpful every time I pick it up, not just for serving. I'm not oiling it. Seems like it will already outlive me.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill A",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "It is a good buy",
      "text": "It’s hard to give a cutting board that is just plain a five star review. This cutting board is fine. You can cut things on it and it is fine. It cleans up OK, but I haven’t spilled anything like spaghetti sauce on it yet. It is actually not as thick as I thought it would be from the picture, but it’s not flimsy. I bought it because it fit over my sink and I could have more counter space. And it works really well for that.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacy McCay",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Cracked and could not return",
      "text": "Yesterday, when I used this Royal board for the second time, I realized it had four cracks along the whole length. I wanted to return it, since it is obviously defective or poorly made, but return window closed on May 31, 2020. Very disappointing...I spent a long time deciding which board to purchase and I am sorry I did not pay more attention to other reviewers that received cracked Royal cutting boards also. Be aware of this when considering purchasing this brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Dazzled!!!",
      "text": "Where do I start? At a perfect size of 12“ x 18“ this cutting board is not what we were used to but everything we didn’t know we needed! All around groove for catching juices, wooden handle depressions under each side makes it easy to lift off of the counter, cleans like a breeze and a beautiful light color that blends with everything in my kitchen! We highly recommend!!!👏🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200613
    }
  ],
  "product_meta": {
    "title": "EXTRA LARGE Organic Bamboo Cutting Board with Juice Groove - Kitchen Chopping Board for Meat (Butcher Block) Cheese and Vegetables | Anti Microbial Heavy Duty Serving Tray w/Handles - 18 x 12\"",
    "rating": 4.7,
    "feature_bullets": [
      "MONEY BACK GUARANTEE. We take pride in the quality of our Bamboo Cutting Board and this is why we back it with 100% Money-Back guarantee! Buy with confidence and enjoy an award winning design and its multifunction usage! If you are not absolutely thrilled at it, we will fully refund you, NO QUESTIONS ASKED!",
      "EXTRA LARGE with SIDE HANDLES to use it as Cutting-Chopping-Cheese Board or Serving Tray.",
      "PROFESSIONAL GRADE, KNIFE FRIENDLY: Bamboo won't cause excessive wear and tear to cutlery.",
      "BUILT-IN DRIP GROOVE holds juice from meat, fruits or vegetables.",
      "100% ORGANIC BAMBOO is All-Natural, pest and bacteria-resistant, absorbs less liquid and has fewer cross-contamination concerns."
    ],
    "specifications": {
      "Product Dimensions": "17.95 x 12 x 0.75 inches",
      "Item Weight": "3.2 pounds",
      "Manufacturer": "ROYAL CRAFT WOOD",
      "ASIN": "B01MU0C1F5",
      "Item model number": "FBA_RCW-1010",
      "Customer Reviews": "4.7 out of 5 stars9,991 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#40 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 13, 2016"
    },
    "categories": [
      "Home & Kitchen",
      "Cutting Boards",
      "Cutlery & Knife Accessories",
      "Kitchen & Dining"
    ],
    "price": 19.97
  }
}