{
  "website_summaries": [
    {
      "verdict": "While it lacks the quality of higher-end options, this action camera has some nice extras and a low price that budget-minded shoppers can appreciate.",
      "pros": [
        "Very affordable, yet has capabilities of more expensive brands including WiFi, wide-angle lens, and waterproof construction",
        "Comes with mounting accessories and gets decent battery life",
        "A good choice for travelers who don't want to risk losing costly equipment"
      ],
      "cons": [
        "Controls are somewhat confusing, and the instructions that come with it lack detail",
        "Although supposedly 4K, there is a grainy quality to some images it produces"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Surprisingly affordable when you consider the range of creative shooting modes, premium-resolution video, and handy mounting accessories included with this rugged little time-lapse camera.",
      "pros": [
        "4K video resolution and 16-megapixel camera",
        "Features time-lapse, loop recording, and slow-motion modes",
        "Waterproof case",
        "WiFi connectivity",
        "Includes pair of batteries, with 90 minutes of playtime each",
        "Wide 170° lens"
      ],
      "cons": [
        "We are a little taken aback that this otherwise great time-lapse camera does not have a touchscreen for fine-tune control"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This came with a waterproof housing that worked REALLY great.",
      "text": "I wanted an inexpensive camera to videotape snorkeling in Maui. This came with a waterproof housing that worked REALLY great. It had lots of other attachments, but I ended up putting the camera on a small hand-grip monopod that would float if I let go. The camera is small, so it's hard to hold steady, but the 60fps ended up smoothing it out. I thought it worked great! Excellent product for the $$. There are some technical problems bringing it into Final Cut Pro, but there is an easy work around. Just right-click the file and chose the \"encode selected video file.\" I tried to get a good upload that reflected the camera's quality. It really is quite impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Smith",
      "helpful_votes": 880,
      "publication_date": 20170927
    },
    {
      "title": "Great Action Camera at an Unbelievable Price",
      "text": "Great camera that shoots high quality video. I just recently took a trip to Maui and used the camera for all of my underwater video, I was very surprised by the quality of video the camera took. I highly recommend to anyone who doesn't want to spend $300+ on a Go...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 219,
      "publication_date": 20170807
    },
    {
      "title": "Significantly better than expected.",
      "text": "Huge value for the money. At 1/5th the cost of a comparable GoPro 4 Silver referb, the quality is WAY better than 1/5th of the GP. I chose this camera to let my daughter use on dives, thinking even if it breaks or gets lost, no big deal. However, after first uses, I would make this choice again and again. Attached a sample video of a dive last Friday with the ACT74. The footage is not enhanced in any way, shot at 1080/60fps, and displayed 50% speed, lit with a 400lm torch. Two dives filmed, almost an hour under at depth (max 50'+). Single battery used with change remaining. No leaks.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron Wilson",
      "helpful_votes": 58,
      "publication_date": 20170417
    },
    {
      "title": "WACK",
      "text": "camera functioned for a total of 3 days, never even opened the packaging on the accessories and the camera malfunctions on me now. It will not show a picture and I only did 2 timelapse with it before it stopped working. I have bought two and am very dissapointed",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 39,
      "publication_date": 20170622
    },
    {
      "title": "A good cam for a great price.",
      "text": "I've seen a couple bad reviews about the quality of this cam but after bought it I actually realized it's a a great cam and has a good quality. Affordable price, great quality and easy to handle. Definitely I'd recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Johan",
      "helpful_votes": 15,
      "publication_date": 20190107
    },
    {
      "title": "Great Camera for an Enthusiast",
      "text": "This is a wonderful camera for the value. To date I have taken the camera out on several expeditions in below freezing weather to develop time lapse video of sunsets after snowfall with pleasant results. I tend to \"play\" with cameras, which has enabled me to gather a lot of experience with their qualities. The flip-side of that, I am not a professional - I am an enthusiast. With that in mind, and if you are also an enthusiast then this is a great camera to purchase. My only wish is that the camera would be capable of capturing a wider range of EV values. P.S. The temp during the time lapse included here was in the low 20's F",
      "rating": 4.0,
      "verified": true,
      "author": "AmzCustmr",
      "helpful_votes": 96,
      "publication_date": 20170119
    },
    {
      "title": "Update! UPDATE!",
      "text": "☆UPDATE☆ Dec. 26, 2019 Seller did NOT send a replacement nor did I receive a refund. Seller stopped responding. I highly recommend NOT buying this! ☆UPDATE☆ May 15, 2019 Seller contacted me, offered replacement. I will let you know when and if I receive replacement. *STAY TUNED* bought this about a month before we were going on our Hawaiian Dream Vacation...At first, it was wonderful until it popped open under water and ruined everything! - We used it on 2 separate snorkeling days - the camera case just popped open right when the big turtle swam by us...all pictures ruined, memory card, battery etc - I do NOT recommend!",
      "rating": 1.0,
      "verified": true,
      "author": "NEPA",
      "helpful_votes": 16,
      "publication_date": 20190316
    },
    {
      "title": "Frustrating Experience",
      "text": "So maybe I should've looked into the Cam a little more before taking it on our honeymoon. Does not come with internal memory, so you have to buy an SD card right out the gate. Barely holds a charge. We both became so frustrated with it that we didn't even use it in Hawaii. Did I just get a defective one? I never give 1 Star reviews, but I am fairly tech literate and I found this Cam to be useless. Very disappointed in this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "oceanic926",
      "helpful_votes": 8,
      "publication_date": 20190111
    },
    {
      "title": "Avoid this camera, people are compensated for good reviews",
      "text": "This camera has a flier in it that states if you give a positive review they'll give you free accessories. I bought this camera as a helmet cam for a 30-minute commute. It only ever actually saved the first two minutes of video, and the rest of the time was only audio. The \"video\" ended at around 2:30, but the audio kept playing for the rest of the time the video should have been recorded, with the last frame playing constantly in VLC (in Windows AND linux, to be sure) and Windows Media Player. AVOID this camera, it's a piece of crap and a scam.",
      "rating": 1.0,
      "verified": true,
      "author": "knock",
      "helpful_votes": 6,
      "publication_date": 20190626
    },
    {
      "title": "What a great Bang for the Buck",
      "text": "We bought this camera for our Disney Cruise. I had read reviews and chose this one since the kids would be using it as well. What a great Bang for the Buck!! Easy to use and it kept its charge all day. We got great footage of our trip and I loved how we could switch modes very quickly. I could not imagine any better quality even with a go pro-plus-if I lost it- no big deal. This camera took GREAT pictures and video and we have our memories preserved! THANK YOU! EXCELLENT BUY! You cannot NOT go wrong for the price. I am glad we chose this camera! Everything we expected and MORE!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark R. Griffin",
      "helpful_votes": 45,
      "publication_date": 20170409
    },
    {
      "title": "Scam for high review ratings and horrible audio quality.",
      "text": "The the cameras sound quality was completely useless. We purchased it to ride motorcycles and record as we were I'd doing racing and trackday events. The vibration noise from the camera is so bad you can't even hear the engines revving during high RPMs. Also if you're looking to buy this camera know that the reason why they have so many reviews is because they offer you free gifts with a review and you must send a copy of the review to them. That to me is a scam because they are not true and honest reviews. To me this is not a practice Amazon should allow",
      "rating": 1.0,
      "verified": true,
      "author": "jamoncito37",
      "helpful_votes": 23,
      "publication_date": 20180820
    },
    {
      "title": "DON'T BUY IT! IT'S JUNK!",
      "text": "Don't believe all the good reviews of this product. The good reviews are bought. They offer you free products when you submit your review. That being said, The battery life is horrible. If you leave the battery in the camera (even with it powered off) it drains it. The functionality of the camera is not good. The clip closing the waterproof case broke and I only had the camera a short time. It also corrupted the SD card and made it unusable anywhere else. And yes I bought the proper SD card. I was also disappointed with the image quality. I returned the one I purcased. I hope you make the right decision by not buying this lousy camera!",
      "rating": 1.0,
      "verified": true,
      "author": "Josh McC.",
      "helpful_votes": 3,
      "publication_date": 20191015
    },
    {
      "title": "Secure it twice, camera fell right off the helmet clip.",
      "text": "The camera fell right off the clip. So here’s a picture of the clip with no camera on it. The camera is in the lake. I’d change the rating if Campark would replace the camera. Kinda ripped about this. Had about 1 hr of video of the kids on the tube, gone... can’t speak to the video or audio quality because I didn’t have the camera long enough to pull the video off...",
      "rating": 1.0,
      "verified": true,
      "author": "VeritasX",
      "helpful_votes": 7,
      "publication_date": 20180622
    },
    {
      "title": "2020 Update version still supports WebCam mode",
      "text": "I just purchased and received 2 units -- I'm happy to report that the '2020 Update' version of the camera still supports use as a USB WebCam. While it can output 1920x1080, the frame rate drops to about 1 fps, however 1280x720 mode produces about 30fps. Very usable in OBS Studio or your video conference software of choice. ( Note the camera does not come with the right angle cable in the picture -- it's ASIN B001AR4NC8 )",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Kidd",
      "helpful_votes": 2,
      "publication_date": 20200922
    },
    {
      "title": "Great camera. OK case Great deal for the money!",
      "text": "Overall the camera has been a blast to use. I took it whitewater rafting and used it inside of a CNC milling machine. However, the waterproof case that came with it cracked and the hinge broke with minimal use and no impacts. Good quality video recording. Certainly different than a GoPro in the menus and such but for what I paid it's GREAT! 4 Star instead of 5 simply because it is a little funky to figure out the instructions and the waterproof case it came with didn't hold up very well but really a great buy for the money!",
      "rating": 4.0,
      "verified": true,
      "author": "LexKY",
      "helpful_votes": 6,
      "publication_date": 20170807
    },
    {
      "title": "Disappointment",
      "text": "There is absolutely no way this is 4k or 16mp. It's not even 1080 quality! My cell phone takes better photo and video. I've been thru all the settings and it doesn't help. Also the sound is muffled and the picture is dark even with good lighting and using the led. So long story short, if you want to be disappointed this is the camera for you",
      "rating": 1.0,
      "verified": true,
      "author": "TSparkles",
      "helpful_votes": 5,
      "publication_date": 20180802
    },
    {
      "title": "Pretty good for so cheap, but no 4k",
      "text": "Right on the front of the camera it says \"UHD 4K\" which is funny since there's no such option. Whatever, this thing shoots decent 1080p video and is watertight. For $50 what do you expect... It came with a small assortment of mounts and a soft carry case. We used it on our trip to obx and it survived the ocean and the pool. It did allow a tiny bit of moisture in after an hour being tossed around the pool by kids but no damage. I bought it for my 7yo son and it's lasted over a month of abuse so I'd call it reliable.",
      "rating": 3.0,
      "verified": true,
      "author": "balconio",
      "helpful_votes": 6,
      "publication_date": 20170710
    },
    {
      "title": "Pretttttttty, pretttttttttty, pretttttty good! (Larry David Voice)",
      "text": "Honestly I wanted something cheap, I wasn’t expecting the great quality that this CamPark came with. The waterproof feature is nice with clear quality. It’s stable enough for dirt bike trail rides. I have no complaints at all. when the wifi is connected to transfer videos to the phone or etc it will take some time, However i figured out another solution which works for me. Also the accessories that it came with is amazing. I highly recommend buying this CamPark if your buying on a budget and want great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Excellent for snorkeling, etc.",
      "text": "This is the second one of these I have bought. I bought one last year for my daughter to use while scuba diving in Mexico and she absolutely loved it. She said this was her main camera during that trip and the video and photos she took are excellent. We are going to Mexico this summer, so I bought one for myself and have already used it for still photos as well as video while I ride my motorcycle. It's a great little camera, easy to use, and comes with a spare battery. Video and picture quality are much better than my older-model GoPro at a fraction of the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy J. Allred",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Excellent value at a quarter of the GoPro’s price!",
      "text": "In full disclosure I will be receiving an accessory in return for writing this review. I paid full price for the camera and am under no obligation to do a favorable review. This camera is however a great buy at $55. The GoPro camera goes for almost five times this price. The camera kit includes many accessories at no charge. The camera case is not ruggedized however so it won’t survive severe abuse. You can still buy four of these cameras and it will still be cheaper than a GoPro. With four cameras you can do a multi-camera video with the proper video editting software.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 2,
      "publication_date": 20180605
    },
    {
      "title": "Low budget action camera",
      "text": "Very cost effective way to introduce yourself to the world of action cameras. That being the case the lie of being 4k and very low sound quality make this a poor introduction at that. My over ten year old Casio SX20 has better sound quality and video quality at 720p then this supposed 1080p camera that says its 4k. The app that allows remote control of this camera requires my android phone to be placed on airplane mode and a few other steps in order to get any usable frame rate from the camera to the phone. All these issues aside there is a lot of stuff put in this small camera for the money.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarge104",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "I'm looking forward to giving this a lot of use!",
      "text": "I picked this up because I'm about to go cave spelunking for the first time on a trip where I don't trust taking my phone or DSLR cameras. This however comes with a waterproof case (there will be underground streams to cross) which will protect it. With over 8000 reviews and a 4.3* rating as well as a ton of customer images, I feel confident that for the incredible price, this will be money well spent. The camera comes with nearly every accessory you can imagine (although I did buy a strap to attach it to the helmet I'll be using). I'll come back after my cave trip to post some sample images from this excursion!",
      "rating": 5.0,
      "verified": true,
      "author": "CompuChip",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "I bought this because it had so many good reviews, but I feel its not a very ...",
      "text": "I bought this because it had so many good reviews, but I feel its not a very good representative of what the product is. Don't get me wrong, I do think that it is not a good product for the price, but it just didn't fulfill my needs very well. To simply put it, it doesn't record sound very well. This was one the most important thing to me when I bought the camera. When you play the video, all you can hear is static sound and this is the same when I talk right in front of the camera. If you don't need to record sound, this is very good. If not, it's not.",
      "rating": 1.0,
      "verified": true,
      "author": "Review",
      "helpful_votes": 6,
      "publication_date": 20180113
    },
    {
      "title": "image quality is very poor",
      "text": "This is a cool little camera, (It's tiny!) and I really wanted to like it. The accessories are great, and I imagine it's perfect for bicyclists or protesters who want to have video documentation in case of wrecks or confrontations with police. The quality of video is adequate for that, and the waterproof enclosure is A+++. BUT---if you are wanting even a remotely decent quality video for something you'll be showing to other people (recording presentations for class/work, family photos and videos, etc.) look elsewhere. The color and sharpness are all way off, and it just looks really bad. I returned this thing immediately because it just won't do what I bought it for.",
      "rating": 2.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "A good camera at a great price-point..!",
      "text": "It IS a tiny lil' thing..! I still own my first video cam-corder, a VHS-HQ, and it is HUGE in comparison. The digital image of this ACT-74 is sharp as a tack. Two things I have noticed, though... the intensity of the colors is not anywhere near maximum levels, leaving everything looking a bit washed out. And the battery cover is a separate piece. That's about it for the negative side. I love the ease with which one operates this little marvel, and the wealth of accessories are all of very high quality. A water-proof case included for free..! Battery life is great, many functions, ease of selection thru the menu... All Great Stuff..!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Jakusz",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Go with something better.",
      "text": "This camera is awful. Battery doesn’t last long at all. I just commute 12 minutes to work on a motorcycle and it’s dead after a round trip. SD card (one recommended) would format properly, the camera app didn’t work, ease of use is zero and the sound? Oh, my. And definitely at night it looks even worse. I don’t see why they would market this for people as people do events during the day AND night.",
      "rating": 1.0,
      "verified": true,
      "author": "Terry Huud",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Small and Easy to Travel With",
      "text": "This is a really neat camera, very small in size so it's perfect for traveling with. I really didn't need any of the mounts. I took the sticker that had the \"pull here\" tab off of one of the batteries and the battery case fell apart, I'm not sure if it was a bad battery or if part of the sticker was supposed to stay on. If the latter, they should probably write a note not to remove the stickers. Otherwise, I'm really happy with the camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Darcy H",
      "helpful_votes": 2,
      "publication_date": 20180720
    },
    {
      "title": "Outstanding Action Camera for low price",
      "text": "Perfect for using while kayak fishing to capture video. Comes with so many attachments for such a low price including head mount, helmet etc. I did purchase a higher cost action camera head mount which is thicker with more secure mount. GREAT true color video capture including the water color, sky and clouds and the spartina grass true color in the salt marsh. I have had go pro and garmin virb NOT last in the past and I simply won't invest that type money again. This camera is FANTASTIC. 40 minute battery life and comes with two batteries. Easy to charge and read display.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Grant",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "HORRENDOUS CAMERA Resolution",
      "text": "This camera advertises 4k at 30fps but its sensor has been manipulated in such a way to tell the file that it's compressed as a 4k video but really it's barely at 480. GARBAGE resolution and misleading. Can't believe that Amazon even promotes such misleading products. The battery utilization is good but that's probably because it's an inferior processor. I even tried inserting a class 4 sd card knowing that 4k resolution cameras cannot write to anything less than class 10. This camera recorded to my class 4 sd card which further exposed how fake this garbage is.",
      "rating": 1.0,
      "verified": true,
      "author": "Haris Musanovic",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Huge quality for a small price!",
      "text": "Oh my goodness! I first thought, \"What a cute little camera. \" But then I opened the box and experienced the quality of the camera and all the useful attachments. No need to purchase a bunch of attachments to use the camera in different settings. They thought to include everything you could possibly need for every situation or setting. I am so excited!! I love the mobility and the WIFI to iPhone applications. I do bridal alterations and plan to film and upload training sessions to youtube for others to learn from for free. Thank you for such an affordale and high quality Action Camera!",
      "rating": 5.0,
      "verified": true,
      "author": "KAM",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Great value for an action cam",
      "text": "Very pleasantly surprised with this action cam for the money. Top notch, small, waterproof and easy to operate once you get the short learning curve down. I have a few of these models with all the attachments and use them on the bike and hiking to get stills and video from different angles simultaneously. Love the wrist band remote for instant control. For the price of one name brand cam I’m able to have an awesome multi-cam setup. Looking forward to adding maybe another along with some more mounting accessories As I build my mini mobil studio.",
      "rating": 5.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "I guess I just got a bad one. Good luck",
      "text": "I bought this product in late May 2017. I only used it 3 or 4 times. It appeared to be everything I was looking for, then it just stopped working. It won't charge or turn on with charging cable. I tried a new cable, new batteries and a different computer. The companies website is not of any use. I guess I just got a bad one. Good luck, I hope you have more success than I did.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170829
    },
    {
      "title": "Great for the Price",
      "text": "This is a great little camera-for the price. If your looking for HD quality then 50.00 is not the range you want to be in. For the price, I think this camera is perfect for someone looking to do time lapse or use it on occasion. The images are good, but the good photos require a good amount of light to be sharp. The darker the subject, the more grainey the photo is. I still give it 5 stars based on the fact its a 50.00 camera, and the the camera performs like a 100.00 one. If you want to record life-long memories you can watch 10 yrs from now, get a Go-Pro..",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Frey",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Lightweight and mini design.",
      "text": "So whenever you are using this camera for car videos like the way I do they showed up great after recording a few videos. But then it starts to show up grainy and the files are corrupted when uploaded. Fits great to the headband attachment as well as fitment to a suction mount for car videos just can't continue using and so it's going to get 3* for that. It's compact design is amazing and lightweight just not the quality of video whenever uploaded.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Sound does not line up",
      "text": "I bought this based on the reviews as well as an article I had found. I thought I would give it a shot to see how well it worked. Unfortunately I did not get the chance to try this out until after the return period had expired because I would have returned it. I tried several different micro sd cards and no matter what setting I used in the camera, the sound never match the video. I guess you get what you pay for. I think there are so many reviews for this item because they will send you free stuff if you leave a review and let them know. Very deceitful practice that Amazon should not allow to happen.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian Appell",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Better than expected.",
      "text": "This camera seems pretty good for the money. It came with a TON of different mounts for various purposes. Waterproof cases tested in bathtub and doesn’t leak. App (iPhone) is pretty basic but syncs easy enough and lets you perform all the basic settings and functions. Wish there was an option to save footage to your phone via the app for editing. Haven’t tested extensively but have a trip to Mexico planned in a few months and will update with battery life and video quality. But so far so good. Comes with 2 batteries too which is nice.",
      "rating": 4.0,
      "verified": true,
      "author": "FergyMcFerguson",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "OK camera, Useless instructions",
      "text": "3 stars because of the horrible app and useless instructions. For instance WTF does \"stir downward the battery cover\" even mean? There is more interesting and indecipherable Chinglish but thats the one I found the silliest. Camera seems to be decent once you get it rolling. It is kinda lane that it does not automatically become available on the WIFI on power up and you have to go the whole setup every time. Anyway fair camera sucky app mostly. I just use the camera stand alone then pop the SD card into my laptop to grab the video. I might of gone 4 stars if the manual was even remotely useful to an English speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom W",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Great Value!",
      "text": "I just bought this thinking it would be a stripped down \"good enough\" model. My requirements were minimal. I wanted a remote mic plug, and I wanted 1080p. Well, for $45 delivered I got 4K, remote MIC, full phone wifi support, built in view screen, and a box of probably 30 accessories including every kind of attachment mount you could want, plus a waterproof case, extra battery, a wireless remote control for my steering wheel or wrist, and a remote mic. Not only that, it actually works, and flawlessly too. I'm impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Byron",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "External microphone works!!!",
      "text": "Just got the updated version with an external microphone input yesterday. The microphone has mono 3.5mm jack (see my pic), not like some usb connection shown in the product photo. The build seems to be ok, lighter but sturdier than the other generic brand. The audio is snappier and crispier with microphone in the recording. One downside that I did not notice when purchase is the lens angle is fixed at 170°, no big deal since that’s the setting I will be using anyways. I will update with more review after a full test.",
      "rating": 4.0,
      "verified": true,
      "author": "SMH",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Small and powerful for any activities",
      "text": "This is a great action camera for the price. I've used it during the fishing and biking and was very happy with the video quality. It comes with every action accessories you could ever needed. In addition I use camera as a dashcam while driving my car and taking it with me using it as a body/spy camera. I started love my camera even more when I realized that I could use 128 Gb SD card instead of 32Gb as was advertised. So great little device!!! Friend of mine bought same camera and he’s so happy with it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Cheap garbage",
      "text": "You get what you pay for, do not buy this cheap garbage. We were getting a memory card error when trying to take a picture. Sent an email to customer service and they were not helpful at all to resolve the issue. Comes with a bunch of adapters and none of them have descriptions as far as what they can be used for. They say that if you write a review you'll get something for free in the instruction sheet. Sounds like bribery to me. Returned for a refund and we will buy an actual name brand camera.",
      "rating": 1.0,
      "verified": true,
      "author": "laurel",
      "helpful_votes": 4,
      "publication_date": 20180331
    },
    {
      "title": "Customer Service was excellent",
      "text": "Was a gift for my daughter. This is not a waterproof camera. It’s a camera in some cheap plastic. The moment it went into the water, the plastic leaked and the camera was destroyed. Complete waste of money. If you buy this, get some tape or something to ensure that the plastic stays connected. Update- (11.5.18) customer service contacted me. Apologized for the issue. Sent me a new camera at no cost. We’ve tested this one (albeit in the tub at home, but still submerged) and it did not fill with water. Very much appreciate the good customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Tenny",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Bang for buck",
      "text": "Bought this for a trip to the Galápagos. It’s a little tricky to get the camera out of the water case but if you just wiggle it it comes out fine. The instructions are a little confusing but the camera itself is easy enough to figure out. When I stuck the SD card in it didn’t click like other SD cards do when inserting and I can’t get it out. I’m not sure if everyone’s camera is like this. There are more settings on the app then the actual camera. It comes with multiple accessories such as a helmet mount or belt mount. Image quality seems pretty good and I’m excited to use it on my trip.",
      "rating": 4.0,
      "verified": true,
      "author": "JeniOli",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Great for a kid!!",
      "text": "We purchased this camera for our son as an Easter gift. He has been asking for a camera of his own for quite some time. This was beyond his expectations. He has played with it every single day since he got it. It comes with a ton of attachments. Also has slow motion which every kid would enjoy. We do have the name brand one of these cameras and I could not justify paying the price for that specific one to give to a seven year old. I have attached a video that he took of his friends playing on Easter weekend.",
      "rating": 5.0,
      "verified": true,
      "author": "dakota andersen",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Great for personal (amateur) pics and vids",
      "text": "Cant be beat for the $. Comes with accessories and 2 batteries. Used mostly at the local race track and didnt want to spend GoPro prices since it would eventually get destroyed or run over. Not bad at picture taking either. This is the first video and pics taken with this camera. 720p 30fps wide angle. Anything more than 2x zoom is grainy. Seems ok in low light. The wifi connection to an iPhone is jittery and drops frames so I only use it if the camera is mounted on something and I cant physically hit record button.",
      "rating": 4.0,
      "verified": true,
      "author": "Richie R.",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Happily Suggest this buy",
      "text": "Fantastic product. I think the picture quality (without having to use the software) is better than my Gopro! I can buy several of these at this price vs the gopro. Simple operation, and the assorted extras have nearly everything I need all in one kit. The travel bag is even of better quality than I expected. Battery time is good (at my quality settings/max) a little over an hour. Since I have two batteries with the kit, I am covered time wise for my usual excursions. Mic is good, but muffled with the waterproof case of course. I think I will buy more batteries, but not sure where to get them yet.",
      "rating": 5.0,
      "verified": true,
      "author": "All the Good Names are taken!",
      "helpful_votes": 2,
      "publication_date": 20170712
    },
    {
      "title": "Better then expected",
      "text": "I bought this because of the price and the reviews. I knew not to expect it to feel like a gopro but I was worried that it was going to feel \"cheap\". The water proof case feels solid with spring backed buttons to help prevent them from sticking after pressing them down. it came with alot of extras that I was not expecting, such as a helmet mount, a wrist mount and two batteries to name a few. the camera it self has a plastic housing (it is under$100 after all) but feels solid. I bought this to use on a vacation and will update review if picture quality is not as expected or if there are any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "mrobb",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Ok value, mediocre quality, merchant tries to buy 5 star reviews",
      "text": "Updated. There is absolutely zero stability when filming at low vibration and 4K video appears less than 720p. I have only had this for a short amount of time but if this does half of what it says, it's worth the price (it does less than half). On the plus side, it Came with more mounting hardware than expected and even a waterproof case and 2 batteries. Easy setup and simple controls. App for phone is ok. Not the greatest since it works on wifi connection. Wish it was bluetooth but that's liveable. Side note, be prepared to be bribed for a high review score.",
      "rating": 1.0,
      "verified": true,
      "author": "JohnsonRod",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Top latch to keep it closed underwater is too flimsy and instructions inadequate",
      "text": "Top latch to keep it closed underwater is too flimsy. That latch needs a redesign so the flimsy piece of metal and screw don't come apart. The instruction manual is also missing the most important point: Do not detach the top black metal latch on the underwater housing. Because you will never get it back on and the housing will be useless. See point 1 above. BTW you can't buy the housing part, even as part of a collection. You have to buy the camera too. That's not good.",
      "rating": 2.0,
      "verified": true,
      "author": "ynot",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Seems like a nice camera for the money",
      "text": "I was looking for an inexpensive action camera to take pics & videos while out hiking and snorkeling in places that I don’t want to bring my nice Nikon Z6 DSLR camera. This seems to fit the bill nicely. The app is NOT intuitive to set up, but there is a featured review on here that lists steps to get it working and the steps work perfectly! (Thanks to the posting reviewer!). I haven’t fully tested all the features or battery life, but my initial impression is that it will be great for what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Singn4joy",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Buy with confidence",
      "text": "Got this to wear on my helmet when I ride my motorcycle. It doesn't last (battery), corrupts perfectly good memory cards (ruined my bran new 32gb samsung micro sd) and just all around doesn't work well. I wasted $50 on this. Don't make the same mistake. **Update 2-20-19*** contacted me with some trouble shooting, offered a 75% refund. I will update again after the refund is complete. At least if you buy, you know they stand behind it. Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Fiona",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Good Camera",
      "text": "Seems like a good camera for the price. We will be going to Hawaii soon, where I'll truly be able to test it out underwater, but so far so good. It was hard opening up the battery case for the first time, I was afraid I was going to break it, but once I did everything was fairly easy to figure out. The manual wasn't helpful as it told me to \"stir downward the battery cover\". Obviously a translation error, so you can't rely to much on the manual to help you out. It takes some trial an error. That aside it's a nice camera for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "SHeben",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Great camera",
      "text": "Good 4k camera at the price. Got housing kit, checked seals for debris. Dropped it in pool and got hit with cheep super sokers. No water entered the case. Worked great on Android and ios. the mannal was hard to read QR code for the ios. The 4k video worked great on camera. Could view or edit on current A8 pc and iPad air 2 and other equipment. Will update devices. 2.9k will be current video for now. Battery works for hour and a half or you milage do to high heat and humidity. Bought there battery charger and batteries for day shooting. Does 16 mega pixels Photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 3,
      "publication_date": 20170725
    },
    {
      "title": "great value",
      "text": "i don't know why anyone would pay so much more $$$ for a GoPro, when this is just as good. especially if you think about what it's meant for: action/adventure/water shots. which means, high risk of getting abused, broken, and lost. i'm sure GoPro offers warranties and whatnot, but there's no warranty for losing a GoPro in the water or if it gets stolen. it comes with a ton of attachments and accessories (all compatible with GoPro devices). so far, has been great and glad didn't buy a $450 device.",
      "rating": 5.0,
      "verified": true,
      "author": "mwc",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "The video quality is good for our purposes",
      "text": "We received an action-cam dog harness for Christmas, but we didn't have an action camera. So I bought this one. It's simple. The video quality is good for our purposes, which is to simply capture fun moments on the go. We've only had this for about a week but so far it's worked smoothly. Other reviewers mentioned that this isn't compatible with a Mac. I'm perplexed because the .mov files appear just fine on my MacBook. Overall, the quality does feel a bit like a toy. I can't imagine people taking professional, cinematic style films with this camera. But for the price point and for the purpose this is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Wang",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Great quality",
      "text": "I ordered this because we are going to Jamaica in 25 days for a WeddingMoon. I didn't want to pay hundred$ for something we will likely rarely use. The box was jam packed full of accessories. I opened everything, flipped thru the manual and the set up was straight forward and easy. I am shocked with the quality of the camera and the clear casing. It feels high quality. I plan to use this snorkeling and scuba diving & cannot wait to update with photos and videos! My fiance is also planning to attach to his motorcycle this summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Bennett",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Great video, sound quality is not there though.",
      "text": "The video quality is excellent, and it came with a handful of great accessories. Those are the pros. A minor con is that the build quality is very cheap feeling, but that's not a big deal. The major con for me, which lead me to return the item, was the sound quality. It was extremely muffled and sounded like it was in a hollow box. As an action camera that doesn't need a lot of sound, this is a great purchase. But for making videos where sound is pretty important, I would suggest another camera.",
      "rating": 3.0,
      "verified": true,
      "author": "Dina Pip",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "High quality picture.",
      "text": "Received my camera on Tuesday, was so excited to test it out On Saturday. I was not disappointed. The video quality is excellent. It has 4k, but I only used the 1080 and was still very impressed. The case if well made and all the additional accessories was a bonus. The mounts provided work well and I had no issues especially with all the jumps on the trail. After I was done, It was easy to connect to my phone via WiFi and the app to view. I may buy another one to give as a gift. For the price it is a great but.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Cardenas",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "GET THIS CAMERA.",
      "text": "Hi! I just wanted to write a review on this AMAZING camera. I am a 11 year old girl, who plays soccer,skis,bikes, and my grandmother has a pool, therefore it's really cool to take videos\\photos of everything. My grandmother got this for me to take pictures of swimming in her pool. I LOVE a swimming videotaping and watching them when I'm bored. If you are looking to get this for a kid, a teen, and a adult, I recommend this camera 100%. (I took a picture of my grandma with the camera below)",
      "rating": 5.0,
      "verified": true,
      "author": "DZ",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Great Camera for the price!",
      "text": "I needed an underwater camera for a snorkeling trip I was going on and did not want to spend too much. This camera is amazing for the price I paid. Very simple to use and figure out. The pictures came out better than I anticipated and the quality of video is really great too. I am so happy with the purchase and would definetly recommend this camera to anyone who is looking for one. I will absoulutly be using this more than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Brilliant piece of kit!",
      "text": "This is NOT a paid review! I ordered another kit nearly like this and couldn’t get support. However, CAMPARK kit was just brilliant right out of the box! Great assortment of mounts, including bike, dash, and a great hat/pocket/ belt clip. 2 backs, 2 batteries, and tiny zip-ties like they know exactly what I’m after! Micro SD self formats. This is some serious bang for the buck AND I don’t ever want my face on 4K (you can see EVERYTHING) I’m incredibly picky about my electronics, and I must say, I’m quite chuffed with this wee camera, hopefully my YouTube followers will love it as well! Kudos guys for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharlene M. Mccoy",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "For the price this thing is actually really good",
      "text": "Great camera for the price. They shouldn't state this thing takes 4k video however because it really can't handle 4k. 2.7k ( the next option down ) works just fine however and looks better then my old 1080p sony action cam This camera falls short in 2 major areas however. 1) Battery life. It's absolutely horrible. the battery dies in 15 minutes of continuous shooting 2) The sound to know you're recording. This camera does make a noise when it start recording, but it's very quiet and you cannot hear it when inside the included case. it's a major issue if you use this camera on a head mount where you can't see the screen. otherwise it's not a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Waiting on Manufacturer to return my email.",
      "text": "UPDATE ON MANUFACTURERS RESPONSE: I emailed support. After 4 days no response. So I contacted Amazon.. They wanted to charge me 20% restocking fee, until I reminded them I was being penalized for their vendors negligence to respond to a faulty item. So I am sending back to Amazon with full refund. I would have gladly exchanged to see if it was just a bad camera. But now I will spend my hard earned money on product that has a more reliable customer service. I liked the camera for what I personally needed it for. But after just a few times out with it. It stopped working. I will update when I get customer service to respond.",
      "rating": 1.0,
      "verified": true,
      "author": "Hikergirl01",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Incomplete Product",
      "text": "NO microSD card included (defeats point of order, NOT sun -friendly, NOT collision proof, NOT for water deeper than a pool, camera may overheat while charging!!!, and more. I want a microSD to be included...NOT 20 plastic attachments that will never be used. This is becoming a chore as I need to order the SD card etc..etc..Directions do not use proper english, which confuses the reader on operating it.",
      "rating": 1.0,
      "verified": true,
      "author": "Crtv Chameleon",
      "helpful_votes": 2,
      "publication_date": 20181202
    },
    {
      "title": "Great little camera!",
      "text": "Great little camera! Wanted a low cost option for in water use. This exceeded our expectations. Video quality was great and so were the pictures. Had a little challenge figuring out when it was recording while out on the water in bright sun, but once we knew what to look for at the bottom of the screen we were all set. Did watch a few you tube reviews to be sure we knew how to use the features (no real directions included). Would definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Blue",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "It works but it has two major drawbacks",
      "text": "This camera operates as intended, but there are two cons that make it a questionable buy. 1. The audio sample rate is 8KHz. That means it does not record any audio over 4KHz. Your audio is going to sound like you're listening through earplugs. If you don't plan on recording audio with your camera, this won't be a problem. 2. The camera only records decent video in the most ideal lighting settings, and is noticeably sharper quality on 720p than 1080p or 4K.",
      "rating": 3.0,
      "verified": true,
      "author": "Some Guy",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Great product, poor instructions!",
      "text": "So far this cam is everything that was advertised.... The only difficulty it the lack of instructions in the manual and the print size of the manual is almost impossible to see/read. My recommendations this the mfgr.: *Design zoom buttons to be more quiet....as the \"click\" of the buttons can be heard when zooming on video.... *Include at least 3 more locking screw's. *Better instructions with larger print. *Don't change the camera other than recommendation's... This is an overall Great little camera!",
      "rating": 4.0,
      "verified": true,
      "author": "Mike B.",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Especially for the price...",
      "text": "This is a great little camera. Tried it out yesterday for the first time and it worked well. The image on the screen is a little washed out, but the video looks good. I still need to mess with the setting a bit, which I don't think would be needed with a more expensive camera. Had a little trouble with the remote connection to the camera. GREAT selection of mounting brackets! Again, minor inconvenience for the trade-off of an inexpensive action camera.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hehman",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Great camera for a great price!! Definitely recommend.",
      "text": "VERY HAPPY with this purchase! My husband and I bought it for our rock climbing trip to Thailand. It was perfect in the water—some of my favorite shots are during deep water soloing and on the kayak, all of which we wouldn’t have been able to do without it. Beautiful videos, great pictures, awesome price. I’ve never had one of these active cameras before but after playing around and getting used to it we love it. I’m excited about the feature of taking pictures on a tripod from an app on your phone, but I haven’t been able to work that out totally yet. You’ll be so glad you got this camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Can't wait to use!",
      "text": "I have been wanting an underwater camera for scalloping trips for so long now and finally made the purchase. I received this in about 8 days. It comes with a ton of different parts for different props and whatnot. It comes with two batteries that were fully charged upon arrival. It comes with charging cable for the camera. The camera itself arrived inside the waterproof camera case. It does not come with charging box for batteries, micro SD card, or a case for all of the accessories.",
      "rating": 4.0,
      "verified": true,
      "author": "Tina Velez",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "No charger or SD card...?",
      "text": "I bought this because of the great price and decent photos I saw in the reviews. Just received this and it does not come with an SD card OR a charger for the batteries. I had read it didn’t come with the SD card so I spent the money on one with a lot of memory but now I also have to spend money to even get the thing to turn on. By the time I add up the totals I might as well have gone with a pricey model that I know I can trust and comes with everything I need.",
      "rating": 2.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "This is a great camera at an incredible price",
      "text": "This is a great camera for the price. I was looking for a camera to use with a bicycle in case of road rage or incidents so I would have video incidents. The video is clear, the image is surprisingly stable even when i carry it in my hand. The box came packed with more mounting accessories than I know what to do with, including a bicycle handlebar mount, hand mount, and a waterproof case. It also has an app for android and built in wifi to connect to your device. The camera is easy to use, and has several resolutions up to 16 mp.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Great camera that needs patience",
      "text": "This didn't give much instruction so you will have to rely on YouTube Videos. There are a few good ones out there. I wanted something cheap because I don't plan to take a lot of action videos in the near future but I want good quality after filming some snorkeling​. And this delivered. I took it a recent trip to Puerto Rico for a snorkeling excursion. I came home and it took a lot of patience and time for the videos to download to my iPhone via an app. I am happy to see that it did take some great videos of the Reefs and lots of Fishes.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Just buy it.  For the money, it's great",
      "text": "I'm a photographer. I take footage of everything from 200mph boats, to rc cars, to vlogs and everything in between. I buy inexpensive video cameras so that I can have multiple agngles. I bought this to replace a broken one and this camera is top shelf. $40 and as crisp and clean of a picture that you'd want. It's 170 degree view, so yes, some fish eye effect to it. If you're looking for an inexpensive alternative to gopro, this is it. I'm ordering more today.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd T.",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Dont be fooled by fake reviews, its garbage, died after 2 months",
      "text": "Dont waste your money, just get a GoPro. This camera is a joke, very poor framerate and a terrible lens. I plugged it in to record a motorcycle trip and it just blinks repeatedly and wont turn on anymore even with a new battery. It doesn't record true 4K and even 720p is grainy and distorted. I wont even start with ththe crappy Sound recording. I tried very hard to like this camera.....but since my 5yr old go pro still works fine and this thing died after 2 months not even used more than 6 times. BUT! Due to their stellar Customer Service my defective camera was replaced with a new unit, can't complain when you're taken care of!",
      "rating": 5.0,
      "verified": true,
      "author": "J. E. Claiborne",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Fun, short battery life. Captures Great video just like a go-pro.",
      "text": "Pros: Excent picture quality. Realitvly simple user interface. Really fun slow motion video. Nice that it can take up to 64 gigabyte memory cards. Same size as a go-pro for 400$ less. Beautiful case and acceories. Batteries are cheep and quick charging. Cons: poorly written instructions. Works best after performing a non-quick format on the SD card in a computer. Battery life is sub par, and videos always get corrupted when battery is low. KEEP YOUR BATTERIES CHARGED. Had to adjust settings for smooth video playback, specifically set lighting to 60 hertz.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171224
    },
    {
      "title": "Good for Underwater Photos",
      "text": "I really wanted to like this camera more, but it is just okay. The photos taken underwater are fairly decent, with good resolution, and the colors seem normal. When I use it for photos out of the water, however, the colors are too vibrant, what I would call garish. Because the colors are so weird, I ended up deleting all of the photos except for the underwater ones. Also, many of the photos taken on land had the fish-eye effect, with the curved edges. So I'll use this camera solely for underwater photos.",
      "rating": 3.0,
      "verified": true,
      "author": "Arianna",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "Super Small, But Works!",
      "text": "This camera is super small so it's perfect for mounting it on a helmet or bike, but we're not going to be doing that. We got it for the waterproof aspect since we're going on a cruise. The waterproof case it comes with is a tight seal and definitely protects the camera. I haven't tried out the video aspect yet though so I'm not sure about the sound with the case. It comes with a ton of accessories, which is great for the big adventurer. Enjoy!",
      "rating": 4.0,
      "verified": true,
      "author": "Smitty",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "An exceptional deal",
      "text": "Small camera with tons of accessories. Comes with all kinds of mounting options, though I got a clamp for my helmet so I can easily don/doff the camera. So far is has performed very will, very clear high-def images. Planning on placing a mount in my car so I can use it as a dashcam too. I suggest getting a micro-HDMI cable for direct connection to flat-screens, the size of the files means it will take some time to transfer via WIFI.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Fong",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "A really decent camera for the money",
      "text": "So for this has been an amazing little camera for the price. Quite a lot is included with the package as well. I'm not a professional photographer by any means, but own quite a few drones with 4K cameras and this one seems as good as most. The only negative I can really say is that EIS is not available in 4K video recording, only up to 2.7K. When switching from 2.7K to 4K the EIS automatically turns off. Not really a huge deal as the 2.7K video is really good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason S",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Single partition and FAT32 your card",
      "text": "Bought this for my 12 year old to be a nature filmmaker. SHE LOVES IT. I was thrown off by the button controls at first but after getting used to them they are quite intuitive and the buttons and case are AWESOME. Not crummy little rubber buttons that don’t work. Make sure to delete all partitions on your memory card and format as one partition FAT32. My other cameras liked a sub partition which threw off the little camera at first. What fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Oakland Citizen",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Great Value",
      "text": "Great value for the money. I’m going to use it as a “dashcam” on my scooter. Fairly easy to learn and use. I wish each mode had a large name to identify which mode you are in. The underwater housing is a bit difficult to use as the buttons are quite stiff, however, I imagine it is by design to compensate for water pressure. It comes with a LOT of accessories but no battery charger. They included a means to get a free accessory so I will pick the charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Nice camera!  Perfect size and easy to use!",
      "text": "I purchased this camera during the first stages of the COVID-19 pandemic. It's primary use was to use for my Zoom and Microsoft Teams meetings. Let me tell you, it did the trick! It is a much better picture than my laptop webcam. The bonus is, I get to use it as an action camera too! One thing I would add is, if there is any background noise, or if you use it in your vehicle for road-trip vlogs, the bumps and rattles can drown out your words. That can be corrected by purchasing a lavalier microphone. I'm very happy with my purchase and you cannot beat the price! ITS A MUST BUY!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Love this little camera!",
      "text": "We received our CamparkACT74 and went right out to test it out with the Go-Pro accessories/mounts/etc. that we already had. Worked perfectly and was interchangeable with all our common equipment. The video is outstanding. I'm not sure about 4K, because we don't have a 4K display to watch the video on, but it looks great on an HD flatscreen. This affordable little number is perfect as a travel camera that won't give you an aneurysm if you happen to lose or break it. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Great Camera for $50",
      "text": "I ordered this product on a Saturday and I received it the following Tuesday, Fast Shipment. Upon receiving this product I was quite amazed at the quality of the carrying case, Hard shell? no but a nice quality soft shell carrying case. The camera was well packaged to prevent breakages. I received everything that was listed in the purchase. the camera for around $50 took great video and photos, NO NEED to pay Hundreds of dollars for a minicam when you can get this camera at this price. For a $50 investment it is worth trying the this camera. I had no problems hooking up the phone Wifi app it went up and running in less than 3 minutes....Great JOB",
      "rating": 4.0,
      "verified": true,
      "author": "Danny R Koyl",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Amazing product for water sports!",
      "text": "Blown away with the quality in water! Today was my first use to test it out before my cruise. I haven't figured out sound but the images were amazing. Only issue was I forgot to attach the stick to hold it while videoing...so the 2 6 year olds that played with it had fingers in the way and shark attack visuals...lol. Great price for the product. Would def purchase again! UPDATE: Have figured out the sound. Lol there is an option in the settings to turn sound on and off. Sound quality not the best at times but still do not regret my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Really good camera for the price for sure.",
      "text": "This is a good camera so far I’ve only used it a few times but I’ve had it a month and a half and it’s got a good anti-shake, it’s got a clear picture for sure, it’s pretty standard but it’s a really good price just don’t put it on your dog like I did it is way too shaky. But any camera would be. But it’s a good camera, for sure. The app to control it kind of sucks because it shuts off and do you have to turn it back on etc, it just sucks.",
      "rating": 5.0,
      "verified": true,
      "author": "Alley",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Good deal, not good app",
      "text": "This camera is a great deal, especially since it comes with all of the attachment accessories. It takes decent pictures for the price, but you would not be able to blow up a picture and print it. Sound quality is sub-par with the case on, but the case is waterproof so I cannot complain! Fairly simple to use and find all of the settings. The main reason I didn't give this 5 stars, is the app. The App associated with CamPark is not user friendly, not easy to use, and very glitchy.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Skora",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Garbage, dead out of the box.",
      "text": "Defective right out of the box. I trusted this would work and ordered it for a event I needed to record. The camera will not accept ANY micro SD card. It will power down after the card is inserted. I will never trust this company again and the fact that I can not record my 1500$ training class on Friday is the only reason I needed to just buy the real deal from now on.",
      "rating": 1.0,
      "verified": true,
      "author": "Kentucky Prepper",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good for the cost",
      "text": "We currently own an Osmo camera that we use for most of our filming but felt we needed a second camera to have when out other places. We purchased the Campark camera for this purpose. This camera has pretty good image stability and the external mic is very good. The price is good too. It came with lots of accessories which is nice. For what we need this camera for, I feel that we got a good deal and look forward to using it",
      "rating": 4.0,
      "verified": true,
      "author": "k. mierop",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "I am buying another one, so many features.",
      "text": "You have to get one, the price is super low. Picture quality is outstanding, video is nice and clear (20 MP), comes with remote to start and stop video or take pictures without touching the camera. Microphone is a plus for a clear close sound recording. It comes with a tone of accesories. Please check my video of unboxing and videos taken with this camera at my you tube channel letsrollq, please subscribe.",
      "rating": 5.0,
      "verified": true,
      "author": "LetsrollQ",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Small price for a nice quality camera",
      "text": "Bought this for our cruise so when he hit ports we could snorkel. This did take a good picture and definitely waterproof in the casing. The video and pictures came out just fine. I'm thankful I gave this a try as it did well for its small price. The only thing I didn't like us the lack of directions on how to use, you will need to play around with it to get familiar. I had never used one before so directions would have helped but once I figured the basics it was good to go. Definate keeper",
      "rating": 4.0,
      "verified": true,
      "author": "randi gonzales",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Great compact camera for an excellent price!",
      "text": "Great compact camera for an amazing price. I took it out of the box and had it up and running in 5 minutes. It is simple to use and I love the fact I can use my smartphone as a remote to take pictures or videos! It also came with a small remote which is also easy to use for those family selfies your arms are just not long enough to fit everyone in. I have not taken it diving yet but look forward to getting some great pictures of the fish and coral! I love it and would buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill P",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Ok for price and type",
      "text": "Wanted a little waterproof camera for a trip we’re taking and don’t want to use my expensive cell phone or camera. Also for the kids to play with at the pool and camping. It works great and works as expected due to the price and type of camera. More connectors than we’ll use, but fun glimpse into a kids life 😂. Trying to zoom in just makes it more pixelated though- so I’d rather not zoom in. It does have a fish eye kind of look, so pics are curved on the sides. SLO mo is fun to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Krysten H.",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Great camera!",
      "text": "This camera was a gift for my son and he absolutely loves his new “go pro”! I was nervous the first time he took it in the pond but the waterproof case kept the camera safe and he got some great videos of the fish and his friends swimming. The connections are the same as a go pro so work on lots of things (he had a snorkel he was able to connect it to) and it comes with so many adapters. You can’t beat this little camera for the price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "JFed",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Piece of Junk",
      "text": "This is one of the most impossible purchases I have had. I’ve tried 4 different memory cards, none of which will be read by the camera. The instructions are impossibly hard to follow, and I consider myself to be tech savvy. This is a piece of junk, and I should have known better than purchasing it at a low price.",
      "rating": 1.0,
      "verified": true,
      "author": "B.M. Jones",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Good underwater",
      "text": "The quality is surprising -- and some sound comes through the waterproof housing! The splashing and gurgling of the water comes through, not so much the voices, but I was impressed by the integration of the housing with the camera - it works really well in the pool. Of course you need to remove the camera from the housing to charge it up or access the card. I could not get it to download to the computer via the cable. I had to take the tiny mini sd card out, put it in an adapter, and into the card slot on the computer in order to get the clips.",
      "rating": 4.0,
      "verified": true,
      "author": "ajl",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "It really does what it promises, good video at a cheap price.",
      "text": "OK, I waited months to write this, I don't do reviews just to get a gift. That said, after using this on several 60' scuba dives, it really does the trick. I'm not shooting professional video, so I want the cheapest camera that does a good job. Campark provides this and more. Their box is jam-packed with accessories that make this the only purchase you need. Why pay more for something that does the job just fine? At this price, I could buy 4 of them for one of the \"name brands\", so even if it goes out on me I would just buy another. Good video quality, even when diving off 20' cliffs into water. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Gunghoglen",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Poor experience",
      "text": "I could not use camera because I could never get it out of its protective case to charge it. The instruction booklet it came with had no helpful information and the grammar was terrible. Furthermore, the camera comes with at least 10 different parts and given that the instruction booklet was worthless, I do not think I could have put it together even if I could have gotten it out of its case. I checked for online support but there was none. I watched a video on YouTube as well but nothing helped.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Csorna",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great Camera For The Money",
      "text": "I just got my camera today. The picture is crystal clear and very easy to record. I haven't taken it in the water yet, but the underwater case it was shipped in looks up to the task of keeping it dry. It has a good battery life and it's convenient to be able to charge it in the camera. ( Though I would have liked to have had the dual battery charger included ). So far this camera seems to be a bargain at this price. I'm looking forward to using it quite a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Code Blue",
      "helpful_votes": 0,
      "publication_date": 20200930
    }
  ],
  "product_meta": {
    "title": "【2020 Upgrade】 Campark 4K 20MP Action Camera EIS External Microphone Remote Control WiFi Waterproof Camera with 170° Wide Angle and 2 Batteries",
    "rating": 4.3,
    "feature_bullets": [
      "Upgrade Series of Campark ACT74: This ACT74A action camera records video in 4K/30fps and takes photo at 20MP, capture and share your world in a fantastic resolution.",
      "EIS Anti-shaking Function: Equipped with built-in Electronic Image Stabilization (EIS) , this sports camera delivers stable and clear video even in fast speed movements.",
      "Remote Control and WIFI: This action cam comes with a wireless 2.4G remote, making it easy to start/stop recording while doing sports. The Wifi and APP connection help download and share your videos or photos on social media instantly.",
      "External Microphone: This upgrade helmet camera supports external microphone (included), which can capture sound from all directions, giving you excellent sound experience.",
      "Waterproof Camera with Accessories Kits: With the improved waterproof case, this underwater camera can dive below 40 meters (131ft). It also comes with 2 batteries, remote control, external microphone and other multifunctional accessories (most are compatible with gopro cameras)."
    ],
    "specifications": {
      "Package Dimensions": "9.9 x 4.8 x 3 inches",
      "Item Weight": "1.1 pounds",
      "ASIN": "B01MXXP4EC",
      "Item model number": "ACT74-black+BF513",
      "Batteries": "2 Lithium Metal batteries required.",
      "Customer Reviews": "4.3 out of 5 stars7,893 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#549 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 13, 2016",
      "Manufacturer": "Campark"
    },
    "categories": [
      "Electronics",
      "Camera & Photo",
      "Video",
      "Sports & Action Video Cameras"
    ],
    "price": 39.99
  }
}