{
  "website_summaries": [
    {
      "verdict": "Loud enough for outdoor environments; impressive battery life on full charge. Good option for outside use for long periods.",
      "pros": [
        "With 12W, loud enough to be heard outdoors",
        "Surprising sound quality for small speaker",
        "Fully charged battery operates up to 24 hrs",
        "Dual speakers avoid distortion even at high volume",
        "Compatible with all popular smartphone and tablet devices"
      ],
      "cons": [
        "Switching between devices requires \"forgetting\" speaker on first device before pairing with second device"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "While Anker's SoundCore 2 doesn't sound as good as some people think, it's a likable, relatively inexpensive mini Bluetooth speaker with strong battery life.",
      "pros": [
        "The Anker SoundCore 2 delivers better than average sound for the money, is water-resistant and has strong battery life",
        "There's also a built-in microphone for speakerphone calls"
      ],
      "cons": [
        "Distorts at higher volumes and can't handle deep bass"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Sound": 7.0,
        "Value": 7.0
      },
      "publication_date": 20170825,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worked for under 2 months",
      "text": "Disappointied. I’ve had this speaker for less than 2 months, and a speaker is already blown. I used this speaker for light use, 5-10 min a day getting ready for work in the morning. A few days ago I noticed the bass notes started to crackle. I turned down the volume and it seemed to help. Fast forward to this morning and it crackles at any volume, the right speaker is blown. Checked my amazon account and no return option is available. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 111,
      "publication_date": 20171024
    },
    {
      "title": "Improved Sound Worse Battery Life",
      "text": "I owned the original SoundCore and loved it so much that I decided to upgrade to this model. The sounds clarity and bass is definitely improved, I am not an audiophile but I appreciate good sound having worked in the nightlife industry for a few years. My only con which for me is decent because I ranted and raved about the battery life of the original to my friends and this one after a full charge when I got it lasted for only half as long as the original while impressive still was disappointing. UPDATE: Anker Customer Service reached out to me and are sending a replacement unit cause they believe that my unit was potentially faulty.",
      "rating": 3.0,
      "verified": true,
      "author": "Abu Ibrahim",
      "helpful_votes": 53,
      "publication_date": 20170812
    },
    {
      "title": "One Star",
      "text": "So disappointed as it stopped working after two months!!! Now it is too late to return",
      "rating": 1.0,
      "verified": true,
      "author": "william f swartz",
      "helpful_votes": 43,
      "publication_date": 20171126
    },
    {
      "title": "Not happy with this purchase",
      "text": "Doesntwork with my mac. Sound goes in and out. I also have to pair and re-pair all the time. Not happy with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "AS",
      "helpful_votes": 28,
      "publication_date": 20171110
    },
    {
      "title": "Great Bluetooth Speaker for Friends & Family",
      "text": "Form Factor: 5/5 Midrange/Vocals : 4.5/5 High Frequency : 4.5/5 Low Frequency: 3/5 (put it closer for reasonable effect) Distortion @ Max Volume: 4.5/5 Bluetooth Video delay: 4.5/5 within 8 feet (2/5 > 10 feet) Bluetooth Pairing after Powering On: 5/5 Bluetooth Range : 5/5 Audio Cleanliness without Adding Equalizer or Flavor: 4.5/5 Battery Life: 5/5 Water Immersion: 0/5 (Big No) Water Protection: 3/5 (IPX5) Sound getting suppressed as other reviews have stated might be due to Streaming Apps like Spotify. Works fine when playing directly. Overall Rating of Bluetooth Speaker: 5/5 (considering the price & performance)",
      "rating": 5.0,
      "verified": true,
      "author": "iPPK",
      "helpful_votes": 27,
      "publication_date": 20170821
    },
    {
      "title": "Tinny Sound",
      "text": "For the price of this speaker, the sound quality is tinny and awful, with little discernible bass. I have no use for a tinny speaker. It sounds no better than the tiny speaker in the front edge of my laptop computer. A 3.5mm SoundLine auxiliary cable (jack) is \"sold separately\". I could have bought a generic cable for $2, including shipping, so they must cost about 50 cents to make, but Anker decided not to include one. I returned this speaker for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Picky Buyer",
      "helpful_votes": 14,
      "publication_date": 20181002
    },
    {
      "title": "Well made, but...",
      "text": "I enjoy the speaker. It is well made, sounds good and compact. BUT...the battery sucks donkey nads! Ive had the speaker for little over 2months, and I always charge it when it blinks and pull it from the plug once its completed the charge cycle. Unfortunately for me, today the speaker started 'binging' and red blinking about 3mins after I pulled the charging cable and turned it on. Im hoping this isnt an issue with all of the soundcore 2s out there. Defn caveat emptor...",
      "rating": 1.0,
      "verified": true,
      "author": "bert",
      "helpful_votes": 15,
      "publication_date": 20180118
    },
    {
      "title": "Frustrating",
      "text": "This speaker sounded *amazing* when first purchased, and especially after breaking in a little. We have several bluetooth speakers throughout the house and this one easily took 1st place for sound quality. However, with Youtube videos, there was a significant audio delay and it was really annoying. I did some googling, found out there was a firmware update, and updated it per Anker's website instructions. Afterward, the video delay is fixed! However, now the speaker sounds pretty dull. Audio sounds fine but it's a noticeable, significant downgrade in music quality after the firmware update. Guess you can't have it all? I would almost rather downgrade the firmware and just not use the speaker for Youtube or other video.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Ansley",
      "helpful_votes": 5,
      "publication_date": 20190708
    },
    {
      "title": "Really like it but..",
      "text": "I actually really like this Bluetooth speaker, but, the only things that I dislike about this speaker is the kind of loud noise/sound that it makes to turn it on and off, how long i have to hold down the power button and it has barely to no bass at all. I wouldn't really recommend this speaker to others.",
      "rating": 3.0,
      "verified": true,
      "author": "Vik Enn",
      "helpful_votes": 4,
      "publication_date": 20200929
    },
    {
      "title": "Loud & compact",
      "text": "We use this as our sound bar for our backyard projector & movie nights & it has been great. Very loud, clear & compact. The battery life is about 24 hours. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathanael Plater",
      "helpful_votes": 5,
      "publication_date": 20201004
    },
    {
      "title": "Poor sound quality",
      "text": "The size was good, exterior rubberized surface good but sound quality was not good, little to no tone quality for the price. Wouldn't recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Allen D. Swalling",
      "helpful_votes": 14,
      "publication_date": 20180317
    },
    {
      "title": "Small Speaker, Big Sound",
      "text": "I bought this speaker for watching movies on my laptop at home and for showing videos and movies in the classroom. I am favorably impressed with the sound - \"full bodied\" and strong. Testing the Bluetooth range, I wandered around the house with my iPod, and could still hear words clearly from 30 feet away, with several plaster walls between me and the speaker. The outer case feels solid, and has a rubber coating to guard against dings if dropped. The controls could be difficult for someone with arthritic hands, as they require a firm touch, but they are large and easy to see for those with diminished eyesight.",
      "rating": 5.0,
      "verified": true,
      "author": "Selchie",
      "helpful_votes": 2,
      "publication_date": 20191113
    },
    {
      "title": "Compact, powerful, and long-lasting Bluetooth speaker",
      "text": "We accidentally snapped off a car audio adapter in my iPad - nothing to grab to get it out. I use this iPad for a variety of uses daily - so I needed a way to get audio without ear/head phones and this speaker is the solution. This gets much louder than the iPad did and the dynamic range is better, also. I charged this up initially and have used it for more than a month off and on. To be clear I use Bluetooth headphones most of the time, but this speaker is still working off that first charge. We wished we had looked into this sooner - great solution for our needs.",
      "rating": 5.0,
      "verified": true,
      "author": "WileEC",
      "helpful_votes": 2,
      "publication_date": 20200930
    },
    {
      "title": "Perfect",
      "text": "I connected my Kindle fire via blue tooth and the sound is great. This solved the problem I had with the low volume of the Kindle while I was trying to listen to podcasts. So far I've used it about 20 feet between speaker and device with no problem. I've always been happy with any Anker product that I've purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Chaplin",
      "helpful_votes": 3,
      "publication_date": 20200930
    },
    {
      "title": "Highly Recommended!",
      "text": "I’ve tried several of these little speakers to boost the sound of music from my phone. This little unit checks every box-it was reasonably priced, the sound quality is the best of any speaker I’ve ever tried, and the Bluetooth pairing was seamless. I usually keep it on the charger-and was SO happy that a high-quality cable was included-but if I do take it off of the charger, I find the length of time before losing charge impressive! This item was voluntarily upgraded from the original order, and I’m just amazed by how much I love it! Even during this challenging time when delivery speed tends to be slower, this item arrived quickly and in perfect condition.",
      "rating": 5.0,
      "verified": true,
      "author": "PapihuahaMom",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Great for music, bad for videos",
      "text": "For this price the sound quality is awesome, easy to connect, and I have splashed it and gotten it dirty with no issue. However, there is a delay in the audio, so if you use this to watch any video or movie the words will come in after their mouths move. I attempted to use the aux input instead to reduce this delay, but the speaker continually defaults to bluetooth connectivity and will not accept data through the aux. There is no way to manually turn off bluetooth pairing on the speaker, the instruction manual only tells you to plug in an aux cable.",
      "rating": 4.0,
      "verified": true,
      "author": "John Tiburzi",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "I am so incredibly impressed with this company.- their follow up is fabulous",
      "text": "The sound is good I love that it doesn't make lots of noises when connecting, turning on and off I am so incredibly impressed with this company. There was an issue with the first speaker I received and I posted it in my review. I didn't know how to contact the company. The very next day, I received an email with a request to provide me with a replacement speaker. It was shipped quickly and I've received two followup email - checking to see if all is well. The quality of the sound is very good, too. I don't have to turn the volume up high to be able to hear",
      "rating": 4.0,
      "verified": true,
      "author": "Karen Stavert",
      "helpful_votes": 3,
      "publication_date": 20180607
    },
    {
      "title": "Disappointed",
      "text": "I like the Anker brand of cables and other offerings, so I bought this with no hesitation. Anker is a solid brand. Imagine my disappointment when the sound came out fuzzy and like it was coming through a long tube. There are no adjustments for fine tuning, you get what you get. If there was a basic treble and bass dial, you'd be cranking up the treble on this speaker to get more clarity. After using this speaker the tiny little speaker on my cell phone didn't sound so bad! It was much clearer. I was hoping for much more from the Soundcore 2.",
      "rating": 3.0,
      "verified": true,
      "author": "Smedley Butler",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Disappointed",
      "text": "I had the Soundcore for about 4yrs and it was great. The battery lasted about 24hrs (3 8hr shifts) as advertised. After 4yrs, the battery started to lose life by about a third (16hr life). Firgured it was time to upgrade. Bought the Soundcore 2. After having the S2 for about a week, decided to return the Soundcore 2. It took about 24hrs to fully charge (red light to white). Played it at full volume at work and the battery only lasted approximately 9-10hrs. WTF? It’s advertised at 24hr battery life. I don’t know if I got a bad one. YMMV.",
      "rating": 2.0,
      "verified": true,
      "author": "El Terriblé",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Anker almost hits it spot on",
      "text": "Speaker is a great buy, worth the extra 20 or 30 bucks as opposed to other cheaper ones. It has superior waterproofing, but it really doesn't affect me because I'm not planning on being near a body of water that's being splashed. The sound quality range is above average for most speakers I've tried. Is struggles a slight bit on the mid-range, and the treble feels a little weak.The speaker's very portable and has a good amount of grip on it from the rubber, and like always I'm a big fan of anker's products and they haven't let me down yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Royadin",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Loving it",
      "text": "I've had this Soundcore 2 for almost three months now and I'm loving it. I bought it to primarily keep in the kitchen and play music from my phone, and it's great for that, but I also find that I often grab it and take it with me around the house as I move from room to room because it's so portable. I'm very happy with the sound quality (it packs a punch for its size), bluetooth connection and range, and battery life. If someone stole it from me tomorrow, I would absolutely buy another Soundcore 2 to replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jammeroni",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Worked great, for a day.",
      "text": "Took out of the box, looked good. Easy to set up and connect with bluetooth. Sound quality was not great but ok for a speaker of this size and cost even on loudest setting. Worked fine and sounded fine the first day. Second time I used it it worked fine for about two hours then something happened to the sound. Sounded like a speaker blew out or something and the sound was badly distorted at every level. Thought maybe the battery had run down so I charged it up again. Sounded the same. Sending back. I guess you get what you pay for. Spend the money and get higher quality speaker.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Amazing speaker even at great volume",
      "text": "This speaker is a gem of a thing. I use Paradigm Studio Reference speakers in my home theater and tend to be on the pickier side when it comes to audio (returned other products in the last month). I needed a strong decent speaker to replace the anemic ones in my Acer Predator gaming laptop. This did the trick. I combined it with the paid Fx Sound 1 app, and it makes this thing SING. I'm picking up a second speaker so that I can jam out/game out in stereo sound. The little rubber tab at one end can double as a stand even for better imaging. So impressed with this little guy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Davidson",
      "helpful_votes": 2,
      "publication_date": 20201010
    },
    {
      "title": "Quit working after a month",
      "text": "I have had this product for a month and a half. It quit working and charging. It literally sits on my desk. Miss my return window by 10 day. RIDICULOUS",
      "rating": 1.0,
      "verified": true,
      "author": "Jacey N. Talbert",
      "helpful_votes": 11,
      "publication_date": 20171031
    },
    {
      "title": "Great sound and solid construction, but Bluetooth lags playing video",
      "text": "This is the first Anker product I can’t rate 5 stars. Build quality is excellent, as is the sound. The 2 seems a little larger and heavier than the original Soundcore, but not by much. However, bluetooth audio with this device suffers a minor lag — enough to make it annoying to watch videos on my iPad using the Soundcore 2 speaker. Music and podcasts are fine, and the sound is vastly improved over the original Soundcore. But after a few minutes of video, I have to turn off the Soundcore 2, and either go back to the old Soundcore or headphones or the iPad speakers.",
      "rating": 3.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 2,
      "publication_date": 20181224
    },
    {
      "title": "Great Product!",
      "text": "I bought this product to use on vacation by the pool. I connected my legacy iPod using a and cable and my iPhone 11 using BlueTooth. Both worked well but devices connected via BlueTooth were definitely louder for some reason. BlueTooth pairing was effortless! I like this this product has a light indicating the state of battery charge. Bass response is good but outside I often wished for a little more volume. Inside, there was more that sufficient volume! Both are a remarkable improvement over the similar triangle-shaped product I used for a couple years. I also bought a little case designed for this product and it worked well for toting the speaker, iPod, and accessories! Rock on!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Green",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "The Oontz angle 3 ultra is good for big sound and bass and doesn't get muddy",
      "text": "Meh. clear sound, but underwhelming. THE TRIBIT is where you go. The Oontz angle 3 ultra is good for big sound and bass and doesn't get muddy, but the Tribit destroys Anker in EVERY RESPECT. The Oontz 3 ultra does too. Anker doesn't get loud, and it's really mediocre with punchiness, power...its just meh, and it's light years away from The Tribit and Oontz angle 3 Ultra. Meh.",
      "rating": 3.0,
      "verified": true,
      "author": "Mingus",
      "helpful_votes": 4,
      "publication_date": 20180703
    },
    {
      "title": "Great review. Only speaker you really need as a casual listener.",
      "text": "This is perhaps the best gift we’ve given our father. It’s so much higher quality than expected at this price point! We bought it for his birthday in October. He’s used it for about 10-12 hours total and it still holds a charge. The sound carries well. I’m sure it’s not as high quality as a professional Bose or JBL speaker, but this definitely gets the job done. The buttons are clear to see and feel easily. My dads (a very youthful and spry) 73 year old man and manages to use it easily. The Instructions for connecting are clear and simple. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizz",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Good speakers for price",
      "text": "Bought 2 of these and paired it. Sound is fairly good for price paid, pairing is simple (once you watch 2 minutes youtube :-)). It holds bluetooth connection well and when you turn one off, second is turned off as well. Battery life could be better, but I guess doing bluetooth pairing sucks some more battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuriy K",
      "helpful_votes": 2,
      "publication_date": 20200922
    },
    {
      "title": "Very disappointed",
      "text": "Very disappointed. This is my 3rd Anker speaker and the new “upgraded” model is a huge step backwards. The battery life is no where near 24hrs like the previous version. This model also has Bluetooth connectivity issues. It will be supposedly connected, but sound will come out of the phone instead of the speaker. The way around the issues is to make sure the speaker is on before opening any music app, but this still doesn’t always fix the problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Ring",
      "helpful_votes": 3,
      "publication_date": 20200617
    },
    {
      "title": "EQ isn't quite right",
      "text": "I like this speaker for the most part and listened to it several times with different songs but the EQ is really high and there is hardly any low end. When it said enhanced bass, I thought it would at least be balanced, but the highs drown out any low end at all. The volume is nice and puts out loud sound. This would be a great speaker if the EQ was balanced. I have a Tribit XSound speaker that has the exact same specs and price, but sounds better in my opinion. Returning this and will buy another Tribit.",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Not nearly as good as the less expensive Anker",
      "text": "I prefer the less expensive Anker (then too that might be because I'm 72 and my hearing may be a little off)... This one for some reason has mixed quality as a Bluetooth extension of my cell phone.. I have one of the less expensive already and another is being delivered today..... 3/3/18.. Update.. ANKER read my review and made everything right... Even though 'I' may not be too excited about this item I have found all the other products I've purchased from them to be exceptionally good... I will continue to be an ANKER customer... Thank you ANKER.....",
      "rating": 4.0,
      "verified": true,
      "author": "JimmyBazball",
      "helpful_votes": 2,
      "publication_date": 20180227
    },
    {
      "title": "Decent sound only after significant equalization. Specs not as stated.",
      "text": "Out of the box, the speaker sounded pretty tinny. Was able to get it to sound much better with some aggressive equalization from my phone music app. Bass is still a bit weak, but actually stronger than I expected for the tiny speakers. Amazon site says this is Bluetooth 5 and IPX7 water resistance but neither is true based on the manual and Anker site. I would rate this a 4 but get pretty fed up with these errors on Amazon (e.g. lies by sellers).",
      "rating": 3.0,
      "verified": true,
      "author": "MN-Reviewer",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "If you like music, then this portable Bluetooth speaker is for you!",
      "text": "Amazing sound from this small box! Very impressive. This is my second Anker product that I have purchased. I'm a fan of Anker. Friends and family have commented how good it sounds and asked me where I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 3,
      "publication_date": 20180704
    },
    {
      "title": "Eh *UPDATE",
      "text": "I liked my last one a lot better. First ANKER speaker I’ve been disappointed in. But even disappointed, still a good value. UPDATE *one of the great things about ANKER is their customer support and what appears to be genuine interest in making sure their customers are satisfied. they’ve remained aggressive in the pursuit of making my purchase right and have sent a new speaker to replace the faulty one. really can’t ask for much more than that from a company.",
      "rating": 5.0,
      "verified": true,
      "author": "coleman",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "I do love this, but is slow to connect to Bluetooth.",
      "text": "This is a great little speaker. So far it has been everything that I expected. Now, I haven't had all that many Bluetooth speakers, ear buds, etc, but this one seems to take a long time to connect the first time I connect it to my phone, iPad, etc. Maybe 3-5 minutes before they connect. Once connect the first time, it does great. So maybe it is me. I would buy it again if something were to happen to it, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Nutog",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Love this little speaker (minus the bluetooth)",
      "text": "The audio quality is great, it can get loud too if you're into that. The bass is pretty good for such a small speaker too, the thing really shakes. The only thing wrong with this product is the bluetooth, don't know if that's ankers fault or just how bluetooth is, I've never had a good experience with anything bluetooth related so this is no different. When using bluetooth it will cut out a lot and frequently.It doesn't seem to cut out on low bitrate music though, however. Definitely not a dealbreaker though for me though, just plugged in the aux and I'm good.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "It's all good!",
      "text": "I had the opportunity to listen to this speaker at Walmart prior to purchasing it. Granted the environment is not the best for speaker comparisons, but the Anker speaker was to my ears, far and away the best speaker they had, by a long margin. Decision made - it arrived in short order from Amazon Prime. Bluetooth setup was simple and quick, and then came the sound. Unbelievable that something this small can have such big sound. I am impressed. Couple of days later and no issues at all . Bluetooth range is good. Not sure what magic they performed to get this sound out of such a small enclosure, but it's good magic! Great speaker!",
      "rating": 5.0,
      "verified": true,
      "author": "Deon",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Great Bathroom/Pool Deck/Beach Speaker",
      "text": "I got this speaker to replace a Skull Candy one we had had for a long time. I use the portable bluetooth speakers in the bathroom, outside for entertaining or working in the yard, poolside or at the beach. The sound quality is on point with what I like, crisp clear high and mid, accented bass. The outer casing is the grippy silicone kind so it does not slide on counters or out of hands easliy. I could not be happier with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Anker delivers yet again... almost.",
      "text": "Out of all the soundbars I've seen on the shelves (and online), this one is pretty good for the price. It has great sound, good charging capabilities, and an overall sleek design. The main problem I have with most bluetooth devices these days are the lack of multi pairing. Bluetooth 5.0 with quick pairing is upon us now and this thing is ageing quick in the tech world. I expected more from Anker.",
      "rating": 4.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 2,
      "publication_date": 20171106
    },
    {
      "title": "Doesn't Match Anker Quality",
      "text": "Im generally a huge fan of Anker products and have purchased numerous items from them over the last year. However. This speaker is not good. The sound quality is terrible when using an aux cord. I get a lot of static unless I'm connected via bluetooth. I purchased it as a speaker connected to my laptop at work. Since our IT folks disabled bluetooth, I have to use the aux cord. I have since stopped using this speaker because of the static and replaced it with a free speaker I picked up at a vendor fair. It's cheap quality but sounds much better than the Anker.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Smith",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Good for audio, but not for mic",
      "text": "Got this to use for Zoom calls where I mostly listen. This is good for that as it's better than trying to blast the volume on a phone or your computer. However, it's not good for picking up on the mic. When I tried to Facetime with people using this, I was told that they could not hear me. Once I turned this off and defaulted to my computer's audio, I was told that the volume was significantly better.",
      "rating": 2.0,
      "verified": true,
      "author": "Picky User",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Anker vs Bose",
      "text": "For those that say this speaker sounds great, they haven't compared it to the Bose Mini SoundLink. The Bose is comparable in size, but carries bass much better. The difference in build quality is also easily apparent. However, I paid $40 for the Anker and $200 for the Bose. I'm very happy with the Anker based on that fact. I bought this speaker for something to throw in a bag and take to the beach. It's loud enough, the battery is fantastic (4 year old Bose only lasts about 6 hours now), and it sounds good. Not great, but more than adequate for the price paid and intended use. I'd recommend this product based on excellent \"bang for the buck\".",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Pair 2",
      "text": "Good sounding but one needs 2 for a louder sound. They are pairable. 1. Please turn both speakers and make sure both speakers don't pair with other devices. 2. Hold the Bluetooth button of both speakers together for 2S, then release them and the Bluetooth indicator is flashing blue. 3. When TWS is successfully paired, there will be a beep sound. The master speaker Bluetooth light will flash blue and the other Bluetooth indicator will become solid blue light. Notes: Avoid having any electronic devices between the two speakers. Make sure the distance between the two speakers not greater than 5 meters.",
      "rating": 5.0,
      "verified": true,
      "author": "ATHANASIUS",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "This was a waste of money",
      "text": "This was a waste of money. It stopped being able to connect to the devices we wanted it connected to, the buttons don't always function well. This is the second Anker product we've had problems with (they replaced the lightning cord that promised to last longer than the Apple cords, without any problems, though, so a good company to deal wtih.)",
      "rating": 1.0,
      "verified": true,
      "author": "Madeline Bresler",
      "helpful_votes": 7,
      "publication_date": 20180418
    },
    {
      "title": "Need a louder speaker For outdoors go with 20W",
      "text": "I really liked Anker products. But, this speaker is not load enough for outdoor next to a pool. I still kept it and we are using inside, but still not loud enough. Update: Anker customer service contacted me after my review and sent me a 20W speaker as a replacement. I’m not changing my review from three stars to five just because of the new speaker they sent me. I’m changing it because the customer service went beyond and above to take care of their customer. ***As I said in my earlier review, I really like Anker products and their line of items I have purchased are high very quality with Great Value.",
      "rating": 5.0,
      "verified": true,
      "author": "Beebee",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Big Fan and Worth the Money",
      "text": "I am a big Anker fan. Have everything from power banks, chargers, cables, Bluetooth headphones, etc, to Anker LED desk lamp (yes, they came out with one for a short period of time). This is my 2nd Anker SoundCore speaker, the first one (SoundCore I) was given to my aunt when I brought it to her house during Thanksgiving gathering. She liked it so much, it just sort of stayed there. Families you know... Instead of picking up another SoundCore, I upgraded to the SoundCore II, being water resistant was the deciding factor. Synced it without problem with my Andriod. Great sound, very true, doesn't \"beautify\" the sound like some other pricier speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan W",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Great sound for the price, worth having 2 for stereo sound",
      "text": "I bought 2 of these after i purchased the First one. The sound is amazing for the price so bought 2 to have a stereo experience. I’m blown by the quality for the price i Paid. Do note to not expect high fidelity but keeping expectations at par with the price won’t make you disappointed in any way. The range is good such that my phone was connected even when i was on a different floor. I wish it allowed 2 phones to be connected at the same time. Only gripe, the instructions to connect the 2 speakers was a bit confusing. I figured it out after watching a YouTube video someone posted.",
      "rating": 5.0,
      "verified": true,
      "author": "TG",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Why not 5 stars?",
      "text": "This produces a good sound and is worth $40. I would think twice however, at the full $80. The main frustration you'll have is every time you turn it on or off you get a melody playing for a few seconds. I'd rather it just play my music and not that. Our family also has a Sony bluetooth speaker which has better sound quality ($80), but, as I said, for $40 it is a reasonable price. If I had to chose between Sony and Anker at $80 - Sony wins by 2 stars!",
      "rating": 4.0,
      "verified": true,
      "author": "D2E",
      "helpful_votes": 3,
      "publication_date": 20171006
    },
    {
      "title": "Wonderful!",
      "text": "This is a wonderful bluetooth speaker. I got this primarily for use in shower and to play music that fills a medium sized room. This speaker is so loud that I just kept it in the bathroom counter and didn't even need to take it into the tub. Tried it once in the tub also and it withstands the water splashes well (its water proof; my use was for just water resistance). Also it drastically enhances the volume when connected to devices. Sound quality is very adequate for normal listening. The bass is pretty good. I doubt if its audiophile level, but I did not buy it with audiophile expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "V2Sri",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "The build quality is great but the sound is quite lackluster",
      "text": "UPDATE: After talking to customer service it was determined I was sent a faulty speaker. Not only did they send me a free replacement but the sent me the brand new upgraded version. Their customer service is hands down the greatest I've dealt with on Amazon. The new bass boosted version is amazing and I would rank it next to the bose Bluetooth speaker. To be honest I was really let down by this. The build quality is great but the sound is quite lackluster. It's not very loud and to try and compensate for that you have to turn it all the way up and it gets distorted. The Oontz Angle is much louder and better quality sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean stowers",
      "helpful_votes": 2,
      "publication_date": 20170727
    },
    {
      "title": "Great quality sound, great battery in a neat package.",
      "text": "I was looking for a neat, easy to carry bluetooth speaker with modest sound quality. After reading some reviews on this Anker Sound Core 2, as well as it's previous version, I decided that this fits the bill. When it arrived, I was impressed with the feel of it in my hands - it has a sturdy weight, and smooth grip. Then we powered it on, and pairing it with a phone was a breeze! Turned the volume up and was blown away with the \"texture\" of sound! I would buy this again (especially since it can be paired with another one using True Wireless Stereo Technology to explore sound effects with left and right channels).",
      "rating": 5.0,
      "verified": true,
      "author": "MrsG_876",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Great for the backyard and/or pool!",
      "text": "We've been spending a LOT more time in the backyard lately, and the kids frequently ask me to play music on my phone. The phone didn't sound awesome when it was loud enough for everyone to hear. I also didn't need/want a huge audio system outside that would annoy the neighbors or cause other problems. This speaker was the perfect solution! The sound is great, and I can walk around the backyard with the phone in my pocket, while it is streaming to the speaker via bluetooth. I have no regrets in the purchase. I do wish there was a next/previous track buttons on it, but otherwise it is a great design.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave B",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "This thing is amazing!",
      "text": "The sound quality is unreal for the price. It hits mids well, most other brands I have tried are missing this. The highs are not tinny and the lows are replicated well. It has great volume control. Not only can you use the top buttons but also your phone's volume control. It's loud enough to use on a job site or at a party . It also goes quiet without hissing or static at very low input volumes. The Bluetooth works throughout my house. It has a nice weight to it which helps if you play anything bass heavy. Jazz sounds great. Bass heavy rock is fantastic. I am going to have to buy a second one for my wife.",
      "rating": 5.0,
      "verified": true,
      "author": "D. lingerfelt",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Pardon the pun but these things ROCK.",
      "text": "Granted, I’m an old boomer and not an audiophile but the sound quality is amazing. Stays synced to my phone at long distance. I have a 2004 4RUNNER that has an AM/FM CD player. Not my daily driver, I just use it for dog training. I was going to replace the stereo in it just for the Bluetooth capability. I hate commercials. I bought another lower wattage Anker and used Velcro to mount it to the dash. Works perfect and sounds great. When I get to the dog training area, I pull it off the dash, set it on the roof and crank out the classic country music. Drives the snowflakes crazy. Not bad for an ole BOOMER !!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bwana Dave",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Excellent sound for the price",
      "text": "I wanted to get my brother a speaker for christmas but I didn't want to spend a fortune on anything. I have a jbl charge 4 but I didn't want to spend nearly that much for another speaker. I did some research and found ankers line of speakers. I chose this one after looking at specs and reviews. The speaker itself is a complete fingerprint magnet. You'll see every single place you touch it. Battery is amazing for a speaker so small. The bass is good at lower volumes but not really noticeable at higher volumes. For $30 you can't beat a speaker with a 24 hour battery, bass radiator, and IPx7 rating.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared DeJong",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great sound!",
      "text": "I can find nothing about this product that I do not like. I use it for podcasts and music. The phone calls part is great. The sound is fantastic and high quality. Do not second guess your self, this is a winner. I will buy another one to keep in my old truck to play music and podcasts. It will also be great for hands free phone calls. Five stars from me. I use almost everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Armentrout",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Stopped Working",
      "text": "Stopped working after 2 months. I used it for less than 10 hours combined. Disappointed as I thought it is a very good speaker.",
      "rating": 1.0,
      "verified": true,
      "author": "Shubham S.",
      "helpful_votes": 18,
      "publication_date": 20180214
    },
    {
      "title": "If you can acknowledge you are buying a budget speaker, you will be blown away.",
      "text": "Prices always vary, but when I picked this up it was $29.99. A steal. Please acknowledge that you are purchasing a budget speaker so that you can be thrilled with the quality and features for the price. Super portable. Respectable volume. Doesn’t really distort at maximum volume. Impressive water resistance. Durable build. Mine seems to have a minor issue where the volume seems to fluctuate intermittently and I wish I’d have sent it back before the first year of having it, but it doesn’t ruin the experience. Anker always impresses me in a when it comes to affordability and quality. Though I must say, $50 would make it feel less stellar of a deal, but still a good one.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous, Please",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "I love this box, easy to connect.",
      "text": "So glad I got this box. The only complaint is the four buttons on the top are the same black rubber as the entire thing. So they are hard to see, but large so you can feel which is which. Small, rubber case, loud when needed. The volume is synced (blue tooth) with my iPad so I can control it with my pad alone. The audio sounds it makes confirms connection and disconnect at power off. Battery charge lasts a day for me. I don't play much music, mostly teaching messages and such. But when I do play a song, wow what a difference. For the money it is really a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Talley",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Very nice speaker",
      "text": "Purchased this for music in the bathroom while showering getting ready for work and also to be used outside while doing yard work...so far this speaker is everything it was advertised as...absolutely satisfied with this unit, the Bluetooth pairing was super fast and once paired that's it, it automatically connects to my phone when i play my music...the unit sounds great and i think it is plenty lound enough for what i need it for. definitely worth the money in opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Blue1",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Works for what it is but sounds underwhelming.",
      "text": "Not super impressed. For what it is (a portable Bluetooth speaker) it’s fine. I mean that sincerely because I bought it to “upgrade” my echo dot 3rd gen but I think the dot sounds better than this speaker. This speaker has considerably less low end than the dot and the total volume is less loud as well. Maybe not a fair comparison because the dot doesn’t run on battery power like this speaker but I guess I expected better.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex E. Mussman",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Decent speakers, muddy sound quality",
      "text": "I listen to music a lot and my previous speaker was broken. When this Anker SoundCore arrived, I tried it out right away. The features are good - charged quickly, Bluetooth pairing works very well but the sound quality is lacking. The sound was muffled and muddy, like it was under a pillow. Nevertheless, I tried different pieces of music, with no avail. I switched apps, songs and genres but the muddy quality remained. Although it is light and portable with good volume control, I am not satisfied.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20200215
    },
    {
      "title": "Perfect for alternative rock and folk songs",
      "text": "NEW: It works great, I really love the sound, this is perfect for alternative rock and folk songs. It seems to be that the first item I got had some issues, but Anker just solved my issues by sending me another speaker, the best part is that I didn't have to ask for it... This is an example of what customer service should be. The second one is working flawlessly. OLD: Love how it sounds, and how easy and fast it connects to my devices, but the battery is an issue, I have to recharge it like 2 times in one day with sessions of 1 or 2 hours. u.u",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Amarante",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Seriously....",
      "text": "What’s to think about.... This little wallet/pocket price friendly Bluetooth Speaker is just incredible. I use it mainly for practicing my GU-TAR and boy does this thing make some sound. YOU’ll GET A SOLID CONNECTION, GREAT BATTERY LIFE, IT WILL ALSO PLAY WHEN PLUGGED INTO OUTLET. THIS SPEAKER HAS AN INCREDIBLY CLEAN SOUND. WHEN I SAY CLEAN SOUND, I MEAN THE SOUND IS NOT OVERLOADED WITH TREBLE NOR BASS JUST PERFECTION, EVEN AT MAX VOLUME AND FOR WHAT... $42.53. Seriously what’s to think about... notice no question marks, yeah........ you’re welcome! ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "I like it my rating is 3.5 stars",
      "text": "I love the speaker and it gets to a decent level of loudness. The waterproofing is a great addition although i haven't put that to the test. I would imagine if you stereo paired these they would be amazing. The only reason for 3.5 stars is i haven't had any other BT speakers to compare it too and by the reviews i just thought it would be somewhat louder ,but dont get me wrong its pretty loud and sound quality it good not audiophile but good. In my opinion the treble is there the bass is decent for this size of driver ,but the mids seemed to be lacking.",
      "rating": 4.0,
      "verified": true,
      "author": "t.b.",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Bluetooth Speaker for IPhone",
      "text": "Out of the box I charged it. It did not take long, about an hour for the light to turn white. I paired it with my iPhone 5s and I was impressed with the sound quality. I tried it with Spotify and the iPhone music app with great results. I bought it for my daughters 8s and she loves it. I was impressed with the packaging, very nice. It would be nice if it came with the AUX cord, I would pay a little extra for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Who",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "WORKS LIKE NEW",
      "text": "I’ve had this speaker over a year and it still works like new it’s been on countless hikes, beaches, and lake trips. I use it everyday. Best speaker for the price hands down.",
      "rating": 5.0,
      "verified": true,
      "author": "b",
      "helpful_votes": 3,
      "publication_date": 20201003
    },
    {
      "title": "Nice little speaker",
      "text": "Has rubbery exterior and great sound for its size. using two of these paired in a 8 x 12 screened porch with a portable Bluetooth CD player. Once the cd has ended the speakers turn off automatically after about 15 -30 minutes. When I turn them back on they automatically pair to each other. I have some different speakers I wish did this. Haven’t tested waterproof feature yet but in their location will expect they may be hit with rain. Using with variety of music and jazz comes through nice and clear. Like small size and stable unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. G.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Good little speaker.",
      "text": "I use this speaker 5 days a week at work. After a month the Bluetooth auto connect stopped working. I have to go into my phone a click it to connect it (Samsung s9+).the sound is really nice, good bass at lower levels. The charge on it is weird some times. I can plug it in for 4-5 hours and not get a full charge. Some time it full charges in an hour.i use a Anker wall charger and USB cable. Good speaker for the price. I really beat the hell out of speakers at work. 8 foot drops, maxed out sound for 8 hours. Not normal ware a tare.",
      "rating": 3.0,
      "verified": true,
      "author": "David G",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "So far so good!",
      "text": "I had the original Soundcore and loved it. Left it at the gym like a fool by accident. Saw this new/updated version on sale one day. Thought I’d give it a shot. Not disappointed in the least. Sounds louder, and definitely looks more durable with more water resistance in mind. Can get loud enough to hear over giant generators in field environments. I played several movies from my laptop in a week with the speaker connected and set to max volume. Only decided to charge at the end of the week to be on the safe side so it’s possible it would have lasted longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Does not Pair/Sync with Macbook OK",
      "text": "I guess it sounds OK for a cheap Bluetooth speaker, and it pairs with the iPhone just fine. But it would not pair with the Macbook which is the main reason I got it - small work speaker. I went through all the steps as outlined in their software update - and I guess maybe it's the Mojave OS update - but it will never initiate the software, just keeps saying plug in USB device. So, whatever, for this price point - I don't have the time or want the frustration of it all, when it won't just simply connect. Maybe I'll try again in the future.",
      "rating": 3.0,
      "verified": true,
      "author": "G. Rieger",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Great product but sound gets bad after a while",
      "text": "It has great sound. I was able to have a kids party for 30 kids plus adults nicely entertained. Great battery life. Unfortunately after couple months of using, I noticed static coming out of the speaker at times. Thought perhaps running out of battery. Tried charging. It still happens. iPad is at close proximity (right next to speaker). That's not the issue, either. It happens sporadically. Speaker still works but I hope we wouldn't have this staticy noise at times. Otherwise, it's a great product. Great sound. Great quality. Great battery life. With the exception of occasional static noises..",
      "rating": 3.0,
      "verified": true,
      "author": "TK",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Bumping everywhere you go.",
      "text": "This is my second anker soundcore, and I love the improvements on the 2nd version. I'm a audio enthusiast, and love sound quality. I had the first version which is sold to my brother and always wished I hadn't sold it. So when I had enough money I didn't hesitate to purchase this one. The curved edges and rubber cover (for aux & USB) are my favorite improvements on the second version. Anker has become one of my favorite tech companies, because you can't fake quality. The great engineering and quality is there, and I look forward to any new gadgets and tech they come out with. Thank you Anker",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew O'hearn",
      "helpful_votes": 2,
      "publication_date": 20170701
    },
    {
      "title": "Very happy with this speaker",
      "text": "Very happy with this speaker. Daily use over the past year. It gets pretty wet from steam when I put it on ledge over shower door. No issues at all. Fantastic battery life! Nicely sealed cover over connection ports. Four stars for sound quality when compared to my friend's 5-star $200 Bose equivalent. I mostly listen to podcasts and YouTube but it sounds great. Went through 2 cheapies from Wally that lasted only weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas R. Terrien",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great little speaker",
      "text": "I've run through what seems like a dozen portable bluetooth speakers—from Bose to Amazon Basics. While Bose wins on overall sound quality, this Anker speaker runs a close second for a tenth the price. In terms of value, the Anker is tough to beat. Its size can be deceptive. I've had much bigger, and pricier, speakers that couldn't touch the bass response of the Anker. All things considered, Anker seems to have the best value out there at the moment.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Nace",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Terrible Bluetooth connectivity",
      "text": "The Bluetooth connectivity is so utterly terrible that I have to return the speaker. I play music through the speaker via my iPhone XS. In order for the songs to play without issue, I have to leave my phone right in front of the speaker which is extremely inconvenient and frustrating. I bought this during a lightning deal and really hate I have to return it but I’ll pay more for a speaker with better Bluetooth connectivity. I had high hopes for this speaker but the longer I keep it, the worse the connectivity becomes every time I use it.",
      "rating": 2.0,
      "verified": true,
      "author": "mspinkberry08",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Good little sound, slightly confusing pairing",
      "text": "I used this for an 'out door theater' setup. I paired two of them together and paired that set to a projector. Sound quality was pretty good for an outdoor space. The bluetooth pairing was a little confusing - I struggled to get the two to pair together first. After that, it seems to be ok. They seem well build and the rubbery outside makes me think it can take a least a little abuse. Battery life seems good so far - I used it for about 2 hours one night, forgot to charge them, and used them for a couple more hours another night with no issue.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Jones",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "If sound quality is not a priority, then why even try.",
      "text": "This speaker was $40 and all I can say is that it played music. No real bass and mediocre clarity. With how good the speakers are on my S10 and the new iphones, I might as well be just listening to music straight off of those. If you are interested in sound quality, get something more expensive. If you are not interested in sound quality, get something cheaper and louder. I ended up picking up some Sony speakers from costco for $90 and they are excellent. These got returned. Why bother with middle of the road when it comes to speakers.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "A little muffled but otherwise a great speaker",
      "text": "I like the size and portability this speaker offers. It's easy to sync and the charger is the same as a standard android charger. (Which is great because I accidentally threw away the charger it came with when I tossed the box.) The one thing I don't like is that it's such a deep sound that it almost sounds muffled. It does get loud enough for me to listen while in the shower, and it's excellent for watching movies on my phone. If you're using it primarily for podcasts or audiobooks, maybe go for something different.",
      "rating": 4.0,
      "verified": true,
      "author": "AshleyA",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Compare to the Cambridge Soundworks",
      "text": "Great product. I had also read other reviews comparing this to the Cambridge Soundworks Oontz. Others had said this speaker had better sound than the Oontz. I have both products at home and both are great. However, the Cambridge Soundworks has a fuller, slightly deeper sound with more bass. If I had to choose between the two speakers, the Anker speaker would come in second place. HOWEVER, both are great speakers for a great price, but this would be my second choice.",
      "rating": 4.0,
      "verified": true,
      "author": "A. J. Mathison",
      "helpful_votes": 3,
      "publication_date": 20180117
    },
    {
      "title": "Good sound, BUT bluetooth has difficulty juggling multiple devices over time",
      "text": "Sound quality is excellent for a speaker this size. At this price it would get five stars for sound quality. However, it has been giving us problems from the get-go in connecting with multiple devices. Once it has paired with device 1 (my iPhone); it refuses to be unpaired and then connected with device 2 (another iPhone). I researched and found that many others have complained about this item's bluetooth incompatibility with multiple devices, and that Anker has acknowledged this issue with the SoundCore 2. Unfortunately, due to this design problem, I am going to have to return the item.",
      "rating": 3.0,
      "verified": true,
      "author": "Hodeo",
      "helpful_votes": 3,
      "publication_date": 20180202
    },
    {
      "title": "Lay it on its Back!",
      "text": "This speaker is smaller than I expected but it packs pretty big sound. Of course, you're not going to get close to the audio quality of a $100 speaker but, I found the bass response is quite impressive if I lay the speaker on its back. Sitting on it's back on a table on the deck, the full bass spectrum can be discerned from at least 12 feet away and can be felt through the entire deck. That said, the overall tone is just a little muddy sounding; the treble is lacking just slightly. I've listened to this speaker so far, for about 8-10 hours over about a week and I only charged it once after receiving the speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "smp",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "What a prize!",
      "text": "Loud, Clear, small, room filling sound. I LOVE this speaker! Pair via Bluetooth to my phone and multiple tablets. I play PANDORA music all day without even thinking of recharging the speaker. I have to lock it up in my office at night for fear of sticky fingers borrowing? it. Just buy the thing, don't hesitate, buy it NOW.",
      "rating": 5.0,
      "verified": true,
      "author": "Old but hip",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Tiny sound, no bass, even my iphone's speakers are louder.",
      "text": "What I like: it is a nice small package and a nice rubbery texture. What I do NOT like: pretty much everything else. The sound is tiny. My iphone alone sounds louder. Also: no bass whatsoever. I understand this is a small speaker, but hey... they say it has \"bassup\", whatever that jargon means, it certainly does not mean the bass is powerful. I am so glad Amazon has free returns, because this is going back. Also: this is a minus for me for all Anker products, don't oversell your stuff. Not touching another Anker product for a while now.",
      "rating": 2.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Find a good location for the best bass. Run your equalizer on your iPhone to flat. Rock on.",
      "text": "I thought this was a good value for the money. It's very important to find a good location for this speaker. It needs this for good bass. The 24 hour battery life is a little overrated. If playing speaker at higher volumes the battery life is more like 16-18 hours or a little less. But as a portable good sounding speaker it has found its niche. I use this more than my Bose sound link, because the battery last twice as long and is more portable. So I recommend the soundcore 2.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike M.",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great Quality and Great Price",
      "text": "We love this little speaker, for the size and the price I am very impressed by the quality. Sound is great and can be heard over the full length of our yard, about 300 feet. We use it indoors and outdoors and don't have to worry about forgetting it outside overnight. We have had it next the the hot tub and the steam doesn't bother it at all. I do like the fact that you can get a couple and then sync them together to get a more rounded sound. We like most likely do this for for our living room for surround sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Natasha",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Small but mighty",
      "text": "Wow...... I am impressed. Wow. This little guy packs a punch for what you are getting. Audio is crisp and sound great! Bass is a little flat and that is understandable due to the size of the speaker, but still, not bad for what you are getting. The build material is nice and feels rugged enough to take it anywhere and the 24hr battery life is nice. Uses micro usb, but would prefer usb c, but not a bad thing and has an aux port. Definitely recommend to have a portable speaker for trips or going out to the beach. Very impressed with this speaker",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel B.",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "W/ 2 speakers - NOT so good syncing.",
      "text": "I tried 3 various brands - Sony, Yotto & this, and ALL 3 has some serious issues syncing betwn 2 speakers. Syncing w/ phone A+, not a problem, but betwn 2, i think all of em' just needs to rework the software & wiring b/c sound betwn 2 is intermittent & i think they get confused which should sync w/ phone. And it's not distance, i only had 2 speakers less than 10ft apart. SOOooo disappointed, now i just have resort to buyn 1 w/ 20watts or more. For me, I need speakers w/ more than 10w. Note- all 3 brands have all pretty good sound quality, when they play smoothly.",
      "rating": 3.0,
      "verified": true,
      "author": "Rewa",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Great speaker, great support",
      "text": "Fantastic speaker, especially for the price. Punchy low end and decent mids/highs. Love that I can use Siri. The big buttons are nice when it's poolside and my hands are wet. The first speaker I received had the same issue that some other reviewers have mentioned where the volume would increase/decrease depending on the volume of the music. It was very annoying. I contacted Anker support and they immediately sent a replacement which works perfectly. I'm very impressed with Anker support and will have no hesitation purchasing their products in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Candace H",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Great company to work with",
      "text": "My son got this speaker for Christmas. The sound was AMAZING for the first few hours, but then one of the speakers blew. We didn't have it up right enough for this to happen. Our excitement turned to sadness. The next day I contacted customer support via email to let them know that there was a problem. Withing hours someone had responded to me. After going through the process of verification of the issue, it was decided that the product was infact something of an issue and they replaced the speaker freenof charge. I am happy to say that the replacement is working GREAT. We can turn it up now with no problems and the quality is stellar.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle Crowther",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "It keeps failing to die",
      "text": "Over two years old, lots of drops and spills. I use it in the shower to listen to audiobooks while I am getting ready. Steam is supposed to be much harsher than just water on things like this, so I am fairly impressed. Loud enough that I can actually hear it over whatever is going. I had another waterproof speaker that lasted eight months, that was in the same price range. No where near as loud, shorter battery life, never wanted to pair with my phone/tablet. Especially for the price, I recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "High quality product.",
      "text": "Here's what I like about this product: Sound quality: Very good,no crackling or popping at higher volumes. Battery life: Very good,I have only charged this thing twice since I have had it. Material quality: Very good,very sturdy material. It's mostly rubber skin helps it be non slip on many surfaces. Sound loudness: Very good. I can hear this from my bathroom while both the shower and dryer are going. If this doesn't tell you how good of a product it is I don't know what to tell you other than to try it yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "David m.",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Hubby loves it.",
      "text": "I got this for my husband and now he carries it around the apartment with him. It's great for in the bathroom while he's taking a shower or in the kitchen while he's cooking. It's nice and loud and perfectly portable. We haven't had any issues with the lifespan of the charge so far. The sound is what you would expect from a portable speaker. Not crackly and terrible or tinny, but not absolutely amazing either. We do appreciate how loud it can get though. Honestly, it gets the job done and we are pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Mercedes M.",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Sound Quality No Good",
      "text": "This review is mainly for sound quality. The item looks great but the bass quality is very poor. You cannot hear it. This was a Christmas gift and my teen was happy to receive it... until he put some music on as we all agreed that it sounded dull. What a disappointment. Bought for the great reviews but obviously not everyone has the same war for high quality sound. Will be returning this.",
      "rating": 1.0,
      "verified": true,
      "author": "LB2309Z",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "THIS THING ROCKS!",
      "text": "This Anker Soundcore 2 is the most durable, high quality, aesthetically pleasing and sounding bluetooth portable speaker I have ever owned! I've spent HUNDREDS on portable Bluetooth speakers and this one is the one. The battery life is amazing. It's very portable, doesn't vibrate around like other cheaper ones. Extremely nice and smooth mid and high notes with slightly deminished bass but you can expect that with it not having a dedicated bass speaker. It still sounds extremely balanced and puts out beautiful sound!",
      "rating": 5.0,
      "verified": true,
      "author": "Calvin",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Solid Portable Bluetooth Speaker",
      "text": "I was in the market for a bluetooth speaker and was looking at JBL due to the form factor, name and the weatherproof rating. I decided to see if I could get something that would meet all my needs and be a bit more budget friendly. I stumbled upon Ankers Soundcore 2 and decided to purchase, and I have not been disappointed. It is very loud, has decent bass for its size and feels well built and solid. It’s not heavy and can fit in a side pocket for a back pack. I am very satisfied with this speaker and will continue to support Anker’s quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "James Z Langill",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "UPDATE. From five star to one. Back to five",
      "text": "UPDATED UPDATE: They contacted me and made it right. God, I love it when companies stand by their product. UPDATE: I have probably used this thing a grand total of ten times and it has never left my nightstand. The left speaker is blown and has a terrible crunchy scratchy sound at anything above fifty percent volume. It's really terribly sad. I was very excited about this speaker and it's predecessor (which is still going strong). Original 5 star review: This thing is just such a great value. I had the original (probably a better value if you're gonna keep it indoors) and bought this for the water toightness. It's toight.",
      "rating": 5.0,
      "verified": true,
      "author": "Augustus",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "and loved it. After having it a few weeks",
      "text": "I originally purchased this in July 2017, and loved it. After having it a few weeks, the volume started waving in and out, up and down and it wasn't that the bluetooth connection was too far or something. Luckily, around the same time, a customer service rep reached out to check on my satisfaction with the order. I told them I enjoyed it expect for that one little thing and they sent me a return label, and a new device promptly. I've had my new one about a month and it works swimmingly. The charge lasts a long time, the volume and sound quality is stellar, easy to connect, easy to use. I am one happy camper.",
      "rating": 5.0,
      "verified": true,
      "author": "Janna J.",
      "helpful_votes": 2,
      "publication_date": 20171004
    },
    {
      "title": "Amazing sound for an amazing price.",
      "text": "This little guy has been out with me on jobs for about a month. I love the battery life on this thing, it lasts forever. Bluetooth connection is strong, I've yet to loose connection. Audio is of excellent quality, no distortion. That being said, this certainly isn't the loudest speaker, but to me that's a good thing. Just buy this little guy, you won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dagoberto Ruiz",
      "helpful_votes": 0,
      "publication_date": 20190131
    }
  ],
  "product_meta": {
    "title": "Anker Soundcore 2 Portable Bluetooth Speaker with 12W Stereo Sound, Bluetooth 5, Bassup, IPX7 Waterproof, 24-Hour Playtime, Wireless Stereo Pairing, Speaker for Home, Outdoors, Travel",
    "description": "Color:BlackSoundCore 2 \nModel number: A3105\nThe Bluetooth Speaker with Enhanced Sound and Playtime.\n\nFrom ANKER, the Choice of 20 Million+ Happy Users\n• Industry-Leading Technology.\n• Worry-Free Warranty.\n\nAwesome Audio \nSoundCore 2 produces outstanding audio from an astonishingly compact speaker (165mm*54mm*45mm). Upgraded 2x 6W drivers blast out rich, clear sound.\n\nBrilliant Bass \nBring your music to life with proprietary Anker BassUp technology. Deeper bass ensures a wide, balanced audio range.\n\nPlay All Day \n24h-hour / 500-song playtime means you can listen all day, and all night too.\nNote: Playtime varies according to volume and audio content. \n\nAudio On-The-Go \nIPX7 water-resistant rating and dustproof engineering mean you can bring your beats anywhere - from the garden, to the beach, to the shower. Upgraded materials provide smooth touch, and better grip. \n\nWireless Stereo Pairing \nGrab two SoundCore 2* and pair them together via a single device to turn up the volume and enjoy big stereo sound.\n\nStreamlined Connectivity \nListen for up to 66ft with latest Bluetooth 4.2 technology, while an in-built microphone makes hands-free calling a breeze. No Bluetooth? No problem, an aux port allows you to plug in and play.\n\nWorry-Free Warranty \nAt Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.",
    "rating": 4.6,
    "feature_bullets": [
      "Unbelievable sound: 12W of pure audio power with enhanced bass Thunders from dual neodymium drivers. An advanced digital signal processor ensures pounding bass and zero distortion at any volume.",
      "Intense bass: exclusive bass up technology and a patented spiral bass port boost low-end frequencies to make the beats hit even harder.",
      "Outdoor-proof: IPX7 protection safeguards against rain, dust, snow, and spills. Get incredible sound at home, in the yard, or anywhere else imaginable.",
      "24H Non-Stop Music: Anker’s world-renowned power management technology and a 5,200mAh Li-ion battery deliver a full day of sublime sound.",
      "Grab, go, Listen: classic design that has been refined and lightened, with effortlessly simple controls."
    ],
    "specifications": {
      "Product Dimensions": "6.5 x 2.2 x 1.8 inches",
      "Item Weight": "12.6 ounces",
      "ASIN": "B01MTB55WH",
      "Item model number": "AK-A3105014",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.6 out of 5 stars26,250 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#7 in Portable Bluetooth Speakers#111 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Wireless communication technologies": "Bluetooth",
      "Connectivity technologies": "Wireless, Bluetooth",
      "Additional Features": "Waterproof, Smartphone-Charging, Ultra-Portable",
      "Other display features": "Speakers",
      "Colour": "Black",
      "Included Components": "Speaker",
      "Manufacturer": "Anker",
      "Date First Available": "January 15, 2017"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": 39.99
  }
}