{
  "website_summaries": [
    {
      "verdict": "At a lower cost and the same large capacity as some other models, this pitcher stands out for filtering as it streams, thus taking up less space.",
      "pros": [
        "Consumers report that this makes great-tasting water and has excellent filtration",
        "Its large size and convenient electronic filter change reminder are other stand-out features that we love",
        "BPA-free"
      ],
      "cons": [
        "Tends to have a slow pour, which aggravates some users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Slowest pour on earth.",
      "text": "Sooooo disappointed in this!!! The pour is a trickle. No flow at all! I’ve tried to adjust, re-rinse, etc but I can only get a decent flow (still not the best) when it’s full. The most frustrating thing ever for a full glass it takes about a full minute. I use a large 52oz cup for my water in the house and my arm nearly falls off from having to hold it so long. I love Brita normally and was so excited about the filter as I pour capability but I definitely do not recommend this and am sending it back. I",
      "rating": 1.0,
      "verified": true,
      "author": "Kharma",
      "helpful_votes": 151,
      "publication_date": 20190227
    },
    {
      "title": "Great job",
      "text": "Pro: filter great and it good for on the go people Con:slow pour when water is low It best to get your faucet water tested before buying any filter so you know what stuff is in your water so you can choose the right filter. For me my water has chlorine , this filter did a great job. If you need little more filtering then go with the regular modal.",
      "rating": 5.0,
      "verified": true,
      "author": "The Gamer King",
      "helpful_votes": 123,
      "publication_date": 20170216
    },
    {
      "title": "Slowest Filter I've Ever Used",
      "text": "This is the first review I've ever posted. I should have read the other reviews before purchasing but I've had this for just under 2 months and the water comes out in a trickle - not even a full stream. The filter says its at 100% and doesn't need to be replaced. I wish I still had my old filter.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily K Patton",
      "helpful_votes": 53,
      "publication_date": 20170511
    },
    {
      "title": "Not worth it...",
      "text": "Wonderful idea to be able to have \"instant\" water but when it takes FOREVER to pour out that certainly is not a compromise! If I had not thrown the box away I would have returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda S.",
      "helpful_votes": 21,
      "publication_date": 20170722
    },
    {
      "title": "Pours out painfully slow",
      "text": "This brita has a gorgeous design but it was advertised as fast. While its much faster to refill it is extremely slow where it matters. Pouring a glass of water, coffeepot has turned into a painfully slow carpal tunnel inducing process.",
      "rating": 1.0,
      "verified": true,
      "author": "michanne quinney",
      "helpful_votes": 11,
      "publication_date": 20181220
    },
    {
      "title": "Save your money, don't buy this crud.",
      "text": "Finally got a chance to set up this Brita filter pitcher. Tiny, tiny trickle of filtered water coming out; and if you are not careful, the whole top falls off. What a piece of junk! I'm soooo annoyed and sad.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Stark",
      "helpful_votes": 24,
      "publication_date": 20170611
    },
    {
      "title": "Use less plastic JULY perfect way to save $",
      "text": "I couldn’t be happier about this lifestyle change. Not Only after researching the benefits for your own health and of course the environment. I will save a ton of money! Saves a ton of room in my very small fridge. Therefore making more room for groceries. Great price. Easy to use and love that it notifies you when filter needs to be changed. The amount of plastic i will no longer use is a huge bonus. July use less plastic challenge. What ru doing to contribute? Follow me on instagram to see all the other lifestyle changes I been making @_whitbayes",
      "rating": 5.0,
      "verified": true,
      "author": "JoJo-Lamont",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Confused but now corrected",
      "text": "I wrote that i could not remove the inside portion of this pitcher but I got a great tip yesterday and applied the info. I can remove it by emptying it fully then pushing the the latch at top of the handle. That's great but I still prefer the other Brita because of the slow pouring feature. someone said the longer used the faster the pouring. It's never improved in 6 months of using. I guess it filters well I just prefer the original deskgn.",
      "rating": 1.0,
      "verified": true,
      "author": "SMBofTexas",
      "helpful_votes": 4,
      "publication_date": 20180503
    },
    {
      "title": "A little disappointing",
      "text": "I like the idea of being able to fill up the whole container with unfiltered water and filtering as you fill up the glass. I was super excited to have this over my last model brita pitcher for the fact that I thought that it’d would shave off the time of having to wait for all the water to filter through into the bottom part, but only to realize that once this pitcher gets more towards the bottom of being empty, the water dribbles out like an old man pissing out a kidney stone. It literally takes forever to fill up a cup of water so not really that much more efficient.",
      "rating": 3.0,
      "verified": true,
      "author": "MileHigh303",
      "helpful_votes": 5,
      "publication_date": 20170705
    },
    {
      "title": "Not a good Brita product",
      "text": "I expected a better engineered product from Brita. Since the filter must always be partially submerged, the carafe itself must be kept almost full to do so. In so doing, the carafe itself is always heavy and not easy to pour; I suggest that the carafe itself could be smaller and thus easier, and less heavy, to use. Since water is being filtered as it pours, the rate of flow is quite slow when pouring. The taste of the filtered water is quite good...crisp and fresh. Initial assembly of this product should be easier and the instructions more specific as to installing the filter in its cage.",
      "rating": 2.0,
      "verified": true,
      "author": "L. Scara",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Better design than the older versions",
      "text": "We were a little skeptical at first — it filters as you pie instead of filtering into a well. But it’s been great! I actually like it more now than I did the old one. And the slim design allows us to keep it in the fridge without taking up a ton of space. Just make sure you get the right filters for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Logan H.",
      "helpful_votes": 3,
      "publication_date": 20181118
    },
    {
      "title": "***CAUTION***NO FILTER",
      "text": "I ordered the Brita Stream under the impression that the Brita Stream came with one filter (based on the image on the product page). However, I also ordered a package of 3 filters for the Brita Stream at the same time (and on the same order). The Brita Stream arrived as a separate package; ***CAUTION ***the Brita Stream does not include a filter. The package of 3 filters ordered at the same time (and on the same order) of the Brita Stream have not arrived and have not even been shipped yet. So, I have a Brita Stream without any filters. This has been a disappointing experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Szabo",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "This is a good size and the color is nice",
      "text": "I like the shape of this Britta. A little more in the tank makes it pour quicker and faster, though I have to hold my left hand under the spout when it's full. I also like this flow type better than the older models where the water has to drip through the filter before you can pour. We now have 2 of these (one smaller and now this larger size) mainly to filter out the chlorination of tap water. You can smell and taste the difference immediately. The filter lasts for about 2 months normal use for us. Very satisfied and can recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "shoppersusy",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "I love this",
      "text": "My husband got me this for my birthday in August. I’m very picky with water, and hated the water in our house so I’d go through many plastic water bottles. He got me this and I tried it out and fell in love with the water! It’s honestly one of my favorites. And yes, I’m one of those people who know water tastes different. So, picky me, absolutely loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carli Quigley",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Should have paid attention to the reviews. Don't purchase ...",
      "text": "Should have paid attention to the reviews. Don't purchase this. It is very slow and almost stops flowing for the last have of the volume left in the pitcher. Also, it only filters out chlorine. (My fault on this one. Should have done more research). The filters are expensive, don't filter out contaminates and extremely slow. I'm going back to my old Brita that I've had for over 20 years",
      "rating": 1.0,
      "verified": true,
      "author": "William J. Meyer",
      "helpful_votes": 4,
      "publication_date": 20180119
    },
    {
      "title": "I love this Brita!",
      "text": "This Brita was a great investment. For the past 4-5 years, I've used the regular Brita that only held about 4-5 cups of water that filters when you fill it. This one works so much better for my lifestyle because it filters as you pour, so you don't have to wait for it to filter to get your water. The water you get also tastes pretty good. It's made my mornings a lot faster. Plus the 12-cup capacity is great! I can refill two water bottles, plus get my morning coffee going before refilling it. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Clare Sevcik",
      "helpful_votes": 3,
      "publication_date": 20181029
    },
    {
      "title": "Better then the old model",
      "text": "We have really bad tap water so not sure if I'm being fair taste wise. Our last one of this style broke when I knocked it on the tile kitchen floor. I find a replacement, guess it was discontinued. This new design is admittedly better. I bought it begrudgingly. But I have to admit it take up less counters space, holds more and is easier to pour. $10 more then what I paid for my original, but definitely an upgrade.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Better than fill and wait styles",
      "text": "I measured it - takes about 11 sec to fill a normal pint beer glass. I could see for the people with limited arm strength it could get cumbersome but eh. Id rather take a few seconds to fully fill the pitcher outa the sink than waiting forever for it to drain thru the other way around.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrguy",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Disappointing",
      "text": "I had high hopes. I was tired of my.other pitcher taking up so much room in the refrigerator. I love the color, blue. Problem, it pours water out very slow. I can understand, as it has to filter to properly. The worst is the amount left in the bottom of the pitcher, never even filtered. I plan on pouring a pitcher into a glass container, and leave to chill overnight. This way I will have enough to start the day.",
      "rating": 3.0,
      "verified": true,
      "author": "Susan Cecere",
      "helpful_votes": 3,
      "publication_date": 20170725
    },
    {
      "title": "This pitcher is a great evolution from the other carbon filter Brita model.",
      "text": "I purchased this pitcher to replace my old Brita pitcher which has the center mounted carbon filter. Unlike that one, this leaves no tiny black grains of carbon in the bottom, and there is no large unused chamber above the filter. This one filters as you pour, and the stram is more than efficient, if not like a tap.There is an LED indicator which tells you when to change the filter. The best thing is that it fits inside the door shelves of most refrigerators, leaving the main trays inside the fridge free for large stuff. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "George Bullock",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Quick fill....SLOW POUR!",
      "text": "I purchased this because the red caught my eye and I liked the idea that it filters immediately. Well, I don't know if we got a defective model or something but the amount of time it takes to pour a glass of water is ridiculous! We have 4 water drinkers, plus we use it to fill the kuerig machine and filling anything is getting frustrating. It sounds silly and trivial to complain about, until your arm actually hurts from holding this thing while trying to fill your giant water bottle. I called Brita and I'm waiting on a replacement. I'm hoping it works better, or else 2 pitchers will end up in the garbage.",
      "rating": 3.0,
      "verified": true,
      "author": "Nan",
      "helpful_votes": 3,
      "publication_date": 20170725
    },
    {
      "title": "It’s OK But Not Great",
      "text": "The pitcher works on a basic level but there are problems that make it less user-friendly. One, the spout keeps the pour to a narrow stream so don’t plan on filling anything quickly. It’s annoying to find filling the kettle with this pitcher takes twice as long as with other pitchers. Second, you can’t get the last inch or so of water to pour out so you’re dealing with this unfresh water mixing with fresh water every time you fill. I am keeping it because I just don’t feel up to the hassle of returning it and searching for a new one.",
      "rating": 3.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Not the quickest pour but...",
      "text": "I bought this because my room is really far from the kitchen and I got tired of having to walk up and down flights of stairs to keep filling my water bottle. Now I can fill this pitcher once every couple of days. It also makes the tap water taste notably better. I haven't had any issues with leaking and it's a breeze to clean. I've only had it a couple months so I don't know how it'll hold up over time. For now I'm happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Loribelle",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Big fans of the Brita Stream",
      "text": "I love this little pitcher. We originally had a big, bulky box dispenser that sat on a shelf in the fridge. It worked well and dispensed water fast but it was cumbersome to fill and it took a while for the water to move through the filter into the bottom of the container for pouring. This Stream pitcher is smaller and easier to handle. We can pour water in and use it immediately which is nice when we are running out the door and forgot to fill a water bottle. The pour is a little slow but it is still much faster than our other unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Momzilla",
      "helpful_votes": 2,
      "publication_date": 20170616
    },
    {
      "title": "Wonderful pitcher; doesn't pour slowly",
      "text": "I got this for my husband and he loves it and so do I! Other reviews said that it poured slowly, but I don't see that it pours any slower than the regular Britas. We have owned Britas for many, many years and this pitcher is the top! Would definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Brooks",
      "helpful_votes": 3,
      "publication_date": 20180717
    },
    {
      "title": "Great tasting water",
      "text": "This product provides great tasting water. It filters the water very quickly, it has a nice design, cleans easily and comes with a built-in filter tester. The only draw back is the filter doesn't do a very good job of removing suspended solids. I recommend using a zero water system first and then filling the Brita pitcher for great clean tasting water.",
      "rating": 4.0,
      "verified": true,
      "author": "supermex",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Pours SO slowly",
      "text": "It's a very nice looking water container, however, you have to hold the container up while the water filters, and a tiny little stream of water comes out. Your arm gets tired before your cup is full. Very poor design. Wish I could return and get something else. My son can't even hold the jug up long enough to pour himself a little cup of water. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Tweet ",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Filter while you pour",
      "text": "I really like this Brita pitcher, which I believe is a relatively new addition to the outstanding line of Brita products. It’s designed so that the water is filtered as it’s poured, rather than filtering the entire pitcher at once. I’ve always been happy with Brita filtration, and the only reason I HAD to buy this was because I stepped on its predecessor and broke it, but I’m delighted I had the opportunity to try out this new product. And, I personally love the turquoise, and am glad to see the variety of colors. Definitely a winner from Brita.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Kaplan",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "not worth the money.",
      "text": "i'm not really sure about the effectiveness of this product. first the price is very expensive. the water taste isn't any better than the tap water. when is used this water to make coffee, i still get hard water residue in my coffee make, which tell that this thing is not as effect as they advertise. Better of buy bottle water or get water refill at local store. i won't buy any refill or pitcher again.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Disappointed",
      "text": "Texas tap water is absolutely horrendous! I hate the taste! I purchased this Brita pitcher hoping it would purify the water enough to eliminate some of the chemical taste, but I guess Texas water is too strong. The taste is slightly better, but not enough to stop me from purchasing spring water. I’m disappointed, I was hoping to save wasting plastic, too.",
      "rating": 3.0,
      "verified": true,
      "author": "HouTXGuy",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Just wish this was \"Essential\" and didn't take 2 weeks to ship",
      "text": "Excellent product, works great and saves a ton of plastic from the bottles I was previously buying. My apartment water is absolutely awful, so drinking straight from the faucet is a no-go. my current apartment complex doesn't have a recycling station like some others I've lived at in the past, and I was really looking for a way to reduce the waste.",
      "rating": 5.0,
      "verified": true,
      "author": "SJoyner",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Works Well",
      "text": "I have no complaints whatsoever about this item. It works well and was very easy to set up. I fill it a couple times a day and have found it to remove the taste that the tap water has coming out of the refrigerator. It does what I hoped it would do, and is low maintenance. The only thing I would point out is that it is quite heavy when full, and you have to hold it to to pour it for quite a while. It pours slowly, especially toward the end of a pitcher.",
      "rating": 5.0,
      "verified": true,
      "author": "Rupert Pupkin",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Highly Recommend",
      "text": "We simply Love this pitcher! It's the best design, by far, that I have owned. You don't have to wait for the water to filter down, instead, the water flows through the filter as you pour a glass. There is even an indicator to let you know when to replace the filter. Great design with large capacity. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy L Smith",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "So conflicted, I bought this because half the battle ...",
      "text": "So conflicted, I bought this because half the battle is getting my significant other, my partner in life, to refill the pitcher! His argument was that the previous Brita pitcher was taking too long to refill/filter. Enter this thing. Whyyy does it seem to filter faster when 3/4 or more full?! I don't know, but it drives me nuts and I'm on the fence about keeping the old pitcher because I'm basically in the same boat as before. But this one's lid doesn't fall off which is real nice",
      "rating": 3.0,
      "verified": true,
      "author": "Brit",
      "helpful_votes": 2,
      "publication_date": 20170810
    },
    {
      "title": "Filters water fairly fast",
      "text": "Although you can't expect it to pour out of water like stream, I have to admit that it filters water much faster than the traditional Britta. But after about three months of using it, the spring mechanism on the lid seems to be a little bit janky. I often have to use my finger to pry the lid open",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Easier to Clean and More Compact, Slower Pour Than Traditional Brita Pitcher",
      "text": "This pitcher basically performs as expected. The only two call outs to note in comparison the traditional Brita pitchers. 1. Pitcher fills faster and water is ready to go 2. Water pours into the glass from the pitcher slower So pick your poison! I prefer this pitcher, and it is slightly more compact and easier to clean. But my husband hates waiting for it to pour!",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "I want my money back.",
      "text": "This product is terrible. 1. Like others have commented, it pours at snails pace when it is less than halfway full. 2. You can’t find replacement filters ANYWHERE. Idk if they’re even in production. What good is a water filter if it only works for 2 months? I didn’t need to pay this much for a filter I can’t even use now.",
      "rating": 1.0,
      "verified": true,
      "author": "CeeCee",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "disappoint",
      "text": "I've been using Brita many years, including the stander and faucet. My stander pitcher is old, so I bought this new one. I thought this maybe better than the old style. Unfortunately, when I boil the water, there are many white mineral precipitation every time. I am not sure if I can still use it.",
      "rating": 2.0,
      "verified": true,
      "author": "Pei-Hsun W.",
      "helpful_votes": 2,
      "publication_date": 20191030
    },
    {
      "title": "Don't fall a sleep!",
      "text": "While you refill the pitcher very fast as any other pitchers, the filling of a cup takes forever since the water goes through the filter while pouring. So, I personally prefer the classic Brita pitcher where I wait longer to fill te pitcher but don't fall a sleep while pouring water. Filling the classic pitcher does not require active effort since you fill the top reservoir and then just wait. This kind of pitcher requires you to hold it forever to pour water out.",
      "rating": 2.0,
      "verified": true,
      "author": "Cooper",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "I love that the size is a lot smaller than the ...",
      "text": "I love that the size is a lot smaller than the previous 10 cup filter. That being said, this model pours so slowly, it's awful. I suppose it's just a tradeoff - would you rather wait for all the water to filter at once, or wait for every glass you pour? Unfortunately, I have discovered that I prefer to wait ONCE and store the rest of the water in the fridge where it will be ready again whenever I need it, instead of having to wait every time I want a glass.",
      "rating": 1.0,
      "verified": true,
      "author": "gabriela Varley",
      "helpful_votes": 17,
      "publication_date": 20170411
    },
    {
      "title": "Slow stream and defect on main seal",
      "text": "Sadly this product came with a defect. It was leaking right underneath the spout. So my clean water was getting contaminated by these deops as I served the water. Customer service was prompt to send me a refund. One thing about the stream is that one has to be patient when pouring the water, it is a slow process.",
      "rating": 2.0,
      "verified": true,
      "author": "Jahhee",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Did not include filter even though the package states it's supposed to come with one",
      "text": "Amazon sent me a pitcher with no filter. I may as well drink straight from the tap. The whole point of the product is to filter tap water, and in order to do that you need a filter, which this did not come with. On the packaging, it states that a filter is included, but it wasn't.",
      "rating": 1.0,
      "verified": true,
      "author": "MountainManGuy",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Great Product",
      "text": "Simplicity in action best describes my Brita 12. I’m now a convert to filtered water. Good bye Poland Springs! Update: using it for several months now and still with the original filter, like the Eveready bunny keeps on running. Nice job Brita!",
      "rating": 5.0,
      "verified": true,
      "author": "BJS",
      "helpful_votes": 2,
      "publication_date": 20180709
    },
    {
      "title": "BUY IT",
      "text": "Purchased this since my “old style” is SO SLOW and doesn’t hold a ton of water at once. I’m in love! The stream that pours out is fast enough that I’m not annoyed by the filtering time (like my old style..). If you’re wondering if it’s worth $$$ BUY IT IT IS AWESOME!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse P.",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Disappointed",
      "text": "I was very disappointed that I could not use this product right away. I was under the impression that it came with the filter. It even states so on the directions. However, it does not. I had to order it and more bottled water for three more weeks until I receive the filters. The color is nice and the directions seem quite simple. However, it should state \"filter not included.\"",
      "rating": 1.0,
      "verified": true,
      "author": "S James",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Useless",
      "text": "I bought this product thinking it would do the job it needed to while also in a “stream “ manner. It does stream out faster than a normal filter however I did get another product around the same price that came with a water tester and the water from the bruta tested 171 the other filter cane out 000, this filter also says don’t use water above 006. I disconnected use after about two weeks of having it. Not worth me or my families health.",
      "rating": 1.0,
      "verified": true,
      "author": "Villa",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "I'm impressed",
      "text": "I really thought this was all lies. I was tired of having to refill water jugs every couple of weeks so I decided to get one of these. I got home and had a cup of water and I was so surprised this thing really does filter the water it didn't taste nasty like pipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kira",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "I bought this because I don’t like the taste of the tap water where I live",
      "text": "I bought this because I don’t like the taste of the tap water where I live. The reason I chose this over the original Brita is because you don’t have to wait for the water to filter before you can start pouring, it filters as you pour. It’s true that it does pour slower, especially as the amount of water goes down. It’s not bad if you mostly keep it full, but I can see how this would be annoying if you’re pouring multiple glasses. I still think this one is better than the original Brita though.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Easy to use and fill",
      "text": "The only problem I have is that when you're done pouring with a full pitcher, a little water will dribble out so either wait for it, or clean it off the counter. I've used it daily for over a month and I'm still on 100% filter. I guess it's a slow pour (especially when the water level is low) but doesn't bother me.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane B",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Not really faster than regular Brita.",
      "text": "It sounds like a good idea to not have to wait until all the water is filtered. The first half of the water pours out a little slower, but the second half pours out very slow because it’s only going through a small area of the filter. After 2 thirds empty, you might as well fill it up again because it’s so slow. It ends up being just as slow as the regular Brit’s.",
      "rating": 3.0,
      "verified": true,
      "author": "Becka R.",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Always open spout",
      "text": "Great product. Only complaint is that the water pitcher must stay elevated especially when full. The spout does not close therefore when full and tipped water easily pours out.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashlee L.",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Great product, slower pouring than original model",
      "text": "Great product and fits a lot of water. The benefit to this style is that it fills very quickly (you don't have to wait for it to strain through the filer) and, unlike the other style, you can put ice cubes/fruit in with the water. There is one downside, hence the lost star... the filtration process is slow unless the pitcher is totally full... this means you have to hold the pitcher there for a while before you cup gets full which can be annoying and take some getting used to",
      "rating": 4.0,
      "verified": true,
      "author": "tylr00",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Very good water pitcher",
      "text": "We bought the 10 cup version of this and it was pretty good but just not big enough. This 12 cup pitcher has a better water flow out the spout than the 10 cup model. Easy to clean, super easy to fill and the filters are easy to replace",
      "rating": 5.0,
      "verified": true,
      "author": "Lab Rat",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Filter gauge never worked",
      "text": "I believe the filter gauge has never worked. It stays on 100% and never drops. I thought the first time it was just a fluke so changed the filter, but after months of having the filter in the pitcher, it’s never gone down from 100%. I have another one that works perfectly that is much older than the one I purchased- this was supposed to be a replacement for that one. It’s never worked properly so don’t know when I need to change the filter. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Marissa P",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Track filter change yourself",
      "text": "We bought this after using brita big filter for years .. i like pitcher better reason .. easy to fill from side even if your sink has extra unwashes dishes .. this design doesn’t let you wait for water to get filter is the best part .. track filter change yourself .. it counts every time you pour .. so it shows too soon to change filter",
      "rating": 5.0,
      "verified": true,
      "author": "Kk",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Just what I wanted",
      "text": "You push a button to open the lid, pour water through that hole. The lid has the precentage lights that tell you when to replace filter. The filter lasts months. It's easy to change the filter. The water in the pitcher is immediately ready to pour back out, it pours a little slow because it filters as it pours. Water tastes good through the filter.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Slow to pour, some leaking possible",
      "text": "I love the idea here, and it does hold more water than the traditional Brita pitcher. However, it is very slow to pour, especially towards the bottom half of the pitcher, and I have some leaking from the lid at the top, which appears to be due to a poor seal. Overall, I don't know that I would recommend this over any other pitcher.",
      "rating": 3.0,
      "verified": true,
      "author": "JAR1599",
      "helpful_votes": 2,
      "publication_date": 20170711
    },
    {
      "title": "Worst water pitcher ever",
      "text": "This is the worst design for a water pitcher. Because the water is filtered as you pour, the pour is incredibly slow so it literally takes one minute to fill a small glass of water. Also, the pitcher will not pour all of the water out of the container. There are a few inches of water left in the basin even when you dump the pitcher upside down. The only way to fully empty it is to take the entire lid off. I've used Brita products for years without issue and this is truly a disappointment. Do not waste your time purchasing and having to return this pitcher.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170717
    },
    {
      "title": "Easy to use and water tastes great!",
      "text": "Was a little hesitant to purchase but I drink a lot of water, plus my 3 cats need to drink more water, so I opted to try it out. First, easy to set up and use: rinse filter for 15-secs, insert into holder, place lid securely on unit (listen for the click), pour that pitcher of water out and lastly, refill with tap water and DRINK! No leaking, no carbon in the water, just a nice clean tasting glass of H2O. Go for it!",
      "rating": 5.0,
      "verified": true,
      "author": "golfnutx2",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "don't have to wait before drinking water",
      "text": "Filter as you pour is a very thoughful concept. I ended up buying 2 of these and will probably buy 2 more. Its so easy to put together and use. I just have to pour water and it will get filtered while I pour it to a glass. The design is very sleek. I like there is a button to open the pitcher. very satisfied with the product. wish it came in more colors.",
      "rating": 5.0,
      "verified": true,
      "author": "cindy",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Really like it.",
      "text": "I really like this product. I can keep it on the counter to provide filtered water any time I need it. Also I can use it to fill a refrigerator bottle of cold water for drinks. I used to use tap end filters, but they cut down so much on water flow for things like dish washing. Some of the reviews complain of slow filtering but I have not found this to be true for me.",
      "rating": 5.0,
      "verified": true,
      "author": "old cowboy",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "No wait time",
      "text": "Less water in the pitcher slows the pour rate down. This is our second pitcher. The first one cracked. I prefer the stream filter over the other type. There is no wait time after filling the pitcher.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth A. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Very easy to use",
      "text": "Use it every day. So much easier than having a clunky filter attached to the faucet. I do have to hold the top lid down while pouring bc it has opened and spilled water everywhere, but it’s really not an inconvenience at all.",
      "rating": 5.0,
      "verified": true,
      "author": "HY",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Filter sold separately",
      "text": "I would have thought one filter would be included with this pitcher... so if you purchase the pitcher, be sure to also purchase filters! Then, be prepared to struggle to find them and pay a LOT.",
      "rating": 3.0,
      "verified": true,
      "author": "Terri Carrigan",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Water flow is too slow almost a trickle.",
      "text": "I bought this to save money on bottles water. The design is sleek but the flow is too slow. It get especially slow as I get the last bit of water. It's a pain. I'll look for another one.",
      "rating": 5.0,
      "verified": true,
      "author": "crystall7",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great features",
      "text": "I love this filter pitcher which I use daily. Effectively removes impurities from the water and saves me a lot of money on bottled water. I highly recommend this product. Arrived quickly too!",
      "rating": 5.0,
      "verified": true,
      "author": "DEENY119 ",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "So worth the money",
      "text": "I was worried about it being an insta-pour. I was thoroughly grossed out by how strongly the tap water stunk and I thought sure that running it through a little filter wouldn’t do the trick. Well, I was wrong. It’s miraculous! I can fill the carafe up with stinky water and pour out fresh, scentless water within seconds. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Summer Daley",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Slow pour",
      "text": "Brought this item thinking its better to have the water filter on its way out instead of waiting for it to filter when you pour water in. But I was wrong it takes (what feels like over 5 minutes) for the water to pour out and all I'm trying to do is fill up my water bottle.",
      "rating": 1.0,
      "verified": true,
      "author": "Parasol",
      "helpful_votes": 2,
      "publication_date": 20170924
    },
    {
      "title": "Fills fast pours slower than molasses",
      "text": "This pitcher pours so slow it's ridiculous. I bought this because I was using the Brita 10 Cup Grand pitcher and was tired of how tedious to fill. This pitcher definitely fills much much faster, but it takes so long to pour out. Also, I can never seems to pour all the water out of it. I don't like the filter as it doesn't seem to leave the water tasting clean.",
      "rating": 3.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Do not buy.",
      "text": "It was fine until I needed to replace the filter. This is impossible unless you have Andre the Giant living with you. I tried the push thingy. I tried a hammer. I tried a screwdriver. Tomorrow, it goes to the dumpster I pay $24.57 per month for. Thank goodness. I also paid for 2 extra filters. Lesson learned about that. Wait and see if it actually works out.",
      "rating": 1.0,
      "verified": true,
      "author": "Norine Birk",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Doesn't filter water well. Water has a bad taste.",
      "text": "Very disappointed with this product. Liked the design and the idea of not having to wait to be able to drink filtered water. The flow is very slow. Unfortunately it doesn't filter very well. At one point the taste of the water coming for this pitcher was very bad but good from another type of pitcher. We decided to not use this filter anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "Valerie Amzallag",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Does what it clames",
      "text": "I love this product, it gives instant clean water from my tap. It has a little reader at the top to tell you when it is almost time to change the filter. It is a little slow coming out as it is filtering the water as it pours but I feel like this is still a lot faster then filtering the water first.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "poor design",
      "text": "the design of filling up the pitcher and trying to pour as it's filtering is flawed. the pour is small and takes a lot of time - more than double as long as in traditional pitcher. And while it's annoying to wait for my traditional brita to fill and least i can go do something else while it filters. with the new design i have to wait minutes as i fill my glass etc. My time is better used with traditional pitcher. Also holding a full pitcher (water does flow a bit faster with a full pitcher) gets very heavy. I actually hate this design and feel angry at brita for this design.",
      "rating": 1.0,
      "verified": true,
      "author": "pinkshopshop",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "This is not a good purchase for those that have a tendency to be ...",
      "text": "I find this infuriating to use as the water pours out of the filter quite slowly, especially if you don't have much water left in the pitcher. This is not a good purchase for those that have a tendency to be impatient. I thought that I'd like it much better than the other Brita filters which filter as the water goes into the pitcher (vs. as it's poured), but that's definitely not the case and will be going back to the other style of pitcher.",
      "rating": 2.0,
      "verified": true,
      "author": "Elise",
      "helpful_votes": 2,
      "publication_date": 20170704
    },
    {
      "title": "Great tasting water finally!",
      "text": "Bought as a gift for my sister and she loves it. Local water doesn't taste great and the Brita clears out whatever is in their water so they finally don't have to keep on buying bottled water. Great savings.",
      "rating": 5.0,
      "verified": true,
      "author": "MJFay",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "It's garbage.",
      "text": "This think take s3 days and nights just to fill a cup of water.. i saw 3 seasons of the walking dead before I filled up 3 cups a water. Other then that it's great. Don't know why the darn thing just pours very very slow",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Love it",
      "text": "I like the design of this Brita. The filter is much easier to change that the previous Brita I owned. The taste of my tap water is so much better after being filtered. The aqua color matches my kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Bonneau",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Nice could be better",
      "text": "I ordered this product to cut down on bottle purchasing. The filter sits to high so I feel I am constantly refilling the pitcher so the filter is always covered in water and doesn't dry out. My other issues is the flow of water out of the spout. It's not a full flow. It is slow and a 1/4 of the width of the mouth when you pour.",
      "rating": 4.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "It's ok but it doesn't pour to empty",
      "text": "Like the idea... but you can't every single ounce! It doesn't let you pour water until it's empty. There's about a cup worth of water that I should be able to still pour out but it's useless - no matter which I tilt it, that last 8 oz of cold water just won't pour out!",
      "rating": 3.0,
      "verified": true,
      "author": "Forever20ne",
      "helpful_votes": 3,
      "publication_date": 20170608
    },
    {
      "title": "Too slow to pour",
      "text": "The stream is a simple tradeoff compared to the non-stream model: do you want to wait for the water to filter when you pour the water in or when you pour the water out. After having both, it seems clearly better to use the non-stream model since: - When you fill the pitcher is usually after you've just poured a glass of water and you're filling it for later, so you're not actually waiting for it to filter in real time - When you are pouring a glass of water, it pours about 5x slower that the non-stream model, slow enough to be frustrating I'd advise getting the non-stream model",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Singleton",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "BEST EVER",
      "text": "Easy fill, easy pour. Don't have to wait for water to go down. Pours pretty quickly and fills a 12 cup coffee maker!! Looks great too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey H. Taylor",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "No, no, no...",
      "text": "This thing is a POS. Total trash. All Brita has done is moved the time for filtering from a pitcher sitting on a counter, to a pitcher you are holding and attempting to pour...horrible product. So slow to pour, it's really awful...if someone gives this, you should wonder what you've done to receive such an awful gift...Just throw it away if you cant return it...so bad",
      "rating": 1.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 4,
      "publication_date": 20170523
    },
    {
      "title": "Happy customer.",
      "text": "Good product. Clean water, without a weird taste. Dunno why other people taste something weird. Got over the slow pouring. All you have to do is keep it moderately full and it'll pour just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Valentina",
      "helpful_votes": 3,
      "publication_date": 20170417
    },
    {
      "title": "Extremely slow pour",
      "text": "Extremely slow pour. And I mean extremely slow. It barely trickles out. It kind of trickles out. Plugs up. Trickles out again. You are way better off taking the extra second to filter the water, then pour it when you need it. Took a good minute to pour a glass of water. Terrible",
      "rating": 1.0,
      "verified": true,
      "author": "Seth E. Atchley",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Awesome design",
      "text": "Great design and takes up little space in the refrigerator. Not having to wait for the water to filter is excellent and a huge time saver. Highly recommend for anyone looking for a new Water Pitcher.",
      "rating": 5.0,
      "verified": true,
      "author": "TeckUp",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Cool design, but TOO SLOW!",
      "text": "Cool design with the ready-pour system, but the filtration is too slow. It's nice to not have to wait for the water to filter before pouring. However, I like to fill a water bottle with this water, and I lose comparably more time waiting for the filter to work at the time of pouring than just filling the pitcher beforehand. Interesting design, but functionality is limited. Personally would not recommend, but YMMV.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Water quality..",
      "text": "Love everything about this item..filter so easy to change out.. no chance of building up mildew in hiding cracks. Easy washing..no after taste from filter fibers. And the alert to notify change filter is the bomb.. I highly recommend this..",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Laird",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "In another house, I'm sure this item is worth having",
      "text": "I have to set it on the floor of a bathtub to fill it, it's too tall for any faucet that's nearby. And full it's pretty heavy. Doubt it'll get much use here.",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara A. Roettjer",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "No more waiting to pour after filling. The filter ...",
      "text": "No more waiting to pour after filling. The filter lasts a long time. The top is sealed, so there are no leaks once closed. Only minor down side is that due to how the water goes through the filter, the last bit of water in the reservoir won't pour out; this doesn't really affect use though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Great Idea, Not Practical Enough",
      "text": "I loved the idea of having this product. Beautiful jug, large. However, it's not so practical for me. If i want a cold glass of water, I'm left holding this jug in the air too long to fill a medium sized glass. God forbid I have guests who want water. I'm left embarrassed holding this new jug that trickles explaining to thirsty guests this new tech. Quite frankly, I should have purchased the traditional one. No one cares if it filters slowly going in, but when I'm thirsty, I want my water now!",
      "rating": 2.0,
      "verified": true,
      "author": "Luke JL",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "I don’t think I would have bought this if I had known",
      "text": "Not dishwasher safe. Super-slow trickle. Water tastes a little funny. Yes, you no longer have to have a gallon-sized pitcher to keep half a gallon of clean water, but for crying out loud, it takes almost a full minute to pour a regular 8-10 oz glass of water.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Not as described",
      "text": "I did not receive a filter with my pitcher. I just happen to have ordered extra filters, but one was supposed to come with the pitcher.",
      "rating": 2.0,
      "verified": true,
      "author": "Brandy",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "The water tastes better after filtering BUT...",
      "text": "At first when I tried this pitcher, I was glad how the water taste turned out. However, when I checked the water with my TDS meter, it showed that it in fact did NOT filter anything. the value before filtering was 336 ppm, and after filtration it was still 336ppm. I would recommend people to buy a different type of water filter pitcher instead.",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 2,
      "publication_date": 20171008
    },
    {
      "title": "Lid stays put!",
      "text": "I like that the lid doesn’t fall out. The filter is stationed on the spout do it filters as you pour.",
      "rating": 5.0,
      "verified": true,
      "author": "meinnj",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great piece of equipment",
      "text": "Great product. Don't have to wait minutes to fill it up.",
      "rating": 5.0,
      "verified": true,
      "author": "SFCHenry",
      "helpful_votes": 5,
      "publication_date": 20170331
    },
    {
      "title": "Good pitcher- but be prepared to wait a while when pouring yourself a cup of water",
      "text": "I love the slim design for a 10-cup pitcher. The only downside of this design is that bc it filters your water as you pour it out, it takes a while to pour yourself a cup especially when your pitcher has a quarter left.",
      "rating": 3.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Very good filter",
      "text": "I live in a condo now and I didn't want to carry up full packs of water bottles so I bought this and it works very well. Fits nicely in my refrigerator but near the end of the amount in the pitcher; pouring slows down but nothing to make me send it back or anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen Oakey",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "I really recommend this pitcher and filter system",
      "text": "I really like this pitcher. I spent a lot of time researching before getting this pitcher to replace my 10 yo Brittany. The water tastes great, you do not get any reside like with the Brittany filters, Easy to clean The flow is slower when pouring water because the water is going the filter. Difficulty getting filters through Amazon, I ended getting at my local BB&B",
      "rating": 4.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Don't buy this pitcher",
      "text": "The description of product did NOT indicate it ONLY filters chlorine, unlike the other Brita products. There's a sensor built in that alerts you once it's almost time to change it (20% life left) and when it's time to change (0%). The one on my pitcher does not work. It only lights up if I press the button but it does not light up when pouring. I've had it for 2 months and it’s still says 100%. Don't waster your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Martie",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Goodbye Funny-Tasting Water!",
      "text": "I'm not sure if Covid-19 caused our little town to add more \"chemicals\" to our drinking water but it started tasting and smelling awful! This purchase has made my drinking water so much better! The slim design makes it fit easily in my refrigerator without taking up too much real estate!",
      "rating": 5.0,
      "verified": true,
      "author": "C Chamberlain",
      "helpful_votes": 0,
      "publication_date": 20200708
    }
  ],
  "product_meta": {
    "title": "Brita Stream Filter-As-You-Pour Water Pitcher, 10 Cup, Carbon",
    "description": "Color:Carbon| Size:10 cup| Style Name:Water PitcherDrink cleaner, great-tasting water with this BPA-free Brita 10 cup water filtration pitcher. Brita Stream Filter-As-You-Pour technology allows you to enjoy great-tasting water and is the only pitcher that filters water as you pour so you don't have to wait at the sink for water to filter. When you pour the water into a glass, the water flows through the filter, reducing chlorine (taste and odor) and more. Replacing your Brita Stream filter is a breeze. Just a glance at the electronic filter replacement indicator lets you know when it is time to change the filter. The Brita Stream pitcher is compatible only with Brita Stream filters and comes with 1 Stream Pitcher Filter. The filter should be changed every 40 gallons, about 2 months for the average household, for best results. Start drinking great tasting water with Brita.",
    "rating": 4.5,
    "feature_bullets": [
      "FILLS QUICKLY. POURS IMMEDIATELY: The Brita Stream features Filter-As-You-Pour technology that allows you to quickly fill up the entire water filtration pitcher and immediately pour a great-tasting glass of filtered water",
      "TASTES GREAT, NO WAIT FOR FILTERING: Brita Stream's Filter-As-You-Pour technology removes the need for a traditional reservoir, so you don't have to wait for water to filter. The space efficient pitcher fits in refrigerators and is great for families",
      "MULTIPLE USES: Use great-tasting filtered water anywhere you use tap water: cooking, infant formula, coffee, tea, ice cubes, pets, and more",
      "REDUCE WASTE & SAVE: One Brita Stream filter can replace up to 300 standard 16 oz water bottles, so you can enjoy filtered water at a fraction of the price and waste. Change your filter every 40 gallons, about every 2 months",
      "SPECS: Large 10 Cup Brita Stream Water Filter Pitcher, BPA-free plastic, electronic filter change reminder, compatible with Brita Stream filters only, recyclable through TerraCycle. Height 10.75\"; Width 5.63\"; Length/Depth 10\"; Weight 1.35 pounds"
    ],
    "specifications": {
      "Product Dimensions": "11.02 x 5.43 x 16.38 inches",
      "Item Weight": "2.2 pounds",
      "Manufacturer": "Brita",
      "ASIN": "B01MTKI40F",
      "Customer Reviews": "4.5 out of 5 stars2,580 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#4,900 in Tools & Home Improvement",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 29, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Pitcher Water Filters",
      "Water Coolers & Filters",
      "Kitchen & Dining"
    ],
    "price": 51.52
  }
}