{
  "website_summaries": [
    {
      "verdict": "An inexpensive radio that will give you portability and many options for delivering power.",
      "pros": [
        "Runs from a hand crank, USB connection, or solar panel",
        "Includes weather alerts with both AM and FM signal reception, and power bank to charge mobile devices",
        "Extremely small radio fits in a backpack"
      ],
      "cons": [
        "Doesn't store a lot of power with hand crank",
        "Build quality is questionable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Inexpensive emergency radio, yet it has both solar panels and a hand crank.",
      "pros": [
        "Small radio body, so it's easy to carry with you anywhere you go",
        "Draws FM, AM, and NOAA weather radio signals",
        "Has a flashlight for convenience",
        "Just enough power, so you can charge a mobile device"
      ],
      "cons": [
        "Only has a 1,000 mAh power bank"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "it was pretty worthless. So I’m changing my rating for 5 ...",
      "text": "When I first got product it seemed to work really well. I was without power for 15 hours yesterday thanks to a storm so I figured I would really try this product out. The solar charging did not work at all. You have to crank it a lot to even get the radio to stay on for a few minutes and it would charge my phone for about 10 seconds then stop. Needless to say, it was pretty worthless. So I’m changing my rating for 5 stars to 1 star. I am extremely disappointed in this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Coree",
      "helpful_votes": 519,
      "publication_date": 20180603
    },
    {
      "title": "My wife was annoyed with the radio so she turned it off without ...",
      "text": "bought this after the wild fire in CA, added this to my emergency supply bag. I was testing this unit and left the flash light on over night, it lasted all night. Tested the radio and it lasted over 6 hours. My wife was annoyed with the radio so she turned it off without telling me. I tried the cranking, it works just like it said on the instruction manual. All works great, but i can't find the batter indicator. I have no idea when the battery is fully charged or not.",
      "rating": 4.0,
      "verified": true,
      "author": "Nguyen",
      "helpful_votes": 62,
      "publication_date": 20171106
    },
    {
      "title": "Waste of money",
      "text": "Doesn’t charge a phone with cranking for almost 10 mins nonstop. Also the solar panel on it is a hoax. It doesn’t work, period.",
      "rating": 1.0,
      "verified": true,
      "author": "A. H.",
      "helpful_votes": 57,
      "publication_date": 20180305
    },
    {
      "title": "it's wasted money. I will return them as soon as ...",
      "text": "The radio had a lot of static and didn't work during hurricane Irma. We bought two, it's wasted money. I will return them as soon as we get power back",
      "rating": 1.0,
      "verified": true,
      "author": "orahclose@hotmail.com",
      "helpful_votes": 76,
      "publication_date": 20170915
    },
    {
      "title": "Pass on this one",
      "text": "Wow. It worked for one day. Never worked by cranking. Spend your money elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "ranosu",
      "helpful_votes": 60,
      "publication_date": 20171003
    },
    {
      "title": "Not recommended.",
      "text": "I used this approx 4 times, relaxing outside in the sun. Worked great then suddenly nothing! Plugged in the charging accessory that came with it and it just sits with the battery light blinking. Supposed to stop blinking when fully charged; connected to charging for 24+ hours and light still blinking. Will not operate either on charge or stand alone.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicholas M. Gotch",
      "helpful_votes": 34,
      "publication_date": 20180211
    },
    {
      "title": "DOES NOT WORK AS STATED IN INSTRUCTIONS!!!!!!!",
      "text": "I bought this for my Labor day week camping trip. took it out of the box, august 31, charged it as stated, it worked great for an hour the next day. tried winding it, would work for 2 minutes, tried solar charge, worked for 10 minutes. I wish I had tried it sooner so I could return it. I am NOT HAPPY WITH THIS PRODUCT.....I sure learned my lesson on purchasing items through amazon. DONT BUY SOMETHING FOR FUTURE USE OR A GIFT!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "D L",
      "helpful_votes": 28,
      "publication_date": 20180904
    },
    {
      "title": "Dead after being stored for 19 months.",
      "text": "Bought this in November of 2017 for my emergency supply bag. It worked when I got it and now won't hold a charge after sitting unused and stored for 19 months. The only way to get it to work is when actively spinning the crank, which makes it pretty much useless. The battery is one I don't recognize and is wired in, so replacing it wouldn't be a simple task. I am tasting regret in my choice of emergency radios. Sad face.",
      "rating": 1.0,
      "verified": true,
      "author": "D$",
      "helpful_votes": 15,
      "publication_date": 20190630
    },
    {
      "title": "Garbage",
      "text": "When I first got it, not that long ago, seemed to work ok. Charges with usb. Crank storage is of course minimal, lasts seconds to minutes. SOLAR about 15 seconds. I finally decided to try out the solar two days ago, kept it out in full sun. Turned on the radio for a few seconds. Radio quality is absolutely horrible. I was an electronic technician in the old days. You could build a crummy little bandpass filter radio for about $5 and get the same quality (lack of). I prep. Don't ever expect to depend on this, even just for fun sitting at the lake.",
      "rating": 1.0,
      "verified": true,
      "author": "don north",
      "helpful_votes": 12,
      "publication_date": 20190616
    },
    {
      "title": "3-5 minutes of cranking for 3-5 minutes of radio play?!",
      "text": "The instructions state that you need to crank the radio for 3-5 minutes to wake up the battery, then you can get 3-5 minutes of play after cranking for another minute. This is a lot of cranking! I bought this to replace my old Sony hand crank when the handle broke. It plays for 20m after a minute of cranking. Too much cranking. Looking for a better hand crank radio.",
      "rating": 1.0,
      "verified": true,
      "author": "Darth Dad",
      "helpful_votes": 10,
      "publication_date": 20190515
    },
    {
      "title": "Battery failed",
      "text": "This is an update to my earlier review below. Running Snail contacted me and sent me another radio and it's been working fine. I appreciate their great customer service and I do not hesitate in recommending them and the radio. Thanks! EARLIER REVIEW: I had the same issue as an earlier posting. I bought it two months ago and tried it several times and it was fine. Just tried it again and it won't hold a charge. When I plugged it into my phone charger, it works fine, but, goes dead when unplugged. I'm hoping that the seller will be able to help me out, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 3,
      "publication_date": 20190710
    },
    {
      "title": "AWESOME PRODUCT",
      "text": "Here's the thing I like the most about this product. We had a pretty good thunderstorm that knocked out the power and I wasn't able to charge my cell phone from the wall obviously. This had a full charge and when I hooked up the cell phone to crank it to recharge the batteries some it completely filled my battery to my cell phone within just a few minutes but completely drained the battery to the weather radio. to me that's a plus because all I had to do is crank the radio for a few minutes and I would get I believe 20 to 30 minutes of listening or 20 to 30 minutes of a flashlight.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Dobson",
      "helpful_votes": 2,
      "publication_date": 20200301
    },
    {
      "title": "Doesn't take batteries",
      "text": "This thing is pretty dang cool. I purchased it for any emergencies and for my bug out bag. It's small, lightweight and does everything you need it to. This is my fault for not really paying attention, but it doesn't have a AAA battery option as an alternate power source. So the only way for you to power it is by charging via USB, solar, or cranking. The crank is cool, but pretty unrealistic unless you're in a REALLY bad spot. It says you have to crank it for like 7 hours to fully charge, lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 2,
      "publication_date": 20190908
    },
    {
      "title": "Got Us Through Harvey",
      "text": "I live in the Houston area and this little baby charged our cell phones, lit our way and offered music to keep my kids calm. I am so pleased with this. It held up and then some. Never quit on me. Never needed to crank it.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Matthews",
      "helpful_votes": 8,
      "publication_date": 20170916
    },
    {
      "title": "Great for an Emergency",
      "text": "Bought for emergency kit. Took it camping to try it out. Started with a full charge. Listened to the radio one night for about 9 hours and charged 1 phone completely and another to about 60% on the one charge. I recharged it with the USB instead of hand cranking but if you would use it wisely in an emergency situation this would be a great little radio. Was able to pickup a few radio stations pretty clearly out in the middle of nowhere.",
      "rating": 4.0,
      "verified": true,
      "author": "S Martin",
      "helpful_votes": 2,
      "publication_date": 20190907
    },
    {
      "title": "Stopped functioning after 28 days",
      "text": "It worked great, sounded great for about 21 days. It started having intermittent problems, even fully charged or plugged in. It would work then just stop, like a short in the radio’s internal components. Finally the radio was completely dead, even though the flashlight work just fine. Returned it. Will have to try a different brand. Very disappointed because it was so great at first.",
      "rating": 1.0,
      "verified": true,
      "author": "JDM",
      "helpful_votes": 4,
      "publication_date": 20191130
    },
    {
      "title": "Useful but small defect (charging port)",
      "text": "Nice radio, but the charging port failed. This radio is great based on the size and the many ways to use it. It can be solar charged but that takes forever and you need lots of sunlight. I had to take it outdoors rather than let it sit in the window to get good use of it via the solar charge aspect. The port for cable charging collapsed and went into the radio itself after just a few days of use. Not sure if this one was defective, but for the price I paid this should be a better product.",
      "rating": 3.0,
      "verified": true,
      "author": "Regine",
      "helpful_votes": 2,
      "publication_date": 20191206
    },
    {
      "title": "Very Happy!",
      "text": "I got the radio for my mom who lives in an area the frequent power outages wet weather. She told me she has relied on it 3 times, so far. The NOAA channel came in clear and she was able to dial in both an AM and a FM channel; a surprise as her area is not known for good radio reception. Somehow, she managed to push the micro USB port into the body of the 088S attempting to fast charge the radio. When she emailed the problem to Running Snail, they promptly replied with an apology and sent her a replacement. RunningSnail did not require the return of the original radio. My mom approves both the radio and RunningSnail.",
      "rating": 5.0,
      "verified": true,
      "author": "nadinemalia",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Deserves 3 stars, but I give it 4 stars, because I like mine",
      "text": "Mine worked well. For $20, I didn't expect much. The knobs are recessed and funny, but they look like they can take some abuse in a backpack. The radio bands all worked, reasonably, and the sound is acceptable. The LED worked, and who knows about the generator, because there is no way to tell (without taking it apart)? The 1,000mah battery measured 510mah, after a full charge. I guessed that it would provide 600mah, and it is replaceable. This thing is small and light, includes USB cord plus iPhone adapter to make a nice ziplock addition to my bacpack.",
      "rating": 4.0,
      "verified": true,
      "author": "dinotech",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Dont Let the Battery/Solar Feature Fool You",
      "text": "As a basic hand crank radio/ flashlight, this is decent enough. Though, this is not advertised as such. The battery life is short--NOT battery charge--battery life. Now the solar panel and charging features are irrelevant. It is a solid 2 stars overall. Cranking it with a preset station, you can listen to the radio and use the flashlight; but I know I dont want to sit there cranking this for any extended time.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. Jones",
      "helpful_votes": 2,
      "publication_date": 20191226
    },
    {
      "title": "Good features & performance for the price.",
      "text": "A minute's worth of cranking supplies enough power to run the radio and the flashlight, the two items I was most focused on. I don't know if it will charge my iPhone (most likely rendered useless in a Cascadia Earthquake event anyway) but the solar cell doesn't seem to do much of anything. I would have given the unit 5 stars overall if it wasn't for this. The sound is what you'd expect from such a small , inexpensive unit. However, the crank mechanism seems strong enough to last for a while so I'm pleased overall with the unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Notary Sojack",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Essential to have.",
      "text": "I went through hurricane Irma recently. I evacuated my hometown and stayed at an Airbnb with other guests. I watched all the guests (and hosts) lamenting that their cell phones were dying and can't get updates on the hurricane. I came to the rescue with this radio. It has a flashlight so you can say I came to the rescue multiple times (since I bought other gadgets from amazon.com that are essential when lights go out). I highly suggest people buy radios, even in these modern times. You never know when you'll be needing it, and coming to someone's rescue.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Colucciello",
      "helpful_votes": 4,
      "publication_date": 20171016
    },
    {
      "title": "Handy Emergency Radio - Buy for all your friends stocking stuffer",
      "text": "All features that make a radio handy in any emergency. Crank, solar, and chargeable battery. NOAA Weather and emergency stations, AM & FM. Flashlight and handle carrying cord. Small enough to carry anywhere. Company stand behind warranty. I give customer service good reviews. Perfect holiday Gift or for emergency bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Di Ann",
      "helpful_votes": 4,
      "publication_date": 20180306
    },
    {
      "title": "YES!! Powerful little unit!",
      "text": "Must need!!! I love this little guy!!! I charged it before a lake day. Played music for about 5 hours. Great sound quality! I love that I can charge my phone lake side as well!! You can charge an i phone or an Android! I also live in an area that is prone to hurricanes. I hate to say that Im excited to see its true powers when we lose electricity! Lol I seriously recommend this to everyone! Will probably purchase a few for gifts!! Love love love!!",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Product's not charging",
      "text": "Purchased this product over a year ago to be hurricane prepared.Charged it and its showing red indicator as fully charged.Only works when when connected to power source.After charging it for two hours..it will not turn on without being connected to a power source..even after cranking it for 3 minutes it will not maintain the charge..",
      "rating": 1.0,
      "verified": true,
      "author": "sherrell",
      "helpful_votes": 6,
      "publication_date": 20190906
    },
    {
      "title": "Lets talk charging.",
      "text": "The instructions say radio can be difficult to charge by solar which it adds is used\"mostly for maintaining the battery\" also to fully charge the battery by had crank they say you will spend 7 hours cranking at a speed of 130 to 1150rpm. On the pluse side a one minute charge gives you 3 to 5 minutes ...multiply this by 3 and you may be able to get a weather forcast. USB full charge can be done in two hours. Radio appears to be well built and for 20 bucks worth packing on a camping trip but make sure you have a good charge before boon docking.",
      "rating": 4.0,
      "verified": true,
      "author": "John Ennis",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Neat Handheld Radio easy to work, Great Deal!",
      "text": "I was suprised at the size but its so perfect for traveling! It fits right into your hand. It comes fully charge. The volume is MEGA, easy to work every feature. The texture is so smooth and a good feel to touch. I love the red color also. I found my county's radio station immediately and without even pulling up the antenna. That says a lot being that I I've in the middle of the forest. I am going to order more for my whole family!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "The unit is a little smaller than I expected, see picture with a dollar bill for perspective.",
      "text": "Radio and flashlight works as advertised. I followed instructions and charged it up at first by cranking for a couple minutes, then put it out in the sun to charge with panel, then plugged in the micro-USB cable to finish up once the sun went down. I had the radio on my list, but only clicked \"buy\" after the power went out in my house one morning last month. I look forward to having it handy to play music and charge my phone the next time the power goes out.",
      "rating": 4.0,
      "verified": true,
      "author": "jqr",
      "helpful_votes": 2,
      "publication_date": 20190502
    },
    {
      "title": "Excellent Features, decent price",
      "text": "Wx band + Solar charged + Hand crank charged + Outlet charged + Can recharge phones = w00t! Sound is fine. Tuning requires a sensitive touch. It's nice to have a little red light when you've hit the station. Keep them in your emergency kits. BTW, it takes a lot of cranking to get a minute of radio.",
      "rating": 5.0,
      "verified": true,
      "author": "Hans L.",
      "helpful_votes": 2,
      "publication_date": 20190805
    },
    {
      "title": "Afraid it has to go back.",
      "text": "I'm very disappointed in the radio. The FM wasn't too bad as I could pick up a few stations but I got exactly 1 station on AM and nothing on the weather radio. I'm 10 miles outside of Memphis TN and there are tons of local stations. The light was OK except that the simple push button switch could easily get pushed in a pack and run the battery down.",
      "rating": 2.0,
      "verified": true,
      "author": "doubleganger",
      "helpful_votes": 37,
      "publication_date": 20170629
    },
    {
      "title": "Low cost radio made of low cost material.",
      "text": "Just keep in mind that this is a low-cost radio made of low-cost components. When I used my radio for the first time on a camping trip, the plastic dial cover came off, exposing all the electronics behind the dial, rendering the product not waterproof. I sent an email to the manufacturer and never got a response. This is not going to be a durable product that can hold up in a backpack over miles of hiking. I ended up buying another product and it's a much better quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Anne Marie M. Brown",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "I don’t want to purchase anything made in China !!!!!",
      "text": "I purchased this item because Amazon tagged it. I am thinking about returning it because it was made in China. If I had known it was made in China I would not have purchased it. I am afraid I will not be able to buy anything from you because you have too many products from China. You need to put in the description where the product was made. I bought it in case China caused our power to go out.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda Witten",
      "helpful_votes": 3,
      "publication_date": 20200610
    },
    {
      "title": "Light weight, portable, and compact but don't bet your life on it!",
      "text": "First surprise was how small it was...very very small. Make that \"tiny\" Pro's: Flashlight and battery worked well as well as solar and crank. Sound was passable...AM/FM both worked fine Con's: I live on a boat on the ocean. I get 5 weather stations 24/7 on my VHF radio. I got zero weather stations with this unit from the exact same location! It tries, and it select stations but they just won't come in. Also very difficult to operate tiny and very stiff controls. Recommendation...don't bet your life on this product. It seems to be one notch up from being a toy. Very disappointed and a waste of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Sock Hawk",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Smaller than expected but not Terrible overall.  Good for purpose of emergency but out bag.",
      "text": "Overall not bad for a purpose but it was a lot less than what I expected for the money. I should’ve read the description deeper to see the dimensions I thought it was gonna be a more full size unit. The Diles on their side are very small and cheap but they work. It does work as designed it is compact enough to go into my bug out bag. It does have a short wave radio as well as AM FM. If the light was brighter at full charge I would’ve Gave a higher score.",
      "rating": 3.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Battery didn't even make it 2 years.",
      "text": "Battery already no longer holds a charge. Used it one time but kept charged for storm shelter. Last round of storms it was dead, tried charging it and no longer holds a charge. Didn't even last 1.5 years with virtually no real use.",
      "rating": 1.0,
      "verified": true,
      "author": "My Reviews",
      "helpful_votes": 2,
      "publication_date": 20200412
    },
    {
      "title": "Great deal",
      "text": "I was hesitant to buy this after reading some reviews. But I am very happy with my purchase. The light is actually very bright its the only flashlight I brought camping and the radio works great. The phone charger does work but it's very slow. Holds a charge for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "cheyanne alcaraz",
      "helpful_votes": 5,
      "publication_date": 20170815
    },
    {
      "title": "CHECK TO SEE IF THERE IS A CRANK...",
      "text": "I BOUGHT THIS AS A GIFT IN FEB. LAST WEEK THE POWER WENT OUT & WAS TAKEN OUT OF THE BOX & THERE WAS NO CRANK...I DID NOT CHECK IT OUT BEFORE I SEND IT TO MY SISTER...ONCE IT ARRIVES CHECK TO SEE THAT THERE IS A CRANK...",
      "rating": 1.0,
      "verified": true,
      "author": "Myrna Welton",
      "helpful_votes": 7,
      "publication_date": 20181123
    },
    {
      "title": "Great, multipurpose",
      "text": "Used this on a camping trip recently. The light is good, the radio works, and even though it's not waterproof, it survived a night outside in heavy mist. I didn't have to use the hand crank because the battery lasted well enough for the full trip with light use. It's meant for emergency situations and that's what it's good for mostly.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Not worth the buy.",
      "text": "The solar panel radio didn't have a long battery life even left in the sun for a full day. Pretty disappointed. Update: May 29, 2020 When I wrote my review an employee by the name of Carol responded to my concerns and further helped me with my dissatisfaction with the product and I greatly appreciate the effort made by Carol which if the company improves on their product then I would not mind giving them the 2nd chance since they took good care of me with my dissatisfaction with their product. I wish the company nothing but the very best! ❤︎",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "This is the one you're looking for.",
      "text": "If you've been looking for multi use, flashlight, radio, and device charger, then this is for you. It's both solar charged and wind up powered for times when you're camping, hanging out somewhere secluded, an emergency situation, anywhere. It comes already charged in the box so as soon as I turned it on and tuned it to one of my favorite stations, and played with the flashlight, everything worked. The speaker for the radio is good quality too! I recommend it to anyone into the outdoors or want something for when you get in a survival scenario and need to charge your phone or need light in the dark. Something every survivalist needs!",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Haines",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Great Value",
      "text": "This came fully charged and had cables to attach to charge our phones. The hand crank was easy, and the radio sound quality was good on the radio. The light on the flashlight was strong. I was really surprised by the quality, as this was more affordable than similar units we've tried that didn't work half as well.",
      "rating": 5.0,
      "verified": true,
      "author": "NerdK",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Just awesome!",
      "text": "Got this little guy in the mail today. Hand cranked it and it seemed the sound was not tinny when I listened to FM stations. User manual is on quality paper, instructions are clear and in good english. Even though everything is based on a micro-USB slot, how great is it that they added an apple connector for the cable? :). The solar panel has a lifetime of 25 years when used 6 hours per day. That's pretty much forever. It's outside charging right now. RunningSnail, what a great company!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Siddiqui",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Camping trip essential and emergency battery charger",
      "text": "This is a nifty little device that has a lot of bang for the buck. The flashlight is bright, the crank is easy to rotate, the radio is pretty clear and can get loud for the size. Not to mention the fact that this can get energy from the sun and also comes with an iPhone adapter piece (which in itself is probably a 5 dollar product retail). I bought this for an upcoming camping trip at Rocky Mountain National park. But let me tell you; this thing should be in the trunk or glove box of every motorized vehicle on the road in case of emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Find a better one",
      "text": "Purchased this 2 years ago tried it out when I first purchased it and put it away for an emergency. It was stored in bag in room temperature not extreme heat or cold. Pulled it out for the first time since receiving it and it only works if while cranking. Solar panel does not work or the charger. Luckily I took it out for a test and did not actually need this in an emergency. Throwing it in the trash we here it belongs",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Not bad.",
      "text": "The crank is pretty useless unless it's a dire emergency, you have to spin it pretty darn fast according to manual to charge it....and for a long time...but it's there. Still testing solar charger, but seems good. It's a nice little radio, though. It was my little paranoia purchase for what I think might happen later this year.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Useless when needed, not reliable.",
      "text": "The product was bought on Sep 2017 and I stored it for a real emergency. I had an emergency event last week and I was relying on this to work. It won't work at all. Radio/Lamp won't work unless you keep cranking it and the battery won't charge when plugged in through USB. I wish I could have my money back since I did not use the product until this week but I know that would be like a dream.",
      "rating": 1.0,
      "verified": true,
      "author": "Francisco",
      "helpful_votes": 4,
      "publication_date": 20190707
    },
    {
      "title": "Handy little radio",
      "text": "If I could give 6 stars to the battery life, I would. After a full charge from the sun, you could take this thing into a dark cave and have a flash light/radio for atleast 3 solid days, maybe more. (Well if you could get a signal for the radio that is lol) now as far as sound quality.. well it isn't Bose of course, but its adequate for its design and cost. And ease of use, well a 3rd grader could figure it out",
      "rating": 5.0,
      "verified": true,
      "author": "chrbn",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "I got this for my daughter, but another family ...",
      "text": "I got this for my daughter, but another family member had gotten it for her, so I ended up returning it. I was dissappointed that it was so small. It was about the size of my cell phone which is average size and fits in my purse.",
      "rating": 3.0,
      "verified": true,
      "author": "B.J.",
      "helpful_votes": 5,
      "publication_date": 20180108
    },
    {
      "title": "Charging of micro USB devices does not work. Probably broken.",
      "text": "This will not charge. My Samsung S5 and Moto G Plus are both unable to detect any current when plugged in, with multiple cables. The radio and flashlight work, though. Is my defective, or has nobody else tested?",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron Meier",
      "helpful_votes": 5,
      "publication_date": 20180321
    },
    {
      "title": "RunningSnail appears to be an excellent value",
      "text": "Although surprisingly small, it has similar sound quality and a more powerful flashlight, as well as better station receiving quality, than radios costing more than twice as much. It is also sturdily built and not at all flimsy. My only reason for not giving it 5 stars is that I have only had it for a short time and haven't determined yet how well the solar cell charges the battery or how well the radio holds up over time.",
      "rating": 4.0,
      "verified": true,
      "author": "MacLaren",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Battery not working",
      "text": "**UPDATE** they sent a new one immediately after we requested a return. And it worked perfectly! Great customer service Followed directions to charge the battery, still would not work. Tested the battery itself and it is showing that the battery is bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Аmazon Customer",
      "helpful_votes": 5,
      "publication_date": 20181224
    },
    {
      "title": "ok so far",
      "text": "I have only used it 3 times so further testing is needed. It gets more radio stations than I thought it would ( with the antenna extended ). It sounds pretty good for 1 very small speaker. It needs a lot of cranking to get any real life out of it. The solar panel is a non factor, in the literature given they admit that. Right now it is really a 3 and half star unit, but I need more time with it.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Buonagura",
      "helpful_votes": 15,
      "publication_date": 20170529
    },
    {
      "title": "Small compact and excellent for emergency use",
      "text": "I didn’t rate battery life because I haven’t used it on battery yet. Charging the solar battery. Living in Florida this is exactly what I needed during tropical storms/hurricanes. I’ve tried it out at home and like the volume, tone, and quality of this radio/flashlight. With the handcrank I am able to use it without the battery. I will charge it to have it ready if needed. The flashlight is really bright. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol S",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Best little AM/FM/Weather unit for $20",
      "text": "Very impressed for a $20 unit. Charging from USB, solar, or crank. Sturdy well-made radio. AM adjacent channel rejection is good. Manual tune so no presets (have to retune to listen among bands). Powerpack can recharge cell phones so this has replaced my backup charge brick in my travel kit. Weather radio (162 MHz) is a great addition. Small, rugged package - good top switch for flashlight - suitable in the hand. Actually has LED for charge status (blink - charge; on- full). I haven't completed battery life testing yet but other inexpensive AM/FM or AM/FM/Weather are eating through 3 AAA cells in as little as 3 hours. This unit is far superior for emergency, go-bag or car kits.",
      "rating": 5.0,
      "verified": true,
      "author": "S. B. Alonso",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Good Addition for Home Emergency Kit",
      "text": "It's well built with useful features. Can be powered/recharged via crank, solar, or USB. Can also be used to recharge phones via USB. Sound was clear and tuning easy.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCalGuy",
      "helpful_votes": 2,
      "publication_date": 20190722
    },
    {
      "title": "Great Radio/ Light at a great price",
      "text": "I couldn't believe how small it was, in a good way. Easily fits in your hand. Very easy to use. Good sound quality over AM & FM. Mine was already charged but I let in charge a couple hrs. Don't know exactly when it was fully charged but the red light stopped flashing after 2 hrs. Could have been charged in 1? Basic USB cord but does have an adapter. I'm thinking of getting another. At this price, it would crazy not to. Someone I know would love this, maybe more than 1?",
      "rating": 5.0,
      "verified": true,
      "author": "Cliff W. Ridley",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Valuable for travelers",
      "text": "For the money or for twice as much, this is a terrific radio. Lucky for us, it arrived right before a strong wind, rain, and hail storm. The power went out and I stayed up-to-date on the storm's activity with an occasional crank of the radio's generator. I'm going to buy a second one for the camper.",
      "rating": 5.0,
      "verified": true,
      "author": "GeezerCaveman",
      "helpful_votes": 4,
      "publication_date": 20170613
    },
    {
      "title": "Quality is Questionable, Radio Needs More Work",
      "text": "The band switch barely works. Selecting AM, FM, or Weather is difficult due to very poor switch quality. The AM radio reception capability is weak. The FM actually works quite well. The weather band does receive broadcasts with reasonable quality. So, in summary quality is fair, but certainly could be much better, especially in its capability to receive AM radio. Interestingly, it is a nice package overall, just not as useful as I had hoped.",
      "rating": 2.0,
      "verified": true,
      "author": "CrankinSteve",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "UPDATED!!!",
      "text": "Well the hand crank is easy. The flashlight light works great but the radio does NOT work. So as far as being in the need to know during a hurricane it’s absolutely useless. Running snail please send a replacement. Thanks I received my replacement running snail. Carol understood my problem and offered a replacement or refund. I chose replacement and I am proud to say it works perfectly!! Thanks Carol and Running Snail for one of the best experiences I’ve had with customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "So far so good.",
      "text": "I have not tested the hand crank feature yet but I have charged the radio via USB port and checked if the flashlight and radio worked and the charging port actually did work and so far it did. I am optimistic and so far i am happy for it. Im a amature prepper but i cant afford a ton of power banks and generator, but this is a good start for at least back up power for your cell phones in times of power outages like right now in the bay area.",
      "rating": 5.0,
      "verified": true,
      "author": "Humble",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Doesn't work",
      "text": "I bought this a year ago and it has been in the box ever since just waiting to be used. Well the storms rolled in and I went and took it out of the box and cranked and cranked and it would not work. It would only work while I was cranking it. So I put it in a window to soak up the sun rays for energy for a few days and it still will not work unless you are cranking it. So it went in the trash. Total waste of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Ooten",
      "helpful_votes": 3,
      "publication_date": 20190505
    },
    {
      "title": "\"GOOD THINGS COME IN SMALL PACKAGES!\"",
      "text": "This little Weather Radio/Flashlight/phone charger is a GREAT THING in a small package! I live alone in a mobile home in Texas and needed a good weather radio. This one is amazing! Sound for the radio is great, flashlight is bright, and with so many ways to charge it, it should never run down! I am truly amazed at how good it is. And it is sturdy in addition. I am over 75, I am a real person and I do NOT post reviews often, but this item is worthy of one. I would give it more than a 5 if I could!",
      "rating": 5.0,
      "verified": true,
      "author": "Jane F",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Amazing small radio",
      "text": "A small handheld radio with sturdy construction. It has POWERFUL speakers, strong flashlight, easy to use, and so much more. Well worth the price which is also incredible. Makes an impressionable gift for any family living in an area that might experience power outage or goes camping. Runs on solar energy or USB charging or hand crank. It has FM, AM and Weather Band functions. It is PERFECT !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "teacher",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Its a great little solar/crank radio",
      "text": "Its a great little solar/crank radio! ONE problem, the attachments that came to charge my cel phone etc. do NOT fit in either the radio socket nor my I6s cel phone. Very disappointed, that was the whole point in case I lost electricity.",
      "rating": 3.0,
      "verified": true,
      "author": "Gyorgyi",
      "helpful_votes": 5,
      "publication_date": 20171011
    },
    {
      "title": "A MUST HAVE!",
      "text": "This is a small, compact, practical product that came at a great price! It shipped fast and was well packed. The radio sound quality is nice and clear. The radio itself features both a hand crank and a small solar panel as methods of charging it. The flashlight is surprisingly bright, and lasts quite awhile. This is great for camping trips, emergencies, and bug out bags. Great quality at a great price. Highly recommend purchasing!",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia ",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "I love that it is light weight, compact and National Weather Service is accessible.",
      "text": "I used this radio on a long road trip through several states. (From the District of Columbia to Illinois) As we travels across the United States, I was able to keep track of all the weather alerts along the way through the National Weather Service. This was important because we were traveling during the time of many severe Thunder Storms were in progress. Thankfully we missed almost all of them. I have not tried the solar panel yet, however, it does reharge fast when plugged into an electrical outlet.",
      "rating": 4.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Love it!",
      "text": "I had ordered this to have on hand when my power goes out. My city was just hit with a pretty big hurricane, and although I came out of it rather unscathed, I know there will be times when I won't fair so well. I was actually expecting this radio to be much larger, but it's pretty tiny, but I was actually looking for a small one, so it was even better than I had hoped. I haven't attempted to use many of the features, but it seems like a decent quality item for the price. You can get one for everyone in the family, easily portable too.",
      "rating": 5.0,
      "verified": true,
      "author": "Albest",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Awesome!",
      "text": "This is a great device. I love the combination of functions. The radio gets great reception and has decent speakers. You can wall-charge the device as well as crank for power. Really, I couldn't be happier. I know it will charge a cell phone. The ultimate test will be powering my Kindle.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Graham",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Hopefully Will Never Need",
      "text": "But am very glad to have this in our emergency kit. Have given radio its initial charge which was completed more quickly than I thought. Can't speak to battery life yet. Am very pleased with the small size. Was a bit disappointment that radio came with scratches, not worth returning but am left wondering if I got someone else's return.",
      "rating": 4.0,
      "verified": true,
      "author": "SEJ",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Handy and convenient. Great buy for the money. Excellent radio.",
      "text": "I really like this product. Even my husband praised it. We live in an area that gets a lot of bad weather and tornadoes in the spring. I actually got it to keep informed in case of power outrages, etc. It works great, it's easy to use. Batteries last a long time and it's easy to hear. I love that it has alternate charging methods and even a flashlight for emergencies. It is a great emergency radio/tool for the home or car or camping. It's a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lalo",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Can't rely on it",
      "text": "The functionality is fine but the battery cannot be relied upon, after a year it will not take a charge and cannot easily be replaced. As a long term disaster prep item this is a significant issue. Try something else, I'm going to find something which can take new standard rechargable batteries.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "I like it",
      "text": "I got this as a back up for my cellphone in case of emergency. And I recently did use it in that capacity. Understand this is not a cell charger primarily. It enabled to send a short text checking in with family. And that was great. Where this product shines is as a hand crank radio. The sound and tuning are good. I charge it every few days on the solar panel and if it dies at night I just crank. Living off grid this radio is my primary entertainment and news source. It's one of the best splurges I've bought.",
      "rating": 4.0,
      "verified": true,
      "author": "MORIAHONTHEFARM",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Love it the sun power radio with usb port.",
      "text": "Received today. Love it, its perfect will fit for any emergency that can arise or camping. I will definitely can use this all the time whenever with no worries of the batteries running dry out. Thanks for a great weather radio.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Torres",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Seems to be as advertised",
      "text": "This product seems to be as advertised. I have not used it enough to determine if the solar charging will keep it charged; but all other features worked as advertised. The hand crank charged the battery, and I was able to charge to capacity' with the cord. I have not tried to charge my I phone, but I am sure that will work fine.. Reception on the radio was good. The only downside I noticed is that it is difficult to tune to a channel with the small know on the radio. But it is a small radion, it couldn't be much bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth L. Walker",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Compact GREAT item for emergency bag!",
      "text": "This is the spiffiest gadget! In earthquake country we are encouraged to have an emergency bag including a hand cranked power radio with light. No worries about battery life, as you just give it a few cranks! This also has usb ports to charge things. I didn’t think I would be able to afford one but for $20 bucks I can buy two! VERY compact but don’t let the small size fool you. This is a great item!",
      "rating": 5.0,
      "verified": true,
      "author": "JustMe",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Be Prepared to crank it a lot",
      "text": "I was really looking forward to having this in case of blackout (we had many this winter in the Northeast), once it's cranked it sounds great. My isuue is that you have to majorly crank it and it fades very fast. No matter how long I cranked, within a few seconds it died out.",
      "rating": 3.0,
      "verified": true,
      "author": "Tracey Gesell",
      "helpful_votes": 3,
      "publication_date": 20180513
    },
    {
      "title": "Probably more rugged than it looks ... I hope",
      "text": "This is another item that was much, much smaller than I expected it to be. But since it's meant for emergency use, maybe that'll be a good thing, yes? More room in the bug-out pack for food and ammo! Otherwise, it doesn't feel flimsy. The grippy rubberized case is a nice touch. Ans ll the buttons and cranks seem to work okay. The real test will be once Trump drops the big 'un. Or once the zombies are set loose!",
      "rating": 4.0,
      "verified": true,
      "author": "Chainsaw",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "COMPACT SIZE AND WORKS WELL",
      "text": "I had 2 older versions of this type of radio, neither of which worked anymore when I went to get them out for pending nasty weather. Tried charging them by crank and light and they would not hold the charge, so I got this one. Only used it once for hurricane Florence tornado warnings. It worked well, charges fine and is easy to use. Great to have on hand for emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisanne757 ",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Tiny, but does so much",
      "text": "The flashlight was smaller than I anticipated, but it sure does do everything advertised. The light is very bright. I've used it to do a few home repair projects. And it gets better radio signal than the radio I currently have. It's easy to crank, and I love that I can use it to charge my cell phone in an emergency. It even came with an adapter so you can use a Universal 2 or 3 device.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki Snyder",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "RunningSnail biased",
      "text": "I love RunningSnail products - this is my 2nd purchase and again I was not disappointed. The size is compact, yet has all the benefits I was looking for: crank charging, solar charging, and radio, and usb plugs. It also comes with a light. I'm so happy this wasn't any bigger - the other device I have is slightly bigger but since I'll be traveling I wanted it to be small enough to pack. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "SOpe707",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "I like the crank just in case there is no power ...",
      "text": "So far this little gadget worked well. Powered up really faster than I thought. Radio picks up well. It has the charge adapter for my iphone included. I like the crank just in case there is no power and I forget to keep a charge in the radio. If I hear a storm coming, or I am travelling, I make sure to have a full charge. Very lightweight and compact. I did not return this one. Made a mistake in my feedback!",
      "rating": 5.0,
      "verified": true,
      "author": "Lolita",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Great value essential item.",
      "text": "If you are looking for a low cost, bare bones solar powered emergency radio, this is an outstanding value. We live in hurricane country and have been through four storms that knocked out power. This is exactly what is needed in extreme circumstances. Sound quality and reception is good, solar power works and it has the added feature of a flash light. Don’t ever want to be in conditions where I would need the hand crank, but it’s there if needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Terrance A. Lloyd",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "This Baby is the Bomb!",
      "text": "I'm using this little baby right now as our state of Florida is expecting Hurricane Irma the day after tomorrow.Hurricane Irma is one big storm,and I will really be thankful to have this radio.The storms of 2004 were bad and we so grateful for our radio,it became so valuable to us,but it gave out.Thank you so much,I love my new Running Snail,but I've renamed it,and call it Running Bear.",
      "rating": 5.0,
      "verified": true,
      "author": "melinda",
      "helpful_votes": 2,
      "publication_date": 20170908
    },
    {
      "title": "If you want a paper weight, this one could do that well, and not make any noise at all.",
      "text": "Didn’t like the fact it was DOA and never worked. Float tested it in the lake, it sank quickly",
      "rating": 1.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 2,
      "publication_date": 20200924
    },
    {
      "title": "Red light keeps flashing, won’t stop.",
      "text": "I had wanted to get this radio for a while to keep in my emergency kit. When it arrived, it was much smaller than I imagined but is compact enough to fit in my kit. My MAJOR problem with this is that it has a light that will not stop blinking even after charging and it drains the battery stored. I don’t think this will be charged for when I really need it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Garcia",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Crank it up and don’t trip in the dark",
      "text": "Giving as gifts this holiday season, I wanted practically for multiple family gift bags. This was one item I wanted to include. So many times power goes out and I can’t locate candles e ough to get around as dripping wax covers the wicks as I walk. A hand crank to power is a perfect solution and the light is generous. A decent volume weather radio is a plus",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa A. McConnell",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Updated review. **Replacement product is Great**",
      "text": "Out of the box it was great. Everything worked well and seem like a nice little emergency tool to have. Then...radio stopped working completely. It is fully charged and the flashlight still works but rather disappointed in general. **Update** So the company reached out to me to rectify my concerns and I must say their customer service is impeccable. I quickly received a upgraded replacement that is perfect. I am now very happy with the product and as previously stated, the customer service was fabulous.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Gardner",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Great for earthquakes and hurricanes",
      "text": "I order 5 in total for our emergencies backpack due to Puerto Rico Earthquake. Amazing product!!!! You can charge the radio wit usb cable or with solar energy. It charge your cell phone inclusive with solar energy. It has NOAA radio station, am and fm frequencies with high range because I’m able to listen all the radio stations. Finally it have a magnificent lantern and you can charg the radio una emergency using the crank",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great multi-purpose emergency tool",
      "text": "I picked this up to have on-hand at the office. It's very small so it can easily store in a desk drawer. Radio works great (reception is actually better than a very expensive one I have at home). Solar charging works great. Light is a little feeble, but a pinch is going to do the job just fine. Controls are a little difficult to use because of the small size of the device, so maybe frustrating for someone with poor eyesight or not-so-fine motor control. I recommend this for your emergency kit.",
      "rating": 5.0,
      "verified": true,
      "author": "A.F.",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "doesn't work",
      "text": "Worked a few times. Used it only 4 times when severe weather was about. Seems the radio stopped working when cel phone in house was interfering, such as when I was receiving a call on m cel phone. The radio shut off and WOULD NOT TURN ON AGAIN> Not a good buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Isadora G.",
      "helpful_votes": 3,
      "publication_date": 20190529
    },
    {
      "title": "Easily got a replacement for defective one",
      "text": "Edit: I got my replacement in today. It works! I was easily able to tune it. All I had to do was email the company and explain the situation. They got back to me quickly. I got it today. Everything works except the radio. Which is the main reason I got it. I only get static, the tune light never turns on. I have turned that knob as slow as possible. I have a Midland radio and it works fine so there shouldn't be a signal issue. I have emailed the company so if they help me out I will update this review.",
      "rating": 4.0,
      "verified": true,
      "author": "Bex",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "RunningSnail is the best",
      "text": "The radio is excellent. The one I received way back was put in a go bag to await emergency. As hurricane season approached this year it was out and tested. It did not do too well. I contacted the company via email 6/8/2020 and received a response the next day that they will be replacing the original. The new one arrived today 6/12. Looks great and I don't feel there will be any problems. This company and it's products are excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "VeniceDavid",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Great buy",
      "text": "This radio has been a great pickup. It was really easy to use since there are only a few buttons unlike some other radios I have seen with way to many buttons that you never use. The sound quality is not amazing but it's good enough for a small group. The little adapter that lets you charge your phone from the radio is really cool and useful. The flashlight is also decent. All together every part of it is pretty good but as a all-in-one it's a great buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Sk",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Perfect!",
      "text": "I just received this and so far love it. It was very easy to wind up and get started. I like all of the options to charge, the flashlight seemed bright and the radio sound was excellent. and am ordering a few more to have on hand for emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Familystuff",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great little radio for emergency use",
      "text": "Great little radio for emergency use. We lost power for 5 days this week, and this radio helped keep me sane. It will run all night on a full charge, and is easy to crank up if needed. The solar option is also a great thing. The sound is better than expected from such a small speaker. I'm very happy I had this in my emergency kit!",
      "rating": 5.0,
      "verified": true,
      "author": "ILuvMaine",
      "helpful_votes": 2,
      "publication_date": 20171104
    },
    {
      "title": "Still works",
      "text": "I dropped it lol but it is fine. My only complaint is it is a little small for me but that may be a advantage later. I listen to my forecast on NOAA and it works well enough. It is difficult to home in on a station but when you get it it sounds good.",
      "rating": 4.0,
      "verified": true,
      "author": "Samuel Carmona",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Excellent Disaster Preparedness",
      "text": "Last week the city of Denver was hit by a \"Bomb Cyclone\". The power went out in my apartment and I was left in the dark for about 12 hours. It was then that I realized that I had no disaster preparedness. So I decided to at least buy a flashlight. Then I found this little gem. Not only is it a flashlight, but a radio and a cell phone charger as well. It also charges by three different means-hand crank, solar cell, and usb mini charger. This is a great device for disaster preparedness. You just never know when disaster will strike, so buying something like this would be a great idea.",
      "rating": 5.0,
      "verified": true,
      "author": "Wallace Judd",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Best in class",
      "text": "I was supprised when it came in and worked well.... I have owned 3 types of these radios now and they were all terrible except this brand.... Will likely by another one to throw in emergency container as I know they work well now.",
      "rating": 5.0,
      "verified": true,
      "author": "JWJ",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Amazing Customer Service",
      "text": "Updating my previous review. I received a defective product. I contacted them regarding my concern and within a week they responded and replaced the unit. Great customer service!! Will purchase from them again and highly recommended this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe M",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Portable Power on the go. 2 times....",
      "text": "This product does everything it says it will and it does it with ease. I would recommend this product to anyone whose City suffers from power outages or on camping trips. Addition to my review after two uses it completely stopped working. It's junk",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Voytko",
      "helpful_votes": 0,
      "publication_date": 20191204
    }
  ],
  "product_meta": {
    "title": "[Upgraded Version] RunningSnail Emergency Hand Crank Self Powered AM/FM NOAA Solar Weather Radio with LED Flashlight, 1000mAh Power Bank for iPhone/Smart Phone",
    "rating": 4.5,
    "feature_bullets": [
      "New Design: 1000 mAh power bank for charging your iPhone & cellphone via Micro-USB cable directly, no need of adapter anymore;",
      "A Must For Emergency: Keep this AM/FM & NOAA weather radio with your family, get up to date with the latest weather and all hazard information for your area;",
      "More Than A Radio: Compact sized flashlight radio with 1W longer lasting powerful LED can be with you in camping, backpacking, hiking or any other outdoor activities;",
      "3 Rechargeable Ways: Micro USB charging, Solar charging, Manual hand crank to wind up the internal battery;",
      "What You Get: RunningSnail emergency radio, Micro USB cable, instruction, appreciation card, our worry-free 12-month warranty and friendly customer service."
    ],
    "specifications": {
      "Product Dimensions": "5 x 1.8 x 2.4 inches",
      "Item Weight": "7.8 ounces",
      "Manufacturer": "Runningsnail",
      "ASIN": "B01MFCFKG5",
      "Item model number": "MD-088s",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.5 out of 5 stars5,077 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#167 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 26, 2016"
    },
    "categories": [
      "Portable Audio & Video",
      "Radios",
      "Electronics",
      "Weather Radios"
    ],
    "price": 19.9
  }
}