{
  "website_summaries": [
    {
      "verdict": "An inexpensive full-body suit that gives your child added warmth.",
      "pros": [
        "Comfortable and does not interfere with swimming",
        "Neoprene suit with UPF 50+sun protection",
        "Easy-pull zipper for convenient dressing",
        "Slim fit",
        "Breathable",
        "Allows free movement",
        "Quick drying and lightweight",
        "Comes in a variety of colors"
      ],
      "cons": [
        "May arrive with a strong chemical odor, but it fades"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Horrible Chemical Smell",
      "text": "Bought two and they fit well and the quality is acceptable for a $35 wetsuit, but had to return both because they smell horrible. It's a very strong toxic chemical smell that didnt go away or lessen even after leaving them outside for 24 hours. I didn't try washing them, but I doubt that would do anything because the smell is embedded in the fabric. Item is made in China and all the tags are in Chinese.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 7,
      "publication_date": 20170917
    },
    {
      "title": "Grandma of goopies",
      "text": "We purchased two wetsuits for our grandchildren. One of them was entirely too big for my 6 year old. We returned it and obtained immediate refund. We ordered the size smaller and it fit well. They performed very well. I thought it was going to be hard to put on and take off, but I am happy to say that it was very easy. Very happy with the product. Would recommend it to a friend. Just as a recommendation, measure the child before ordering. They tend to run big.",
      "rating": 5.0,
      "verified": true,
      "author": "Elly Il",
      "helpful_votes": 6,
      "publication_date": 20170424
    },
    {
      "title": "Love this, but runs very large!",
      "text": "These are fantastic wet suits. We ordered a size 4 and 6 for our 5 & 7 year old girls. We ended up having the 7 year old wear the size 4 and the 5 year old wear the size 2. The size 2 fits our small 5 year old perfectly and the size 4 fits our 7 year old well (it's a little short in the arms and legs). We're saving the size 6 for when our kids grow out of the smaller sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Bunt",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "sub- standard size and material",
      "text": "I purchased two of these items, My nephew is 5 years old, he is small built , his height 41\"so I ordered smaller size only considering his hight. hoping every where else would fit nice and tight. unfortunately that was not the case, size two is what I ordered, it was short, the cut was not proportional, the sleeves were way short and the fabric was not thick at all . looks good until you put it on. the upper body was short , around his waist line and belly the suite bulges out ..... it is not what I expected at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Dari858@",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Order a size up",
      "text": "It does smell like others mention but not much worse than another one I bought that’s a different brand. The quality seems good but am returning it since it’s too small. I ordered a S2, my son is 42in tall and 40lbs. See pic for reference.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Odland",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Excellent quality",
      "text": "Just like a real wetsuit! Absolutely great deal, I highly recommend. My son is tall and slim so we had no problems with the fit, wouldn’t recommend for a well rounded size child though.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Braved the Alaskan Waters and won!",
      "text": "I ordered the medium for my 32lb 3’2” toddler knowing it would be a little big but last longer. Had it shipped to Alaska and 1) it arrived much quicker than expected and 2) worked perfectly. The lake temperate is freezing - sitting right around 74 degrees. My little one swam without a complaint in the world. Couldn’t be happier with this purchase not to mention the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Samson",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Great youth wetsuits!",
      "text": "Sizing by child’s height is spot on! These are well made wetsuits with nice stitched seams and smooth zippers. No problem swimming in 70 degree water and staying warm. As for the smell? They don’t smell bad, they just smell like ALL neoprene wetsuits. They are a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason's Pap",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Warm and comfortable",
      "text": "My son will not go to the pool in a regular swimsuit anymore since we got this. Keeps him warm and I only have to worry about putting sunblock on his face, hands and feet now. Other kids keep thinking he’s wearing a superhero costume!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz H",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "It fits 2 year old son",
      "text": "Have gone to the pool 5 times and my little 2 year old dont complain. It keeps hims mostly dry and warm. It does fit him about 1.5 inches long from the arms and legs but all i do is fold them. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Great Fit! Chart was exactly right!",
      "text": "Great Git! After reading the reviews I was able to buy my grandson this wet suit and it fits perfectly! He loves the red color and design. My grand son is 7 yr. 42 inches tall and 48 lbs. I ordered a size 4.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne W. Moore",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "I’m the real deal now!",
      "text": "My 11 year old loves her new wet suit and snorkel set! “I’m the real deal!”, she says. She’s worn it two days in a row at the pool and it’s very easy to get on and off. Size is true.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180918
    },
    {
      "title": "Thumbs up",
      "text": "Fantastic for the price!! Highly recommend. My kids can play for hours in the cold water now:)",
      "rating": 5.0,
      "verified": true,
      "author": "honeybee73",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Bad sizing",
      "text": "My oldest two kids have these wetsuits and they have been great. We ordered one for our youngest and I am very frustrated by the sizing. My daughter is size 6. The Medium is a size 4 and is way too small. The Large is a size 8 and is far too big. Why do these wetsuits skip sizes?",
      "rating": 1.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Decent affordable wetsuit",
      "text": "Seems like thinner neoprene. Fit well as described. They could have better cuffs at the wrists and legs, but for the price it is exactly what I expected. Not high quality, but useable for our needs",
      "rating": 3.0,
      "verified": true,
      "author": "Lovestoread",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "True to size; good value.",
      "text": "Bought M/4 for my 4 year old who is 42\" tall. Ended up fitting perfectly with some room to grow in. Good value, did its job of keeping him warm for swim class. Used to complain about how cold the water is and didn't hear him complain of the temperature at all. No more blue lips or teeth chattering! Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "FW",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Not happy with the product",
      "text": "Not happy with the product. I got this wetsuit in April and already by end of june. The red color in design has faded. Wetsuit looks dirty with patchy red color. Also after wash it shrunk.",
      "rating": 2.0,
      "verified": true,
      "author": "PRATIK S.",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "we bought two!",
      "text": "my kid outgrew the first one and we are wearing the second for her swim camp. highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Wen MM",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Good buy.",
      "text": "This is good buy. My lo never complains about being cold. It fits greats and She is 3yrs old",
      "rating": 5.0,
      "verified": true,
      "author": "Erica Brown",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Wore once then broke",
      "text": "It worked great for the first snorkeling adventure but the zipper broke at the end",
      "rating": 1.0,
      "verified": true,
      "author": "ConnieW",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "It was a good price.",
      "text": ". I wanted it for my granddaughter so she could swim in the pool when cool.",
      "rating": 5.0,
      "verified": true,
      "author": "annie carmichael",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Good fit, for a skinny kid, go smaller",
      "text": "Fits good but wasn't snug enough for my grandson, purchased the 4/5 for a skinny 4yr kid, he was still really cold after swim class, go down a size",
      "rating": 3.0,
      "verified": true,
      "author": "DL Happens",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "My son loves his wetsuit. We have used this ...",
      "text": "My son loves his wetsuit. We have used this is the local lake as well as the Pacific ocean. He has no issues putting it on himself and loves wearing it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Has smell",
      "text": "A little bit small and had smell when it open , returned .",
      "rating": 3.0,
      "verified": true,
      "author": "sueleilei",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Nothing",
      "text": "The swimming suit was okay just that it fit me a little big",
      "rating": 4.0,
      "verified": true,
      "author": "Jilda v.",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Rubs against neck",
      "text": "This wetsuite rubs on my sons neck till the skin is raw and painful.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica P.",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Zipper was defective",
      "text": "Didn't use til summer and found zipper was defective. Kept opening up in middle Now can't return or exchange",
      "rating": 1.0,
      "verified": true,
      "author": "K. Ung",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "WOW!!!!!!!!!",
      "text": "I wasn't sure what to expect with this wetsuit. I figured it was worth a try with how cheap it is. Boy was I pleasantly suprised. It is very thick and the sizing was right on",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Not a good option",
      "text": "Got a hole after 1 use; bought it to use for my son; after 1 use has a hole in the elbow area; used it in the swim suit water extractor",
      "rating": 1.0,
      "verified": true,
      "author": "Srihari",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Great color",
      "text": "I bought a size 9/10 for my daughter who is 55\" and 70 pounds. She wears a size 10 in most other wetsuit brands. This ended up being a bit too big. The color is beautiful though and she is easy to pick out in the water. She LOVES the wetsuit",
      "rating": 3.0,
      "verified": true,
      "author": "C. Long",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Terrible product. Not sure how they call this a ...",
      "text": "Terrible product. Not sure how they call this a wetsuit. It's thin and poorly made.",
      "rating": 1.0,
      "verified": true,
      "author": "J W.",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Four Stars",
      "text": "quality material but the sizing is not correct, so I'm returning the item.",
      "rating": 4.0,
      "verified": true,
      "author": "Ireen",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "smell is not good my little girl is skinny but it is expect",
      "text": "smell is not good my little girl is skinny but it is expect fit",
      "rating": 4.0,
      "verified": true,
      "author": "younkyung",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Cut slightly wide for my 10-year old",
      "text": "This wetsuit is cut a little wide. My 62-lb 4'10\" (totally average sized) 10-year old tried on the size 12, and the arms were barely long enough, but it was really wide in the tummy. I would reorder a 10, because the price point and quality seem right, but I think the arms would be really short, and the legs too.",
      "rating": 3.0,
      "verified": true,
      "author": "New England Adventurer",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Durable and Looks Great",
      "text": "The size ran a little large in the chest/torso area, but a great fit in the legs. Durable and keeps my son warmer when he is at swim practice. Would be great if they could add a flap at the top of the zipper to store the long pull strap while swimming. I highly recommend this for swimmers who chill easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Ruth Wallin-Davis",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Grandson loves it.",
      "text": "Purchased for grandson’s birthday. It arrived quickly and was better quality than I really expected. He loved it. Fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Tear",
      "text": "We got Tear in rear seam after 4th time wearing it ... and out of the return window of course",
      "rating": 1.0,
      "verified": true,
      "author": "Neil Pardasani",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "but worked great and kept my kid warm when swimming in color",
      "text": "Smells a little weird, but worked great and kept my kid warm when swimming in color temps",
      "rating": 5.0,
      "verified": true,
      "author": "Cam",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Four Stars",
      "text": "Nice one. Keeping in mind it runs small I ordered 2 sizes up and it fitted perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "K.",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Five Stars",
      "text": "Excellent quality, bought it for my little niece, and she likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "yasmin farah",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Awesome",
      "text": "Product arrived quickly and the in the correct color and size.",
      "rating": 5.0,
      "verified": true,
      "author": "David Rhein",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Great",
      "text": "Fit my grandson perfect. Easy to get on. Zipper works great.",
      "rating": 5.0,
      "verified": true,
      "author": "coachm",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "rubbing on the chest",
      "text": "After 2 times wearing this, my 8 year old complained pain in nipples because of the material rubbing. It is loose but still he complained the pain.",
      "rating": 2.0,
      "verified": true,
      "author": "Srinivasan Seshachalam",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Great Quality",
      "text": "Quality is great for the price. Fits my child perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "VAcr_829",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Three Stars",
      "text": "too big, she will have to wait a few years to wear it",
      "rating": 3.0,
      "verified": true,
      "author": "sharon",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Fantastic and Fun",
      "text": "My grandson loves his wetsuit! We bought it for his birthday. He wore it in the ocean while boogie boarding, swimming in the pool, and thought it was cozy enough to wear in bed. Super cool!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Four Stars",
      "text": "My 9 years old daughter is very skinny , even dough swimsuit is too tight",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "One Star",
      "text": "its very tight my daughter cant wear it very hard to put on her she is very sckiny",
      "rating": 1.0,
      "verified": true,
      "author": "Ordis",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Great quality but not true to size",
      "text": "Great quality but not true to size. The size 10 didn't fit my 9 year old boy whose 54\" and 80lbs. I'll be reordering the 12.",
      "rating": 4.0,
      "verified": true,
      "author": "BML",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Love it n my daughter love it",
      "text": "Love it n my daughter love it. It comfortable and nice n keep my kid safe n warm for hours",
      "rating": 4.0,
      "verified": true,
      "author": "Lexis",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Five Stars",
      "text": "This is a great little wetsuit for my kids. Petite ladies have also used it.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Hewitt",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "My son was comfortable in it",
      "text": "It fit as expected. My son was comfortable in it.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Smith",
      "helpful_votes": 0,
      "publication_date": 20170307
    }
  ],
  "product_meta": {
    "title": "Cokar Neoprene Wetsuit One Piece Swimsuit for Kids Boys Girls UV Protection for Swim Surf Snorkel Scuba Diving",
    "description": "Professional quality: As swim lovers ourselves, Cokar is clear about the high requirement of swimming enthusiasts. We select the finest material at the very beginning. Our mission is to provide absolute comfort and freedom for swimming. Every swimwear in our store is produced only after hundreds testing. We continue to improve each swimwear, to offer the best support and comfort feeling for every swimming enthusiast. Customer service: Send us an email if you have any problem making your purchase. Our professional customer service team will solve any problem you meet and promise a satisfied shopping experience for you. Customer satisfaction is our NO. 1 priority",
    "rating": 4.3,
    "feature_bullets": [
      "Neoprene Wetsuit for Kids",
      "Design: easy-pull zipper for convenient dressing",
      "Slim-fit: exquisite design offer perfect shaping and support",
      "Free movement: breathable, quick drying, light weight and soft on skin",
      "Your never regret choice; Fulfilled by Amazon, 100% satifaction guarantee"
    ],
    "specifications": {
      "Department": "Teen-boys",
      "Date First Available": "April 3, 2020",
      "Manufacturer": "Cokar",
      "ASIN": "B086QR5H2Z",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Diving & Snorkeling",
      "Outdoor Recreation",
      "Wetsuits",
      "Diving Suits",
      "Sports & Outdoors",
      "Water Sports"
    ],
    "price": 38.99
  }
}