{
  "website_summaries": [
    {
      "verdict": "Straightforward installation and a compact design makes this set a good overall option to check out.",
      "pros": [
        "600 watts of power",
        "Basic, reliable design delivers a decent quality of sound that is easy to hear in outdoor settings",
        "Mounting clamps are compatible with a wide variety of tubes and bars",
        "Includes stainless steel mounting hardware"
      ],
      "cons": [
        "Exterior enclosure isn't as durable as more premium speakers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Gotta have an amp!",
      "text": "Installed these a couple days ago without an amp n was pretty disappointed...almost sent em back but figured for the price I could get a small amp to go with em! That's where its at!!!! 500 watt 2 channel amp really makes these come to life! I'd buy em again tomorrow. Crystal clear highs n mids and impressive lows for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Guthrie Cogar",
      "helpful_votes": 2,
      "publication_date": 20190917
    },
    {
      "title": "Works well",
      "text": "When I opened the box there was a damaged mold to hold the nut in place for tightening. I had to wedge a screwdriver into it to act as a brace to remove the nut. Installation is all based from where you mount them and to what you mount them. They’ve worked well for me since the install.",
      "rating": 3.0,
      "verified": true,
      "author": "Devin Burkhouse",
      "helpful_votes": 2,
      "publication_date": 20181119
    },
    {
      "title": "Cheap speakers in an Okay enclosure",
      "text": "After 3 months I had one of the speakers stop working. Instead of uninstalling and paying for shipping I replaced the speaker inside with a boss 8\" speaker for $20. Major difference in sound quality between the two. Save your money and get something else unless you plan to just use the enclosures.",
      "rating": 3.0,
      "verified": true,
      "author": "Joshua Miller",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "you get what you pay for.",
      "text": "Awesome set of speakers. Great clarity. Would definitely recommend. Well it hasn’t even been a year since I have had these and to be honest they only lasted a month. Already changed the speakers out. They started distorting really bad. Even with a small amp. Only thing really good about then is the casings.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Luttrell",
      "helpful_votes": 3,
      "publication_date": 20180409
    },
    {
      "title": "They last only one week after installation! Very disappointed!",
      "text": "Not worth the time and money put into these speakers! I had them installed professionally! They sounded great for a week! After that started distorted sound! They sound like something has broken inside! I will have to remove them and return them!",
      "rating": 1.0,
      "verified": true,
      "author": "ntmc",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Good if you want to change out the speaker after purchase",
      "text": "These were crap. The housing is Amazing but the speakers themselves were cracking the first time we turned them on. I have no idea who to contact for a refund or where to send these back",
      "rating": 1.0,
      "verified": true,
      "author": "amand",
      "helpful_votes": 2,
      "publication_date": 20190702
    },
    {
      "title": "Fooled",
      "text": "I dislike that I purchased the set of 300 watt Rockville speakers that add up to 600 watts with both speakers , and a 500 watt amp blew them out in less than 2 days !!! So now I am purchasing the set of Rockville speakers that add up to 1000 watts and hoping that solves my problem !!",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Sound great but mounts are junk",
      "text": "The hardware included with the speakers is a bad design, the inset nuts free spin so there's no way of tightening up the bolts to mount to your wake tower, roll cage, etc. I drilled the mounts out and installed bigger bolts with washers and lock nuts. A little time consuming but once mounted I was very please with the sound quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Dalton Hinds",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Well worth the value",
      "text": "Easy to install, good sound quality, not a lot of bass but good enough. Great price. I am very happy with them. Used on my 2019 polaris razor.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Don't buy",
      "text": "These absolutley suck. Literally the worst buy I've made. Broke on installation and had to engineer them on just to find one already blown and the other very distorted.",
      "rating": 1.0,
      "verified": true,
      "author": "Leonard H.",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Good Value",
      "text": "This is a good value speaker option for Offroad use. I have 4 on my Polaris Ranger",
      "rating": 4.0,
      "verified": true,
      "author": "Gilbert T.",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Very nice",
      "text": "These speakers sound amazing. Although after 6 months I have one that is not working correctly. Id say these are good for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "GREG ROBINSON",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Hardware is garbage",
      "text": "2 of the mounting bolt on one of the speakers were stripped. I had to cut them off. The sound is good but the hardware is horrible.",
      "rating": 3.0,
      "verified": true,
      "author": "Jim Kautzman",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "These are large! But worked out great 😮",
      "text": "Worked out great on VW Thing. Mounted to roll bar behind rear seat perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181017
    },
    {
      "title": "cheap junk hardware",
      "text": "One bolt in the mount bracket of each speaker was either cross thread or had a bur on the bolt/nut as the mount is stuck so that I can not install. Never even got the bolts out to install. Very poor quality hardware... guess thats what $100 gets you in marine speaker pods. Pure junk before install",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Ford",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Love them!!!",
      "text": "This was a great addition to my JK. I already have 2 10s and powered front speakers. I needed these to make the whole system come to life! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Karyl",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Didn't last an entire hour",
      "text": "The speakers blew out within 40 minutes of the install. We didn't return them or ask for a refund, we simply kept the cases and updated the speakers themselves with higher quality ones.",
      "rating": 1.0,
      "verified": true,
      "author": "Rodrigo",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "Good bang for your buck",
      "text": "These speakers are loud. You really don't need a subwoofer with these unless you really want to feel the thump from bass that you could only get from a sub. I installed these on a razor and I'm very pleased with the sound these speakers put out.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernando",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Rockville customer service is horrible",
      "text": "Bought an set of these speakers in june, they did not sound great. Bought another set a month later and there was a huge sound difference between the first set and the second. I noticed the first set had no bass sounds and no deep sounds compared to the new set. These speakers are under Rockville`s warranty and after a week e-mailing then still haven`t sent replacements.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Ok but CHEAP",
      "text": "I installed these on my tower. They sounded great while I was powering them up and testing. The second time I used them on the water one of the speakers stopped working. They are cheap. Sounds ok but cheap. They should warranty them",
      "rating": 1.0,
      "verified": true,
      "author": "Landon Henderson",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Its worth the money!",
      "text": "I had to order a second set bc the first set came with the positive wire to the cone broke, the other speaker blew. But the second set i got is still rockin!",
      "rating": 3.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Just upgrade to American Made!",
      "text": "Product was packaged well but the long Allen head bolt was over torqued and ended cutting the bolt to even get the clamp off to install it. You get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Great speakers!",
      "text": "These are awesome speakers! Loud clear and so easy to install! They are a fantastic bargain!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Sounds good for the price",
      "text": "Sound is good for the price. My problem is with the POD. You can not swivel the mounts which really limits the mounting positions. Also, I would not run a huge amp with these. I'm just powering it with the 50 watts my deck provides. I had it hooked up to an amp and they get overpowered quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "Melany Clayton",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Good price good quality!",
      "text": "Very nice quality and very nice sound. Really clear! Only complaint is the rest mounting bracket is all plastic and I had one tap spin in the plastic when trying to remove the bolt. I got it out and it works fine now. For the money these are some really great speakers and I do recommend them to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "G Hughes",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Sound great",
      "text": "One of the least expensive tower speakers you can buy and they sound great for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott C.",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Clear sound",
      "text": "Great speakers for the price, very clear sound and easy to mount",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Get what you pay for",
      "text": "You get what you pay for. Not nearly as loud as I expected, distorts sooner than expected, then cuts in and out at high volume, which I am sure is by design to protect itself. I guess they are okay for a cheap speaker, but I should have spent more.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great sound",
      "text": "Great marine speakers! Finally after 2 other changeouts I can clearly hear my music (and so can everyone on the lake) while on plane and travelling at high speeds (60 MPH)!",
      "rating": 5.0,
      "verified": true,
      "author": "Corrine Ritzel",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Put heavier duty bolts in them",
      "text": "Sounds great simple to install. But the cheap bolts that come witb it were bent and threads smashed 3 out of 4 bolts on one bracket were stripped out in housing",
      "rating": 3.0,
      "verified": true,
      "author": "mark henry",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Rockville Rocks !!",
      "text": "Awesome speakers ! Rockville knocks it out of the park! Amplify these bad boys to get some killer sound ! I installed them on. 2018 Polaris General 4 seater and couldn’t be happier!!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Smith ",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Comes lose and screws strip out easy",
      "text": "So far so good. Great sound. The only problem i have it the brackets don't stay tight, so the speakers move after hitting a bump. And when installing the screw striped out.",
      "rating": 4.0,
      "verified": true,
      "author": "Rzr2015",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Replacement",
      "text": "Both already broke I just installed them over a month ago and there blown already.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "All 4 blew within a month.",
      "text": "Lasted 3 weekends before they blew. Juat outside the return window. Yaaaay.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew M.",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Junk",
      "text": "Mounting brackets are garbage!! The nuts for the screws pushed right through the plastic, a couple of the screws had bad threads therefore stripped the nuts out.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Bodily",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Get what you pay for",
      "text": "Cheap sound, poor quality sound voice coil rattling after using 2 times with 200rms amp, not a unicorn speaker for sure, you get what you pay for",
      "rating": 2.0,
      "verified": true,
      "author": "Brandon M.",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Good value speakers",
      "text": "Bought these for my off road vehicle. Sound quality is good, handle the soundstream amp and can turn the volume load enough to hear with windows down and top off. Very happy for the money spent.",
      "rating": 4.0,
      "verified": true,
      "author": "Frank F",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Speakers",
      "text": "Has some pretty good sound quality... installed on my 2015 wildcat and you usually have to spend at least 300-400 dollars on a sound system.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Nice product not that great of customer service",
      "text": "Wasn’t bad looks good never hooked them up I purchased the wrong size overall I’ll find a use for them",
      "rating": 2.0,
      "verified": true,
      "author": "Meh",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Amazing Speakers",
      "text": "These are hands down the best speakers for there price, Purchased 4 of them and have them set up on my 2019 Polaris razor XP 4, sounds amazing when we are out on the trails!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Barela",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Good for price",
      "text": "Sounds great for the money can’t beat that they definitely have some range to them and they have good build quality for the price I installed these in the bed of my truck and I use them for tailgating",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Marin",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Decent",
      "text": "Easy to install I put them on a truck for bed speakers",
      "rating": 4.0,
      "verified": true,
      "author": "Cacey taylor",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "DO NOT BUY",
      "text": "The speakers suck they were not loud at all the sound was real crackly and the housing on the speakers suck it’s all plastic and not very durable",
      "rating": 1.0,
      "verified": true,
      "author": "andrew barragan",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Faulty bracket",
      "text": "The product showed up with a faulty bracket, I need a replacement or my money back..",
      "rating": 1.0,
      "verified": true,
      "author": "Jeremiah F.",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Installed on my Polaris RZR and they sound really good with my 600 watt amp",
      "text": "Can’t beat them for the price. Built well and they made the bracket in the right location! Installed on my Polaris RZR and they sound really good with my 600 watt amp. Doesn’t have killer bass but they sound pretty good for what they are.",
      "rating": 5.0,
      "verified": true,
      "author": "eddie smith",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Don’t buy",
      "text": "They only lasted two weeks and the voice coil went out.. waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Isaacbrasell",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Can not handle 100 watts apiece",
      "text": "Hooked 4 of them up to a 400 watt prv amp and they lasted 2 minutes and popped no good do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "Joleen mckinney",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Four Stars",
      "text": "Speakers arrived very fast and sound much better than the price.",
      "rating": 4.0,
      "verified": true,
      "author": "bertha rodriguez",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Shipping was fast",
      "text": "Sounds really good for the price , put them on my ezgo golf cart",
      "rating": 4.0,
      "verified": true,
      "author": "JAMES D.",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Great quality built to last!",
      "text": "So glad I went with these speakers, installed them in my Jeep and it took less than 20 minutes. They have great sound and are heavy duty built to last! But then you won’t reget it.",
      "rating": 5.0,
      "verified": true,
      "author": "BJ Ballard",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Works great on Jeep's!",
      "text": "These speakers for perfectly in my Jeep. Sound awesome as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly C.",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Over all great value",
      "text": "No bass sounds good despite . Put on my rzr",
      "rating": 5.0,
      "verified": true,
      "author": "Terry harding",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Everything perfect.",
      "text": "I put it on my wrangler jk, its awsome. Thank you very much.",
      "rating": 5.0,
      "verified": true,
      "author": "MARVIN VÁSQUEZ",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "One Star",
      "text": "A voice coil is bad in one of them popping alot.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "High quality product",
      "text": "I’m running the 8” Rockville tower speakers on my rzr, they were an awesome purchase, shipped on time and are the y’all of the ride when I’m drowning out everyone else’s music",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan R Hill",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "These were a great compliment to the dual wake towers I installed.",
      "text": "Overall sound was what i was looking for on my side by side.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "BIG SOUND SMALL PRICE",
      "text": "Great speakers! Delivered quickly and sound awesome without breaking the bank. I have 4 of these paired with a 1,000 watt amp in my boat and they are loud! I was skeptical when they arrived and the canisters were plastic but they seem to be very durable and fully assembled ready to install. Please be aware of your mounting location for these as they are very large and in charge!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Taylor",
      "helpful_votes": 2,
      "publication_date": 20180419
    },
    {
      "title": "You will want or need an amp for these - don’t run them off of head unit power",
      "text": "For the $99 or less price tag these are amazing 8” speakers. I have 4 running off a basic kenwood 100w 4channel amp and they take 60hz and above at a very clear level and get loud. I wish the brackets were smaller profile but that’s how these seem to work. The plastic grill won’t rust like the painted steel ones you see on the cheaper speakers",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Rimert",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Only one works quality not great",
      "text": "Well, I should have opened them sooner but I have a life and well one works - the other one not a peep",
      "rating": 1.0,
      "verified": true,
      "author": "t.grish",
      "helpful_votes": 2,
      "publication_date": 20190503
    },
    {
      "title": "GOLF CART SPEAKERS!",
      "text": "I’m actually using these on my golf cart! I made custom mounts and put them on the rear canopy uprights, then ran the speaker wires inside the square tubing uprights. I paired them up with a Bluetooth marine Kicker amplifier and they sound great and look great too! I do recommend these speakers!",
      "rating": 5.0,
      "verified": true,
      "author": "CPS",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Killer marine tower speakers!!! Two thumbs up!!!",
      "text": "My husband installed these speakers on our boat and WOW... great quality, sound and durability. These speakers exceeded our expectations. Buy them! You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Great sound with my amp!!",
      "text": "Very nice, have the 1500 watt Rockville amp and its makes a great sound coming out of these speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Cory Jones",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Very nice addition to my jeep hooks to the rollbar easy awesome sound",
      "text": "Very nice addition to my jeep hooks to the rollbar easy awesome sound",
      "rating": 5.0,
      "verified": true,
      "author": "eric",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "You get what you pay for",
      "text": "The item was good for. Ther price had to get.them replaced once could of him defective but so for there good",
      "rating": 4.0,
      "verified": true,
      "author": "Eduardo l.",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Great product!",
      "text": "Speakers sound awesome but they only came with the longer screws for >2\" bars. These screws stick way out on the back of the speakers.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn F.",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "I love my speakers",
      "text": "I love my speakers. I put them in my 97 Jeep Wrangler. At 50 MPH I can hear my music. They rock!!!",
      "rating": 5.0,
      "verified": true,
      "author": "anna Montgomery",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "New sound for my Jeep",
      "text": "They look awesome. Haven’t gotten them hooked up yet but hope they sound as good as they look",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Miller",
      "helpful_votes": 0,
      "publication_date": 20180708
    }
  ],
  "product_meta": {
    "title": "Rockville Pair 8\" Black 2 Way 600 Watt Marine Wakeboard Tower Speakers (RWB80B)",
    "description": "Style:Pair 8 inch BLACKFeatures:\n\n Rockville RWB80B Pair of 8\" Black WakeBoard Tower Speakers Totaling 600 Watts (300 Watts per speaker)\n8\" Two-Way High Fidelity Speaker System\nAdjustable Nylon Mounting Bracket Reinforced With Embedded Steel\n1\" Polymide Dome Neodymium Midrange Tweeter\nBuilt-In Two-Way Crossover Network\nFully Marinized Against Salt & Fresh Water Conditions\nCompletely Water / Rust Resistant\nTerminals Are Sealed with Rubber Gaskets \nSpecially Tuned for PA Voice Over\nPolypropylene Mica Injected Cone with Santoprene Surround\nHigh BL Magnet Motor Structure\nY30 High Density Magnets\nOversized 1.25” Kapton Voice Coil\nLarge mounting screw accommodates roll bars found on many off road vehicles such as Jeep Wranglers, and ATV's equiped with a roll bar/cage.\nColor: Black",
    "rating": 3.8,
    "feature_bullets": [
      "Rockville RWB80B Pair of 8\" Black WakeBoard Tower Speakers Totaling 600 Watts (300 Watts per speaker). 8\" Two-Way High Fidelity Speaker System.",
      "Adjustable Nylon Mounting Bracket Reinforced With Embedded Steel. 1\" Polymide Dome Neodymium Midrange Tweeter. Built-In Two-Way Crossover Network.",
      "Fully Marinized Against Salt & Fresh Water Conditions. Completely Water / Rust Resistant. Terminals Are Sealed with Rubber Gaskets . Specially Tuned for PA Voice Over.",
      "Polypropylene Mica Injected Cone with Santoprene Surround. High BL Magnet Motor Structure. Y30 High Density Magnets.",
      "Oversized 1.25” Kapton Voice Coil. Large mounting screw accommodates roll bars found on many off road vehicles such as Jeep Wranglers, and ATV's equiped with a roll bar/cage. Color: Black."
    ],
    "specifications": {
      "Product Dimensions": "24 x 15.5 x 12.5 inches",
      "Item Weight": "17.34 pounds",
      "Manufacturer": "Audiosavings",
      "ASIN": "B01M6DAJ6Z",
      "Item model number": "RWB80B",
      "Customer Reviews": "3.8 out of 5 stars182 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#64,396 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 27, 2016"
    },
    "categories": [
      "Marine Electronics",
      "Electronics",
      "Marine Speakers",
      "Musical Instruments",
      "Car & Vehicle Electronics"
    ],
    "price": ""
  }
}