{
  "website_summaries": [
    {
      "verdict": "A smart foldable portable table that looks good and is easy to set up.",
      "pros": [
        "One-piece design for easy setup and breakdown",
        "A clean and professional bamboo finish",
        "Adjustable height and easily foldable for storage",
        "Comes with a travel bag"
      ],
      "cons": [
        "The travel bag isn't very durable",
        "Table top is slightly heavy and bamboo finish may chip easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easy to unfold and set up and equally easy to ...",
      "text": "I purchased this table to take to a scrapbooking event with some friends. Everyone was so interested in my table and asked where I purchased it. I gave them the information so they could check it out on Amazon. The tiny size and carrying case were a big hit. Easy to unfold and set up and equally easy to take down. I do have one small thing I would like to mention - stay away from the joints as you fold the legs back down - I seriously pinched a finger! Ouch. I'm much more careful now.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna S. Lacroix",
      "helpful_votes": 12,
      "publication_date": 20161025
    },
    {
      "title": "This table looks very nice, I really like it",
      "text": "This table looks very nice, I really like it. The combination of colors look very good. I am very happy with this table.",
      "rating": 5.0,
      "verified": true,
      "author": "rodrigo triana",
      "helpful_votes": 23,
      "publication_date": 20161023
    },
    {
      "title": "super easy to use",
      "text": "This is awesome. I looked at numerous tables and even ordered a couple that had to be sent back. Then I found this one. It is SO clever the way it folds and is super easy to use. I have arthritis in my hands and have no problem at all. I have no hesitation in recommending this table. I bought it as a command center for my drone flight operations and so it goes into fields, and other non-usual locations.",
      "rating": 5.0,
      "verified": true,
      "author": "cmt",
      "helpful_votes": 10,
      "publication_date": 20161028
    },
    {
      "title": "Adjustable legs really makes this table stand out",
      "text": "This is an excellent table especially if you need to picnic on a hill and need 2 adjustable legs to level out the table. There are four legs which of course is to adjust the height, but I just think two of them allows you to level out on a hill. The sellers don't talk about this feature enough. I am in the envy of all the concerts that are outside that we go to",
      "rating": 5.0,
      "verified": true,
      "author": "Carwizard",
      "helpful_votes": 8,
      "publication_date": 20170506
    },
    {
      "title": "The Envy of Concert Goers",
      "text": "Purchased this table because the outdoor concerts we attend are on a hill, and this table has adjustable legs. We've had so many people ask us about it after we're set up. Now I need to find a little clip on umbrella for the preconcert dining to keep the food out of the sun! It's so easy to set up and collapse. It's all one piece and has a bag. I do have to say, it's kind of heavy (compared to our chairs) but worth it. It folds up small for the size. Also love that it's bamboo. The price is a bit daunting, but it'll last for a very long time, if not forever!",
      "rating": 5.0,
      "verified": true,
      "author": "Ethel Mertz",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great table love the adjustable legs.",
      "text": "Downgraded my review since there has been no vendor feedback for my issues. Otherwise the table is great, had questions and compliments on it at a vineyard outing. Two minor issues as shown in the pictures. Missing screws for one of the leg supports. Nothing I couldn’t fix. Next item is the zipper. The first time I went to zip the bag, the zipper pull broke in half. Otherwise, ingenious how it folds up and I like the adjustable legs. Adjusting each leg is also good for leveling the table on uneven ground.",
      "rating": 2.0,
      "verified": true,
      "author": "Bryan Lantrip",
      "helpful_votes": 3,
      "publication_date": 20180829
    },
    {
      "title": "Great Little Table!",
      "text": "I bought this table specifically to use as a grooming stand at cat shows. What I wanted was something not too wide (rectangular rather than square), that was in a compact and easy to handle form factor when folded, that allowed me to put items underneath it, that was fast and easy to set up and put away, and that was pretty darn sturdy when set up at maximum height. This table met all those requirements. I just bought it last week and used it for the first time this past weekend, and it was perfect for what I needed. I'm very happy with this purchase. Great little table.",
      "rating": 5.0,
      "verified": true,
      "author": "Elanor",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great Table",
      "text": "We were looking for a compact, fold-able table that we could take with us when tent camping. There are many options out there, but this table offers an adjustable height and a small pack size so we decided to give it a try. The table is constructed of high quality materials and is assembled well. As other reviewers have mentioned, the bamboo table top is almost too nice for camping. It wouldn't look out of place indoors, that's for sure. The table is easy to use and is very stable, even at the maximum height. I love being able to individually adjust the legs - it really helps on uneven surfaces. I wouldn't hesitate to recommend this table to anyone...",
      "rating": 5.0,
      "verified": true,
      "author": "Sbox98",
      "helpful_votes": 2,
      "publication_date": 20170818
    },
    {
      "title": "Great quality, easy up/down, and very handy",
      "text": "I bought this for our RV 5th wheel with a few needs in mind... extra kitchen work space, coffee table (TV dinner table), and outdoor table. The quality is great, and it sets/breaks down quickly and easily. It's sturdy, and we've found it to be very useful. While the legs can be shortened (coffee table height) and lengthened (slight lower than standard dinner table)... I wish it had the option of being just a tad taller for when we use it as a prep surface. We still use it all the time, but when it's in the kitchen we aren't using it cut on because of the inconvenient height.",
      "rating": 5.0,
      "verified": true,
      "author": "Melle12",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Fantastic sturdy wooden table",
      "text": "This is a fantastic wooden table with that is really sturdy and not wobbly. Two screws had ripped out in shipping. With a matchstick and screwdriver the screws were replaced. The screws were in the bottom of the bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Drgas",
      "helpful_votes": 6,
      "publication_date": 20161018
    },
    {
      "title": "My favorite table! All my friends want one too!!",
      "text": "I bought this table at the beginning of quarantine because I wanted to be able to easily store it under my bed when it was no longer being used. This table has been so awesome for my WFH lifestyle. I don’t have enough room in my bedroom to add a desk, so I just have this propped against my bed and it works well! Because the height is adjustable, I can use it anywhere, take it downstairs, you name it! So easy to set up, so easy to store. Get yourself one now!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "AP",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "One piece folding table",
      "text": "Portable and multipurpose. I bought a large one and glad that I can use it as a makeshift study/work table. I have space for a laptop, a lamp, a large book stand and a large pen holder. I placed it in a corner to maximize it’s workspace. I even have a place to write! I use a folding padded chair from Costco as it is perfect for this table’s height.",
      "rating": 5.0,
      "verified": true,
      "author": "Mich.L.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Awesome product!",
      "text": "We got this to keep in our RV and use as a little table to have coffee, lunch, dinner, etc. It is super-well-made and we LOVE IT!!! I will buy from this seller again if I need something they offer; you can tell they are innovative and very forward-thinking. The hardware is sturdy, the bamboo is a great choice for sustainability and the whole folding design concept is brilliant!!! We'll take it whenever we go tailgating too!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven D. Unik",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Best foldable outdoor small picnic table we have found",
      "text": "After much searching around, we finally found a table that does everything we need it to do. We use this very nice looking picnic and outdoor casual dining table for wine events around Napa Valley, outdoor music festivals and camping. It is solidly built, and folds up small. The case is just large enough to not have to struggle with re-inserting the table for storage. Most importantly, the table legs are extendable which means you can always get the table level even when the ground isn't. It is definitely worth the cost and looks NICE.",
      "rating": 5.0,
      "verified": true,
      "author": "Germanyguy",
      "helpful_votes": 3,
      "publication_date": 20161106
    },
    {
      "title": "Thus is a quality item worth the price.",
      "text": "This table is the best portable table I've owned. It is not heavy to carry, yet is solid when set up. The hardware is quality, which provides a good strong structure to work on. I like the adjustable height, which gives me options when sitting in different chair heights as well as freedom to stand and work above the table when necessary. This is a well made product and case. It is worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorenna",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Great Little Table!!!",
      "text": "I bought this so when I needed a table while out camping, I would have something easy to use. This is a great little table and very easy to setup and stable. I would greatly suggest buying the cargo net accessory since it adds to the function and stability of the table.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Beckworth & Co. portable table...",
      "text": "The SmartFlip table is a quality product. It is extremely easy to open and close, and it comes with a zippered carrying case. THERE IS NO ASSEMBLY REQUIRED! Just unfold the table as shown in the directions (and yes... there are step by step pictures with the written directions). I would caution anyone thinking of buying this table to check its dimensions as given in the product description, to assure yourself that it's the size & height you are looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "manxcat",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "We love this table",
      "text": "We love this table. We purchased another table first. It was pretty. But flimsy, and poorly constructed with screws coming out the first time we put it up in our living room to test it out. And the legs were so rickety we were afraid our dogs would topple it. This table from Beckworth is the complete opposite. Well made. Very stable. Easy to assemble for use. All that and it's very pretty. We are incredibly pleased with it and can see ourselves enjoying it for a long time to come.",
      "rating": 5.0,
      "verified": true,
      "author": "LV Reviewer",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "MUST HAVE",
      "text": "I literally use this for everything. It pops us so easily! It comes with a nice carry bag that it can actually fit back into time and time again! I looked a few of these and this was the winner. DO IT",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "excellent table",
      "text": "This is a very solidly-built folding table. The quality is truly impressive, and it folds up easily. It's worth the higher price tag. It's a little on the heavier side but that's because of the solid wood. I'm very impressed with the table and would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "babs",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Excellent design",
      "text": "This is the perfect table for picnics and especially car camping - folds down to a compact size - I especially love the independently adjustable legs for uneven surfaces - also makes a perfect takeoff /landing pad for drone enthusiasts",
      "rating": 5.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 3,
      "publication_date": 20170506
    },
    {
      "title": "Well engineered table - but came with a few scratches.",
      "text": "The engineering of how the table folds up and sets up is outstanding. Dirt simple to use and has a bit of needed weight so it won't blow away or otherwise become unbalanced like so many of the much lighter portable tables. My only gripe, and reason for not giving it 5 stars, was that my \"new\" table came with a few scratches in the table top that somewhat marred what would be a beautiful wood surface. I know the surface would probably get some scratches/gouges anyway after a period of use, but I didn't expect them to be there right out of the box.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Sturdy and easy to set up.",
      "text": "This is the perfect table for use in my small trailer and for use outside on camping trips. I haven't had a chance to use it yet but I have set it up. It's just what I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyn Thomas",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Best Portable table",
      "text": "We needed a table to set our computer on when we travel. It has plenty of room for 15\" laptop and mouse. It was the only table that allows our legs underneath without obstruction when sitting. It is very portable and strong enough for our use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bach911",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Great Quality Top! Light and very portable. Legs wobblier than I'd like",
      "text": "I purchased this as a portable table to use to conduct audio interviews. It's SO easy to \"unfold\" and set up, lightweight, great quality top. The legs could be studier though. The table is a bit wobbly. If you put anything on the table it will wobble a little.",
      "rating": 4.0,
      "verified": true,
      "author": "Dangerboots",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Solid, sturdy table.",
      "text": "Nice, quality table that unfolds and folds up easily. Sturdy and easy to clean; adjustable legs make it quick and convenient to level on uneven ground. Comes with a good case. I like it so much I'll likely buy the larger version for my next camping trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Colorado Smart Shopper",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "The second one is great...",
      "text": "I love the design of the table. The wood top is definitely an upgrade to the metal ones. It seems sturdy enough for bus camping and the legs are easily adjustable. I knocked a star off because the first table I received had significant splitting on 3 of the 4 wooden slats and there was glue remnants on the top. It wasn't difficult to see the issues so there may be a quality control issue. I received the replacement promptly and the second one is very nice.",
      "rating": 4.0,
      "verified": true,
      "author": "vidanovo",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Love this table -- my favorite office accessory",
      "text": "I use this table in my nutrition practice: coffee-table-style (short legs) when I'm meeting with clients, and with extended legs when I've got some quiet time in-between clients and need to do \"desk\" work. I love how neatly it folds and slips behind the couch, taking up very little space in my tiny office. Despite the picnic-table-feel of the aluminum legs, it's quite elegant in a minimalist sort of way. It folds and unfolds very smoothly, and when it's set up it's very stable -- no wobbles -- so great for typing and writing on. I might even use it for a picnic one day! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Conner Middelmann-Whitney",
      "helpful_votes": 2,
      "publication_date": 20170725
    },
    {
      "title": "Useful",
      "text": "The top is sturdy and nice looking other than the edges which are rough. The legs are adjustable but quite spindly, causing the table to rock if pushed with the least effort.",
      "rating": 4.0,
      "verified": true,
      "author": "Diantha of toledo, oh",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great portable and sturdy camping table",
      "text": "I've purchased various camping tables over the years and the Beckworth is by far the most sturdy while providing sufficient surface space to place 2 plates, drinks and phones without being cramped. Not the cheapest table, yet it should provide years of enjoyment based on how it's built.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Thomas",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Great attractive table for our RV",
      "text": "Great table, we always seem to get compliments on it. I love the adjustable legs and the fact it folds up nicely. We use it in our RV and comes in handy when on the beach, campsite, or in the trailer. We bought our table from Pratico Goods and they are fantastic. Had an issue and they corrected it quickly. Very trustworthy seller",
      "rating": 5.0,
      "verified": true,
      "author": "Lodi601",
      "helpful_votes": 2,
      "publication_date": 20170119
    },
    {
      "title": "A quick set up",
      "text": "After reading reviews before we purchased it is more than I expected. Very nice and easy and we have used in many ways for the holidays! Wrapping, displaying, extra table for desserts and put wine and glasses on",
      "rating": 5.0,
      "verified": true,
      "author": "DOYLE ADAMS",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Great product",
      "text": "I purchased this table to take camping to set our barbecue on. It folds so easily and nicely and is very compact to store when traveling. It is easy to assemble and disassemble. It is sturdy, however the barbecue we have is on the heavy side so it did tend to wobble very slightly from the weight of it. If you use it for something lighter, it shouldn't be a problem. All in all, we love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cruzeee",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "What a sweet table",
      "text": "This is a great little table. I love the way it folds up to a small footprint - I bought it for my RV to hold my BBQ and small is good on an RV. I will see how it holds up over time. Delivery was prompt and I found no damage to the table as others have. Came boxed in a box.",
      "rating": 5.0,
      "verified": true,
      "author": "Rickk",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Can one leg be exchanged?",
      "text": "Love this table. One problem...one leg won’t lock into place so the table collapses if any weight is put on that corner. Can I exchange one leg?",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Love this table",
      "text": "Love this table. We have a shuffle board court that we needed an drink/appetizer table to be along the garden while we're playing. I needed something sturdy for the breezes and weight of the items to be on it and weather proof for spills, along w/ have flexible legs to adjust to the uneven ground. This table is perfect!!! And we can take it on the boat with us for lunches on a beach. Really a great table and it comes w/ a carrying bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunnys64",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "I love this table",
      "text": "I love this table. We use it as a cocktail table at the low height and as a dining table or work table at the higher height. And it looks so much nicer than most camp table. It fits in the small storage compartment where we keep our folding chairs in our 21 foot Pleasureway Lexor.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ames Mitchell",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Fantastic Table for the Most Part!",
      "text": "This is a great table. The way it folds out and the versatility of it is incredible. Folds down SO small and gets SO big! Love it. The only downside is the chemical smell. Stinky. Otherwise it would have been a five star table.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Love it. What a great little table",
      "text": "Love it. What a great little table. High quality for a small price. I use it for car camping and found it nice to have around. It is amazingly stable at the low leg height. A pleasure to look at.",
      "rating": 4.0,
      "verified": true,
      "author": "LA-Sputnik",
      "helpful_votes": 3,
      "publication_date": 20161027
    },
    {
      "title": "Dogs love it",
      "text": "Great table...very sturdy...perfect for what we need. We needed a short bench to help our dogs into the back of our SUV that, when folded, didn't consume lots of space. The 16 inch height is ideal for our medium size dogs. We added stick-on nonskid pads to prevent slips and it worked like a champ for both loading and unloading.",
      "rating": 5.0,
      "verified": true,
      "author": "pamela w",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "Quality product",
      "text": "Well made , expensive, only used it twice so far hope it will last a long time . You get what you pay for",
      "rating": 5.0,
      "verified": true,
      "author": "mnm",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "So easy to set up.",
      "text": "This is prefect. It folded up really small and the quality was great. It was very easy to set up and break down. Only drawback was it is a little heavier than I expected but I would still buy it again even knowing that just because it is super easy and convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Great buy. Used it in my glamping trip",
      "text": "Great buy. Used it in my glamping trip! Bought the 2 smaller ones to use as side tables. And the lager one for a coffee table. Love the fact that it's bamboo and has a nice furniture look. And it folds up!",
      "rating": 5.0,
      "verified": true,
      "author": "Marisa Linton-Smith",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Very nice table, a bit short to use as a desk",
      "text": "I needed a table to use as a portable desk that wouldn't take up much space. This certainly doesn't take up much space when folded, but it's a bit short to use as a desk for adults. I'm 6'1\".",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Absolutely love this table",
      "text": "Absolutely love this table. It's pefect. The construction is good also. No loose screws, no scratches, no dings. The design and fuction are excellent. I'll happily use it for camping. I'd give it 10 stars if I could.. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180319
    },
    {
      "title": "Foul smell",
      "text": "The table was delivered in a bag with foul smell and jammed zipper. After washing it, the smell still lingers on. The zipper is easily jammed; a nuisance indeed. The alignment of bamboo planks is slightly out (slightly uneven table top). Not too sturdy.",
      "rating": 3.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 2,
      "publication_date": 20180830
    },
    {
      "title": "Very well designed",
      "text": "We use this for picnics or other outdoor events. LOVE the adjustable height so we can use at outdoor events that require low chairs or picnics when using regular height chairs",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Cox",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Great small portable table",
      "text": "I got this table for my husband to use for his ham radio equipment when we visit our daughter. It has a beautiful top and sets up very easily. My husband is very pleased with it. It arrived just a few days after ordering and in great condition. I love the fact that it folds down into a small size for transport and has a nice carrying case. Of course it isn't as sturdy as a regular table but is a great small portable table. Exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "G. I. NE",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Best Coloring Table EVER!",
      "text": "This table is perfect for my adult coloring lifestyle!! It is the right height for my chair and doesn't hurt my back or shoulders. Finally the perfect coloring table!! Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 2,
      "publication_date": 20161109
    },
    {
      "title": "Too Loose, Not As Appears",
      "text": "It's not like shown in the photo, it's saggy and loose. I had to make sure I ordered the right one for my table it was so loose, and it was. Oh well. Not very attractive.",
      "rating": 3.0,
      "verified": true,
      "author": "j.m. brin",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Think will be perfect for coffee table use and two person dining",
      "text": "Purchased to use outdoors but needed compact storage since for RV travel. Think will be perfect for coffee table use and two person dining. Probably will look for some kind of table cover since top looks very utilitarian - maybe just place mats.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "modern elegance for your camp site",
      "text": "Very nice materials, light weight. Adjustable legs twist tight and accommodate uneven terrain. I'd like to see hinge braces lock better--keep your fingers clear when lifting the table.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich N from NY",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "This table is perfect for what we needed",
      "text": "This table is perfect for what we needed. We were totally the hit of the wine fest in the park when I pulled that out and set up our tasting samples. It is solid, stable, and easily compacted into a nice carry bag. The legs being individually telescoping allows for uneven ground to be no issue making the table level. Fantastic little table that is stable like a big table.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre'",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Sturdy",
      "text": "You to examine the product and understand it then you will love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Osbon",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "This table is nice, adjustable height",
      "text": "This table is nice, adjustable height, fairly stable for a little camp table. I bought it to take to retreats as a sewing table and it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "YaYa",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "bamboo portable table",
      "text": "the table is nicely made but the only issue is that it is very unsteady. The legs do not seem as durable as I would have hoped but time will tell.",
      "rating": 3.0,
      "verified": true,
      "author": "p.m",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Bamboo table top folding personal table",
      "text": "Well engineered and well-built, this small table easily adjusts up or down; as mentioned in other reviews, you can even adjust one or two legs at different heights to account for slope. Hopefully the manufacturer will make (slightly) larger tables of equal quality, as this one just a little too small for two people to eat on together.",
      "rating": 5.0,
      "verified": true,
      "author": "BobfromCalifornia",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Love this table!",
      "text": "This table is fantastic for uneven ground. I'm glad I ordered this particular table because you can adjust each leg by inches or fractions of inches. Great for hillside concerts. The quality appears to be excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "beachappy",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Perfect lightweight for my camping trips.",
      "text": "This is such a great foldable table. I’m short so the height isn’t a problem for me but for my 6’4 companion it was a bit low even st it’s highest setting. Be sure to keep that in mind when ordering. The dimensions are listed.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda C. Meehan",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Beckworth SmartFlip folding bamboo table",
      "text": "Love this thing! Sets up quickly and stores in a small space.",
      "rating": 5.0,
      "verified": true,
      "author": "Desert Rat",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Well made, functional and nice looking too!",
      "text": "Very well made and also attractive. Took it to an RV gathering and everyone who saw was impressed. Folds up really small which is very important to use since we use a Teardrop trailer. I like that each leg can be adjusted individually so that you can use it on uneven ground.Not a table where more than 2 can sit around but we use it for meal prep and cooking on.",
      "rating": 5.0,
      "verified": true,
      "author": "No Pax",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Looks great.  Excellent folding mechanism.",
      "text": "Awesome table for camping, picnics, or even just outside on a deck.",
      "rating": 5.0,
      "verified": true,
      "author": "WuLiMaster",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great Table. Highly Recommended.",
      "text": "Easy to setup. Great build quality. Love the adjustable height and the fact it folds into a very small package and comes with a nice bag to store it in. Used it for the first time while camping and it was a great extra space to work on while preparing meals.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan & Danni",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "but this item is amazing. It's quite solid and fits in my luggage",
      "text": "I never thought I'd get excited about a portable table, but this item is amazing. It's quite solid and fits in my luggage, as I need to take a table on a trip. It sets up easily and folds up just as easy and the carrying case is perfect. You won't go wrong with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Usually happy Amazon.com customer",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "the concept is a great idea so I am going to try to modify ...",
      "text": "Unfortunately I bought this for a different table and it does not fit. Although, the concept is a great idea so I am going to try to modify it so I can use it for the table I purchased it for.",
      "rating": 4.0,
      "verified": true,
      "author": "timetoshop",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Test leg subility before using.",
      "text": "The table fell over several time and disrupted the event. One of the legs never extended properly enough for us to be depend on. Embarrassing event.",
      "rating": 2.0,
      "verified": true,
      "author": "Judy Knapp",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Perfect table. I use it as a table for ...",
      "text": "Perfect table. I use it as a table for my autoharp. It packs up easily and is small enough to tote around. It is sturdy, stable and adjustable to my needs in different venues. I'm so glad I found it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie HW",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Quality one piece foldable table.",
      "text": "Love this table, especially the quality of the table top and the way it folds up. It's all one piece so there's no putting things together or screwing things in. Just fold it out and go.",
      "rating": 5.0,
      "verified": true,
      "author": "Ritz",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Nice camping tables",
      "text": "These are compact and set up and fold back up easy.",
      "rating": 5.0,
      "verified": true,
      "author": "uno1",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "perfect table to store and use for camping",
      "text": "perfect table to store and use for camping. folds easly and strudy with items are placed on table. Used it for camping outdoors and was simple to assemble. great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Eji3511",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "great travel table",
      "text": "great travel table. Got this for when on construction sites very durable and easy to use. The Superintendent on the site liked it so I am ordering another one",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Great size",
      "text": "We gave this table to our daughter for her cosplay weekends. The girls run out of counter space for their makeup and costumes. This table is the perfect size, folds up small and isn’t too heavy to carry. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Dunivin",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great little table",
      "text": "This table is perfect for a quick small table. The way it folds up makes it easy store. The adjustable legs are also very useful. The whole design is very smart, and the quality is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Hattette",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Sturdy table",
      "text": "Great table. Sturdy, easy to set up and take down, nice carrying bag.",
      "rating": 5.0,
      "verified": true,
      "author": "moniquec68",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "The 1 thing wrong",
      "text": "Great looking, great size. The legs however do not lock well and I'm constantly having a leg retract while using. Quite annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen Bennett",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Five Stars",
      "text": "Very nice looking and useful table. Light weight and easy to fold and unfold. Great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "This Table is Great quality and was exactly what I was looking for",
      "text": "This Table is Great quality and was exactly what I was looking for , I might even order another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn Smith",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "but it is heavy and not easy to put together",
      "text": "It's ok for what I need it, but it is heavy and not easy to put together. I thought of returning it, but it is a little late now.",
      "rating": 3.0,
      "verified": true,
      "author": "Verdecia-Paz",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Airshow tested",
      "text": "New tent to Oshkosh airshow for a week of camping under my plane. Severe thunderstorm the first night with strong winds. Stayed nice and dry. Tent is cavernous for one person. Easy to set up. Could use a better instruction though on how to set up fly, but I figured it out pretty fast. Great tent.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Ricciardelli",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Did not fit table",
      "text": "Did not fit table that said it would fit. Just tried to use it for our first camping trip and now can’t return it. ☹️ The window to return it closed on June 29.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Easy to put up.  Sturdy,  Well Made.",
      "text": "This was a Christmas present. It was set up that day which was easy and it seemed sturdy and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "shellhunt",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Very nice table",
      "text": "Love the table we can adjust it to any height we need. It is made well and folds up so nice & fits in the nice black carry bag it came with.",
      "rating": 5.0,
      "verified": true,
      "author": "fintime",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Five Stars",
      "text": "I love the table. I've been using it, next to my telescope, to support my laptop, binoculars, flashlight, etc. It's perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas H",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "Well built with a nice table surface",
      "text": "Well built with a nice table surface. Easy to unfold and fold. Leg length is separately adjustable for each leg, which is nice for use on uneven ground.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Campbell",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "A table for travel and tight spaces.",
      "text": "Love this table! Especially since I live in a small space. It’s easy to assemble and it’s amazingly compact to store! I can even take this table with ease to the beach!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Young",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Sturdy and well designed for the intended use",
      "text": "Just received the table (about a week). Well designed. Sturdy and well designed for the intended use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Best all around small portable table I’ve ever owned!",
      "text": "Easy to deploy and take down. Fits great with other gear in SUV. Need to buy a couple more for my buddy’s so they quite putting their sh!t on mine!",
      "rating": 5.0,
      "verified": true,
      "author": "QuietRover",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Awesome portable table",
      "text": "I needed something small to pack easily in my RV. This is perfect!! And so easy to set up!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki L. Faulkner",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Simply the best of this type of table!",
      "text": "Quality construction, lightweight but sturdy, easy to fold/unfold/pack & carry. Best table I've found with this type of capability.",
      "rating": 5.0,
      "verified": true,
      "author": "Pygar",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "This portable folding table is perfect for my horse shows",
      "text": "This portable folding table is perfect for my horse shows. It is lightweight, folds easily and the legs adjust. I love it! Thank you, Linda C",
      "rating": 5.0,
      "verified": true,
      "author": "Linda C",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "Excellent table for a wheelchair.",
      "text": "Very accommodating for my wheelchair, nicely made... one of the slats split. I use it to eat on, to keyboard on, crafts, excellent for every day use.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Uneven ground is conqured.",
      "text": "An absolute must for anywhere that you have uneven ground.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Quality and Useability for all occasions",
      "text": "I wanted a table that was well made, (material that would last) easy to open, collapse and store. The Beckworth had all those characteristics.",
      "rating": 5.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Absolutely perfect for the beach",
      "text": "I bought 2...one for the beach and one for the wineries! Needs to be a little bigger (or use 2) and wineries. Absolutely perfect for the beach!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanja Callahan",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Bamboo table",
      "text": "Good looking portable table. I am using it for my gun vice/shooting rest and it is a good fit. Leg adjustment is a very good design. Recommend it and can visualize a myriad of uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Kleve",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Bamboo portable table",
      "text": "I purchased it for an art class. We do watercolors at the park and this table is perfect for it. It's very easy to put together and take down, and it fits perfectly in my car trunk. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Bartizal",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Money Well Spent",
      "text": "I wanted a portable table for working at some clients. This table is well constructed! Sturdy, with a good height, lots of room to work with, and fashionable too. It’s a 5 STAR!.",
      "rating": 5.0,
      "verified": true,
      "author": "Rabindra",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Excellent",
      "text": "Perfect small table. Really well made and highly portable with the carrying case. Being able to easily change the height is a wonderful feature.",
      "rating": 5.0,
      "verified": true,
      "author": "MARNC",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Smart Design",
      "text": "Sets up & breaks down easily. Legs adjust to keep table level anywhere. At full height this works with conventional chairs as a side table, or front table / desk for small / short bodies. My 5’3” wife finds it also works as a desk with her iPad.",
      "rating": 5.0,
      "verified": true,
      "author": "john m mack",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Very well made.",
      "text": "Very well made and a snap to set up. I use it to perform magic and so I needed something portable and easy to set up - this fits the bill perfectly. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadira Lorin",
      "helpful_votes": 0,
      "publication_date": 20161002
    }
  ],
  "product_meta": {
    "title": "Beckworth & Co. SmartFlip Bamboo Portable Outdoor Picnic Folding Table with Adjustable Height & Carry Bag - Standard",
    "rating": 4.5,
    "feature_bullets": [
      "✔ DEAD SIMPLE SETUP - Unique 1 piece design with included carrying case means no external parts to install, carry or lose, and makes folding / unfolding simple & quick. Unfolding the table takes less than 30 seconds",
      "✔ FOLDS SMALL / OPENS BIG - Innovative quarter folding design means table folds down to an ultra portable size and when unfolded opens to 31.5\" x 23.6\" just right for dining or a night of poker and card games.",
      "✔ PREMIUM MATERIALS - Table top is made from premium moso bamboo; legs & frame made from lightweight aircraft grade 7075 aluminum; it's light but can support up to 66 lbs on the table top",
      "✔ QUICK ADJUSTABLE HEIGHT - SmartFlip table has various adjustable heights: High - 25.6\" (waist high), Low - 17\" (knee high), & everything in between! Adjusting the height is as simple as twisting the leg and extending it. Other tables offer only 1 height",
      "✔ GREAT FOR ALL ACTIVITIES - Adjustable height and natural looks makes the table suitable for picnics, beaches, parties, fishing, outdoor concerts, even for quick coffee mornings or just camp out!"
    ],
    "specifications": {
      "Product Dimensions": "27.4 x 7.6 x 5.9 inches",
      "Item Weight": "10.18 pounds",
      "Manufacturer": "Beckworth & Co.",
      "ASIN": "B01N2G6POX",
      "Customer Reviews": "4.5 out of 5 stars235 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#68,487 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Tables",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Patio Furniture & Accessories",
      "Picnic Tables"
    ],
    "price": 99.99
  }
}