{
  "website_summaries": [
    {
      "verdict": "It's slim, good-looking, and reasonably protective – the one to get if you prefer a hard-shell case. Not recommended if you drop your phone often.",
      "pros": [
        "Has a smooth feel, slim profile, and 180-day quality guarantee",
        "Easy to put on and take off",
        "Sports soft-touch buttons for added functionality and protection",
        "Comes in 6 colors"
      ],
      "cons": [
        "Not quite as shock-proof as soft-shell models",
        "Reports of color fading/chipping after several months of use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Hard plastic case provides a basic level of protection, while the extremely slim case looks sleek.",
      "pros": [
        "8 different color options",
        "Hard plastic case protects the unit from scratches, but it also has enough flexibility around the buttons to ensure you can use them",
        "Easy to put on and take off the case as needed",
        "Includes a slight lip around the camera to protect it"
      ],
      "cons": [
        "Hard plastic cover doesn't provide much of a grip",
        "Limited drop protection"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best iPhone Case Ever",
      "text": "It's stylish, lightweight, slim yet strong. I've used hundreds of cases they either were ugly, worn off, got rough or broken quickly. I've been using this one for weeks and it's spotless even after dropping many times. Hats off to TORRAS",
      "rating": 5.0,
      "verified": true,
      "author": "Nauman Afzal",
      "helpful_votes": 75,
      "publication_date": 20181205
    },
    {
      "title": "Excellent slim phone case.",
      "text": "Excellent slim phone case. I have owned two Totallee brand phone cases before purchasing this one because I prefer a very slim phone case. Initially I was happy with the Totallee case overall, but the second one I bought was clearly inferior quality and actually fit poorly. This Torras case is obviously very well made and fit my phone perfectly. It is much more sturdy without sacrificing slimness. Well done.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Van Stavern",
      "helpful_votes": 44,
      "publication_date": 20200312
    },
    {
      "title": "Best iPhone cover I ever had",
      "text": "I LOVED IT. It looks amazing, especially if you have a black iPhone. It is simple and gives your phone an elegant look. 100% recommended!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 56,
      "publication_date": 20181013
    },
    {
      "title": "Five Stars",
      "text": "It is slim and easy to apply. Beautiful iPhone 7 case.",
      "rating": 5.0,
      "verified": true,
      "author": "WhenUBlive",
      "helpful_votes": 65,
      "publication_date": 20180302
    },
    {
      "title": "Great company",
      "text": "Exceptional customer service at Torros. Truly stand behind their lifetime warranty. Great company! Revised: customer service was fantastic. Quickly contacted to send out a new case. Company stands behind their product. Looking forward to trying out the new unit. Case is peeling apart less than 30 days into use. Return window has closed. Would not recommend based on this. Otherwise the case is great low profile protection.",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 51,
      "publication_date": 20180609
    },
    {
      "title": "Love this case!",
      "text": "Really love this case. You'll have a hard time finding anything more low profile that's still going to protect your phone if dropped. I've never Ed dropped a phone hard enough to shatter a screen, but I've dropped plenty that have dinged up corners or scratched the bezel, making the phone look like crap. This offers the protection I need and keeps the iPhone looking good the way it was intended to look. When I put my phone down on the conference room table, it looks noticeably thinner than everyone else's. Also, it has a really nice satin soft texture to it. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "EngineNo9",
      "helpful_votes": 46,
      "publication_date": 20180421
    },
    {
      "title": "This is exactly what I was looking for",
      "text": "This is exactly what I was looking for. Very slim profile, looks great. I'm not sure about the durability and I don't plan on testing it as it looks very nice and I don't want to mess it up. I went with navy blue.",
      "rating": 5.0,
      "verified": true,
      "author": "John Lewis",
      "helpful_votes": 29,
      "publication_date": 20191112
    },
    {
      "title": "Beautiful rose gold color; thin minimalist cover",
      "text": "I’ve had my share of disappointing cell phone covers so I wasn’t getting my hopes up for this one. Luckily, I was pleasantly surprised when it arrived. The rose gold color is a beautiful sophisticated muted pink. The cover is thin and fits the phone perfectly. Although the case seems like it has enough traction so it doesn’t slip out of my hands, I added a key ring since I have been having issues with my hand from holding my phone so much lately.",
      "rating": 5.0,
      "verified": true,
      "author": "mkysayTop Contributor: Baby",
      "helpful_votes": 54,
      "publication_date": 20180120
    },
    {
      "title": "Not durable, cracks/melts!",
      "text": "After using this case for a few weeks, the case has started to almost melt/crack. I don’t leave directly in sun which makes it even stranger. Not very pleased with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Brett Garber",
      "helpful_votes": 22,
      "publication_date": 20180701
    },
    {
      "title": "Easily one of my favorite cases.",
      "text": "I love how minimal this case is! It fits great on my iPhone 8 and it keeps the phone feeling small and light, which is pretty high priority for me. I like that it has a pretty good amount of grip (I find TPU cases too slippery) and I have no trouble holding onto my phone with this cover. I've never dropped my phone with this case on so I can't really comment on the durability. It may not protect like a thick armored case, but this is fantastic for those who want to add some grip to their phone while maintaining a slim profile. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Falco",
      "helpful_votes": 15,
      "publication_date": 20181210
    },
    {
      "title": "Great de-branded clean and minimalist case",
      "text": "Best online purchased cover I ever had! lives up to its description, made with the level of quality you would expect for an apple product, this case fits so perfect you wouldn't believe it's a third party product. I know this is kind of odd but if you want to de-brand your iPhone appearance, look no further! this is a mate black finish so thin that looks like the device's case itself. his particular version is a hard case and yet it feels rubberized just like a silicone cover would, improving the grip of your device without being a prints magnet.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Quinones",
      "helpful_votes": 15,
      "publication_date": 20180112
    },
    {
      "title": "Edit:Cracked My Phone",
      "text": "Edit: So after posting this review, I was contacted by the company. They are replacing my case since it deteriorated so quickly. The customer service that I received was amazing. I have never owned such a low quality phone case. I accidentally drop my phone all the time, but because I keep a case on it there are never any cracks or damages. One week within buying this case I have three cracks in my screen. Now my case shows it wear well, and I have owned it less than a year. There are countless scratches and dents on the case. It did not hold up well. I will not buy this type of case again.",
      "rating": 4.0,
      "verified": true,
      "author": "Megan Bartholomew",
      "helpful_votes": 11,
      "publication_date": 20180911
    },
    {
      "title": "As described",
      "text": "The case is as described. Slim, light, perfect fit and coverage. It’s my second Torras case, and it holds up well if you’re not a phone-dropper. Unlike the Apple cases, it does not rise above the edge of the phone (so that you can lay the phone on its face without the glass touching the table, which could be a modest improvement). But if you’re not one to drop the phone and don’t have large hands, or if you just want a simple and elegant case that doesn’t add bulk, this is a good fitting case.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred W",
      "helpful_votes": 6,
      "publication_date": 20191105
    },
    {
      "title": "Nice case, I would buy again",
      "text": "It fits the phone great. It feels stout like it will last a long time. The case is somewhat slick. It does have almost a slick rubber feel to it even though it is made of plastic. The only downfall is the buttons on the side are a little harder to push, there are little “flaps” that cover the buttons making them somewhat hard to push. It is much better than the last case I had, that one had a snail on it, I can’t remember the brand. I would buy this one again",
      "rating": 4.0,
      "verified": true,
      "author": "JD419",
      "helpful_votes": 6,
      "publication_date": 20180617
    },
    {
      "title": "Do not buy",
      "text": "Got a new phone and wanted something quick until my other case was able to be delivered. I wasn't looking to purchase a super durable case, just something to keep my phone from getting scratched short term. This did that, but shortly after putting it on my phone the case started to degrade. It left a residue/film on my hands? I tried wiping it with a soft cloth, a tech cleaning solution from apple, and even isopropyl alcohol. Nothing helped and it just kept getting worse. Worth spending a few extra bucks on a better case even for a short period of time.",
      "rating": 1.0,
      "verified": true,
      "author": "GinaTop Contributor: Makeup",
      "helpful_votes": 3,
      "publication_date": 20191024
    },
    {
      "title": "Not the same as the first generation cases!!",
      "text": "I just got the second generation case for my iPhone 8. If you are ordering thinking you’d get the same case that was available just 3 months ago, think again! My family have purchased several 1st generation cases in the past and love them for their ultra slim fit. I was so disappointed that this new one is not as slim as the previous one that I’m trying to replace (I dropped my phone several times on the pavement causing scratches). Just enough of a difference to make me feel that this one is not any more slim than other cases on the market. It is not as thin as the product description indicates.",
      "rating": 3.0,
      "verified": true,
      "author": "Kay C.",
      "helpful_votes": 2,
      "publication_date": 20200515
    },
    {
      "title": "It's very pretty and really slim",
      "text": "Wasn't expecting it to offer much protection, but I just needed something to put my brand new phone in. It's very pretty and really slim, fits super close to the phone. So anyway, I went to visit some college friends at my Alma Mater and dropped my phone roughly seven hundred times over the course of the night. The case is pretty banged up but the phone is untouched. Was very pleasantly surprised. I definitely recommend getting this.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean",
      "helpful_votes": 6,
      "publication_date": 20180502
    },
    {
      "title": "Disappointed - Poor quality",
      "text": "I was excited when I received this item (coz it looked awesome) but within a month, I noticed this is an ordinary case - painted for that amazing look. Disappointed :-(",
      "rating": 1.0,
      "verified": true,
      "author": "QamarZ",
      "helpful_votes": 8,
      "publication_date": 20180922
    },
    {
      "title": "Super Slim, Sturdy Phone Case",
      "text": "Normally I hate my phone cases, but I love this one. It is slim, sleek, and sturdy. The power/volume buttons are easy to press and the case snaps on to the phone which I wasn't expecting to like, but do. My phone is black and the matte case works perfectly with it. I have dropped my phone a few times and it has done a good job protecting it. This has been the best case I've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Gracie",
      "helpful_votes": 5,
      "publication_date": 20180527
    },
    {
      "title": "LOVE this case. Very thin. Low Profile. Looks GREAT on the phone.",
      "text": "Love these cases. This is my second one. The first one got a little beat up and decided to replace it. They're extremely low profile on the phone, hold up to basic wear and tear and the material feels great! For the price you can't beat it. I will continue to buy these for my phone and I always suggest them to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "TJK2577",
      "helpful_votes": 6,
      "publication_date": 20180205
    },
    {
      "title": "Doesn't actually protect the phone",
      "text": "Gorgeous color and soft feel, but the lip doesn't extend past the screen of the phone, so there isn't really any protection against the screen breaking.",
      "rating": 1.0,
      "verified": true,
      "author": "Lyn Leis",
      "helpful_votes": 8,
      "publication_date": 20180406
    },
    {
      "title": "Very thin, as described.",
      "text": "I was very happy to see how thin this case really is. I also appreciate the raised edges to protect both the rear camera, as well as the screen. The two things I do not like: 1. The case is very \"slick\" and easily slides out of pockets. Whenever I hold it, I fear I will drop the phone during handling. 2. I really hate the buttons...they are captive by being integrated into the case as a single pieces. Cheaper/easier to manufacture I know, but really not great when you need to actuate the buttons. If the buttons were separate pieces like the old Apple bumper cases, that could be a home-run.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Gavora",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "I really like this thing!",
      "text": "I've never had a case on any phone I've owned. Not for more than a day or two, anyway. But I absolutely love this one. I bought the dark blue, which pairs nicely with my silver iPhone 8. The blue/black/white combo is exactly what I was hoping it would be, and this case doesn't add any noticeable bulk. It's got a nice texture that helps with grip, but it's not so abrasive that it causes problems going in and out of my front pocket. I don't trade phones very often, but I'll definitely look for a version of this case for my next iPhone. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "D.M.",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Nice case but slippery",
      "text": "So my case came in today. It is slim fitting to the iPhone but it is very buttery. If you’re a person who drops their phone easily, this is not the case for you. It’s very smooth feeling and slippery. No protection on the back of phone inside case as some other cases have. Some have the velvet inner lining to protect the back of your phone. I’m keeping this because I like the slim ness of the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian T.",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Very slim case",
      "text": "This is a very good option for the new iPhone SE 2nd generation, if you want something that doesn't take up much room in your pocket. It makes the phone easier to hold than no case at all, although the case itself is still a little slick. I actually put it on a chair just now and it slid off onto the floor. The case protected the phone, though, from any damage. I think it's a good trade-off between sleek design and protection for the phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian L. Hedrick",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "No raised outer lip to protect screen",
      "text": "The phone case fits too tight on my phone. There is no wiggle room, and it is difficult to take the phone out of the case. There is no raised outer lip on the phone, so when you put your phone faced down, the phone slides on the surface easily, causing many scratches to the glass screen protector. I'm the type of person that likes the screen faced down, so it isn't for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Konmari Lifestyle",
      "helpful_votes": 3,
      "publication_date": 20180930
    },
    {
      "title": "Very happy. I just find the cover a little bit ... NOPE",
      "text": "Very happy. I just find the cover a little bit hard on the side buttons. It kinda loses the smoothness of the iPhone. But it's very thin, and looks and feels great! Update: I'm updating this in May 2020, some time down the road I noticed that the case let particles in between the phone and the case and it caused a bunch of scratches and it was sticky. The phone fell a few times and the case cracked here and there. I don't usually have stuff in bad shape but let me tell you, this case looks like it's been in a war. Do not recommend at all. Buy something more pricey for your phone, for real.",
      "rating": 1.0,
      "verified": true,
      "author": "ANB",
      "helpful_votes": 3,
      "publication_date": 20180116
    },
    {
      "title": "6 month review... still love it!!!",
      "text": "I put this case on my iPhone 7 6 months ago and I still love it. I have dropped my phone several times with no damage to the phone or the case. I love the flat black finish that is minimal, hi-tech, and \"grippy\" enough without sticking in your pocket. The case snaps on for a snug fit that only comes off when you want to occasionally clean it. This case plus a glass screen protector and your phone is ready for the daily wear and tear of life. I've used OtterBox and have been disappointed... too clunky and too expensive. This is perfect for me and my budget.",
      "rating": 5.0,
      "verified": true,
      "author": "mrRick",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Great case",
      "text": "Definitely my favorite case to date. Unlike many other cases, it’s not painted. This makes scratches much less noticeable. It’s extremely thin, and does not offer a ton of protection, however i have not damaged my phone despite a few drops. I personally hate the glass backing, and this product does a great job of covering it and protecting it. I am also hugely a fan of the Apple logo being covered up. Nothing against the Apple logo, however it’s always driven me crazy how dirty the little hole gets on all of the cases that choose to place a large opening over the Apple logo.",
      "rating": 5.0,
      "verified": true,
      "author": "Braedon Giblin",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "If you want minimal bulk",
      "text": "The description is \"Silky smooth\" is accurate. It NOT grippy so it will slide over a table. (not as much w/o the case). Make the phone easier to hold providing minimal addition to size and weight. Its not grippy like silicon cases. its a pro and con, pro is it doesn't pick up dirt like silicon would. But it will slide around.",
      "rating": 4.0,
      "verified": true,
      "author": "HoosierMP",
      "helpful_votes": 4,
      "publication_date": 20180408
    },
    {
      "title": "NIce minimalist case",
      "text": "This case is great, it is very minimal and does not add much bulk. I got this case because I wanted something that will protect my phone from scratches and this does the job well. I dont know if the case will protect the phone from a fall but I dont intend to find out. The case feels just right, it is not slippery nor overly grippy (grippy phones get stuck in my pocket). It seems durable enough for being a thin piece of plastic but only time will tell just how durable it is. All in all I am very pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "tin chau tso",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great Slim Case!",
      "text": "I love this case even though I've only had it for a weeks or so. The case has a matte, non-slip finish that covers every side of the phone. It is slim but not paper thin. Since the finish is matte, it does show fingerprints and smudges but very little compared to other cases I've owned. All of the ports are precisely cut. Even with a glass screen protector on, the case protrudes slightly above the level of the screen, protecting the glass when placed face down on a hard surface. This is one of the best cases I've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "eacosta4207",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Nice and thin case! Loved the color!",
      "text": "I loved this case! My phone was so thin. I found two problems with it. 1. The tabs at the bottom get caught in my jeans pocket when putting it in. This caused the case to crack at the bottom pretty quickly. (My husband does not have a problem with his, but he does not keep it in his pocket. ) 2. When the phone drops, the case does not protect the glass. It is just not wrapped wound the phone enough to protect it well. So if you drop our phone a lot, just know you will need to replace the glass.",
      "rating": 4.0,
      "verified": true,
      "author": "Amrb2593",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Favorite phone case (and I’ve had many)",
      "text": "This case is absolutely beautiful. It’s rigid (clip on, not flexible) and has a “I just want to pet this thing!’ soft touch. It’s very sleek and has an elegantly simple design, adding minimal bulk to the phone. The buttons are a clever design that work better than any other I’ve had. Really a very nice case for the money. If you want something super protective, you should probably go with something different; but for a minimalistic, sleek case, you can’t beat this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike & Jenny",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Excellent",
      "text": "One of the things I love about the iPhone 7 is the slim, light profile. It may be a little old now but it still looks, feels and performs better than the newer, higher-spec Android that I got just a couple of months ago. This case is exactly what I'm looking for to keep my iPhone slim, light and well protected from scratches and smudges. It came in a darker shade of navy than in the picture which I actually prefer and it's just smooth enough to the touch to feel like there isn't anything over the phone itself and with no design or hole for the logo it just looks elegant and more expensive than what I paid for.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Great little slim case",
      "text": "I bought this for my work phone. The slim casing makes it very thin and I can slip the phone into my iPhone XS max’s wallet case slot when I go out for lunch. Did not drop the phone yet, so not sure how durable it’ll be. As it is, it’s perfect for what I need it do, which is provide some protection without adding bulk.",
      "rating": 5.0,
      "verified": true,
      "author": "BubblieTop Contributor: Aquascaping",
      "helpful_votes": 3,
      "publication_date": 20181018
    },
    {
      "title": "Very slim and snug design... however, ...",
      "text": "Very slim and snug design...however, it is just a plastic shell that will offer no protection should you drop your iPhone. Made me nervous until I replaced it with something else from a company called Silk. Addendum: Torras sent me a different case with more protection and a free screen protector, even though I did not request anything from them. This is exceptional customer service. Thanks!",
      "rating": 3.0,
      "verified": true,
      "author": "J. Milton",
      "helpful_votes": 2,
      "publication_date": 20180827
    },
    {
      "title": "Better than Apple",
      "text": "Ordered this case and the Apple silicone case. This one came first so I used it for a few days. Easy to put on, good feel and grip, and the button covers have cut outs around them so they work well. Slightly raises camera and screen area so they don't sit on a surface. I put the Apple case on, didn't like the feel, and its slippery, which makes no sense. The button covers don't have cut outs around them and are stiff. The Apple case cost $38 with taxes, while this one costs $13. I definitely recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Best slim, non bulky case I’ve owned. Love it!",
      "text": "I like small phones and very minimalist cases as I hate carrying bulky stuff in my pockets all day. I don’t write lots of reviews but decided to do so for this case as it fits the minimalist characteristic perfectly. I’ve owned several other cases for other phones over the years and, until now, didn’t find one that I really liked as all others were thin but still too bulky. This one looks great too (I bought the blue). Haven’t dropped my phone yet so can’t speak to how well it protects it from a fall.",
      "rating": 5.0,
      "verified": true,
      "author": "TommyM",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Did not keep my phone safe",
      "text": "I know that occasionally I will drop my phone so I keep a case on it. I have never cracked a phone in my life. This case was the first time that it happened to me. The case is not bulky but I might as well not have had anything on there for the good it did me. Now I have to spend over $100 to repair the back glass that is utterly and horribly shattered. Not to mention there are scratches all over the case. The only good thing about it is that it lets you charge your phone on a wireless charger. Yay.",
      "rating": 1.0,
      "verified": true,
      "author": "Erika Botch",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Fits iPhone 7 perfectly. Concern on screen protection.  Possible headphone to lightning port issue",
      "text": "Fits iPhone 7 perfectly. Buttons work good. Volume switch good. Charging port good. Headphones connect to charging Oort work but on occasion seems to have issue connecting and I believe the case prevents proper seating of headphone to lighting port. My main concern is that the lip of the phone doesn’t protrude high enough to protect the screen. Dry much on a fall. I don’t drop my phone much and nothing has happened to my screen at all. Also there is no space for using a metal magnetic mounting device. 4 of 5 based on my concerns.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Good for red iPhone SE 2020",
      "text": "Just got this today and it’s perfect with my red iPhone SE 2020. - The red color is spot on. It has the same slightly metallic look as the red metal side band around the phone, and same color shade. - The sides of the case rise just past the glass face so placing it face down keeps the screen just off the surface. Very narrow margin there though - It snaps into place and is secure - The button covers take slightly more effort to press. Not much though. - The case is a bit grippy but not too grippy. It will still slide on angled surfaces but is much better than the glass back.",
      "rating": 5.0,
      "verified": true,
      "author": "quacker",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "For minimalists, it will be a keeper.",
      "text": "Best minimal case I’ve gotten so far. Haven’t dropped it yet but it feels like it would protect a little bit and maybe not even scratch or break. Made of plastic but feels like metal except it’s not cold. Attractive satin finish , great rose gold color, responsive buttons, and front edge goes beyond the bevel ever so slightly as to not add bulk but provide some protection. Feels like it weighs nothing.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Sleek but no protection",
      "text": "I agree with the other reviews. Love the sleekness of the case but doesn’t offer much protection. I dropped my phone face down and thankfully since I had a tempered glass cover my screen was saved. Definitely don’t use this case unless you have a glass protector or you might as well kiss your screen goodbye. Previously had an Otter case but the bulkiness was annoying. Will continue to use this one & just be more careful",
      "rating": 4.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "(almost) Perfect!",
      "text": "This case is almost flush with my iPhone 8 screen. I wish it went a bit beyond the screen to prevent cracking the screen when dropped. But I like how it hugs the phone perfectly. The volume button covers are missing some kind of indent. I’m sometimes not sure if I’m pressing up or down. Maybe it will take some time to get use to it. Bonus, the smooth surface feels great in my hand.",
      "rating": 4.0,
      "verified": true,
      "author": "SupaGiant",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Just a nice company and individual people, (Micky)",
      "text": "Received case , very nice and slim couldn’t make up my mind which case to get slim, or shockproof case, but went with slim, and I am very happy with it I only had for about week, this company email about case offering to exchange it ,refund, if I was not happy with it, you don’t see that in a company these days they earn my respect,,, very nice of them. Appreciate it.",
      "rating": 5.0,
      "verified": true,
      "author": "john w neff",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "My favorite iPhone case",
      "text": "This is my third Torras slim fit phone and like the others it’s awesome! Perfect slim fit, good basic protection with no extra bulk, feels great in the hand. I got the red version and it’s a gorgeous red metallic, looks amazing on my phone! These cases have held up exceptionally well for me in the past and I expect the same with this new version for my iPhone se 2020. My favorite iPhone case!",
      "rating": 5.0,
      "verified": true,
      "author": "Pete J",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Does not cover screen edges - Get the love series instead",
      "text": "Does not cover screen edges leaving screen protruding. Ii was contacted by the company and they send a similar replacement that covered the edges better. Besides being a different color and everything in my pocket sticking to the case rubber, I am satisfied with this product and have updated my response to reflect that the company was very gracious and offered a replacement free of charge.",
      "rating": 4.0,
      "verified": true,
      "author": "Russ Mann",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Perfect iPhone 7 case",
      "text": "The $40 iPhone case I purchased from the Apple store had just worn out not wanting to spend another $40 on a case that lasted one year I decided to purchase this. It is very similar in design to my old case and feels very well-made it is slim and the texture doesn’t get hung up while removing it from my pocket. I would recommend to anyone who doesn’t want to blow $40 on a case when this one in my opinion is just as good if not better.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Rhodes",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "This is exactly what I was looking for",
      "text": "It is slim, and has some grip to it. I've used it every single day since purchasing several months ago. If you want a simple and nice looking case, do not waste money on something more expensive b/c this is fine. It isn't too grippy to not go in my pockets, but definitely enough to hold onto and it doesn't slide around too much. I will say that the plastic on the bottom is slick so setting it up while you are facetiming or something isn't always the easiest but that is me REALLY reaching to find something I don't like about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner Freshour",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Awesome case and service",
      "text": "Love the color of this case! It’s a beautiful metallic red. I’ve been super pleased that the color has not rubbed off the buttons with use. It will scratch but due to the material being the same color throughout they aren’t very noticeable. Also, customer service is awesome. I noticed that one of the corners had split at the bottom of my phone. I contacted the support email and the responded within a day or so and they’re sending me a brand new case!",
      "rating": 5.0,
      "verified": true,
      "author": "QuaintNeedle",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "I wish it was slimmer",
      "text": "Nice solid case for my Iphone SE 2020. It is sturdy enough to protect the phone from light drops. Rised up edges kinda helps when you place the phone upside down on the table. It is not exactly the type of a case to protect your phone if you were to drop it but instead a light weight and kinda slim case. I was expecting a slimmer than this one since my intentions were to have a vail kind of a case but this one does the job till I find slimmer 360 case.",
      "rating": 4.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Very sleek",
      "text": "I use this case for my work phone. For the sake of denim dye (bc I always put my phone in my back butt pocket) or yellowing on the sides of the case, I decided to buy this matte black. It's sleek and very thin. I doubted the quality, but it's decent for the price you pay. I've dropped my phone a few times, but it hasn't cracked so that's good! I dinged off a star because it's TOO thin, it almost falls out of my hands.",
      "rating": 4.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Easy to hold, light weight",
      "text": "Very nice case. I usually buy Spigen case but lately Amazon doesn't seem to sell it anymore. Anyway, TORRAS didn't disappoint me at all and moreover this seems to be better than Spigen. This covers all round the phone and the speaker holes exactly match with the holes provided on cover. Excellent iPhone cover, no scratches what soever. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Suri",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "update: anti-scratch my foot. great, inexpensive but good looking case",
      "text": "UPDATE: four months in, this case is as good as garbage. I'm always super careful with my phone: I keep it away from my keys, tuck it in a special pocket alone in my purse so nothing else will scratch it, and don't drop it. Still, it's somehow picked up so many scratches it's embarrassing in both social and professional contexts. Looking for a new one now. The color is a perfect match, the surface is a bit grippy and not too slick, it's super slim and snaps on easily. Glad I got it.",
      "rating": 2.0,
      "verified": true,
      "author": "Nadia",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Fits snuggly, protects rear camera",
      "text": "This is a simple phone case. It fits snuggly around my iPhone 8. The rear camera is protected and the port/button cutouts are great. I wish there was more of a bevel on the front for resting facedown, but there doesn't appear to be any. The only issue I've had is I fumble with the power button. Overall, pleased with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Fantastic feel!",
      "text": "I bought this case because I wanted a red case for my back-up phone. It came in a day and took two seconds to install. This is a nice case with a rich feel to it. When on the table it does not rock. The case has a non-slip feel to it, but not excessive. I will buy this for my other phones as well. Great case - buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Shiraz Balolia",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Make no mistake, the TORRAS Slim Fit is the BEST iphone case by far !!!",
      "text": "I took the time to use the TORRAS Slim Fit before writing this review. I must mention that ever since I got my first iphone I have been permanently in a quest for the best possible case for my device. I have tried high end pricing wise models, economic ones, plastic, acrylic, leather, you name it; and there was always a flaw. In some cases major ones. Well, finally that quest is over. The TORRAS Slim Fit is EVERYTHING you may be looking for in a case. It is elegant, ultra thin, highly protective, super friendly at touch, durable, scratch proof and in summary the ultimate accessory for your iphone.",
      "rating": 5.0,
      "verified": true,
      "author": "JAQ",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Minimal Protection",
      "text": "Dropped phone from about 3 feet. Landed on corner and cracked glass. Few months later I dropped phone face down and shattered rest. The corners arent padded so there is no protection. No lip around edge so if it falls face down on something small there isn't protection. After 150 for repairs, I'm beefing up my protection with a new case. ...also using the tempered glass protectors.",
      "rating": 1.0,
      "verified": true,
      "author": "Joel Nussbaum",
      "helpful_votes": 3,
      "publication_date": 20180724
    },
    {
      "title": "Can't Beat Durability For the Price",
      "text": "You will definitely want to pair this with a screen protector if you are prone to dropping your phone. However, if you want something sleek that doesn't compromise the design of your phone, this is a great choice. It is completely compatible with wireless charging. I've had this for nearly a year now, and it has survived many drops.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin H.",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Best IPhone case I’ve ever owned",
      "text": "Wow, I never leave reviews, but I had to with this item! Beautiful design, microscopically thin, incredibly durable, and has a nice texture to the cover that makes it more slip resistant. Buttons for power and volume click very, very nicely. Absolutely love this case, and for 10 bucks, absolutely can’t be beat",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle M.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "My screen cracked just a few days afer changing to this case.",
      "text": "This is supposed to be a protective case but just a few days after putting this new case on, I dropped my phone and it cracked right at the point where there is no protection in the corner. Why not put the protective cover around the entire case? Why the voids in the bottom corners? I've had my phone for 2 years and no problems with it cracking. Had this case for a few days and my glass screen is cracked.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny Vogelmeier",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Slim",
      "text": "Didn't realize there wasn't a whole at the back to show the apple icon, but that's my fault not observing the case properly. Also, there's not a lot of grip on the case, can slide of your hands easily. But it fits slim and makes the phone look small and neat, compared to the otter box. But if u want max protection otter box is the way to go. This case is for style and slim look.",
      "rating": 4.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "nice",
      "text": "super slim case for my work phone, has a nice almost rubbery texture to it so it has a solid grip, very thin, doesnt seem like it will protect front edge/corners as it is so slim, probably wouldnt protect the screen from scratching either, added the $8 pack of 3 glass screens to protect from this and it is perfect, super slim profile and feels pretty sturdy. 4 stars because it probably wont protect the front corners in a drop",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Case changed, not happy with the new larger edge overlap",
      "text": "Please see the attached video review, fit to a 2020 iPhone SE. My wife bought the previous version (the red one in the video) and we both loved it. I ordered one for myself (the black one in the video), unaware that the design had changed. Had I known about the larger edge lip I would not have bought it. It's a shame because the case material is really nice, just the right amount of grip, and the previous version fit perfectly. The camera and speaker openings are also different. Manufacturers: please go back to your previous version!",
      "rating": 2.0,
      "verified": true,
      "author": "Reuben D. Lara",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "This is a great minimalist iPhone case!",
      "text": "This is a great minimalist case for an IPhone 6 or 7. It is sleek and unencumbered by any raised lines and consequently, it seem like there isn’t a case on my phone at all. The surface material is of a rich blue matte finish which reduces fingerprints. It’s not a heavy duty case which could protect your phone if dropped a great distance, but it’ll handle a fall of 6 feet or less. The people at Torres are great at customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Anton K.",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Beautiful slim iPhone case..",
      "text": "Nothing more than the perfect little case to keep your iPhone looking neat & clean. Really love the design around the bottom corners/edges of the case as well as the detail around the lock/volume buttons. I'd recommend as long as you're pretty gentle around your phone. Mine has survived less than a handful of drops in the past month with this case and shows little to absolutely no signs of wear, glad I got this over its competitors for sure sg",
      "rating": 5.0,
      "verified": true,
      "author": "Sebastian Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Great product",
      "text": "Finally a slim case that really fits and works. Having tried several that did not enable the phone to fit into my belt holder, this one enables stowing and retrieval with ease. And the lightning cable can easily plug into the bottom of the phone. Comfortable to hold. Much recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald B. Anderson",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "... this case about 2 months ago and it looks nice, the red color is good and it's not fading ...",
      "text": "I bought this case about 2 months ago and it looks nice, the red color is good and it's not fading like some of the other review said. However, this case did break along the bottom edge where the charging cable plugs in and it doesn't offer much protection. Because of the curved glass in the iphone 7 the screen sticks up higher than the side of the case and can be damaged. Mostly this case just makes my phone look good but doesn't really protect it.",
      "rating": 3.0,
      "verified": true,
      "author": "Ellice",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "After trying several cases, this is my favorite!",
      "text": "I bought several cases for variety of uses. This was my first choice of three cases to see which one I wanted to use the most. This one is the winner! It fits perfectly on my SE for a slim feel so one hand maneuvering is easily done. And no bulk in my pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "Dcmanies",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "This is a great case",
      "text": "If you are looking for protection and do not want to change the profile of your phone, look no further. This case fits snuggly and has protected my new phone from a few \"drops\". I'm pretty careful with my phone but accidents happen and this is great for peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "SH03",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Minimalist case, millimeter clearance, serves its purpose.",
      "text": "This minimal case was just what I needed. I usually don’t use a case, but my new apartment has lots of unforgiving tile. I bought the case so that my phone survives the infrequent fall from 2-3ft regardless of flooring, and it does. Edit: Had the case for about almost a year so far and had no issues. I’ve purchased other “slim” cases in the past that started splitting and falling apart after a few months, which chalked it up to buying inexpensive products. No such problems here.",
      "rating": 5.0,
      "verified": true,
      "author": "David B.",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Love the slim design!",
      "text": "I love the slim design of this case and how well it's protected my phone. The case itself is not the most durable product I have owned as it has nicked easily and it broke near the phone plugin after a few months of owning the product but the warranty makes it worth it. DO sign up for the warranty, its a simple process and was worth the effort. I simply emailed about the case, sent a photo of the small breakage and they sent me a brand new one right away free of charge, including shipping. The customer service experience was suburb. I will continue to use this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "This case is great! Thank you again",
      "text": "**update** I had posted a 1 star review because my case had broken but the TORRAS customer service had reached out to me and offered a free replacement even though I’d purchased this phone case over six months ago. I’m loving the new case and was surprised at how responsive they were and didn’t hesitate to send a new case immediately. This case is great! Thank you again!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Love",
      "text": "I LOVE this case! This is actually my second time ordering the same one. It’s perfect if you’re like me and you like the feel of a naked iPhone but you can’t be trusted not to break it. If you’re looking for a ton of protection, this isn’t your case. But it does a decent job when paired with a screen protector. The case itself scratches somewhat easily, and I managed to break the buttons off my old one, but with the price I just reordered and fell in love again",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Super slim, very durable.",
      "text": "I’ve had the case for 5 months and I drop my phone constantly. I am not gentle with it. But there are no scratch marks from keys, pens, other nonsense at the bottom of my purse. It has just now cracked on the bottom from yet another fall- but it’s still functional. I’ll replace it so my hair doesn’t get caught in it, but I’m really impressed with the durability. It still looks clean and new despite my abuse. Plus- so so so so slim. Does not add any bulk. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie A. Beinlich",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Great case",
      "text": "Favorite phone case! This is my second if this case. The first one was perfect, super slim and very minimal while protecting my phone. I drop my phone a lot or it falls and my screen is still perfect and the case has never cracked or anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Nice case but slippery",
      "text": "Very slippery case; fits good, looks nice, seems to made of durable material, but I immediately noticed that the hard plastic is very slippery and I have to determine how to make the sides less slippery so that it doesn’t fall out of my hands.",
      "rating": 3.0,
      "verified": true,
      "author": "Arlys Reyes",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Works with wireless charger!",
      "text": "I used to buy Spigen cases, but noticed that these were higher rated with more reviews so I decided to try it and I am happy that I did. The rose gold color is perfect and the case covers a bit more than the Spigen does (such as the top and bottom of the phone as well as the buttons). I am able to charge my phone wirelessly without removing the case. I would highly recommend this case to anyone wanting some protection but not a lot of bulk.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa & Mike",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "LOVE this case.",
      "text": "I always hate to put a case on my phone because the iphone is so pretty and cases are usually so bulky and ugly, but I don't risk it. These cases are the best of both worlds! Super slim, but really protective (and I drop my phone way too often). I have both the blue and the rose gold and I LOVE them.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Maksimuk",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Slim design, less bulky and does the job",
      "text": "Love this. It’s slim, protects my phone after several drops. What more can I say. If I had to be picky I’d say it’s alittle slippery but overall 5stars. This is my 2nd case and I’ll keep purchasing these as long as I have the same phone.",
      "rating": 5.0,
      "verified": true,
      "author": "carmen wray",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Black color lasted 1 year, red color lasted 2 months",
      "text": "I purchased this case on color black in Nov/2018 and the case lasted without chipping or breaking for almost one year, which for how much and how I use my phone it was the most durable case I ever had. Eventually it chipped and I decide to get another one one in Feb/2020 but this time in color red. The red one only lasted a couple months; pretty disappointing. I’m giving it another try given my great experience with the black one. I hope they still make the black cases with same grade of polymers, I’m pretty sure the red one was made with polymers of inferior quality. I hope they didn’t change it for all colors.",
      "rating": 3.0,
      "verified": true,
      "author": "Cadore",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Great case and even better customer service!!",
      "text": "Looks like a great case but does not fit properly. Did not fit well around camera lens and did not look like it would provide good protection. Update: The seller reached out and offered a replacement case. I have to say i must have gotten a defective case because the replacement case is much better. Fits well and appears to be durable, for the money would be hard to beat, not to mention the customer service in trying to fix a problem you might have!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Pfeiff",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Amazingly thin/light",
      "text": "This case is practically nonexistent. I suppose if i drop my phone, i may regret this purchase. It is *very* thin. But honestly the buttons give great feedback and the cutouts are perfect. my phone went from being super-slippery to grippy as hell in a second, and you almost can't tell it's even in a case. Very happy 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Slim and beautiful",
      "text": "I got the red case and it is stunning. Kind of a metallic look with a satiny finish and feel. My kids thought I got a new phone! It’s very slim and I’m not sure how much protection it will provide in the event of dropping. But I love a slim look and feel. The button covers work perfectly too, which is important to me.",
      "rating": 5.0,
      "verified": true,
      "author": "CatnipAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great product",
      "text": "I wrote an original review concerned about the actual color . After having all this time I could not be happier. This is the slimmest, most durable, comfortable cover I’ve ever owned on anything. Nice material and almost invisible. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Dow",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Lasted longer than my iphone 7",
      "text": "This case is super thin but it covered my phone just enough to protect it from scratches. I'm not sure if this case can absorb shocks from a drop or but I bought it for its slim profile. The plastic started to crack near the ring/vibrate notch but only because of multiple installs and uninstalls. It's not meant to be taken off often.",
      "rating": 5.0,
      "verified": true,
      "author": "stong",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great Case for a great price!",
      "text": "The case is really slim and tight fitting with a low profile. It is not quite as slim as the pictures show but it is probably as slim as it can get while still protecting the phone. The case overall is fantastic. I have bought several over the past few years. The case has a raised edge around the screen as well as the camera to protect from scratches. The volume and lock buttons are really good to. The oveall case is durable. I have dropped my phone quite a few times and no issues. For the price, I would definitely get it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richie ",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Very Slim but Strong",
      "text": "A very slim case. Appears to be strong, but have not dropped it yet. Easy to put on, but a little difficult to remove for cleaning. Very smooth feel. Would be better if it had notches or groves on the side since it may slide out of your fingers due to the smooth feel. Overall I think it should be a good case, but only had it less than a week so far.",
      "rating": 4.0,
      "verified": true,
      "author": "A.J.",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Fits iPhone 7 perfectly",
      "text": "I wanted a slim case that would protect my phone from minor falls and this one does the trick. It would've been nice if it had that opening to show the apple insignia on the phone, but otherwise its a solid case. I haven't had any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "dicerotops",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Nice slim look, just don't drop your phone! (Meh...)",
      "text": "I wanted to switch form chunky Otterbox to something slim. It's a nice case, but not for clumsy people. I dropped my phone and this case did not protect it at all. So, if you can keep your phone safe and won't drop it, I would recommend it. It is scratch resistant for minor scratches. Again, if you drop your phone or hit it hard against something, it will scratch.",
      "rating": 4.0,
      "verified": true,
      "author": "brechti88",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Slim and smooth.",
      "text": "Very slim, which is what I was looking for. It has good protection on the corners. For carrying the iPhone in a pocket this is great. Had this cover now for a couple of weeks, it is ideal for a person wanting to put it in a pants or suit pocket. It doesn’t have any projections that hang up on your clothing when you try to slide it in or out of your pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "JWR",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Very sleek, slim & Sexy",
      "text": "This phone case is very sleek. You can’t tell your phone even has a cover on it. The material is good and easy to clean yet it is super easy to wipe off. Durable, I have dropped my phone several times and the phone and case are in perfect shape. The black is a mate black which I love. With the slim design it has easily become one of my favorite cases. I would buy this product and recommend for purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "R J",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Good value, minimal protection.",
      "text": "Well made, perfect fit. The home button is also a but more convenient than on my old silicone case. The finish is smooth and frosty. Note that it is really minimal in protection. I’m careful with my phone but this case is pretty thin; but it preserves those pretty iPhone lines.",
      "rating": 5.0,
      "verified": true,
      "author": "nola",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Great slim fit but case is slippery",
      "text": "I like the fit but I had the official Apple silicone case before this and this is definitely a lot slippery. I felt Apple's silicone case was too sticky at times in the summer, but this case feels too slippery. It makes it easy to slip into or out off skinny jeans (which could be positive or negative). Maybe with time it'll get better and I'll get used to it. For now I'm always scared it'll fly out of my hand.",
      "rating": 4.0,
      "verified": true,
      "author": "PL",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "It provides good protection even though you don't notice it in your pocket.",
      "text": "I dropped my iPhone on a hard floor without doing any damage to it with this case installed, but the case itself cracked. The company behind it replaced it under their 180 day warranty, only asking that I provide a picture. It's a true minimalist case that offers basic protection, especially when combined with a tempered glass screen protector.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Gamble",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Nice, but too FRAGILE for removal",
      "text": "So, I really like to look, feel, and fir of this case, it there is ONE downside... the design makes it extremely difficult to remove the case without cracking the bottom edge (the most vulnerable spot appears to be the cutout for the lightning plug). And let’s be honest, removal of the case for cleaning is absolutely necessary, especially during a pandemic. I’ve owned 2 cases so far and had the same issue each time. It’s very unfortunate. Needless to say, I will not be buying a third one.",
      "rating": 4.0,
      "verified": true,
      "author": "Bee",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "I’m happy with this purchase",
      "text": "Great case it’s nice and slim and I mean really slim. It’s easy to hold too and is great for extra protection from scratches. I don’t plan on dropping my phone so I can’t comment on that but I got this for scratch prevention and I’m satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Sphinx",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Thin but not very protective",
      "text": "The case is thin but it doesn’t have shock absorbing material. The case is also too slippery for my mom. She said she’s almost dropped her phone a few times. I’ve already purchased a new case that seems to be more protective.",
      "rating": 3.0,
      "verified": true,
      "author": "Mylinh B.",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Excellent Product--Thank You!",
      "text": "I want to extend high praise to Torras. When my 1st case didn't work out they sent me a brand new replacement case...Free of Charge! This was very gracious since I bought the wrong case initially. My new case is very strong and sturdy; I have dropped my phone multiple times, and there is never a single scratch. The case has a quality design and a slim fit as well. I highly recommend this case for your i-phone 7 / i-phone 8; you will not be disappointed. Thanks Again to Torras for their kindness and generosity. You have a customer for life! Best Regards, Jim",
      "rating": 5.0,
      "verified": true,
      "author": "James D Ryan",
      "helpful_votes": 0,
      "publication_date": 20181214
    }
  ],
  "product_meta": {
    "title": "TORRAS Slim Fit iPhone SE 2020 Case/iPhone 7 Case/iPhone 8 Case, Full Protective Anti-Scratch Phone Case Compatible with iPhone SE Case (2nd)/iPhone 7/8, Space Black",
    "description": "Color:Space BlackBeautiful, portable, practical",
    "rating": 4.5,
    "feature_bullets": [
      "Ultra-thin & Ultra-light: The ultra slim fit protective iPhone SE case 2nd Generation/ iPhone 7 case/ iPhone 8 case, You will feel nothing on your phone, But it did keep the protection of your iPhone and give you the excellent grip",
      "Perfect Fit: This slim iPhone 7/ 8 case/ iPhone SE case 2nd can fit for your phone 7/ 8/ SE perfectly, Easy to install and take off",
      "Protection Even with The Button: The iPhone 7/ 8/ SE 2020 flexible hard plastic case can protect the volume and wake up/sleep button well. It is flexible to touch it",
      "Silky Feel: When you touch the iPhone SE case 2nd Generation/ iPhone 7 case/ iPhone 8 case, you will feel comfortable. Worth to have it",
      "What You Get: TORRAS slim fit phone case designed for iPhone SE 2020/ iPhone 7/ 8, our worry-free 18-month warranty and friendly customer service, If has any questions, please contact us in the first time"
    ],
    "specifications": {
      "Product Dimensions": "4.72 x 2.36 x 0.39 inches",
      "Item Weight": "0.634 ounces",
      "ASIN": "B01M7X05SS",
      "Item model number": "TS2PIPH7BK1A",
      "Customer Reviews": "4.5 out of 5 stars9,242 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#855 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 1, 2016",
      "Manufacturer": "TORRAS"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Electronics",
      "Basic Cases",
      "Cases, Holsters & Sleeves"
    ],
    "price": 12.99
  }
}