{
  "website_summaries": [
    {
      "verdict": "Performance-driven basketball shoe. Good overall support and lightweight breathable material.",
      "pros": [
        "Good support",
        "Lightweight",
        "Breathable materials"
      ],
      "cons": [
        "Sizes run a bit small",
        "Many users opted for a half size larger to fit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sweat thru the shoe after an hour!",
      "text": "My 17 yr old son wore them to practice today. After 1 hour, He sweat right thru them and because the shoes were wet on the outside, he kept slipping and falling!! It’s almost 10 hours later and they’re still soaked. I have 2 sons and buy about 6 pairs of b-ball shoes a year, usually UA, never had this happen. I’m requesting a refund, no way could he wear these in a game.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180724
    },
    {
      "title": "Great shoe!",
      "text": "I love the shoe itself, my only complaint would be the lacing on the shoe. In the middle of the curve of the shoe, the lacing sometimes gets bunched up in there and makes it difficult to tighten as you're sometimes grabbing the wrong lace. Aside from that, great shoe, and great material!",
      "rating": 4.0,
      "verified": true,
      "author": "Devon Thomas",
      "helpful_votes": 2,
      "publication_date": 20180711
    },
    {
      "title": "Comfortable for running",
      "text": "I wanted some running shoes to wear to the gym. I don't like low running shoes though. I like having something that covers my ankles and these shoes are traditional basketball type shoes. I figured I'd try them out for the gym and i love the way they fit. Extremely comfortable and i highly recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Rell F.",
      "helpful_votes": 4,
      "publication_date": 20180401
    },
    {
      "title": "Don't buy if you plan to actually wear them for a basketball game! Poor quality!!",
      "text": "I've now had two pairs of these shoes with the same issue. When you go to tighten the laces near the toe of the shoe the fabric loop holding the lace in place pulls out of the shoe. I had one pair replaced with 2 weeks of receiving my first pair. Once I got the replacement pair, I had the same issue again within 3 weeks. Would not recommend these shoes. Very poor quality!",
      "rating": 1.0,
      "verified": true,
      "author": "Brendan Yohn",
      "helpful_votes": 6,
      "publication_date": 20180411
    },
    {
      "title": "They have good grip to the floor and are overall good basketball shoes.",
      "text": "This a a really great shoe and the only problem with the shoe is it is difficult for the children to get their feet into them. However once there on the boys are doing their thing on the basketball court. I actually picked them for my son’s basketball team shoes. Had no clue it would come with this minor glitch. I say minor because other than that the boys love them and I actually tried them on myself being I can fit my son’s shoes and they are quite comfortable and great for basketball.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "I suggest to get half a size bigger than you think you need",
      "text": "I love everything about these shoes I got them for basketball because my old ones were to small and they were just the right fit and I could’ve gotten them a little bit bigger so I could grow into them but that was my fault cuz im a girl and I didn’t know what size to get since there in men’s but it’s all good and there really good quality and they were stiff at first, I hade to break the, in but that’s how most shoes are. They also have a good arch and there really protective around the ankle area.",
      "rating": 5.0,
      "verified": true,
      "author": "Trinitey",
      "helpful_votes": 2,
      "publication_date": 20190107
    },
    {
      "title": "Comfortable fit",
      "text": "My son uses these shoes almost daily for basketball. Very comfortable, great fit on him, and so far they are standing up to the repeated use quite well. He got them in purple and they really stand out.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilee Mason",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Five Stars",
      "text": "Fits as expected. Bought them for my cousin who plays basketball and he just loves them!!!",
      "rating": 5.0,
      "verified": true,
      "author": "qevek",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "This shoes runs small but it is well made.",
      "text": "Nice construction. get a half size larger than you ususally wear or get them in Wide.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Shineman",
      "helpful_votes": 2,
      "publication_date": 20180223
    },
    {
      "title": "Five Stars",
      "text": "Great show. Fits perfect. Shipped on time and would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Bowes",
      "helpful_votes": 3,
      "publication_date": 20171202
    },
    {
      "title": "Looks better in photo",
      "text": "Was a little disappointed. The shoe was not as attractive as in photo, which to be fair, happens from time to time. So was not worth the price, in my opinion.",
      "rating": 3.0,
      "verified": true,
      "author": "Hajharry",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Good quality and lasted a very long time.",
      "text": "This shoe lasted a very long time with my son wearing them daily. He wore them until they started to fall apart. Good cushioning. A great basketball shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "S. A. McFarland",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "I wore it 4 times playing basketball and the plastic ...",
      "text": "I wore it 4 times playing basketball and the plastic supports on the side made my ankle bleed and the shoelace support broke. Again and I've only worn them 4 times. I will try to send them back.",
      "rating": 1.0,
      "verified": true,
      "author": "Robcharlie",
      "helpful_votes": 2,
      "publication_date": 20180215
    },
    {
      "title": "bought for my Son who plays in basketball tournaments all ...",
      "text": "bought for my Son who plays in basketball tournaments all over the state. Loves it. I got him another pair, different colors to chose from. Price was right, they do discounts so take a look and get your deal. I caught it at the right time.",
      "rating": 5.0,
      "verified": true,
      "author": "riccle",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "love it!",
      "text": "I was looking for a great basketball shoe, thought I would have to spend twice or three times as much on a player brand shoe. Very sturdy and great ankle support will buy again in the future when it wears out. I did add soles because all shoes come with cheap soles, also because I bought with intention to ball out so I needed a good sole. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Eddy",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "My mistake",
      "text": "Great shoe but Under Armour fits smaller so get a size bigger than you normally wear. I didnt know that so I had to exchange my daughters BUT I got the correct size 2 days later. It has been a wonderful experience!!!",
      "rating": 5.0,
      "verified": true,
      "author": "True customer",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "I really like this basketball shoe",
      "text": "Great if need wider toe box to avoid rubbing. Very comfortable and good ankle support. Great traction.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Great shoe",
      "text": "Let's be clear .. the shie is so comfortable .. my first under armor sneaker ... I wear a 9.5 get a 10 . Cuz I have wide feet .. looks and feel like a 9.5 the best color out . I think but if u want comfort get them ..",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory burkhead",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Wobbly arch supports",
      "text": "Pros: Look nice Size is perfect Cons: Even tho it has arch support it is not very sturdy. They shoes must be tied tighter than usual.",
      "rating": 4.0,
      "verified": true,
      "author": "Binkyt",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Happy 12 year old",
      "text": "I got these for my sons birthday. He absolutely loves them. They fit good and look good too. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Eilmes",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Good fit and look",
      "text": "I use these strictly to exercise. I like how they look and they are very comfortable. I've gotten compliments from total strangers in the fitness center. I have to unlace the top 3 or 4 eyelets to get my foot in then lace them back up. They fit true to size. Definitely a good purchase and would recommend them to people.",
      "rating": 5.0,
      "verified": true,
      "author": "VXP",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "So good, UA will be my next sneaker as well.",
      "text": "My first pair of UA and I'm impressed. Many years with Nike and now realizing the foot pain was a Nike \"benefit\" . I won't ignore that perhaps the dynamics of my feet/body have changed . Either way the fit and comfort of these are great and the traction on outdoor courts is too. I go through a pair every 6 months . We'll see how these hold up.",
      "rating": 5.0,
      "verified": true,
      "author": "DropThe Mango",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Even a size up, it's way too narrow.",
      "text": "Even a size up, it's way too narrow. Hard to understand how shoes made for adults are designed for kids",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Harbourne",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Good price for shoe",
      "text": "I’m a weekend warrior basketball player I have played basketball all my life competitive I get up at 6:30am one day a week to go live my glory day. Had them for about 4 Month and so far they are working out. I do like how easy they are to get on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "scott",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Great shoe! Nice fit",
      "text": "I love this shoe right here !! very nice fit, i got it in a 12 but should of got a 12/ would of been right on the money . (Last longer i guest) i still have room In it . I give it a 5 100 Grand",
      "rating": 5.0,
      "verified": true,
      "author": "marcus mccurtis",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Great shoes",
      "text": "My daughter loves these shoes; however, they did start having the “stinky feet” smell after her first long practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ilovedrama ",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "... these for my daughter for her bball season she love them",
      "text": "Got these for my daughter for her bball season she love them",
      "rating": 5.0,
      "verified": true,
      "author": "Damon Patrick Shifflett",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "LoVe!",
      "text": "Love these! Glad I could find these online since I won’t buy Nike anymore. Hard to find! Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "proud momma",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Great looking shoe",
      "text": "The shoe looks amazing, but digs into my ankle. Leaves a blister on both sides. After wearing them for a month they seem to be breaking in better.",
      "rating": 4.0,
      "verified": true,
      "author": "kevin Caravoulias",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Half size bigger",
      "text": "I bought these shoes for work purposes only. I’m on my feet most of the day and so far they’re the best shoe I’ve worn. I’m a size 12 but i bought a 12.5 & they fit perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo Flores",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Fit as expected.",
      "text": "My friend ordered these for her grandson and he loved them. They fit just as expected and he loved the color.",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "recommend",
      "text": "love these, want another pair, im picky but never wear anything else...im wearing them out.",
      "rating": 5.0,
      "verified": true,
      "author": "bigmill",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Great for running",
      "text": "The best purchase ever! Fits like it was made for my husband’s feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadine Lopez",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Look great! But...",
      "text": "They run small. Unfortunately for me, I got a 10 and they don't have sizes larger available in the same color so had to go for a different color.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Awesome product.",
      "text": "My son love these shoes. May have to buy a second pair.",
      "rating": 5.0,
      "verified": true,
      "author": "CAYogi",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "the shoes are quite comfortable and look great",
      "text": "the shoes are quite comfortable and look great. my only complaint about them is that there isn't anything at all on the back of them that helps you pull them onto your foot.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick Baker",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "No go",
      "text": "I wear other underarmor product and love the brand. But these shoes cut the bottom on my ankles every time I play basketball in them. Wish I could send them back but I waited too long to test them out.",
      "rating": 1.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Love it! Looks better in person than is does ...",
      "text": "Love it! Looks better in person than is does online, unlike most shoes I've both online. Fits me perfectly even thou it's half up.",
      "rating": 5.0,
      "verified": true,
      "author": "MEDZ",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Five Stars",
      "text": "I bought these for my 13 year old son and he loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "treasure kish",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Works great but shoe-lace strap breaks easily",
      "text": "My 11-year-old son loved the shoes but they only lasted him 8 games. The shoe-lace straps tear out somewhat easily.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "poorly sized",
      "text": "sizes stated is too small son wears a size 12 had to return for a 13 when I got the 13 was the same as a 12 return them too.",
      "rating": 2.0,
      "verified": true,
      "author": "Patricia Wylie",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Very nice",
      "text": "My sons basketball shoes, he likes them so i'm happy",
      "rating": 5.0,
      "verified": true,
      "author": "sKy",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Shoes were as pictured.",
      "text": "Shoes arrived fast and they were as pictured. My son wore them during basketball and they held up well.",
      "rating": 5.0,
      "verified": true,
      "author": "BennyD",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Fits great!",
      "text": "My teenage son loves them. The fit great! He says they are comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Megan Lowe",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Very Small and Low Toe Box",
      "text": "I returned the product as the toe box was very small and not sufficiently tall enough to avoid my toes from pressing into the shoe top. Overall fit was good, e.g. length, width. And the product itself looked well made and attractive. Just didn't work for my feet.",
      "rating": 3.0,
      "verified": true,
      "author": "John R.",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Five Stars",
      "text": "Bought these for my 12 year old grandson. He loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "lucymae",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "but so far we are happy with these shoes",
      "text": "They arrived on time and fit as expected. He loves them! I can’t speak to how long they will last etc as they are fairly new, but so far we are happy with these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Four Stars",
      "text": "Right fit, just have to wear them a little to break them in.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike turpin",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Excellent hoop shoes 👌",
      "text": "Needed a new pair of kicks to hoop in and these were on time, looked great and were comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Lee",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Very comfortable!",
      "text": "My son absolutely love these shoes. They are comfortable and look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Consuela",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Good shoe for big guys",
      "text": "wide shoe, very supportive for big guys. helped me prevent a worse injury to be a light sprain. Shipping was good Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "erez lewinthal",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "I went half a size up. Shouldve went a whole size up",
      "text": "Not made for wide feet,go one size up if wide.",
      "rating": 3.0,
      "verified": true,
      "author": "Eduardo",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Ok buy",
      "text": "Shoes were very tight when first received. After wearing them, they became more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim W.",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Exactly what I wanted",
      "text": "Bought these for my son and they were perfect! Great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Riggs",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Street ball shoes",
      "text": "Delivered as expected. Probably get a couple pairs and designate one for indoor and one for outdoor.",
      "rating": 5.0,
      "verified": true,
      "author": "ABC",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Love these shoes, great for wide feet",
      "text": "Got these shoes, my son loves them. They are great for wide feet!! Quick shipping too",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Orton",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Shopping was good.",
      "text": "Everything is as expected. My daughter uses these for basketball and really likes them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Amazing",
      "text": "Like them because they are decently priced and they are comfortable",
      "rating": 4.0,
      "verified": true,
      "author": "Reagan123",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "They are true to there sizing",
      "text": "The are very nice .awesome very proud to wear them",
      "rating": 5.0,
      "verified": true,
      "author": "lal69",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "One Star",
      "text": "The shoe lace eyelets started pulling out the first time these were worn.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Four Stars",
      "text": "it feels a little bit uncomfortable on the heel, otherwise very good",
      "rating": 4.0,
      "verified": true,
      "author": "Joaquin G Lamadrid",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "The shoe fit fine and has good support",
      "text": "The shoe fit fine and has good support. However after the first use in a game the color started flaking off the toe and the logo on the ankle. Have ordered an exchange and will update this if just a fluke.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Must be faulty construction",
      "text": "My son used them for JV practice and games. Indoors only. They were light, comfortable, traction ok. Two eyes on the laces broke. Returning them.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180128
    }
  ],
  "product_meta": {
    "title": "Under Armour Men's Team Drive 4 Basketball Shoe",
    "description": "Breathable, lightweight textile upper. Full-length bootie construction with molded ankle collar for greater structure, extended support & a snug, comfortable fit. External heel counter provides additional support & keeps the back of the foot locked in place. Toe wrap improves forefoot flexibility . Durable, reinforced lace loops. Die-cut EVA sockliner provides underfoot cushioning & support. Compression molded EVA midsole carrier for lateral containment. Exposed Micro Gheel unit adds firm cushioning. 3D shank wraps up around sidewall to provide torsional rigidity & additional lateral stability. Full rubber herringbone traction pattern provides maximum floor control & grip. Weight: 13.06 oz.",
    "rating": 4.4,
    "feature_bullets": [
      "100% Textile and Synthetic",
      "Imported",
      "Rubber sole",
      "Breathable, lightweight textile upper",
      "Full length bootie construction with molded ankle collar for greater structure, extended support & a snug, comfortable fit",
      "External heel counter provides additional support & keeps the back of the foot locked in place",
      "Toe wrap improves forefoot flexibility",
      "Durable, reinforced lace loops"
    ],
    "categories": [
      "Men",
      "Athletic",
      "Shoes",
      "Basketball",
      "Team Sports",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 126.88,
    "specifications": {}
  }
}