{
  "website_summaries": [
    {
      "verdict": "A lifesaver for busy parents who need to juggle feeds and other tasks at the same time. Best for babies three months and older.",
      "pros": [
        "Extra long venting tube creates a unique hands-free anti-colic set up",
        "Upright feeding reduces reflux and ear infections",
        "Allows babies to safely feed without assistance",
        "Milk flows easily despite the longer journey to the nipple",
        "Clearly marked measurements",
        "Freezer and microwave safe",
        "Allows slow eaters to take their time without restricting parents"
      ],
      "cons": [
        "Lots of little pieces make cleaning and assembling a time consuming task"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Totally freaking crap!!!",
      "text": "We have tried these bottles on several stages of our baby’s life. It sucks every time!!! When I cleaned the tubing before the first use the tiny brush they included ripped one of the tubes. Then when baby does use it he gets mainly air and frustration. It also leaks and spills everywhere! I threw it in the trash only because burning plastic is not good. Otherwise I would have lit it on fire. We hate hate hate this product. Save your money and your baby’s tummy and do not buy this junk!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Floyd",
      "helpful_votes": 25,
      "publication_date": 20180727
    },
    {
      "title": "DOES NOT WORK!!!",
      "text": "I received the Tinukim Hands Free Baby Bottle Set. However, it is missing several pieces and therefore will not work. I am very upset about this because I needed this item for a trip we are soon to embark on and I need the product immediately. MY PRODUCT IS MISSING 1 BOTTLE AND BOTH DISCS!!! My box included 2 nipples, My box inlucded 2 adaptors, My product included NO DISCS, My product included 1 bottle not 2, My product included 4 caps, My product included 2 small and 2 long plastic tubes, My product included 1 tube cleaning brush. PLEASE RESPOND IMMEDIATELY!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Charity K.",
      "helpful_votes": 27,
      "publication_date": 20171001
    },
    {
      "title": "This is much better than the bottle prop I previously tried using",
      "text": "I have 9 week old twin babies, and we’ve been using this feeding system for the last two weeks. It’s been a real sanity saver, especially when both babies are fussy at the same time. Another benefit is that I can hold my babies against my chest when they are eating, which allows closeness and bonding similar to breastfeeding. This is much better than the bottle prop I previously tried using, which would frequently fall out of position. There are a lot of pieces, but it’s not difficult to take apart and clean. I was especially happy that a long, thin brush was included for washing the tubing. I highly recommend this product, especially for parents of multiples.",
      "rating": 5.0,
      "verified": true,
      "author": "emy",
      "helpful_votes": 20,
      "publication_date": 20180413
    },
    {
      "title": "Great invention for the mom on the go",
      "text": "I love this bottle so much as my little one can't quite hold a heavy bottle yet but is able to use this without assistance. Makes getting ready for work much easier when my little one can sit and feed self a bottle while I get ready in the morning. I already recommended this product to two friends and I was not paid for this review. I was worried about my little one getting too much air but the milk is sucked up with barely any effort and it doesn't seem to be the case.",
      "rating": 5.0,
      "verified": true,
      "author": "CAlexandra",
      "helpful_votes": 19,
      "publication_date": 20171122
    },
    {
      "title": "Great bottle to have on hand! Great for the car!",
      "text": "This is a great bottle! I needed a bottle that my son could feed himself with! And this bottle is perfect. Not too excited about the 8 parts to clean each time but I’ll only use it for car rides and anytime I won’t be able to nurse him or give a bottle. It says 3 months and up and means it! The baby has to have a strong enough suck for the bottle to work! My son is 3 1/2 months and he doesn’t have a problem with it. It took me awhile to figure out how to put it together but it all makes since once I figured it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah DeLaurier",
      "helpful_votes": 13,
      "publication_date": 20180110
    },
    {
      "title": "Game changer",
      "text": "I wish I knew about these earlier. A mom in my mom group shared this and was terribly mom shamed for it. But let me tell you, this bottle is the ultimate bonding technique for moms who need an extra hand. I use it to fake my baby out with breast feeding. Works like a charm! She's drinking alot more now, can pace herself, and isn't choking on overflow! It's a bit difficult to put together but not impossible. The suction power depends on positioning and the baby's suction power. For the price, I recommend this for every new mom!",
      "rating": 5.0,
      "verified": true,
      "author": "atheom",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Works but kind of a hassel",
      "text": "We just used ours for the first time today. No leaking problems. Air gets in the tube when nipple comes out of mouth. I just take the top off and suck it out. Def not something you want to use all the time, but can come in handy .",
      "rating": 3.0,
      "verified": true,
      "author": "MamaMelD",
      "helpful_votes": 8,
      "publication_date": 20170909
    },
    {
      "title": "Best thing to have for on the go people!",
      "text": "These bottles work great when you are out and about (grocery store, dinner at a restaurant, and at a convention...yes we have used them in all situations). Everyone asks us where we got them and are interested in them. Let me tell you, they work and reduce spit up. Our son isn’t quite 3 months yet (11 weeks when we started using these bottles with level 2 nipples) and I can only praise them from my own experience. They take a little bit longer to clean but it’s well worth it. Very inventive idea and a true blessing for new parents!",
      "rating": 5.0,
      "verified": true,
      "author": "SmartwareDesign(dot)com",
      "helpful_votes": 3,
      "publication_date": 20180116
    },
    {
      "title": "Very hard to get formula/milk out of it... i even tried it myself",
      "text": "I bought this super excited to try it and once we tried it, I'm sadly not going to use this ever again. In order for my son to use this bottle, he would have to continously suck aggressivly and he was not able to get any formula out of it. I tried it myself and it took a lot for me to get anything out of it. I wouldn't recommend this product. I didn't bother trying to send it back because I assumed this would be one of those items that are not returnable. Unless your child has incredible suckling power with force and can do this continously without stopping, I wouldn't buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel Nixon",
      "helpful_votes": 2,
      "publication_date": 20180620
    },
    {
      "title": "Missing parts but awesome bottle!",
      "text": "This bottle works great when you need a hands free option. I still have to put the burp rag under the nipple to keep it in my sons mouth but if that’s there he does really good with it and can still spit it out when he is done. The only issue I have is when it came it was missing one of the tubes that goes into the bottle. So I have to wash the one that I have anytime I have to use it. I was hoping to have two so I didn’t have to wash dishes so much!",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel Stevens",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Made babies frustrated",
      "text": "The concept is great but our 3 mo old twins just couldn’t keep the nipple in their mouth and we were constantly having to put it back in their mouth and hold it for them. Or they’d pull the tube and it would pull the nipple out of their mouth and they’d get mad. It also frustrated them a bit when they’d suck and suck and suck and it took awhile for the milk to finally make it through the tube. When baby is hungry all of those factors seemed to make it not worth it and just propping a blanket under the bottle worked better.",
      "rating": 4.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "The best for outings and road trips!",
      "text": "Love these bottles! My triplets are 10 months old and I bought them for a 10 hour road trip. Instead of taking each baby out every time we fed them and having to hold them while they ate; they fed themselves! It's amazing! There are somewhere around 9 pieces per bottle so it's not practical to use every 3 hours at home (x3 babies) but I will continue to use them for outings! They had no trouble sucking through the straws...which was something I had worried about since they had never used a straw before. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth M.",
      "helpful_votes": 2,
      "publication_date": 20170908
    },
    {
      "title": "Great for this disabled mom!",
      "text": "I'm a low level quadriplegic mother and wanted a way I could help with the bottle feedings. This worked great for me as I could wedge the mouth piece in my hand and hold it to my baby's mouth. I don't have to worry about him sucking air or dropping it. It's a little extra work to clean and put together but worth it to me and eventually my son will be able to help hold it on his own.",
      "rating": 5.0,
      "verified": true,
      "author": "GimptafiedTop Contributor: Nail Art",
      "helpful_votes": 2,
      "publication_date": 20180516
    },
    {
      "title": "Missing needed parts, does not work",
      "text": "Parts do not fit and can't return as we didn't attempt to use right away. Expensive mistake for worthless item. The collars in the package we received aren't wide enough to accommodate the tubing and disc's required to make them work. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Mindy",
      "helpful_votes": 2,
      "publication_date": 20190214
    },
    {
      "title": "A must have!",
      "text": "These bottles are a must have! In the past, I purchased some very similar bottles, but these exceeded my expectations. The bottles help tremendously to provide a hands free feeding system. I have 3 older kids and when we are in the go, it helps that they can prep a bottle and give it to her without having to prop the bottle. The bottle does help with colic but does not completely alleviate the problem. My daughter still needs to be burped after a feeding and there is still gas that gets into her stomach, but they do help. I would say that these bottles are a must have for it. He was on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi Jo",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "LIFECHANGER",
      "text": "An absolute life-changer. Everytime I use it (maybe once a day) I think of who I can reccomend it to-singlr mom or mom's whose husband's aren't home to help them feed the baby. This is perfect for when I need to pump and feed my baby at the same time, or when I'm plain tired and don't feel like holding him for 30 min while he slowly drinks. Everyone needs this bottle for emergencies to give themselves a little break.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie M Chavez",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Super Convenient",
      "text": "These are extremely convenient for car rides with my son as it makes it easy for me to give him a bottle and not have to stop driving to feed him. Its as easy to clean as a regular bottle. It has a few more pieces than a normal bottle and is a little tricky to get together the first time but once you get the hang of it, its great. The only issue I have is that, if you leave the nipple face down, it will leak. Sometimes the milk will leak into the lid which will leak in his cup holder or bag if he has not finished the bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Vasquez",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "It works, but is a very slow process!",
      "text": "Honestly, it's so much easier to sit and feed my baby, than to give him this. It works and does what it's supposed to, but unless your baby has the motor skills to put it back in their mouth on their own, this isn't for them. Also, it took FOREVER to finish the bottle... Even with a bigger sized nipple. Normally it would take my son less than 10 minutes to suck down a bottle... But using this bottle, it took him 35+ minutes. Overall, the idea of the bottle is wonderful, but in reality it turned out to not be very practical.",
      "rating": 2.0,
      "verified": true,
      "author": "Stacy Vickers",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "These bottles worked great. They are easy to use and having the ...",
      "text": "Tinukim Hands Free Baby bottles were a Godsend. My son and daughter in law were blessed with triplets. Feeding 3 screaming babies at the same time is challenging, especially if you are lone.. These bottles worked great. They are easy to use and having the babies properly propped up so you can monitor they are feeding properly makes life easier. Works great even when you are holding the child.",
      "rating": 5.0,
      "verified": true,
      "author": "Janis Digiovanni",
      "helpful_votes": 3,
      "publication_date": 20180508
    },
    {
      "title": "Good If You’re In a Pinch",
      "text": "I like this product, but I’m not sure how much use you’ll actually get from it. When they’re super young it is hard for them to suck up the milk. By the time my baby is old enough to suck up the milk with ease, he will probably be able to just hold a regular bottle on his own. I would say if you’re using it, fill it up with more milk than your baby normally drinks so that he doesn’t get as much air (there will be more waste, though). Also, the nipple hole is much bigger than my baby is used to. I think this is good to have if you’re in a pinch.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Levi ",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "I really like this hands free baby bottle",
      "text": "I really like this hands free baby bottle. This is the fifth baby in our family that we've been using it and it's woked fabulously. It made our life much easier feeding our twins simultaneously. Also, it's easier to feed the baby upright with this bottle so there is less air swallowing. I tried it with a baby as young as 10 weeks old and her suction was strong enough. The only thing I would add is more options in nipple sizes to fit my baby's preferences.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Waste of money!",
      "text": "I rated this horrible when I got this all it has is picture instructions no words tho I put it together exactly like the picture... It is completely impossible for a baby to suck any liquids from this bottle to even make through the straw area to even get to the nipple of the bottle IMPOSSIBLE...I even tried sucking it over and over again testing it to even try to get some water through it was completely impossible and very difficult.... nothing like the videos you see about these bottles possibly another brand is better I don’t know but I trashed mine after trying to assemble it!",
      "rating": 1.0,
      "verified": true,
      "author": "Kadeidrea Foster",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Baby bottle",
      "text": "This is by far the best invention ever. Everyone stops me to ask where did you get it. Some people say they wish they had this when their baby was on bottle. It’s incredible, makes it so much easier to feed my daughter and have free time to do what I need to. I sit her down give her the bottle and she goes at it, she will drop it ones in awhile and you just give it to her back. Simple and she can eat independently. I can’t say anymore good things about it that’s how good it is",
      "rating": 5.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Hard to assemble.",
      "text": "Difficult to put together. I tried to put them together but the instructions aren’t helpful. Bottles have been sitting in my cupboard for two months now because i don’t have the time to figure them out. Putting bottles together shouldn’t be this difficult.",
      "rating": 1.0,
      "verified": true,
      "author": "MI Mendoza",
      "helpful_votes": 3,
      "publication_date": 20171112
    },
    {
      "title": "Great purchase!",
      "text": "I was hesitant to purchase something like this after seeing a video advertising a similar product on Facebook and seeing judgemental comments. But we travel A LOT and this is a great option. We were propping up Dr. Browns bottles when we needed to and they would fall or leak... this system will not leak. At all. The tubes stay connected and milk/formula will not come out of the nipple unless it’s in your baby’s mouth.",
      "rating": 5.0,
      "verified": true,
      "author": "Makayla Hall",
      "helpful_votes": 2,
      "publication_date": 20180324
    },
    {
      "title": "Lifesaver! No more spilled milk!",
      "text": "I love these! They are such a game changer. With my first he was always spilling his bottles when he would have them in the car. Not anymore and these do not leak at all I definitely recommend trying them out. It took a little bit for my son to figure it out because it's not what he's used to but he did sometimes he's just too impatient to wait for it to come up the straw so I have to get it started for him but other than that it's great",
      "rating": 5.0,
      "verified": true,
      "author": "Genevieve",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "My babies love it!",
      "text": "There work like a charm! I have twins and these are very handy when trying to feed them while read to my older kids. I just put them in their rocker and they feed themselves. One baby does take to it a lot better than the other. One has no issues and basically chugs it, the other baby tends to pull it out and just generally struggles with it a bit. But the product is awesome. I honestly just thought I'd buy it and end up returning it when it didnt work. But it worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura L.",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Quality",
      "text": "I really wanted a bottle like this to work especially when traveling, but it leaked a lot and the suction was terrible. My baby would get so frustrated with this bottle",
      "rating": 3.0,
      "verified": true,
      "author": "Alyssa Swann",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "useful when you can’t hold a bottle..",
      "text": "This is not easy to clean but it makes my life so much easier; especially when we are out on walks or hike or even in a long car ride. This “hand free” bottle is great but those tubes are a pain to clean! My 6 month old took 2 feeds to figure that he has to keep the nipple in his mouth and continue sucking in order to get milk out.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs G",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Not worth the money",
      "text": "I bought these for car rides or night time but you have to like pump it to get the milk going & the tubes are hard to clean. It wasn't worth the trouble",
      "rating": 1.0,
      "verified": true,
      "author": "Mallory & Jason",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Easy to lose parts, but great helpful bottles.",
      "text": "I have twins and this helps me feed both at the same time. The only problem I have is that the rubber seal dissappeared from one bottle and I just purchased these.. so pay attention when cleaning to all parts. They give a tool to clean the tubes so happy with that. Update: company contacted me and will be sending replacement part for free!! So happy to be getting the part. Reliable company.",
      "rating": 5.0,
      "verified": true,
      "author": "Hilary B",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Not worth the hassle",
      "text": "Good idea but baby had a hard time keeping it in his mouth. It fell off multiple times, so I had to just hold it for him. Kinda defeats the purpose of “hands free”. Not worth the hassle of the extra accessories and the cleaning.",
      "rating": 2.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "baby likes it",
      "text": "Good thing about this bottle is that you can use it in the car seat without worrying of aspiration, baby can use it while sitting and upright position. what i dont like is that you have to press it before you give it to your baby not so sanitary and if not i think they can swallow air. and there is a lot of parts that sometimes hard to clean specially of you qre really busy.",
      "rating": 4.0,
      "verified": true,
      "author": "Lovelyme",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great",
      "text": "Honestly. These are great. If your baby isn't picky about nipples. My baby only likes mam bottles. So these didn't work well for us. If he didn't care about nipples, we'd use these all the time. Easy to use. Clean. All that. Comes with a long cleaning wand to clean the tubes.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Hood",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Alright",
      "text": "I like the concept of it but the issue is when I bought them my baby didn't want to put the effort into sucking it through the tube into the nipple to drink it the tubes r a pain to clean but there is a huge benefit you can use dr. Brown nipples dr. Brown bottles you don't have to use the actual bottle or the nipples they come with",
      "rating": 2.0,
      "verified": true,
      "author": "Heather larson",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Most helpful bottle ever",
      "text": "Got this for my 1 month old. He loves his apple juice and this works absolutely great! No need to prop up bottles anymore and crying car rides. Formula is a little hard to get through the straw for my 1 month old. So I just use it for his juice, highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Britni",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "These bottles are an absolute necessity",
      "text": "I absolutely love these bottles. I had something similar when my other kids were born years ago and knew I had to have them again with this baby. I make trips into town and to my sister’s house quite often that leaves my older kids’ arms sore from holding a bottle. I can’t wait to order more so I have more on hand and some for my sister who just had a baby as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Eller",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "the best ever",
      "text": "Your kid on a car ride and fussing up a storm, wanting to eat but you don't want a ticket? These are a lifesaver! Love being able to feed little man while he's in a stroller or in the car and not have to worry about him getting a whole bunch of air and spitting up half he took in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Wouldnt waste my money again",
      "text": "Baby is 4 weeks old and the milk will not get sucked all the way up to him. I sucked on it to get the milk flowing to the nipple but when I give it to him, he cannot get the milk to come out. It's like he thinks the nipple is just a binky which he hardly likes anyways.",
      "rating": 1.0,
      "verified": true,
      "author": "candice hensley",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Baby shower gift",
      "text": "I got this product for two different baby showers. One was twins and the other was a single baby. Both mothers moved it. Made feeding easy. ONE THING I HAVE TO SAY THOUGH. Packaging was easy to remove bottles however looked very cheap. I had to show the to be mothers a picture of the bottles so she could understand what it was. The sellers should add a picture of that the bottle actually is. It looked like I bought cheap bottles from the dollar store. Embarrassing.",
      "rating": 5.0,
      "verified": true,
      "author": "Eliza",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Life saver!",
      "text": "Ive been using this since he was 2 weeks old! He's 3 months. Ive changed the nipples to doctor brown and also use different bottles. To be honest I only use the parts you attach the tubes to. I use different longer tubes, different nipples and different bottles. Ive bought replacement tubes from Amazon called Sydien 3mm 5m/16.4ft Length Silicone Food Grade",
      "rating": 5.0,
      "verified": true,
      "author": "Fabii",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Amazing purchase",
      "text": "Absolutely love these, they have been so helpful and so amazing! My son loves them and really helps me out!",
      "rating": 5.0,
      "verified": true,
      "author": "tim j graham",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Good",
      "text": "Pros Give to your baby and not needing to hold Cons Getting the milk through the tube takes work...more for older baby that has a massive suckage power.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah pompa",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Unclear Instructions! Very Plain!!",
      "text": "I loved the fact that this is handsfree!!!! However the instructions are not really clear! It has a picture and a few instructions. However it does not tell you about the clear plastic surrounding the top, I peeled it off and had to contact customer service on FB in which they informed me to keep it on. I sent my bottles back. I will try another brand that has better instructions! The parts should look more like the instructions.",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 2,
      "publication_date": 20171225
    },
    {
      "title": "Great bottle saves my life",
      "text": "These are amazing I was using the 4oz ones for a while, the 8 oz ones here, the bottle part of the cord is too long for the bottle so you just have to cut it down, also cut it slanted that way better flow ! Physics 😎",
      "rating": 5.0,
      "verified": true,
      "author": "Fucker",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Used Dr. Brown's nipple inside package!",
      "text": "Aside from receiving a mangled package, when I took the parts out, there was Dr. Brown's nipple (USED) inside instead of the nipple that was supposed to come with it. It was cloudy and slimy. This is completely unacceptable and is disgusting.",
      "rating": 1.0,
      "verified": true,
      "author": "Sconnie",
      "helpful_votes": 4,
      "publication_date": 20171016
    },
    {
      "title": "Leak. Switching back to Podee.",
      "text": "These bottles leak terribly. I exchanged them and the new set leaked as well. I have never had any leaking problems with Podee bottles so I will be switching back to those.",
      "rating": 1.0,
      "verified": true,
      "author": "Judith",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "My wife thought I was crazy",
      "text": "When these arrived, by wife gave me a look like...well, you know the one. But these were a game changer. Our little girl started using them at about 4mo and they were incredible helpful in allowing us to stay productive while she was eating. Cleaning takes a few minutes longer than with a traditional bottle, but that time was more more than made up for by how much time we saved while feeding. Several people asked me where I got them.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn O. Olorundami",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Terrific design",
      "text": "A MUST HAVE bottle. I am able to finally eat while baby eats. I am a happy momma. Highly recommended. I ordered more so that I have extra on hand for when we travel overseas.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "They were great for road trips",
      "text": "We first bought these bottles over ten years ago for our triplets. They were great for road trips. Jump forward to today our sons little girl is 4 month living in Texas and I bought the bottles again because they are driving 12 hours home for a visit. We tried them out before hand and the baby was able to drink out of these bottles on the first try. All we had to do was bring the milk up to the nipple ( like priming a pump). She took the bottle like a pro.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Love it worth every penny",
      "text": "This is a purchase that every parent needs that travels with an infant. This made my four hour drive very easy. He liked it instantly. I never use it at home but when I travel it's that one item I make sure I have",
      "rating": 5.0,
      "verified": true,
      "author": "JENNIE",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "A must for twins!",
      "text": "An absolute lifesaver! But just like another reviewer mentioned for these smaller babies you might have to suck the milk up to the nipple to get them started. My twins are 5weeks and we’re preemies and are able to use this despite that these are recommended for ages 3mo and up. Get this for any twin mother!",
      "rating": 5.0,
      "verified": true,
      "author": "sarah5914",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "waste of money",
      "text": "my baby hated it, it keeps leaking and falling out of his mouth, not intended for young kids. I would only recommend it for a year old not earlier. hard to clean. not reliable",
      "rating": 1.0,
      "verified": true,
      "author": "MilaSapa",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "I love love love",
      "text": "I love love love. I bring my 8 wk old to work everyday and saw my friend with twins use so i decided to try, we have tried every ANTI SPIT, COLIC bottle out there. we have been using for 2 days and he has never been calmer. Now his spit up is like a normal baby and he has very smooth burps I highly recommend. I am so far only using while at work so i can feed him at home but I may only start using these bottles if he continues to throw up with the others.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Coulthard",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Love it!",
      "text": "Love the product. Works perfectly and isn’t much more difficult to clean than our Dr Browns bottles that are our mainstays. Wish it was a little more self explanatory to put together, but I am learning better each time I use it. Baby used it just like it was his normal bottle and had zero issues transitioning or trouble with getting excess air.",
      "rating": 5.0,
      "verified": true,
      "author": "Meri.beth",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Makes Bottle feeding so much easier",
      "text": "I am so in love with these bottles!! My daughter absolutely loves them too! They are super easy to use especially perfect to use on car rides. No more trying to reach in the backseat to hold the bottle. Only downfall I see is cleaning all the pieces(but they do give you the pipe cleaner for the tubing!)",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth1103",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Depends on the baby",
      "text": "I'm giving 4 stars because it is a good product and ive seen it work. It works perfectly for my friends baby But it depends on the baby. If you're baby doesn't have strong suction or is easily frustrated i would not recommend. My daughter wasn't able to get the milk all the way up the straw within a few sucks and she would give up.",
      "rating": 4.0,
      "verified": true,
      "author": "Summer Spoerl",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Works great, just make...",
      "text": "Make sure you screw everything on well, we had one fail, but it was my fault. Exactly what I wanted. My only complaint has nothing to do with the bottle...timing my pumping to fit baby's feeding time. We exclusively nurse, so bottle feeding is new for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Txalarmguy",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Perfect",
      "text": "I absolutely love this bottle. As a busy mom I don’t always have the time to sit and feed my baby as much as I would love to. These bottles have made feeding on the go a dream. The only thing I will says is that the number on the bottle are extremely hard to read and should have been a different color. Other than that perfect perfect perfect!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandrea",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Great bottles",
      "text": "We've had the podee brand of these bottles with my other 3 kids and they were life savers. We bought these since our youngest had colic. They xame in handy and loved them just as much but our baby didnt care to much for them as he ended up being very picky about which bottle to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Kohlin",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "I don't like this. Reassembly is too hard and the pieces ...",
      "text": "I don't like this. Reassembly is too hard and the pieces are too hard to clean and keep track of. And my baby doesn't like the nipple. Too bad",
      "rating": 1.0,
      "verified": true,
      "author": "Rachael Ailshie",
      "helpful_votes": 2,
      "publication_date": 20170819
    },
    {
      "title": "Not for us",
      "text": "Alot of parts to clean, my baby was 6 months old when I purchased it, the idea is great and the thought pf not having to park to feed my baby was awesome however, my baby kept pulling the tubes, it was a mess, and it seemed like it was hard for him tp suck milk out.",
      "rating": 3.0,
      "verified": true,
      "author": "Linzy",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "but the bottle has been great. My little girl is 4 months she might ...",
      "text": "I don't know that its Anti colic because my baby didn't have colic, but the bottle has been great. My little girl is 4 months she might do better in a couple more monthsshe does have to suck a little harder than with a traditional bottle. but the hands free part is super convenient when you are on the go.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "These bottles are awesome.",
      "text": "I only gave this product 3 stars because one of my bottles came in with a crack in a spot where I attach a tube. I was able to make It work instead of trying to go through amazons horrendous return tactics. These bottles seem to help with my sons reflux as he can eat at his own pace.",
      "rating": 3.0,
      "verified": true,
      "author": "Marisa",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Great Invention!!!!",
      "text": "I love these bottles for my twins!!! I purchased both the four ounce and the 9 ounce set. It’s perfect for moms with multiples and it comes with two! Purchasing these bottles have been a game changer! It’s easy to use, and perfect for small babies as well. It comes with a cleaning brush and extra nipples that helps with cleaning. Once you understand how to assemble, it then becomes second nature. It’s an amazing invention. Will definitely reccomend. I also love this brand of bottles they are nicely made and doesn’t look cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby Marr ",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "great and useful product!",
      "text": "It took a little time to figure out how to assemble at first, but it was worth it. Our 7 month old drank from it fine on her own. Sometimes she likes to grab things, so she might pull on the straw a little while she drinks, accidentally yanking the nipple out of her mouth...so i just have to watch out for that and put it back in her mouth every once in a while. Overall, we love it and it spares us a few free minutes to catch up on things while she drinks on her own.",
      "rating": 5.0,
      "verified": true,
      "author": "V. V.",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Perfect bottles",
      "text": "These bottles are definitely recommended they are needed. They aren’t hard to clean or hard for the babies to suck. For two bottles like these the price is great",
      "rating": 5.0,
      "verified": true,
      "author": "MsShawnaaa",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "They work",
      "text": "Loved these for my little one on the go in the car. The nipple dripped alot but the baby stayed fed.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen huffman",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Why isn't this the way to do it?",
      "text": "Seriously the best my little Tobias loves that he can still be in his swing and eat and mom and me love that sometimes we can do things while he's eating. 10/10 would suggest every parent try this out",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Overall good product",
      "text": "Pros- These bottles are life savers for when you're trying to multitask! However, my baby didn't like the nipples that came with the bottles, so I bought different nipples. Assembly- The instructions make it easy to put the bottles together. Cleaning- Honestly, there are a lot of parts so the bottles are a pain to clean but the company included a little cleaning brush which helps. Cons- I noticed air bubbles form in the tubing when my baby decides to take a break from drinking. If your baby spits out their pacifiers this product may not work for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Don’t buy these",
      "text": "Don’t buy these. They don’t work and if you just try to use the bottle portion it leaks all over the place. Horrible quality. My son couldn’t even suck the milk up and there were so many air pockets in the tube.",
      "rating": 1.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Perfect for multiples!",
      "text": "This product has become indispensable in our home. My husband and I work full time and have been trying to find a way to feed our triplets most efficiently. These bottles were the key! The babies don't have to wait and watch as their sibling eats, they all eat at once. This has cut my feeding time from 40 minutes a feeding to 10!",
      "rating": 5.0,
      "verified": true,
      "author": "EllaM",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Horrible waste of money",
      "text": "This product was horrible didnt work at all witch i was so disappointed cause i have twin an was hoping this would make things easier but was totally wrong my boys couldn't even get the milk to come through the line an its ver hard to clean",
      "rating": 1.0,
      "verified": true,
      "author": "Hannah terrell",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Cute concept but dint get to used them",
      "text": "My baby grew too soon this took a while to arrive but this are great. For small kids",
      "rating": 5.0,
      "verified": true,
      "author": "kris",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Exactly what we needed for for my 3 month old ...",
      "text": "Exactly what we needed for for my 3 month old for those long car rides to and from work. I read other customers complained about their baby getting too much air, hard to assemble and difficulty cleaning but I’ve encountered NONE of those issues.",
      "rating": 5.0,
      "verified": true,
      "author": "D.E.Pat",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Do not buy",
      "text": "The idea is great but application is terrible. Everytime my babies stop sucking the milk goes all the way back to the bottle and then they have to try even harder to get milk. I was really hoping this would work but it's not efficient at all. I would not recommend this product at all. Basically I got two really expensive bottles that I could have bought for a dollar at Walmart.",
      "rating": 2.0,
      "verified": true,
      "author": "Kasey",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "... the thought of it on FB i know she’ll love it i can wait to see her face saturday ...",
      "text": "it’s a gift & she hasn’t received it yet but the fact that we joked about the thought of it on FB i know she’ll love it i can wait to see her face saturday 😹",
      "rating": 5.0,
      "verified": true,
      "author": "heyKelKel",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Amazing!",
      "text": "My son is very lazy & wont hold up his bottle on his own (he’s 10m) this bottle is just what he needed! He loves it & loves to play with it! Very impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Mindy",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Does what it says.",
      "text": "It took awhile for me to figure out how to put everything together. I tested it out and it does what it’s suppose to do but my son eats very slow when using this. I don’t know if it’s the suction or maybe I didn’t put it together well enough. Other than it’s great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Giving Mommy Her Hands Back",
      "text": "I love how this functions! My little guy doesn't like to hold his own bottle, so this allows him to eat while giving me the ability to use my hands. Only downside is that it can get messy and topples quite easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Toni Serpa",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Don't waste your money on these!",
      "text": "These did not work at all. Very disappointed as they weren't cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Amberly",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "To soft of tubing!!!",
      "text": "So...I got these and very much dislike them. Yes they do the job for the child but because the tubes r do soft my 8 month old sometimes bends it and puts a kink so she can't get any milk. Annoying. Also the soft tubing is so soft and stretchy that it's a pain to get it apart and together. But it does work. Lol. The lil jumbl brand bottles have a stiffer tubing that my child needs. O and the soft tube always gets hair or fuzzies attached to it. Eww",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda Kleinhenn",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Easy to use",
      "text": "Item gets a lot of positive attention when we’re out in public. It is extremely conviniant for car seat and when strapped in body carrier. Easy to use, complicated when it comes to assembling. Terrible for colic. The straws are some what easy to clean, with the brush it comes with.",
      "rating": 4.0,
      "verified": true,
      "author": "Vanessa ",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Why is it not working",
      "text": "I have gone over and re put these bottles back together about five times now.. Given it to my baby and when he sucks nothing is coming up.. I have basically given up on these bottles at this point.",
      "rating": 1.0,
      "verified": true,
      "author": "Sherri Lee",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Perfect for busy moments",
      "text": "I used this bottle for the first time today. I sat my 6 month old on his chair to feed. It was confusing to assemble at first but I got the hang of it. At first he just sat and drank but eventually he kept pulling it out of his mouth. He could not pull the tube out of the nipple though, which I am very grateful for. This will not work for every feeding but it will be so helpful for car rides and busy moments when I do not have hands free. So excited!!!",
      "rating": 4.0,
      "verified": true,
      "author": "casie",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Missing  pieces",
      "text": "I got the product and opened the box and the 2 disk that connect to the two tubes was missing I contacted the sell on amazon and there Facebook page and was told the will mail me a replacement and they did with no problem thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Javalynn",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Great product, instructions need to be more clear",
      "text": "It works great. A mom I know had a similar bottle from another brand and raved about what a lifesaver it was. My third baby just turned 4 months and I needed something for those times when we had no choice and are on the go. This is so easy to use and has been a lifesaver, it did take a couple of uses for the baby to get the hang of it but now he uses it no problem. My only complaint is that the included instructions are pretty unclear and I ultimately ended up using a YouTube video to figure out how to use it the first time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Great bottle!!",
      "text": "My friend told me about this bottle. It is heaven sent. My baby is 3 months and i use it with him. Hes very advanced for his age so this is perfect. You can feed your baby will pushing a stroller or doing other things.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr and Mrs Barrett",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "I really enjoy these bottles",
      "text": "I really enjoy these bottles. I have twins and was looking for an option where I could feed them both at once. The only thing that bothers me is that because the baby has to hold it like a pacifier there is a lot of leakage at the mouth. Not a huge issue as it allows me to feed both at the same time which is a life savor with two newborn babies hungry at once! :)",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica H.",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Life Savor!!",
      "text": "This bottle is perfect for car rides and walks. My son had no trouble with the bottle. So far no leaks or anything like that. Plus it came way sooner than expected. I recommend this product to all parents.",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Patience is worth it",
      "text": "Ok the first five times are difficult. But once you get the hang of it the baby loves it! My son is eating more at a sitting and faster. I give him this bottle right before bed and he sleeps at least 6 hours now! (2 months old). Great for the car too",
      "rating": 5.0,
      "verified": true,
      "author": "K.B.",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "I loved these, until they stared to leak.",
      "text": "Update: I contacted customer service and they sent a new set! No problems now! I loved these at first!! I’m so sad, after the second use, the bottles started to leak as if the nipple no longer fit properly. It seems super loose in the bottle now and makes a huge mess. Also allows air in the bottle.. no good for me.. Hopefully customer service will help me in regards to their QC. I hope I just got a bad pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Adeline Johns",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great idea but needs improvement",
      "text": "This is a fantastic idea, BUT you have to start the suction process or else the baby gets a ton of air in their belly, and if they drop the nipple, you have to start all over again.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle S",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Does not really work",
      "text": "These dont work very well. The nipple leaks. Air gets into the tube causing a lot of gas.",
      "rating": 1.0,
      "verified": true,
      "author": "Taryn Truese",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "A must have baby product",
      "text": "Love this. It comes in handy when your baby is hungry and you are driving. It does take them a bit to get use to it. My son still spits it sometimes like he does with his pacifier.",
      "rating": 5.0,
      "verified": true,
      "author": "jaclyn cornelius",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "But this!!! It’s awesome",
      "text": "Love love love..... so far I only been using it for a couple of days but works awesome especially in the car or while I’m cooking dinner!! A must have for any busy parent on the go!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ayanna",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "There cool",
      "text": "I bought these and my daughter just doesn’t like them she doesn’t like no bottle unless it’s DR.BROWNS",
      "rating": 3.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "I have twins so tandem feeding is hard for me ...",
      "text": "I have twins so tandem feeding is hard for me when I am by myself! These bottles have helped me so much! In the mornings when both babies wake up and are hungry at the same time, I get them settled and then give them these bottles, they are able to drink their entire bottle without much assistance from me, occasionally I have to go put the nipple back in their mouth if they drop it, but while they are eating, I can everything for the day ready! It’s been a life saver on time when I am by myself with the two of them!",
      "rating": 5.0,
      "verified": true,
      "author": "Mandi J.",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "The idea behind this product is great but it was a little hard for my baby ...",
      "text": "The idea behind this product is great but it was a little hard for my baby to suck on it and could not get the formula to go through have not been able to use it yet hopefully when you get a little bit older will be able to",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley Leonard",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Perfect invention",
      "text": "Your baby must like these type of nipples. Unfortunately my son did not but if he had of, this would’ve been perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Dyniesha Bennett",
      "helpful_votes": 0,
      "publication_date": 20190904
    }
  ],
  "product_meta": {
    "title": "Tinukim iFeed 9 Ounce Self Feeding Baby Bottle with Tube - Handless Anti-Colic Nursing System, Pink - 2-Pack",
    "description": "Color:Pink| Size:9 Ounce\n\nThe Tinukim iFeed Self-Feeding Baby Bottle with Tube - Anti-Colic Nursing System is an ingenious, handless feeding system designed to let you comfortably feed your little one in an upright position. This no-hands feeding device is tailor-made for babies 3 months and up and their busy, on-the-go families.\n\n\nSay goodbye to inconvenient feeding times/situations and to dropped bottles, and feed your baby anywhere on the go—while baby is in the carrier, carriage, stroller, or car seat. The controlled, air-flow design allows baby to easily regulate and manage feed pacing and flow amount. \n\n\nThe Tinukim iFeed Handless Nursing System is a portable, two-pack set that contains: 2 bottles, 2 adaptors, 2 disks, 2 nipples, 4 cap rings, 2 (6.5\") tubes, 2 (11.5\") tubes, 2 nipple covers, and 1 tube cleaning brush. \n\n\nBaby bottles are available in two sizes: 4 oz. and 9 oz. and three colors: Blue, Pink, and White. \n\n\nLimited one-year manufacturer’s warranty. Imported.",
    "rating": 4,
    "feature_bullets": [
      "SOFT LATCH-ON NIPPLE: The Tinukim iFeed Self-Feeding Baby Bottle with Tube - Anti-Colic Nursing System promotes proper latch, reduces nursing spills, and mimics natural breastfeeding—perfect for babies and moms who want to switch between breastfeeding and bottle feeding",
      "LEAK-FREE VENTING TECHNOLOGY: Reduces air build-up associated with colic; also helps reduce gassiness, ear infection, and spit-up",
      "PORTABLE & EASY TO USE: Features a wide mouth, rounded edges, and clearly marked measurements for ease of use, and easy fill-up and cleanup. Portable set includes: 2 bottles, 2 adaptors, 2 disks, 2 nipples, 4 cap rings, 2 (6.5\") tubes, 2 tubes (11.5\"), 2 nipple covers, and 1 tube cleaning brush",
      "NON-TOXIC DESIGN: Made with high-quality silicone—free of BPAs, phthalates, PVC, and lead",
      "DURABLE CONSTRUCTION: Safe to use in microwaves, freezers, dishwashers, boiling water and sterilizers; heat resistant up to 392˚F"
    ],
    "specifications": {
      "Product Dimensions": "2.6 x 6.4 x 8.75 inches",
      "Item model number": "TFSB80303P",
      "Is Discontinued By Manufacturer": "No",
      "Material free": "Lead Free",
      "Batteries required": "No",
      "Item Weight": "6.4 ounces",
      "ASIN": "B01MFDBWQN",
      "Customer Reviews": "4.0 out of 5 stars607 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#2,455 in Baby"
    },
    "categories": [
      "Bottles",
      "Bottle-Feeding",
      "Baby Products",
      "Baby",
      "Feeding"
    ],
    "price": 16.99
  }
}