{
  "website_summaries": [
    {
      "verdict": "The gym-friendly Jaybird X3 wireless earphones deliver high-quality audio in a comfortable, secure-fitting design.",
      "pros": [
        "Powerful audio performance with strong, rich bass and well-defined, bright highs",
        "Ships with plenty of ear fit options",
        "Solid companion app offers customizable EQ"
      ],
      "cons": [
        "Left and right earpieces are not labeled",
        "Easy to misfire with remote control layout"
      ],
      "aspects": {},
      "publication_date": 20161027,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Choose something else - unreliable!!",
      "text": "I am disappointed at the quality of the buds. When working the sound quality is superb but I have just had my second failed pair since Dec. One pair 'jammed' on the red LED and despite completing the recommended product reset it failed to regain 'life'. Amazon replaced these. The second resorted to playback in 'slow motion' whilst on holiday mid run and then the LED lights failed which the manufacture site as a hardware fail once the recommended product reset is again tried to no avail. For a c.£100 product this is pretty poor. I have no desire for a 3rd pair so I'll be contacting Amazon for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. M. S. Vickers",
      "helpful_votes": 4,
      "publication_date": 20180603
    },
    {
      "title": "Eartips will fall off after a few months of use!",
      "text": "Headphones are great at first, with good sound quality, and they’re quite comfortable. Mic isnt particularly great but im okay with that. However the biggest problem ive had is the silicone ear tips ‘loosening’ after 5 months of constant use. As a result they just fall off the headphones with minimal force and I eventually lost them both. A few other people have had this problem but unless you live in the US dont expect any help (customer service is shocking in my opinion). Paying £10-20 for a replacement set is ridiculous. Would not recommend this personally.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171011
    },
    {
      "title": "More rubbish Bluetooth",
      "text": "I ordered one pair of these and the initial pair completely refused to charge so Amazon kindly sent me another pair. The second pair worked for about 10 days and now have started to cut out and then refuse to connect. I'm sick of Bluetooth headphones not working it seems like every pair I get brake very quickly",
      "rating": 1.0,
      "verified": true,
      "author": "Ian Johnson",
      "helpful_votes": 4,
      "publication_date": 20180410
    },
    {
      "title": "Good headphones, don’t lose the charge clip",
      "text": "One of the better sport focused Bluetooth headphones I’ve found. The charge clip is mildly infuriating though. It’s incredibly easy to lose - you have to keep it with you to charge your headphones and it’s incredibly tiny. If/when you do lose it the cheapest I’ve been able to find a replacement online, including delivery, is from Jaybird for £20! Whilst I don’t know what the weight of the clip is (because, as you may have guessed, I’ve lost it again) I’d guess it weighs about a gram or so; gold is £30 a gram so you’re getting into precious metal territory for this thing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171205
    },
    {
      "title": "Ok but I won’t buy again",
      "text": "These headphones are not bad. For comparison you can get similar *looking* headphones for £20 that aren’t bad, they have pairing problems after a month or two and are not loud enough in some situations. Your mileage might vary based on brand. These are loud enough and have cool audio profiles. Does that justify the extra £90. Absolutely not. The battery life is not great, the charging clip SUCKS, and you can’t buy a replacement. Oh yes they are kind of sweat proof too.",
      "rating": 2.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Earbuds come off easily",
      "text": "Aside from just that, it's not too bad. Sound quality is great and with the app made by Jaybird you can fine tune it to sound however you like which is absolutely great. It also comes with a bunch of accessories and a nice carrying pouch which helps it live up to the huge price, but once again the earbud situation is quite frustrating as it's quite easy to lose them.",
      "rating": 4.0,
      "verified": true,
      "author": "Sami",
      "helpful_votes": 2,
      "publication_date": 20170521
    },
    {
      "title": "Video Audio Lag",
      "text": "They are great earphones in general but the only issue I have come by is that the audio is delayed by a second or two when whatching videos on my iPhone. This is an issue that many Jaybird X3 users have and apparently Jaybird said they a “looking” into this issue. But who knows how long that’ll take! REALLY FRUSTRATING",
      "rating": 1.0,
      "verified": true,
      "author": "Deeyan Rizwanuddin",
      "helpful_votes": 3,
      "publication_date": 20180413
    },
    {
      "title": "Very poor battery life - extremely disappointed",
      "text": "I was sold on the eight hour battery life as I do a lot of long distance running. I fully charging them before a run and two and a half hours in I got a warning saying the battery was low. I don't know where they got the eight hour battery life that is advertised from! Considering I mainly bought them for this reason I am extremely disappointed they can be falsely advertised The sound is amazing and they fit great. The wings that are provided can be easily lost though, as they slide off quite easily!",
      "rating": 2.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 2,
      "publication_date": 20170903
    },
    {
      "title": "A quality pair of wireless earbuds",
      "text": "These are a pretty nice pair of sports headphones. Despite the ability to wear them in two different way (one with the wire hanging down like traditional earbuds and one where the wire loops over your ears) three different size fins and three different size buds in two different materials I have really not found a combination that is really comfortable. That said, they are no worse than any other pair I have owned so I have either peculiar ears or am extremely fussy. I have worn them on plenty of runs now and the sound rarely breaks up. The different profiles you can get in the app is excellent and really enhance the sound quality.",
      "rating": 4.0,
      "verified": true,
      "author": "The Jacket",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Faulty after 2 months",
      "text": "I ordered these on the 6th of January with prime delivery and have used these almost every day, they have one of the best sound quality and very long battery lifetime but this is my second pair and the first one was faulty and I could return them in time via amazon but with this pair I cannot return them, with a slight bump or shake and the earphones just turn off and then you have to turn them back on and pair them back with your device all over again. I have not abused these in anyway iether.",
      "rating": 2.0,
      "verified": true,
      "author": "Imogen Swanton",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "2 returned units and gave up.",
      "text": "Bought mainly for use in the gym. Good fit, ok noise isolation, and alright sound once you use the app to change the default sound levels. Nothing mind blowing. However both units gave up at around 3-6 months and refused to turn on. I'm guessing due to sweat ingestion which shouldn't be the case with a product like this. Save your time and money for something better rated for water/sweat and with better sound. Proprietary charger is a negative also - especially when it didn't help the water resistance! Now using Shure IEMs with Westone V2 Bluetooth cable. Far superior sound.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave C",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Expensive but you do get what you pay for",
      "text": "Expensive but you do get what you pay for. As others have said it can take a lot of experimentation to get a perfect fit, swapping in and out different sized buds, wings or routing the wire above or below your ears. Once I got it right though I can now just pick up the headphones on my way out the door and run for a couple of hours without even thinking they are there. Good sound quality, excellent battery life, and no issues with signals dropping out from my iPhone 7.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hill",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Earphones themselves are very good. They can pair with 2 devices simultaneously and ...",
      "text": "Very punctual delivery, arrived within 3 days of ordering. Earphones themselves are very good. They can pair with 2 devices simultaneously and do so incredibly fast. There are multiple sized ear buds and wings which can be tailored to your preference and cable length adjuster as well. Sound quality is pristine and can be further tuned using the Jaybird app to suit your needs. Overall, these are a great pair of BT earphones and are well worth the cost",
      "rating": 5.0,
      "verified": true,
      "author": "David Killeen",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Stop working less than a year old",
      "text": "These have stopped working after 10 months. The right ear doesn't output sound. I'm disgusted there isn't a return policy with Amazon beyond a month for high end electronics. The number they recommend for contacting manufacturing doesn't work either. I won't buy x3 again. My X2 are older and no bother but read feedback if this happening to a lot of x3s that the right one stops working",
      "rating": 1.0,
      "verified": true,
      "author": "Ms Eveleen Daly",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Sound quality is good, however",
      "text": "High expectations for this product. This is my second pair as I had to return the first due to many many dropouts. Sound quality is good, however, battery life has deteriorated after having these for 4 months. Dropouts occur when you are outside too. Overall, disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Sharif Kawser",
      "helpful_votes": 2,
      "publication_date": 20171213
    },
    {
      "title": "Great for the first 3 months, until both units i have had developed problems",
      "text": "Comfortable, responsive bluetooth headphones with good sound quality. Terrible build quality however for sports headphones that are 'sweat resistant/sweat proof'. First set the on/off button stopped working, with minimal help from an overseas help and support team. Because I did like the headphones so much I bought a second pair which has now saturated discharging even when off so that I can't use the headphones because they have no battery when i want to use them. They will only be of use if i have charged them immediately before the workout. These would be great if they were robust and could stand up to what i would expect of sports headphones",
      "rating": 2.0,
      "verified": true,
      "author": "M Wright",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Stopped working 6 months in",
      "text": "These are great headphones but they just stopped working on me 6 months after buying them. They worked well before them but started to switch themselves off and started to decrease in battery life rapidly. Amazon were happy to refund me as Jaybird themselves said that it’s a hardware issue that can’t be fixed. Bit of a bummer really.",
      "rating": 3.0,
      "verified": true,
      "author": "Nananan",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Great running earphones with Reliability issues",
      "text": "I gave 2 starts as I really liked these earphones , they sound great, They stay in place while running, comfortable. But The biggest Disappointment for me is the reliability. I am returning my second set as is stopped working within few weeks. First earphone I bought was from Argos, In exactly 20 days it stopped charging. Second set I bought from amazon thinking that I was unlucky with my first pairs, but I was wrong these gave up in just 14 days. Very Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Fantastic sports headphones",
      "text": "These are the best headphones I ever owned. The sound quality is superb and they sit perfectly on my ears. The controls are easy to manipulate and nose insulation (with the foam tip) is excellent. However, I do not recommend using the foam tips if you are planning to run on busy roads. Battery life is excellent. I have 80% charge left after an hour's workout. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Y. KEREN",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "These are good",
      "text": "I've been using these for several years now. The sound quality is very good in my opinion. They're the first pair of decent earphones I've had. But compared to my desktop headphones they are still very good. Certainly a great step up from the basic earphone most people use. The ability to customise the sound profile is really great to have. My first pair stopped working for no apparent reason, Jaybird sent me a new pair with no hassle under my warranty. Current pair is going strong 2 (I think) years later. Would definitely recommend as far as price/performance goes.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Good battery life good sound hard to achieve",
      "text": "I have waited on reviewing these as I wanted to put them through there paces ..the sound quality is not as good as all the reviews made it out to be ... sound is a personal thing so maybe it’s just me I managed to get an ok sound out of these after Many hours of trying thanks to the excellent app ... so to sum up good quality phones , “best sounding though “ I don’t think so but like I said that’s a personal thing as for longevity time will tell a couple of months in and still going strong with good battery life",
      "rating": 4.0,
      "verified": true,
      "author": "lee edwards",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Wish I'd bought these first",
      "text": "Bought to replace a pair of Powerbeats (broken after three months due to sweat). The fit is perfect, battery life is truly useful, and the sound is awesome, particularly with the MySound app. Just buy them.",
      "rating": 5.0,
      "verified": true,
      "author": "Supercholdi",
      "helpful_votes": 3,
      "publication_date": 20170413
    },
    {
      "title": "I just simply love this earphones",
      "text": "I just simply love this earphones, they’re my daily drivers lately. I love the design, the sound, the fit...i use them in the gym, on the street and at home also. I really appreciate the sound customization possibility in the Jaybird app, this is a unique feature. The only thing i dislike (or hate) is the charging dock...sometime it’s frustrating, if you forget to bring it with you in a trip, there is no possibility to charge the headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Jozsef Balazs",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "I Have had these a few months now and the ...",
      "text": "I Have had these a few months now and the battery has already lost its power, i have to recharge them after every session at the gym so no 8 hour battery life for me. Update review, now the Bluetooth connection keeps cutting and the battery last no more than an hour, should have just went ahead and bought some beats headphones rather than wasting the money i did on these.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Richards",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Love these",
      "text": "These were well worth the investment! Bluetooth so far has worked perfectly and they keep me going for my long marathon training runs. Took me a couple of wears to work out which buds fitted me the best but great to have a range to find the best comfort",
      "rating": 5.0,
      "verified": true,
      "author": "Cazza",
      "helpful_votes": 2,
      "publication_date": 20170825
    },
    {
      "title": "never wear one with better sound, but battery lifetime is a froad from ...",
      "text": "Hi everyone... I've took some time for testing...in overall, sound of the headphones is magnificent...never wear one with better sound, but battery lifetime is a froad from Jaybird....there is no way that they can last for 8 hours... I've managed 4 hours on flat equalizer, and minimum volume, I've bearly heard music from them...I don't know why Jaybird still advertise 8 hour battery liftime, when it's obvious, from google and other complaints, that 8 hour battery life is impossible...",
      "rating": 3.0,
      "verified": true,
      "author": "Krunoslav",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "I love the fact that I can have two links",
      "text": "I love the fact that I can have two links. I switch from listening to music on my phone to watching a video on my laptop seamlessly when I'm studying. I admit, I'm still having one or two issues getting them in my ears and staying in my ears on occasion, but the explanatory videos are useful and I think it's my ineffectual use rather than inadequate headphones. My daughter assures me that there's a knack to it and I just haven't quite mastered it. Good sound and I go back to that switching between products - excellent!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Jo-Anne Hutchings",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Didn't fit my ears!",
      "text": "The sound quality and battery life on these are good - but they just didn't fit in my ears properly - the only way they would stay in was if I wore a headband over the top and then they were uncomfortable within the ear after a while. I tried lots of different size covers and nothing worked for me. Real shame as they were reliable and with good sound quality. I swapped for bone conductor style in the end as suited me personally a lot better.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs Amanda Chandler",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "These are absolutely fantastic, I was hesitant at first",
      "text": "These are absolutely fantastic, I was hesitant at first, but once I got the fins into the right position they blew me away. Having the strap tightened around the back of my head is fantastic, no more wires in the way! You could be thrown down a hill with these on, and by the time you got to the bottom, they would still be in your ear. The only issue I have is that when I turn all the way to the left the Bluetooth cuts out. It's bizarre, but not something I've noticed too much. I'd recommend these to anyone.",
      "rating": 4.0,
      "verified": true,
      "author": "Darren Kennedy",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Great for the right person but not for me.",
      "text": "These are great earbuds IF they fit your ears. Sadly these didn't fit mine and no matter what combination I tried they fell out of my right ear all the time whilst running as I know my right ear hole is bigger than my left. Of course I tried different size ones for each ear but, for me, these just don't work so I've gone back to my Powerbeats 3. For the right ears though these would be great and my daughter loves hers.",
      "rating": 3.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Music to my ears",
      "text": "Beautifully sounding earphones, you won't find better anywhere else. The price is a bit steep, and would expect to get a more premium carry case as seen with the X2s, since this product comes with a cheap little bag. Ear wings are also a massive pain to get in to place. Companion app is also awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Music cuts out if phone in pocket.",
      "text": "Songs cut out if my phone is in my pocket while I'm on my way to the gym. I have to keep the phone closer or in-hand. This did not happen with my other bluetooth headphones (much more expensive and full-size). In fairness, the other BT headphones have a much bigger battery/price/size, so it might not be fair, but I would expect this sort of thing not to happen. Once I'm in the gym, though, they work fine as my phone is usually stationary close to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Milos",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Good",
      "text": "Great sound quality generally, plus customisable sound profiles is a great way to tune them to personal taste. They do seem to be a little bit prone to Bluetooth interference compared to other Bluetooth headphones. Comparable audio quality to my Sennheiser Momentums IEs, although deeper and bassist, but less crisp/clear.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Wynne",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Amazing sound and with many options to wear it without ...",
      "text": "Updated: The product after 7 months of very light usage is dead. . I contact them for replacement, Looks that this hardware problem is vey common. Amazing sound and with many options to wear it without any problem under any condition . I run miles and miles and I feel so comfortable . If you try two three combinations then you will not have any problem with any ear size . For example I use medium on my left and Large in my right ear",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Battery life deterioration",
      "text": "Have had these for 5 months and the battery life seems to be a third of what it used to be. Barley makes it to the end of a session if i have been listening to music or using them anytime before at all. There is an advertised 8 hours of batter life and i seem to be getting 3 hours tops, would honestly like a replacement. I bought them to replace my other x3 where the left ear just died and the right ear keeps buzzing. But at least the battery is fine on those...",
      "rating": 2.0,
      "verified": true,
      "author": "Harry",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Unreliable",
      "text": "Wouldn't recommend. Not worth the money. They're obviously pretty expensive bluetooth headphones. One would assume they'd at least have a solid bluetooth connection. Unfortunately not. This is my 3rd replacement and each time they eventually just stop working/connecting. Now they only work if I hold the phone close to the headphones. Terrible! Also a real hassle to get in contact with customer support Jaybird. Hate when companies who are happy to charge big money for a product aren't then available for support. Seems a bit sketchy. It's unfortunate because the audio is pretty decent.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Great as long as the battery lasts - it doesn't",
      "text": "Wonderful sound and a great fit. Battery life was initially up to 8 hours, as it says on the tin. But after a few months' use, the battery life waned and now will no longer hold a charge. Jaybird's support is completely unresponsive - not just to me, but on their forum also in respect of other customers with the same problem. As with so many other Logitech-owned products, the X3's are designed to be flashy for a short period and then disappoint. DO NOT TRUST THE COMPANY.",
      "rating": 1.0,
      "verified": true,
      "author": "Grouse",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Faulty on arrival",
      "text": "Item arrived with one side not working. Control buttons seems like they would wear easily with heavy use but otherwise the kit looked fine. Cant comment on sound due to the aforementioned fault. Returned for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Padraig",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "My No.1 earphones best for sound Bass iss awosome recommended to everyone.",
      "text": "I tried so many earphones and headphones and by far these jaybird x3 are best earphones in affordable price. I don't know why people are giving negative reviews. and its app got sound settings and own equalizer and one you like setting you can save it on earphones and not to worry about and play it on any device with same sound settings and yes BASS is awesome audio is clear and so much better then BEATS headphones and earphones. Beats rip customers off.",
      "rating": 5.0,
      "verified": true,
      "author": "MavicPilot",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "OK sound but ooor and cheap design",
      "text": "Poor design: I've lost several tips and fins because they keep coming off. Now I don't have any right-ear securing fins. I am forced to use a left-ear fin in my right ear because design is so bad that I've lost every single right fin I had. Cheap materials: After a few months the paint started coming off the ears. Looks plasticy and cheap Loud notifications: Notification sounds are extremely loud Sound: OK but not great",
      "rating": 2.0,
      "verified": true,
      "author": "jc625",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "died after just a few months",
      "text": "At first I bought a refurbished pair, but the delivery wasn't even complete and they only ever lasted for a couple of hours without charging. So I thought I'd buy a new pair and they worked fine for about 3 months, but today during my run they suddenly turned themselves off without announcing that the battery was low and now they are off and won't be charged. There's a green light instead of a red one when I plug them in and they won't turn on at all, I'll have to bin them as the return period on amazon expired after one month. That's completely unacceptable for headphones this pricey.",
      "rating": 1.0,
      "verified": true,
      "author": "Murböck, D.",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Good product but doesn't charge",
      "text": "Initial thoughts were that this was a good product with good sound and feel. I don't like the charger and I especially didn't like having to return it when it didn't charge at all. I Googled the issue and it is a known issue with this make but it didn't deter me to by another one. Hopefully this one will charge!",
      "rating": 4.0,
      "verified": true,
      "author": "Garden_Goon",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Unreliable, bad warranty.",
      "text": "Headphones stopped working after 3 month. Jaybird customer services were terrible. Just kept messing me around. I videoed the problem and they said the iPhone video couldn’t be used because the video format was not a MP4. They would ask for info. I would give them that info. Then in the next email they would ask for the same info. Just kept going around in circles. I wouldn’t recommend these headphones. Pay a bit more money and get Bose!!! I wish I did.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Connectivity Issues",
      "text": "The headphones work fine as long as my mobile is on my arms. Music quality is really good, battery is very good too (averaging between 7 to 8 hours depending on music volume). I tried using it the last two days when I wasn't working out i.e. phone was in my pocket and the bluetooth connection kept breaking up.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Waste of time",
      "text": "Not impressed with these headphones. Turned them on and charged and connected to Bluetooth. The next day I tried to turn them on and nothing happened. I put them on charge and nothing happened. On day 2 I am looking at forums where other people have had the same issue. I decided to return and get a refund. On the forums this seemed to be a fairly common issue - but you won't search for issues until you have one. Waste of time.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenkon",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Questionable Durability",
      "text": "I have been using this earphone almost daily for like almost a year now. The plastic cable on end of the volume control is starting to fray and the copper cable part is partly exposed. There is sometimes some audio delay when you watch Netflix. It's like watching a badly dub video. On the other hand, the battery is ok, can last you for a day use per charge and the audio is clear for most of the time. On some days the audio can cut in and out. For me, it is a hard recommend for this product unless they fix it.",
      "rating": 2.0,
      "verified": true,
      "author": "Clarence C.",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "A great wireless option!",
      "text": "Previously owned the X2 and decided to upgrade. A noticeable improvement especially at the lower price compared with the X2s. X3 sound quality is substantially improved and the app provides greater customization. Also the ear buds themselves seem more comfortable and less obvious owing to the reduced size. Battery life is also as reported and lasts approx 8 hours. My only slight criticism would be the bespoke charger connection that has been adopted. All in all I’d strongly recommend to anyone looking for a high quality set of Bluetooth earbuds or looking to upgrade from previous Jaybird models.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Best Bluetooth headphones on the market.",
      "text": "Purchased as a Christmas gift for my son. Being wireless makes them easier to use, no dangling wires to get caught up in. They stopped working a few days after the warranty ran out and amazon sorted out replacements for us quickly and efficiently. The sound quality truly is amazing. We did a lot of research before buying and can truly say that we did buy the best on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimbomc",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Poor Bluetooth, great sound.",
      "text": "High quality headphones, with Comply tips they are excellent at isolating noise. Unfortunately, they are not good at maintaining a Bluetooth connection and frequently stutter, particularly when outside. As I purchased these for commuting, they aren't useable so I've ditched them.",
      "rating": 3.0,
      "verified": true,
      "author": "reevery",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Were fine for a few months until one side went crackly",
      "text": "Were fine for a few months until one side went crackly, then eventually stopped working. I opened a conversation in the support section of their website. I got one generic reply and have had nothing back since despite my subsequent enquiries. To be fair they were good while they lasted, but stopped working well short of their guaranteed time so I should be entitled to a refund but instead I'm being ignored. Very crappy service for such a pricey item.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "... and adjust equaliser before deciding whether this is a good or bad set of headphones",
      "text": "Please use your brains and look at the instructions download the app and adjust equaliser before deciding whether this is a good or bad set of headphones. Some of the reviews on here are so damn amateurish as they have not read the instructions properly and have not downloaded the app and made an assumption. Once the EQ has been adjusted they are one of the best set of headphones in this price bracket. Superb all round sound quality from Lower bass frequency up to treble.",
      "rating": 5.0,
      "verified": true,
      "author": "mr k s jeetla",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "stupid battery notification will be loud and drive you nut",
      "text": "stupid battery notification will be loud and drive you nut. Plus the battery will deteriorate way faster than you think. you will barely get most than 4 hours in the long run",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180421
    },
    {
      "title": "Great! (battery life not as expected)",
      "text": "Very good fit with quality sound. Marked down due to silly little charge adapter & battery life, lucky to get 3-4 hours (2-3 gym sessions) a least 2 times i have been unable to charge on the drive to gym, due to not having the little charging adapter so had to usw older wired headphones.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff g hmm",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Good quality headphones",
      "text": "Good quality headphones, plenty of accessories to make sure they fit well. I use them intermittently through out the day at work and in the evenings for the gym and the battery lasts for most of the working day without needing a charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 2,
      "publication_date": 20170421
    },
    {
      "title": "The buds themselves are very nice quality! The my sound app allows the buds ...",
      "text": "The buds themselves are very nice quality! The my sound app allows the buds to sound bass heavy all the way to extremely crispy in the highest of frequency. Allowing for almost all types of music. The only thing I dislike about them is compared to the x2’s the Bluetooth connection is quite a bit more difficult and the range is quite a bit less than the last ones but still work fine 90% of the time. Another point which is annoying is the magnetic clip that you use to charge them. What was wrong with micro usb?",
      "rating": 4.0,
      "verified": true,
      "author": "AJS",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Upgraded from the X1 and disappointed",
      "text": "I used to own the X1s and after I lost them after three years, I replaced them with these and was really disappointed. These were quiet, had poor battery life and a proprietary charger... And after 6 months one earbud stopped producing sound and the battery deprecated to less than an hour. Worthless.",
      "rating": 1.0,
      "verified": true,
      "author": "Alim Haque",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "They're overall a good choice but could use more battery life",
      "text": "Been using these for around 1 year now. They're good as far as I can tell. It lasts me on average 4 days in the gym at ~ 1 hour per day, so around 4 hours of continued use. They could definitely improve on battery life, but otherwise they're just fine for the gym.",
      "rating": 3.0,
      "verified": true,
      "author": "UniversalBlue",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Had them Almost a Year and Still Great!!!",
      "text": "I use them for nearly everything, from hiking, mountain biking, revision and walking around town. The ear tips are phenomenal at keeping the earphones in the ears, and the waterproofing has yet to let me down and I’ve been stuck in torrential downpour, the music just kept going. The app is a great feature and lets me tailor to my listening needs be it an audiobook/podcast to music. Everything just sounds great, as long as the app is utilised, otherwise they sound a little flat! But they were made with the app in mind so no complaints here.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "fit was very uncomfortable and sound wasn't that great. Noise isolation was terrible since they didn't fit ...",
      "text": "Either my ears are too small or I never figured out how to wear these headphones properly. They kept falling out all the time, fit was very uncomfortable and sound wasn't that great. Noise isolation was terrible since they didn't fit properly. I also got tired of always fiddling around with Jaybird application on my phone to get the most suitable sound according to the music I was listening to. I bought BeatsX instead which have a great fit and better sound then these headphones.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Sling",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Nice",
      "text": "The only bad thing I've experienced is that it's extremely easy to loose an ear tip. Not so much a problem with the foam tips, they aren't coming off, but the silicon ones, which is what I prefer to use, ar sliding off. Lost a tip twice in a short period of time. Using foam tips now.",
      "rating": 3.0,
      "verified": true,
      "author": "Janis Vepris",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "thank goodness amazon has a good returns policy",
      "text": "thank goodness amazon has a good returns policy. As soon as I tried them they felt very low quality. the wire, the strange feeling 'foam' buds and cheep plastic wings. after about 20 mins trying to get them to fit I gave up. For something costing so much I am very disappointed. I'm not quite sure how the other reviews rave about them. I didn't even listen to any music as I could not get them to fit acceptably.",
      "rating": 1.0,
      "verified": true,
      "author": "David Berry",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Avoid!",
      "text": "Not fit for purpose! Bluetooth dropouts are unacceptable and battery life is woeful probably because of the connection. I will be returning mine. Usually I give things a chance but have been disappointed by these.",
      "rating": 1.0,
      "verified": true,
      "author": "squeegee",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Good quality of sound if using adaptive foam. Sound is interrupted ocassionally after movement.",
      "text": "Pros: I love the audio quality when using the adaptive foam. It also provides a great noise isolation. Great battery life. Cons: sound is interrupted for a second many times when I move my head. It's very likely due to a wrong wire link and many people keep reporting this. They are also very unbalanced because of the remote.",
      "rating": 3.0,
      "verified": true,
      "author": "Jorge",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "All good",
      "text": "found these after buying some Jabra Halo from HMV, but the fit was no good, and its all about the fit with in-ear buds, these really are excellent compared, twice the price but worth the difference, super lightweight, great sound, stay put in my ears even without the included 'wings', nice small charger, good simple controls and voice prompts, fast pairing with my phone, nice app with user playlists (integrated from Spotify). More than I expected, recommended...",
      "rating": 5.0,
      "verified": true,
      "author": "R. Heron",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Broke within 6 months.",
      "text": "They work great at first - however the battery life decreased quite quickly. The connection became noticeably worse - I would have to leave my phone in specific pockets when cycling. Finally after 6 months it stopped playing music through one of the 2 earphones. Really terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Conor",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Paired with my iPhone easily, they have an app if you want to ...",
      "text": "Paired with my iPhone easily, they have an app if you want to start messing with graphics, turn them off and they let you know powering off, turn them on and they state battery %, come with a little pouch and a small charger, some found it fiddly but I found it ok",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya Pole",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Avoid at all costs",
      "text": "I’ve lost countless ear buds, the tip that the ear bud slides on to has a very weird design, only ear buds from Jaybird fit perfectly and as there is not much grip the ear buds just fly off. I’ve taken these on holiday with me an ended up losing the buds before I’ve even caught my flight, they slide off so easily! Really flawed design and probably one of the worst purchases I’ve ever made.",
      "rating": 1.0,
      "verified": true,
      "author": "Can’t stop buying things ",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Stopped working",
      "text": "I have had these headphones for 18 months and one ear has stopped working. I have reached out to the customer support and will update the review if/when this is resolved.",
      "rating": 1.0,
      "verified": true,
      "author": "badzy",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Great headphones but...",
      "text": "They truly do what they say they do. Very good quality, various ear plug sizes, packaged well and completely noise cancelling. However, give it under a year and one of the sides will go off and never work again! So many people have complained about this, but this hasn't ever been fixed. So keep in mind that the lifespan is a year. If you want it for longer, maybe look for some durable ones.",
      "rating": 3.0,
      "verified": true,
      "author": "taz",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Excellent",
      "text": "Really pleased with this product. Charging to 100% appears to take very little time, less than an hour. I've found the fit typical of earphones and could be better for me personally for a better sound. I use them primarily for the gym and they are brilliant for this as you have complete freedom to move around without them getting in the way and they havent yet fallen out. Would give a 5 star rating if I could get a better fit that improved the sound.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Excellent Product for th eprice",
      "text": "Great sound quality, pairs very easily, an App that actually is very useful. Docking a star cos of the charging base which is a little finnicky to get right. Battery does last 8 hrs with a flat sound profile but goes down to about 6.5 with a sound profile set via the app.",
      "rating": 4.0,
      "verified": true,
      "author": "Ijustgotsuckered",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Faulty connection",
      "text": "I was overall happy with the product for the first month. I don't use them very often but they quickly deteriorated due to what seems to be a software issues? The software-generated voice changed tone (much slower and deeper) after a while and now it just won't connect to my iPhone's bluetooth. Clearly not worth the price paid",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "dissapointment",
      "text": "Tried absolutely everything to get these to fit. All manner of swapping and changing out the different size ear pieces as well as over ear or under ear. Hugely dissapointed due to the price of these earphones, i ended up selling them Second hand at half the price i paid new. How can standard iphone earphones hold a fit but £90 earphones wouldn't. Dissapointing",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Almost good",
      "text": "I purchased these a few weeks ago, and my first thoughts were how small and sleek they were compared to my B&O’ in ear wireless. They are comfortable and snug, very suitable for active wear. The sound quality was little dissapointing but not bad for its value. Unfortunatly after less than 2 weeks of use my pair stopped charging. I have now returned and looking for something with a bit more quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Mus",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "But for that they are brilliant which makes it such a big shame",
      "text": "I have been a Jaybird fan for years but I'm close to having had enough, the main issue with my X3s is battery life, which seriously degrades after about 6 months (I have two pairs and the same trend has manifested itself on both after around the same period of regular use). But for that they are brilliant which makes it such a big shame.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. JV Denning",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Worst experience and model of jaybird X3",
      "text": "Please avoid this model if you want to avoid headaches! As you can see in the picture, the ear-piece snapped in half when I tried to put the ear bud cover on; I’ve had plenty headphones from different manufacturers, with none of them breaking before use. Quality feels really low, cheap plastic compared to other models, e.g. Jaybird X3 Sparta.",
      "rating": 1.0,
      "verified": true,
      "author": "Dylan Summerset",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Very happy.",
      "text": "Good quality premium iearphones, very pleased with the sound quality and battery life. Great for the gym and running etc.",
      "rating": 5.0,
      "verified": true,
      "author": "ownprocess",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Good headphones, small issues",
      "text": "It does the job - battery lasts as much as I need it (I listen 4-6h a day, never turn the headset off), the sound is good as well. The ear rubber tips are an issue for me as they keep falling all the time. I ended up glueing them in place, otherwise I would have lost them a long time ago.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexandru",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Its not user friendly",
      "text": "When i first got the earphones it took me a while to actually get started. After holding the power button multiple times until it powered on, its frustrated me. After my run, i forgot to turn off my earphones, whats really annoying is that it doesnt automatically turn off the earphones. But rather, it turns off once the battery dies. The next time i use it will be dead and i still have to charge the earphones.",
      "rating": 2.0,
      "verified": true,
      "author": "carl",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Don’t do it",
      "text": "The earphones are good however they have broke after a few months, I got a replacement and that’s just broke after a few months. Do not buy!!",
      "rating": 1.0,
      "verified": true,
      "author": "Harry P.",
      "helpful_votes": 2,
      "publication_date": 20180417
    },
    {
      "title": "Great improvement over Jaybird X2",
      "text": "I bought these as a replacement for my Jaybird X2s. The sound quality has greatly improved and I'm really happy with my purchase. The only negative would be the need for a special charging adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Kane",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Right headphone much quieter than left. Right headphone then lost all clarity in c. 3 months",
      "text": "From the outset the right headphone was significantly quieter than the left. I assumed it must have been a standard thing perhaps because the controls were on the right side. Then a few months in the right headphone at higher volumes started to lose clarity and the bass sound got very \"tinny\". Tried to return to Amazon but haven't received a refund as yet. poor experience",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Lasted 8 months, and now doesn't work",
      "text": "I really liked these headphones - I used them sometimes when I would bike to work (so like 4hrs/week for 8 months = approximately 150 total hours of usage. Unfortunately, they stopped working last week. They will no longer charge.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "OK",
      "text": "Had them for over a year and the sound quality has slightly diminished and the tips have worn out and so falls out with the slightest movement. If I had the choice to go back in time I would buy a cheaper one such as the MPOW earphones for 18 quid, and they have hooks over the ear and not in the ear.",
      "rating": 2.0,
      "verified": true,
      "author": "Honest reviews",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Toughest bluetooth headphones",
      "text": "These headphones are not advertised as particularly tough, but after using them for a year at work (I work outdoors), I can tell you that they are exceptionally tough. I have trodden them into mud, I have gotten them wet in the pouring rain, I have dropped them countless times. Excellent headphones",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Jones",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Satisfied. Good for fitness & audiophiles.",
      "text": "Bought it during the Black Friday sale and had it delivered all the way to Malaysia. Bit anxious about overseas purchase at first but satisfied that i received it a few days earlier than expected. Good quality build with excellent app for adjustments of equalizers to suit everyone’s audio style.",
      "rating": 5.0,
      "verified": true,
      "author": "tingikhon",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Silicone ear tips damaged",
      "text": "The headphones it self a are the best buy! I gave it a 4 just because the silicone ear tips that where attached to the headphones were in a really bad shape like dryed..and because of that they kept falling from my ear..the middle size..I had to take my girlfriend's that were in perfect shape..again the midle size...because after 3 days I lost one of them...so maybe better protection to the silicone ear tips!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "He did not and said the sound was terrible but once he downloaded the app the sound was ...",
      "text": "Bought for husband. Seemed difficult at first to get the right fitting. My advice is read the instructions first. He did not and said the sound was terrible but once he downloaded the app the sound was good. Seems very happy with them.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Broken product, broken customer support.",
      "text": "The bluetooth signal is so weak that I breakt out when I put my phone in my pocket. I literally have to carry my phone in my hand so it's not covered by anything and even then I loose the signal. On top of that I ordered a replacement which never arrived after which I call customer support, ordered another replacement which also did not arrive.",
      "rating": 1.0,
      "verified": true,
      "author": "John T.",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Very good headphones",
      "text": "I bought these for my boyfriend, he absolutely loves them. Sound quality is perfect, they fit very comfortable (if you like using ear buds type of headphones).",
      "rating": 5.0,
      "verified": true,
      "author": "Katarina",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great headset, BUT...",
      "text": "This is a great headset, BUT... The multipoint feature does not work properly. Having it connected to both the Windows laptop and the Android smartphone, all audio on phone calls are highly distorted and not usable. I've had it replaced by Amazon only to receive another unit with the exact same problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Caracostea Mihai",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Silicone buds bad",
      "text": "Everything is fine with this one (first order was with weak battery life), but this one has shi*ty silicone buds that falls off and doesn't hold on earbuds. Taking earphones off silicone buds stays in ear. And trips in a floor all the time.",
      "rating": 4.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Brilliant highs/mids",
      "text": "Unbelievable sound quality! Headphones got a massive volume on them too loud on full volume. Highs and mids got incredible range and detail. Lows are brilliant but not enough crunch for me and when on full volume bass doesn’t crackle the ear pods.... but as I said full volume is too loud. I play in a band and my hearing isn’t the best 👍🏿👍🏿",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Doesn’t charge after one day",
      "text": "The thing doesn’t even charge after one day I have paid so much money for it it’s just no good at all I love using them when their work but they’re very quickly go wrong",
      "rating": 1.0,
      "verified": true,
      "author": "Ashiqur Choudhury",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Amazing product, much better than my old X2 because ...",
      "text": "Amazing product, much better than my old X2 because of slightly different angle in the ear and great option for different equalizer settings which can gives you subwoofer like experience. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "Uncomfortable and not suitable",
      "text": "For the price you pay do not bother Such a bad experience They actually hurt in the ear My boyfriend has also tried them too as I thought it was only me but we both struggled Really uncomfortable and they still fell out my ear too! It’s such a shame as I done a lot of research and obviously you wouldn’t expect this with the price",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "🚫💪... 👎💩",
      "text": "Gret sownd, gret batri life but urm dey like browk aftur like 1 year, wire split un evrythink.. Such uh shame aswel like, cuz dey wur propur gud un all.",
      "rating": 2.0,
      "verified": true,
      "author": "D.Sumner",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Specialised Charger",
      "text": "Decent earphones but the fact they have a specific charger means I will never buy them again... Lose the charger, throw away the earphones... Ridiculous!!! I've moved to Aukey which use a standard USB. Would recommend them over Jaybird only for that reason... And they're cheaper!",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Horsey",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Ok but not great",
      "text": "Not as good as I expected so ended up being returned. Sound was great while battery had a good charge but noticeably deteriorated as power went down. Also didn't stay great in ears but then I guess everyone's ears are different. Have since purchased a pair of H buds and find them fine for a fith of the price",
      "rating": 3.0,
      "verified": true,
      "author": "Hops",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Perfect..",
      "text": "I've bought/tried a lot of Bluetooth headphones...Should have just bought this pair the first time around .....Perfect....Almost auto connect with my phone and PC every time no fooling around. Great fit ..totally satisfied ...",
      "rating": 5.0,
      "verified": true,
      "author": "Joe M. Jahn",
      "helpful_votes": 0,
      "publication_date": 20171204
    }
  ],
  "product_meta": {
    "title": "Jaybird X3 Bluetooth Wireless Headphones Compatible with iOS/Android Smartphones Designed for Sport/Running/Fitness - Black",
    "description": "Colour Name:BlackX3 is locked and loaded, ready for anything you can dish out on the trails, the slopes, in the gym or on the streets. Patented sports ear fins hug into the top, back and lower surface areas of the ear, providing a super-secure comfortable fit. The micro-sized design means you can comfortably wear your X3 under a helmet and wherever your active life takes you. The 8-hour battery* means you’ll never skip a beat and the customisable sound means you’ll never complain about too little or not enough bass – you’re now in control.\n\nBOX CONTAINS\n• X3 wireless buds • 3 sizes silicone ear tips • 3 sizes secure-fit ear fins • Cord management clips • Shirt clip • Charge clip • USB 2.0 charging cable • Sports carry pouch • 3 sizes Comply isolation tips",
    "rating": 3.3,
    "feature_bullets": [
      "The buds offer a full 8 hours of use between charges allowing for a full day of music or a full week of exercise",
      "A micro-sized design allows a 34% size reduction compared to X2; offers a comfortable fit for sport and when worn with a helmet",
      "Hydrophobic Nano coating ensures the product is safeguarded against sweat damage and rain showers even during intensive exercise; this allows X3 to be used during exercise with confidence",
      "Personalise your sound settings and have them stored on your earbuds for use with any music device; the Jaybird MySound app gives you full control of your X3 sound profile. Battery - Play Time - 8 Hrs. Standby Time - 200 Hrs. Charging Time - 2.5 Hrs. Quick Charge - 20 min = 1 hour Play Time",
      "The ability to wear the device in the under-ear or over-ear position to completely lift the cord off the back of the neck; your X3 will stay securely in your ears while you are being active"
    ],
    "specifications": {
      "Batteries": "2 Lithium Polymer batteries required. (included)",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "55.08 x 2.82 x 1.35 cm; 19.7 Grams",
      "Date First Available": "15 Feb. 2017",
      "Manufacturer": "Jaybird",
      "ASIN": "B01MQPGZ0Y",
      "Item model number": "985-000598",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "In-Ear Headphones",
      "Headphones, Earphones & Accessories",
      "Electronics & Photo",
      "Headphones & Earphones"
    ],
    "price": ""
  }
}