{
  "website_summaries": [
    {
      "verdict": "Small unit can be placed almost anywhere successfully, and the price is low.",
      "pros": [
        "Supports a multitude of video resolutions, including Ultra HD/4K",
        "Extremely easy to set up, and it works as advertised",
        "No degradation in audio quality",
        "Works well for multiple gaming systems",
        "Appealing price"
      ],
      "cons": [
        "Limited to 2 output devices",
        "There are some owner concerns over the longevity of this splitter"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Just perfect.",
      "text": "The box is everything you need for a cheap price. You do not need to install anything. It has clear instructions for you to follow. They are easy as one, two, and three. I use this to split the signal of my PlayStation 4 to a Elgato capture card and my main monitor. I have noticed no input lag or anything of the sort, so do not worry about getting any lagging images/audio. The images show two boxes coming in one package, though in reality, it only comes with one.",
      "rating": 5.0,
      "verified": true,
      "author": "Edwing A. Rodriguez",
      "helpful_votes": 33,
      "publication_date": 20190502
    },
    {
      "title": "works perfect, I only bought it because I am a fan of amplifiers.",
      "text": "Does exactly what I wanted it for (run a second tv to the bedroom off just the one cable box) no picture loss/distortion so for the price it saves me from hooking and unhooking the hdmi cables every night.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew S",
      "helpful_votes": 25,
      "publication_date": 20191001
    },
    {
      "title": "Fantastic craftsmanship!",
      "text": "I now have two tvs on with one signal. great stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Cox photography",
      "helpful_votes": 24,
      "publication_date": 20190720
    },
    {
      "title": "Worth a shot.",
      "text": "My parents recentlyd needed an HDMI splitter so they could watch the same channel between 2 TVs in different rooms. It worked PERFECT! They are very pleased. It was easy to setup. Had it up and running in less than 5 minutes! I would recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "mariaesther castillo morales",
      "helpful_votes": 22,
      "publication_date": 20190822
    },
    {
      "title": "These are good",
      "text": "Have had these in use for well over a year. No issues at all. They work great",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 22,
      "publication_date": 20190414
    },
    {
      "title": "Worked as advertised",
      "text": "Worked great just plugged in hdmi cable and picture on both TV’S worked",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 21,
      "publication_date": 20190930
    },
    {
      "title": "Great splitter",
      "text": "This splitter is really great, it's small, it's easy to use, and the quality is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Iasiello",
      "helpful_votes": 18,
      "publication_date": 20191026
    },
    {
      "title": "Exactly as described",
      "text": "Great Product, Fast Shipping, Great Price. Highly Recommend. Excellent Customer Service",
      "rating": 5.0,
      "verified": true,
      "author": "Ross Donner",
      "helpful_votes": 18,
      "publication_date": 20190520
    },
    {
      "title": "good price",
      "text": "like it was small did not like it did not come with a power cube",
      "rating": 5.0,
      "verified": true,
      "author": "ray vidal",
      "helpful_votes": 18,
      "publication_date": 20190427
    },
    {
      "title": "Awful construction",
      "text": "Bought this in 2017, but turns out I didn't need it for that install. Just tried to utilize it last week and the USB port for power was totally broken off the PCB. Totally useless junk. Poor construction.",
      "rating": 1.0,
      "verified": true,
      "author": "Who knows",
      "helpful_votes": 4,
      "publication_date": 20190331
    },
    {
      "title": "Works reasonably well - but didn't last 2 years",
      "text": "I purchased this to split my cable box output to a TV and SlingBox. Worked great for nearly 2 years, then I started getting periodic signal loss at either/both output connector. Disconnecting the power adapter or video cables and reconnecting them usually fixed the issue. Eventually the output signals were lost and couldn't be restored. I swapped out power adapters with no luck. So for < $15 it did its job for 2 years. So not a bad value. I am replacing it though with a much higher quality device that includes its own AC power adapter, rather than depending on a USB power source.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Simmons",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "NewBEP HDMI Splitter suddenly stopped working and is rubbish",
      "text": "Used this for a very simple 1080p blu ray connection to two televisions. Usage was about two hours a day, three to four times a week. So let's say 8 hours a week for 20 weeks. So maybe 160 hours total usage since I bought the NewBEP HDMI Splitter before it stopped working. TV's are fine, can show 1080p on the existing HDMI input or any other input. Cables are fine, tried swapping them anyway. Blu ray player is fine, tried swapping that too. Tried a different splitter and things start working again. Conclusion: the NewBEP HDMI Splitter is not working. Don't waste your money or time on this splitter.",
      "rating": 1.0,
      "verified": true,
      "author": "Hubmbpbblplbmbth",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Works perfect. Super simple.",
      "text": "Works great. I use it with my DJ service to split the video from my laptop to 2 video monitors or projectors for visual effects, music videos or karaoke and with my video production rig when I am using 2 or more projectors when shooting live video of bands or other shows.",
      "rating": 5.0,
      "verified": true,
      "author": "Racquel Lynn Wilson",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Poorly made",
      "text": "USB charging port broke off inside the case. Plugged in less than ten times.",
      "rating": 1.0,
      "verified": true,
      "author": "Carlen L. Wilcox",
      "helpful_votes": 2,
      "publication_date": 20190805
    },
    {
      "title": "Nothing Special, Nothing Bad",
      "text": "Creates copy displays from one display, but not with the highest of quality. Again, COPIES displays, do not expect it to run multiple different monitors. It is also runs VERY hot, as in hot to the touch. Had fear of it overheating, and opted for a different solution. Never malfunctioned, but never impressed me either. Fine",
      "rating": 3.0,
      "verified": true,
      "author": "Joshua Busey",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "works well, good build",
      "text": "works good, just plug in and play. very well made, heavy duty yet compact. Comes with micro usb to usb cable for power, so you'll need to provide your own hdmi cable. I purchased this hoping to allow my laptop to have a 3rd display... not this one.. it only duplicates screen. picture quality is great though and works as specified.",
      "rating": 4.0,
      "verified": true,
      "author": "Jianre Hsiung",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Junk",
      "text": "This worked great for a few months then just died. Don’t buy this item!",
      "rating": 1.0,
      "verified": true,
      "author": "Joanie: FL",
      "helpful_votes": 2,
      "publication_date": 20190531
    },
    {
      "title": "Easy to use, works efficiently",
      "text": "Simple and easy to use. Can hook in one HDMI to input and share it with up two screens that have HDMIs through output It comes with a USB that you can plug into a wall outlet or the computer. Have had no issues with using it the last few weeks. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Ankit Gandhi",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Don’t buy this.",
      "text": "Worked great until it was outside of the return window. Now it randomly turns off my monitors for a few seconds at a time and restarts them. Amazon sells way too many low quality items and doesn’t take the time to properly get them vetted.",
      "rating": 1.0,
      "verified": true,
      "author": "ralph",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Not great",
      "text": "Blocks every now and then. Also little pixil dots jumping around the screen. Have had less then a year",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Great for PS3 and PS4 capture!",
      "text": "I use this for capturing footage of PS3 and PS4 gameplay with my elgato. This quality is good and easy to use instead of buying a special cable.",
      "rating": 5.0,
      "verified": true,
      "author": "Manny Lopez",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Worth five stars",
      "text": "I want to buy a dispenser, my friend recommended me to this store, the unique design attracted me. The NewBEP HDMI1 x 2 splitter is shipped very fast and the product works well. A good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "michael cheff",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "WRONG ITEM SENT.",
      "text": "Wrong splitter sent. I need 1 x 2 hdmi splitter with (1) hdmi input to (2) hdmi output. This one has outputs only. Will be returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Alpha C",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "What a piece of trash",
      "text": "I purchased this to occasionally view movies on my TV from my computer. Almost instantly it freaked out every so often and affected all my monitors (I have 2 but only one feed in attached to the splitter). Now it shuts down at random times quite frequently. I contacted tech support and they want me to take a video of it when it happens. I am not going to do that. DO NOT buy this piece of trash, purchase a better reviewed unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Zeiram66",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Boys",
      "text": "Easy to use bought them to link my boys TVs up so they could watch movies without trying to press play at the same time haha.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Does what it says. Easy to use",
      "text": "It is very easy to use, simply plug and play. I use it to split a CCTV video feed so I can play it on two HDMI monitors.",
      "rating": 5.0,
      "verified": true,
      "author": "Riddhi Patel",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Almost works...",
      "text": "I'm only getting audio through one of the HDMI ports on the back... Not able to get video",
      "rating": 1.0,
      "verified": true,
      "author": "Marcus",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Won’t work on old TVs",
      "text": "This splitter wouldn’t work for me. Both of the TVs were not smart TVs though. Don’t know if that makes a difference.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Brandon",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "avoid",
      "text": "horrible, it broke after a few weeks. the quality is awful",
      "rating": 1.0,
      "verified": true,
      "author": "O",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Good for the money",
      "text": "Good price and works pretty good. Had a couple of pauses when first hooked up but have not ahd one in awhile now.",
      "rating": 4.0,
      "verified": true,
      "author": "Justbling4me",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "My little Angle needs help",
      "text": "Daughter cant get it to stay up in locker at school.",
      "rating": 3.0,
      "verified": true,
      "author": "Larry quality1plus",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "I am very satisfied",
      "text": "After buying this splitter, I was trying to distribute the HDMI signal between the two TVs, both of which showed perfect and distortion-free images. The audio sounds great too. I am very satisfied with my purchase. Good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Melo",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Meh... Try another",
      "text": "After using the splitter for two weeks, it becomes sensitive to the touch and will lose connection to the screen your displaying. Could take repetitive attempts to get a display back on screen",
      "rating": 1.0,
      "verified": true,
      "author": "Jesus Covarrubias",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "GARBAGE",
      "text": "Complete waste of money buy one that plugs into an actual outlet 120v and not one that goes off a usb",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Cheap",
      "text": "The monitors turn on and off randomly when connected to this spliter",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "It is the perfect splitter",
      "text": "I bought this product and it works very well. The quality of the images is also very good and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Pauline Lewis",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "It is perfect",
      "text": "Because there is a TV in our room and in the children’s room. So I bought this dispenser. It’s really great, and the picture quality is fine. Now we can watch TV quietly in our own room. Really good.",
      "rating": 5.0,
      "verified": true,
      "author": "Yolanda Taylor",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Good product",
      "text": "This cable is very simple my daughter likes to watch Tv with this the 4K picture is very clear and it is also very convenient to use,I still buy one in the bedroom large",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Olvera-Du Bry",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "I am satisfied with this, but if I had the option I should have purchased a 1x4 instead of 1x2.",
      "text": "I'm not completely sure about this device yet. When first installed it worked flawlessly and I was ecstatic. However, later one of the monitors it splits to had glitches and we had to reboot the system. Now it is working fine for the last week. It was easy to install and very beneficial for our purposes.",
      "rating": 4.0,
      "verified": true,
      "author": "bargin",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Broken when received",
      "text": "Broken when I received it. The USB part was broken off & missing from the item.",
      "rating": 1.0,
      "verified": true,
      "author": "BlkDuck00",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Worth five stars",
      "text": "Great hdmi splitter Very easy to use device, can do the expected work, and its image quality is also very good. Now it is working perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Michel Diaz",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Worked exactlu as desccribed",
      "text": "The splitter worked well. It gave me a clear picture with the image going to a projector and a television both were at the length limit for HDMI cables.",
      "rating": 5.0,
      "verified": true,
      "author": "CR",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "not enough info",
      "text": "Did not work - would not connect --- the LED lights never turned green I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Smith",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Garbage",
      "text": "Hard no. Bought twice because the first one was defective before the second one. The power adapter input is shoddy and loose. It broke twice without a real reason. Spend a coupe of bucks more for a better one. You've been warned.",
      "rating": 1.0,
      "verified": true,
      "author": "WILLC",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "the corners of the belt buckle are square and",
      "text": "the corners of the belt buckle are square and sharp",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "A great way to use a single source and 2 devices.",
      "text": "I like the compact size of this device. It has a micro usb connection for busting the signal. I'm using the connection but it isn't needed because the device works fine without it because the hdmi connection from my cable box is suplying enough voltage to operate the device. I would recommend this simple little gadget to anyone who wants to duplicate the output of their cable box.",
      "rating": 5.0,
      "verified": true,
      "author": "E  Schaeffer",
      "helpful_votes": 22,
      "publication_date": 20190626
    }
  ],
  "product_meta": {
    "title": "NewBEP HDMI Splitter 1 x 2, 1 Input 2 Output HDMI Amplifier Switcher Box Hub Support 4KX2K 3D 2160p 1080p",
    "rating": 4,
    "feature_bullets": [
      "✔ ONE INPUT TO TWO OUTPUTS - This mini HDMI splitter can distribute 1 HDMI input signal to two HDMI output, transmit video and audio simultaneously, no loss, no lag",
      "✔ PORTABLE - Mini size: 2.5x2.1x0.5 inches/ 6.3X5.3X1.2 cm ( L X W X H ), light and small,easy to use and carry, travel friendly. USB cable included, no need external driver, safety and Eco-friendly",
      "✔ 4K ULTRA HD RESOLUTION - Support 4K, 3480x2160p, 3D, and 480i@60Hz/ 480p@60Hz/ 576i@50Hz/ 576p@50Hz/ 720p@50/ 60Hz/ 1080i@50/60Hz/ 1080p@50/60Hz/ 1080P 24Hz 3D/720 60Hz /4K@30HZ [For 4K resolution, the frequency can't above 30Hz]",
      "✔ SUPPORT - Support HDMI v1.3/1.4, HDCP compliant ( version 1.2 ). Support deep color 30 bit/36 bit. Support audio format: DTS-HD/Dolby-true HD/LPCM7.1/DTS/Dolby-AC3/DSD/HD(HBR)",
      "✔ PACKAGE INCLUDED - 1 * [ 1 in 2 out HDMI splitter], 1 * [USB power cable]"
    ],
    "specifications": {
      "Product Dimensions": "2.5 x 2.1 x 0.5 inches",
      "Item Weight": "2.4 ounces",
      "Manufacturer": "NewBEP",
      "ASIN": "B01MT12OQA",
      "Item model number": "PA170119YC17AA",
      "Customer Reviews": "4.0 out of 5 stars246 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#104 in Satellite TV Splitters#147 in Satellite Television Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 20, 2016"
    },
    "categories": [
      "Accessories & Supplies",
      "Audio & Video Accessories",
      "Satellite TV Equipment",
      "Splitters",
      "Electronics"
    ],
    "price": 11.59
  }
}