{
  "website_summaries": [
    {
      "verdict": "A double-leg kickstand that is perfect for trekking, cruiser, and mountain bikes.",
      "pros": [
        "Constructed from strong, durable aluminum alloy",
        "Includes a wide, reinforced plastic foot with nonslip sole to prevent slipping on wet surfaces or sinking in mud",
        "Boasts a user-friendly push button latch design for adjusting the length of the kickstand",
        "Fits most 24 to 28-inch bikes"
      ],
      "cons": [
        "Kickstand's screws sometimes loosen over time",
        "Installation can be difficult"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "An adjustable, double-leg kickstand that can support a lot of weight and holds up well over time.",
      "pros": [
        "Fits 24-inch to 28-inch bikes",
        "Double-leg design provides ultimate stability",
        "Adjustable length",
        "Non-slip plastic soles",
        "Center-mount design keeps it out of the way",
        "Quality construction"
      ],
      "cons": [
        "On certain bikes, this kickstand may hit the chain or tires"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very good stand with caveats.",
      "text": "Really good kickstand for balancing a bicycle with heavy packs. Very durable with lightweight tubular metal construction, solid welds. It fits my old Schwinn road bike extremely well. The feet are height-adjustable. The spring tension for putting down the stand is very light, but not so much as to cause rattling when riding on moderately bumpy surfaces. Two slight issues for me: The height-adjustable plastic feet come completely off or can move at the accidental press of the buttons on each side, not relatively secure. There is some chain interference when using larger sprocket gears on my road bike, no way to adjust the kickstand angle any further downward, if needed, when not deployed. Otherwise, excellent product.",
      "rating": 4.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 14,
      "publication_date": 20171118
    },
    {
      "title": "Outstanding quality. However, only problem was that on ...",
      "text": "Outstanding quality. However, only problem was that on my bike (Salsa Marrakesh) When folding the kickstand it would come in contact with my chain. I did contact seller and they immediately responded and have since sent me out a single side lumintrail kick stand.",
      "rating": 4.0,
      "verified": true,
      "author": "Vincent Aleck",
      "helpful_votes": 11,
      "publication_date": 20170112
    },
    {
      "title": "EXCELLENT!!",
      "text": "My bike has many added accessories, making the bike heavy. With a regular kickstand it kept falling over. The double kickstand solved the problem. I love it and wish I'd known about it before my bike got beat up by the concrete.",
      "rating": 5.0,
      "verified": true,
      "author": "William P. Cooke",
      "helpful_votes": 28,
      "publication_date": 20170121
    },
    {
      "title": "Junk that fails quickly.",
      "text": "Stand was a bit sketchy at first, but now after about a year it's useless. The springs inside have rusted and broke so the legs do not stay in place. Even with the bolt at tight as I can get it, the stand wants to rotate and rub on my wheels. A real problem when going down hill at speed. Simply not worth it if you actually want to use it. Might be OK for a weekend bike, but not for a utility bike that sees daily use in all weather. Just don't get it wet.",
      "rating": 1.0,
      "verified": true,
      "author": "harshbarj",
      "helpful_votes": 2,
      "publication_date": 20191001
    },
    {
      "title": "Perfect for Heavy Vintage Cruisers.",
      "text": "I've a couple vintage cruisers which are major pieces of hardware. The typical kick stand on one was worthless for one of the bicycles and I bought one of these for the other bike in case I liked this kick-stand. This is super- it folds back out of the way and it is a piece of cake to just flip it down and roll the bikes back on the stand. On launch, the mechanism uses the forward motion to snap back in place, out of the way. Well designed. I'm outfitting the other two bikes we have with these stands.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Hebel",
      "helpful_votes": 6,
      "publication_date": 20170626
    },
    {
      "title": "Good commuter kickstand.",
      "text": "I use this on my main commmuter bike. It hold the bike pretty steady. If you have heavy stuff on the bike, you need to pay attention to how your front wheel is turned to keep from tipping over. It was very easy to install-- you'll want to tighten it quite a bit after the initial install-- it tends to turn out into your pedal zone. It is easy to flip down and to put back up. Has seemed pretty durable. Price was very reasonable.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Velders",
      "helpful_votes": 2,
      "publication_date": 20171126
    },
    {
      "title": "two legs are better than one",
      "text": "A two leg bike stand is much better than a one leg stand because the bike stands up straight instead of leaning to one side as it does with a one leg stand. This stand appears to be of good quality. One caution: I have two bikes, but the stand can only be mounted on one of them because the other bike has a brake cable mounted under the frame which prevents installation of the stand. This is not a complaint about this stand, but about the bike. Just something to watch out for.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W. Drues",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Works well for heavy 24\" e-bike",
      "text": "I have a 24\" mountain bike that I modified into an e-bike with a front hub motor - battery mounted on a rack in the back. This makes the bike quite heavy... I have tried multiple kick stands and this one has been the only one that satisfactorily has done the job. The adjustable legs click securely to fit a variety of bike sizes... I have mine set so the front wheel is just barely off the ground. The adjustable part is plastic, but seems to be very strong. I have been using this kickstand daily for several months now and have had no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Wagner",
      "helpful_votes": 2,
      "publication_date": 20180320
    },
    {
      "title": "... a present for my husband for Christmas and he loved it so much he said he wondered how he ...",
      "text": "I got this as a present for my husband for Christmas and he loved it so much he said he wondered how he got along without it before I gave it to him. Great price too, Buyer be aware it said it would fit bikes from 24-29 inches, my hubby's bike tires are 29\" but the frame is a small, which means it is lower to the ground so the kick stand after install makes the front tire lift off the ground. It is adjustable but you can only go so short. Measure from the ground to where your kick stand attaches to the bike before ordering.",
      "rating": 4.0,
      "verified": true,
      "author": "Pattie",
      "helpful_votes": 2,
      "publication_date": 20180110
    },
    {
      "title": "It is a product that works",
      "text": "I have gone though 2 kick stands and this one works great. I ride my bike every day to the creek near me. I stop often to feed the ducks and goose. I also feed the feral cats, so having to stop often makes it difficult for a standard kick stand to last very long. So far this one works great. My bicycle does not fall over like it use to.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "If you pull a trailer, you need something like this!",
      "text": "I have a standard-size street bike, and I was surprised that this kickstand is apparently meant for larger bikes — at its shortest setting, it lifts the front wheel 2-3 inches off the ground. So it isn't quite as stable as I had hoped. Otherwise, though, it's fine. I can park my bike upright without having to lean it against anything, which makes hooking up a trailer much easier. And when I pull away with the trailer, it doesn't bang into the wall or post I leant the bike against, because I didn't have to lean the bike against anything. And when I detach the trailer, I don't have to quick grab the bike before it falls.",
      "rating": 4.0,
      "verified": true,
      "author": "Clifford Story",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Lumintrail Center Mount Double Leg Bicycle",
      "text": "I very much like the stand. It's easy to deploy and retract and seems very stable. I did have a problem installing the kickstand because of lack of clearance between my frame and the mounting hex screw. I found that I needed a stubby hex (allen) wrench to tightly fasten the stand to my bike. A stubby wrench could easily and cheaply be included in the package. Also my bike chain just barely drags on the kickstand while riding and it would be very helpful if the manufacturer included the ability to adjust the retract position or provide a shim(s) to correct the problem. If not for these issues I would give this product 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "emembe",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Nice.",
      "text": "A side kick could be more stable in the wind, and especially on a slope, but the center stand has 2 major points of convenience: It doesn't get in the way of the crank arms - perfect for cleaning and lubing the chain. It can stand with only one tire. It also looks cool I had to remove it from one bike due to the incompatibility of the mounting flange on the bike. It can loosen up if knocked, it might rub on the tire, but a tap puts it back and you keep riding.",
      "rating": 4.0,
      "verified": true,
      "author": "steve thonus",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Researched before ordering, big fail unfortunately.",
      "text": "Researched measurements but ultimately was not compatible despite some reviews mentioning touring bikes working with this stand. The install could have been easier as the rotation required for a good fit was tedious, and the metal itself didn't seem to be treated for the adapter either. Marred paint on my touring bike as a result. Wanted something more robust than the Topeak portable stand but this did not work out at all. Need to figure out how who to hire for fixing the damage to the paint now. Honestly hope this item is delisted from amazon to save others from an unpleasant experience.",
      "rating": 1.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Quality kick-stand...if it fits your bike.",
      "text": "I ordered this kickstand for my 650B city bike. While the build quality appeared excellent (especially given the cost) the unit unfortunately did not work with my bike as the crank-side leg of the stand pressed up against the chain. If the leg doesn't touch your chain, I believe this would work very well. I had to order a dual leg kick-stand where both legs would fold to the left side of my bike; while the attachment did not appear to be of the same quality at that of the Lumintrail, it at least works with my bike.",
      "rating": 5.0,
      "verified": true,
      "author": "tjsalter",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "It's good, But...",
      "text": "My only problem with this is the angel that it folds up to. When folded its at 120dg. This puts the feet close to the ground. If you lean sharply in a turn the feet can make contact with the ground. Possibly leading to a crash. When folded it should be at 90dg.",
      "rating": 3.0,
      "verified": true,
      "author": "DavidW",
      "helpful_votes": 4,
      "publication_date": 20170521
    },
    {
      "title": "Super stand",
      "text": "This adjustable center stand is excellent. Just what I require for my motorized bike. One suggestion; be sure there is no paint build up around the bottom of the inner (stationary) legs. Because of excessive paint I had one heck of a job getting the adjustable legs to move at all. Had to hammer on them to get them free.",
      "rating": 5.0,
      "verified": true,
      "author": "Gilbert Heath",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Fit and function",
      "text": "My bike is a 20 year old Schwinn 26 inch \"mountain\" bike that I use around town and to get groceries (wire pannier baskets). It has 21 speeds and one of those large cogs on the freewheel for super low gearing. When I load up about 40 lbs of stuff, the side kickstand is less than useless and even leaning the bike against something is doubtful. I wanted a center stand to keep the bike upright while I load and unload, and this works very well. Also, it stays out of the way when I'm riding. Nice job, Lumintrail.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Wilhelm",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Chain clearance issues on some bikes; remedied with spacers. Otherwise, good stand.",
      "text": "Appears sturdy. Holds my 80cc cruiser bicycle up just fine. This WILL need a spacer or some adjustment on some bikes running multi speeds due to the chain hitting the right leg of the stand when it's folded up. I ended up using two 1.5\" wide spacers stacked underneath the mounting bolt to space the stand down enough to clear the chain. Other than that, it works as designed with no clearance issues. Makes removing the rear wheel and other maintenance much easier too. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "All That Jazz",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Keeps an older bike stable when parked.",
      "text": "This was a gift for my son - we restored his boyhood mountain bike and he uses it to tote his 1-year-old baby around in a child seat. We needed a stable way of holding the bike upright - not titled - just because of the weight of the child and the baby seat. A safety issue, basically. Stand works as advertised; was super easy to install; is adjustable without needing a hacksaw to cut legs to length (though, once done, that would be the most stable option of all). A bonus is the nice retro look; reminds me of center stands on motorcycles.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby County",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Keeps my bike standing up.",
      "text": "I have attached a Bob bike trailer to my bike and need a very sturdy stable kick stand. After reading many reviews this was the kick stand I thought would do the job. I am happy with my choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Drakester",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "What a Stand Up Deal !",
      "text": "Got this for my wife's bike. Her original kickstand was a bit too short making her bike wobbly. Then she added a carryall wire basket to the handle bars and it kept falling over from the extra weight. Ordered this center stand and it works perfectly. Easy install and easy adjust and very sturdy for normal pedal bicycle use. Problem solved with the added bonus of bike now taking up less space. Happy Wife, Happy Life! Will be ordering one for my bike.",
      "rating": 5.0,
      "verified": true,
      "author": "JPW",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Not recommended",
      "text": "Feet distance is too narrow and can't properly adjust. My bike needs a height point between adjustmemt slots. To complicate matters, you can't balance or adjust for uneven surfaces while in use. Doesn't work at all for balanced panier loads. Bike precariously stands and always topples on any slight breeze, bump or tap. Not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "Zappy",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Trash",
      "text": "This kickstand while sturdy while extended is complete garbage when you kick it up cause it grinds the chain & you cant ride with it. So I use it backwards but it's still crap cause it gets caught on every bump & I have to reset the legs to the shortest setting in order to ride. It's such a freaking hassle & my dumb self tossed my old kickstand or this thing would have been sent straight back. 100% do not reccomend.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel Manfred",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Outstanding double leg bicycle stand!!",
      "text": "Received both of these on schedule and they arrived in excellent condition. No \"freight damage\". They are very well constructed - strong yet light while easily adjustable and a very good finish - deeply powder coated. All in all they too are very easy to mount - takes no more than a few minutes. I would strongly recommend these to everyone!! It's really nice to have your bike stand straight and tall instead of dangerously leaning to the left, literally!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Davis",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "This stand is TOO HEAVY for an electric bicycle...!!! may work for a small motorcycle...!!!",
      "text": "This stand is TOO HEAVY for an electric bicycle...!!! it may work for a small motorcycle...!!! my E-bike felt extremely heavy with this stand on, I took it off and I am enjoying my E-bike again. This product should be made out of aluminum, not iron. Check the product's weight before you buy....",
      "rating": 1.0,
      "verified": true,
      "author": "Raf",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Works like a champ",
      "text": "I purchased one of these just to see if it really worked. I was building a motorized bike and needed a center stand to work on the bike with. This stand worked out so well I have purchased 2 more for my mountain bike and my daily rider. You cannot sit on the bike as with a motorcycle but they hold the weight of the bike quite well.",
      "rating": 5.0,
      "verified": true,
      "author": "david chadwick",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "No more falling bike",
      "text": "Heavy duty and well made with great design. I found it easy to install and using it is a breeze once adjusted. I was a bit worried about stability at first, but once I adjusted the legs the bike stayed where I put it. Excellent product and highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Roland W Edwards",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Do Not Recommend",
      "text": "Stay way from it. Very rudimentary made. Needs to be very tight to the bike to the point that will marred your bike forever. One legs was lose and the other extremely tight. Very hard to level both. After 5 days of use, one of the release knobs (to adjust the leg level) popped off without warning and my bike fell down and got scratched. Returned it immediately. Will not recommend it!",
      "rating": 2.0,
      "verified": true,
      "author": "Rey de Reyes",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Just Doesn't work",
      "text": "I bought two of these products for my wife's and daughter's bikes. I installed one only on my wife's bike. It was easy to install, but after using the bike, the Kickstand got loose. I adjusted, but it got loose again and again, so I got tired and removed it. Now I have two bike Kickstands that I want to return and get my money back. I don't recommend this product. It is so bulky, and not practical at all. Please send me a return label for the kickstands.",
      "rating": 1.0,
      "verified": true,
      "author": "Marcelo Hevia",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Great stand strong with good looks and a great price",
      "text": "Just installed this stand and have to say not very easy to get done given the place you have to install it however all kick stands that install this way are a little difficult. However this stand is very high quality strong works smoothly and looks good.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Badders",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "It's a good product...",
      "text": "This kickstand is easy to install... Just torque it down well... If it's loose slightly it can cause issues especially with riding friction... Also if it's not on tight you won't hear the click it needs to make to keep it in the locked position when up and close to your chain...It holds the weight of my heavy commuter bike fully loaded... One-wheel will be in the air an inch when in down position...It makes cycling life much easier; push click and go...",
      "rating": 4.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "It works well and seems sturdy enough. I would like it better if it ...",
      "text": "It works well and seems sturdy enough. I would like it better if it had a wider stance for more stability as I'm using it on an ebike which is quite heavy but I'm sure it will be fine for most bikes. It was easy to install and does not interfere with the chain.",
      "rating": 4.0,
      "verified": true,
      "author": "LA",
      "helpful_votes": 3,
      "publication_date": 20170207
    },
    {
      "title": "Good center Mount.",
      "text": "This is the kick stand i was looking for, i got the side basket and it always didn't stand by it self because it wasn't balance with this kick stand it stays sturdy thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "customer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Tight spot",
      "text": "Not all bicycle is the same; I mount the stand on on old Mountain bike, Montague, collapsible. I have to shorten the allen wrench to fit the space available It was a challenge; I didn't want to take apart the gear changer Will update with pics",
      "rating": 3.0,
      "verified": true,
      "author": "Thanh Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Having a kickstand operable from both sides of the bike is awesome!",
      "text": "This kickstand fit my Schwinn hybrid (700c) perfectly. The only downside is that I wish that the legs were a little further apart. It currently holds my bike upright but the slightest bump will topple it over. I guess that the feet are close to each other is so that they don’t extend too far out when uptight. I still would buy it again if needed. Having a kickstand operable from both sides of the bike is awesome!",
      "rating": 4.0,
      "verified": true,
      "author": "IM",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Faulty Leg Mechanism - Beware",
      "text": "This product has been pretty disappointing. This is has only been the third time i’ve taken my bike out for a ride with this lumintrail and one of the legs was already. I should have known that it would have been lost and mailed it back as defective because the knob that locks it in had trouble clicking in and out. PRoduct appears to not be that good.",
      "rating": 2.0,
      "verified": true,
      "author": "H. Kuo",
      "helpful_votes": 2,
      "publication_date": 20171031
    },
    {
      "title": "Nice unit for hybrid bikes",
      "text": "This unit is well designed and manufactured for hybrid bikes. For a mountain bike it tends to be the lowest item on the bike thus the limiting factor in clearance. It is too fragile to use on e-bikes however. I put them on 2 ebikes and both failed. One broke in half and other failed when the small metal clip holding the adjustable foot failed.",
      "rating": 1.0,
      "verified": true,
      "author": "cyber.snow",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Just wanted to say that it's holding up very well ...",
      "text": "Just wanted to say that it's holding up very well for what it has to do. Which is a full sized mans bike with some rediculasly heavy mag wheels(heavy pot metal cast) & saddlebags with tools & groceries & usually 1/2 -1gal. Of gas. Not weekly, but dailey. And it surprises the hell out of me. I'm going to get a spare + 1 for my new upcoming bike build. Thanx guys, Dale B.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale B.",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Great Service and Product",
      "text": "Stand is solid and fits my Trek 7.2 FX (51cm) perfectly on the shortest setting. No issues with ground clearance upright or in a turn. The spring is very strong, so beware of where your toes are when deploying or retracting it. Installing is straight forward, but had to disconnect the front derailer to get my tools to fit. Seller service was outstanding! FedEx has some issue with delivering to my downtown apartment, so dealer tracked it down, got it to me, and kept in contact.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip D. Mann",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "... july 16 so i only had approximately a month poor quality.",
      "text": "This product works at first but continuous use the legs snapped off on me i dont know if it was the weight i was putting on it or that it wore down overtime i ordered it on july 16 so i only had approximately a month poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Roberto S.",
      "helpful_votes": 7,
      "publication_date": 20170822
    },
    {
      "title": "Perfect, solid solution.",
      "text": "I love how easy the kickstand is to use and how sturdy my bike is wherever I stand it up. It is the perfect solution to my lack of any kickstand and much better than the single stand. My bike can be placed anywhere when stored and it transports very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Shopper",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Retro Revival",
      "text": "The install was completely straightforward on a 1968 Jeunet. I did add a shim so the right arm could clear the chain when stowed. I appreciate the built-in height adjustment. This makes the stand something that could be transferred to other bikes in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter L. Mattei",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Much better than a single leg kick stand.",
      "text": "I was skeptical but decided to give it a try. It was very easy to install. The bicycle is secure and does not tip. I can easily disengage the stand when mounting the bicycle. Does not interfere with the bicycle chain or pedals.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe S",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Absolutely not recommending it",
      "text": "I got two of these based on the reviews. It only fit one of the two diamondback bikes we have and that too kept rubbing against the tire and frames, chain, ... And my bikes were just regular bikes nothing fancy.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Bhan",
      "helpful_votes": 3,
      "publication_date": 20170822
    },
    {
      "title": "Not Stable",
      "text": "The slightest breeze and the bike falls over. You look at it wrong, the bike falls over. if the ground is not 100% level the bike falls over. The base is not nearly wide enough. The adjustable buttons are not strong enough, there is no real feed back to know how many clicks down you are to get both sides level.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert W Jacobsen",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Good Value",
      "text": "I use a dog trailer and this was a essential part of keeping the bike up right while loading dog. Once I used it for that I realized how practical it is to have a stable well built bike stand. You rock !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Easy to install",
      "text": "I bought this kickstand for my bike after I attached a Thule Baby Carrier to my bike. Wanted it to be more stable when I'm getting everything ready for the little guy to ride. It didn't come with directions, but installation is pretty intuitive. I had it connected to my bike in about a minute. When folded, it clears my bike's chain by about a third of an inch. On level ground, it rests the bike forward, so most of the weight is on the front wheel. Seems like it's made out of sturdy material and should hold up. It's adjustable, but I have it on the lowest level.",
      "rating": 4.0,
      "verified": true,
      "author": "AG",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Here I stand",
      "text": "Nice idea, but the implementation feels a little flimsy. Also, I had to wedge a piece of brass in the works to keep it from closing on the chain. If you're gonna redesign the thing, why not put 1/2 and 1/4 stops to adjust the \"up\" position too? Seems to hold up my motorized bike nicely.",
      "rating": 4.0,
      "verified": true,
      "author": "Tedward",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Screw always get loosen, don't stay tightened.",
      "text": "Cannot get the kick stand tightened no matter how hard I tightened the screw, it will eventually rotate loose when flipping the stand up and down. Seems poorly designed.",
      "rating": 1.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 4,
      "publication_date": 20171009
    },
    {
      "title": "Great stand, bad bolt for clamping the stand down",
      "text": "Great, solid mount. My only bitch is they put an Allen wrenth bolt for clamping stand down and when I used the Allen wrench they included, it stripped out the bolt hole, so now I have to go to the hard store and get a regular bolt",
      "rating": 4.0,
      "verified": true,
      "author": "Donnaray ",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "horrible!",
      "text": "where I have to adjust the legs so that the bike will stand up on its own on the kick stand puts the legs so low that they drag when I try to make the slightest turn. Useless.",
      "rating": 1.0,
      "verified": true,
      "author": "r570sv",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Easy for leftys!",
      "text": "Works great for lefty person to mount & dismount... Hybrid 700cc bike size lg. Awsome. Thank you...Screw install is difficult because shift cable obstructs, but worth it...",
      "rating": 5.0,
      "verified": true,
      "author": "Victor M",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Tip if it hits chain",
      "text": "So this works great. It would just slightly touch my chain while up and in top gear. What I did was get a rubber and metal washer and use it below the frame part to extend it a little bit lower. Works like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "B-Wise",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "It's decent...",
      "text": "My issue with this kickstand is that it wobbles when folded up. Nothing is loose, there is just play in the actual kickstand. It has an annoying rattle when riding.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Keeps My Heavy E-Bike Centered, Upright, and Stable.",
      "text": "It easy to install, doesn't come loose, kicks up out of the way easily. What I like best is that it keeps my E-Bike upright and centered. My battery weighs 20 lbs (9kg) and the front motor adds some weight, too. A standard kick-stand leaves the weight off-center and unstable. This is a lot more solid, and it looks nice, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan H.",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Elevate Good Times. It's adjustable!!",
      "text": "Well I like that it can hold up to 100 pounds. I guess I didn't read the description good enough cuz I was surprised when it was plastic but so far I love it it's adjustable it was totally easy to put in but this is only day three I would definitely recommend it I'm using it on a bike with a motor",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Likes go rideing",
      "text": "Awesome product was a pain installing omce instaled workeds like a charm. The thing that I love about this product is that have 2 support s instead of 1",
      "rating": 5.0,
      "verified": true,
      "author": "shaun wagler",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "distance between legs when retracted and chain to avoid scraping.",
      "text": "Easy to mount and operate. The neck should be just a bit longer to accommodate the passage of the chain when in high gear in a multi-speed bike. I added some washers and it solved the problem. Otherwise great!",
      "rating": 4.0,
      "verified": true,
      "author": "Luis Jimenez",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Best Center Stand Quick Adjustable Legs For Many Different Bikes.",
      "text": "GREAT CENTER STAND HOLDS ME WHEN STARTING MOTORIZED BICYCLE. Extremely rugged stand needs to be for the way I use it. Thanks Lumintrail Nice Stand!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Airgun Junky",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "If you are looking for a double leg stand , this is not it!",
      "text": "I have purchased 2 of these kickstands both of which lost the legs or wouldn't stay locked in to the right height. They stop locking in the height notches after a month or 2 months and then your riding along and next thing you know you have lost a leg and eventually the other as well. has happened with both now. This product was a double leg disaster",
      "rating": 1.0,
      "verified": true,
      "author": "R.A.W.",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Installed easy and tight with a 6 mm. allen wrench.",
      "text": "center stand installed easy as it could be with a 6 mm. Allen wrench the only issue I had I did not think about that I had the fat tire type bike. I don't know if there is a different stand for that. but easy fix I installed a radiator hose clamp on the pilot base preventing it to raise all the way up. with very little adjustment I was able to make it stop about 11 mm. 7/16 in. from tire been too cold and rainy where I am to test it but it appears to be great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Nub hub rub",
      "text": "Meh. The nubs on the extendable part (i.e. the black part) stick out too much. If i’ve got them adjusted for the optimal front wheel height while parked, the pedals on my bike rub the nubs.",
      "rating": 2.0,
      "verified": true,
      "author": "BDMJ",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Beach cruiser kickstand",
      "text": "Received today on the 6th day. Seems very sturdy, very good, and easy to put on. Good thick metal across the whole thing. Would recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Perfect replacement for stock kickstand.",
      "text": "Works great. The stock kickstand wasn't cutting it with the motor on the bike. This double leg kickstand was a breeze to install and works better than is have hoped.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Not for daily riders or heavy bikes.",
      "text": "Well super easy to install however it has failed and become loose. The inside thread have become destroyed from repeated fighting and the abuse of being used daily. Also the adjustable legs are plastic and can sometimes re-adjust themselves which was annoying. I have a Giant 29er bike. I’m 6’3 205lb. It’s dead and now I’ll have to a get a heavy duty metal kick stand.",
      "rating": 1.0,
      "verified": true,
      "author": "Jordan B.",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "IF YOU HAVE A MOTORIZED BIKE ITS... ...",
      "text": "IF YOU HAVE A MOTORIZED BIKE ITS A NECESSITY ... PURCHASE IT ... I CAN WORK ON MY BIKE AND CHANGE WHEELS WITHOUT ANYONE'S HELP.. REAR WHEEL OR FRONT WHEEL OFF THE GROUND AT LEAST 3 INCHES... THATS ENOUGH ROOM TO DO ANYTHING",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl Caldwell",
      "helpful_votes": 2,
      "publication_date": 20171010
    },
    {
      "title": "its a great stand.",
      "text": "Being s lower cost mount, I had difficulty attaching therefore I had to drill directly into my bike frame in order to attach instead of being able to use bracket. Once installed, its a great stand.",
      "rating": 3.0,
      "verified": true,
      "author": "Angela R.",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Love it",
      "text": "I put this on my bike after I installed a motor on it. The old one was too weak to hold the bike and the motor. This is great. I love that I can adjust the height so I can raise it up high enough to remove the back tire.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Tudor",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Bike chain hits kick stand when going over rough terrain",
      "text": "Good, solid, study kickstand. Was easy to adjust the height. Installed on a brand new REI co-Op DRT 1.1 hardtail bicycle l bought for our 13 yr old son. Within a few minutes of him taking it to the dirt trails, he came back and told me to take it off, saying that the chain hits the stand when going over rough terrain. Would not recommend it for hardtail bikes. It sits too close to the chain.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Legs scrape the ground when turning",
      "text": "Terrible flaw: it doesn't fold up high enough when not in use. When you turn, the legs will scrape the ground. I will be returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Koz",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Very nice.",
      "text": "This stand is an exquisite addition to my bike. It just looks cool. The bike is so much more stable on this stand. The vendor is a quick shipper and packaged my purchase very well. The stand arrived in flawless condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Not for small frame bikes",
      "text": "It's a good solid product just didn't fit my small frame Cannondale MTN bike. If you have a small frame bicycle forget about it.",
      "rating": 2.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "wow this thing is SO freakin heavy",
      "text": "So heavy. We built, but man this is just silly. I'm no weight weenie, but this things just too heavy. Suitable for a motorcycle? yes. A bicycle? on a loaded cargo bike maybe.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew Gwinn",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Worked with my front ebike wheel which is heavy and ...",
      "text": "Worked with my front ebike wheel which is heavy and big battery over rear tire, I don't have to lay bike down or lean against fence anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Not Reliable",
      "text": "Two days ago, this kickstand fell off my bike. The mounting screw often came loose and I always had to tighten it. That day, I had tighten before leaving on my ride. The road I was on was a little bumpy, I heard a loud clack and pulled over to inspect what the noise was. I saw the kickstand had fallen off. Lucky it did not damage my bike or injure me when it fell off.",
      "rating": 1.0,
      "verified": true,
      "author": "dan banh",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Works",
      "text": "It is strong holds bike up, easy working kickstand. But lower leg extension falls out of upper structure, hard to set at last clip stop.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter B.",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Don't!",
      "text": "Plastic, junk, save you money . Got one from Walmart after this broke the first day. Less money better product",
      "rating": 1.0,
      "verified": true,
      "author": "mgd675",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Tight on the tire but it works",
      "text": "On a Specialized women's bike with 29\" tire. Had to get creative with a cut off Allen wrench and a 1/4\" open wrench to get it tight, but overall it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "D Hill",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "easy too install",
      "text": "The stand was easy to install, sturdy, and stable. However it did not fit the bike I intended to install it on. It mounted fine, but the chain rubbed and the rear tire rubbed when raised to pedal.",
      "rating": 2.0,
      "verified": true,
      "author": "john w",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Never stays level..!!",
      "text": "This damn thing is good - BUT ALWAYS, on EVERY TRIP, one side or the other slips & I'm continually adjusting it. Pain in the BUTT - maybe it's just this odd one..idk. It's also not ideally stable as I have it on my cruiser/shopper with baskets up the yin yang..I could use a wider one.",
      "rating": 3.0,
      "verified": true,
      "author": "UK-Laird",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "This kick-stand works great and I don't have to worry about the bike ...",
      "text": "I have a heavy-ish electric assist bike, and I routinely carry my four-year old in her bike seat that sits above the rear fender. This kick-stand works great and I don't have to worry about the bike tipping over when I'm loading the kid.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Wallace",
      "helpful_votes": 3,
      "publication_date": 20170424
    },
    {
      "title": "it was great until it snapped",
      "text": "I bought this for my ebike, and i really liked it until the legs snapped off on a recent camping trip",
      "rating": 3.0,
      "verified": true,
      "author": "Raptor",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Did not work as advertised.",
      "text": "Very disappointing. I could not tighten it enough to keep it from rotating out of position. When I tried to remove it, the nut froze, and I had to spend a couple of hours drilling it out. I go the local bike shop to put a regular kickstand on - much better.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Duhon",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "My item did not last!!!",
      "text": "I bought this item last June 2017, today, July 4,2018 got broken while I was standing my bike in the park. I hoe this new one I just bought last more time. It was great item because holds the bike in a steady manner. I really like it. As I said, I hope last more time.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos M. Bastidas",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Love this stand",
      "text": "Love this stand. It was my only option because my bike has no horizontal bar to the back wheel. It is very stable and easy. It is a little low when it is up on my bike, and I do get an occasional scrape when I lean into a turn. But, overall it is a much better stand than the one that came with the bike....",
      "rating": 5.0,
      "verified": true,
      "author": "jsedetroit",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "A great kickstand for ebike",
      "text": "This is the 3rd kickstand I have purchased and finally it works perfectly. I have converted my bike to a ebike and with the big battery it has gained a lot of weight which would bend the other kickstands or would rub the tire. This is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradey",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Really Useful Bicycle Product!",
      "text": "This centerstand is absolutely one of those useful touches, that go into giving your motorized bicycle a motorcycle look. Extremely useful for performing maintenance on your bike. Get one for your current or next ride! You’ll enjoy it!!",
      "rating": 5.0,
      "verified": true,
      "author": "TheDixieDXer",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "not very sturdy at all",
      "text": "very unstable it's like the bikes going to fall over if you touch it I thought it would be more sturdy and it broke few months after I got it the button fell off now they're completely useless without that button adjust the height of it",
      "rating": 1.0,
      "verified": true,
      "author": "P.Rican",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Worked on my beach cruiser, end of story.",
      "text": "I changed from the old style kick stand, and I will never go back, I like what I got.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse David",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "You will wonder how did you live without it after you have installed.",
      "text": "It's great. You will wonder how did you live without it after you have installed. It will make more space for your garage.",
      "rating": 5.0,
      "verified": true,
      "author": "M. N. H",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great unit but does not fit fat 4in tires with out a little modification",
      "text": "Very well built.The problem it does not fit a bike that has fat 4\" in tires. I had to mod mine to make work.If the factory would spread the feet just 1\" in more it would have fit perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "I do like this but it really needs to come with shims",
      "text": "I do like this but it really needs to come with shims. I found myself having to shim it to make it work with my older mountain bike. Other than that, its good, it would be great wtih shims and a lock washer.",
      "rating": 4.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "It's time to \" take a stand.\"",
      "text": "Very happy with this kickstand. It mounted easily and holds my motorized bicycle up with no problem at all. I highly recommend this item. A plus for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Delong",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Didn't fit",
      "text": "Unfortunately it did not fit my mountain bike the kick stand makes contact with the chain. If I return it I have to pay $6.08 in shipping. So I'm stuck with it. Unless I can find someone to buy it off me.",
      "rating": 5.0,
      "verified": true,
      "author": "leobardo m trujillo",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Adjustable dual leg kickstand",
      "text": "Great dual leg kickstand. Many adjustment options. Looks and works great on my old school cruiser bike.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr.Soul5280",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Three Stars",
      "text": "good and strong construction but did not fit my Diamondback Hybrid Bike.",
      "rating": 3.0,
      "verified": true,
      "author": "Razz",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "No workey on tandem",
      "text": "Will not fit a tandem bike without running the chain no matter how it is installed. Had to return but looks very well made. Wished it would have fit our tandem",
      "rating": 3.0,
      "verified": true,
      "author": "TNHunter",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Awesome Bike kickstand!",
      "text": "This is what I was looking for in a motorized bike center kickstand! For me it’s been working out well...",
      "rating": 5.0,
      "verified": true,
      "author": "Michael P.",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "To always check the lockers that lock in your height adjustment",
      "text": "I'll give the same 5 stars but but the height adjustments for different heights on the kickstand they don't lock you in very well and they can come swooping down and cause you a problem other than that it's good it's a good product",
      "rating": 4.0,
      "verified": true,
      "author": "Rowdy",
      "helpful_votes": 0,
      "publication_date": 20180625
    }
  ],
  "product_meta": {
    "title": "Lumintrail Center Mount Bike Kickstand Double Leg Bicycle Stand Adjustable Height, Foldable for 24”-28” Bikes",
    "rating": 4.1,
    "feature_bullets": [
      "ADJUSTABLE - Quick and easy push button latch design for adjusting the length of the kickstand allowing for on the go adaptability without the need for tools",
      "DOUBLE LEG CENTER STAND - Conveniently holds the bike upright instead of to the side making it perfect for repairs, includes an adapter for bikes without center mount",
      "FITS MOST 24”-28” BIKE TIRES - Perfect for Hybrid, Commuter and Cruiser Bikes; Not recommended for Road Bikes, Mountain Bikes, E Bikes or bikes with wide tires",
      "KICKSTAND HEIGHT: Fully extended the kickstand leg height is 10\" with the feet width of 9” Note bikes should have ground clearance of approximately 11.5” to 13”",
      "QUALITY & NON-SLIP SOLE - Made of strong and durable Aluminum Alloy, Wide reinforced plastic foot with Non-slip sole to prevents slipping on wet surfaces or sinking in mud"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Item model number": "BS-517-02",
      "Date First Available": "July 28, 2017",
      "Manufacturer": "Lumintrail",
      "ASIN": "B074CHPT5J",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Car Racks, Transportation & Storage",
      "Indoor Bike Storage",
      "Cycling"
    ],
    "price": 29.99
  }
}