{
  "website_summaries": [
    {
      "verdict": "A superior mat that gives you lots of putting practice options.",
      "pros": [
        "Special artificial surface ensures you can practice without scratching your putter",
        "Mat is 9 by 3 feet to provide ample space",
        "Offers a wonderful choice for both left- and right-handed golfers",
        "Includes 3 holes to help you build your putting skills",
        "More affordable than many comparable mats"
      ],
      "cons": [
        "Foam under the cups may tear over time",
        "Bump on the mat's incline can be difficult to eliminate"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Did Not Last",
      "text": "We bought this for our office where a few coworkers gather late Friday putt off. My first impression was great but the foam and grass layer came apart within 2 months. This was supposed to upgrade our previous green and we ended up taking the old one back out. I am very disappointed in this product. Lastly, even if it lasted, it came with a crease from corner to corner right before the ramp for the holes. This threw off the accuracy and experience.",
      "rating": 1.0,
      "verified": true,
      "author": "KFern",
      "helpful_votes": 7,
      "publication_date": 20181015
    },
    {
      "title": "Great Product and even Great Customer Service!",
      "text": "Ordered this putting mat for my husband for his birthday in October. When he opened he loved but I noticed that the backing on the holes were ripped. I did email about but sometime later I received an email from Shaun stating that some of these were damaged and would be replaced. He kept in contact as to the progress of this and in February my husband received the new one which was much improved. Shaun even called to make sure we received it and that all was okay. I honestly have never seen such great care and interest taken from any company. Thanks..glad I purchased this putting mat for my hubbie.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy McDonough",
      "helpful_votes": 12,
      "publication_date": 20170222
    },
    {
      "title": "Good product, fantastic value",
      "text": "This is about as good as I could expect for the low price relative to other options. It’s not very heavy especially at the end furthest from the holes, so you really need to place it on a hard floor or tight low cut carpet. If you place on carpet with any kind of thickness the roll quality is greatly diminished. I’m happy with my purchase, just don’t assume you’re getting something comparable to the putting mats out there that run into the hundreds of dollars. Solid product at a fantastic price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jared M. Gingerich",
      "helpful_votes": 3,
      "publication_date": 20200117
    },
    {
      "title": "Flawed Design Hit or Miss",
      "text": "I wanted to love this putting mat, but as a few have said, there is a crease that won’t go away! Not sure if it has to do with how it was packaged, but it’s been multiple weeks and the bump just won’t flatten. It affects my puts on the left side, and I’m forced to just use the single right cup to get a smooth roll. Would love it if I can utilize all 3!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ray ",
      "helpful_votes": 3,
      "publication_date": 20180731
    },
    {
      "title": "Wonderful and realistic putting mat",
      "text": "This was a gift for my 25 yr old golfing son and his reaction after putting on it was, \"this is legit \". This is an awesome made putting green and is perfect! Only positive comments for this! Thanks!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 9,
      "publication_date": 20161225
    },
    {
      "title": "Speed bump on the putting green and 18 months later, putting green is falling apart",
      "text": "I bought this putting green for my daughter to practice her putting on, but have been unsuccessful in smoothing out the “speed bump” before the incline. I have tried placing the putting green on cardboard and on a title floor. Nothing seems to be able to smooth out the “speed bump.” UPDATE: After 18 months, the putting greens is now falling apart. The foam is comping apart from the astro turf on the edges. Very disappointed with the craftsmanship and quality of the putting green.",
      "rating": 1.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 2,
      "publication_date": 20180506
    },
    {
      "title": "Excellent Seller and Excellent Customer Service",
      "text": "Love the putting green and so does my family. We initially received one that maybe had some shipping damages and wouldn’t set flat. We wrote the seller and within 2 days we had a replacement arrive and it works perfectly and is set completely flat with all putts moving true across the green. I highly recommend this seller and this practice green above all others. You won’t be disappointed. Thanks Sean Webb and Co. and thanks Karen!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191126
    },
    {
      "title": "Perfect For My Mancave",
      "text": "I struggle with going with my instinct for aligning the putter head to the putt line. This aid has been terrific in helping me gain confidence in aligning the club correctly and not second guessing myself. Then, the 8 minute instructional video a great help in reviewing putting fundamentals--grip, stance, tempo, and practice. Everyday I can spend a few quality minutes working on this important aspect of the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Depends on your ups bois",
      "text": "My mat came with minimal creases but the foam was super pressed, after about three weeks at the office it doesn’t seem to want to inflate to full and leaves a weird ridge to my right hole (very much due to poor package handling) so I have an awkward run to the right if it’s going true. I have been able to use it more or less like a slope but kind of bugged me from the start. Otherwise I’d love to give it more stars. Just sucks it depends on shipment so much",
      "rating": 1.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "It’s got a hump",
      "text": "There is a pronounced bump where the foam underneath starts. I’ve had a heavy rug over it for last few days but hump still persists. It is prolly a good quarter inch high. Other than that I love it. Shaun, hope you see this as I would really like a flat one.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer Brian S",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Not worth the money over the competition",
      "text": "I have let this sit flat for several days and the bump still won’t come out. Very disappointed. I purchased this item because the video of Shaun comparing this one to the competition. The materials, quality etc were supposed to be justifiable for the more than double the competition price tag. Unfortunately that’s not what I received. This is virtually useless out of the box. Not to mention when I did open the box it looked like I was sent someone else’s return. This one had clearly been opened before. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "SuperDuke ",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great but I wish there were a way to add slope for better putting practice",
      "text": "This is a good product and I give it 5 stars for what it is intended to do. I wish there were a way to add slope to practice more difficult putts",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Great putting mat",
      "text": "I received the putting mat a couple of weeks ago. It is a real good surface and the area of extra padding is as advertised. The putting surface is very true and like a smooth green. Overall it is very nice.... There are a few kinks though especially the seam prior at the top end of the padded surface. This seam deviates from the smooth roll. I have tried to straiten it using weights etc. but with no success. Also, customer service is not very responsive.",
      "rating": 4.0,
      "verified": true,
      "author": "Margarita",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Putting Green",
      "text": "The putting Green has improved my putting and that is why I purchased it. I do like the three option hole and the traps that catch most of the missed putts. There does seem to be a permanent ripple in the green right at the transition of the foam for the inclined green. It does not really affect the ball roll unless the ball is really slow. I've only had the Green for a few weeks, it may lay down with time, we'll see.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Absolutely love it!",
      "text": "Absolutely love it. Just don't let your kids jump all over it or it'll crease pretty badly where the incline begins. Other than that the speed is good and I love the feel of the fabric. Not sure if it'll prepare me for courses with really fast greens, but at least it's good for indoor putting.",
      "rating": 5.0,
      "verified": true,
      "author": "William C.",
      "helpful_votes": 2,
      "publication_date": 20170912
    },
    {
      "title": "easy to groove stroke",
      "text": "Rolls very smooth, easy to groove stroke...just as intended. Be aware, though, that going out onto real greens -- they will feel very bumpy in comparison. But this allows for that practice, which is crucial.",
      "rating": 5.0,
      "verified": true,
      "author": "T. LeClair",
      "helpful_votes": 2,
      "publication_date": 20180104
    },
    {
      "title": "putting mat",
      "text": "even comes with a web site to help improve putting",
      "rating": 5.0,
      "verified": true,
      "author": "Cris",
      "helpful_votes": 2,
      "publication_date": 20191108
    },
    {
      "title": "... months ago and I use it to practice putting pretty much daily in the pm in my garage",
      "text": "I bought this a few months ago and I use it to practice putting pretty much daily in the pm in my garage. The reason I did not give a 5 star is that mine did have a crease in it where it starts to angle up. The crease seems to be more visual that anything else. I have it on a level concrete pad (my garage floor) and it does roll true.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim N.",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "Easy practice at home.",
      "text": "Use it almost daily. Ever wanted to just try different putting strokes to see what suits you? This gives you that opportunity. Don’t have to go someplace with a green. Grab five minutes, give your new;stroke a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Grampajim",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "3-Stars because of crease",
      "text": "Nice mat but it has a crease that we cannot get to straighten out. Maybe in time - we are still working on it and are not able to use it until it relaxes - fingers crossed.",
      "rating": 3.0,
      "verified": true,
      "author": "ADG",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Great Putting Mat",
      "text": "High quality putting mat, well worth the extra money compared to the cheaper versions I've seen. The mat came double boxed and arrived in great condition. It rolled out flat, no issues and we have been using it now for three weeks. Very happy with the quality and we would highly recommend buying this mat for serious practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Happy dad",
      "text": "I bought this for my husband for Father’s Day and he fell in love.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelica Herrera",
      "helpful_votes": 2,
      "publication_date": 20190721
    },
    {
      "title": "Excellent quality",
      "text": "I will be using this putting mat inside during the winter for practice. I already have seen some improvement on the greens since I started using it about a month ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary McKenna",
      "helpful_votes": 2,
      "publication_date": 20180929
    },
    {
      "title": "No. No .no do not buy this...Still waiting for it to lay flat (after 7months)",
      "text": "So ive had mine about a week and im still waiting for the crease at the foam to lay down... aslo, mine was missing the 3rd cup foam.. hoping this lays out... So. I'm updating this review to 1 star. This putting mat has only made an average pet bed. It never laid down and I never received any information back as far as my complaint went. Save your money and get something else. It may be more of a an initial investment but will in the long run will make you much happier.",
      "rating": 1.0,
      "verified": true,
      "author": "creative72",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Peeling apart after s month of very limited use",
      "text": "The mat is peeling apart after a month of use in my living room on carpet. I have tried to fill out the contact form on the website for Shaun Webb but it won’t sllow me to submit my information. Cannot find another way to contact the company. Very frustrated and just want to return it and get my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristie Terpstra",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Perfect for winter when you can't get on the course",
      "text": "1st one showed up damaged but replacement was perfect! I use it everyday. Was a great birthday gift from my wife, especially for winter! Gotta keep my skills sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Cohen",
      "helpful_votes": 2,
      "publication_date": 20200102
    },
    {
      "title": "High quality mat",
      "text": "High quality mat. Enjoy the elevated cups and back protector. Shaun's video is excellent in teaching about the various aspects of putting. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugh Thompson",
      "helpful_votes": 2,
      "publication_date": 20170828
    },
    {
      "title": "Great product, Exceptional customer service",
      "text": "Studied several putting mats. Shaun's mat is a well made product, simple, clean, and most importantly has helped me gain confidence in my putting stroke. Several players in my golf league have told me repeatedly, that my putting stoke has really gotten strong. They are lower handicaps than me.... so this purchase was not only fun but effective. Thanks Shaun!",
      "rating": 5.0,
      "verified": true,
      "author": "dshoe",
      "helpful_votes": 2,
      "publication_date": 20181204
    },
    {
      "title": "and he is very happy with it",
      "text": "This was a birthday gift for my husband, and he is very happy with it. He did not want one because he felt the quality of others had been less than perfect, but this was very good. My grandson, a 6 year old future professional, also loves it and wants to use it all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Works great!",
      "text": "I bought this for my husband as a gift, and he loves it! I’m not a golfer but am finding that even I enjoy taking practice putts with it. I’ll admit I was somewhat hesitant to purchase after thoroughly reading some reviews, but I’m happy to say it arrived on time and packaged very well - no damage, and the mat rolled out perfectly with no creases. Excellent quality!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Excellent Matt!",
      "text": "The Matt stays flat with no rolls. The holes are deep so the ball can drop in. Much better quality than pervious Matt’s.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorri J Taylor",
      "helpful_votes": 2,
      "publication_date": 20191030
    },
    {
      "title": "Better than expected",
      "text": "I was looking for something to practice stroke mechanics through the winter. This little mat fits the bill. It's not an indoor putting green, but the ball rolls nicely and that's all I needed. It's basically a felt-like material, but the underside is coated with a rubber type coating that makes it more substantial and allows it to lie flat.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Meeks",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Solid Mat",
      "text": "I've been thrilled with my purchase of Shaun Webb's putting green. For daily practice to keep my form up to par, the mat works great for my individual needs. Rolls well and has been a major asset in my work to improve my putting.",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Fantastic Product",
      "text": "great quality-fun to use and love the video that you can get to on the internet-very happy with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Head Doctor",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Good for practice at home",
      "text": "Works great but can't compare to practicing on a real green.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Mo",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Highly recommend.",
      "text": "This mat is everything it is advertised to be. Allows me to effectively work on my putting drills. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "scubapilot",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Rolls out easily. Easy to put away",
      "text": "I have six guys vouching for this putting green. Rolls out easily. Easy to put away. Be sure to buy golf balls as this set does not come with any or with a putter. Once you have the green, putter and balls - you are in business.",
      "rating": 5.0,
      "verified": true,
      "author": "MLB",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "He's an awesome teacher, particularly in the short game",
      "text": "Shaun was our golf pro in Maine before moving to Louisiana. He's an awesome teacher, particularly in the short game. He was beloved at our club! His putting green is fantastic. I use it in out basement and roll it up almost every day. When I unroll it, it's always smooth and rolls true. I can't recommend this product highly enough. It's a great way to get through the New England winter while waiting for golf season.",
      "rating": 5.0,
      "verified": true,
      "author": "zsm1988",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Perfect for Putting Practice",
      "text": "Great putting mat. I was worried that the mat wouldn't be thick enough and would be affected by the surface it was put over. However, the mat is thick enough that it doesn't matter whether you put it on carpet, tile or hardwood. Rolled and smoothed out nicely right out of the box. Speed of the putting mat is perfect for most of the courses I play as well. Would definitely recommend if you're not able to get out and practice on real greens.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170606
    },
    {
      "title": "I like it!  Great Value",
      "text": "this a great matt w plenty of area to work on short to medium putts.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Shaw",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Great product and even better customer service.",
      "text": "Great product and even better customer service. Had an issue with the first one, and true to their word, they sent me a new one. No hassles. Shaun even contacted me directly to make sure I was satisfied with the new green. Green is easy to use and has a slight incline at the end of the green. This means you can parctice subtle breaks too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170909
    },
    {
      "title": "Love this for my office",
      "text": "I bought this to keep in my home office as a nice distraction from work from time to time. It's great, and much more substantial than the cheap putting courses I've had in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "J. HolstTop Contributor: Golf",
      "helpful_votes": 2,
      "publication_date": 20170705
    },
    {
      "title": "Great putting mat!",
      "text": "Did some research and figured this was the best buy for the quality. Was very impressed with the quality. Set it up both inside and outside, had a great time practicing and making up different games to play.",
      "rating": 5.0,
      "verified": true,
      "author": "Vegas Golf Girl",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Happy with putting green",
      "text": "We are happy with the Shaun Webb Golf Putting Green & Indoor Mat 9'x3'. We have it sitting in front of the TV and often putt while watching. Well-designed. Best I've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur L. Iamele",
      "helpful_votes": 2,
      "publication_date": 20180821
    },
    {
      "title": "I've bought 2",
      "text": "this is actually the second of this same purchase since I bought it for my nephew almost 2 years ago. It's great for Vegas where it is too hot to go outside for real golf to keep the kids entertained.",
      "rating": 4.0,
      "verified": true,
      "author": "SheenaQueenD",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Great Quality - Indoor Putting Green.",
      "text": "Great Quality! My kids are on their school golf team and this is a great way for them to practice putting at home!",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia A",
      "helpful_votes": 2,
      "publication_date": 20170504
    },
    {
      "title": "I love the golf putting green and indoor mat",
      "text": "I love the golf putting green and indoor mat. The order was received promptly and I was practicing in my basement with great joy in an attempt to improve my game.",
      "rating": 5.0,
      "verified": true,
      "author": "James Cameron",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Bump that never goes down",
      "text": "There’s a bump between the flats and the hill start and can’t get it flatten out no matter what. Besides that I have no complains, my father in law uses all the time and our families love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Chelsea D.",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Very well constructed. Using over carpet without any perceivable ...",
      "text": "Very well constructed. Using over carpet without any perceivable problem. Has improved my putting and more importantly, my confidence with the putter.",
      "rating": 5.0,
      "verified": true,
      "author": "refolg",
      "helpful_votes": 2,
      "publication_date": 20180126
    },
    {
      "title": "poor quality",
      "text": "I've had this item for a couple months and the folds will not release so it can lie flat and allow a true roll. Balls get pushed off line because of this defect.",
      "rating": 2.0,
      "verified": true,
      "author": "Barry Bryce",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "About the same with some extra padding",
      "text": "It wasn't as great as it sounded. Put... Put with a small incline and strait in.",
      "rating": 3.0,
      "verified": true,
      "author": "PBear",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "THE BEST MAT for indoor putting!!!",
      "text": "This is THE BEST INDOOR MAT I have ever purchased (and I've gone through an expensive few)",
      "rating": 5.0,
      "verified": true,
      "author": "Formerly Frizzy",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Super nice mat",
      "text": "I really like the mat I was able to improve my putting with it. Only mistake I made is i don't leave it out all the time so I can practice more.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Matola",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "I received my Premium Putting Mat yesterday and immediately unpacked ...",
      "text": "I received my Premium Putting Mat yesterday and immediately unpacked it to start my practice. It is very well made and will certainly help my putting game. My only complaint is the package only contained one of the three round pads to go inside the puttholes. Charles - Rialto, CA",
      "rating": 5.0,
      "verified": true,
      "author": "Charles A. Watts",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Just as described, fully satisfied",
      "text": "Just as described. Mine arrived quickly and had no problem. GOVEA WEBB LLC stands behind their product if there are any issues. They sent me an email soon after the mat arrived to check on the product and ensure I was satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "G.Haywood",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "Hope it helps",
      "text": "So far so good. Much more substantive than other I tried. Now to see if it helps what’s been deemed as worst putter seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Argusjimg",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "More for your money",
      "text": "Order arrived on time. Pulled it out of the box and started putting. I’m not sure how much my wife will like it but I love it. Rolls good. People say you get what you pay for well, I feel like I got more for my money. Thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "carl",
      "helpful_votes": 2,
      "publication_date": 20190125
    },
    {
      "title": "superior golf putting green",
      "text": "It is well made with deeper pockets than other mats which keep the golf balls from popping out. The included pocket pads keep the noise down on hardwood floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeepersd",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "... different putting mats and this is by far the best! This mat by Shaun Webb is high quality",
      "text": "I have owned several different putting mats and this is by far the best! This mat by Shaun Webb is high quality, more durable than the rest, and more closely resembles a real putting green.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Collier White",
      "helpful_votes": 2,
      "publication_date": 20170820
    },
    {
      "title": "Its alright. Not sure why the pads for the ...",
      "text": "Its alright. Not sure why the pads for the bottom of the cups were cut out of the backing and then provided separately. Has a permanent little bump where the foam and carpet meet so it's never quite smooth.",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Solid product. I would buy again.",
      "text": "The mat works great. I’ve had it for almost 6 months now and it’s worked perfectly. It lays flat, rolls smooth, and I really like it. I keep mine in my home office and putt whenever I need a couple minute break from work.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Helminski",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Ball rolls true.",
      "text": "Matt was pretty much as it was advertised not disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken ",
      "helpful_votes": 2,
      "publication_date": 20191231
    },
    {
      "title": "This will keep your stroke fresh particularly during winter months.",
      "text": "The putting green provides an opportunity to practice technique and feel when away from my course",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Kaulback",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Easy to use",
      "text": "Great for practicing short putts in your home. Realistic feel. I would suggest making one or two of the holes smaller to perfect your alignment. The middle hole could be regulation. The other two could be smaller.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "online video was a nice, unexpected",
      "text": "quality product. lies flat and is non-skid on my hardwood floor. the informative, online video was a nice, unexpected bonus",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S. Bruzzi",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Great may for improving short game",
      "text": "Got this for my husband for his birthday and my husband loves it and it has improved his short game!",
      "rating": 5.0,
      "verified": true,
      "author": "Mony Clark",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Wow nice training aid.",
      "text": "Excellent product. I am new to golf and the product is helping me out big time. Thank you Shaun for making the best product.",
      "rating": 5.0,
      "verified": true,
      "author": "John M. Burkhart",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Good practice",
      "text": "Nice green I think it will help my putting. Has a nice feel to it l would say the speed is around an 11 are 12 .I have seen reviews of people saying its to slow I think it's a nice speed if you play Augusta it might be slow to you. I gave it four stars because the ball has a slight hop right before the slope but doesn't effect it's line.",
      "rating": 4.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Very happy with this purchase",
      "text": "Received my putting mat quick and well packaged. Immediately rolled it out onto the floor and no creases or memory from being rolled up in the box were present. The ball rolls extremely well. Very happy with this purchase. Best putting mat out at a really good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey Halsell",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "allows the ball to run true",
      "text": "well made mat heavy enough that it doesnʻt crimp up or throw off the line of the putt well worth the $$",
      "rating": 5.0,
      "verified": true,
      "author": "SWMMR",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Five Stars",
      "text": "Really nice, sturdy...very smooth roll. Lays flat on run no problem. Great for practice.",
      "rating": 5.0,
      "verified": true,
      "author": "daniel m. mulhern",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "honest putting surface",
      "text": "this is the first indoor putting green of sufficient quality to lie flat on a carpeted surface and rolls very true. if you want to work on your 5 foot or less putts this is a great product",
      "rating": 5.0,
      "verified": true,
      "author": "charles roberts",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Great indoor training mat",
      "text": "Very good product to help my golf game. Instruction video was great and the product is great quality",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory J. Chapman",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Technically helpful and fun to use",
      "text": "The putting green is awesome as it is winter here it is the perfect aid to start getting the putter going for spring. Very well constructed it even has held up to attacks from the cats.",
      "rating": 5.0,
      "verified": true,
      "author": "FREDRICK J.",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Advertises no crease- but.......",
      "text": "Advertises no crease, but we have a crease I cannot seem to get rid of. I have taped it down, laid heavy objects on it, nothing works.",
      "rating": 3.0,
      "verified": true,
      "author": "Pam Erwin",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Son loves it!",
      "text": "My son loves this - uses it daily. Good quality - can roll up easily when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "the product is good for indoor practice",
      "text": "the product is good for indoor practice, but the mat still has a crease in the mat after a month.",
      "rating": 4.0,
      "verified": true,
      "author": "Big Mike",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "It rolls true and helps me get it to the hole.",
      "text": "I like the upslope. I find most putts I miss from that length I come up short. This makes me hit it a little harder ensuring the ball carries to the hole. It's also an excelent training aid while I'm stuck indoors this winter ... thanks",
      "rating": 5.0,
      "verified": true,
      "author": "christopher blum",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Premiun Quality",
      "text": "The putting green is fine but I was expecting higher quality based on the price compared to other products on Amazon. The spelling on the front of the box pretty much sums it up.",
      "rating": 2.0,
      "verified": true,
      "author": "United",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "This is OK and fun",
      "text": "It is a nice toy but it is super slow for anyone who is used to a real green. Helps with line but speed is way off. Fun, but the description tries to make it more legit than it is.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt L",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Five Stars",
      "text": "Great for practice. Good surface. This is where you cut those final strokes!",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Cutro",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "a fun way to pass some time and work on putting ...",
      "text": "The putting green sets up anywhere in the house, a fun way to pass some time and work on putting skills indoors while the Texas heat goes on outside. Very durable and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Hogan",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Best Practice Green for the Buck!",
      "text": "I have bought all kinds of putting greens from cheap to upper end! For the money, this is one green that is most practical for me for size, for adaptability (holes and breaks), and, finally for storage. The roll matches at least one of the courses I play on, and the feel is wonderful. Keep stroking the putts smoothly and confidently until you can make 10/10 for each hole. And remember my motto: perfect practice makes you better - not mindless repetition with faulty technique. Enjoy this beauty. Nicely packaged. Putted great right out of the box. Thanks, Shaun!",
      "rating": 5.0,
      "verified": true,
      "author": "John W Butcher",
      "helpful_votes": 3,
      "publication_date": 20170713
    },
    {
      "title": "Great product. I highly recommend this putting mat.",
      "text": "This is a great putting mat that I often practice on in the comfort of my home",
      "rating": 5.0,
      "verified": true,
      "author": "Joehussles",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Putting mat is very good",
      "text": "Shaun's putting mat is a tremendous upgrade from putting on our rug. We can easily work on our putting now.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory K Schaem",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "worth the extra",
      "text": "Quality product; likely will last. Surface arrives so that it rolls out flat. Plays true. recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Bilmalk",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Three Stars",
      "text": "Works great. Cover pin broke after 3 weeks. Had to manufacture a new one.",
      "rating": 3.0,
      "verified": true,
      "author": "Bruce Benoit",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "one flaw in this",
      "text": "flad surface is reasonably long and good quality . there is a ridge where it goes up the slope that makes uphill putts little bit irregular. there doesnt seem to be any way to flatten that out",
      "rating": 3.0,
      "verified": true,
      "author": "Brian John Moss",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Love it!",
      "text": "Love it! Very high quality. I have putted on it everyday since it arrived.",
      "rating": 5.0,
      "verified": true,
      "author": "MWM",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Good quality",
      "text": "This isn't your standard roll out putting carpet. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "todd massey",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Five Stars",
      "text": "Sent to my son for his birthday and he loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne Mitchell",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Disappointing",
      "text": "Had the exact flaw it claimed to avoid, a noticeable ridge. Failed to respond to multiple attempts to contact. Caveat emptor.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott Winter",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Feels real",
      "text": "My putts feel like they are rolling on real greens.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Great product",
      "text": "I’m enjoying very much, great to have at hone. Happy with purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Idie",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Great mat and service!",
      "text": "I would give them a 10 Star if possible. The mat is great and myself and buddies love it! The reason for the extra stars is the customer service. I had an issue with my mat and Shaun and Karol smashed a 50 foot putt for Eagle with their quick response! Thank you so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Kortnee",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Good quality",
      "text": "Great quality and good included video. I now make use of \"The Claw\". Good fun for whole family.",
      "rating": 5.0,
      "verified": true,
      "author": "RCG ",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Very weel made",
      "text": "I was surprised at the quality of the putting mat. I didn't expect it to be as dense. it rolled out quickly and flatten out very fast. I would definitely recommend it to all my friends",
      "rating": 5.0,
      "verified": true,
      "author": "William Lipscomb",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Four Stars",
      "text": "I use it in my home office - like it fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Pens fan",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Good putting mat.",
      "text": "Heavy mat construction. About the same surface as a average green.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Great quality, great price.",
      "text": "Really nice Matt. Rolls the ball very well. Good quality. I really like the portability. Can be rolled up and put back in box to store away.",
      "rating": 5.0,
      "verified": true,
      "author": "Dom",
      "helpful_votes": 0,
      "publication_date": 20180718
    }
  ],
  "product_meta": {
    "title": "SHAUN WEBB Signature Putting Green Indoor Mat 9'x3' (Designed by PGA Pro & Golf Digest’s Top Teacher) Improve Your Putting Stroke and Lower Scores - Zero Bumps and Creases, Thick & Wide Surface",
    "rating": 4.3,
    "feature_bullets": [
      "MASTER YOUR SPEED AND DISTANCE CONTROL. If you're looking to improve your putting, our indoor putting green is all about helping you improve your stance, tempo, back swing, and follow through. Perfect for the serious players to practice grooving a solid stroke. Great for golf enthusiasts to have around the house to provide hours of entertainment.",
      "NATURAL ELEVATION, BALL ROLLS TRUE. The surface of this mat has been designed so it feels like the closest thing to practicing in real green, and unlike traditional putting mats that only have one hole, ours has 3 deep holes that will allow you to practice your putting from various angles and distances and allow you to practice a firm stroke and solid putt. On top of that, this putting green has a slight uphill elevation that feels more natural than the plastic ones.",
      "THICKER AND WIDER SURFACE. Shaun Webb's Putting Mat has a new design that will allow you more options for putting practice. It's high-end rubber backing is thicker than the average putting mat ensuring no problems with footprints or creases knocking your ball off-line, keeping your stroke sharp. Just make sure the floor temperature is about right, do not use it outdoors under the sun or on a very warm floor.",
      "FINALLY A HIGH-END MAT FOR YOU. Considering that there are other cheaper, similar-looking products it makes sense that you wonder if you should buy this product as thousands of other customers have done in the past years. To answer that question Shaun Webb recorded for you a short video of the 5 Key differences between our mat and the second cheapest but more visible option out there. Find it in the picture's section of this listing! (find it after the last product pic)",
      "GOVEAWEBB'S IRONCLAD ZERO-BUMPS ZERO-CREASES GUARANTEE. Based on the feedback from our customers, this mat has been DRAMATICALLY REDESIGNED AND IMPROVED by GOLF DIGEST'S Top Teacher & PGA Pro, Shaun Webb, for maximum performance, durability and to be completely FREE OF CREASES AND BUMPS that could affect your putt, but in the unprecedented event that after 30 days you still have a crease or bump in your mat, contact GOVEAWEBB, LLC and we'll refund you, plus we'll replace your mat at no cost."
    ],
    "specifications": {
      "Package Dimensions": "38 x 9 x 9 inches",
      "Item Weight": "7.68 pounds",
      "Manufacturer": "GOVEA WEBB LLC",
      "ASIN": "B01M2161CR",
      "Customer Reviews": "4.3 out of 5 stars339 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#183,231 in Sports & Outdoors",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Training Equipment",
      "Home & Kitchen",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Golf",
      "Putting Mats"
    ],
    "price": ""
  }
}