{
  "website_summaries": [
    {
      "verdict": "Cost-effective choice, especially when buying in bulk. Easy calibration with new boxes so readings aren’t delayed. Great option if brand name isn’t covered by insurance.",
      "pros": [
        "Affordable off-brand option for OneTouch strips so you can test more often",
        "No need to worry about limiting your readings based on cost",
        "In side by side comparison to brand name strips, consistently perform well and deliver accurate readings"
      ],
      "cons": [
        "Only works with OneTouch meters",
        "Some reports of inconsistent readings and error messages",
        "Questionable production issues"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very disappointing",
      "text": "I found this product on Amazon which is much cheaper than the one I bought in Walgreens. But it didn’t work with the meter at all after I have tried seven stripes! Really disappointed. Please see the video I upload.",
      "rating": 1.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 9,
      "publication_date": 20181223
    },
    {
      "title": "Not accurate!",
      "text": "These glucose strips are totally inaccurate. Their measure of blood sugar, when compared with brand name strips, was always 10% to 25% lower. The higher the blood sugar, the larger the discrepancy. This could be dangerous if your blood sugar is very high! I returned the remainder of strips.",
      "rating": 1.0,
      "verified": true,
      "author": "E. Gaines",
      "helpful_votes": 9,
      "publication_date": 20180105
    },
    {
      "title": "Make sure you set the code in your meter. Great price.",
      "text": "The price is great. They work good, you just need to set the code that is printed on the bottles. The strips were delived in a couple of days. The people that wrote negative reviews probably don't know how to follow instructions. Save your money and buy a great product that works. The drug companies that market the name brands are ripping us all off.",
      "rating": 5.0,
      "verified": true,
      "author": "kmuehter",
      "helpful_votes": 4,
      "publication_date": 20180920
    },
    {
      "title": "Excellent accuracy!",
      "text": "HIghly accurate when compared to the One Touch strips, side-by-side with blood from same finger prick. No clue why US insurance companies don't just cover these strips.......cost to make them nowadays is extremely cheap. I highly recommend these. Shouldn't have to pay more than 27 - 30 bucks for 200 strips (many sellers, with many options on Amzn). I'm not sure about trying to use them in a One Touch mini (as I use) that was manufactured in/after 2016. (I see 1-2 other reviewers said something about that -- not sure of accuracy of that info at all).",
      "rating": 5.0,
      "verified": true,
      "author": "Mike W.",
      "helpful_votes": 2,
      "publication_date": 20171118
    },
    {
      "title": "Excellent value and readings track with A1C",
      "text": "So far, so good with these test strips. Out of 200, only two or three were defective. Compared to the brand-name versions or the strips available through the FSA-approved store, these are a great value!",
      "rating": 5.0,
      "verified": true,
      "author": "secyatlaw",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "I use these with my OneTouch Ultra meter and I ...",
      "text": "I use these with my OneTouch Ultra meter and I have tested them side-by-side with the official OneTouch strips. There may be a 1-2 point difference at most on the reading, but that is the same as using 2 of the official strips right after each other as well. Just remember to check the code number on each order as they will not always be the same, and using the wrong code will provide inaccurate readings.",
      "rating": 5.0,
      "verified": true,
      "author": "JP Nunemaker",
      "helpful_votes": 2,
      "publication_date": 20171216
    },
    {
      "title": "Good Price, But Perhaps Worthless for the Pre Diabetic",
      "text": "Tired of paying high prices for OEM strips, I tried these. At first I gave them 3 stars due to inconsistent readings. I have dropped that to 2 stars after getting readings of 105, 118, 127, and 133 this morning. For a pre-diabetic, this range makes the strips nearly worthless. I am going back to the more expensive brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Evaluator",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "their price is dramatically less than the pharmacy price.",
      "text": "the reasonable price allows me to test my blood sugar level 4 times per day. I'm 80 years old and have been a type 2 diabetic for 30 years. Along with diet, exercise and weight control I'm nearly at the prediabetes level. I've been told, that if I was a bit younger, I could of reversed the T2D and became normal again. When I was first diagnosed I was told that it was not reversible",
      "rating": 5.0,
      "verified": true,
      "author": "patrick j. lynch",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Don't buy",
      "text": "I opted to ignore some reviews and give these a try, at the price, couldn't hurt. I get EXTREMELY inaccurate readings. I've done a variety of testing different fingers and the same finger, and regardless, get highly varying results. So I end up having to use the One Touch strips anyway. The most recent results were 112-130-146, all taken within one minute. Thankfully I don't require insulin, but the medical professional in me still screams DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Difficult to use",
      "text": "Yes. They cost less. Generally the accuracy is acceptable. However, these strips are thicker and stiffer than other test strips. The thicker the strip, the bigger the amount of blood need to get blood on the test area. I always wind up getting one or two error messages that the sample is too small before finally getting a result.",
      "rating": 2.0,
      "verified": true,
      "author": "Ron Rives",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Tested agains name brand and has lower results.",
      "text": "I tested these strips against the brand name and also against a different meter brand. The other strips were comparable to each other, but the GenUltimate consistently read low, between 9-20 points lower than the others. I think they are still usable if you adjust for the potential variation in reading. I would be inclined to buy one pack of the brand-name strips to use as a control test. Every once in a while, see how the GenUltimate compares.",
      "rating": 4.0,
      "verified": true,
      "author": "jpau00",
      "helpful_votes": 2,
      "publication_date": 20180210
    },
    {
      "title": "I have using these for years, this was my first problem!",
      "text": "New 50 pack opened this morning, I buy in 200 quantity. My BS usually runs around 110-130. Read 300+, I couldn't believe it, tested again...400+. Opened another 50 pack, read normally. The info on Lot/Manufacture numbers are in the photos.",
      "rating": 4.0,
      "verified": true,
      "author": "shelton green",
      "helpful_votes": 3,
      "publication_date": 20190210
    },
    {
      "title": "Be careful",
      "text": "I typed in Contour test strips and they returned these test strips. They don't work for the contour only for the Next. Now I have 200 strips I can't use and in order to find out I had to open them up so they can't be returned. I can't rate them because I can't use them.",
      "rating": 1.0,
      "verified": true,
      "author": "bigbs1",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Error issues",
      "text": "I buy these because they are a great value. I have had issues with my last 2 orders though. Approximately 100 out of 200 give me an error meassage and I am unable to use them. Amazon did give me a credit for my last order but I had an issue with the next order. Very frustrating",
      "rating": 3.0,
      "verified": true,
      "author": "Hcklbrrymt",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Works as well as the brand but less $$$",
      "text": "These are great and so much more affordable than the brand strips. They work just as Well - I tested them side by side for weeks to the brand and they were dompletely accurate. Plus they need a little less blood. Dont pay the exhorbitant price for the brand!",
      "rating": 5.0,
      "verified": true,
      "author": "Stella",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Work just like the manufacturer's!",
      "text": "These work just like the manufacturer's test strips for the OneTouch Ultra series blood glucose meters at a fraction of cost, as long as you have an older meter. The meter I was using was manufactured prior to March 2016, just as the listing mentions, so these worked without issue and as expected. Being able to get strips at a lower cost is extremely helpful, especially when you don't have health insurance or insurance that will cover them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason E. Eaby",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "not worth it",
      "text": "I bought these a couple of times, but this last box has so many bad strips that won't even 'take up' the blood to give a reading! I contacted the seller, but no response.buy these elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna R. Moss",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "The only testers I buy for my One Touch",
      "text": "What can you say. They work. I test my blood 4 times a day and they work almost each and every time. There are times I get in a rush or do not put the strip in properly and get a bad result. However I do believe that is my fault.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Davis",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Not accurate",
      "text": "The strips work with my OneTouch UltraSmart. However, it seems like there is a lot of variance on the results depending on the batch (~ +20 to 30 points). Given the price, I have purchased it several times, but given the variance from strip to strip I have decided that it is no longer worth the saving. I will go back to the brand name.",
      "rating": 3.0,
      "verified": true,
      "author": "Jorge Luis Ramos",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "I couldn't afford the brand name strips for my blood glucose meter any other way!",
      "text": "I couldn't afford the brand name strips for my blood glucose meter any other way! Most economical solution I've run into anywhere yet! and - they are dead accurate tested against two other brand meters and test strips!",
      "rating": 5.0,
      "verified": true,
      "author": "Thedreamspinner",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Lots of Waste Due to Errors",
      "text": "I liked the price initially; however, after using the strips, I feel they are not such a good value after all. I get frequent errors and have to throw one away and use a new one; sometimes more than once. I'd estimate I get good readings (no error) only about 75% of the time. I've never experienced that with other generic sticks.",
      "rating": 2.0,
      "verified": true,
      "author": "Dee Jae W.",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Not very reliable with this new batch!",
      "text": "Ive bought these before, but for some reason with the new batch it seems like the readings are all over the place! My readings can differ as far as 50 points from two separate drawings. So far I need to draw twice in order to get a ballpark estimate.. I’ll keep using it for now, but if it continues with my next purchase I may have to switch back to a more expensive brand :(",
      "rating": 3.0,
      "verified": true,
      "author": "Christianne Z.",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "One box gave high readings with test solution.",
      "text": "One box of the 4 gave erratic high readings, Had spend $15 for test solution to verify - all tested strips a(t least a dozen)were above the allowable range. and several were way high.",
      "rating": 2.0,
      "verified": true,
      "author": "johnbear",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "It is SO much cheaper to get these generic ones ...",
      "text": "It is SO much cheaper to get these generic ones. Even with insurance, I had to pay close to 60 dollars for a box of 100. I get 200 for 30 bucks now. And they need less blood to read. Well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sir Maximiliano",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Works great with my OneTouch UltraMini",
      "text": "You really can't beat the price and quality of these strips, I highly recommend them if you are looking for a quality product, and a GREAT price. give them a try you won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "LKB",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "I can live with that way better than 1$ each one touch",
      "text": "Compared to one touch test and did not match results. Seemed to read about 10 % low consistently",
      "rating": 4.0,
      "verified": true,
      "author": "RAY A ORTIZ",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Save money, they work great.",
      "text": "These work great, no problem. My husband and I love them. We're using them with the One Touch Ultra II meters. We're saving a lot over the blue strips normally sold for those meters.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Jenner",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "you have to have a reader",
      "text": "this is just the strips no way to read them",
      "rating": 1.0,
      "verified": true,
      "author": "russell",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Comparable to brand name",
      "text": "Let me tell you why you need to get these. They’re pretty accurate (because I’ve compared them with Brand name ones) AND they’re extremely affordable. I’ve been using these strips for a year and no problems so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Hong",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "OneTouch Compatibly",
      "text": "Just another data point: as of October 2019, these work perfectly fine with my OneTouch Ultra Mini.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Wreede",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Testing value",
      "text": "I found this product and price very good and convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Excellent quality, even better cost",
      "text": "Excellent quality, even better cost. Put them up against my more expensive strips and no difference in accuracy. If you are tired of paying the bloated prices for name brand test strips? Give there a try. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony G Boea",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Savings $$$!",
      "text": "These are almost as good as the manufacturer brand and will save you big-time if you don't have a perscription for strips!",
      "rating": 5.0,
      "verified": true,
      "author": "Kdub",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "This are a great price and we've never had a issue with any ...",
      "text": "Test strips remain expensive even with insurance. That really adds up if a diabetic is testing as frequently as they should. This are a great price and we've never had a issue with any of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Autism Family",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Bad Batch of strips!!!!~!~",
      "text": "I've had good luck with these strips past but with this past order i.m experiencing a 50% failure rate in this batch of strips. I am not very happy!",
      "rating": 1.0,
      "verified": true,
      "author": "jerrymaz",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Tried these out to replace what we usually get at ...",
      "text": "Tried these out to replace what we usually get at the pharmacy for $$$$. These read the same as the strips we have been purchasing and at 1/5 the cost. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Allan R. Williams",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Not Accurate",
      "text": "Blood Glucose test results were not consistent (tested several times in a row and got different values) and were repeatedly ~ 30% off the One Touch Strips. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "I. Rose",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Good test strips",
      "text": "Compaired the readings to the national brand that sells for twice what these strips sell for. All the readings were within the acceptable range. The difference between 10 test comparison was 7 points at the most.",
      "rating": 5.0,
      "verified": true,
      "author": "JLF",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "but this last order wasnt so great. Im hoping it was just a bad batch ...",
      "text": "Normally I dont have any complaints about the test strips....but this last order wasnt so great. Im hoping it was just a bad batch this time because the readings were way off!! I had no choice but to order more today because im close to being out. My folks gave me a few of the one touch ultra(blue) for the next few days. I had to throw out the last bottle of ones I ordered thru Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Terry Oler",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Can't beat the price!",
      "text": "These have worked wonderfully in my One Touch meter. I used a separate, Reli On meter to compare- and results are always within a few points of each other, which indicates to me I am getting a good reading.",
      "rating": 5.0,
      "verified": true,
      "author": "deidrea",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Picture is misleading",
      "text": "The picture shows four boxes, what you are buying are two boxes of two containers each of fifty count strips. I did get what I paid for but it looked like I was buying four boxes of two containers each which would make this a really good price. Not exactly bait and switch but very misleading.",
      "rating": 3.0,
      "verified": true,
      "author": "Krista spencer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Big bang for the buck",
      "text": "Buying this product was a home run for my \"OneTouch Ultra 2\" meter. The stores don't seem to be carrying these test strips, but buying them via Amazon, I found a great value for the price with fast delivery. The strips worked great in my meter. 5- Stars",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Easy way to keep up with my blood sugar",
      "text": "I order these whenever I run out. Works well in keeping up with my blood sugars and controlling my type 2 diabetes.",
      "rating": 5.0,
      "verified": true,
      "author": "D.Berdanis",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Auto renewal",
      "text": "It’s like the Sorcerers Apprentice. I can’t get the shipments to stop!!",
      "rating": 1.0,
      "verified": true,
      "author": "tm23",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Only 75 to 80 strips worked out of 200",
      "text": "Ordered the 4 boxes 200 test strips. Only 1 container of 50 worked properly. The other 3 containers had many strips Which did not read accurately or put up errors . Meter itself tested and is accurate",
      "rating": 2.0,
      "verified": true,
      "author": "Snowy",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Defective strips",
      "text": "I receive frequent error messages on my glucometer because of these strips. Once, six strips in a row resulted in an error before the seventh strip yielded a result. In a complaint about this to the manufacturer, the service rep basically stated the fault lay with the operator or the device. The rep did not accept that the company sells defective strips.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent A. Cantley",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "So they aren't perfect but if you know they are 20 points over ...",
      "text": "Every time I switch strips I overlap. These ran 20 points over my old strips consistently for my last ten old strips. So they aren't perfect but if you know they are 20 points over you can stay on track and the price was good.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Curtis",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Great value for quality test strips",
      "text": "These test strips are accurate, good quality, and an excellent value.",
      "rating": 5.0,
      "verified": true,
      "author": "KBW",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Works and fits just like the name brand strips.",
      "text": "Reset meter to required offset and compared to factory strips at factory settings. Read the same results. Did that test twice. Same results!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Hux",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Awesome price! You can afford to track your blood sugar :-)",
      "text": "These work just as well as the ones that are twice or three times the price. They match up closely to my lab work readings.",
      "rating": 5.0,
      "verified": true,
      "author": "Venessa",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Accuracy is not always good",
      "text": "I appreciate that these strips are easy to use and less expensive than others however I have to discard at least one out of every three because it doesn't read my numbers.",
      "rating": 3.0,
      "verified": true,
      "author": "Kim Patterson",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Lifesaver!",
      "text": "We can now afford to test! When there is hardly the money for insulin, test strips are even lower down the priority line.",
      "rating": 5.0,
      "verified": true,
      "author": "Dot",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Totally recommend!",
      "text": "Works good for One touch Ultra and a better price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "I use these and they work fine",
      "text": "It seems these strips read slightly higher than the one touch. But once you know that, they work pretty good. Occasionally one will error, but the value is worth the occasional failure.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Great alternative to the more expensive brand",
      "text": "Great alternative to the more expensive brand. I tested this against the OneTouch blue strips and they consistently read 10 points above the blue strip reading. As long as you apply this offset to your target limits, they should be ok to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Pisey",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Really a great buy.",
      "text": "These strips work just fine. Run parallel to current brand to get confidence and go.",
      "rating": 5.0,
      "verified": true,
      "author": "john ",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "An incredible value!",
      "text": "I like these strips much better than the One Touch variety. And they are much cheaper to boot.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Wilson",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Amazing value!",
      "text": "Amazing value and work perfectly with OneTouch meter, much better price than the OneTouch test strips.",
      "rating": 5.0,
      "verified": true,
      "author": "Actual Purchaser",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Work like name brand",
      "text": "Excellent price. Work as good as name brand at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Works great with my meter and cheaper",
      "text": "Works great. Less than half price of insurance of insurance rates",
      "rating": 5.0,
      "verified": true,
      "author": "juliebon",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Do not order bad tabs",
      "text": "Will not order from this company again 2 containers bad the tabs are no good they test 30 pts high",
      "rating": 1.0,
      "verified": true,
      "author": "Terry L. Feik",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Four Stars",
      "text": "I think these are a good sub for the expensive One Touch strips. So glad they are available.",
      "rating": 4.0,
      "verified": true,
      "author": "Texas Gal",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Great deal",
      "text": "Fixing review... 4 boxes listed at 50 per box, so the 2 boxes at 100 per box is equivalent. Changing to 5 star.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony M. Emmanuel",
      "helpful_votes": 2,
      "publication_date": 20180512
    },
    {
      "title": "The 2 bottles have so for be pretty accurate. I compared them to the one touch ...",
      "text": "The 2 bottles have so for be pretty accurate. I compared them to the one touch strips I still have and the GenUltimate is usually within 2 points of the one touch.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Mullis",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Good",
      "text": "Its for my mom, she said they are good.. but since its not me that using it thats why im giving it a 4stars..",
      "rating": 4.0,
      "verified": true,
      "author": "Yuri",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Five Stars",
      "text": "the product exactly as described. produce consistent measurements. delivered on time. no problems",
      "rating": 5.0,
      "verified": true,
      "author": "Leonid O.",
      "helpful_votes": 2,
      "publication_date": 20170405
    },
    {
      "title": "They work fine. No idea if they are ACCURATE",
      "text": "They work fine. No idea if they are ACCURATE! Would have to compare side by side with brand name. So far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl L. Haass",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "accuracy",
      "text": "ordered 200 GenUltimate strips and I received 100 GenUltimate strip and 100 Acc-uchek Aviva plus strips. I was unable to return the Aviva Plus strip because the return window close before I opened the package.",
      "rating": 1.0,
      "verified": true,
      "author": "Rene Dominguez",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Five Stars",
      "text": "Excellent. All the money wasted on the named brands when all along these are good quality and low priced.",
      "rating": 5.0,
      "verified": true,
      "author": "M Cruz",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Doesn't work",
      "text": "I bought these to go with my mother's glucose meter. They don't work. They turn the meter on, but when you add blood it doesn't read it. It stays on the \"add blood\" screen. Will not buy again..",
      "rating": 1.0,
      "verified": true,
      "author": "B.B.",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Five Stars",
      "text": "Way better and cheaper compare to name brands test strip.",
      "rating": 5.0,
      "verified": true,
      "author": "AMZ Buyer",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Five Stars",
      "text": "Works great and SO much cheaper than the original brand. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "CreativeZoo",
      "helpful_votes": 2,
      "publication_date": 20170421
    },
    {
      "title": "Would buy again",
      "text": "The toss was good but the accuracy was about 10 points off. The higher the glucose reading the bigger spread.",
      "rating": 4.0,
      "verified": true,
      "author": "Airborne Dad",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "it all came in Great, this is a trusted seller",
      "text": "I miss counted when I first received the order, it all came in Great, this is a trusted seller!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Ormsby Hobbies",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Buy these!",
      "text": "These work great! So much more affordable than name brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Economic Glucose Test Strips",
      "text": "I have not opened this box of test strips I wait until my present box is empty. The boxes appear to be the same. I have used this brand before.",
      "rating": 4.0,
      "verified": true,
      "author": "Marsha Welch",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Five Stars",
      "text": "Amazing! So worth the money saved! No problems with my blood sugars.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Budget friendly",
      "text": "a fraction of the cost yet the same great product",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca K.",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Good price, good product.",
      "text": "I bought this for a diabetic friend who wants to test more often than his insurance allows. This is a very good price. It was delivered promptly and I am very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Veedie",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Bad product!",
      "text": "These strips do not work as advertised. I have tried 20 of them in my one touch ultra and they don't give a number.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Sauerheber",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Five Stars",
      "text": "They seem to be accurate. Close enough that I trust them for correct blood sugar readngs.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Davison",
      "helpful_votes": 5,
      "publication_date": 20170313
    },
    {
      "title": "Five Stars",
      "text": "Good strips and have a good comparison with lab. tests.",
      "rating": 5.0,
      "verified": true,
      "author": "Ada",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Five Stars",
      "text": "They met my needs, but wish they were less expensive",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Great Alternative to the Name brand test strips",
      "text": "These test strips are very good and far less expensive than the blood tester brand. Thank you for offering an alternative for those who have to pay so much for test test strips. The Blood Testers do not give any discounts.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Stapleton",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Bargain",
      "text": "Just as good as brand name, at much lower price. No prescription needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Stanley Tatum",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Five Stars",
      "text": "Good buy and accurate readings. Compared to two different ones",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "How can they sell this product with good conscience?",
      "text": "States on the box that the strips will work with One Touch Ultra Meters. They are consistently off 20 points!! I tested these with the one touch ultra strips side by side! How can they sell this product with good conscience?",
      "rating": 1.0,
      "verified": true,
      "author": "rjrcnm",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Quick delivery! Test strips seem to have an accurate ...",
      "text": "Quick delivery! Test strips seem to have an accurate reading.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne H. Huntsman",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "None",
      "text": "It’s really help the diabetic patients affordable to checking often",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "quick ship as described",
      "text": "it works like the name brand at a fraction of the cost",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey D Hopkins",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Accuracy",
      "text": "Accuracy and value for money. Also have a timely delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "CYNTHIA MCDONALD",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "False advertising",
      "text": "I ordered 200, but only received 100 strips. They work well, but this is false advertising.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy L. Cutsinger",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "The cost was only 10% of one step ultra strips ...",
      "text": "The cost was only 10% of one step ultra strips, I compared testing with both the Genultimate and the one step and got near identical test results. I'll never buy brand name strips again!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul smith",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "It work fine with my One Touch Ultra",
      "text": "It work fine with my One Touch Ultra ! I’ve been order it continually ! I would recommend this to friends !",
      "rating": 5.0,
      "verified": true,
      "author": "sunshine",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Love it",
      "text": "They are great generic when i was told none exists",
      "rating": 5.0,
      "verified": true,
      "author": "Nori",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Great replacement and same quality as name brand",
      "text": "Replacement strips work just as name brand prescribed by Dr. No need to calibrate or adjust meter",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Great buy",
      "text": "A fraction of the price of name brand. These work well and were less expensive than my copay.",
      "rating": 5.0,
      "verified": true,
      "author": "DC306",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "they work with my meter",
      "text": "however...i get too many errors and waste strips because i have to check my blood a couple of times to get a reading.....",
      "rating": 2.0,
      "verified": true,
      "author": "Yolanda Mendez",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "WILDLY INACCURATE",
      "text": "With my calibrated and compatible glucometer, these strips read 100-200 OVER the real reading. DO NOT TRUST these strips!!",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Great price and quantity",
      "text": "Beats paying $80 for 50 of the genuine strips. Definitely works with one touch ultra 2.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn ",
      "helpful_votes": 0,
      "publication_date": 20180901
    }
  ],
  "product_meta": {
    "title": "GenUltimate! Blood Glucose Strips 200 Count- 4boxes of 50",
    "description": "GenUltimate Test Strips are for use with OneTouch Ultra, Ultra2 and UltraMini Meters purchased through March 2016. They are used to quantitatively measure glucose in fresh capillary whole blood samples taken from the finger, forearm or palm.",
    "rating": 4.6,
    "feature_bullets": [
      "Country of origin is Korea, Republic of (South)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "5.6 x 3.75 x 1.7 inches; 4.8 Ounces",
      "Date First Available": "December 14, 2016",
      "Manufacturer": "GenUltimate",
      "ASIN": "B01MU0NLYB",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Test Strips",
      "Health Care",
      "Blood Test Strips",
      "Diabetes Care",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 31.95
  }
}