{
  "website_summaries": [
    {
      "verdict": "A versatile charger packed with a number of features that comparably priced models are lacking.",
      "pros": [
        "This upgraded model has 4 integrated limiters, which monitor heat and current to offer an added layer of safety",
        "The charger works for LiPo, LiFe, LiIon, NiMH, and NiCd batteries",
        "Besides charging and discharging, this unit has a storage mode that can be used to protect your batteries"
      ],
      "cons": [
        "This model can get hot while charging and discharging",
        "It is not a defect, however, it's how the unit was designed to function"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Out $60.00 and no charger!",
      "text": "This charger equalized four battery packs before it crapped out. The last 18650 battery pack apparently had a loose sensor wire that we did not see because of the packaging and when plugged in to the unit with a hardy high ho and a cloud of smoke the charger died. There is no reverse polarity protection in this unit and for $60.00 you would think they could buy a 50 cent diode. We have lost $60.00 and we are very upset about the loss. I am hoping I will hear from someone with a reasonable remedy.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunny",
      "helpful_votes": 3,
      "publication_date": 20171127
    },
    {
      "title": "Very happy with this unit",
      "text": "Very happy with this unit. Took a little reading to get going but I am new to charging Lipo's. Took one star off because the description is a little misleading for a newbie. I specifically got it to charge my 5500ma S3 Lipo's thinking that \"6 amps\" would allow 1C charging. Turns out that the \"50 watts\" is the limiting factor. My S3 batteries will only charge at 4.5 amps, not the 5.5 I was hoping for. I know, it was pretty clear for those electricians out there but if you are a newbie just be aware that charging a battery like mine will take a bit longer. Great quality unit though!",
      "rating": 4.0,
      "verified": true,
      "author": "Stuart Leslie",
      "helpful_votes": 2,
      "publication_date": 20170809
    },
    {
      "title": "Solid charging platform",
      "text": "This iMAX B6AC V2 works very well. the unit seems well built and all the accessory cables were well soldered and properly insulated. The chargers on-screen menu system is decently laid out and not hard to navigate. This version of the iMAX B6 can be plugged directly into a 110V outlet for home use and has separate DC inputs (11V~18V) for field use. At this point in time, I've only used the iMAX B6AC V2 to charge Turnigy nano-tech 1000mah 2S packs, so I cannot comment on it's ability to charge at higher current levels. Overall, it's a great little charger and well worth the premium price for a \"Genuine\" item.",
      "rating": 5.0,
      "verified": true,
      "author": "T.H.",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "I love these things",
      "text": "I buy these to deliver with custom crawlers for my customers. They are originals, with label and serial number. These are not knockoffs. Every one has worked. Just got another in today and I’ll be burning it in tomorrow. (Never send customers untested items) I really like the various connectors they include. And everything is solid, with the feel of quality. Of course, I’d like to see it at a lower price. Winner!!",
      "rating": 5.0,
      "verified": true,
      "author": "Just a guy",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Good overall",
      "text": "This is a good charger. You can charge, discharge, balance, and check various values. So, not a whole lot more to ask, for, right? Well.... sure, but I wish they'd add an on/off switch -- you have to unplug the power cord to turn this thing off, which is very annoying (I got a power stirp with on/off for each port, so that solved my issue, but it's still a weird design omission).",
      "rating": 4.0,
      "verified": true,
      "author": "B.K.",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Great Tiny Whoop Charger!",
      "text": "I just got it today and I love it! I'm using it to charge my Inductrix FPV batteries and it works fine! Just plugged in my parallel board, plugged in all my batteries and charged them up! If you have question on charging tiny whoop batteries on a parallel board , feel free to ask! I'm a complete. Beginner to the FPV community, but if done enough research to keep me in the air with my Inductrix and I'd be happy to help anybody with questions I may have had getting into the hobby c:",
      "rating": 5.0,
      "verified": true,
      "author": "Josias",
      "helpful_votes": 3,
      "publication_date": 20170223
    },
    {
      "title": "My second one not working",
      "text": "I have one of these at one location and love it. I bought a second one for another location. Did use it for several months. The lead and Nmh programs work great, but I get a balance error on any form of lithium. Thought it was me or the battery at first, but still can't make it work. Now too much time has passed for a return. :-(",
      "rating": 2.0,
      "verified": true,
      "author": "Villager Mike",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Super legit. Will buy again.",
      "text": "The real deal. Beware of fakes! This thing is legit asf Get yourself a $10 computer fan to keep it cool while charging so it lasts forever. It doesn’t get that hot so you probably don’t need a fan but I recommend getting one. Take care of it and it’ll last years",
      "rating": 5.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Good charger",
      "text": "One of the better battery charger I've purchased. This one is an authentic SkyRC iMax as I've verified at SkyRC website. I like the power cord that came with so I didn't have to buy the cord. The unit allows me to see the battery resistance and amount of charge that is being transferred into battery. Albeit the high cost, I was looking for an easy to operate and yet sophisticated enough to diagnose the battery and charge/discharge on its own. This unit does seem to be charging the battery well and not over charge so far. I've used this charger on RC receiver/transmitter batteries and lead acid tractor battery.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "These are junk",
      "text": "I have purchased two of these and both failed right away. I thought the first failure might be a fluke so I ordered another and it just quit tonight charging a brand new battery. I recently returned to flying RC planes and all my equipment is brand new. Both units didn't charge 8 batteries combined. I would recommend looking for a different charger. For what I paid for these two units I could have purchased a quality charger and saved myself time, money and headaches.",
      "rating": 1.0,
      "verified": true,
      "author": "Steer clear of this charger",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Good balance charger for LiPo maintenance",
      "text": "Works well to charge and properly store the LiPo batteries for my drone. The instructions are simple and easy for a newbie to get started. Seems of very good quality and works flawlessly so far. I like that the D/C converter is built in, keeps things simple and organized, and you don't have to find the right cable. Recommend",
      "rating": 4.0,
      "verified": true,
      "author": "BigSkyMT",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Very good product Just a lil complicated though...",
      "text": "These work great...I have an authentic one btw.... But- as good as it is, when you first start using it , it can be complicated. even the manual isn't all that easy to follow. But- if ya want your batteries to be healthy ya need one. it works great once ya get the hang of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Wildbillo68",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Reversed polarity XT60 to banana plugs",
      "text": "The XT60 to Banana plug adapters (battery to the charger) to charge reverse the polarity and make it unusable. You can actually see the color coded wires getting swapped from red to black along the route. Have to find a new adapter cable for it...",
      "rating": 3.0,
      "verified": true,
      "author": "Just Justin",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Erroneous errors render this inoperable and customer service is zilch",
      "text": "I emailed customer service in December 2016 (it's July 2017 now) and they have yet to respond. It's basically worthless because regardless of what I do, I get a \"invalid voltage error\". Which makes no sense, and the manual doesn't help at all-it doesn't define what an \"invalid voltage\" means. The voltages on the cells seem pretty valid to me, 4 volts. I checked them using a simple voltmeter (I have a PhD in physics so I know my way around electronics). Anyway, I bought another charger from another company and it worked no problem. Don't buy this piece of crap, and your emails to customer service in China (info@skyrc.cn) are just ignored. Save your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 9,
      "publication_date": 20170701
    },
    {
      "title": "Item broken",
      "text": "i got it at my front door so i quickly opened it but when i plugged it in nothing happened the screen didnt even turn on i pressed the start button to try to see if that was the on button but still nothing not even a sound a little disappointing but might just been my luck :( im going to buy another so lets hope its not broken this time",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Best charger for the money that ive come across.",
      "text": "I am extremely pleased with this charger. So far, it has charged every battery i have. I am very glad that adaptor harnesses were included and work great. A bit complicated to use, but it is to be expected for the complexity involved when there are so many different batteries out there.",
      "rating": 5.0,
      "verified": true,
      "author": "keithfoco",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Works great.",
      "text": "Bought this after having issues with cheapo <$20 chargers, and i'm very impressed. I only charge batteries when I can monitor them, but its nice to know that there is some built in protection to stop charging when a battery is full. Its handy to be able to choose the charge rate, and monitor the charging for each cell very easily. Its also great they included plenty of adapters to charge different batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Mixmasta91",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "it works very well",
      "text": "Reading the instructions for the average non-electrical knowledgeable type person it was confusing. However I was able to just play with it and test it out on different things then I’ll have it figured out",
      "rating": 5.0,
      "verified": true,
      "author": "Travis sierra",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great charger with great flexibility.",
      "text": "Great charger with great flexibility. I am new to Lipo batteries and am learning as I go. But this charger gives me piece of mind when charging. The balance charging option works very well, and will not over charge or charge the batteries too quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN B SUCHY",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Round two and still not any good",
      "text": "This is the second imax b6 I've purchased and will be the last. The first one I bought worked for a year or so and then quit. I foolishly bought this one and it doesn't work right out of the box. Nice.",
      "rating": 1.0,
      "verified": true,
      "author": "vincent",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Great value for a balance charger",
      "text": "Nice little charger with just enough features. Balance charges my 2S and 3S packs fine. Also charged my neighbor's NiMh battery way faster than his wall plug charger.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Waste of money",
      "text": "This charger will not properly charge or balance the batteries.",
      "rating": 1.0,
      "verified": true,
      "author": "ed",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "worked for a day then stopped",
      "text": "Love the fact it would do both 12v and 120v. It worked for a day and then stopped working??? It seemed to charge well and balance fast. I must of got a dund. sending it back.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Kim",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "A must have for your batteries!",
      "text": "This is a very popular model among hobbyists and a must have to properly maintain your lipo and other type batteries. When not using batteries you can quickly put them in storage mode and then fully balance charge them when ready to use. Simple to use and very safe! Be aware of the cheaper clones and stick with the Genuine brand if you want a good reliable safe balance charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Gadget",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Does Not Work!!",
      "text": "When I bought this charger and plugged my lipo batteries in to charge, an error message sprang up that said \"BALANCE CONNECT ERROR\". It has been almost two months and I have not been able to find a solution to this problem, plus the charger does not work with flat out ANY battery. I tried over 20 batteries of li-po, li-ion, and ni-cd. Did I really buy a broken charger for 55 dollars?! Do not encourage buying for sure",
      "rating": 1.0,
      "verified": true,
      "author": "Elsa Blum",
      "helpful_votes": 2,
      "publication_date": 20181024
    },
    {
      "title": "This thing is awesome",
      "text": "Does everything I need. My only complaint is that it gets kind of hot when discharging batteries. If it had a fan that might help but I'm discharging a 2s lipo at 0.6 amps and the charger is at 50 degrees celcius. Not really a problem since it stays cool when charging and that's mostly what I use it for, only discharging to store lipo's.",
      "rating": 5.0,
      "verified": true,
      "author": "Quinn",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "works exceptionally",
      "text": "Never purchase one of the \"Clones\" you will be disappointed, this unit works GREAT! Just charged close to half a kilowatt of Lipo on balance at 2.5 amp and it performed flawlessly and did not overheat.",
      "rating": 5.0,
      "verified": true,
      "author": "M.R.",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "A real time saver",
      "text": "Charges my R/C batteries in a third of the time as factory supplied charger. Not to mention the versatility in types of batteries it'll charge.",
      "rating": 5.0,
      "verified": true,
      "author": "RodmanB",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great charger for all your RC needs",
      "text": "This charger will handle all of your charging needs. Fast Charge, Balance Charge, Discharge, Storage. Handles 2S - 6S batteries. LiPo, LiFe, LiIon, NiMH, and NiCd to boot.",
      "rating": 5.0,
      "verified": true,
      "author": "Bakins",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Worked great to bring back my battery sticks on my civic hybrid.",
      "text": "I used this charger to revive my civic hybrid battery sticks. Some say this is a temporary fix but so far the hybrid pack hasn't thrown any IMA lights for the past 3 (cold) months. The car picked up tons of power but it's still slow compared to my RS3. I used to get 30mpg city and after reviving the battery, I hover around 48mpg.",
      "rating": 4.0,
      "verified": true,
      "author": "gene",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Overkill",
      "text": "Kinda overkill for my RC batteries. And its complicated to use. I couldn't get it to sync with my computer. But it works well.",
      "rating": 3.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Multi function and easy",
      "text": "Recovered a lipo battery using the nicad mode. Storage charge function is great and the cell metering shows the condition of the battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Not very easy to use. But for small batteries it's good.",
      "text": "A nice balance between economy and value charger, but at six amps max you have better not have a large pack to charge else it may be an all nighter. And for multiple packs, you may want to consider the dual pack chargers that do more watts to reduce charge times",
      "rating": 4.0,
      "verified": true,
      "author": "Antonio S.",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Very good charger for the money. Don’t get fooled by the imitations out there.",
      "text": "Great charger if you don’t want to spend a bunch of money. Get educated on the batteries you are charging. Your input that you put in is vital. Not only for proper charging but for safety.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Excellent charger",
      "text": "This is one of the best rc chargers ever produced. Over the year I have owned it, I have revived numerous nickel-metal batteries using the cycle feature. In addition, this charger is easily programmable and charges lipo batteries like a champ. I had the Traxxas EZ Peak charger prior to this one, but the fan failed, and soon after the charger failed as well. I cut my losses and took a risk with this charger. This is the best purchase I have made for my rc cars.",
      "rating": 5.0,
      "verified": true,
      "author": "gamerguy",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Safer, Faster, Much More Versatile than Lipo Chargers Included With UAV,s",
      "text": "The charger allows me to charge my Lipo batteries much quicker and safer than the stock balance charger that was included with my Quad drone. I can also test each battery and cell for voltage and resistance as well as discharge them and storage charge them. Impressive!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert MacMillan",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "It's real alright",
      "text": "Mine came with the scratch off verification code to verify it with Skyrc.com (scroll to the bottom to find Authentication under Support).",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Disappointed. EDIT - nope",
      "text": "Went to use it for the first time, and it throws errors no matter how I set it up, with a balance board or without. Disappointed. EDIT - nope, I'm an idiot - this unit works perfectly - the balance board is a POS :). 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "hh",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "New LiPo person",
      "text": "Just got it today and actually read the booklet. Setup was easy, and it worked as the instructions said it should perfectly. Im new to Lipo battery's so I was pleased with how user friendly it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Tacker",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Perfect and high quality",
      "text": "This is a greta charger, it saved my old batteries as well. I have retired my bootleg b6's and only use this one now. I also bought the charge board and it is VERY helpful in my charging table. I am going to buy another one ASAP! :):)",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Super hard to set up",
      "text": "Not sure if i got a dud but it cannot recognize the battery to charge. Looked online and a lot of people having the same problem. I guess it would be good if it WORKED.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Quality genuine charger.",
      "text": "Fantastic genuine charger, does everything as advertised. I bought this to replace a cleverly misplaced tenergy charger that I had been using for a few years, and I must say the menus and functions are a bit more intuitive. Since I received this a week or two ago I've been able to charge and test several 18650's with great ease, also with the built in voltage and resistance meters I can do a few quick measurements without having to bust out my multimeter. Definitely worth the buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh G",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "I love this thing!",
      "text": "Does a great job, and although it took a little to figure it out (even with the manual), it performs perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald A. Green",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "AWESOME LIPO CHARGER!",
      "text": "I must say I'm pretty impressed on how far Lipo charger technology has come, this is a really good charger and easy to use. LCD screen is great and managing options is a peace of cake and quick. Also love how it notifies me when the charging is complete. definitely a great charging tool. 100% would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Pazos",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "The go to budget charger",
      "text": "Great charger, been using it on 2S and 4S packs with no issues so far. Charges multiple types of packs and has options to check resistance and current state. Lots of bang for the buck with this charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Rose",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Works pretty much as expected",
      "text": "Works pretty much as expected. Can only discharge Prius cells at .5 amps so they take a long time. Get several if you are reconditioning a Prius battery.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180109
    },
    {
      "title": "A nice charger, although the menus are confusing to navigate",
      "text": "A nice charger, although the menus are confusing to navigate. I'm sure the more I use it the easier it will be. It came with a nice set of cables with various popular connectors. The 12V input is a definite plus.",
      "rating": 4.0,
      "verified": true,
      "author": "D. K.",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Great charger, balancer, discharger for Lipo's",
      "text": "Great Battery charger, balancer, discharger. I have been using it with no issues. For the balancing of the battery I would recommend getting an extension cable as most lipo batteries have a short balance cable",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "No other charger compares",
      "text": "This charger IS everything it has hyped up to be, I'm not sure where to start; it's simple to use, it's feature-packed, it's well built. The PC interface is designed well and plays well with the charger. I built custom battery packs and this iMax B6AC V2 is an irreplaceable charger to test and charge the packs.",
      "rating": 5.0,
      "verified": true,
      "author": "Souperman",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "quality charger",
      "text": "This works great charging multiple batteries with paralell charge board from 1s through 6s.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great charger, after a year of ownership I ran ...",
      "text": "Great charger, after a year of ownership I ran into a connection error, I thought the charger was done for. BUT apparently the charging cables crapped out, changed with new cable and working like a charm again. Try this first if you run into a problem, $5 fix",
      "rating": 5.0,
      "verified": true,
      "author": "E. Britton",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Worth the Money and Easy to Use",
      "text": "I love this charger. I didn't know much about using them but this one is definitely easy to use and worth the money. I use it to charge all my lipo batteries for my Blade Inductrix FPV and also my Tiny Whoop. I am very satisfied with this purchase and would buy from this seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "leo",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Works great. Simple design yet sturdy.",
      "text": "Works great. Balance the Lipo nicely and safely. This is genuine SkyRC unit, not the fake one that can be dangerous.",
      "rating": 5.0,
      "verified": true,
      "author": "CP_Watch_Review",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "easy to use",
      "text": "it is easy to select what type of battery and charge.",
      "rating": 5.0,
      "verified": true,
      "author": "zomb5540",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Packed full of features",
      "text": "This charger is amazing, so many features. I like the fact that I can see the voltage of the cells and the mAh being sent to the batteries. With a parallel charging board I was able to charge my 2 4s batteries together in 83 min",
      "rating": 5.0,
      "verified": true,
      "author": "William E.",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Basically does everything",
      "text": "What an excellent, high quality charger! Basically does everything for an excellent price. I watched American narrated videos AND read the manual. Luckily got skip over the LiPo section because all I needed was the Nimh section.",
      "rating": 5.0,
      "verified": true,
      "author": "HKMR762",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Worked for the first couple of times then started to ...",
      "text": "Worked for the first couple of times then started to give a invalid volt reading so I'm back to charging with only 1 charger",
      "rating": 1.0,
      "verified": true,
      "author": "rex",
      "helpful_votes": 4,
      "publication_date": 20170616
    },
    {
      "title": "Good one",
      "text": "Charges a little slow and it's a little confusing the menu setup. But its price was good so I can deal with it",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "great charger for all",
      "text": "Very easy to use, this charger is the perfect balance charger for those who are just getting into fllying, to those who have been in the hobby for years. This charger is recommend time and time again.",
      "rating": 5.0,
      "verified": true,
      "author": "Squid G",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Great value and quality",
      "text": "This is an original skyrc,it chargers all your types of battery, you will require different adapters, it has some adapters",
      "rating": 5.0,
      "verified": true,
      "author": "MG",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Great value multi charger",
      "text": "Easy to use, tons of functions, reasonable price - what’s not to like?",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Blumenfeld",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Great Charger For Your money",
      "text": "Love the product couldnt ask for more for what i paid for it i charge nihm and lipo on this charger real simole once you get the hang of it",
      "rating": 5.0,
      "verified": true,
      "author": "Juan lopez",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Best 4 button charger on the market",
      "text": "It's dead nuts accurate against my newly calibrated fluke multimeter. All the useful features you could want. I'm extremely happy with this charger. Buy here on Amazon and you know it will be authentic. Best bang for your buck",
      "rating": 5.0,
      "verified": true,
      "author": "R. Davila",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "LOVE THIS CHARGER and all its functions and capabilities",
      "text": "Genuine SKYRC iMax! LOVE THIS CHARGER and all its functions and capabilities",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony T.",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "it works now",
      "text": "its ok but there are problems that you may face. Like errors with batteries. you may need to lightly jump start certain batteries to get this unit to work with them.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "This a a great charger to keep you multi cell LiPo batteries balanced ...",
      "text": "This a a great charger to keep you multi cell LiPo batteries balanced and conditioned. I actually waited until I received this before i charged the batteries on my new quadcopter, start 'em right, keep 'em right!",
      "rating": 5.0,
      "verified": true,
      "author": "Clutchman001",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Good quality.",
      "text": "Had this several months. Easy to use, no issues. Makes it easy to take good care of my lipos.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian C.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Good charger so far",
      "text": "Good charger so far, only improvement it needs is, the buttons are low quality. Something a little better there would make this charger almost perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Camron",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Product just died",
      "text": "product was not fit for the purpose after 5 months it just started to display extemnal temp too high and you couldnot use it. All your contact details don't work is this so no one can complain especially when you are unable get in touch. I just want to return the item and get a replacement one. on 112-1384205-999427 Art Abbott 0274996748 NZ",
      "rating": 1.0,
      "verified": true,
      "author": "Mr Art Abbott",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "but so far so good. Works as should been in use for three ...",
      "text": "Genuine skyrc charger! Shipping took awhile comming from China, but so far so good. Works as should been in use for three weeks with no problems. Products comes with security authenticity sticker to prove genuine SKYRC product via web site. I will update if anything should change with the chargers performance.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "My Best RC Charger Yet!",
      "text": "Great features. Love the 110vac and 12vdc capability and 6amp charging. Shows total mah input when charging. And the variety of adapter cables is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Don S.",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Very good charger",
      "text": "Really good charger. Easy to use and with all features that I need. This one is authentic.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great charger, measures resistance",
      "text": "Great charger, measures resistance. If you need to charge multiple 4S batteries at once, I'd skip on this charger because the max wattage is 50. Amps = 50/[Battery Voltage] i.e. around 3 amps max charge rate.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Love this charger",
      "text": "Love this charger. I would also recommend picking up an extension balance cable and a fireproof bag for charging you lipos in. Make sure you read the manual carefully and do your homework before charging your batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Lar",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Dont waste money on the pricey chargers",
      "text": "Best charger on the market especially when your only spending 50 somthing bucks. Easy to use simple and get the job done multiple settings well designed",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Sherwin",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Five Stars",
      "text": "Great charger. Real one! All you can ask for works flawlessly!!!!! A must have ! Great seller!!!!! Dont hesitate",
      "rating": 5.0,
      "verified": true,
      "author": "ROBERT SOLL",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Its great -- would have liked a tamiya connector with it.",
      "text": "This is great. I only made it 4 stars, as i use it for airsoft, and wish it had a tamiya adapter in the box. It doest have alligator clips, and they work, but i am always a little nervous they may touch or bend the tamiya connection.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "restored my dead LiPo batteries",
      "text": "Brought 3 out of 4 overly discharged batteries back to life. I like that the power adapter is built inside the unit, unlike the mini version where you have to supply your own external power supply/adapter/brick.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "This is the real McCoy not a knock off, ...",
      "text": "This is the real McCoy not a knock off, charges the majority of my batteries provided adapters, check to see if one fits your batteries or you might have to buy separately. also AC or DC function come in really handy.",
      "rating": 5.0,
      "verified": true,
      "author": "NEZ",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Very nice charger.",
      "text": "I love it. Very easy to figure out, features are easy to access and manipulate, it came with all the required cords and adapters. I would recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "C. A. Jones",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "awesome",
      "text": "This product is awesome! As long as you buy the genuine one. I use it for batteries charging - works perfectly for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Storage feature makes this well worth it",
      "text": "I really like the feature for storing batteries. This has saved me from buying new batteries because of lack of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Lister",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "I like this charger",
      "text": "It operates from windows 10, you have complete control of the charger. I am very pleased I checked the accuracy against my Fluke 87 multimeter and it checks out perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "CAJR88",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Works great.",
      "text": "Have only had this for 4 months but it works as advertised, Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Five Stars",
      "text": "worth the money fast and versatile charges many different batteries",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Szelachowski",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Great for people new to the hobby or a great ...",
      "text": "Does everything i expected it to. Its a one channel, 50w 6A charger. I can do 1 or 2 1300mah 4s Lipo batteries at 1 C no problem. Itll charge a whole parallel board full of 4s, but it won't achieve 1c. Great for people new to the hobby or a great field / car charger",
      "rating": 4.0,
      "verified": true,
      "author": "Ben Hildreth",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "over charged error!",
      "text": "Shows over charged regardless what capacity you set! Tried on prius battery module on 6000-4000 capacities!",
      "rating": 1.0,
      "verified": true,
      "author": "Le",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "A very nice, inexpensive little charger",
      "text": "A very nice,inexpensive little charger. The only things I don't like about it are that you can't charge single cell (toy grade) batteries without an adapter, and that it still takes a lot of time to charge, even on FAST CHARGE, about an hour.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Good charger",
      "text": "Love this charger so glad I finally got this I'm able to charge my batteries faster than my stock charger",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Works perfectly",
      "text": "Awesome charger, must have, dont trust the knockoffs, spend little more",
      "rating": 5.0,
      "verified": true,
      "author": "Duane G",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Excellent charger - I use it for Lipo batteries",
      "text": "Excellent charger - I use it for Lipo batteries. I like the many options, especially the ability to status check and balance charge. It it very easy to use and the auto shut off feature once it reaches the max amount on balance charge is nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Works great, easy to program charged a big 12 volt ...",
      "text": "Works great, easy to program charged a big 12 volt jumps tarter battery and a lipo 2 cell, no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Five Stars",
      "text": "Only used once but worked great and it's authentic love it",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Great for my lipos",
      "text": "Works exactly as expected and better. Would definitely recommend to anyone needing a battery charger",
      "rating": 5.0,
      "verified": true,
      "author": "Ace Godfrey",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Works good so far",
      "text": "Nice charger easy to use. Seems to get very warm if not hot during use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "everything works very well and seems to be well thoughtout ...",
      "text": "everything works very well and seems to be well thoughtout, but it didn't come with enough adaptors to charge my 3 cell rc airplane battery and my traxxas slash rc cars NIMH battery. also there wasn't adequate explanation of the adaptors it did come with.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Excellent product. One needs to read the instructions carefully ...",
      "text": "Excellent product. One needs to read the instructions carefully but it is not rocket science and this charger is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Test taker",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "is better by far opus bt-c3100",
      "text": "Is not accurate in capacity or voltage lecture . is better by far opus bt-c3100. buying more opus bt-c3100.",
      "rating": 1.0,
      "verified": true,
      "author": "Pablo",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "B6ac// v2 charger/ tester",
      "text": "Just started using 1 of the 2 I ordered It's working great for all my different battery Testing.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "AWESOME",
      "text": "Awesome and easy to use love the fact it's pc programmable I might just buy the wifi adaptor.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean O.",
      "helpful_votes": 0,
      "publication_date": 20171111
    }
  ],
  "product_meta": {
    "title": "SKYRC B6 AC V2 50W LiPo LiFe LiIon NiMH NiCd Battery Charger Discharger",
    "description": "SKYRC B6AC V2 is the upgraded version for well-known iMAX B6AC. Compared with iMAX B6AC, it is more accurate and stable and also has some new features and functions. Users could set the terminal voltage by themselves and connect it to PC for PC control and firmware upgrade. What's more, users could also use it as Lithium Battery Meter and Battery Internal Resistance Meter. There are Automatic Charging Current Limit, Capacity Limit, Temperature Threshold and Processing Time Limit which makes the charger safer than V1. -SKYRC B6AC V2 is a high-performance, micro processor control charge/discharge station with battery management suitable for use with all current battery types, with integral equalizer for six-cell Lithium- Polymer (LiPo), Lithium High Voltage,Lithium iron phosphate(LiFe) and Lithium-Ion (LiIon) batteries; maximum 6A charge current and maximum 50W charge power.",
    "rating": 4.6,
    "feature_bullets": [
      "Genuine SKYRC iMax B6AC V2 Charger/Discharger",
      "Sold by Authorized Dealer"
    ],
    "specifications": {
      "Package Dimensions": "9.4 x 7 x 2 inches",
      "Item Weight": "2.2 pounds",
      "ASIN": "B01MZ1ZZ7Z",
      "Best Sellers Rank": "#22,924 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars341 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer": "SKYRC"
    },
    "categories": [
      "Hobbies",
      "Toys & Games",
      "Remote & App Controlled Vehicles & Parts",
      "Remote & App Controlled Vehicle Parts",
      "Battery Chargers"
    ],
    "price": 49.96
  }
}