{
  "website_summaries": [
    {
      "verdict": "This potent blend of natural stress-relieving ingredients will quickly give your mood a boost, but you'll have to reorder more frequently.",
      "pros": [
        "Contains 7 ingredients shown to help reduce stress and anxiety",
        "Users report seeing benefits in a matter of days",
        "Won't leave you feeling sluggish or tired"
      ],
      "cons": [
        "2 capsules per serving, so you're only purchasing a 30-day supply"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "the difference is amazing.  First time taking anything like this.",
      "text": "I was skeptical that anything could help with the overwhelming feeling I have constantly. This worked the day I took it. What a difference. I didn't realize how much it helped. I was driving home and thought? I got a lot done today. I mentally ticked things off my to do list and felt relieved. It was then I remembered I had taken one of these. I will take this as long as I need them what a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 70,
      "publication_date": 20170311
    },
    {
      "title": "My mood flipped",
      "text": "My mother and I split the bottle and she usually takes Xanax. These helped her just as much if not more. For one they r natural and no side affects. But for me I have been through welbutrin, lexapro, buspars, and the przac made me sick. I was tired of it. So I researched and found these. My 95% of bitchyness and 5 % niceness on a monthly basis flipped. I could tell the day I took it and so could my husband lol.",
      "rating": 5.0,
      "verified": true,
      "author": "sherry beasley",
      "helpful_votes": 27,
      "publication_date": 20170927
    },
    {
      "title": "Anxiety is gone!",
      "text": "Stress has been part of my life for years. After researching about multiple products this one seemed to be the most legitimate and it sure did! I’ve seen a 180 in a my life and thank Soothe Stress for the transformation. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "NHS803",
      "helpful_votes": 31,
      "publication_date": 20170221
    },
    {
      "title": "Impressed",
      "text": "Supplements tend not to work on me; much less anything close to the way their product description reads. So, when I find one that actually holds true to it's own claim, I like letting others know. If you're always on edge and unable to \"go with the flow\", this product may be worth trying. It's not a miracle worker. But until a real life, healthy, OTC version of NZT-48 exists, no supplement is. It is however, a good mix of quality vitamins with sound track records. I will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregg Peterson",
      "helpful_votes": 14,
      "publication_date": 20170523
    },
    {
      "title": "Weak Sauce",
      "text": "While some of the ingredients are well known for their relaxing agents the amount of then in this supplement is \"fairy dusting\". Should have looked up recommended doses before purchasing this for my sister, mother and myself. Neither of them had felt a change and me as well. After about a week i tried double and triple dose. Triple dose their seemed to be a bit of an effect relax, maybe a bit sedative.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 10,
      "publication_date": 20180423
    },
    {
      "title": "Saves me from attacks...",
      "text": "I can't believe how great these pills are. Now I don't deal with anxiety daily, but I am prone to bad attacks especially if something happens that saddens me or causes upset. I DO NOT take these on a daily basis, only when I'm having an attack and boy, they are miracle workers for me. They start working and calming me down within minutes and I'm so grateful for this. I'll always have these on hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Marleaubugatti",
      "helpful_votes": 18,
      "publication_date": 20170702
    },
    {
      "title": "I think I'm hooked!",
      "text": "I've tried quite a few different stress relief products over the last six months and this is my favorite to date! After taking it the first time I felt relief from my anxiety when I'm working on my free lance projects. Added this to my daily meditation!",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 23,
      "publication_date": 20170223
    },
    {
      "title": "I found the best use of it for myself is to help me ...",
      "text": "I started using this, along with Fused Focus, during this past tax season (I'm a tax accountant). It really helped me stay calm during the most stressful part of the season. I found the best use of it for myself is to help me sleep at night. It works much better than melatonin and it's nonaddictive, like prescription drugs can be. I strongly recommend this product for anyone who has trouble sleeping or needs help during the day to ease the stress.",
      "rating": 5.0,
      "verified": true,
      "author": "CPA Princess",
      "helpful_votes": 11,
      "publication_date": 20170526
    },
    {
      "title": "It does work",
      "text": "I just purchase this supplement to see if it can help me with my anxieties and stress I been having. I am on vacation in Miami FL where everything goes 100 miles an hour. I took one of the pills yesterday after my anxiety was increasing due to the fact that we so much to do this weekend. I must say, it did help calm me down and relax. So I tried it again the next day, and it calm me down. I hope it can continue to help me in this weekend since we have so much planned, I do recommend this supplement. Just understand it may not give everyone the same effect right away like it for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Dagrin ",
      "helpful_votes": 8,
      "publication_date": 20170512
    },
    {
      "title": "Shows Possibilities",
      "text": "Only been using it for about a week now but I think it is helping with my anxiety issues. I would normally say I will continue using but the company has me concerned as to its future. Amazon notified me that it can not contact them. That the email address given doesn't work and while I tried to do what the stamp on the bottle said to do regarding obtaining a \"free\" bottle, nothing went through. So what does this mean for the future of the company?",
      "rating": 4.0,
      "verified": true,
      "author": "patches",
      "helpful_votes": 2,
      "publication_date": 20190825
    },
    {
      "title": "So far it is helping",
      "text": "Using this product seems to be aiding in my quest to feel less anxiety and gain back my short-term memory and word finding difficulties I have been experiencing increasingly the past couple of years. I have not had any benefits in my lack of sleep, but I believe the pain I'm currently experiencing is having more of a factor in that than this is able to overcome. I hope to receiving added sleep benefits once I get relief from the pain I'm having that keeps me from sleeping longer than a 90-120 min stint at a time. No ill effects from it either. No side effects or interactions with medication I take.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer MacGregor",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Works great!",
      "text": "Love this product. I take it in the evening before dinner. Im able to sleep a full night without waking now. Also havent had any anxiety attacks since ive started. Side note...i have had less irregular heart beats since ive started. Highly recommend trying this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20170501
    },
    {
      "title": "Good stuff",
      "text": "I have noticed that my anxiety has eased up since using this. As advertised it won’t sedate you, you really won’t feel anything in particular but that also includes anxiety so that means it works. It’s not a prescription drugs (WHICH I LOVE) so you’ll possibly have your moments but they aren’t as severe!",
      "rating": 5.0,
      "verified": true,
      "author": "Cam Williamson",
      "helpful_votes": 5,
      "publication_date": 20180224
    },
    {
      "title": "Fantastic for sleep",
      "text": "As someone who has mild anxiety/insomnia, I found this product to be amazing. I take 2 capsules before bed and get much better sleep than I do with melatonin. No more tossing and turning at night and I stay asleep all night. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Yuriy",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "Waste of money",
      "text": "Returning asap....complete waste of money. Felt more agitated as did my husband.",
      "rating": 1.0,
      "verified": true,
      "author": "Tammy Augspurger",
      "helpful_votes": 9,
      "publication_date": 20171130
    },
    {
      "title": "HIGHLY RECOMMEND !  This product is immediately effective, providing sense of calm",
      "text": "I knew that I felt immediately better and calm after taking this supplement the first time. I then passed on 1/2 of a bottle to my daughter who was in the middle of a very stressful time at work. She also reported to me an immediate relief. This all natural product provides general calm sense of wellbeing and relief from anxiety. I use it daily in my stressful work as an HR Manager.",
      "rating": 5.0,
      "verified": true,
      "author": "Denice McFadyen",
      "helpful_votes": 3,
      "publication_date": 20190202
    },
    {
      "title": "Reduces Anxiety and Stress Level",
      "text": "As a current high school math teacher I was curious to see whether this product would make a difference in my stress level. I have been taking this product for about three weeks now and I can tell a difference. I am an anxious person and I like things to go as planned. You must be flexible in a high school setting, though. I can tell this product has helped keep me calm in moments that previously would have bothered me.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Montgomery ",
      "helpful_votes": 2,
      "publication_date": 20181105
    },
    {
      "title": "One of the best I've tried!",
      "text": "I have tried multiple brands, I love going the more natural route with these kinds of things, you don't feel sluggish or tired. I just take two when Ik it's going to be a busy day. A few times it did not seem AS strong. But it could just be I'm extra stressed. Who knows, I've had pretty great results with this and look forward to buying again in the future!",
      "rating": 4.0,
      "verified": true,
      "author": "Anjucco",
      "helpful_votes": 5,
      "publication_date": 20170410
    },
    {
      "title": "Did not work for me at all.... until I upped my dose",
      "text": "Did not work for me at all. I've taken Anxie-T before which worked wonders...I was hoping to find a cheaper version buying this brand. Very disappointing. **update I will say this still does not work as well as other brands out there however after some research on the amount of ashwagandha that's actually effective, this supplement did not have a high enough dose per serving. I upped my serving to 3 tablets and felt a substantial improvement in my mood as opposed to just taking 2 tablets. The are just brands out there that have more ashwagandha per serving which seems to work better for me personally.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Calming and Relaxing",
      "text": "In the middle of trying to adjust to online classes, I found myself needing something to help me relax. I tried Vitalfuse's Sooth Stress supplement in the hopes that it would help me fall asleep better, but it did much more than that. I found myself a lot less anxious during the day and it really helped me get my work done much faster and with a lot less stress. It also did not have notable side effects such as tiredness, which is something I have experienced with other products. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "This stuff really works! Game changer!",
      "text": "I've been struggling with anxiety for about a year now and am trying out different natural supplements to counteract what I feel is a physical response happening in my body - this stuff does an amazing job of keeping me calm throughout the day! It really does work. I would feel a dip in my mood/anxiousness in the afternoon and after taking this daily I can say that I don't really feel that dip anymore. It's gradual and slight but it really does make a big difference. I plan on taking this long term along with some other amino acid supplements. Game changer!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Anxiety who?",
      "text": "I’m a very anxious person and recently life has been very uncertain, which doesn’t help calm me down, it’s also caused me to have trouble sleeping. I decided to try out these little “miracle pills” and I’m so glad I did! I’ve been sleeping so much better (through the night) and I wake feeling relaxed and focused. I don’t take them every night, just on days when my anxiety is higher, I also tried taking them during the day but they made me tired. I highly recommend if you have anxiety or trouble sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie ",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Literally does NOTHING",
      "text": "This has to be filled with flour, because these pills literally do nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Krys C",
      "helpful_votes": 7,
      "publication_date": 20171027
    },
    {
      "title": "Excellent supplement with no side effects",
      "text": "Great product. Helps me with anxiety and stress by keeping me calm. Had no side effects. Love this product. This is now part of my daily supplement along with multivitamins.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyl2123",
      "helpful_votes": 5,
      "publication_date": 20170712
    },
    {
      "title": "Love, love, love it!",
      "text": "Love this stuff! I have suffer from anxiety and I noticed a major difference when I started taking this. I can talk to a person I hardly know without an attack. I can also chill out at home without my mind going crazy. It's a lifesaver for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171118
    },
    {
      "title": "Made it worse by the end of the day",
      "text": "I want to say 3 stars because yes, I’d did work, but a little too much it seemed. It would calm me down, but by about the 6th hour, I noticed it was like all the stress of that day actually all came and piled back at once as it died down and I would just have a panic attack for no reason.",
      "rating": 3.0,
      "verified": true,
      "author": "Chyann H.",
      "helpful_votes": 3,
      "publication_date": 20180125
    },
    {
      "title": "Worked the first day!!",
      "text": "I didn’t know what to expect from this but I had seen so many good reviews that I thought I would give it a try. I was pleasantly surprised when this worked this first day. I’ve been extremely stressed out because several bad things happened simultaneously and, even though I take anxiety medication and medication for sleep, I was waking up in the middle of the night and not being able to go back to sleep. This stopped that right away. I’m actually hoping that, once things calm down, I can stop taking the benzo I current take and just use this instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Christopher",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "I feel a difference",
      "text": "When I don't take this I feel like punching someone in the face :) It helps calm my anxiety as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelica",
      "helpful_votes": 4,
      "publication_date": 20170523
    },
    {
      "title": "Works well!",
      "text": "I've only been taking these for a few days- but already find it to be helpful. Before, I was only taking L-Theanine alone, but the addition of GABA is great. This was recommended to me by a friend who takes the same supplements and prescribed medicines as I do and I'm so glad I tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "I really like this product",
      "text": "I really like this product. It relaxes me in a subtle way. It does not make me sleepy or drowsy but calm. I wish I started using it earlier. Will continue using this for a long time. So, it is great that this has natural ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "Hoda",
      "helpful_votes": 4,
      "publication_date": 20171002
    },
    {
      "title": "Efficient and Soothing Focus",
      "text": "I have been taking Soothe Stress off and on since receiving it about a week and a half ago, and every time I take it I feel at ease, focused, and at peace with whatever it is I'm doing. I do a lot of technical writing and speaking, it helps me accomplish both efficiently.",
      "rating": 5.0,
      "verified": true,
      "author": "GrandSushi",
      "helpful_votes": 6,
      "publication_date": 20170222
    },
    {
      "title": "Calm Enhancer",
      "text": "After using the product over the past month, I can tell a difference in my overall sense of calm. Will buy again!",
      "rating": 4.0,
      "verified": true,
      "author": "Mattie2016",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great stress reliever!",
      "text": "I've been taking this for several weeks now and have really noticed a difference in how I feel. I feel more calm and can relax much easier, things don't seem to bother me or get to me nearly as much as they usually do.",
      "rating": 5.0,
      "verified": true,
      "author": "AJay",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Must buy for a anxiety.",
      "text": "Must have if you have a stress and anxiety issue. It makes a huge difference and is better than $50+ products I have used over the years.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Byler",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Significant improvement in mood",
      "text": "Took this last 2 days and I'm already noticing positive changes to my mood! I typically feel a bit jittery and slightly anxious after drinking coffee and around the evening, but this has helped relieve that. I'll update any changes after finishing my first bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "jz43",
      "helpful_votes": 3,
      "publication_date": 20181112
    },
    {
      "title": "Helps me stay calm and anxiety attack free!!!",
      "text": "I started using these as my anxiety had gotten much worse this year with attacks occurring more often then normal and I have to say these are a life saver. They definitely helped me stay much more calm and comfortable during the work day and I’m excited to keep using them! I’ve read great things about Ashwaghanda Root and I was excited to see that as a top ingredient in these!",
      "rating": 5.0,
      "verified": true,
      "author": "kari",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Seems to work",
      "text": "I wanted something natural for anxiety and this seems to be working. I have just started into my 2nd month so only time will tell if it keeps working.",
      "rating": 4.0,
      "verified": true,
      "author": "Wag D'Tail",
      "helpful_votes": 3,
      "publication_date": 20170411
    },
    {
      "title": "A life saver!",
      "text": "I cannot say anything but good things about this supplement. My boyfriend and I used to take Advil pm every night. We have been taking the Vitalfuse soothe stress supplements for about three weeks now and we have stopped taking the Advil pm, for good! I was skeptical in the beginning because I have tried so many different supplements for anxiety and sleep. I have recommended this product to so many people so far! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn Ronga",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "No More Anxiety!",
      "text": "Since I've started taking this product (three years now) I have not had one panic attack. I actually feel like a normal human being around groups of people now. This product does exactly what it says.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Chamberlin",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Stress free = better at school",
      "text": "Took this during my first round of exams in college and it calmed me before every exam. Usually my stress gets in the way of my performance in school but for the first time I felt confident going in! I get my scores back in a couple weeks - excited to see a few good grades coming in!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170223
    },
    {
      "title": "Herbal Relief",
      "text": "Great product - It seemed to me that it worked almost immediately. I felt relaxed but without the sedated or numb feelings from taking anti-depressants. I'm happy with the resutls.",
      "rating": 5.0,
      "verified": true,
      "author": "Silent til I speak",
      "helpful_votes": 3,
      "publication_date": 20170516
    },
    {
      "title": "So so",
      "text": "I'm still on the fence about this. I can't tell if it's doing me any good, but I'm going to keep taking it",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Has helped",
      "text": "Has helped with the stress in the early mornings of work. I will continue to try it out and see how it goes with my next bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "tate",
      "helpful_votes": 2,
      "publication_date": 20170929
    },
    {
      "title": "Really helps with stress, highly recommend!",
      "text": "My niece told me about Vitalfuse Soothe Stress blend recently and about a week in to not being able to leave my house, I decided to order some to see if it really helps with stress. I can’t say enough about how much calmer and better I feel since I began taking it, I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Worked great.",
      "text": "I needed a little something for a trip I was taking with my autistic daughter to keep me grounded. This did the trick. I was very anxious to take care of her by myself in big crowds and on an airplane. I was glad I took the supplements as they calmed me down and helped me not get so frustrated with her. It made for an enjoyable time for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jody N",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Awesome. Deff recommend",
      "text": "I absolutely love this. It has helped tremendously. I've too prescription anexity meds for over a year but after losing my insurance and my normal meds costing $200 for a month supply. No longer doable or able to purchase that. After reading reviews on tons of OTC anexity meds I decided to try this. I was amazed. Just with one dose it worked. Amazing. Will be using this meds on a daily basis and for months to come. Thank you so much for the great product.",
      "rating": 5.0,
      "verified": true,
      "author": "KBurne",
      "helpful_votes": 13,
      "publication_date": 20170319
    },
    {
      "title": "Helps...alot",
      "text": "Huge difference. Helps you focus on work and work alone. Keeps nagging thoughts off your mind. Best part is this is all natural. It will tend to make you move slow, keep that in mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170323
    },
    {
      "title": "Keeping me calm",
      "text": "I started using this product just before the covid19 pandemic started causing worry in the US. While I'm still a cautious person I'm finding that I am able to remain level headed. I might also add that my home is currently at a state of 2/3 demolition and we are still living here as we remodel/rebuild, yet I'm calm, cool and collected.",
      "rating": 5.0,
      "verified": true,
      "author": "SPDRIP73",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Best combo so far for anxiety",
      "text": "We have tried many OTC supplements to help my husband with anxiety and this one seems to work the best. He even asked me to order some more. This is our 3rd bottle. It doesn't make him sleepy and he feels better when he takes it in the morning before work.",
      "rating": 4.0,
      "verified": true,
      "author": "not so fast",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "I wanted something that didn’t cause me to become like a robot or effect my ability to stay awake",
      "text": "I have had anxiety for a while (stressful job). I wanted something that didn’t cause me to become like a robot or effect my ability to stay awake. I’ve been taking it for a week now and haven’t felt overwhelmed or any anxiety. Will definitely be buying again",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Conkright",
      "helpful_votes": 2,
      "publication_date": 20180511
    },
    {
      "title": "Stress is down, definitely works!",
      "text": "I take one in the morning and evening. When I took 2 at once I started getting headaches. I have no issues when I space them apart.",
      "rating": 4.0,
      "verified": true,
      "author": "J.Ward",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "This supplement  has helped our relationship and relief of job stress",
      "text": "I gave this product to my husband, he has a stressful job and wanted something natural and wouldn't be addicting. I highly recommend this product for anyone who has anxiety and needs relief. I've been using the Fused Focus product for myself, my job requires attention to detail and I'm seeing a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynda Baugh",
      "helpful_votes": 2,
      "publication_date": 20170908
    },
    {
      "title": "Very mild, gentle effect. Helps take the edge off.",
      "text": "Very mild, gentle effect. Helps take the edge off. Not a strong or profound effect, but I like it. No side effects, no bad experiences. I see no reason not to give it five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Zootal",
      "helpful_votes": 2,
      "publication_date": 20170510
    },
    {
      "title": "This stuff definitely works!",
      "text": "I have tried lots of other supplements for stress. Most not having any effect. After the first month of using this supplement daily, I had a huge shift in energy and mood. My wife also stated she noticed the difference. Less snappy and more relaxed is what she told me. I will continue this supplement.",
      "rating": 5.0,
      "verified": true,
      "author": "squiggie",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Really works as promised!",
      "text": "Love the supplement. Helps me manage day to day life without taking rx drugs. Just relaxes you enough to take on the day. Does not make you sleepy. Non habit forming. I take it as needed. Several days in a row and is stress is low I don’t take it at all! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "R.S",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "No Drowsiness!",
      "text": "Works wonderfully! I've dealt with severe anxiety for the majority of my life and the prescription meds I used to take just made me tired. This helps keep me calm without making me drowsy.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley",
      "helpful_votes": 2,
      "publication_date": 20180308
    },
    {
      "title": "Eases my stress",
      "text": "I've spent many years researching natural ways to cope with my stress, anxiety, and panic disorders. This supplement has been a lifesaver. I usually take it late morning before lunch and it has helped tremendously.",
      "rating": 5.0,
      "verified": true,
      "author": "Niki Livingston",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "What's in this bottle works!😊",
      "text": "Thank you this product really works sleeping much better now...😊",
      "rating": 5.0,
      "verified": true,
      "author": "matthew bologna",
      "helpful_votes": 2,
      "publication_date": 20180517
    },
    {
      "title": "I sleep well and I find the next day I am in better control of my anxiety",
      "text": "I've been taking it almost a week a couple hours before bedtime. I sleep well and I find the next day I am in better control of my anxiety. I did have a very mind attack 3 days in but not anywhere near as bad as normal.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandrite13",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Never pressured",
      "text": "This product has stopped me from having the shakes every time someone talked to me out of the blue and I don’t mind being the spotlight anymore during class!!! For group presentations, I don’t feel as much pressure as I had when I was not taking the supplement! This supplement also helps me to focus more in school, which is an even bigger plus in addition to helping with my anxiety!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 2,
      "publication_date": 20170906
    },
    {
      "title": "Natural",
      "text": "I've always dealt with anxiety throughout my life. 5 months after delivering my second baby I started noticing anxiety really bad. I wanted to stay away from medications, as I am breastfeeding. This product has helped me out tremendously and it's all natural.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Guerra",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "It's been helpful!",
      "text": "I do feel like it has helped manage my stress! Maybe no as glorious as we all would hope, but it definitely helps. I seem to be in a brighter mood more and more. The only problem I have is with the pill size. I'm terrible at taking pills, so these are just a little big for me! But other than that, I cannot complain about the product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Stress and anchor relief!!",
      "text": "It does really relief my anxiety and stress. I could enjoy better my day. It also helps me to sleep better.",
      "rating": 5.0,
      "verified": true,
      "author": "Lis",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Doesn’t make me sleepy!",
      "text": "Gaba has allowed my heart to settle and be more IN the moment with less anxiety. Love it!!",
      "rating": 4.0,
      "verified": true,
      "author": "GSC",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Incredible",
      "text": "One word....incredible!!! I haven't felt this stress free in years. I'm so amazed with the results, I just ordered my second bottle. I've been telling everyone how wonderful it is, and the best part is the natural ingredients without putting chemicals in my body to help with anxiety/stress. I will continue to be a forever loyal customer to this company and brand.",
      "rating": 5.0,
      "verified": true,
      "author": "mmsolutions",
      "helpful_votes": 8,
      "publication_date": 20170424
    },
    {
      "title": "VERY good for people living stressful lives.",
      "text": "I lead a very stressful life and this really helps. ii does not make me jittery but gives me energy needed to make it through the day. This works just as well as Adre-core at a better price point. Now I'm waiting to see if it will lower my cortisol levels.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Thomas",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Relief.",
      "text": "I have a lot of anxiety. This comes from being a mom and getting my masters. This product has been amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Hayden Guest ",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "It’s all herbal no side effects and very effective",
      "text": "This supplement has helped me with my bad anxiety and high bp not only that it’s helped with my urination I’m not going so frequent through the night feel excellent and lot calmer",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "Calm Without Drowsiness",
      "text": "As a stressed college student, these are a life saver! When I am overwhelmed, I can take this to have a naturally calming effect. I receive no negative side effects and these do not make me drowsy. I recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "Hadley Johnson",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Exactly as advertised",
      "text": "I struggle with digestive issues related to stress and after trying everything, this works! From the first dose, there is a sense of calm and wellbeing... give it a try!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Cahal",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Wow! This really did help my stress and anxiety levels",
      "text": "Sometimes life gets really stressful and my anxiety kicks in. When I started using this it really helped with both. I felt great and calm. I really do recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Marjorie",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Effective",
      "text": "Smooths things out with regard to anxiety. No side effects for me.",
      "rating": 5.0,
      "verified": true,
      "author": "BarbiAnn",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Stress less and breathe",
      "text": "You really see a difference in a day, working 2 jobs and taking care of 2 dogs and a 5 year old is a lot. I was able to take a breath and get everything done without freaking out for a second. Helps me stay focused and just breathe.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole kinowski",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Does wonders",
      "text": "I have tried a few different stress relief supplements. This one is actually making a difference. I am glad i finally found something that worked for longer than a month.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Good natural alternative",
      "text": "Works great, I only take 1 capsule a day and there is a definite difference in my anxiety levels.",
      "rating": 5.0,
      "verified": true,
      "author": "A.L.W.",
      "helpful_votes": 4,
      "publication_date": 20170630
    },
    {
      "title": "Great for high energy husband.",
      "text": "Works for my high speed constant on the go husband. He takes at bedtime to wind down and sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Kait",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Grest product and it has helped my stress considerably. ...",
      "text": "Grest product and it has helped my stress considerably. I'm ready to stop my prescription anti-depressant and stick with Stress Support.",
      "rating": 5.0,
      "verified": true,
      "author": "Lolaqueen",
      "helpful_votes": 3,
      "publication_date": 20170414
    },
    {
      "title": "I did notice a calming difference, not night and ...",
      "text": "I did notice a calming difference, not night and day, but worth taking on a regular basis. Give it a shot, it may work for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis G",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Seems to be calming!",
      "text": "I'm on day three of this stuff and it really does seem to be helping. I was previously taking ashwaganha and magnesium separately, but wanted to try something that had both so I would be taking less pills at a time. So far, these seem to do the trick!",
      "rating": 4.0,
      "verified": true,
      "author": "Molly Adam",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "10/10",
      "text": "From someone that experiences anxiety, these pills definitely provide me with a more calming feeling and keep my energy up throughout the day. I have only really used them when necessary but for anyone else that has anxiety I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "gabby",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "So relaxed",
      "text": "I just started a new job recently and have been over worked, over stressed, and haven't gotten nearly enough sleep. These pills did the trick and have made my life so much more peaceful and relaxed.",
      "rating": 5.0,
      "verified": true,
      "author": "Tori Nelson",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Less stress, sleeping better",
      "text": "I’ve been taking the supplement for two weeks. I take one capsule in the morning before leaving to work and one at night before going to bed. I’ve noticed lower stress levels and better/longer sleep quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Bere H",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Works day one. Will see about long - term.",
      "text": "I will need to update my review after more days. After taking my first dose on the first day - within 10 minutes I truly did feel my mind enter into more of a “flow” state. Which is the optimal goal. I will update my review after more of a long-term period to truly see if this stuff works like I’m hoping it will now!",
      "rating": 5.0,
      "verified": true,
      "author": "Shane",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Great stress and anxiety treatment",
      "text": "Just ordered my 3rd bottle I have been talking sporadically and have noticed it really helps those times of high stress. I have been having increasing anxiety issues and now taking it regularly to help all the time, not just on occasion. I love it’s not prescription meds.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "100% satisfied",
      "text": "This works great I have really bad anxiety and seizures this definitely is worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "This supplement is awesome!",
      "text": "Three of my family members use this! It is great for anxiety anytime, and it works. It does not make you sleepy. I do take mine at night, though. It helps me to relax before I go off to bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya Ross",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Ingredients",
      "text": "My daughter uses this product for anxiety but when we got the supplements the bottle and pills were really hot and we hoping the heat doesn't affect the quality",
      "rating": 3.0,
      "verified": true,
      "author": "michael costanzo",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Feel better faster",
      "text": "I test hundreds of supplements for performance benefit sake and this supplement is one that does what is says. I have taken these before workouts, competitions and sleep. And to sum it up, best workouts best races best sleep. Would recommend !!",
      "rating": 5.0,
      "verified": true,
      "author": "george",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "I’m sold",
      "text": "I started taking this in an effort to improve my mood and I’ve definitely seen results! It’s hard to specifically say that it was this product as I’ve also added more exercise and and a few other things. But I’ll be continuing the product for sure.",
      "rating": 4.0,
      "verified": true,
      "author": "Darcie V.",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "It works!",
      "text": "My husband works long hours and comes home all wound up and has trouble relaxing and falling asleep. I found this product and got it for him to try, and I have to say, I’ve seen an improvement. He seems more mellow and falls asleep quicker than I’ve seen in a while.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie k",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Safe ingredients",
      "text": "This is how the bottle packaging looks like now. I like how the supplement facts has Chamomile extract which is common for aromatherapy used to lower stress level",
      "rating": 5.0,
      "verified": true,
      "author": "Yani Patindol",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Worth it!",
      "text": "Great product! Delivery was super quick, and using these supplements has helped me to relax! Definitely would recommend these to anyone looking for an easy way to help reduce the stress of the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170307
    },
    {
      "title": "Great product, works for me!",
      "text": "I am pleased with this product. I take this midday to ease anxieties that arise due to having multiple demands. I do not feel overly tired after taking this product - just relaxed. I have found that falling asleep comes easier, though.",
      "rating": 5.0,
      "verified": true,
      "author": "shopper",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "I've been using this for a couple of months. ...",
      "text": "I've been using this for a couple of months. It has been working. I've definitely noticed a difference using this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Hemphill99",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Great Value, Highly Effective!",
      "text": "I love that this combines several supplements that I used to take separately, and works just as well, if not better! Great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "The Village Schoolhouse",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Works great and is natural!",
      "text": "I highly recommend trying this product! it is the best I have come across and really helps my teenage daughter through her anxiety spells.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa M",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Pretty Awesome",
      "text": "I don’t drink this everyday, but when I have it really helped my mood change! For me personally, it’s for when I’m freaking out .. When I feel my heart beat race super fast and my breath shortens up I know I need to sit down and calm down. I take this and I feel a bit lighter, nothing crazy whatsoever!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Adalgisa",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Helpful with stress and axiety",
      "text": "I find this helps take the edge off of stressful days. its like a small wave of relief.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenny R. ",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Seems good so far!",
      "text": "In a situation where I would normally be angry I was able to handle it well. Seems to be a good product so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Emi Dee",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Love!",
      "text": "Definitely needed this right now! I take these before bed and they help calm me down enough to be able to go to sleep at a good time. Love love love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200313
    }
  ],
  "product_meta": {
    "title": "VitalFuse Natural Calm Anxiety Relief with Ashwagandha and Valerian Root for Cortisol Management; Non-GMO, 60 Capsules",
    "rating": 4.4,
    "feature_bullets": [
      "SOOTHE YOUR STRESS. Stress relief can be controlled! Thyroid support & adrenal support brain supplement for a mood boost. This anti depressant acts as a cortisol manager for adrenal fatigue and natural anxiety relief.",
      "STRESS RELIEF SUPPLEMENT. Mood enhancer and ultimate anxiety relief for adults. With our natural energy supplement and cortisol calm herbs, immune support and even cortisol support are easily attainable!",
      "GABA CALM. Many stress supplements lack an important anti anxiety ingredient. Our Soothe Stress contains the GABA supplement acting as a muscle relaxer to help with social anxiety and adrenal fatigue.",
      "ANXIETY SUPPLEMENTS. Give your alpha brain a nootropic boost and a hormone balance with natural ashwagandha root and valerian root extract.",
      "CORTISOL BLOCKER FOR WEIGHT LOSS WOMEN. Ladies! This is a huge boost of this anxiety supplement. Help your adrenal health be at its best. It even acts as a libido booster for women. These are definitely happy stress pills!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "3.9 x 1.8 x 1.2 inches; 2.4 Ounces",
      "Date First Available": "January 5, 2017",
      "Manufacturer": "VitalFuse",
      "ASIN": "B01N7QIQYJ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Vitamins & Dietary Supplements",
      "Herbal Supplements",
      "Health & Household",
      "Health, Household & Baby Care",
      "Chamomile"
    ],
    "price": 19.75
  }
}