{
  "website_summaries": [
    {
      "verdict": "The best budget, manual way to massage the calves and other leg muscles with ease.",
      "pros": [
        "Beaded design digs into the calves as the stick rolls across the skin",
        "The large surface area hits an entire cross section of muscle at once",
        "Good for other muscles as well"
      ],
      "cons": [
        "Solid beads can cause pain in overly tense muscles",
        "May tire out the arms and hands"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Value & Performance",
      "text": "I've been using this roller for several days now. I run 20 - 30 miles a week and this roller really helps with recovery. Some reviews have mentioned this pulling leg hair but I (41 Male) haven't had any problems with that and I usually use it directly on the skin with no clothing between the roller and my legs.",
      "rating": 5.0,
      "verified": true,
      "author": "ia_hwks",
      "helpful_votes": 18,
      "publication_date": 20181216
    },
    {
      "title": "Highly recommend! Study, effective & affordable.",
      "text": "As a massage therapist I highly recommend this product! It's effective ans you can use it pretty much anywhere on the body. I use it on myself as well. It's worked wonders on my IT bands, inner thighs. My husband uses it on his arms and shoulders. This is an absolute must have! It's easy to use and well priced. All others I looked at were either cheaply made or super expensive. Im grateful I found this one, it's sturdy ans has held up well over daily use!",
      "rating": 5.0,
      "verified": true,
      "author": "Tawnie H",
      "helpful_votes": 19,
      "publication_date": 20190914
    },
    {
      "title": "Yeeees!...just right for this big guy.",
      "text": "Excellent price! Works great. 5'11\" here, about 250 lbs. Big calves. Perfect for working my calves. I relax the foot and muscles for best results, propping my heel gently up on my ottoman, bending at the knee. Can work all sides and angles and get deep into the muscle in that position.",
      "rating": 5.0,
      "verified": true,
      "author": "SG",
      "helpful_votes": 15,
      "publication_date": 20180717
    },
    {
      "title": "foam roller",
      "text": "Just the thing for \"doing\" the very sore muscle on my thigh. Someone at a pharmacy dept at a grocery store recommend me use a foam roller. This one is very well made and designed.",
      "rating": 5.0,
      "verified": true,
      "author": "customer",
      "helpful_votes": 7,
      "publication_date": 20181102
    },
    {
      "title": "Helps breakdown the fascia and pin point hard to reach places.",
      "text": "I have had back surgery and in order to reach the hard to get areas of my back this is the item that was finally able to get it! I use it daily to breakdown the knots and more importantly the fascia that’s between the muscles. Not only does this act like a roller but also a pressure point self massager. I strongly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 14,
      "publication_date": 20180509
    },
    {
      "title": "Great for travel and home!",
      "text": "This is just what I needed to take on a trip! I have several different modes of manipulation that I use at home but were all too large to pack. Now that I'm home I find I'm still using Sportneer 18 \" Muscle Roller Stick Body Massage Sticks Tools-Muscle Roller Massager. Really helps and I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 12,
      "publication_date": 20170409
    },
    {
      "title": "But hair is get caught in the rollers so where bike pants",
      "text": "As advertised. While rolling it on my leg my leg hairs get caught up inside the rollers and it pulls at them. Not so comfortable. So I put on Long biking pants and then the product works as advertised",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Cantin",
      "helpful_votes": 7,
      "publication_date": 20180329
    },
    {
      "title": "A must have!",
      "text": "If you play sports or just would like relief from tight muscles, than this is the tool you need. Simple to use and really works those knots out. Recommend watching a video on the trigger points or where to hit for the best results.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristopher",
      "helpful_votes": 11,
      "publication_date": 20200207
    },
    {
      "title": "Five Stars",
      "text": "I have a horrible knot in my shoulder and this helps a lot with working on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel R. Wilson",
      "helpful_votes": 9,
      "publication_date": 20180305
    },
    {
      "title": "Far superior to the Foam rollers",
      "text": "I started jumping rope at the age of 64 as its about the only cardio I can do as my knees are so messed up. It is a bit tough on your calves if you have never jumped rope before Your calves get very very sore As apart from your wrists they are the only muscle in your body that you use This product helped so much with my sore calves , so I use it before and after I jump rope as it has helped immensely Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "martin gingell",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "10/10 recommend",
      "text": "I use this for stretching/rubbing out my legs. The one great thing about this specific roller is that the little rollers don't have space between them. With other leg rollers I have had problems with the rollers having space between them and then pinching skin. That is not the case for this leg roller. Works great! Super slim and little to so makes for easy storage when not being used.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Muscle roller stick",
      "text": "I used this after hip replacement for IT band bursitis. Have to be careful and not use too much pressure or it makes the pain worse",
      "rating": 4.0,
      "verified": true,
      "author": "sharon reiss",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Excellent product!",
      "text": "Both my mom and I often get cramps, or tightness in our leg muscles. Rather than carry the large foam roll on car trips, this will be perfect to take with us. I have used it several times, and very much appreciate the ease and smoothness with which it rolls on my muscles.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose L Machayo Roper",
      "helpful_votes": 7,
      "publication_date": 20170503
    },
    {
      "title": "Good product worth the price",
      "text": "Works well. Little harder than I expected bc I’ve used the foam rollers before. This is a hard plastic type but still does the same thing. You do not have to use much pressure to have deeper massage. Great for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "KDrake",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Great addition to my Warm up Routine",
      "text": "I needed something to help me warm up my leg muscles before my daily walk. This takes about 1 minute and I'm good to go! Great Value too. I also use it before my stretching routine. So simple but so effective!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Miller",
      "helpful_votes": 12,
      "publication_date": 20200331
    },
    {
      "title": "Definitely awesome product for price!",
      "text": "Husband loves this product. He is in the military so working out and sore muscles is apart of his life but since we have purchased this he now enjoys the ease of loosening his muscles up and taking the pain away with using this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Harley  L Ramirez",
      "helpful_votes": 9,
      "publication_date": 20200301
    },
    {
      "title": "It’s amazing so far",
      "text": "I bought this because, I tend to have really tight quads. I use this after a workout and its amazing it helps me stretch my muscles and relax them. I totally recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lorena Angel-Bello",
      "helpful_votes": 6,
      "publication_date": 20200624
    },
    {
      "title": "good item",
      "text": "This is exactly what I was looking for. Nice color, smooth rolling, relieving pain in legs, arms, neck, back and shoulers. Like it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "lotus lu",
      "helpful_votes": 8,
      "publication_date": 20190415
    },
    {
      "title": "Works really well. Small enough to fit in a ...",
      "text": "Works really well. Small enough to fit in a regular size backpack and long enough to use on several different areas of the body.",
      "rating": 5.0,
      "verified": true,
      "author": "JOSIE BARELA",
      "helpful_votes": 9,
      "publication_date": 20180516
    },
    {
      "title": "easy to use, handy",
      "text": "easy to use. I keep it near the computer and use it often during the day. it seems to reduce my lower legs cramps by massaging the muscles. the price is also right.",
      "rating": 5.0,
      "verified": true,
      "author": "Frenchie",
      "helpful_votes": 2,
      "publication_date": 20200302
    },
    {
      "title": "Good quick massage tool.",
      "text": "Great tool to use for a quick roll out session of your sore muscles. Bought this to try and loosen up calf muscles for plantar fasciitis relieve, doesn’t get as deep as I’d like it to but still a good tool to use. I found a lacrosse ball is able to get in deeper into the muscle tissue than tools like these that tend to spread the pressure evenly over the calves.",
      "rating": 4.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Works but doesn't roll smoothly",
      "text": "Hard plastic, no silicone or metal bearings. Doesn't roll very smoothly. Still beneficial and works to relieve muscle tightness, but just very lack luster having previously used a better quality version.",
      "rating": 3.0,
      "verified": true,
      "author": "Candi Boucher",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Sturdy and easy to use, but pulls hair",
      "text": "Works really well, except one thing, it pulls hair like no other, I had to stop using it. The little rollers are independent and when they roll apart then together they make a tight pinch, pulling any hairs that might go between.",
      "rating": 4.0,
      "verified": true,
      "author": "David Watkins",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Worth it",
      "text": "Good price, and works well. I’ve had the original The Stick, and this is much firmer. And there seems to be less space between the wheels. I like that the wheels are ribbed, and the grips are good. All in all it’s worth it, just know it’s very firm.",
      "rating": 4.0,
      "verified": true,
      "author": "FR!TZ",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Works great",
      "text": "Better than a rolling pin - not joking! I was using a rolling pin to massage my calves. Now my calves and my girlfriend are happy.",
      "rating": 4.0,
      "verified": true,
      "author": "knowmater",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Would recommend",
      "text": "I use this on my calf muscles when I get cramps or charlie horses. Easy to use. Works great",
      "rating": 5.0,
      "verified": true,
      "author": "Faith1208",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great for legs",
      "text": "Good quality. Easy to use By yourself. Takes a little bit of coordination but definitely worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Very happy",
      "text": "Bought this to use on my leg muscle when I developed some plantar fasciitis issues. Very happy with it. Also works well for back massages.",
      "rating": 5.0,
      "verified": true,
      "author": "KittyMama",
      "helpful_votes": 9,
      "publication_date": 20200123
    },
    {
      "title": "Helps me get ready to run!",
      "text": "I tore a calf muscle. My physical therapist recommended I get one of these, although she did recommend a specific brand. This one makes a world of difference when I'm getting ready to compete in a dog agility trial. It helps me stretch and relax that muscle, and get ready to run without problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Hauenstein",
      "helpful_votes": 5,
      "publication_date": 20200629
    },
    {
      "title": "Not the best",
      "text": "Works fine, I would have preferred if the roller parts were rubberized. They don’t feel very comfortable or soothing as it is",
      "rating": 3.0,
      "verified": true,
      "author": "Spooky",
      "helpful_votes": 4,
      "publication_date": 20200110
    },
    {
      "title": "AWESOME!!",
      "text": "This is a great tool for anyone who likes to push your workouts, really rolls out tight Calfs, Quads, and others nicely. Can't beat the price either!",
      "rating": 5.0,
      "verified": true,
      "author": "daniel",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Roller stick",
      "text": "Love this use it for sore muscles and it actually helps a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "oritz",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Worked for me!",
      "text": "Really like the comfort grip. Easy to use. Worked the kinks right out.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Most important tool in track bag",
      "text": "Actually my second purchase of this, daughter misplaced her first one probably at a track meet. She has tight IT bands and uses this to help stretch and alleviate pain before and after races. She also uses this to roll my back which I suffer from chronic pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison M.",
      "helpful_votes": 5,
      "publication_date": 20190304
    },
    {
      "title": "Good product",
      "text": "Needed my tendons stretched after knee surgery and this has helped tremendously.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Good Choice",
      "text": "This massage stick roller is made with durable materials, so it has a good quality. I use it to ease muscle soreness and reduce pain after exercise and running. It works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 8,
      "publication_date": 20190815
    },
    {
      "title": "Satisfied",
      "text": "Absolutely love this product. It is just as described. Works perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Pearl",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "A great buy",
      "text": "Just received it this afternoon after ordering it yesterday! Got it out and started using it for my right calf right away! It really helps! I love it! A great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie Vanderwal",
      "helpful_votes": 6,
      "publication_date": 20191110
    },
    {
      "title": "Definitely recommend",
      "text": "This has helped with my tight IT band. If I use it regularly I don’t have any issues with my IT band.",
      "rating": 5.0,
      "verified": true,
      "author": "Monique Melder",
      "helpful_votes": 5,
      "publication_date": 20200305
    },
    {
      "title": "Works as advertised",
      "text": "Zero complaints. It's not soft so if you need foam look elsewhere, otherwise a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig W.",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Absolutely worth it.",
      "text": "I almost never write product reviews, and was highly suspect of how effective this would be. But I was so pleasantly surprised!! It is very easy to use, and I felt immediate results/muscle relief. I highly recommend you give it a try too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20200619
    },
    {
      "title": "Really useful for after physical training!",
      "text": "I bought this for my son, he trains wrestling and usually he is really sore after training, this roller stick really helped him to relax and massage his muscles after a hard work training, He really likes it and use it a lot. Is made from strong hard plastic, and the size is right.",
      "rating": 4.0,
      "verified": true,
      "author": "Claudia D McCann",
      "helpful_votes": 3,
      "publication_date": 20190506
    },
    {
      "title": "Great muscle roller for your legs",
      "text": "Great roller for your muscles. My daughter uses it when she runs track",
      "rating": 5.0,
      "verified": true,
      "author": "Kia Purvis",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Really Helps!",
      "text": "I bought this because I was constantly getting shin splints, ever since I began to use this on my shins they would heal quickly and soothe the pain by a lot. Eventually I stopped getting shin splints. Very worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Ly",
      "helpful_votes": 9,
      "publication_date": 20190711
    },
    {
      "title": "A must have for me.",
      "text": "This is a must have if you do intensifying workouts that leave your entire body sore. This is a great muscle roller for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Nice little roller",
      "text": "Great price and works just as it should. Bought a second one for my tennis bag.",
      "rating": 5.0,
      "verified": true,
      "author": "standnfish",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Great for my back",
      "text": "I have back problems and this works great to roll out the muscles when they are tight. Really helps to relieve some of the pains. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Arm musles",
      "text": "It's good but my arms musles burn fast while I do it it's better for someone else to do it.",
      "rating": 4.0,
      "verified": true,
      "author": "Africa",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "excellent product for muscle pain relief",
      "text": "Great physical therapy treatment at home, excellent product for muscle pain relief, worth the cost..",
      "rating": 4.0,
      "verified": true,
      "author": "Gopal Kodati",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Great on legs",
      "text": "Helps relieve stress and tension in calves, thighs and hips. I try to use in the morning before I run.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Good muscle roller",
      "text": "My wife loves this. Uses it to roll out thigh and calf muscles after she plays tennis.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Easy to use and effective product.",
      "text": "I bought this product to help with stiff calf muscles. It was easy to use. The product is exactly how it was described and the delivery was fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Walker",
      "helpful_votes": 6,
      "publication_date": 20191118
    },
    {
      "title": "Must have for runners",
      "text": "Great for after runs and easier to use than a foam roller",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Sellers",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Great Product",
      "text": "The only downside is its a little hard when rolling over your body but you get used to it and learn how much pressure to put. Overall great product, and definitely minimizes my soreness after working out!",
      "rating": 4.0,
      "verified": true,
      "author": "Christina Carlis",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Money well spent!!!",
      "text": "I love this roller. It was worth every penny!!! I use it everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Shira",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Not bad!",
      "text": "Not bad! It was what I ordered. Perhaps need someone to get all the right angles on my quads",
      "rating": 4.0,
      "verified": true,
      "author": "Pat Bell",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Great product!",
      "text": "My therapist recommended I use one of these on my calves in order to help alleviate pain from bone spurs on my heels. Love it! It also works well to massage your partner’s back!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie Sheffield",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Thrilled with this purchase!",
      "text": "I couldn't be happier with my purchase. Great quality, fast service and better than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "K Amin",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "better to have someone roll for you as appose to ...",
      "text": "works well on tight muscles. better to have someone roll for you as appose to operating it on yourself. works great!",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Two Stars",
      "text": "It’s not even worth it didn’t help to do anything",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Great product, good value.",
      "text": "Does what it's supposed to -- nothing not to like....",
      "rating": 5.0,
      "verified": true,
      "author": "groovebilledani",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "quality hand held massage roller.",
      "text": "Easy to use. High quality. Works as described. Nice price!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Gustafson",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Perfect",
      "text": "This has been great for the legs and back. It does work to sore muscles. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "I don't like it. I had to return it",
      "text": "I don't like it. I had to return it. I used muscle roller stick in my gym. I was thinking it is same as my gym had but it is different. 5 stars for easy return process and 4 stars for product.",
      "rating": 4.0,
      "verified": true,
      "author": "vkirans123",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Works well, travel size.",
      "text": "This works well and is a great size for travel. I can't think of more to write but words are required",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Don't waste your money.",
      "text": "Piece of garbage. A wooden log would have been more effective. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "It works great.",
      "text": "This works great on my leg muscles after knee replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "DJWEpt",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Meh..",
      "text": "Doesn’t seem very well made. Not too sturdy. Don’t like the plastic rollers. TigerTail much better but more expensive.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Browning",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Not for me!",
      "text": "Didn’t feel soothing enough to massage. I wasn’t too happy with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Maggie Hopkins",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Four Stars",
      "text": "I have a pulled calf muscle and this is perfect for it.",
      "rating": 4.0,
      "verified": true,
      "author": "James R Schulty",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Good Buy",
      "text": "I use it for my wife's legs and she absolutely loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Turner",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Good but!!!",
      "text": "Good and durable. Use extensively and haven’t had any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris W",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Great",
      "text": "I love this roller. Its size allows you to really get pressure on those tight muscles.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "PT Me",
      "text": "Just rec’d today & it feels just like the one my therapist uses in PT.",
      "rating": 5.0,
      "verified": true,
      "author": "LadyVee ",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "It feels great on my sore muscles",
      "text": "It came in promptly and works perfectly. It does exactly what it is supposed to do. It feels great on my sore muscles.",
      "rating": 5.0,
      "verified": true,
      "author": "AO",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Great Mobility Tool",
      "text": "Works great at a fraction of the price of other mobility tools. Does not catch hairs. Smooth rollers.",
      "rating": 5.0,
      "verified": true,
      "author": "JAGS",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "great massage roller",
      "text": "I love this massage roller! I use it to massage my tide calf and it works perfectly. It is good to handle and the material seems good as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Jakoby",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Effective",
      "text": "Does exactly what it needs to do and it exceptionally sturdy. Upon my return to running again, this muscle roller has been an incredible tool especially on the calves, and quadriceps.",
      "rating": 5.0,
      "verified": true,
      "author": "PM",
      "helpful_votes": 12,
      "publication_date": 20200328
    },
    {
      "title": "Best for the price",
      "text": "There is no flex in the shaft, good for calf and quads.",
      "rating": 5.0,
      "verified": true,
      "author": "Kooldron",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "N/A",
      "text": "Great product, not to bash on it... but if I could, I would have bought a foam roller instead!",
      "rating": 4.0,
      "verified": true,
      "author": "Christian",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "You see me rollin\"",
      "text": "Love my roller! Great quality and quick delivery. It's a nice size also. It has helped me a lot. I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "It’s a suboptimal alternative to a foam roller.",
      "text": "Foam roller is much more effective if you can manage it",
      "rating": 3.0,
      "verified": true,
      "author": "Davida Wood",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "great for tight muscles",
      "text": "This is exactly as advertised and has been very useful for very tight muscles. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Does what it says it does",
      "text": "Great product for the price. Does exactly what it advertises it does. It’s a simple product that gets the job done that you need it to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody W.",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Five Stars",
      "text": "Really great item. It helps me to relax my muscles after a long day running around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Worked good to massage my leg after surgery and for muscle crampsgood tool",
      "text": "Worked good to massage my leg after surgery and for muscle cramps",
      "rating": 5.0,
      "verified": true,
      "author": "PJ SANZONE",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great for the price",
      "text": "Works just as well as a more expensive one I recently tried.",
      "rating": 5.0,
      "verified": true,
      "author": "AmberS22",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Great buy",
      "text": "Awesome for sore muscles. Works as it should. Only had a few weeks but used it and loved it every times.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry James Reeder II",
      "helpful_votes": 3,
      "publication_date": 20200301
    },
    {
      "title": "Use it all the time",
      "text": "Perfect, small and durable. Everyone in my house uses it",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Marie Schaff",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Great value perfect.",
      "text": "Wonderful for getting the deep muscle post workout calf cramps.",
      "rating": 5.0,
      "verified": true,
      "author": "BnA",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Partner loves it",
      "text": "Got this as a gift for my partner and he LOVES it!! It has definitely helped to loosen his problem leg areas.",
      "rating": 5.0,
      "verified": true,
      "author": "alison burchardt",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Good quality - takes up little space",
      "text": "Great purchase - good to use for a quick roll and takes up little space, I even bring it with me when I travel!",
      "rating": 5.0,
      "verified": true,
      "author": "Kjm5001",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Works Wonders for Me!",
      "text": "I had VERY tight IT bands in my legs. This works wonders to roll out these muscles and all the others in my legs.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas W. Keiser",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "The product came as it was displayed and was fully ...",
      "text": "The product came as it was displayed and was fully functional. Provided the ability to loosen fascia for muscle growth and regeneration. The packaging, shipping, and quality met perceived standards for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Yundt",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Works",
      "text": "It works as described. Good for rolling out your legs.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "very handy to bring to swim meets and easy to store at home",
      "text": "My son loves this, very handy to bring to swim meets and easy to store at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Matet",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Excellent roller.",
      "text": "Works really well for rolling out tight quads and calves. Easy to carry around and easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon O'Connor",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Great price & quality",
      "text": "Well made, sturdy. My son is very active and got this for his calf muscles...great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy ",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": ".",
      "text": "Very sturdy easy to use, measures up to the gym one",
      "rating": 5.0,
      "verified": true,
      "author": "brenda m ford",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Sports and exercise",
      "text": "Probably the best 12 bucks I've ever spent, knocks out my rugby injuries and gets me ready for the field quicker",
      "rating": 5.0,
      "verified": true,
      "author": "Pj Galik",
      "helpful_votes": 0,
      "publication_date": 20181026
    }
  ],
  "product_meta": {
    "title": "Muscle Roller Stick,Sportneer Massage Sticks for Athletes, Back Leg Muscle Massager for Reducing Soreness, Loosing Tightness, and Soothing Cramps",
    "rating": 4.6,
    "feature_bullets": [
      "MULTI-FUNCTIONAL: This massage tool provides deep tissue massage for foot, calves, legs, hamstring, back, glutes, quads, neck, sciatica, back and shoulder. Very efficient for relieving the pain such as shin splints, plantar fasciitis, sciatica, restless leg syndrome, tennis elbow,etc, to ease muscle soreness, aid recovery, reduce stiffness and pain before and after workouts",
      "81 TRIGGER POINTS FOR DEEP TISSUE: 9 ABS independent rollers with segmented spondles, each rolling spindle engineered to hit even the smallest pressure points and muscle fibers for a deep tissue massaging experience",
      "DURABLE & HIGH QUALITY MATERIALS: This massage stick roller is made with industrial strength materials, thermoplastic rubber and polypropylene handles for comfort and grip, 9 ABS independent rollers on a reinforced steel rod core for a lasting durability",
      "DUAL GRIP HANDLE W/ CONVEX POINTS DESIGN: The design of this muscle roller ensures a steady grip that works effortlessly with you for the most efficient muscle massage and relief ; DUAL grip design helps you hit those hard-to-reach spots and allows for uncomplicated self-massages",
      "COMPACT & LIGHTWEIGHT: Ideal for both home and travel, take to the gym, use at home and/or sports fields etc, fit perfectly in your gym bag"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "17.32 x 1.5 x 1.5 inches; 11.53 Ounces",
      "Item model number": "4332499640",
      "Date First Available": "November 30, 2016",
      "Manufacturer": "Sportneer",
      "ASIN": "B01NADHIT0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Massage Sticks",
      "Massage Tools",
      "Health & Household",
      "Massage Tools & Equipment",
      "Wellness & Relaxation",
      "Health, Household & Baby Care"
    ],
    "price": 9.99
  }
}