{
  "website_summaries": [
    {
      "verdict": "Choose it if you don't want to spend a lot and an entry-level model is all you need. However, it's not an ideal choice for pros or applications that depend highly  on accuracy.",
      "pros": [
        "Budget price, overload protection, and multi-measuring abilities make it a top pick for DIYers for home and auto applications",
        "It is compact and easy to use"
      ],
      "cons": [
        "Screen is on the small side, and backlight has been known to fail",
        "Feels flimsy compared to higher-priced models",
        "Some accuracy issues have been reported"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pray the batteries don't die!",
      "text": "Worked well while it worked, but God help you if the batteries die. One of the ridiculously cheap screws stripped out immediately and I couldn't get it open. I tried everything, including finally trying to pry it open. Nada. It went in the trash. I don't understand why manufacturers use such cheap screws? What are they saving, half a cent? If a screws can't be screwed and unscrewed multiple times you might as well rivet the thing shut and make it disposable - which is what mine turned out to be.",
      "rating": 1.0,
      "verified": true,
      "author": "Always_Armed",
      "helpful_votes": 96,
      "publication_date": 20170531
    },
    {
      "title": "DO NOT BUY! Fake reviews for a product that doesn’t work!",
      "text": "My dryer’s heating went out and after buying several parts the dryer it still isn’t heating! So after watching some YouTube videos I decided to purchase a multimeter to see if the 240V was bad before calling an electrician. I’ve been trying to use this thing now for over 30 minutes and it is not reading ANYTHING. When I thought it was my 240V outlet I went to a regular one that does work and it’s not reading anything there either! Super disappointed, and the fake reviews on here do not help if you are selling a bad product.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamesnjeans ",
      "helpful_votes": 47,
      "publication_date": 20180611
    },
    {
      "title": "Decent paperweight but not such a good doorstop.",
      "text": "Received the unit on time. It came with a 9 volt battery that I think was dead because the multimeter was left in the on position in the box. I located my screwdriver, opened the thing up and replaced the battery with a fresh energizer. When I closed it up and turned it back on the screen flashed a few dots before fading and it would do this every time I turned the dial until it just gave up completely. I opened it back up tried another battery and this time the screen backlight stays on but nothing else happens. I'll be going to my local hardware store instead, this was a mistake.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 70,
      "publication_date": 20171025
    },
    {
      "title": "Hopelessly  inaccurate",
      "text": "Hopelessly inaccurate, making in borderline useless. Read 18V across a 12V car battery and 182V across a 110V supply. This was a replacement for a cheaper meter from Amazon that was discarded for also being inaccurate. I did not use this meter for several months after purchase otherwise I would have returned it. I did not test on the Ohm and Amps ranges. If you buy one, test it on a known good voltage source. When I buy another meter, not this brand, I will test it for accuracy on receipt. If worse than its stated accuracy it will be returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Britinoregon",
      "helpful_votes": 20,
      "publication_date": 20171023
    },
    {
      "title": "Battery NOT Replacable / it is a throw away",
      "text": "I have bought hundreds of volt meters for my crew, and you can't expect much for $10, but this is worthless. A harbor freight $3 volt meter is much better. Looks like a nice meter, jut it is junk. When the battery died, the back had to be preyed open. The screws were trash. There is no battery compartment ! Just two spring contacts, and a retainer on the opposite clam-shell of plastic. Never seen anything so cheap. 1/2 cent would have fixed this problem. If you look at the guts, they couldn't have saved another 100th of a cent, anywhere on this device. The Worst ! The End ! Trash !",
      "rating": 1.0,
      "verified": true,
      "author": "Sir Arthur Conan Doyle",
      "helpful_votes": 4,
      "publication_date": 20200102
    },
    {
      "title": "Good Meter - Great Price",
      "text": "I'm an electronics guy, and have an expensive meter. I got tired of worrying about breaking it when I was working on cars, tractors, etc. Then I saw that Amazon is practically giving this meter away, so I picked it up. I am very happy that I did. It is not particularly sophisticated, but it seems to be very rugged (I already dropped it). At this price you are not going to get auto-ranging, so you have to set the correct range, which is done with the big rotary switch. There is an Off position on this switch, too. The meter uses standard cables, so I am able to use the various cables that I already had.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 4,
      "publication_date": 20180412
    },
    {
      "title": "Good tester, good price",
      "text": "Good tool for a decent price. I use it to test 12v components on cars and light trucks. Does everything I need it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken K",
      "helpful_votes": 19,
      "publication_date": 20150107
    },
    {
      "title": "Works very well...",
      "text": "Update: The fuse size they list on the manual does not fit the multimeter. Make sure you get some calipers and measure before you order any fuses. I took one star off. It does what it's supposed to do, and accurately too. I can confirm the fuses definitely work, since I accidentally blew one yesterday! Despite what some reviews would suggest, the product is ridiculously easy to open up. Two screws and a small pry stick. No strength or dexterity above what an arthritic nine year old possesses is required to change the fuse.",
      "rating": 4.0,
      "verified": true,
      "author": "Khang Truong",
      "helpful_votes": 2,
      "publication_date": 20200522
    },
    {
      "title": "I think a flat bottom works much better.",
      "text": "I received the meter less than one week ago. With limited use it has worked as described. My only complaint is the rounded shape of the bottom. When you have limited area to use the built-in stand and you want to lean the meter to achieve an almost vertical position, the unit tries to roll to one side. I think a flat bottom works much better.",
      "rating": 4.0,
      "verified": true,
      "author": "george T. Roberts",
      "helpful_votes": 7,
      "publication_date": 20170326
    },
    {
      "title": "Company bribes you for 5 star reviews",
      "text": "I like the multimeter - it's not the most accurate thing in the world but it works great for the price point. What I can't stand is that included in the box was a signup to one of these 'We ship you free products for reviews' websites. These are basically buying 5-star ratings (because they cut you off if you don't leave positive reviews). It completely destroys the Amazon rating system, and I can't trust the reviews of any product that is sold by one of these companies. Leaving 1 star to counter the bogus 5 star reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 679,
      "publication_date": 20160226
    },
    {
      "title": "Scary at first but really excellent!",
      "text": "This does everything! At first I was a bit intimidated and the instructions...well, if you need instructions these don't really help. If you know this all blindfolded, you don't need instructions. I went to YouTube and had it figured out quickly. It works absolutely and covers everything you would possibly need it for. I have used it to install 2 new outlets, a new overhead light, and replace 3 outlets. This helped in so many ways including testing the wires themselves (which an outlet tester cannot do) on 2 of the replaced outlets that initially had a whole bunch of wires coming and going from who knew where (common in older houses). This is truly a keeper!",
      "rating": 5.0,
      "verified": true,
      "author": "MaryN",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Does its job",
      "text": "Works well for the lay-electrician. I can tell if an outlet is hot, whether or not it's running full capacity, or whether something random is emitting energy. It's pretty cool. I got it because a phone charger wasn't working on one outlet but did on two others. I was curious, so I tested the outlet. It read fine, and it turned out a few weeks later the charger just died completely. So it wasn't an outlet thing, but hey I got to play with this so that's cool. Although it has standard multimeter functions, many of the functions simply don't apply to me. It is a solid-duty piece of equipment though, nothing cheap about it.",
      "rating": 4.0,
      "verified": true,
      "author": "GB",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Great so far.",
      "text": "Just got it this morning, plugged in leads and tested some known sources (DC volts). Works great so far. Easier to use and lighter than old multimeter it is replacing. The little prop on the back will be really handy. Like the protected right angle connectors on the leads. Surprised that it takes a 9V battery and getting to it isn't easy, but hope the battery lasts a while.",
      "rating": 5.0,
      "verified": true,
      "author": "dwmc",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "it is good enough for at home projects",
      "text": "I've used several high dollar multimeters throughout the years, and although this one doesn't quite have the precision that some of the more expensive ones do, it is good enough for at home projects, diagnostics, and repairs if that's what you want it for. The only things I dont like, is that if you forget to turn it off, there isn't a timer or automatic shut off, and the battery seems difficult to replace (haven't done it yet though). Would recommend if you aren't wanting to invest a lot of money into a multimeter.",
      "rating": 4.0,
      "verified": true,
      "author": "Chad McFarland",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Plugs in a little differently, crummy stand",
      "text": "The leads are positioned a little different than I'm used to, (ground on the right, other two on the left), you have to rely on learning the symbols for which is AC or DC etc., where other devices (and this one could have easily) also just throw the 2 letter label with the picture. The stand is also basically useless. The metal tips of the leads are also very short, so if you need to stick them in somewhere probably go with a different model. Not long enough to go into an outlet socket, for example. Aside from that, the backlight works great, dial clicks well, comes with a decent instruction manual, and functions as a multimeter should",
      "rating": 4.0,
      "verified": true,
      "author": "Value Fan",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Great value",
      "text": "I wanted it because I liked the idea of fused protection. True, one should not need fuse protection, but after having a brain fog and my old meter was not fused, well now you know why I purchased this meter. Other neat features are the lighted screen, and the handy built-in stand. The meter does have good feel in your hand; it does not have that bargain basement multi-meter flimsy feeling. The rotatory switch moves firmly, another feature not advertised that I liked. It is not a Fluke, but it is a compact and very useful tool without the Fluke price.",
      "rating": 5.0,
      "verified": true,
      "author": "bluefish",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Excellent device, superb customer service",
      "text": "I've had a number of multimeters and voltmeters, some cheap and some fairly expensive. This model is in the \"sweet spot\" of high quality at a very affordable price. The meter is well built, accurate and easy to use. Unlike many multimeters, it comes with clear instructions. I contacted the manufacturer's customer service with a minor issue and they immediately resolved it. I was pleasantly surprised by the exceptional customer service. I would recommend this product, and this manufacturer, to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken D",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Not reliable, watch out",
      "text": "The continuity checker/beeper is incredibly inconsistent. The battery is full and everything else seems to work but the last thing you want when checking wether or not the connection is stable and secure is having the beeping cut off every half second. It just makes you doubt especially if it's a connection underground or in a super hard to get to area. It would be possible that the cables or wires would need replacing but now you don't really know because of this specific volmeter.",
      "rating": 2.0,
      "verified": true,
      "author": "Joshua Chavana",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "No auto switch off. I wish I had bought a different one, fake positive reviews!!",
      "text": "It does not switch off automatically, so it drained it's batteries twice. To change the battery you will need a screw driver to open it. This is just a cheap device pushed by fake reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Jones",
      "helpful_votes": 4,
      "publication_date": 20180829
    },
    {
      "title": "Impossible",
      "text": "I ordered it and was extremely excited to use it, however, after checking it out, trying to see the voltage, amperage, polarity, ohm, etc. realized this was terrible. I bought it because of other reviews, but made a huge mistake. I've been trying night after night but yesterday was the breaking point, I can't have something that I switch around and has a mind of its own trying to get me to make it work, when it should work. No thanks. I don't recommend it, get something else, and hopefully you will get a straight reading and continue building. I was fortunate Amazon took this into account.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "A great $11 multimeter",
      "text": "I honestly don't know how they make these things and sell them for $11 to your door. This unit is much more rugged than the Harbor Freight model, which is also sold at Auto Zone and seems to be the default $10 multi meter ($19.99 at Auto Zone). All the switches, connections, probes etc. seem way more solid. I did not that this unit read 498 mv when my refrence unit read 500 mv but if your project requires 2 mv accuracy you should probably buy a Fluke. This doesn't work with AC, which is fine for me. I am very happy with the $11 purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla Novitt",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Junk",
      "text": "Couldn't get a consistent reading on voltage, thought it might be the stupidly small probes so I cut them and stripped the wire, tried testing with that. Amps and resistance work fine, but voltage is only intermittently reading on a steady power source. Last multimeter I had worked great until I accidentally tested a car battery with the cord in the amps slot and blew it out. This thing is trash right out of the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 2,
      "publication_date": 20181111
    },
    {
      "title": "Replacement sent at no cost, but the first was defective display out of the box, it had a bad segment in a number.",
      "text": "I opened the box, took the meter out of the bubble wrap, turned it on... one of the display numbers had a missing segment! So the display was defective on a brand new unit. To me, this shows poor Quality Control. After looking and reading reviews, I expected to be happy with this... obviously I wasn't. I sent it back and went with another brand of meter. UPDATE: My multimeter was defective upon receipt, one of the display numbers had a segment that wouldn't light. I returned it and Etekcity sent a replacement that is working perfectly. They sent it a no charge to me! That is excellent support.",
      "rating": 4.0,
      "verified": true,
      "author": "Woolval",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Good till the battery dies.",
      "text": "The meter works great, but I couldn't believe how hard it was to replace the battery. You need a tiny Philips screwdriver to get out two screws, and even then, getting the battery to stay in place while putting everything together is a real trick. I have never seen such a poorly designed arrangement for a battery, and I doubt very much I'd buy this again.",
      "rating": 2.0,
      "verified": true,
      "author": "Aaron Shepard",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Great price and product. A bit confusing.",
      "text": "This thing is great for it's price. However, if you've never used one of these before, the instructions are confusing. I still need to figure out how to get a reading for my car battery. UPDATE: Their customer satisfaction is beyond anything I've ever encountered. They have made about 10 attempts to contact me in an attempt to correct the problems. They sent a PDF that was easy to understand. All in all, this is a great product for a great price. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Perez",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Nice Multimeter",
      "text": "Feels solid, feels well-built. I tested the AC line, got a voltage that was believable. I tried to take it apart to add batteries. Then I realized I could turn it on; it already HAD batteries. I thought at first that those probes were so short that they were inconvenient. Then...I figured out how to take off the protective end caps. (Later, I received an email that prompted that very action...I would bet that others had the same problem.) This multimeter will reside in my toolbox, will get occasional use. Thanks for a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "marshalljames51",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Buy two",
      "text": "I use a voltmeter only to test rechargeable batteries for my electronics every month or two. My previous voltmeter stopped working. Changing the battery was difficult and did not help. This one seems solidly made and works well. The problem with it is that, apart from the brand name, it is a very slightly changed version of the one which was not durable. If you have a serious need for such a meter, buy two. At less than $10 each, still a bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Ungar",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Large numbers, good test leads, accurate",
      "text": "My package just arrived by UPS. First impression is good. I did research various electric meter testers for a while and decided to go with this one. For the price you can’t go wrong. The leads are well made and look durable ( have seen some cheap ones that broke off in the past resulting throwing away the entire unit ). Digital read out is great, big digits easy to read. After I have a chance to do more tests and if I find anything wrong I will post again.",
      "rating": 4.0,
      "verified": true,
      "author": "nick stratigakis",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "The price is right",
      "text": "Hard to beat for the price. For a simple, basic meter, it does a good job. I wish it had auto power-off, but it should be easy enough to remember to switch it off. If I don't, and the battery dies, I think I would remember the next time. I have not done extensive evaluation. I am a little bothered by the continuity setting and that the metal tips seem to have some sort of non-conductive coating on them that when I touch them together, it seems flaky at completing the circuit. I might take some sandpaper to them and see. But, again, the price...",
      "rating": 5.0,
      "verified": true,
      "author": "J. Knittel",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Multi meter at a reasonable price.",
      "text": "The jury is still out on how long this will function. The last one I got was half the price of this one. My thought now was to pay a bit more and hopefully get a longer lasting product. Roll the dice as most all these electronic things are made in china. Not my thought of quality for this type of product. My rating of this is optimistic at best. Out of the box it works as expected. A year or so from now who knows.........",
      "rating": 4.0,
      "verified": true,
      "author": "little ralphie",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Canceled my electrician appointment",
      "text": "I'm familiar with home wiring and have done a fair share of adding electrical outlets, adding lighting fixtures, adding GFI outlets, etc. So when an outside outlet stopped working I assumed the 25 year old GFI outlet was bad. When that didn't fix the problem, I called for an electrician since I wasn't sure of the source of the problem. Although after using this multi-meter to determine what lines were hot and which were dead, I was able to rewire the outlet. Couldn't have done it without this multi-meter. Use and setup were pretty straightforward.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Super easy to use",
      "text": "I bought this multimeter to replace a power outlet in my home. It was really easy to use. It’s compact, lightweight, and has the necessary options for non-professional use. However, I think it would hold up to being used on a daily basis. It’s perfect for the small jobs I have around the house though.",
      "rating": 4.0,
      "verified": true,
      "author": "warramq",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Works as described",
      "text": "It works great! I didn't have any problems with using any of the functions. It's also nice that you can light up the display and freeze the display if you need the readout later on. It does not save the read out.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 7,
      "publication_date": 20150902
    },
    {
      "title": "Piece of crap straight out the box",
      "text": "Pulled it out the box and turned it on and it immediately started pulling numbers out the air. Hooked up the leads and tried testing it on my car battery. Wires got so hot the plastic sheathing started to melt. And it didn't even work.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20161021
    },
    {
      "title": "Reliable for a small unit",
      "text": "I'm rebuilding a 36 year old Nissan outboard motor coil. One day it worked, the next it didn't. I had a freebie meter from a local store. It wouldn't settle on any reading. Probably why it was a freebie. I need the coil to be within a certain ohm tolerance. The new meter reads better, faster and gives me the information that I need. Given the human variable - me and being inexperienced, we're working through it together.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda K",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "I like it.",
      "text": "For a cheap multimeter, this little guy has a lot of functionality. It's sufficient for the little bit I do with it, it comes with instructions, and if I happen to make a mistake and burn it up, it won't break the bank to replace it. It's supposedly double fused though so it may not be as easy to kill as the meter I was using. (One of those plastic yellow squares... Neiko, apparently).",
      "rating": 5.0,
      "verified": true,
      "author": "Sebastian Hahn",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Decent Multi-Meter for Price",
      "text": "This is a new multi-meter for me. The product is great and highly durable. It comes with a backlight so you can read the numbers in low light situations. An instruction book is comes with it, but is limited in telling you how to use the multi-meter (what settings for what situations). I've seen some multi-meters with a much better manual on what setting to use for fuses, batteries, outlets, resistors, etc. If you're a multi-meter newbie, you may need to search YouTube for better instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "pculter",
      "helpful_votes": 5,
      "publication_date": 20160229
    },
    {
      "title": "Worked perfect for figuring out wires behind an old 3-way switch!",
      "text": "My old multimeter died and I have a couple of electrical issues I wanted to tackle in the house. I came across this product and saw the great reviews... couldn't beat the price... sure, I will try it! Glad I did! This little multimeter works just as good as any of the higher priced ones on the market. So far, I have used it to check for AC voltage and Continuity. If you are on the market for a quality multimeter at an amazing price, I highly recommend getting this one!",
      "rating": 5.0,
      "verified": true,
      "author": "George Crawford",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Works great for amateurs like me",
      "text": "I'm very happy with this little unit. The instructions were very easy to follow. I'll probably print out a smaller reference card to tape to the back of the unit. I do wish there was a way to store the prongs easier, or at least have a cover for them. I'll probably design and 3D print one out of TPU. But for now, I'm very happy with this unit. It's been used quite a bit since getting it.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Keller",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "The Best Multimeter (at this price) for any application",
      "text": "I bought this multimeter and the Innova 3300 because they had great ratings on Amazon.I also compared it with another $10 multimeter I had of a no-brand I bought in AutoZone some time ago. I find this one to be way better and it also has a continuity tester with a beep. A feature that I like is the 50Hz wave output (I didn't find in other multimeters) this can be used if you are into hobby electronics. I feel safe using this meter for voltages up to 500V AC and DC: for typical single phase and three phase applications and hobby electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "Pepito Sbazzeguti",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "I bought this because I found out one of my ...",
      "text": "I bought this because I found out one of my outlets was not grounded properly. Used this and tested the outlet and confirmed it indeed wasn't grounded properly. I tested all the other outlets in my place and turns out another outlet was not grounded properly. The contractor who renovated my place over a decade ago didn't ground all my outlets. If I only tested each one at the time, I could have had him fix it. At least with this multimeter, now I know which ones I need to fix.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy C",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Best quality for the money",
      "text": "I have been buying harbor freight testers for years. I had an ATV repair business that I used these small inexpensive tester all the time. I purchased the Etekcity because it was inexpensive and had the continuity buzzer that is useful. The Etekcity was a little more than the ones I have been using but the quality is ten times better. Wish I would have founds these years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill O.",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Not for amateurs. Instructions are lacking.",
      "text": "Although it appears to be well-built and a great buy, the absence of a simple instructions directed for novices makes this product useless. There is nothing in the user guide how to read and understand the labels on the face of the unit or examples how this meter can be used. There isn't even an illustration nor note to remove protective caps on both ends of the cables. Unless one is familiar with amps, volts, resistance and their common icons and units of measure, this is not the meter to buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Kalihiboy",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "NIce Inexpensive Multimeter",
      "text": "Easy to read and appears accurate. Downgraded to 3 stars due to no \"removable test lead extension caps, and a tough rubber sleeve to protect it from drops.......\" which were a consideration when I ordered it, otherwise 5 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Tad Karmesh",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "You must be aware",
      "text": "It comes with battery included, I compared it with other more expensive and it has very good precision, for the price it is excellent, but they must be careful not to burn it. Most testers have 12 volts direct on the dial on the left and AC current on the right, because it has everything on the dial on the right and first has the measurement Dc and immediately the AC, design issue, that does not affect its operation at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose A. Contreras",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "A solid hobby/diy meter.",
      "text": "I have only used the meter to test that it works. Much better than the cheesy one it replaces. Doesn’t seem like it would break if dropped because of its hard rubber or plastic case. Did not have a problem with zero ohms when leads are shorted as reported by some reviewers.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Larry",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "All homeowners need to have a multimeter..",
      "text": "For an inexpensive basic multimeter this is a great buy. I was able to diagnose which part of my refrigerator failed. If you own a home/appliances you need at least a basic multimeter to keep from spending a fortune on repairs when YouTube can coach you through the basics if you have the tools to work through your breakdowns! As an update, I recently purchased a water heater. I installed it and it worked for a day, BOOM no longer making hot water! So over the phone diagnostics were performed and a purchase order authorized by Whirlpool for a new upper thermostat. 15min to Lowes and hot water was cranking again! Don't be a noob, get a multimeter...",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan S Easley",
      "helpful_votes": 3,
      "publication_date": 20160311
    },
    {
      "title": "accuaracy confirmed with a Fluke BD12A multimeter",
      "text": "handy, unlike the bulky work bench Fluke BD12A multimeter. The built in signal generator is a nice touch as is the LCD backlight. Also the banana sockets are spaced correctly for a dual banana plug. I have 8 dual banana plug test leads (RCA, SPEAKON, alligator clips, dual banana plug (both ends), single banana plug and probe, XLR1, and XLR2)",
      "rating": 5.0,
      "verified": true,
      "author": "Ancient-Geek",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great little device",
      "text": "Im not an electrician. I was wanting to swap out for a smart outlet and light switch in my home. The first time I had this on a wrong setting when I went it to test out the outlet and had a spark. So went on youtube to see out to test for an outlet and found out that you want it on the setting \"200 V~\" to see if the outlet is carrying 120V or not (as pictured) as well as the wires plugged in the correct holes on the device.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Briggs",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Replacing battery - good luck",
      "text": "Works fine. But good luck when the battery dies. The screws don't seem to want to come out no matter what. Another reviewer pointed this out. Appropriate size screwdriver, then tried something else.. I eventually just broke it in half. It snaps besides the screws, and it snaps back together. But what a pain. Works fine with new batteries.",
      "rating": 4.0,
      "verified": true,
      "author": "prowl",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Quality products",
      "text": "This company hasn't let me down yet. I've got tons of smart plugs, a kitchen scale, and now this multimeter. It came with pretty simple instructions just in case you're not sure what setting is best to use in any given situation. Fairly flexible to fit my needs, and I'm happy with its performance so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Great value mutimeter",
      "text": "Great price and works pretty well for average users. It is not like my Fluke 23 multimeter, but probably the best you could find in this price range. It came with a good quality 9v battery installed. However, it took me a few minutes to find out that pulling test pin sleeves enable to use longer test points. This should be explained in the four pages manual.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott YehTop Contributor: Photography",
      "helpful_votes": 2,
      "publication_date": 20170523
    },
    {
      "title": "Life saver saved $ Hundreds",
      "text": "The reason for the 5 star which I dont do much the meter has it all I was able to diagnose my 03 Kawasaki ninja ex250r and find out that the previous owner installed some cheap E # coils so saved me a couple of hundred dollars not takeing it to the shop at $100 a hour so this $10 meter is amazing I will tell all my friends that have motorcycle that this is a must have tool in there kit..",
      "rating": 5.0,
      "verified": true,
      "author": "Carbine Joey",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "but I am not so I got this and am very happy to have saved a hundred bucks or so",
      "text": "Sometimes things just work. This is one of those times. If you need a digital multimeter buy this one! It is well priced and does what it is supposed to do. BTW, I am just a Harry Homeowner, not an electrician. I will use this (I hope) only a handful of times so price was a factor. If I was a master electrician I would probably buy a Fluke, but I am not so I got this and am very happy to have saved a hundred bucks or so.",
      "rating": 5.0,
      "verified": true,
      "author": "Neal B. Edwards",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Love this afforable, simple yet full featured meter",
      "text": "Sure there are less expensive basic meters other there, but the leads and sockets are nice on this one and the build quality is exceedingly better on this unit that most in this price range. The switch is solid and the display is good even in bright daylight and low lighting conditions. Sure, it would be nice if it came with a case but I have plenty of cases from dead meters of similar size.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "It seems to work great. Thankfully",
      "text": "We are novices, but needed this to check our doorbell wiring. It seems to work great. Thankfully, they sent a followup email that mentions that the tips have a rubber cap. This is so seamless in appearance that we just thought the metal tips were too short. But the cap does pull off and the ends are longer. It did work for checking our doorbell wiring.",
      "rating": 5.0,
      "verified": true,
      "author": "Pelican By The Sea",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Good cheap multimeter",
      "text": "It's a $10 multimeter that works. It's not a $500 multimeter. If all you need to do is occasionally measure voltages, resistance and small currents, this will work great. I've used it three times now and there have been no problems. Like my last \"$10 multimeter\", when this breaks, gets lost, or otherwise no longer works, I'll buy a new one. At this price it's a disposable product...",
      "rating": 5.0,
      "verified": true,
      "author": "M. Deibler",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "It works okay I guess but would not recommend for work",
      "text": "I just got a chance to use this the other day, i got it just to have one around the house and maybe to keep in a tool bag at work. It works okay I guess but would not recommend for work. I tried testing the leads for continuity and it kept going in and out, should be a smooth steady tone. This doesn't fill me with confidence to take this out into the field.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20160628
    },
    {
      "title": "Works just fine though I wish it came in a case that zipped closed.",
      "text": "No complaints about function. Does more than enough for the price. It would be nice if it had a little hard cover or even cloth case that it could zip up in to store it and the attached prongs easily. One down side is the metal ends are NOT deep enough to test a typical plug outlet. That's a bummer.",
      "rating": 4.0,
      "verified": true,
      "author": "MJTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Multimeter reads high",
      "text": "I need accuracy on my 48 volt golf cart. This multimeter has begun to read higher voltage than other voltmeters. It is reading too high. Pls advised. // Update: if company advises me with how to adjust multimeter or replace multimeter, I will update my poor review. V/R, Ranky",
      "rating": 1.0,
      "verified": true,
      "author": "Ranky",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Easy to use",
      "text": "I purchased the Etekcity multimeter for automotive use. It works great and is accurate for most automotive needs. The backlight button is a big plus especially in low light conditions, like under the dash. Came ready to use out of the box with included and installed nine volt battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Busy Buddy",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Stopped working",
      "text": "I bought this in late 2017 just to check batteries. I used in half a dozen times and it worked perfectly. I took it out today and it didn't work. I replaced the battery but it still doesn't work. Into the garbage it goes.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan Nelson",
      "helpful_votes": 2,
      "publication_date": 20180913
    },
    {
      "title": "Low cost high reward",
      "text": "Great product. Easy to use. Watching the video that goes with the description is helpful considering there is not a setting for a 12volt battery. To check most batteries you have to set the dial at 20v. This was confusing for me at first, but maybe that’s just me, but after watching the video I felt confident. I compared a reading with this to my neighbors more expensive multimeter and got the exact same voltage reading. Great product at crazy low price. Truly can’t beat it",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Beringer",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "came in 2days",
      "text": "have other elect products all have been good,cant believe I only paid 11 dollars for this multimeter.its outstanding the display is backlit, it has audio beep when u check diodes for continuity.rubber case protection came with batterys fully functionable awesome buy.and little flip out stand for ease of use.HIGHLY RECOMMEND THIS METER",
      "rating": 5.0,
      "verified": true,
      "author": "walter manley",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Great unit.",
      "text": "For the money, I could not be more pleased. It functions well, feels good in the hands and does the job. I use it for simple procedures like checking resistance and verifying trailer wiring voltages. You get a lot of functionality for the money. I What I most appreciate is the range of calibrated values that the unit can check allowing the user to see subtle changes at the lower ranges. The incremental values help pinpoint the accuracy of each measurement recommend this unit without reservation.",
      "rating": 5.0,
      "verified": true,
      "author": "elgreco",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Inexpensive Multimeter that gets the job done",
      "text": "I needed an inexpensive multimeter to check my thermostat wire for power both at the thermostat and at the furnace. This item fit the bill perfectly. Once I figured out what I was doing, I quickly figured out which wires had power and which did not. This piece is not cheaply made either. Very sturdy, rubberized case. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "codegeek",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Excellent Multimeter",
      "text": "An excellent multimeter with manual functions .. high quality .. all of its functions worked as described .. I've used it to troubleshoot my hvac wiring, control board, contactor, & capacitor(s). very handy too for checking DC batteries power levels .. a versatile ac/dc multimeter with its included functions ..",
      "rating": 5.0,
      "verified": true,
      "author": "Action",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Soft case and very durable, good value",
      "text": "Comes with a soft case! It is nicer then the $20-30 multimeter you would buy at the parts store. I bought his because my 30$ one broke easily from Napa. This one is a much higher quality. I am an old lectrician hobbyist and I would tefcomebd this product, it is really solid. And the manual that comes with it is short and sweet and surprisingly ENGLISH! 10/10 best bang for the buck. I haven’t been able to verify reading a with a benchmark or it would be a 5/5",
      "rating": 5.0,
      "verified": true,
      "author": "Forrest M.",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "READ THE DIRECTIONS AND REACH OUT TO THE COMPANY IF YOU HAVE ANY QUESTIONS.",
      "text": "Excellent product,for such a great price. I am not a paid reviewer so my feedback is true. I have been able to ck.out the plug outlets,in our home and the process was QUICK and EASY. I suggest that you read up on how to use this meter properly and you will get good results. I am not a electrician, so I am so glad that I was able to learn the proper way to use the meter and I think that this is a great price and great for the persons doing DYI projects.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Vandiver",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Five Stars perfect Multimeter",
      "text": "It doesn't come with a storage bag but it does have a set of leads and a small fold-out manual that does a good job of explaining the settings necessary for a person's first Digital Multimeter, There's a switchable backlight for the digital display and a hold function to freeze the display after a reading. I am very happy with this Etekcity MSR-R500 Digital Multimeter Etekcity MSR-R500 Digital Multimeter Etekcity MSR-R500 Digital Multimeter Etekcity MSR-R500 Digital Multimeter, Etekcity MSR-R500 Digital Multimeter,",
      "rating": 5.0,
      "verified": true,
      "author": "ReB",
      "helpful_votes": 0,
      "publication_date": 20160214
    },
    {
      "title": "Rugged and does what you need...",
      "text": "Good little rugged voltmeter for the price. One time, I left this sitting in the sun in Phoenix and it heated up to the point where it was too hot to hold for long, and the display turned black and the device was temporarily unusable. When it cooled down, it went back to normal and worked just fine though, so I guess that is a testament to the quality of parts used in this device... Does not have some of the special functions that you see on more expensive models however, but has the minimum functions you would expect from a multimeter.",
      "rating": 4.0,
      "verified": true,
      "author": "Damian Green",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Works as described",
      "text": "Not sure about the accuracy but have no reason to doubt it. It turned on right out of the box and worked great. Works great for most household DIY fixes/tasks. Easy to read and easy to use if you know how a multi-meter works (or there are plenty of YouTube videos and blogs to help learn).",
      "rating": 5.0,
      "verified": true,
      "author": "Harry Potter",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Easy to Use Multi-Meter",
      "text": "This multi-meter is easy to use and provides an output in large easy to read numbers. It fits in my hand while I read it and the selector is easy to use at the same time. The probes have rubber caps that protect them from dirt and dust. The video on the page is instructive and helps to understand the way the meter works. I am happy that I got this meter and use it regularly.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lowry",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Digital Display Faulty",
      "text": "I'm no expert when in comes to multimeter features, but the build seems to be of good quality. The one exception is the display. The top segment of one digit is missing. Not a huge deal (I can still tell what that digit is supposed to be), and it's not worth returning the unit just for that. But this defect should have been caught if the display was tested during manufacture.",
      "rating": 4.0,
      "verified": true,
      "author": "David N",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "MSR-R500 is a good multimeter at any price",
      "text": "I just use it to test the DCR Ohms of electric guitar pickups. I found that the readout was close enough to what was expected that I'm feeling pretty good about its accuracy. Inexpensive and very easy to use, it's a win.",
      "rating": 5.0,
      "verified": true,
      "author": "R Jordan",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Buyer beware.",
      "text": "Was only able to use the product only one time . at that time it worked perfectly. Second time of usage turned on lasted for 30 seconds change to a new battery .Never turned on again I change the fuses nothing you decide if it’s a buy. Good luck!",
      "rating": 1.0,
      "verified": true,
      "author": "secret",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "High Quality for the Price",
      "text": "For the price, this does the job very well. I like the backlight on the display and the hold button. I'm not an electrician but this helped me find an open circuit and to do some simple voltage tests on my cars. I like the unit and expect it to serve my needs for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Bridges",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Essential tool",
      "text": "Needed a new multimeter, the old one took a hike. This is easy to use, the readout is big, and it has all the range you'll need for general use around the house, car, whatever electric you're working on. Color makes it easy to find in your mess of tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Hank",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Garbage!",
      "text": "Don't waste your money. Half of the features do not work and they won't let me return it. It will read impedance, not accurately .It does not read voltage and that's what I need it for. I ended up buying a $6 Harbor Freight meter which works much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Gloria",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Nice multimeter, probe tips are pretty small",
      "text": "Audio output for continuity/voltage drop tests - nice! Sturdy test leads with protective caps for storage, lighted display if needed, hold function - even the instructions are thorough and not in tiny print. I'd give it 5 stars for all that, but the probe tips themselves are quite small; there will be times that I'll wish for a longer probe.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda R",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Worked on arrival in box that protected item.",
      "text": "Nice size appears to be of good quality just starting to use it but very pleased so far. Have only had for a week, but like the leads and the way they fit in tester. They have a protective cover over the contacts that make them seem short till you pull the protective cover off and then the testing probes are regular length for probes Very easy to read..",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Z",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Simple and works",
      "text": "This multimeter works well and is worth the purchase if you're only using it ~10 times a year. If you're testing voltage and current more than that, you're likely a professional and have pro tools. My only concern is the packaging and Amazon page say AC & DC, but the customer service who reached out to me asking for a review mentioned this can't measure AC. So I am a bit confused about this. TBD how it works with AC.",
      "rating": 4.0,
      "verified": true,
      "author": "ms",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Not great quality, but good enough at the price",
      "text": "First one the sent didn't work on resistance setting and continuity check just constantly beeps. The voltmeter did work. After writing a review, the company contacted me and sent me a new. The new one seems to work so far. It's definitely not a top quality measurement device, but I'd say it's good value for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Blankenbeckler",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "Nice product",
      "text": "A great product for the money. I'm sure most people would have no problem using it, but as a woman who has had no opportunity to use one in the past, they are a little daunting. I went on You Tube several times for help as the directions assume you know the basics of electricity. Still a good basic device.",
      "rating": 4.0,
      "verified": true,
      "author": "H.L. Mencken Hank",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "A Great Tool",
      "text": "Although the Multimeter has numerous functions for measurement, I use it primarily to check AC voltage and continuity. It proved to be an accurate and necessary tool to have around. It is an essential piece of electronic/electrical measurement that a handyman should keep around for determining failures.",
      "rating": 5.0,
      "verified": true,
      "author": "Salih",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Biggest Bang for the Buck",
      "text": "I have only used the meter one time and it appears accurate for reading AC voltage. I'll keep the instructions in the box so I can refer back to them in the future. It has a lot of features that you just don't expect to get in this price range. What really impressed me was the packaging and quality of the product! Bubble wrap inside the box is a plus when shipping meters. I really like it so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Larryz",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Basic, Easy and simple",
      "text": "Its a basic device. No fancy features. If you are looking to have a multimeter for your general home usage, this may be a good option. The device does the basic function alright and is usable straight off the box. Standard accessories include the probes and the battery. Overall a great buy for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Balakrishna Rao",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Very Accurate",
      "text": "This item works great and is very accurate, i was expecting it not to be due to how cheap the price is but i was surprised, feels real strong and well built aswell. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 5,
      "publication_date": 20150819
    },
    {
      "title": "Cheap & glitchy, If you want to stay with a cheap one, maybe try one a little better.",
      "text": "I did leave it at 3 stars, because I did buy a cheap one on purpose. I'm not a professional, it'll be used once or twice a year maybe? But I wasn't expecting so much glitching, especially right away.(Maybe it was just a bad batch?) But, next time, I'll try the next higher up one.",
      "rating": 3.0,
      "verified": true,
      "author": "Angie A",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Great volt meter at a great price.",
      "text": "I have 5 12 volt batteries that I store in my garage over the winter and needed a volt meter to monitor the voltage drop over time, thus knowing when to charge the batteries. I have used the MSR-R500 just once so far, but it performed beautifully. It is easy to set up and gave me readings (with 2 decimal point readings) that accurately tell me the state of each battery. Very happy with the unit and the reasonable cost of the meter.",
      "rating": 5.0,
      "verified": true,
      "author": "drycharge",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Yup, it's a multimeter all right!!",
      "text": "Well, it does what it is advertised to.... it measures.... seems to be fairly accurate.... but the test leads, remembering how cheap this was..... they are ok.... kinda.... yeah.... I'd spend a little more on a meter next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Gorgehiker",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Good combination of features and value",
      "text": "My husband needed a new multimeter for his shop, and this time we decided to go for something less expensive. After reading reviews of many multimeters, we chose the Etekcity MSR-R500. We weren't expecting much based on price, so we were very pleased to discover it works well and is easy to read and use, and this is what I've based the score on. While we've owned more featured multimeters, this one hits the spot when it comes to value and functionality, and we're actually quite pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "patticake",
      "helpful_votes": 0,
      "publication_date": 20160830
    },
    {
      "title": "Great Multi-Meter Even at Twice The Price!",
      "text": "Great multi-meter! I use it primarily to check batteries for my custom designed and built drone collection and it works great. Testing it against a several hundred dollar one that\"s truly accurate proved this one is pretty much spot on as well. unless you absolutely need a much more expensive high end one this is definitely worth every penny at $10 even $20 (I paid $9.99). Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Christianson-Ziebell",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great Buy",
      "text": "Affordable and works just as accurate as my costly Fluke & Tenma Meters. What else can one expect from a digital meter? Moreover, it comes in a durable protective case. Nice to have in the field if you're an AV/disco person that set up equipment and need to test line voltage, cable continuity, batteries, plus all other tests done by electronics technicians.",
      "rating": 5.0,
      "verified": true,
      "author": "Skinner",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Just get one",
      "text": "Every homeowner, or invested renter, should just have one of these. Super easy to use, and is an important diagnostic tool for any sort of electrical troubleshooting or project. Getting a new TV, or other pricey electrical gear? It's worth the peace of mind to be able to quickly check your current to make sure everything is as it should be. Easy to use and read, and if you're totally new to electrical stuff like me, a quick internet search will bring up plenty of videos on how to use a multimeter.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Cohen",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Simple to use",
      "text": "My clothes dryer stopped working and the technician could not find the problem with the dryer. I could not find my multimeter and this product was significantly cheaper than the multimeters at my local big box store. When it arrived I used it to check my fuse box (which was fine), my outlet (which was fine), and my dryer cord (which was NOT fine). I bought a new dryer cord and now I am back happily drying clothes again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Seems accurate, feels solid",
      "text": "Have worked with a lot of multimeters (hobby and EE undergrad), picked this one bc it claims a faster refresh cycle (7x per second if I remember correctly) and therefore close to an analog meter RE transient voltage",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Good Meter for a Great Price",
      "text": "Bought this for my nephew (along with some basic tools). Good, quality construction, can measure pretty much everything that would come up in everyday life. Much higher-quality and fancier tools out there, but you will pay a LOT more for those. This is a good meter for the average user. Did I mention the great price?",
      "rating": 4.0,
      "verified": true,
      "author": "Andy W.",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Nice little meter",
      "text": "Nice little meter... Got 4 starts because you can't check electricity on your house... cause the pins are too thick and will not fit to check the power line. But for everything else is great and I recommend, cause you can replace the thick pins.",
      "rating": 4.0,
      "verified": true,
      "author": "Ney Alencar Vasconcelos",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "A very good tool to have",
      "text": "This is a very good tool offered at an excellent price. If you work on electronics or are simply trying to identify a problem with your home wiring then I think you will enjoy having one of these in your tool box. Back in the day, the good old days, something like this meter would have cost at least 4 times what this one is being offered at and you might have had to settle for an analog version as the early digital versions were very costly and generally much larger.",
      "rating": 5.0,
      "verified": true,
      "author": "William I.",
      "helpful_votes": 0,
      "publication_date": 20160823
    }
  ],
  "product_meta": {
    "title": "Etekcity Digital Multimeter, Amp Volt Ohm Voltage Tester Meter with Diode and Continuity Test, Dual Fused for Anti-Burn",
    "description": "DO IT ALL, AND THEN SOME\nThe Etekcity MSR-R500 Digital Multimeter is a practical tool for electricians, hobbyists, and general household use. It is easy to operate and features many different functions for measuring current, voltage, and resistance, as well as continuity, transistor, and diode testing. It can be used to diagnose, assemble, and repair circuitry and wiring. Other features include a low battery indicator, continuity buzzer, and overload protection. It's tough rubber sleeve protects it from the drops and falls associated with the toughest jobs.\n\n\n\nBUILT FOR EVERYDAY USE\nA Data Hold function keeps the measurements displayed on the MSR-R500 while you record them and a larger display makes the MSR-R500 multimeter even easier to read. Add in the LCD backlight and protective rubber bumper and this is the meter for every job.\n\n\n\nSPECIFICATIONS\nSafety/Compliances: IEC61010 CAT.I 600V, CAT.II 300V, double insulation\n\nMax.display: 1999, 3 1/2 digits\n\nRange selection: Manual ranging\n\nOverload display: Display OL\n\nSampling Speed: 2 times per second\n\nPower: 1 x 9V 6F22 Battery Included (Low Battery Indication)\n\nDiode Test: Yes\n\nContinuity Test: Yes\n\nSquare Wave Output: Yes\n\nDimensions: 5.1\" x 2.9\" x 1.4\"\n\nDC Voltage: 200mV/2000mV/20V/200V ± (0.5%+2), 500V (0.8%+2)\n\nAC Voltage: 200V/500V ± (2%+10)\n\nDC Current: 2000μA/20mA ± (1%+2), 200mA ± (1.2%+2), 10A ± (2%+5)\n\nResistance: 200Ω ± (0.8%+5), 2000Ω/20KΩ/200KΩ ± (0.8%+2), 20MΩ ± (1%+5), 200MΩ ± [5%(reading-10)+10]\n\n\n\nPACKAGE INCLUDES\n1 x Etekcity MSR-R500 Digital Multimeter\n\n2 x Test Leads (pair)\n\n1 x GP Supercell 6F22 9V Battery\n\n1 x User's Manual",
    "rating": 4.6,
    "feature_bullets": [
      "ACCURATELY MEASURES: AC/DC Voltage, Only for DC current (Not for AC current), resistance, diode, continuity, and more.Sampling Speed: 3 times per second",
      "EASE OF USE: Data Hold button holds a reading; large backlit LCD with large digits is easily visible in dimly lit areas. Built-in support stand allows for hand free use",
      "SAFETY PROTECTION: Overload protection on all ranges. Protective rubber sleeve around the multimeter adds extra drop protection",
      "HIGH QUALITY: CE & RoHS Certificated Product deserves your trust.",
      "NOTE: this multimeter cannot be used to test AC current! Please make sure the rotary switch is located at the right range during use."
    ],
    "specifications": {
      "Manufacturer": "Etekcity",
      "Part Number": "MSR-R500",
      "Item Weight": "5.5 ounces",
      "Product Dimensions": "5.1 x 2.9 x 1.4 inches",
      "Item model number": "MSR-R500",
      "Batteries": "1 9V batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Size": "MSR-R500",
      "Color": "Red",
      "Material": "Plastic",
      "Power Source": "Battery-powered",
      "Item Package Quantity": "1",
      "Measurement System": "Metric",
      "Display Style": "LCD",
      "Special Features": "✪ LCD Backlight display ✪ Hold Data ✪ Low Battery Indication ✪ Hands free testing ✪ Ergonomic design ✪ Overload Protection ✪ Buzzer Indicator",
      "Included Components": "1 x Etekcity Digital Multimeter, 2 x Test Leads",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Alkaline",
      "Warranty Description": "2-YEAR WARRANTY: 1-year buyer assurance",
      "ASIN": "B01N9QW620",
      "Customer Reviews": "4.6 out of 5 stars4,475 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#581 in Tools & Home Improvement",
      "Date First Available": "May 22, 2014"
    },
    "categories": [
      "Multi Testers",
      "Tools & Home Improvement",
      "Electrical",
      "Testers"
    ],
    "price": 10.34
  }
}