{
  "website_summaries": [
    {
      "verdict": "This balance ball chair offers some great perks, including a lifetime guarantee from the manufacturer and a removable back.",
      "pros": [
        "This all-black chair-ball combo has a sleek look",
        "Use or remove the back rest",
        "either way, the 52-centimeter ball helps reduce back pain while improving your posture",
        "Includes lockable castors and a hand pump"
      ],
      "cons": [
        "Only comes in black"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love this chair",
      "text": "I love this chair. I have lower back problems and sitting in a regular chair is very uncomfortable. I can sit for extended times because the ball conforms to my anatomy. I am 5'3\" and it fits me well. My friend, however, is only 5'0\" and her feet do not reach the ground so it doesn't work for her, so your height is important to making it work.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma Di",
      "helpful_votes": 41,
      "publication_date": 20170501
    },
    {
      "title": "Excellent chair. I waited too long to get one ...",
      "text": "Excellent chair. I waited too long to get one of these. My back feels much better and it is actually more comfortable than my old office chair! Only downside are the wheels. They are very basic. Easily fixed and I ordered some really good wheels online and now this is truly the best chair I have had to date.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy A. Hall",
      "helpful_votes": 25,
      "publication_date": 20180329
    },
    {
      "title": "nice chair",
      "text": "it doesn't come with a support bar but I have no problems needing one. 2 of my coworker fell off but they also didn't sit down on it correctly. Have to sit directly on top of it not half way, like if you were sitting on the edge of a chair. I feel a little more alert while using it. haven't felt any difference in my back but again my back pain could be from my bed and not my work chair. it nice and comfy to sit on. I'm 5 ft so the height is perfect for me. I'd but another.",
      "rating": 5.0,
      "verified": true,
      "author": "Drea",
      "helpful_votes": 24,
      "publication_date": 20170501
    },
    {
      "title": "Questions answered.",
      "text": "It's working well for me. I've had it for almost two weeks now and haven't had to blow the ball up again even once. A little on pressure on the back from time to time is fine. I am 5'8'' and found I didn't need the leg extenders so I plan to return those(separate purchase). The chair did not come with assembly instructions but there was a chat online option and all questions were answered within minutes. They were even willing to purchase a set of the leg extenders(from a different company) to help me figure out how to install or remove them(when needing to transport the chair in its box). They went over and above for customer satisfaction.",
      "rating": 5.0,
      "verified": true,
      "author": "Gratitude",
      "helpful_votes": 33,
      "publication_date": 20170507
    },
    {
      "title": "ball too small",
      "text": "so dissapointed. picture very misleading. the ball is so much smaller than the base. looks more like a children's chair.",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 16,
      "publication_date": 20190130
    },
    {
      "title": "Small Medicine Ball",
      "text": "I really wanted to like this chair but the manufacturer and seller clearly up sold this product. The medicine ball IS NOT even remotely close to the size that is pictured on the site. FALSE ADVERTISEMENT",
      "rating": 1.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 13,
      "publication_date": 20190619
    },
    {
      "title": "Safety concern",
      "text": "This chair is dangerous! The ball POPPED OUT from the frame. I fell forward and did a face plant on my desk. The frame zoomed away, broke a piece off of my cubicle and smashed into the cubicle across from me. Everyone in the office came running to see if I was OK. It made such a loud noise. This happened twice in two days. The safety of the product is questionable.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara Mitera",
      "helpful_votes": 11,
      "publication_date": 20190301
    },
    {
      "title": "Very disappointed.",
      "text": "After trying my co-workers product, I ordered this for work. Unfortunately, my item is no where near as comfortable. I have reinflated the ball per the instructions, and there is still little to no flexibility in the ball and adding any more air would feel as though I were sitting on a brick. Removing air would make the chair too short. Picture shows the size difference between my ball (black) and my coworkers ball (blue). I don't even use it because it is too uncomfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Tosha",
      "helpful_votes": 6,
      "publication_date": 20191122
    },
    {
      "title": "PharMeDoc balance ball chair is comfortable",
      "text": "I work from home and wanted this chair to exercise in on my breaks or lunch time. The first day I could only sit for halve the day. The next day almost till the end of work. But NOW I can sit all day and every day. I also use it for leg and core excercis! I love my balance ball chair!",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 11,
      "publication_date": 20181214
    },
    {
      "title": "Perfect fit",
      "text": "This chair is lightweight and very comfortable and is a perfect height for my desk at work. when I travel, my co-workers steal it to sit on while I'm away!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 14,
      "publication_date": 20170328
    },
    {
      "title": "Love it! Sellers fixed the small ball issue (if you email them)",
      "text": "Love my chair! At first it came with the smaller ball on the right, as many reviewers have said, it's much smaller - about 45cm. I contacted the seller and got a quick response, they were very nice and helped me out with no hassle. They sent the bigger ball (52cm) within a few days! Only drawback is that the wheel locks sometimes lock on their own, and there's this horrible grinding sound when you move, but some strategically-placed tape fixed it in a jiffy.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Vignoli",
      "helpful_votes": 6,
      "publication_date": 20190405
    },
    {
      "title": "I bought two of the Gaim brand name chairs, ...",
      "text": "I bought two of the Gaim brand name chairs, and then one of these thinking they would be the same thing. The ball is lesser quality and there is no metal bar holding the ball in the front which makes the chair hard to scoot forward and back. Spend the extra money and get the brand name one on this.",
      "rating": 1.0,
      "verified": true,
      "author": "narissa nelson",
      "helpful_votes": 11,
      "publication_date": 20170610
    },
    {
      "title": "Wheels make it easy for him to move around from classroom to classroom",
      "text": "Bought this for my son for school. Has made a huge difference for him with focusing during the day. Wheels make it easy for him to move around from classroom to classroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20170325
    },
    {
      "title": "Very happy with the chair",
      "text": "I am not sure how to rate this. . . It is more comfortable and a little less \"athletic\" than a ball alone. I read some reviews saying it didn't roll well, I haven't had an issue with that and I am a heavier person. Comes with a hand pump, so it was easy to inflate the ball to fit the base. It does sit a little lower than most chairs, and I am tall, so it may not work well at a normal desk height for shorter people. I am very pleased with it and have adjusted easily to it. I actually switched from a stand-up workstation, so that is quite a difference.",
      "rating": 4.0,
      "verified": true,
      "author": "duck mom",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great Chair for my Kindergarten Classroom!",
      "text": "Love my new chair! I ordered this chair as a replacement for my chair at work that was broken this summer. I had been frustrated trying to find the perfect chair for teaching and reading to my kindergartners. This chair without the casters is a perfect heigh for me. It is very comfortable and sturdy. It was easy to put together and light for easy moving and storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Hilary Lindsey",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "Warning: Only buy if you are under average height",
      "text": "Big disappointment. All of the positive reviews must be from people who are 5’2 and under. Chair was easy to assemble.. but... it is tiny. I am 5’6 and feel crunched on it. You cannot have the proper core support if you are of average height or taller with this chair. Big disappointment. I am waiting for information on how to return this. :-(",
      "rating": 1.0,
      "verified": true,
      "author": "E N",
      "helpful_votes": 3,
      "publication_date": 20190425
    },
    {
      "title": "Excellent chair with lumbar support,",
      "text": "This is an excellent ball chair especially for.people that have to sit at their desk continuously over a period of time. It helps reduce the stress on the spine, the weight is spread evenly and reduces back pain. The chair was recommended by a doctor and I am glad that I brought this. The included lumbar support prevents stiff back at the end of the day. Assembly was easy took less than five minutes. As mentioned in the description leave the ball half filled for a day , so it expands fully.",
      "rating": 5.0,
      "verified": true,
      "author": "gadgetgeek",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Great office chair replacement",
      "text": "I work from home and have used a traditional office chair for years but felt I needed something more comfortable. My first thought was to purchase an exercise ball, but thought it may be too low for my desk height. When I saw this chair with the back, I figured this would fit the bill. Well, I'm so happy I made this purchase. This chair is so comfortable; it only took a day or 2 to get used to balancing in it. If you are looking to replace a traditional office chair, you will not regret buying this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M. Dixon",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "One of the screws for the chair back would not ...",
      "text": "One of the screws for the chair back would not stay in when first put together. Then within a month the second one would not stay in. Two balls also deflated and will no longer hold air after only 3 months. Replacement was sent but again they deflated within 1 month. It looks like material near hole to fill was thin and ripped. My students and I are very disappointed in this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott D.",
      "helpful_votes": 6,
      "publication_date": 20170819
    },
    {
      "title": "Works for Us!!",
      "text": "Sooooo.. I order this ball chair to substitute as an office chair for my daughters (8yrs old) desk in her room & it is a total hit!!! She absolutely loves it! She sits and does her homework and rolls around her room in it! Super comfy and perfect height/size for her. She is tall for her age. The only gripe, minus not giving 5 stars is that I feel like a larger person, average adult even may find this kind of small in its stature. Totally works for my kiddo but would not for me. It’s very well made (ball & chair), easy to put together and I can see it lasting a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaykins",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "I love the chair and it came in quickly but I ...",
      "text": "I love the chair and it came in quickly but I didn't realize it didn't have the support bar in the front. Do not buy a ball chair without the support bar. The ball does not want to stay in the chair completely so it takes a little to actually get set down and comfortable. I contacted the seller to see if I could buy the bar and never got a response. I have looked at several website to see if you can buy just the bar and you can't. I wish I would have paid attention to the bar not being included and/or purchased one of the chairs from a different seller that had the bar.",
      "rating": 3.0,
      "verified": true,
      "author": "Aparton73",
      "helpful_votes": 14,
      "publication_date": 20170413
    },
    {
      "title": "Don't let your ball fill too full",
      "text": "If you're looking at the bad reviews and thinking \"oh maybe this is a poor quality chair and ball\" then you should know some of these folks are using the ball incorrectly. The instructions are very clear about inflating the ball to a 20 inch diameter. You can tell from the pictures posted the balls are inflated to near bursting. If you get your ball so full and heavy that they're about to burst, of course they're going to be uncomfortable to sit on. Read the instructions and get some of the pressure out of the ball before it spontaneously explodes as soon as you touch it.",
      "rating": 5.0,
      "verified": true,
      "author": "The Spider",
      "helpful_votes": 2,
      "publication_date": 20200410
    },
    {
      "title": "Cannot Lean Back",
      "text": "I don’t see how anyone could use the back rest. When you are centered on the top of the ball you are nowhere near it and there is too much space between the center of the ball and the back rest. Just an FYI. It’s not something I thought about before purchasing.",
      "rating": 4.0,
      "verified": true,
      "author": "Mavs",
      "helpful_votes": 4,
      "publication_date": 20190102
    },
    {
      "title": "Excellent chair",
      "text": "This chair is perfect. When I was shopping it was important that the roller ball had a back. I felt like it would add stability, but like several people mentioned I ended up taking it off. I mostly only used it to pull the chair out whenever I was going to sit down. Only complaint is that the wheel lock is right where the foot rests so I end up locking it a lot. I think I can move that wheel to the back, though. Easy to assemble, too",
      "rating": 5.0,
      "verified": true,
      "author": "Sophia Nava",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Good sitting",
      "text": "At first, I filled the ball with way too much air. But, I gradually reduced the air and found my own comfort level. I also had a gel seat cushion that I put on top of the ball just to see if it helped. I really do like the combo. The seat cushion has a cloth cover and provides the sensation of sitting on a flat surface, while the ball continues to provide ease in adjusting to a variety of positions. The back rest allows for just enough lower back support.",
      "rating": 5.0,
      "verified": true,
      "author": "MDO",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Very comfortable and height works for cubicle desk.",
      "text": "I bought this chair for my office, I removed the back because it made a rubbing sound. I work professionally at my desk 80% of the time. I suffered from lower back pain, bulging discs, herniated discs and could never exercise due to pain and injuries. Since using this chair the back pain is gone!!! Haven’t been to chiropractor and life is good, walking a lot and losing the weight. Highly recommend using this chair if you can relate to me. I wish I would had bought this chair long time ago!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 2,
      "publication_date": 20190828
    },
    {
      "title": "Product is unusable. Pictures do not match the product delivered.",
      "text": "How in the world is this ball supposed to work? Way to small. It doesn't even fit correctly in the chair. Now I have to return this and order a different one. Just don't buy this. Unless you need a chair for a preschool table.",
      "rating": 1.0,
      "verified": true,
      "author": "any name",
      "helpful_votes": 3,
      "publication_date": 20190811
    },
    {
      "title": "Fixed my sciatica pain in one day of use!",
      "text": "I’ve recently started working long hours on my computer, and was starting to get constant minor sciatica with frequent major flare-ups. After just 1 day of using this chair all day I have absolutely no sciatica pain. I’ve tried everything over the past couple months, including visits to a chiropractor, and this chair fixed the problem after just 1 day of use! Be forewarned- because sitting in this chair requires you to use muscles you likely don’t use a lot, it’s not comfortable at first. But if you’re dealing with back pain the discomfort of strengthening some muscles is well worth it to fix the back pain!",
      "rating": 5.0,
      "verified": true,
      "author": "BVW11",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Getting muscles just sitting...",
      "text": "I love this chair. I am a full time sitter at work and was having pain in my hips. Since ordering this chair I have no pain. The bounciness of the chair has increased my activity levels and my stomach and back muscles are feelin the workout. I'm trying to convince the whole office to go to these chairs. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "dlnelson316",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Good chair.  Only one drawback.",
      "text": "I've had the chair for a couple of weeks now and overall I really do like it. It is very easy to put together and is quite comfortable. It does make me sit straighter, but when I do want to lean back, the backrest is also comfortable. The only drawback are the wheels. I find it very difficult to move. The wheels so not seem to want to move in any one direction. I am also on a plastic mat at work. If I go off the edge, forget getting back over the edge without taking all of my weight off of the chair. Wish it had better wheels.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Disappointed",
      "text": "I was anxiously waiting for the chair to arrive only to be disappointed, the balance ball is too small. Not as pictured. It's going back.",
      "rating": 1.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 4,
      "publication_date": 20190709
    },
    {
      "title": "Great chair overall",
      "text": "I like most everything about it. Setup was of course easy. I love the lightweight feel and use of it all. The biggest problem I had was the 2 lock wheels seemed to lock on their own a LOT. It was frustrating. I ended up taking a couple pieces of electrical tape and running down and around the lock mechanism and that seems to work. The size could be a couple inches taller to help me better reach my keyboard and desk as this is it's purpose for me. But I make it work.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan C. Goodpasture",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "So far...so good",
      "text": "I bought this chair for my husband who sits at the computer a lot. He's also had 2 back surgeries in the past 2 years. His resent rehab included using the ball for exercises so I thought this chair work be good for him. So far, he's had it about 4 days and loves it! My only complaint is that it didn't come with any workout suggestions.",
      "rating": 4.0,
      "verified": true,
      "author": "Krystyna",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Ball too Small",
      "text": "The chair itself is perfect and very easy to assemble. However, I cannot use it yet because the ball is made for a five-year-old. It is not made for an adult to sit on at a normal height desk. I will have to go spend more money to buy an “adult” ball to be able to use my new seat. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Staci Precanico",
      "helpful_votes": 3,
      "publication_date": 20190822
    },
    {
      "title": "Well built, right size, daughter loves it!",
      "text": "My daughter loves this chair! After considering both the smaller version and this version I opted for this larger size. Daughter is 8 years old, 74 lbs and 54”. This size is perfect for her! We sent it into school and she uses it all day. The controller bouncing really helps her to regulate and use up all of the extra energy. This is a very sturdy and well built chair and I had no problems whatsoever with achieving the correct ball size.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Parent",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Fabulous",
      "text": "I am 72 and always wanted to try a ball chair so I got one for my husband and myself. OH MY GOSH...why did I wait? This feels a million times better than any office chair ever. The back support feels terrific and I am enjoying sitting on this. My husband and I are not small people, and I did wonder if he would like it because he is picky, but we are both sitting here on chair heaven! I get a lot of lower back pain and so far...so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Kral",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Fun desk chair",
      "text": "I found myself sitting all day at work and never moving. With this chair I am moving all day, even if it's only small bounces. I love it. My coworkers often ask to borrow it they like it so much.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Barnhart",
      "helpful_votes": 2,
      "publication_date": 20190127
    },
    {
      "title": "Helpful during pregnancy",
      "text": "I bought this chair to provide back support while pregnant. At 14 weeks along, I find it to be very comfortable and accommodating to my needs when I need to sit for extended periods of time at a desk. I notice the difference when I sit in regular chairs; glad I made this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Gretchen",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great for Posture but Faulty Wheel",
      "text": "This is a great chair and I can already see a difference in my posture. The reason I do not give it 5 stars is because of faulty locking wheel brake. Two of the wheels have a manual \"brake\" on them to prevent you from rolling around which is a great feature but one of these brakes automatically will flip which stops me in my course of rolling which is inconvenient. If they could perfect the brake wheels I would give it 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "not ideal for office",
      "text": "This would be a great chair if you are not on a rug, and are not a heavy person. The chair is a great idea but too short for an office desk and the ball rolls out if you roll the chair. you have to let the air out to get it snug in the circle",
      "rating": 3.0,
      "verified": true,
      "author": "jessica smith",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Nice chair...",
      "text": "Great chair for stability and posture improvement. I haven’t used it long enough to know if the pain relief part is there but I don’t feel uncomfortable or painful in the chair. The back is a little hard tho. Wouldn’t been 5 stars but it ended up being too short for me or the desk and luckily I saw the leg extenders and I will use them to correct. The seller might want to offer them on the same page as the chair as an add-on. I like the chair all in all. Good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "C.S.",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "LOVE LOVE LOVE!",
      "text": "LOL- I grimaced when it arrived (I hate putting things together) FIVE MINUTES LATER, I was blowing up the ball with the included pump. OMG- it is SO comfortable. I'm a middle school teacher and am on my feet constantly- so I needed something to take the pressure off my back when grading papers at home. This is IT.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Reader",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Who knew that this would be genius",
      "text": "I saw this at a dentists office and thought it was the greatest thing ever. I have very bad back problems and wanted something to wear I could sit for a long time and not be in pain. This was so worth the money. Even my kids who thought I was crazy loved it. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Annette M. Whitteberger",
      "helpful_votes": 3,
      "publication_date": 20171002
    },
    {
      "title": "I love this chair",
      "text": "I love this chair! I sit at my desk for very long periods of time and it feels good! My feet are flat on the floor and my back is straight. I have tried every chair and so far this is the winner! Easy to put together and the ball pumped up in no time at all with the provided pump.",
      "rating": 5.0,
      "verified": true,
      "author": "blakemon",
      "helpful_votes": 6,
      "publication_date": 20170406
    },
    {
      "title": "Comfy",
      "text": "Love it. Very sturdy but you have to be very careful when first sitting down. My only complaint is I constantly hit the lock buttons with my feet so I constantly have to unlock them to move around. The back rest is in just the right place for 5’4” me. I have had it for months now and haven’t had to pump it up yet so it seems to hold air well.",
      "rating": 4.0,
      "verified": true,
      "author": "lori",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Wish I'd bought it sooner",
      "text": "I recently had multi level ACDF surgery and have been focusing on improving my posture, especially when sitting at the computer to ease tension build up. I have heard about these chairs but never tried one so thought why not. I was concerned that the seat back would not provide support when sitting on the ball, but it is quite the opposite. I have only used for a week but can already tell a difference. It makes it very easy to sit up straight, and I would definitely recommend to anyone with neck/upper shoulder or lower back pain. My only complaint is that the wheel brakes are very sensitive and lock several times throughout the day - a minor inconvenience.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Fryman",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Dissapointed",
      "text": "I did a TON of research before purchasing this. I was very dissapointed as I had high hopes that it would be more comfortable than the office chair I purchased to work from home. The reviewers kept saying that if it's not comfortable then it isn't inflated enough. I have filled this thing up as much as possible and it's still not comfortable for more than a half hour or 45 minutes at most.",
      "rating": 3.0,
      "verified": true,
      "author": "Erika Marie",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Great!",
      "text": "It was exactly what I needed during this COVID-19 work from home chaos! No soar bum or back from sitting at my desk all day. I’m short (5’3”) and it was a good height for me. No dangling legs! I also like that I can bounce as a means for self-regulation. I bought this because I tried my co-workers chair when I was pregnant,... and I basically “borrowed” it for the full last trimester. Now,... I have my own!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda B.",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Very Stable",
      "text": "I did not like that the ball does not fit the chair well enough for me to sit on it. It's too high and round. I have a chair at work like this and it is super comfortable. This one is not.",
      "rating": 1.0,
      "verified": true,
      "author": "Trust Your Gut",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Size does matter....",
      "text": "I was so excited to receive my chair today only to open it and find a ball that way too small for the base. This ball is only about 35 cm and not the 52 cm that should have been included. I'm so disappointed. I can't really give any rating because I can't use the chair. However it was easy to assemble. UPDATE: I left the ball inflated for a day. The next day I deflated about half and reinflated. The ball expanded to full size.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli Harvey",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "No more sitting at the kids tables with aches",
      "text": "This chair is my saving grace. I work from home as a website designer, so sitting at the desk all day in an average chair has taken a toll on my back, posture, sciatic nerves, and the list goes on. This chair has helped me in so many ways. I have also ordered ones like this before, and the sizs were all wrong (too small for the price, and basically felt like I was sitting at the kids table for Christmas dinner). 100 out of 100 I would recommend this chair:):)",
      "rating": 5.0,
      "verified": true,
      "author": "TBT",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Office workers' salvation",
      "text": "I've always wanted to have one of these, now that I have it I can't imagine how I survived work without one. It's very comfortable, good height and mobile. I've noticed that I can tell the difference between the ball being slightly deflated and filled because my lower back will hurt if it's deflated. I pump it up at least once a week and it's nice to notice the changes in my posture.",
      "rating": 5.0,
      "verified": true,
      "author": "Karman Gaea",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Cracks my back like those chairs from middle school",
      "text": "Not only is this chair nice and comfortable (I put a cover over the ball so my legs don't stick to it, you can find them online), but it is SPECTACULAR at cracking my back. I was able to disassemble it when I moved and put it back together really easily. It was absolutely a worthwhile purchase, and I definitely recommend getting a cover for the ball, as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul S.",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good quality but shorter than you think",
      "text": "You have to inflate the ball, wait a night and then inflate it again before you get the ball's true size, but even then it's a little on the short side and to get it close to a good height you have to make the ball really hard which in turn sort of pinches the nerves in my bum after about 20 minutes.",
      "rating": 3.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Very comfortable!!!!",
      "text": "Super easy to put together. It took me less than 5 mins. Directions easy to follow. The chair is very comfortable and is low and I am short so it fits me perfectly. The wheels are not the greatest. But as another reviewer mentioned I could switch them out if needed but for the price, the chair is a good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Reading with an open mind",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Not safe for me",
      "text": "It was very easy to assemble this chair. It proved to be too unstable for me, and I ended up falling after trying to get up off the chair. The ball popped out, the chair shot across the floor, and I landed on my back. I think it's time for me to rethink my choices for a computer chair.",
      "rating": 3.0,
      "verified": true,
      "author": "SandalWearer",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Very pleased!",
      "text": "Love the chair. Sellers easily corrected a problem right after it arrived. I really like the chair and was worried I might have an issue. They got right on it and made it right. It is perfect and I’d take a picture , but I use it at work. I am not at work right now. I’d recommend to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Perfect for working from home!",
      "text": "I put this together on my lunch break today and I’m already loving it this afternoon! Now that I’m working from home, the right chair is essential- this one is exactly what I needed. I also like that I can take the ball out and use it for exercise. Great purchase!! Totally worth the $.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Overall good purchase",
      "text": "I bought this chair because I’ve been sitting/bouncing on an exercise ball to help put my 3 months old baby to sleep. My back has started hurting so I decided to buy an exercise ball chair. I was happy with the overall quality of the product. It was easy to assemble. My only complaint was I thought that actual exercise ball would be bigger. You can see in my pictures the difference in size between the ball I was using and the new ball chair, as well as my couch to the size of the chair.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "I love my ball chair!",
      "text": "I work from home and I was looking for a comfortable chair to sit on all day. This has been great for posture & your core muscles. Also love the little bounce you can add to your day when your favorite jam comes on...",
      "rating": 5.0,
      "verified": true,
      "author": "Jeni Hogue",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Smartest Home Office Purchase!!",
      "text": "Having to work from home in response to COVID19 left me with back pain due to an inadequate home office chair. I ordered the balance ball for my home office. Great price and so quick and easy to assemble!! Best part is the chair is very comfortable!! I can now easily sit at my desk for hours without back pain!! Perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tlcd",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Very comfortable and reasonable price!",
      "text": "I was looking for a chair like this for several months until I found out this one. It was easy to assemble and very stable. I do recommend it if you are looking for a chair that \"challenge\" you if you spend most of your days sitting. Totally recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda H.",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Missing part...",
      "text": "Was excited to receive this but It came without a ball plug so I could not inflate the ball and therefore use the chair. Will need to either return it for a refund or buy the plug. Very inconvenient.",
      "rating": 1.0,
      "verified": true,
      "author": "RAO",
      "helpful_votes": 4,
      "publication_date": 20171024
    },
    {
      "title": "too small",
      "text": "you sit too low on this for a desk. also the size of the ball is uncomfortable for anyone 170lbs and up as it presses on your tail bone and makes your ass hurt after a while",
      "rating": 3.0,
      "verified": true,
      "author": "jasmyn1234",
      "helpful_votes": 2,
      "publication_date": 20190627
    },
    {
      "title": "Where has this been my whole life!?",
      "text": "I wish I had bought this much sooner. My office chair at work was killing my back, I was diagnosed with sciatica. I ordered this after borrowing a coworker's and finding pain relief. It has helped with the pain and my posture. The first time I filled the ball I was sure I would need to order the extenders, but after stretching and filling it more it is the perfect height.",
      "rating": 5.0,
      "verified": true,
      "author": "+Jess",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Perfect for back relief!",
      "text": "With current work-from-home likely to continue for quite some time, I have had to attend many long conference calls. I developed back pain that did not seem to go away. I replaced my very old chair with this stability ball chair and made a conscious effort to stand more. A week later my back is much better. This chair was not high enough for me - I am 5'11\" - so I needed leg extenders. I took a chance and ordered the leg extenders in the \"frequently bought together\" listing and they fit perfectly, even though product says they only fit another brand.",
      "rating": 5.0,
      "verified": true,
      "author": "M Naftel",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Good value",
      "text": "Got for work to alternate from my regular chair and to have for clients who have sensory issues. Works great, fair price. Only complaint the wheel locks self engage somehow and becomes a nuisance when you go to roll away from desk or around floor for any reason.",
      "rating": 5.0,
      "verified": true,
      "author": "LAB",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Surprise! Condition your body parts.",
      "text": "The first several days are pretty hard on the back. The couple weeks after that are painful. I believe this gave me a hemroid because if the added concentrated pressure in my backside. I’m not giving up on it but will be careful how many hours a day I actually sit in it.",
      "rating": 2.0,
      "verified": true,
      "author": "sjeegam",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Not comfortable for extended use.",
      "text": "I tried this chair out and after a week of use gave it away. It was not comfortable for all day computer use. The backrest rubbed a raw spot on my back. The ball itself might be useful for exercise. Smaller overall than anticipated and I am only 5 ft 3 incces tall. Overall I wasted my $.",
      "rating": 2.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Great customer service!",
      "text": "I had a problem with the first one I received. Reached out to customer service and they promptly sent out a replacement. I love using this chair and love the customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "bsr4397",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "You won’t regret this purchase!!",
      "text": "Received my balance ball and was so excited as I’ve just started work from home and wanted something that would help work my core and combat the 10 hour sitting work days. This does the trick perfectly!! Extremely easy to assemble, I’m looking forward to using this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Philsfew",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Favorite seat in the house",
      "text": "This balance ball is my favorite seat in our home. It is also my son's so I have a second in my cart right now. We bought it to for the fidget factor while we do homeschool and it does not disappoint. A really wonderful chair. I originally bought a smaller one, but it was too small for my 8 year old. This one is just the right size for his age and up. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "JStace",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Fast and easy to setup",
      "text": "This was an easy setup. even pumping up the ball was quick. I replaced the wheels with others that i had bought that will not damage hardwood floors so I can't say anything about its wheels. Definitely forces good posture. It's a little hard when you start to stay sitting on it for a day of work, but I alternated with a regular chair until I got used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Bottelberghe",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Surpassed my expectations",
      "text": "I bought this as a gift for my RN gf for her office. And she (and her co-workers) love it. I did a lot of research beforehand and my two main concerns when purchasing after reading countless reviews were: 1) Would it be tall enough (she's 5'10) & 2) Would it be stable enough (lots of people complaining about the \"missing\" cheap stability bar)? But both of my concerns were alleviated. It's the perfect height for most desks and as long as you don't have plans of rolling around with it a lot (she stays stationary when in her office), it's perfectly stable. And the bonus was how simple it was to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "carl keasler",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Wrong yoga Ball sent, too small, poor customer service",
      "text": "Ball chair came and the yoga Ball was way smaller than the described size. I only measured 45cm diameter instead of the 52cm diameter in the product description. Because it's too small the chair became way too short for me to use at any desk. Contacted customer service for this issue and haven't heard anything back for three days.",
      "rating": 2.0,
      "verified": true,
      "author": "Jun",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Better Posture Less Pain",
      "text": "I work at a computer and bought this chair to force myself to use better posture. The chair is comfortable and easy to use. Better posture equals fewer backaches. I did purchase leg extensions from another seller which made the chair height even better for me. I'm 5'9\".",
      "rating": 5.0,
      "verified": true,
      "author": "BamaGramma",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Might work great if you are tall.",
      "text": "I am still getting use to this chair. I am a short person and it is taking getting use to. I read all the reviews before purchasing. I will say, however, that my legs and back do not hurt when I sit on it. So that is the main reason that I have not returned this chair. It actually does help my legs and back when I work on the computer for long periods of time.",
      "rating": 3.0,
      "verified": true,
      "author": "Tina Quesenberry",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Great for your health!",
      "text": "Love this chair! I sit all day at work and I was always stiff standing up after long periods of sitting in a regular office chair. Now after sitting for long periods of time on the balance ball I am no longer stiff when when I stand up. I’ve also heard I’m burning 3x the calories than I used to. Additionally, recently being pregnant this is a great option for mom’s who sit all day, sitting on a ball is good for strengthening your core which is necessary for birth and helps baby to stay/move into the correct position for delivery. Best purchase I’ve made in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "rebecca elliott",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Awesome chair!",
      "text": "My back used to hurt a lot sitting in those uncomfortable school provided chairs. It’s great for my classroom small group table/desk. I have recommended it to family and friends!",
      "rating": 5.0,
      "verified": true,
      "author": "Kai",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "NO MORE NECK PAIN",
      "text": "This chair ball really does help when you have to work at a desk. I could not find a chair that would not make my neck hurt after setting at my desk for a time. I got this chair ball and I really have NOT had any neck pain no matter how long I work at my desk anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hemsath",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Too low to the ground",
      "text": "I inflated the ball to its full capacity as instructed, but this chair is still too low to the ground for me to reach my desk comfortably. I'm 5'7\" and need to return it. The seller gave me a refund and said that I don't need to mail it back. I'm really surprised about all the positive reviews- people must be using very low desks!",
      "rating": 2.0,
      "verified": true,
      "author": "Ingrid ",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Comfortable, fun, and relieves back pain!",
      "text": "I have used many office chairs but still had an aching back after work. Since I sit at a desk all day, I needed to try something different. I had already tried a standing desk. I bought the balance ball chair and I have not been as comfortable as I am now. After sitting all day ( and bouncing a bit) my back hardly hurts! I ordered a second one to use at home",
      "rating": 5.0,
      "verified": true,
      "author": "Marsha Carey",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great except that the casters lock too easily",
      "text": "I love this chair. The height is nice and the ability to roll around is great, too. The only negative is that my foot always hits (and locks) the mechanism on the caster which prevents me from moving/rolling until I lean down and unlock it. It’s poorly placed. Otherwise, I’m a huge fan!",
      "rating": 5.0,
      "verified": true,
      "author": "KimmyNor4",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Definitely Worth It",
      "text": "I read the positive and negative reviews before I bought this chair. I agree with the positive. It's a great little chair and very comfortable. I don't have back problems, but the chair I was using wasn't comfortable, so I purchased the balance ball chair. This chair is super comfortable and helps me sit-up straight. I'm a sloucher. As for the negative reviews about the ball not being big enough, I don't know what you're talking about. Maybe you missed parts of the directions. In general, well worth the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "A Customer",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Made for a child!",
      "text": "Made for a child. Way too small. I was expecting a ball and chair like the one i had when i worked at a gym. This has got a weight limit of about 150 im guessing and the seat part is cheap. I am very disappointed. I'm still using it but its just not the same quality or size as all the other ones ive seen.",
      "rating": 2.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 3,
      "publication_date": 20190305
    },
    {
      "title": "Good seller",
      "text": "Customer service for the seller is awesome the chair it self is nice and sturdy but without a bar across the front to stabilize the ball in place in our Application the ball continues to roll forward when trying to scoot forward",
      "rating": 4.0,
      "verified": true,
      "author": "Ron Dale",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Good Value",
      "text": "The only thing preventing 5 stars is that the casters do not allow you to change direction easily. They roll just fine, smooth in fact. I've used on both industrial carpet and also on a high quality chair mat and changing direction is not easy. but overall this is a great chair for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "ball broke after 1 month",
      "text": "I am 5'5\" 145 lb, and the ball broke after 1 month use, I emailed the vendor, got a new ball, then 2 week later, it broke again, I want to continue to use the chair, so I bought a new one from another vendor, it has been working fine for over 6 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Sf",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Great purchase! Many teachers use!",
      "text": "The ball seems to be sturdy rubber and is comfortable in many positions. I have not given it the hours of use I know it will get in the coming months, but it assembled quickly and is already providing good alternative to chairs! I have neck problems and this seems to keep me in a better position while sitting to alleviate severe neck problems!",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Good, but not great...",
      "text": "I’ve used/liked ball chairs in the past, and In principle, it’s what I ordered, but it’s not as helpful as I’d hoped. The plastic construction of the backrest is likely to give from any serious weight being applied and, even more problematic: it’s simply sits too low to the ground to use at some tables. So, do I use it? Yes, and it does provide the posture adjustment, but it’s not as universally useful as I had hoped.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul Bessemer",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Glad I ordered this ball chair!",
      "text": "After reading many reviews I decided to give this ball chair a chance. I just transitioned from working in an office to working from home. I was sitting on a kitchen chair and my back and hips hurt so bad. I ordered this chair and it’s been great! My husband thought I was crazy for wanting to sit on it all day but for me it’s wonderful. My tailbone was injured in an accident about 10 years ago so when I first got the ball chair my tailbone hurt but it no longer hurts so it got used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "S.nicholls",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Comfortable ball chair",
      "text": "I bought this to help my 13 yr old son who has autism and sensory issues. It helps him focus while doing schoolwork. It’s the perfect size for him to sit on. My mom has also borrowed it for her computer work. She says it helps her have less back pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Great for Lash Artists!",
      "text": "I use this chair as part of my job, which is applying eyelash extensions. As a lash artist I’m hunched over a lot and this chair has done wonders for my lower back. I no longer feel like I need to lay down when I get home, I leave work feeling just as good as when I walked in. It’s small so it doesn’t take up a lot of space, super easy to assemble and I like that you can lock the wheels. I would definitely buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Jocelyn Santiago ",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "... took a while to get used to but I like the ball chair a lot now",
      "text": "It's took a while to get used to but I like the ball chair a lot now. I have much less back and shoulder pain using this chair at my work desk than my prior chair.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara E",
      "helpful_votes": 3,
      "publication_date": 20170505
    },
    {
      "title": "Junk and missing Parts",
      "text": "Complete piece of foreign made garbage. PHARMEDOC LACKS the slightest QA testing as they sell yoga chairs with 3 legs. Don’t buy this useless paperweight unless you have extra parts and want to support an unethical brand like PHARMEDOC.",
      "rating": 1.0,
      "verified": true,
      "author": "Vincent V",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Great support",
      "text": "This chair helps with my posture and I'm not in pain from sitting for hours at a time.",
      "rating": 5.0,
      "verified": true,
      "author": "TheAdaB",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Do not recommend!",
      "text": "This ball chair is great beside the fact that it does not come with the bar across the front to keep the chair from flying underneath you! I have fallen out of this chair about 5 times and looked to purchase just the bar and couldn't find. Do yourself a favor and buy one with the br.",
      "rating": 2.0,
      "verified": true,
      "author": "Griffis A.",
      "helpful_votes": 2,
      "publication_date": 20190225
    },
    {
      "title": "Great for posture",
      "text": "This helps my posture while typing and studying. Ball a bit smaller than I thought it would be. I am 5’9” so the height is lower for me, between the ball and chair. My 14 year old loves using it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Leigh Sexton ",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Great compromise between sitting on a ball and sitting in a chair.",
      "text": "I like this chair because I can lean back for a little break from sitting up straight and don't need to switch to a chair to do that. The back hits nicely for some lumbar support when you need it. It's easy to fill and it came with a spare stopper - which is a nice bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Meyer",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Comfortable desk chair",
      "text": "This chair is super great. I'm using it right now. The height is perfect for me, but then I did purchase the 2\" extender legs. I definitely recommend this chair to anyone thinking of purchasing it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Jurkowski",
      "helpful_votes": 0,
      "publication_date": 20200207
    }
  ],
  "product_meta": {
    "title": "PharMeDoc Balance Ball Chair with Back Support for Home and Office w/Exercise Ball, Pump, Removable Back & Lockable Wheels",
    "rating": 4.4,
    "feature_bullets": [
      "Reduce back pain and improve the way you sit with our efficient balance ball chair",
      "Multifunctional chair has a removable back and compact size stores easily",
      "Includes 52 cm exercise ball and hand pump to optimize bounceability",
      "Lockable wheels stays in place for safety and eliminates rolling away",
      "Lifetime Manufacturer Warranty 100% Satisfaction Guaranteed Designed in California"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "31 x 22 x 23 inches; 3 Pounds",
      "Item model number": "FBA_PMD-BBC-01",
      "Date First Available": "December 29, 2016",
      "Manufacturer": "PharMeDoc",
      "ASIN": "B01NH13TYQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Accessories",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Exercise Balls & Accessories",
      "Exercise Ball Chairs"
    ],
    "price": ""
  }
}