{
  "website_summaries": [
    {
      "verdict": "A good, affordable choice for those who want to be able to sync the scale with their favorite fitness app.",
      "pros": [
        "Works with an app that you can download from the Apple App Store or Google Play and sync with a variety of fitness apps",
        "Tracks body weight, fat, water, etc",
        "Easy setup"
      ],
      "cons": [
        "Does not work with some devices",
        "Buyers report some problems with accuracy and that some features fail after a few months"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Tanita vs. Renpho.",
      "text": "Loive this scale. Here is the comparison to the tanita (extremely expensive clinic scale) scale.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Peters",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Very cool scale that syncs to my Fitbit!",
      "text": "Nice scale! It seems accurate, since it says the same weight over several tries and it’s great that it syncs easily to my Fitbit app! You will get all the data once you download the app, but only get the weight displayed on the actual scale. It will be good to get accurate weights to track my progress, and for just a little more cost than a regular scale. I keep it in the kitchen as a little added incentive when I go to the fridge...lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 235,
      "publication_date": 20180628
    },
    {
      "title": "Buyer Beware",
      "text": "Update: I originally gave this product a 4 star, today I placed the scale on my tile bathroom floor to use, as I have done for the past 7 months, and it shattered in a million pieces. Needless to say I am am not happy in the least. Now, I have to purchase another one, ugh. I love this scale and it's ability to sync information with my smartphone. It's helpful to have information such as BMI, body water, etc., to track.",
      "rating": 1.0,
      "verified": true,
      "author": "Ladybutterfly",
      "helpful_votes": 207,
      "publication_date": 20180325
    },
    {
      "title": "Great customer service and a great scale",
      "text": "Burned through batteries fast and then it made the batteries corrode and ruined the scale where it wont work anymore. Owned it less than a year before it stopped working. Update from 2 stars to 5. This company has amazing customer service. They seen my bad review and messaged me immediately and they sent me out a replacement. They had a defective screw that rusts they have corrected. I got the replacement within 2 days. So worth buying and it really is a great scale from a company that has awesome customer service that makes it worth my time and money!",
      "rating": 5.0,
      "verified": true,
      "author": "krisgrody",
      "helpful_votes": 99,
      "publication_date": 20180809
    },
    {
      "title": "Major battery issues",
      "text": "I've had this scale since last August but I've had a lot of problems with it. I love that it can give all the different variables and I find it is pretty accurate with actual weight. However I've had to replace the batteries in it a million times, sometimes every couple weeks and it's weird because I can take the batteries out and then put new ones in them out the old ones back in and it works again. Sometimes I was doing this every few days. I was really excited about this scale and its definitely something I really wanted to work and that's why I put up with the frustration so long.",
      "rating": 1.0,
      "verified": true,
      "author": "Brianne Lovvorn",
      "helpful_votes": 149,
      "publication_date": 20180429
    },
    {
      "title": "The best scale ever made",
      "text": "This will tell you lore then you ever wanted to know about your fat body. A great value for all the data it provides. The app is easy to use. You can also set up multiple users. I underwent a comprehensive body scan at my doctors and the numbers synced up. I have recommended this scale to many people. The scale will only tell you pounds but it will connect to the app if your phone is near to give you the other data.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Carter",
      "helpful_votes": 76,
      "publication_date": 20190310
    },
    {
      "title": "Great Scale",
      "text": "I bought this scale because my old scale would show my weight +/- 10 lbs in the same day and give me 3 different weights in 2 minutes. This scale is much more accurate, and I love that it sinks to your phone and can analyze BMI. Occasionally, it will be a little off, but nothing like my last scale, and I think that's only happened once or twice.",
      "rating": 5.0,
      "verified": true,
      "author": "MarissaTop Contributor: Pets",
      "helpful_votes": 198,
      "publication_date": 20170713
    },
    {
      "title": "Cheap Piece of Junk- Just a way to get your info",
      "text": "What a piece of junk. Looks and feels like a cheap scale. Tried to pair with app many times, following all troubleshooting tips and never worked. Of course, they want your email address, name, DOB and height/weight to sign up for the account before you can even see if the thing works. Even as a scale alone, it was wildly inaccurate. I weigh 122- the first measurement said 110??? And the subsequent between 124-125-changing as I stood on it. Needless to say, it’s going back.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 58,
      "publication_date": 20190208
    },
    {
      "title": "I wanted to like this thing",
      "text": "I’ll be returning. I wanted to like this thing. But huge weight variances (3 or 4 pound) every time you get on it within a couple minute time frame. I guess I’ll keep my cheap Taylor",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 80,
      "publication_date": 20180426
    },
    {
      "title": "Love the idea but execution fails",
      "text": "The scale itself looks quite nice and feels substantial but it is essentially unusable other than getting a standard bodyweight measurement. The majority of the functionality of the scale comes through the app which, currently, won't even let me sync to the scale. I love the idea of this product but having the centerpiece not work out of the box is a deal breaker. I am in the process of returning it now for a refund. I'm not willing to hold onto it in the hopes that the app is fixed only to have the return period expire. I really had high hopes for this product but I would not recommend it",
      "rating": 1.0,
      "verified": true,
      "author": "Fudoshin",
      "helpful_votes": 110,
      "publication_date": 20190105
    },
    {
      "title": "Bonus features don’t work",
      "text": "This scale is trash. The only thing it’s good for is your weight. That’s accurate. I wanted something a the house to track my progressions daily. This scale is not that. In 4 weeks it says I’ve gone from 28.2%bf to 27.5%bf. I go get scans done monthly, I went from 16%bf to 11.5%bf. This scale is bogus. At least it looks nice and the weight is accurate, all the other “bonus” features are inaccurate are useless",
      "rating": 1.0,
      "verified": true,
      "author": "Benny Clayton",
      "helpful_votes": 130,
      "publication_date": 20180302
    },
    {
      "title": "Does not use bio impedence",
      "text": "The idea of this scale is really cool, but once again what do you expect for a few bucks. Went to a trainer for real body fat comp and BMI and was wildly different from this scale. I believe this scale takes nothing more then your weight and plugs it into an equation for the rest. I would give it 4 stars if it was advertised and sold as a Bluetooth scale that tracks weight through your phone but unfortunately they are trying to sell you on something that doesn’t seem to work on this device.",
      "rating": 1.0,
      "verified": true,
      "author": "Stijn Cos",
      "helpful_votes": 32,
      "publication_date": 20190422
    },
    {
      "title": "Tech Savvy",
      "text": "Hands down...this is the best scale I've ever own...it's tech savvy....it will show your body fat percentage, BMI, water weight percentage, etc... and underneath it has scales showing the healthy range and definitions under each heading! I downloaded the app...so, it works with your smart phone...you'll be able to access weighing dates/data, progress, etc....it's pretty accurate and sensitive....I'm the type that will weigh myself 3 times consecutively....looking for consistency....it's on point!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ade O. Ogunmokun",
      "helpful_votes": 56,
      "publication_date": 20180119
    },
    {
      "title": "Great for Gastric Bypass Patients!!!",
      "text": "I had Gastric Bypass 4 and a half months ago and I WISH I would have bought this scale sooner! I started off at 300lbs but I don’t know what all my stats were at the time. Now I’m down 87lbs and I just got this scale in today and I learned so much more about my body. Now I know where I need to further improve myself, on top of losing weight of course. I shared this in my WLS Facebook community and a dozen or more WLS patients bought it. Looove it *thumbs up*",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 46,
      "publication_date": 20180311
    },
    {
      "title": "Does not seem use impedence to measure body composition",
      "text": "I tried to trick the device into displaying different body compositions (putting down aluminum foil and wearing socks, having somebody lighter than me stand on the scale with weights strapped on to make up the difference, etc) but the app showed the exact same figures for each one. Since no tricks designed to defeat the scale actually tricked the scale, it would seem that the BIA features are either poor or faked to begin with. I guess it works fine as a bluetooth scale but the BIA is dubious at best.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 101,
      "publication_date": 20181229
    },
    {
      "title": "Was great...while it lasted.",
      "text": "The scale was amazing....at first. I purchased it back in December. I kept getting this low message and I figured it was just the batteries. I replaced the batteries and now I kept getting an error message. Well now I get no message & it has fresh batteries... very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 54,
      "publication_date": 20180508
    },
    {
      "title": "Doesn't measure anything... Total hoax",
      "text": "I bought this scale based off that it said it would measure body fat, vs muscle mass. I am a big guy and weigh more than my average weight. However my muscle mass is very high due to the fact I lift weights every day. This scale is complete garbage. It doesn't mesure anything correctly. It said I was way low on muscle mass and way high on fat. Total bullsh*t! All this thing does is go off of the height you input and then goes off of the weight on the scale... It doesn't measure anything! Complete trash waste of money. Just buy a normal scale ...",
      "rating": 1.0,
      "verified": true,
      "author": "J. Griffith",
      "helpful_votes": 21,
      "publication_date": 20190312
    },
    {
      "title": "Awesome scale! Awesome price!",
      "text": "I started weight training about 6 months ago and use this scale as a way to track my progress. It's very accurate and tracks trends in the mobile app. I haven't ever had a single issue with the bluetooth function. The app is very intuitive. I use the built in sharing feature for posting screenshots to social media or my online coach. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Stevenson",
      "helpful_votes": 18,
      "publication_date": 20190322
    },
    {
      "title": "Decent scale.",
      "text": "Decent scale for the price. Syncs with Fitbit which is nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Tamara M.",
      "helpful_votes": 21,
      "publication_date": 20190101
    },
    {
      "title": "Scale shows incorrect weight",
      "text": "The scale gives very innacurate readings. Just purchased the RENPHO scale and my weight reading was 10lbs lighter than in my old scale which seemed way off. I decided to put 20lbs of dumbells on the scale to see how accurate the RENPHO scale was and the reading came in at 16.4lbs confirming my suspicion. I moved the scale to try to recalibrate but had the same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Carlos Campos",
      "helpful_votes": 104,
      "publication_date": 20181121
    },
    {
      "title": "Accurate , or not?",
      "text": "Very easy to use, plug and play really. Only reason for giving it 4 points is that the body fat measure might be off. I saw my doctor a couple of days prior to receiving the scale and I was 24%BF on the doktoras scale and 28% on the RENPHO scale. I am not to concerned as I am looking at the longer term trend but I would expect a better accuracy. How do I find out if it is accurate or not?",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 252,
      "publication_date": 20171017
    },
    {
      "title": "Great Scale",
      "text": "I had no idea the measurements a scale could possibly do until I purchased this. I'm quite impressed because I know exactly what I'm lacking and where my weight is coming from. It also helps to plan what to work on next if it's taking more water in or doing more exercise. My husband and I both use it but we make sure that one of us is logged out on our phone before the other uses it so it will log appropriately.",
      "rating": 5.0,
      "verified": true,
      "author": "BARB",
      "helpful_votes": 13,
      "publication_date": 20190311
    },
    {
      "title": "You'll be lucky if it makes it past the warranty period.",
      "text": "If I could give it negative stars I would have. Despite all the good reviews, my scale just stopped working a little after a year (warranty is one year), and the lady I spoke to at the manufactures customer service could care less. She told me that sometimes they last six months, sometimes they last two years, and it was out of warranty and all they could do was offer me a discount code on a new one. It's quite arrogant of her to even think I'd buy another one of their products. With all the other scales out there, don't waste your time with this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrea Stegmeier",
      "helpful_votes": 11,
      "publication_date": 20190426
    },
    {
      "title": "Not accurate enough",
      "text": "It looks super modern and I love that the app will update and track your weight. However, it’s not very accurate. It’s actually not accurate at all. My previous weight machine told me I was around 136 lbs. This one tells me I’m 142 lbs. at first I thought...oh well it’s quarantine I might’ve gained a little weight. But the very next day it told me I’m 146....and then later that day I’m 140. While this whole time I have actually been dieting and physically see that I am thinner. Needless to say I am confused with the reading.",
      "rating": 2.0,
      "verified": true,
      "author": "Kate Ryasati",
      "helpful_votes": 7,
      "publication_date": 20200514
    },
    {
      "title": "Not bad!",
      "text": "I'm so sad to do this, but its my third review, so I feel I have to. The scale I received was broken, and the company replaced it no hassle and no charge, which was great. But the scale I got in replacement was only good until the batteries died. Changing the batteries APPARENTLY helped me loose 40lbs! Wow yay wait that's horrible wrong. I've only owned it 6months if that, but this scales already a liar, and you can do better at the same price or cheaper elsewhere. Sorry renpho. Let me know if there is some \"troubleshooting\" I missed that aides in this nonsense. Otherwise, waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue Lake",
      "helpful_votes": 12,
      "publication_date": 20181212
    },
    {
      "title": "Good quality",
      "text": "In appears to be built of good quality. The pounds is only 2/10’s from my other scale. As far as all of the other readings I am using them as a guide for changes. If it is accurate or not I have no way of knowing. Great app. Recommend it, hard to go wrong at that price.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul H. Harrison",
      "helpful_votes": 16,
      "publication_date": 20180130
    },
    {
      "title": "Disposable scale",
      "text": "I was pleased with the scale and the app. I was able to track stats on multiple users. I went to use it one morning, like all the times before and the screen showed \"Lo\", so I replaced the batteries. Went to use the scale and nothing happened. I verified the batteries were good and installed correctly, the scale is dead. I emailed the seller but have not heard back. Luckily I didn't spend too much money on the initial purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 10,
      "publication_date": 20190311
    },
    {
      "title": "So far so good. I bought talk to the fitbit app",
      "text": "So far so good. I bought talk to the fitbit app. My only concern is how it links to fitbit as sometimes the weights don't show up right away...NOTE: this could be the fitbit app as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph J Closson",
      "helpful_votes": 16,
      "publication_date": 20180125
    },
    {
      "title": "Waste of money",
      "text": "Inaccurate weights, I possible can't be losing or gaining within minutes..also the app needs to be opened every time you weigh in so as to sync...very disappointed...will stick to my normal $10 digital scale..",
      "rating": 1.0,
      "verified": true,
      "author": "Compulsive Shopper",
      "helpful_votes": 48,
      "publication_date": 20171106
    },
    {
      "title": "not accurate at all",
      "text": "I'm surprised that this product got such good reviews... I was happy at first but after a few months of use I realized the numbers were totally wrong-- my weight varied dramatically when weighing myself back to back. I'm really sad I can't return it anymore. What a waste of money...",
      "rating": 1.0,
      "verified": true,
      "author": "c",
      "helpful_votes": 29,
      "publication_date": 20171128
    },
    {
      "title": "Came 5 days early and free shipping!",
      "text": "Exactly as pictured and described. Simple easy setup and use. Gives you so much more info than the average scale!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 13,
      "publication_date": 20190321
    },
    {
      "title": "Good deal but take measurements with a grain of salt",
      "text": "This is pretty neat and stilish scale. It comes with batteries but are temporary and they tell you to replace them within a month. App is handy to track your progress and works flawlessly on iphone. I am not sure how accurate the measurements are, especially because switching between “normal” and “athlete” mode yeld to drastic changes which are like a constant shift and across multiple measurements (it means they derive several measurements from one using a formula instead of measuring them directly). For instance, body fat percentage seems largely linked to weight, irrespectively of your muscle mass.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcello Tomasini",
      "helpful_votes": 6,
      "publication_date": 20181211
    },
    {
      "title": "Good hardware but app ruins the product",
      "text": "Scale itself it good quality, but I wanted a scale that connects to my FItbit. To do so you must use their app, but the app requires ridiculous permissions. Why does a scale need access to my contacts or permission to make phone calls? The app ruins a good product. Will be returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "ml",
      "helpful_votes": 9,
      "publication_date": 20180911
    },
    {
      "title": "Good scale but very flimsy feet- excellent customer service though",
      "text": "Iva hd this for barely 7 months. It sits on a tile floor and is never moved. Within a few short months one of the feet broke off, shortly thereafter others followed. Each of the four feet seems to be attached by one single weld that breaks easily. Use caution ordering this. Before you ask this scale has two users, each weighs less than 200 lbs. **Update December 2018: The sellers saw this review and sent me a brand new scale free of charge. Functionality has always been good with this, and it is accurate despite reviews that say otherwise. Functions well with my iPhone and wife’s Samsung.",
      "rating": 4.0,
      "verified": true,
      "author": "Martin Murat",
      "helpful_votes": 5,
      "publication_date": 20181106
    },
    {
      "title": "Worked for about 2 months...",
      "text": "I like the scale but it only worked for about 2 months. Then the battery connector rusted...yes rusted, and it stopped working. Never even got the chance to try out any of the bluetooth capabilities. UPDATE: The company sent me out a replacement scale. I hadn't realized they had emailed me to ask about the product and when I didn't respond they went ahead and sent one as a replacement. Happy about that so I'm hoping the rust on the battery connector was just a fluke and this one lasts a good long time! Thanks iDOO World.",
      "rating": 4.0,
      "verified": true,
      "author": "CQ019",
      "helpful_votes": 5,
      "publication_date": 20181211
    },
    {
      "title": "Caution with buying this product / not easy to pair with mobile device",
      "text": "I gave up on trying to connect this device to Bluetooth so I am unable to review the product as I haven’t experienced the product actually working. The frustrating part is before buying the product I checked up on it online and the sales materials obviously inspired me to buy the product as the company looked good and I assumed the support materials would be at the same level but no there are limited instructions on how to install and use the product and the few provided are poorly written and not accurate at all = epic fail.",
      "rating": 1.0,
      "verified": true,
      "author": "CJ Gray",
      "helpful_votes": 4,
      "publication_date": 20190221
    },
    {
      "title": "So many features, great app!",
      "text": "This scale is awesome! I can track my whole family’s weight and health information. The app is very user friendly, seeing the trend data is very motivating! I have recommended this scale to all my coworkers and we now take screen shots of our apps when we do weight loss competitions at work! So many features for the price. Update 2/18: still using this scale daily with no issues. I have added all of my family members and the scale is smart enough to display “matching weight” and pulls up the correct user profile. Very impressive!! I like that I can see trends in my husband’s and kids’ weights.",
      "rating": 5.0,
      "verified": true,
      "author": "MamaMoRx",
      "helpful_votes": 32,
      "publication_date": 20180129
    },
    {
      "title": "Definitely Worth the Price",
      "text": "It seemed to work fine once I got the Bluetooth connected. I would appreciate the instructions for connecting to the phone over bluetooth to be a little more specific...I wasted time trying to figure it out. Also, the scale comes with three (3) AAA batteries that are not meant to be used long term. They require replacement within 2 months according to packaging. Either include full service batteries or none. Frustrating to put in the supplied batteries only to find out they are \"short timers\". I tossed them and used full service batteries.",
      "rating": 4.0,
      "verified": true,
      "author": "Randall G. Bennett",
      "helpful_votes": 3,
      "publication_date": 20190203
    },
    {
      "title": "EFFING AWESOME!  I LOST 80 LBS USING THIS, and still using it to maintain!",
      "text": "Oh Emm Gee! I am not even kidding. This this was a huge part of my losing 80 pounds in several months. So much data! So much interesting bio feedback. This helped my understand my body and keep track of progress, and failures, and get back on track when the times were frustrating. I am largely information-driven and goal-directed, and this scale with wifi and phone app gave me the information and the forms of presentation I could really use to know myself and stay motivated. Now I still use it to help STAY at my ideal weight! LOVE IT A THOUSAND HEARTS",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Osborn",
      "helpful_votes": 3,
      "publication_date": 20190213
    },
    {
      "title": "Disappointing after the first few weeks!",
      "text": "Initially, I really liked this scale and world have given it 5 stars; however, after having it for a few months. It died and I changed the batteries and now it keeps giving me an error message. Therefore, it's not working any more. I am very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Gwen Milner",
      "helpful_votes": 6,
      "publication_date": 20181229
    },
    {
      "title": "Buyer Beware* Awesome scale when it works.",
      "text": "I’m only giving this product a 3 star because this is the 2nd scale in less than 6 months. Also Amazon had to step in because Renpho was not reachable at all. I had two phone numbers and an email and I could not get through to them at all to get a replacement scale. (1 year warranty). Now looking back through the reviews I’m seeing a lot of similar problems like I had. It just suddenly stopped working! I do love the ease of use from the scale and app. It’s pretty addicting to see how much weight I’m loosing but you need a functioning scale to do that. So buyer beware it’s an awesome scale when it works.",
      "rating": 3.0,
      "verified": true,
      "author": "The Aleet ",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Pleasantly surprised",
      "text": "I have been a Long user of the Fitbit aria scale. I remember spending more than $100 for that scale yet some of the things that frustrated me was that I’d always have to Way myself a few times to get an accurate reading. I was a little skeptical when my brother recommended that I get the scale and it only costs in the 30s. The app is actually quite well designed and easy to navigate. It gives an incredible amount of insights in detail. and the best part I only have to weigh myself once. It does a good job calibrating and giving consistent measurement",
      "rating": 5.0,
      "verified": true,
      "author": "Hillfamily",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Have to replace batteries frequently ~ UPDATED",
      "text": "The scale is good, when it’s working. The display is a little small, but that is not the biggest problem. I purchased in April of this year. We have replaced the batteries 3 or 4 times between April and July. This is excessive as the scale is only used for a few seconds a day. Very disappointing. ************************ UPDATE I increased my star rating due to this company’s exceptional customer service. I contacted them the same day I posted my original review. They are replacing my scale with a new one. Hopefully, I just had a defective one. Thank you, Renpho. Excellent service.",
      "rating": 4.0,
      "verified": true,
      "author": "ian gill",
      "helpful_votes": 2,
      "publication_date": 20200719
    },
    {
      "title": "One of the easy to use smart gadgets i got lately.",
      "text": "It responded fast and accurate. Every time you step up on it, it will re-calibrates. Just to be sure you are on the right track. I set it next to my thread mill so i can take a quick check almost whenever i wanted. I love the way that how the app would easily track all your family members Also when it detects a big changes on your weight, it would tell you and ask if its for another member. So wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "justinlammmmm",
      "helpful_votes": 2,
      "publication_date": 20200526
    },
    {
      "title": "Functional",
      "text": "Not sure how they calculate your bone mass among a few other items but that’s besides the point. I bought this for my husband. It keeps track of everything on an app on your phone (connected via Bluetooth). It’s a classy looking scale too. Just have to have the app open when you are weighing yourself if you want that information saved. It’ll pop up with some random numbers sometimes if you open it and I think that’s when it’s being used without an app open (like it stores the numbers- my kids like to use this too). It gets your weight very quickly too.",
      "rating": 5.0,
      "verified": true,
      "author": "Stormyy",
      "helpful_votes": 3,
      "publication_date": 20181207
    },
    {
      "title": "A lot of made up stats in the app",
      "text": "The app pops up some stats based on an algorithm of your height, weight and bio-impediance from the scale. My favorite is the lie that this scale can differentiate between visceral fat and subcutaneous fat; it literally will give you percentages of your subcutaneous and visceral fat even though those are impossible to calculate without a DEXA scan or MRI. It just rubbed me the wrong way because I don’t know what else this company is lying about. Another annoyance that knocked a star off is the inaccuracy. The body fat calculations are off: it had me at 2% body fat at one point (I have love handles and a beer belly.)",
      "rating": 3.0,
      "verified": true,
      "author": "Xen Tsiu",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "You get what you pay for",
      "text": "The scale itself was great while it worked, but after about 4 months it just stopped working. It won’t turn on. I tried replacing batteries and... nothing. When I reached out to Amazon they said to talk to the company directly so I’ll email them and see what happens. Based on it’s short lifespan, I wouldn’t recommend. I’m sure there are other brands out there that will last at least a year... but really, there should last longer. Do some research. I usually don’t go cheap and this is why.",
      "rating": 1.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "The best weight, muscle mass,  BMI, scale on the market",
      "text": "I ordered this scale after I had been on a Nutrimost diet. The office's scale offered similar physical readings, and I wanted to keep on track of this knowledge for my personal observation. The Renfro scale offers a blue tooth connection that tracks trends over days, month, and a year. It was very easy to set up on my phone and it offers many perimeters of input: weight, BMI, body fat %, fat free body weight, subcutaneous fat %, visceral fat. body water %, skeletal muscle %, muscle mass %, bone mass %, protein %, BMR kcal, and metabolic age. This a phenomenal scale and the price was very reasonable, and I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Adrienne",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Cheap product",
      "text": "I really liked the data it provided (while it worked), but taking the batteries out before each use was a pain in the butt! Who ever heard of a bathroom scale that wouldn't come on when touched, button pushed etc. Needed to take the batteries out every time. Not sure if this is how it was intended or a defect. I was living with that UNTIL, it stopped giving any of the data except weight. Only worked for approx 2 weeks. I'm sending back.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181211
    },
    {
      "title": "Piece of Crap",
      "text": "I have no idea how more people haven't had issues with this piece of crap. I moved it from one bathroom to the other and now it won't read the correct weight. I tried taking the batteries out, re-pairing the Bluetooth, watched tons of YouTube videos and read the paper and online manual and nothing helped. I'm returning it. I wouldn't bother buying this unless you put it down and never dare move it from the ground again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy Johnson",
      "helpful_votes": 4,
      "publication_date": 20181108
    },
    {
      "title": "Waste of money",
      "text": "Calculations are bogus, beside your weight. You’re basically spending money to track your weight on your phone. That is all that the scale is good for. The calculations for body mass index visceral fat water percentage skeletal muscle etc. are all bogus. I do bodybuilding and work out 5 to 7 days a week and it tries to tell me that I have over 28% body fat, but I only have 22% according to doctors scales like this. I’ve had other in-home scales that track these kinds of measurements that were far more accurate this one spits out random numbers all based upon your weight and nothing else. Waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Moore",
      "helpful_votes": 2,
      "publication_date": 20190531
    },
    {
      "title": "GAME CHANGER!!!! 1.5 years later!!! Great WL Tool",
      "text": "Down loaded APP. put in some of my info. and started using scale. Why is this a game changer? Struggled with weight loss a few times, and latest broke my leg twice in a row, within three weeks. SO I gained all the weight I lost plus a little more. Although I watch how/what I eat, this is a reminder, everyday, to keep my eye on the prize and change my game up if I need too. Before weight 368 lbs, currently 233 lbs. Headed to 212....",
      "rating": 5.0,
      "verified": true,
      "author": "Modern Pioneer",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "I wish I'd bought this earlier!",
      "text": "My previous digital scale stopped syncing on Bluetooth after close to 3 years of use so after reading several reviews, I bought this scale because it was one of the few inexpensive ones that was highly rated, accurate, and synced with both Fitbit as well as MyFitnessPal. The amount of information provided in each reading was comprehensive and though I have yet to use it for months to see if constantly weighing myself has led me to lose any weight, I like knowing the hydration level as well as visceral fat levels.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Works like a full blown BMI measuring system",
      "text": "I was skeptical because of the price but this is truly amazing! I am fortunate to have a gym membership at a NASA facility where they have a true body mass index measuring system. I took the measurements from that to compare to the scale and they are almost identical. I am really surprised that it is so accurate without the hand held portion. I recommend this if you truly want to check many aspects of your health and track your weight and fat index.",
      "rating": 5.0,
      "verified": true,
      "author": "S. E. Morrell",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Absolute Garbage",
      "text": "If it was possible to give zero stars or a negative star rating, I would. Don’t waste your money. The item was completely inaccurate right out of the box. Even after calibrating multiple times, no two readings were within 50 pounds of each other and none were even close to our other scale. The price point is very tempting considering the features offered, but this is a case of getting what you pay for and if the price is too good to be to be true it probably is.",
      "rating": 1.0,
      "verified": true,
      "author": "DoubleDaddy",
      "helpful_votes": 2,
      "publication_date": 20191006
    },
    {
      "title": "Love it",
      "text": "Step on, then try again - the same number points at good accuracy. The scale is light, easy to store, clear readout. If you use the app (Bluetooth connection) can get all sorts of tracking graphs and calculations. To use the link to your smartphone, open the app first, then step onto the scale. This way, I always get data transferred consistently and reliably. For weight, you can set up target, and every time you step on it and get specially assigned ringtone if you are doing well or not so well that day. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Arv",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Awesome Scale",
      "text": "Chose this scale due to the app being the highest rated and most supported and it didn’t disappoint. Quality looking and set up was a breeze. Included are my results from the scale and my results from the ~$5000 scale at my gym a few weeks before. The accuracy blew me away.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 5,
      "publication_date": 20190222
    },
    {
      "title": "Inaccurate Weight",
      "text": "Purchased this scale mainly due to its high reviews. However I was unimpressed with its accuracy. I checked using a 10lb weight and it consistently read 10.2. While my old bathroom scale would read 10lbs. I do like the app and how it all connects with your phone. I did not have any problems with connecting to the phone like other people did. If the weight would be more actuate I would have easily given 5 stars. I have tried taking out the batteries and stepping on and off to recalibrate but it still has not corrected itself.",
      "rating": 2.0,
      "verified": true,
      "author": "JenCiv12",
      "helpful_votes": 4,
      "publication_date": 20180207
    },
    {
      "title": "Nice app to track your weigh, BMI and other body composition metrics",
      "text": "I love this scale but I am very disappointed at the durability of this product. The scale broke down after less than 2 months of very light use. The weigh is very accurate but I don't trust the body composition metrics. You can pretty change you height and the app will split out very different composition metrics. I do really like to nice smart scale as it is only a few bucks more expensive than a regular scale but it automatically syncs with an app that allow more than 1 user profiles, track history, allow users to set personal goal.",
      "rating": 2.0,
      "verified": true,
      "author": "P. Hung",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Inaccurate reading",
      "text": "I like the idea and features and price. Sadly the scale does not measure weight correctly. Keeps showing different weights (even a few min apart in each testing) and usually shows lighter than what my old scale showed. After indulging for a few weeks I was surprised I had lost weight... even though I knew that couldnt the true. not quite!! My old scale showed the truth. What’s the point of a scale that doesn’t read accurately? And yes I tried recalibration, and it always lays plat on a hard surface in the same location each time.",
      "rating": 1.0,
      "verified": true,
      "author": "Kamila Gornia",
      "helpful_votes": 2,
      "publication_date": 20190401
    },
    {
      "title": "Mind blown!",
      "text": "I already owned a bluetooth scale. It was supposed to give me 4 different reading. Only the weight & body fat % worked. Still, it was my first bluetooth scale & I loved it. A friend of mine ordered the Renpho scale & sent me a screenshot of the data it was capable of providing. I was sold! I ordered mine immediately. This scale is only .02 lbs difference from my other scale. All the information it provides has me thinking more about my health & ways to improve it. I haven't had it long but I'm looking forward to seeing my trends on the app. To recap, buy this scale. The features & price cant be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Irregular weights and problems connecting to Bluetooth.",
      "text": "I have never been able to get the Bluetooth to connect. I have had issues with the accuracy I will weigh myself in the morning and when I weight at know there can be a 10 lb difference. I have weighed my self before my doctor appointment and when I am weighed at their office I was 5 lbs less. I can not trust the readings. I do not use it is sitting collecting dust. I had high hopes for this product but was very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "angela brakke",
      "helpful_votes": 2,
      "publication_date": 20190731
    },
    {
      "title": "Stopped working after two months",
      "text": "I really wanted to like this scale as it was replacing a 4 year old $20 Costco scale that would read different numbers every time you stepped on it. Unfortunately after just two months of use it showed a low battery message so I opened up the battery compartment and saw the included batteries were leaking and there was a burn mark near the compartment. I cleaned up the area and replaced the batteries with fresh Duracell’s. A few weeks later the low battery message came up again. It would seem the electronics are officially fried and just burn through batteries now. Complete waste of money for a nicer scale with a higher price than most home scales.",
      "rating": 1.0,
      "verified": true,
      "author": "Gear Know-How",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Died after a few months and unable to add data before that",
      "text": "This seemed like a great scale at first. But shortly after buying it, I was unable to add./read new data via the app, so for this function, it was useless. I still used it as a scale, but after several months I got error codes even after changing the batteries. For the price it should have performed better and lasted longer,",
      "rating": 1.0,
      "verified": true,
      "author": "Ned and Nelly",
      "helpful_votes": 3,
      "publication_date": 20190423
    },
    {
      "title": "Works great and simple too!",
      "text": "Wasn't sure about this one but I've had it for over six months and it works like a charm and still on its first set of batteries. The accompanying app works well and has a nice weight tracking function. If I weigh myself but miss using the app, the app will ask if I want to include the missed weigh in. Also if others use the scale I can tell the app to ignore it. Nice feature. I'm not a fit bitter so can't say how well the interface works but this set up works just fine for me.",
      "rating": 5.0,
      "verified": true,
      "author": "AMZN Freqbuyer",
      "helpful_votes": 4,
      "publication_date": 20180106
    },
    {
      "title": "Glorified Electric Scale Works Half the Time",
      "text": "I'm honestly just not impressed with this thing... I've followed all the directions to a T, and half the time I can't even get a body fat percentage reading to come through, or any of the other fancy readings it's supposed to do. I step on with completely dry feet, make sure my feet are placed properly over the nodes, and still half the time the only thing that pops up is my weight. I guess I'm glad I got it at a discount, and didn't pay full price for it because it honestly only works about half the time. I'm probably going to be looking into one of the handheld Omron machines my gym uses.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole M.",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Look elsewhere, cheaply made",
      "text": "I don't know how this is the #1 recommended scale on Amazon. It's a piece of junk. 3 months after purchase it gave me a \"Lo\" error every time I stood on it. Replaced the batteries and it just stopped working. It lasted 3 months, no warranty, I wouldn't buy this again.",
      "rating": 1.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 2,
      "publication_date": 20201003
    },
    {
      "title": "Works with MyFitnessPal!!",
      "text": "I bought this after reading the reviews. I just received it and it seems to work well. My main purpose of writing is to 100% confirm it works with MyFitnessPal! I took someone’s advice and I downloaded the Renpho app, connected it to the Apple Health App, and then connected MyFitnessPal to the Health App. It doesn’t take much time, and do it once and done (hopefully). Works like a charm!!",
      "rating": 5.0,
      "verified": true,
      "author": "J Navarro",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Easy to Use: Even for a Luddite",
      "text": "I absolutely do not like anything complicated or techie, but when I put on weight at the beginning of COVID, I wanted a scale that would link to my Fitbit and help me keep track of progress. It was incredibly easy to set up and calibrate, and I love that when I get on it, it asks me if I'm the one stepping on the scale, or someone else. It is also very accurate, and that motivates me, when I see my weight going down. So glad I bought this!.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "and connects to your smart phone and syncs to Fitbit app",
      "text": "Yes it is bluetooth, and connects to your smart phone and syncs to Fitbit app... No it doesn't measure your BMI or other body analysis... It takes your weight, sends it to the app which then takes the weight and info from your profile and looks up the BMI and other stats via the internet. My body structure has NEVER match BMI to the charts (caliper tests have proven this) yet funny thing, is this scale reports the EXACT same BMI that my Fitbit app does with just my weight and profile info.",
      "rating": 2.0,
      "verified": true,
      "author": "James R.",
      "helpful_votes": 6,
      "publication_date": 20180329
    },
    {
      "title": "Doesn't work",
      "text": "I took 5 measurements in 3 days. I got wildly different results (in chronological sequence): Muscle mass - 132.8, 132.2, 130.6, 129.8, 131.4 lbs Metabolic age - 61, 60, 59, 59, 59 (I am 58) Skeletal muscle - 48.4%, 48.7%, 49.4%, 49.7%, 49.0% Fat free body weight - 139.8, 139.0, 137.7, 136.6, 138.2 Body water - 54.0%, 54.4%, 55.2%, 55.5%, 54.8% etc The first two readings were one evening, a few minutes apart. The next two were the following morning, a few minutes apart. And the last one the morning after. My wife with completely different body type was getting similar percentages. I have no confidence in these numbers and returned the scales.",
      "rating": 1.0,
      "verified": true,
      "author": "Seapapa",
      "helpful_votes": 2,
      "publication_date": 20190313
    },
    {
      "title": "Informative but inaccurate fat%",
      "text": "Easy to use and very informative. I got a DEXA scan done, and my fat percentage was actually about 7% point lower than what this scale was telling me. Then i went onto my main page where my pic, DOB shows and i turned on the “Athletic Mode” and the Fat % percentage was on point. I work out 3 times a week, have a high BMI but have lots of muscles mass and iam 6”4. So folks TURN ON THE ATHLETIC MODE if you work out considtently",
      "rating": 4.0,
      "verified": true,
      "author": "#HowAboutThemCowboys",
      "helpful_votes": 4,
      "publication_date": 20180323
    },
    {
      "title": "Super budget friendly APP enabled scale",
      "text": "I love this scale! Super budget friendly and provides all the necessary information I need to track my progress. Their app is super friendly to use and provides very quick ease of us for Bluetooth connection to your phone. I’m actually not sure how this scale stays connected so easily to my phone but anytime time of day I can weigh myself and it will always show on my phone via the app.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey O",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Drains batteries in 3 days",
      "text": "This scaled worked great when we first bought it about a year ago. It was accurate to our gym scales as well as the body fat measurements to the gym. Batteries last a long time - Then a few months ago it began needing a battery change more frequently. Once a month - then once every couple of weeks - now most recently 3 days. We just put batteries in 3 days ago and it is dead again! We haven't even weighed on it since putting the batteries in! This would have been a five star review if it hadn't become unusable in a year.",
      "rating": 1.0,
      "verified": true,
      "author": "BrownySquare",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Great scale.",
      "text": "One main goal for this scale was to sync with Garmin connect. Although it doesn't do it by default, many say your can't, but based on all the fitness apps installed on my Android 10, it does work. I have a Garmin 245 watch for steps, running, and sleep. apps are MyFitnessPal for eating diary (also updates Garmin connect). Fitbit app (no actual Fitbit watch), Google fit,. Thru whatever combination something works and takes the scale entry thru all of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott T",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Inspiration for Dieters & those on a Health Journey",
      "text": "Fantastic scale. It’s totally accurate weight wise and as far as I can discern in all calculations. The app is easy to read and understand. It’s a true godsend while changing your body because it can be discouraging going by weight alone. Here you can stay inspired as you see little changes that mean more than total pounds. Excellent price. You will not regret this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Smith",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Dammit I need to lose weight!",
      "text": "This scale sucks! It tells me I have to lose weight! It tells me my metabolic age is older than my actual age! It says I am fat! Dammit, this scale is telling me the truth!!! Setup was simple though I had to Google how to sync the Renfho app to the Samsung up, but now it syncs perfectly... What you do with the information this scale gives you is entirely up to you but it works and as far as I can see, it gives you more information than any other device and tracks your progress. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael. M.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Body Fat % is not accurate",
      "text": "I purchased this scale because I want to focus on my muscle mass, as well as weight. I used this scale, and a dietitian's $5,000 body fat % scale, and the results for the body fat % were quite different. My RENPHO scale said 21.5% body fat, and the InBody scale read 27.5%. So when I weigh myself on my RENPHO scale now I normally assume I'm 5% higher in body fat and 5% lower in skeletal muscle mass. Still rating this scale a 4 because of the price, and it's EXTREMELY convenient and easy to use with the app. The app syncs to my iPhone health app and makes it so much easier to track progress.",
      "rating": 4.0,
      "verified": true,
      "author": "Christiana",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great Value for the Money",
      "text": "I am enthusiastic about this purchase. The weight is accurate, and I assume by extension that the measurements are also accurate. The measurements provide so much valuable insight into your body health. In combination with other apps, such as exercise, food intake analysis, heartbeat, blood pressure, and blood analysis, I can really get a good picture of how things are going. This scale with measurement results pushes me to do more--especially to lose weight, lose fat, and increase muscle mass, The mobile app is helpful. My only wish is that the app would have functionality to zoom the graphics so that I did not need to put on my reading glasses. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Odie",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "The accuracy",
      "text": "I feel that the accuracy is off. I use it every day and have done so for the past 2 months or more. At first it needed to adjust to me, eventually, it realized age, body fat, subcutaneous fat, and visceral fat was a set amount. I do not know...I love this thing...but I really feel that my body fat increases drastically overnight if I have big meals, even while there is no fat involved in the past 24 hrs...so it increases body fat by weight...if only this could be made more perfect, or if only I knew what it is I am doing wrong I would rate this 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Adrian Centeno",
      "helpful_votes": 2,
      "publication_date": 20190430
    },
    {
      "title": "Slow to read weight",
      "text": "It's hard to use. This scale takes a long time to give a final reading. My previous digital scale was able to quickly detect weight even with slight movement. I also find it really frustrating that the app requires you to create an account with your e-mail address. I wish manufacturers would start taking our privacy seriously and STOP asking for personal information that they do not need. My scale does not need my e-mail address.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Setzer",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Best scale for the price!",
      "text": "I have owned plenty of scales in the past, and I can comfortably say that there is not one in this price range that beats Renpho. The app is very user friendly and displays data in a way that is easy to understand, and shows progress clearly. I'm not sure how accurate the detailed measurements always are- I do think the body water, muscle mass, etc. can be a bit off sometimes, but I don't track that very closely, so it doesn't make a huge difference to me. Overall, I LOVE this scale and app, and recommend it to anyone looking for a relatively inexpensive scale.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie McGowan",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "EATS BATTERIES!!!",
      "text": "I had to buy a second one after the first died in 9 months. I really liked the scale and app at first so I bought another. This one was a disaster. I couldn't get the app to work with it. Emailing customer service was a drawn out process. Worst of all, this scale eats batteries like crazy. I had to replace 3 AAA batteries almost every week. The weight seems accurate but none of the other data is even close. I have had regular dexa scans so I have a reference point. This scale is sleek looking but a piece of junk",
      "rating": 1.0,
      "verified": true,
      "author": "Jaye R.",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "The Perfect Weight Scale",
      "text": "I had an old weight scale which I really liked but it wasn’t working as well as it did the first time I got it years ago so I came across this one and Omg it’s wayyy better! I love how everything is on the app. For example if you are overweight the number are on red, a little over the normal is orange and just normal it’s green. It shows you the progress in a perfect way! I love this very much! Totally recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Anna S",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "LOVE IT!",
      "text": "I was not expecting such a great scale. It registers weight quickly and doesn't jump back on forth between numbers forever like other digital scales I've used. The app is SUPER easy to use and when you weigh yourself it syncs quickly. And it tells you just about everything. For example, showing weight, fat and muscle mass and what percent of your weight is either muscle or fat (or fluids). Plus the color coding quickly tells you if those numbers are in the poor, normal or above average range. For the price I was definitely expecting less. I'm very happy and would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "SbNYC",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great Value!",
      "text": "I purchased this scale to pair with my recently purchased Fitbit. The promised product was delivered on time and, for someone who is technologically challenged, was easy to pair with the accompanying app and my Fitbit. I tested it on different solid surfaces; it consistently gave the same reading. It provides multiple measurements besides weight (BMI, % of body fat, muscle mass, different types of fat measurements . . . ), but I don't imagine them to be super accurate, but they provide a good comparison tool. I believe this scale, at around $30, is a good value and Amazon's price is approximately $5 less than RENPHO sells it for on its website.",
      "rating": 5.0,
      "verified": true,
      "author": "Mookie",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Terrible app!",
      "text": "Doesn't work with my Samsung android tablet! Others on Google play have also commented that although it works on their smart phone, it didn't work on their tablet. I don't have a smart phone! Installed, uninstalled and reinstalled many times with no success! Also, doesn't work on carpeted surfaces! I have a scale, which isn't a smart scale, that displays accurate weight on both carpeted an non-carpeted surfaces. This scale Is a disappointment. I was trying to save the nearly 100 dollars more for the cost of a Fitbit scale, but I may have to go that route. At least, I am certain, the Fitbit scale will work! Needless to say, I have returned this lousy scale!",
      "rating": 1.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "I love this app and scale",
      "text": "This has been super helpful for me to track my water intake and weight. I am not 100% sure I trust the accuracy of the body fat percentage, but that is a small downside. I was a little worried about the scale breaking as I read other reviews that show it shattered. It has been sturdy for up to 260 lbs in our household. The app is simple to use and it is customization with sounds and colors which I appreciate. It is also easy for my husband and I to both use it and track our loss on our individual app/phone. I would recommend getting this if you are on a health journey.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodrigues Family",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Love it when it works!  ITS NOW WORKING PERFECTLY.",
      "text": "I like the scale very much, when it records all of the data. But unfortunately out of 10 attempts it only records all of the data 2 times. That’s disappointing. I’m weighing on a hard floor (vinyl) I recalculate every time, I restart my iPhone every time and after 6 or 7 attempts ( on one day, at the same time of day) then I finally get all of the readings. Help would be appreciated. UPDATE... It is working perfectly now. It was my problem, not the scale. I needed to moisturize my feet and then it worked perfectly. I am very pleased that RENPHO contacted me and gave me some suggestions.",
      "rating": 4.0,
      "verified": true,
      "author": "Jackie Jacobson",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Good Scale; lots of info",
      "text": "As advertised. Good scale for weight; seems to be fairly accurate on Body Fat (BMI is weight & the height you log, so it's accurate); don't know about Body Water & Skeletal Muscle, but it's fun to track. Bluetooth to phone works very well. Records multiple weights throughout the day, but on the 'Trends' graph it only shows the 'last' weight recorded, so if you want to track your morning weight, then don't BT the weights you do later that day (if you do that at all). Multiple user function is cool...each person using the scale downloads the Renpho app, and the scale BTs to their phone IF the app is opened & the phone is nearby.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick M. Campbell",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Great bluetooth scale",
      "text": "Really impressed with this scale so far, just received it on 1/31/2020. It was easy to setup and get the info loaded to the app. I was concerned how accurate the body comp info was going to be but I had a body comp test done at the nutritionist's office about a month ago. The body comp numbers were very similar and on track with losing a few pounds. I am really glad I made this purchase even though I had a working scale already",
      "rating": 5.0,
      "verified": true,
      "author": "H. Schneider",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Great tool to reach your weight loss goal!",
      "text": "Purchased this scale in November 2018 because the Fitbit one had worse reviews and cost four times as much. Attached a screen shot of the app showing my weight loss since buying the scale. I'm not saying the scale made me lose the weight, but it helped me keep track of my daily ups and downs. I have been using this scale for almost two years now with no problems. It recently went on sale so I purchased another one so the hubby and I won't have to share any more. In summary, I love this scale and highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "AprilWhine",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Works great for me",
      "text": "It's been a while since I've used/owned a scale, keep that in mind. The unit itself is lightweight. The app was relatively easy to setup and immediately worked well with the scale once synced. The info provided through the app is really detailed. Provides; Weight, BMI. bofdy fat, fat-free body weight, subcutaneous fat, visceral fat, body water, skeletal muscle, muscle mass, bone mass, protein, BMR, and metabolic age. But these are all reference points, not necessarily accurate enough for medical use. The app can be customized. Like adding sounds to indicate when you've gained/mainted/lossed weight.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Inna",
      "text": "I bought this in June and it looked great but I would weigh myself once, then again a few hours later and gained an extra 5-10 lbs somehow. My family quickly saw that the scale wasn’t accurate but I gave it the benefit of the doubt. I weighed myself a few times a day, all very different weights. The listing was taken down so I ended up throwing it away. I recommend spending a bit more and getting a scale that is guaranteed to last for years.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabe G.",
      "helpful_votes": 2,
      "publication_date": 20191128
    },
    {
      "title": "My best purchase this year. Down 25 pounds so far.",
      "text": "I buy on Amazon all the time and this has been by far the best purchase I've made all year, maybe the last few years. The scale came in good condition and appears accurate enough. The best thing about it is the free app used when you weigh yourself. It doesn't just give you you weight and other health metrics like body fat% and bmi, but also tells you what your healthy weight should be. Before hand I used the mirror to judge my healthy weight. This scale and it's app gave me the motivation to lose the weight I needed to lose. I feel healthier than ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew L. Stedwell",
      "helpful_votes": 3,
      "publication_date": 20180506
    },
    {
      "title": "Love it!",
      "text": "I purchased this as a part of my new year's resolution to get back in shape. My old scale just showed my weight (on the scale) but didn't have an app, or any of the many other readings. Not only does it sync via bluetooth with my Fitbit app, but also with my Noom app, so once my weight is added to my information on the Renpho app, it also uploads my weight for the day to Fitbit and Noom.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandal Tan",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Horrible app features hard to track progress.",
      "text": "Honestly the scale itself it good, the app is horrible to keep track of your progress which is why I bet more than half of us would buy this. Therefore if this is your need for the app and for you to track your progress this might not be it as for me I just put this in my studio since I can’t even successfully manage the app.",
      "rating": 2.0,
      "verified": true,
      "author": "Ray Sevah",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "My first Scale to own. & I’m so happy I went with this one!",
      "text": "Me & My Fiancé love this scale. It’s durable. And it gives a lot of information about your Body Health/Shape. Muscle % Fat % Tells you what’s good and bad like a Dr would!",
      "rating": 5.0,
      "verified": true,
      "author": "Cody Lee Hart",
      "helpful_votes": 4,
      "publication_date": 20190226
    },
    {
      "title": "Inconsistent readings",
      "text": "I compared this with my current scale and every time I step on, it is inconsistent. Each day it is off from my current scale. I got it because I wanted the app part but it will be 1 lb off from my current scale and the next day it is 2.4lbs off from my current scale and so on. I had my husband use it right after me and my reading was off my .8lbs between the scales and his reading was off by 1.3lbs between the scales. That may not matter to some people but it matters to me. The mobile app is easy but I’d rather have an accurate scale. The screen is also quite small.",
      "rating": 2.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Great scale, convenient",
      "text": "The scale is great, the body fat is pretty accurate, it can be a few percent off in both directions but for the convenience of the scale it's worth it, my caliper gave me 15% and my scale gave me 13% so clearly it is close. Id recommend you use this to track body fat but pay less attention to the fat percentage number and more attention to the downward or upward trend of you body fat.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian West",
      "helpful_votes": 0,
      "publication_date": 20200804
    }
  ],
  "product_meta": {
    "title": "RENPHO Body Fat Scale Smart BMI Scale Digital Bathroom Wireless Weight Scale, Body Composition Analyzer with Smartphone App sync with Bluetooth, 396 lbs - Black",
    "rating": 4.5,
    "feature_bullets": [
      "Smart app syncs with fitness apps. Over millions of happy global users. Easy setup app syncs with Samsung Health, Fitbit, Apple Health, Google Fit, and offers App for Apple Watch.",
      "13 essential measurements. The scale shows body weight only. Other body composition data including weight, BMI, body fat percentage stores to app. You can weigh yourself anytime without your phone.",
      "User-friendly app. Download RENPHO app at app store or google play, also offers Apple Watch App . RENPHO App works with Bluetooth 4.0 And above.",
      "High Quality Product. Auto calibration, high precision sensors measure in increments of 0.2 lb, 0.05 kg with 396lbs, 180kg capacity. 4 high sensitive electrodes, 3 x AAA batteries included.",
      "Monitor your progress. RENPHO connects with the apps to help you set goals, save historical data and track your daily, weekly, and monthly progress."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "11 x 1 x 11 inches; 2.85 Pounds",
      "Item model number": "ES-CS20M",
      "Batteries": "3 AAA batteries required. (included)",
      "Date First Available": "December 22, 2016",
      "Manufacturer": "RENPHO",
      "ASIN": "B01N1UX8RW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Medical Supplies & Equipment",
      "Health Monitors",
      "Digital",
      "Health & Household",
      "Health, Household & Baby Care",
      "Body Weight Scales"
    ],
    "price": 28.84
  }
}