{
  "website_summaries": [
    {
      "verdict": "You'll pay a bit more, but this model offers a very sharp resolution and a large screen size.",
      "pros": [
        "Amazing 37.5\" screen size will provide a great viewing experience in a curved screen",
        "Max resolution of 3840 x 1600 sits near the top of the market",
        "Fast refresh rates are good for gaming",
        "Side by side and picture in picture options"
      ],
      "cons": [
        "Combinations with certain video cards may cause color accuracy oddities"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "well-made and the display is beautiful. Very bright with great contrast",
      "text": "This monitor is wide, well-made and the display is beautiful. Very bright with great contrast. No dead pixels, so quality control appears to be very good. The dimensions allow me to view three pages simultaneously without a problem, up to four pages if you want to fill the screen. Very happy I opted for this screen. I was looking at a number of different monitors--Dell, Asus, AOC, BenQ. They all had a number of features that I wanted, but none had the right combination. This monitor has a 75hz refresh rate and good enough resolution. Plus the 37.5\" size is fantastic. I don't think a 35\" would have made me as happy.",
      "rating": 5.0,
      "verified": true,
      "author": "the blue whale",
      "helpful_votes": 2,
      "publication_date": 20180604
    },
    {
      "title": "OMG this is ammmaaaazzzzing",
      "text": "Not to big not to small just right! I did wish the resolution was a bit higher (I had 4/5k monitors before) but honestly I got used to it quickly. I was thinking that this would be good for using three apps side by side but realistically it's only good for two. I do use three often but I have them overlapping which is fine. I'm not a gamer so I can't tell you what that is like but for productivity this is a game changers. Spreadsheets, programming, music (DAWs look great in full screen!), video, graphic design are all wonderful with this monitor. The only thing that I can say that's bad, is I wish had bought it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Williams",
      "helpful_votes": 2,
      "publication_date": 20190206
    },
    {
      "title": "Get this over the LG 38uc99-w, it's the same IPS panel + cheaper!",
      "text": "Absolutely LOVE this monitor. Its $200-300 cheaper than the LG 38uc99-w with the exact IPS panel. I have it connected through USB-C to my Macbook Pro 2016 which supplies a charge + video. I have confirmed the output wattage to Macbook Pro 2016 is 60W. I originally planned to buy the LG, but when I came across the Acer with the same panel at lower $300 price difference, 4 USB ports (compared to the 2 on LG), 3 year warranty (vs 1 year on LG), LED lightening, it was a no brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 14,
      "publication_date": 20170328
    },
    {
      "title": "Works perfectly with MacBook Pro 2016 for 4k@75Hz over USB-C",
      "text": "The default monitor configuration gives 4k@30Hz over USB-C when I plugin my MacBook Pro 2016. Did research around, and found the way to enable 4k@75Hz over USB-C: Turn off the monitor's USB hub functionality. Go to Monitor Menu -> System -> USB 3.0 and turn it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 25,
      "publication_date": 20171201
    },
    {
      "title": "I seriously love this monitor.",
      "text": "I seriously love this monitor. I used to have two wide screen monitors years ago but switched to simply using my MacBook Pro screen on my desk for the past few years. Do NOT know why I didn't buy something like this sooner. No longer feeling lower back pain because of looking down at my laptop for hours on end. The resolution is great - getting 60Hz at 3840x1600 via USB-C on my 2016 MBP 15-inch. (Be sure to switch off the USB-C hub capabilities in the monitor menu settings or it'll fall back to 30Hz.)",
      "rating": 5.0,
      "verified": true,
      "author": "D. Schmid",
      "helpful_votes": 4,
      "publication_date": 20171116
    },
    {
      "title": "Beast",
      "text": "Really the best ultrawide monitor available today. If you're used to 4k 27\" monitors - the PPI on this monitor will be a little larger than you'd like, but still quite reasonable considering the size. The curve is perfect, not too flat like a lot of other curved ultrawides out there. The lights under the monitor are great at night - when on white, they provide a nice soft/subtle light for your entire desk. 75hz is great, I've read of a lot of people overclocking theirs to upwards of 100, but I wasn't able to with any success. It's a downgrade in hz from my previous predator, but an upgrade in every other aspect.",
      "rating": 5.0,
      "verified": true,
      "author": "LLOD",
      "helpful_votes": 2,
      "publication_date": 20170720
    },
    {
      "title": "Love it, highly recommend it.",
      "text": "This is the same model panel as the high end LG monitor my boss bought me for my office workstation. I couldn’t handle going back to my laptop screen at home, and wanted the same desktop icon layout so bought this one to handle what is clearly a first-world problem. Was pleasantly surprised that this monitor cost less money than the same LG. For some reason I can’t explain, my MacBook Pro likes the USB interface for my peripherals on this more than the LG. Also the dimmable LED under-lights were a nice touch. And finally the monitor stand is 500% better than the LG.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Dow",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Fantastic monitor",
      "text": "I have been researching 38” monitors for a while. And it can down to this and the LG model. I. The end I went with the Acer and I’m glad I did. G-sync compatibly work excellent. Picture quality is really good. No light bleed and minimal ips glow. I had the smaller 34 950f and while I miss the 144hz its not a deal breaker in the least. 75hz is good enough for my skill level. If I have one complaint, the speakers are crap. But that’s typical of monitor speakers so I'm not going to ding the rating for it. System specs I9 9900k 64gb ram RTX 2080ti",
      "rating": 5.0,
      "verified": true,
      "author": "Gabe R",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "better off getting a large 4K display/TV - it has similar width but you get more vertical landscape",
      "text": "I wanted to like this. Overall the image and so on are fine. But I just didn't like the lack of vertical space compared to how much horizontal landscape it provides. I kept wanting to put things above or below items and there just wasn't screen there. It has same horizontal resolution has a 4k display but it lack a lot of the vertical landscape of the 4k display. So I've since bought a 4k TV instead of this and I much prefer it. I lose the minimal amount of freesync for more screen space really and better image quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Patrick Visniewski",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Decent monitor but the anti-glare coating is annoying",
      "text": "For the price I was expecting a really great monitor for work. It's decent enough for videos or darker screens. But a lot of my work is in light colors or white backgrounds. The anti-glare is very noticeable and makes everything have a horrible haziness to it. When throwing on a video or something it's not real noticeable. That's probably my only complaint thus far, but is severely annoying enough to knock 2 stars off. It's really frustrating not getting a crisp clear image on anything that isn't colorful or dark.",
      "rating": 3.0,
      "verified": true,
      "author": "My Reviews",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Mac compatible",
      "text": "Runs at full resolution on a Late 2013 Mac Pro at 75hz. Will run at 30hz on a 2010 Mac Pro with the ATI Radeon HD 5770. The stand kind of forces you to have the screen closer from the back of the table, FYI. So if your desk depth is on the smaller/shorter side, you may be finding yourself with the monitor closer to your face.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Co",
      "helpful_votes": 2,
      "publication_date": 20180713
    },
    {
      "title": "Not a bad piece of equipment.",
      "text": "This has been a great monitor so far. I get no glare from the screen and it works awesome. I'm running from my computers display port and the image and sound quality are both good (sounds pretty good for monitor speakers). The USB bank in the back is great for charging and the adjustable stand is robust. When I first installed it I was using the integrated graphics from my pc. For some reason it didn't like that and the screen flickered with horizontal lines. I had a graphics card back ordered since a 2k ultra wide is a lot for integrated graphics anyway, and haven't had a problem since installing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Unable to use monitor due to defect.",
      "text": "I liked the monitor its self. I disliked the screen shutting off for 1-3 seconds every couple of minutes. I reinstalled my video drivers several times, tried playing with the AMD video driver settings as well as the settings in the monitor but nothing resolved the issue. Returning this monitor and buying something from LG or Dell.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180618
    },
    {
      "title": "Great monitor",
      "text": "Great monitor. I switch between sitting and standing while using this monitor. The stand is tall, so the screen can slide up high and tilt back for comfortable use while standing. Wide screen fills peripheral vision like no other monitor. Resolution is great. I didn't expect to love the downlighting, but I do. Several color options and brightness settings for downlighting. Swivel is nice too.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Jackson",
      "helpful_votes": 2,
      "publication_date": 20170428
    },
    {
      "title": "very nice monitor.",
      "text": "i love this monitor.. i was worried but it came in perfect condition.. 38 inch 75 htz freesync 3k curved ultrawide, its pretty awesome.. the stand is huge, i had to to put it on a vesa mount, it wouldnt really fit on my desk...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Happy Camper",
      "text": "Received the monitor yesterday. Took awhile to set up but overall I LOVE it. I went from a 34\" hp and it's amazing what 4\" does! Best monitor I've ever owned and I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Stanley",
      "helpful_votes": 2,
      "publication_date": 20170907
    },
    {
      "title": "Best you can buy at this size",
      "text": "Best you can buy at this size. 75hz is great would have liked 100 but pro players have been beating everyone with 60hz for years so care about your skills first than the hz number.",
      "rating": 5.0,
      "verified": true,
      "author": "Ultra",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Great all around monitor",
      "text": "Absolutely love the monitor. I'm a developer so love the added real estate this monitor gives. Wish the software was a little better for organizing the screen. Like the L.E.D lighting. I was able to overclock this screen using G-force software with ease. No complaints from me at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Freesync & HDR do not work together?",
      "text": "First monitor is amazing, my problem is the freesync feature and HDR do not work at the same time, I tried 3 computers with different video cards. If I have HDR on auto the freesync feature is grayed out. Also I posted a picture of the LED strip on bottom of monitor one LED is sticking out were you can see it from the front. Will update review if problems get rectified.",
      "rating": 2.0,
      "verified": true,
      "author": "steven mahoney",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "22 century.",
      "text": "The only problem is I need to update my graphic card. Vivid color, HDR, 4 usb 3.0, 2 type c ports. 75Hz.. And be aware when you trying to clean the screen with some liquid that could damage the screen coating!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Unbelievable",
      "text": "It was a big jump for me from 2. 22”monitors, but are fantastic and I would recommend to anyone to get a big curved monitor vs 2 smaller one.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrome",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Wont be disappointed for the price",
      "text": "Hard to mount but, HDR is worth it. Wont be disappointed for the price. for those with '17 MBP 15\" will charge at 60w so not full power using usb-c, Only time its an issue is when he the computers dead. Hard usage will drain your battery while charging.",
      "rating": 5.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Awesome for gaming",
      "text": "Great for gaming. Good for work but you'll need to revise how you handle documents as this is too large to have a doc spread across it. You'll have 2 side by side most likely. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "mjmd",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Excellent for programming",
      "text": "I have one of these at work for programming with Xcode. It's works great, and the extra real estate is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "James Astro",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great quality!  Excellent resolution!",
      "text": "Excellent monitor. I use it to have a three monitor set-up. I have my laptop below and the large screen a love that I split into two so I can have three active screens going simultaneously.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great product that works great with my MBP 2017",
      "text": "Great product that works great with my MBP 2017. Love that it charges the laptop when plugged in, and it's USB connectors in the back function a dock for iPhone and USB-drives as well. While the sound from speakers is all right, for some reason I can't control volume from my MacBook anymore which is a bit strange. Have to control from inside an application or using the control on the ​back of the monitor. Otherwise would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis G",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Absolutely amazing monitor! I have it connected to my MacBook ...",
      "text": "Absolutely amazing monitor! I have it connected to my MacBook and sometimes I will change it out with my Zephyrus when I am gaming or developing games. No dead pixels at all, no issues, package was very good. The resolution is amazing, there is no pixelation or led backlight bleed.",
      "rating": 5.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "DoA",
      "text": "Product was dead on arrival. Already shipped it out to Acer for repair and still waiting for it to be sent back. I'll update this review once I have it back and can actually use it.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Great for gaming",
      "text": "All around great monitor. I have had absolutely no problem with gaming, I love the wide screen.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Judy",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Perfect Gaming Monitor",
      "text": "A bit expensive but very much worth it, a fantastic picture with decent refresh rate, solid construction, and nice additional features. Ended up buying another one after my desk collapsed and I'll buy it again if THIS desk kicks the bucket too, love this monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "will",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Good monitor for the price",
      "text": "Bought this mainly for work but I do dabble in some games. So was drawn to it since it has the 75hz refresh compared to many others that are only 60hz. Picture quality isn’t the greatest but gets the job done. Wish the brightness was higher but again it gets the job done. Gaming is better than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Screen",
      "text": "Used this for about 2 weeks. After moving the monitor just from downstairs to up it had a huge white line about 30 pixels wide down the center. I am still able to use it but not for video or gaming or anything because of the 60px giant line. Not very durable.",
      "rating": 1.0,
      "verified": true,
      "author": "Kassie McConville",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Your software engineer coworker will be jealous",
      "text": "I am a software engineer and bought it for work. I can have IDE in the middle, browser on the left and terminal on the right. Better experience than 2 monitors where there is a GAP in the middle between monitors. Now my colleague is super jealous...",
      "rating": 5.0,
      "verified": true,
      "author": "Archer Li",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Great monitor but came with a dead pixel",
      "text": "So far I love the monitor, gaming is awesome and movies the same, I was very sad to see a dead pixel near the middle of the screen that was driving me crazy. I have a replacement and hope it is fixed. The lighting is very cool and the joy stick on the back makes changing settings a breeze. This would be a 5 star without the dead pixel.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170621
    },
    {
      "title": "Buy it, its better than the other 3840 by 1600 monitors",
      "text": "No dead pixels. Monitor is great does as it says and the hdr is stunning. One of the best monitores I've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric A.",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Excellent size and very clean picture.",
      "text": "Excellent monitor, perfect size and runs at 75Hz. No dead pixels, very clean picture. I only wish it had more than one DisplayPort input.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Fridman",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "One of the best Freesync monitors",
      "text": "This monitor is awesome. All AMD needs to do now is make a powerful GPU instead of the crap they been putting on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "RealReviewCalifornia",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "But I don't really like it to be that large",
      "text": "When you set the resolution to 3440*1440 and don't scale the text size, the text will be a little bit blur. So, to see clear text, it has to be scaled to 200%. But I don't really like it to be that large. I want a screen to view more of my code",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Excellent for full size movies displayed without lack bars on any side.",
      "text": "Excellent for full screen movie watching. Perfect size for dual screen use with a single screen footprint!",
      "rating": 5.0,
      "verified": true,
      "author": "David J. Martin",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Great monitor for both work and gaming",
      "text": "Love it. Use the included cables. I used an old display port cable and it didn't like it. I switched to the one in the bax and everything works great.",
      "rating": 5.0,
      "verified": true,
      "author": "BBares",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "The picture quality is remarkable.",
      "text": "Saving for a second one, for another workstation. When used with a GTX1080 display card the picture quality is remarkable.",
      "rating": 5.0,
      "verified": true,
      "author": "John H. Hyman",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Caution: May change your life",
      "text": "In the immortal words of Phreak: \"I want it to have my children\"",
      "rating": 5.0,
      "verified": true,
      "author": "EJ",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Perfect for game design",
      "text": "This has been a huge advantage over the dual monitors that we used to have. Crystal clear detail. Perfect for game design.",
      "rating": 5.0,
      "verified": true,
      "author": "DaisyStar",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Great monitor for timeline video and audio editing.",
      "text": "Great monitor for timeline video and audio editing. The wide screen has really helped me be more productive. Multiple hdmi inputs allow me to watch cable and/or firestick on one side of the monitor while doing work on the other half of the monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike805",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Excellent for my gaming needs",
      "text": "Excellent for my gaming needs. Went from 3 - 27\" monitors with eyefinity to this setup and love it much more. No bezel to worry about. Crisp clean picture with no dead pixels.",
      "rating": 5.0,
      "verified": true,
      "author": "SkunkWorx",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "No dead pixels.",
      "text": "No dead pixels, easy set-up. Stand is massive if that's a downer for anyone, effects me a little but I'll get used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Zane Meow",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Four Stars",
      "text": "I would give it a five star but the speakers make everything muffled",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Great Monitor!",
      "text": "When I seen the package I said wow what the hell did I buy. To my suprise there was no major assembly. I had it up and running in 5 minutes. The picture is great and it has made working easier. I am going to get a PS4 hooked up to it here soon to check out how gaming is on it, but I am using it for work and I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Turner Jr",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "No windows 10 drivers",
      "text": "This is a beautiful monitor, but unfortunately I will return it as it is not a fully compatible Windows 10. Acer only has drivers for Win 8 and earlier so you cannot get the refresh rate past 30 - the monitor is capable of 75. After speaking with ACER, they said no plans for that driver. So Windows 10 only see this as a Generic PNP monitor with a 30 refresh rate. This is also not mentioned in the ads for this monitor. Hooking it up was easy, the monitor itself is very sturdy and doesn't wobble at all. The speakers are nice, but a bit muffled being underneath. But noise free and sound great with headphones.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20171110
    },
    {
      "title": "Beautiful monitor, working great for gaming and work",
      "text": "I bought this monitor to replace a Dell U3415W, and I do not regret it one bit. If I had any complaints, this would be a much longer review, but I'm extremely happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20170505
    },
    {
      "title": "... with it hope it stays that way its a great addtion to my work desk",
      "text": "So far I haven't had any problems with it hope it stays that way its a great addtion to my work desk, although it has gotten more work with videos and non professional use the leds are great and I really like the brushed aluminum stand look.",
      "rating": 5.0,
      "verified": true,
      "author": "Seily Diaz",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Amazing !!!",
      "text": "Amazing, 100 times better then Samsung CF90 I had. It’s beautiful and looks just as good as my 4K monitor. It’s enormous so you’re going to need a huge desk/",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "This monitor is beautiful. I use it for gaming",
      "text": "This monitor is beautiful. I use it for gaming. Picture on this monitor is great. The stand that comes with it is huge but man is it high quality. I have only one problem with the monitor, if you damage the monitor physically in any way the warranty is completely void. They will charge you a set huge price to repair whatever happened to it, no matter how small the physical damage is. Other then this, I would definitely recommend the monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "liked it at first but started noticing burn in within less than a year of use",
      "text": "I really liked the monitor until now after using it for about 7 months i start to notice that it starts to burn in image into the screen so i notice a faded web browser burned into the screen when doing other tasks. Not good quality would not recommend or buy again especially for 800 dollars. very disappointed since I havent even had it for one year and for the price definitely not worth it",
      "rating": 1.0,
      "verified": true,
      "author": "Strong🐂",
      "helpful_votes": 3,
      "publication_date": 20170414
    },
    {
      "title": "This monitor is awesome. It took me about a day to get ...",
      "text": "This monitor is awesome. It took me about a day to get use to the size.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "So so for the price.",
      "text": "Lots of resolution and space. The only thing is the turn off time when it's not receiving signal is too quick. When rebooting Windows 10 it thinks that the computer is off and therefore turns itself off, defaulting to my other monitor as main. Also this monitor likes to turn itself off and on at random times. I changed out the cable and that seemed to solve it however it did manifest itself a couple times recently. Its starting to get irritating.",
      "rating": 3.0,
      "verified": true,
      "author": "silverboi",
      "helpful_votes": 2,
      "publication_date": 20171020
    },
    {
      "title": "My new favorite monitor, what's not to like",
      "text": "My new favorite monitor, what's not to like? It's the best computer monitor I've ever owned, and I've been through quite a few over the years. A+",
      "rating": 5.0,
      "verified": true,
      "author": "OCD Tronic",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Can I get help from the manufacture ?",
      "text": "Mine has tons of dead pixels of different colors sadly didn't notice it during the first 30 days so I couldn't replace it with amazon and return it to the manufacture could be a pain to do, other than that it has a small black light bleed which is acceptable .. overall I love it I just wish it didn't have that many dead pixels :(",
      "rating": 1.0,
      "verified": true,
      "author": "Sensei",
      "helpful_votes": 5,
      "publication_date": 20171127
    },
    {
      "title": "Incompatible with MacBook Pro 13\" 2016, Terrible Image Persistance / Burn-in",
      "text": "No matter what cable or adapter I tried, I cannot get more than 30 Hz from this monitor, even with a DisplayPort cable through the CalDigit USB-C dock. In fact, each time I connect the DP cable, my MacBook freezes and reboots. I tried other computers and it worked fine. I contacted Acer and they said the monitor is not compatible with my the MacBook Pro 13\" 2016. Lastly, the monitor has terrible image persistence / image burn-in problems. It's most preeminent on grey backgrounds.",
      "rating": 2.0,
      "verified": true,
      "author": "Swisher Sweet",
      "helpful_votes": 3,
      "publication_date": 20170403
    },
    {
      "title": "Five Stars",
      "text": "Warning, it uses a USB-C connector for the USB hub!!! Wasn't prepared for that.",
      "rating": 5.0,
      "verified": true,
      "author": "O",
      "helpful_votes": 4,
      "publication_date": 20170222
    },
    {
      "title": "... now i am second guessing the one that does better to spend your money on something you know will ...",
      "text": "one of two doesnt work out of the box and now i am second guessing the one that does better to spend your money on something you know will work when you get it",
      "rating": 1.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 2,
      "publication_date": 20170303
    }
  ],
  "product_meta": {
    "title": "Acer XR382CQK bmijqphuzx 37.5” UltraWide QHD (3840 x 1600) AMD FreeSync Monitor (USB 3.1 Type-C Port, Display Port, HDMI Port)",
    "description": "Style:UWQHD IPS (3840 x 1600)| Size:37.5-InchIntroducing the Acer XR series display with a 37.5-inch curved IPS panel and 21:9 UltraWide QHD resolution making your games, work and movies look as epic as possible. Special features like 100% sRGB and DTS Sound give you the perfect picture and entertaining experience while Picture-in-picture and daisy chaining multiple monitors together take your productivity to a new level.",
    "rating": 4.1,
    "feature_bullets": [
      "37.5\" UltraWide QHD (3840 x 1600) Curved Widescreen with AMD FreeSync Display",
      "Refresh Rate: 75Hz - Using Display Port",
      "Response Time: 5ms",
      "Pixel Pitch: 0.229mm",
      "Signal Inputs: 1 x USB 3.1 Type-C Port, 1 x Display Port, 1 x Display Port Out, 1 x HDMI 2.0 & 1 x MHL 2.1",
      "The Aspect Ratio is 21:9"
    ],
    "specifications": {
      "Standing screen display size": "37.5 Inches",
      "Max Screen Resolution": "3840 x 1600",
      "Brand": "Acer",
      "Series": "XR382CQK",
      "Item model number": "XR382CQK bmijqphuzx",
      "Item Weight": "23.6 pounds",
      "Product Dimensions": "12.17 x 35.31 x 12.9 inches",
      "Item Dimensions  LxWxH": "12.17 x 35.31 x 12.9 inches",
      "Color": "Black",
      "Manufacturer": "Acer",
      "ASIN": "B01N6S1P2D",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 22, 2017",
      "Customer Reviews": "4.1 out of 5 stars134 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#142,471 in Electronics"
    },
    "categories": [
      "Monitors",
      "Computers & Accessories",
      "Electronics"
    ],
    "price": 1009.55
  }
}