{
  "website_summaries": [
    {
      "verdict": "A modern design for a chair, combined with cushy fabric you will sink into.",
      "pros": [
        "A perfect place to cozy up on a rainy day and read your favorite material",
        "Appreciated for its mature look while still serving as a design statement",
        "Comes in multiple colors"
      ],
      "cons": [
        "You may find this chair is missing pieces and if so, contact customer service right away"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great color and style",
      "text": "Great color and style. However I wish there were photos of the back because it has like zippers on each side. I read a lot of reviews and don’t think anyone mentioned this. Besides that the chair seems nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Joey Scheno",
      "helpful_votes": 148,
      "publication_date": 20171019
    },
    {
      "title": "Perfect chair!",
      "text": "I wanted a chair that looks \"adult\" and is good for reading. This is perfect! The chair looks even better in person. The blue color is true to the photo. The fabric is textured and the overall cushioning is firm. Some may find that sitting in it for a long period of time gets uncomfortable. I bought an ottoman to go with it, so it works out great. Assembly doesn't take long, but you MUST pay attention to which leg goes on which corner. The legs are angled, so if you put them in the wrong place, the holes will not line up.",
      "rating": 5.0,
      "verified": true,
      "author": "GogTop Contributor: Photography",
      "helpful_votes": 40,
      "publication_date": 20180426
    },
    {
      "title": "Orange You Glad I Purchased It?",
      "text": "Great for the price! Very pleased with the color for the price. Color is vibrant and install was easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Clairebap",
      "helpful_votes": 53,
      "publication_date": 20170902
    },
    {
      "title": "Five Stars",
      "text": "I LOVE these chairs! The fabric is a nice texture and a vibrant color!",
      "rating": 5.0,
      "verified": true,
      "author": "jesse",
      "helpful_votes": 26,
      "publication_date": 20171027
    },
    {
      "title": "This wonderful chair does just that",
      "text": "I needed to replace my over size to soft lounge chair..I have arthritis and needed something more to fit my needs...This wonderful chair does just that...Firm and easy to get in and out of...wonderful texture to the chair...just looks great in my living room...btw...took a few minutes to tighten legs...no problem at all !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "L.",
      "helpful_votes": 19,
      "publication_date": 20170910
    },
    {
      "title": "assembling issue",
      "text": "This is a great chair for the price. I bought the orange and was worried it would be too bright but it is not. It is almost a burnt orange - a lovely color. I gave this 4 stars instead of 5 because the when I went to screw in the legs, there was only 4 visible sleeves for the 16 bolts I was able to locate the other 12 sleeves by feeling for them and then punching a hole in the fabric to access them. It didn't that take long and everything worked out fine but I could have done without the stress of having to figure it out and worrying if I was doing something wrong.",
      "rating": 4.0,
      "verified": true,
      "author": "sl",
      "helpful_votes": 3,
      "publication_date": 20181026
    },
    {
      "title": "Too bad chair didn't come with the correct legs that go to it",
      "text": "I so wanted to love this chair. Well the chair part I do. Great Color, seems very solid and comfortable. Showed up on time but... HUGE Problem. The 4 legs that came with the chair don't go to the chair. Not in any way shape or form. They seem better suited for a table. On top of that, the hardware that was sent to attach said legs to chair doesn't even belong with either the chair nor the legs. So kinda confused and irritated.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael J.",
      "helpful_votes": 12,
      "publication_date": 20171106
    },
    {
      "title": "Grey, is green.",
      "text": "Ordered a grey, pulled an olive green/Forrest green chair out of the box. It’s difficult to see how green it is because lighting makes a difference but the ‘grey’ chair is undeniably green in tint. Attached is a photo of our grey couch cushion on the chair and the difference between our couch cushion and the chair is unmistakable. Otherwise the chair seems fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Valencia Family",
      "helpful_votes": 5,
      "publication_date": 20181018
    },
    {
      "title": "Very Uncomfortable Chair",
      "text": "The color is perfect, very muted beautiful sage green. However the the chair itself is very uncomfortable to sit on even for a short period of time. It is hard as rock and the back part is very short and doesnt support your back. I love how to chairs look but the quality is not up to the price tag. Also my cat detected something on one of the chairs and scratched it and pulled some fabric.( the fabric is polyester and looks cheap) He never scratches furniture but he went nuts with this one. I want to return them but I have to pay for the shipping, $150 each chair! I would not buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "ostiadel",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "I wouldn't buy it again.",
      "text": "I've only had it a couple of weeks and sat in it just a few times. The fabric in front below the seat cushion is already loose and \"bunching\", as is the fabric between the buttons. Just looks kind of cheap and poorly made.",
      "rating": 2.0,
      "verified": true,
      "author": "R.K.",
      "helpful_votes": 4,
      "publication_date": 20180403
    },
    {
      "title": "Great Piece",
      "text": "I am the queen of buying furniture online I have gotten some great buys on some good quality items and I am happy to say that this is one of them These chairs are a good quality, nice fabric, easy to put together and modern design You could pay a lot more for something similar at a furniture store but why would you when you can save $$$ & get the same look? Love the color too as its not cheap looking",
      "rating": 5.0,
      "verified": true,
      "author": "Its My Opinion",
      "helpful_votes": 3,
      "publication_date": 20180501
    },
    {
      "title": "Exactly the look I was after...",
      "text": "I can't speak on the durability of these chairs just yet as I just put them together and set them into their new space, but aesthetically speaking, they are lovely and exactly the look I was going for in my husband's music loft space. They are firm but have a bit of bounce in the cushions which is nice. They were easily assembled and came with everything needed in order to do so. Maybe took me a half hour for the two chairs I purchased. At this time, I would recommend these but will update after a few months once they have gotten a bit of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashlie A.",
      "helpful_votes": 3,
      "publication_date": 20180801
    },
    {
      "title": "So glad I took the chance",
      "text": "I never thought I'd buy funiture from Amazon. I never imagined I'd want an orange chair. But this chair is fantastic. I love it! It tucks just perfectly into a little nook I needed to fill and adds the best pop of color to our living room. It's comfortable (though it doesn't come up high enough to support the head but no big deal to me) and well constructed. I have no criticisms at all. I found the pillow and lamp on Amazon too.",
      "rating": 5.0,
      "verified": true,
      "author": "We3GermanShepherds",
      "helpful_votes": 2,
      "publication_date": 20190302
    },
    {
      "title": "... of these chairs in blue and they are really cool. They are firm",
      "text": "We bought two of these chairs in blue and they are really cool. They are firm, but comfortable and very stylish. They came with the legs needing to be screwed on, but that was very easy. My husband is a big man (6'5\" and 230lbs) and he said he found the chair quite comfortable too. I was worried that the back might be too low for him, but he says it's just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopping in DC",
      "helpful_votes": 6,
      "publication_date": 20180601
    },
    {
      "title": "Stylish and Comfortable!",
      "text": "This chair was exactly what I was looking for within my budget. Easy to put together too! It does come in a huge box, so you may need help getting it upstairs. I took it out of the box and had a friend help me, which made it much easier to carry! So far this chair has held up well and hasn't damaged my floors. It comes with sliders to protect hardwood, which I thought was a bonus. One downside is the semi-exposed zippers up the two sides of the back. I threw a decorative blanket over, so I can't tell, but it may bother some people.",
      "rating": 5.0,
      "verified": true,
      "author": "MF11",
      "helpful_votes": 2,
      "publication_date": 20181012
    },
    {
      "title": "they are very pretty and strong they look nice in my room",
      "text": "I would give it 5 stars if one of the chairs had not came ripped on the bottom and the other ones zipper broken. However, they are very pretty and strong they look nice in my room.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynette Collazo",
      "helpful_votes": 8,
      "publication_date": 20170613
    },
    {
      "title": "Legs could be uneven or 1 shorter than others",
      "text": "Decent chair, however after installing legs, one was almost 1/2” shorter than rest, had to cut a wine cork and clue to bottom of one leg",
      "rating": 1.0,
      "verified": true,
      "author": "David Sammons",
      "helpful_votes": 5,
      "publication_date": 20171118
    },
    {
      "title": "Comfy Happy Chair",
      "text": "I carefully read all the reviews and chose this chair because others said it was comfortable and easy to put the legs on. All true. This chair is lovely and I am happy with my purchase. The arms are great to lean on, and the chair is not too low to the floor. The orange color is perfect. I looked at many chairs online and glad I got this one.",
      "rating": 5.0,
      "verified": true,
      "author": "MBK",
      "helpful_votes": 3,
      "publication_date": 20170801
    },
    {
      "title": "Terrible unless you are using it to stage a home and not one sits in it.",
      "text": "I really wanted to like this chair. But it was just wrong in all the places it needed to be good. The seat is mega firm. Like not much softer then my hardwood floors! The back leans back at a nice angle but the seat is so long my feet dont touch the ground. The back isnt high enough or you dont sink into the cushion like I thought you would. It's not big enough to tuck my legs up but too big/long to sit with your feet touching the ground because my feet didnt touch the ground. Perfect chair for staging a home where the chair won't actually have people sitting in it.",
      "rating": 2.0,
      "verified": true,
      "author": "Old stuff",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Five Stars",
      "text": "Very easy to put it together! The color it's exactly like the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita",
      "helpful_votes": 6,
      "publication_date": 20180226
    },
    {
      "title": "Gorgeous chair, but came with defect in upholstery",
      "text": "There's a small defect on mine which I'm pretty upset about (and it's too late to return it) - other than that, it's a gorgeous and affordable chair. The color is stunning and it's very comfortable! The small defect is in the upholstery, where the arms meet the seat. There's a pretty visible hole in the upholstery, so hopefully I can figure out how to cover it up or something.",
      "rating": 4.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 2,
      "publication_date": 20171028
    },
    {
      "title": "Save your money",
      "text": "These are terrible quality. I’ve been looking for chairs for a long time and am disappointed in these. Pulled it out of the box today and the fabric is puckered and pulled.",
      "rating": 1.0,
      "verified": true,
      "author": "BugsMom",
      "helpful_votes": 3,
      "publication_date": 20190130
    },
    {
      "title": "If you are on the fence, just don’t.",
      "text": "If I could give this 0 stars I would. Our first chair arrived with a broken leg. Replacement leg was sent but it didn’t match the others. Amazon replaced the whole chair at this point, but it’s not at all comfortable. The back is too short and the seat isn’t long enough. It’s like a child’s chair, but just a bit bigger. The price often changes and isn’t even worth the lowest price. We will be replacing this ASAP and putting this one in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Kelley",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "No Bolts Included",
      "text": "The delivery is quick and the chair is comfy but I am sitting without the legs as it didn't come with bolts.",
      "rating": 1.0,
      "verified": true,
      "author": "NYBoy",
      "helpful_votes": 6,
      "publication_date": 20171219
    },
    {
      "title": "Pretty chair, not durable for regular use.",
      "text": "We’ve had this chair for 18 months and have enjoyed it. However, I’m not thrilled with its durability. If you’re looking for a chair that won’t be used often, it’s great. But hasn’t done well with being used regularly. The cushion lost all support in the back, and the frame of the seat cushion isn’t the full size of the cushion. This makes it so you feel the hard edge of the frame while sitting. The fabric also looks quite worn.",
      "rating": 3.0,
      "verified": true,
      "author": "Adam and Rachael Wilson",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Leaves something to be desired.",
      "text": "So this \"grey\" chair is green.... the green does not show up in pictures however I tweaked at the settings till I got a good representation of the color. This chair also feels like it was carved from stone(not heavy though, it is actually relitivly light), I may be jumping the gun though, maybe there is a break in period? I've only had it for about 3 days now... The only thing I can say that I truly like is how it looks, minus the color. The style is great, very modern and looks great as an accent chair.",
      "rating": 2.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Love this chair especially for the price",
      "text": "Love this chair especially for the price. Used as an accent chair and couldn’t be happier with the look, material and quality. My only complaint is the screws for assembly were lose inside the chair and I couldn’t locate one of the screws. I can hear it but can’t get to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Kaye Stevens",
      "helpful_votes": 2,
      "publication_date": 20180106
    },
    {
      "title": "A year later. A true review.",
      "text": "One year, 2 adults no kids. Normal wear. Mostly evening seating. So I bought these in oct 2018. I female 5’2, 130. hubby is 200lb 5’7. The tan color is great. The assembly on one chair was perfect, the other chair needed 1/2” of walkers on one leg. Something is weird. Hubby’s cushion has not kept its shape and I’m always trying to adjust it. I was hoping to get more than a year from them.",
      "rating": 2.0,
      "verified": true,
      "author": "BSA",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Cute and Stylish for the Price!!!",
      "text": "I really like this chair.Just got it.. so haven't sat in it much.Easy and quick to get the legs attached.It appears to be pretty good quality for price!!!..I had to take away a star because the bottom of the chair where the legs were stored had a small rip in the material..It won't be seen so I'm not going to worry about it..but slightly disappointed it came that way..",
      "rating": 4.0,
      "verified": true,
      "author": "Kthurman",
      "helpful_votes": 2,
      "publication_date": 20180111
    },
    {
      "title": "Roomy and Comfortable",
      "text": "I was hesitant to buy this because of all of the comments about this chair being green. I can see in a few lights how it looks a little green but most of the time it just looks dark gray. It was easy to put together and I did it alone in under 10 minutes. I'm only 5 ft so the sides are very room and the seat itself is comfortable. Overall for such a cheap price it is an awesome buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cal",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "One Star",
      "text": "Chair had an hole at the bottom + a stain on the side.",
      "rating": 1.0,
      "verified": true,
      "author": "Shank W",
      "helpful_votes": 5,
      "publication_date": 20180724
    },
    {
      "title": "terrific chairs!",
      "text": "I sold almost all of my furniture before moving cross country and didn't want to spend a fortune to replace it all at once. I crossed my fingers and trusted the other ratings. I couldn't be happier. They are very comfortable and sturdy and they went together easily. I would have expected to pay a lot more for the quality. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "and hoped for the best. I am very pleased with the product and ...",
      "text": "So these are not high end chairs (and one should derive that conclusion by the price). However, for the price -- WOW! I am very impressed with this chair for the price. I took a gamble as I needed badly a set of accent chairs for my living room but new chairs were simply not in my budget at the time. I closed my eyes, clicked buy, and hoped for the best. I am very pleased with the product and the blue color brightens up my living room perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole S",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Hard seat. Not comfortable",
      "text": "Pretty chair but the seat is as hard as a rock!",
      "rating": 2.0,
      "verified": true,
      "author": "HotGrubb",
      "helpful_votes": 2,
      "publication_date": 20190814
    },
    {
      "title": "This chair is good for my back",
      "text": "Wanted a chair for living room comfortable enough to watch TV. I have a bad back and need some support. The back and arms give the perfect support for me. I am petite, 5'1\"\", and it is hard to find a chair that fits my size. This armchair fits me perfectly. Also, it fits in nicely with my larger sofa and loveseat.",
      "rating": 5.0,
      "verified": true,
      "author": "amc",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Perfect",
      "text": "Picked this up for a family member who's had to relocate / downsize. Really happy with the quality of the materials, fit and finish of the construction. Firm but comfortable. Assembly was easy, about 30 minutes using the included key, could probably have halved that with a ratchet.",
      "rating": 5.0,
      "verified": true,
      "author": "UnregisteredTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "comfy chair, great value!",
      "text": "I bought a couple of the \"gray\" chairs and love them, they are super comfy and exactly what I was looking for. The color is has a green hue to it, which is why this doesn't get 5 stars! ALlso, set up was each leg has 4 screws to keep it place!",
      "rating": 4.0,
      "verified": true,
      "author": "katherine",
      "helpful_votes": 2,
      "publication_date": 20180328
    },
    {
      "title": "Okay but missing parts",
      "text": "I ordered 2 chairs. They look to be good quality and are comfy. The hardware to put them together was missing on one of them though.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer Curtis",
      "helpful_votes": 4,
      "publication_date": 20170911
    },
    {
      "title": "Two Different Chairs",
      "text": "We ordered two chairs and unfortunately they were not the same chairs at all. One was soft and comfortable and made in China...the second was hard, not comfortable at all and made in Vietnam. The P.O. numbers in the boxes were different as well as the assembly instructions and hardware. We will be returning one and hope to get the correct chair. UPDATE The replacement chair came and it, again, was hard as a rock. I immediately sent it back to Amazon. Not sure how many times I'll return the chair until.i get the right one...taking a star away.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Great color and texture",
      "text": "This is a soft grayish teal, with a somewhat nobby texture which adds interest to the piece. Perfect accent chair. There are very noticeable wrinkles in the fabric on one arm - about a ten inch area.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori B",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Teal color.  Great quality.",
      "text": "This chair was exactly what I expected. Had the legs on it in 4 minutes and it is perfect! After reading reviews I took a chance. The color is listed as blue but it is real (I wanted teal). The seat is very firm and it is quite deep. Excellent quality. Legs are tucked into a pocket in the bottom of the chair.",
      "rating": 5.0,
      "verified": true,
      "author": "DonnaK",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "No back support",
      "text": "Back is too low and does not give any kind of support. I’m only 5’6, my mom is 5’1 and neither of us can sit comfortably in this chair. The seat cushion is firm, the fabric is soft and seems quite nice, so if all you want is a chair for decor, or to encourage your visitors to leave quickly, this is the chair for you.",
      "rating": 3.0,
      "verified": true,
      "author": "D. M. Gribschaw",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Best retro-chairs available for the price.",
      "text": "Bought 2 of these and 2 purple ones from a different manufacturer. These are by far the better choice. Well made, very easy to assemble, and quite comfortable. We used these to create a mid-century modern living room. They fit in wonderfully.",
      "rating": 5.0,
      "verified": true,
      "author": "Hobie CatTop Contributor: Boxing",
      "helpful_votes": 2,
      "publication_date": 20180112
    },
    {
      "title": "Great chair but crazy and erratic price fluctuation",
      "text": "I needed 3 of these chairs but didn’t want to order all 3 at same time in case they didn’t work out. I received one today and it was perfect. I loved it- color, shape sturdy and very comfortable - Amazon even offered a payment plan - GREAT. When I returned the next day to purchase 2 additional chairs the price had increased by $60 apiece - RIDICULOUS. I spoke with Amazon to see if they would honor price but they were unable to. Late tonight I went back and chair is now only $30 more. What the heck Amazon! This was very frustrating- I had to return the chair",
      "rating": 5.0,
      "verified": true,
      "author": "Mamaheet ",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Stiff",
      "text": "The back of the chair is really low and when the chair arrived all the legs were scraped along with the paint. The small bag that came under the chair inside that keeps the chair fresh opened. All the tiny beads went everywhere inside and on the carpet. Overall its a good chair, to just throw in a room you dont use much. Its a pretty chair.",
      "rating": 3.0,
      "verified": true,
      "author": "Strawberry",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "I regret buying this chair!",
      "text": "Not at all happy with this chair. Almost broke my back when I sat in it! The cushion is extremely hard, in no way is this chair comfortable! When I got it out of the box to assemble I noticed a huge tear underneath the chair where the legs were stored. Price is quite high considering the low quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura Taz",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "fits me and looks more expensive than it is.",
      "text": "perfect color. i fit. i'm 5 feet tall and have trouble with chairs and couches. i can reach the floor with this, but my husband is also comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20180627
    },
    {
      "title": "Nicer and more comfortable than expected",
      "text": "I love the color but I thought it wouldn't be too comfy. However, it is pretty comfortable and pretty good for a 5'10\" person with long legs! It looks great but my cats already \"baptized\" it with their nails :o( However, it has proven to be of better quality than expected too. Its price fluctuates a lot so keep an eye on its price.",
      "rating": 5.0,
      "verified": true,
      "author": "Camelia",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Look great but it’s very fragile",
      "text": "This chair overall looks amazing in my space however, when you touch the sides if feels like it’s falling apart inside as though the frame is made out of toothpicks and popsicle sticks. It’s not very comfortable the material is nice but it’s not soft.",
      "rating": 2.0,
      "verified": true,
      "author": "eli",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Wonderful Chair!",
      "text": "The dark teal fabric of this chair is gorgeous! I bought it with the Zinus Andover bed and the colors complement each other. The chair is sturdy and comfortable for both myself and my husband, and we have very different body shapes. I hope to order a couple more of these chairs, I like them that much. Thank you for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "linsey",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "They are perfect. They went together quickly and are comfortable and ...",
      "text": "I ordered two of these chairs to go below a pair of large paintings that had hints of orange in them. They are perfect. They went together quickly and are comfortable and look great. I have had many compliments both on their looks and their comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20171112
    },
    {
      "title": "Awesome",
      "text": "Love these chairs! Sturdy, vibrant orange color. Fabric feels quality, like it will last a long time. Legs were easy to put on. I removed 1 star because they aren't the most comfortable, but they look fantastic. Shipping was extremely fast for the covid era.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Sarvis",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "A bit uncomfortable at first",
      "text": "A bit uncomfortable at first but after it sinks down a bit it's just...passable. I could sit down in this for a long while without many problems but it could be more comfortable. For the price it is recommended. Looks as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "EI",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Inspired my whole living room!",
      "text": "Buying this chair was relative to buying stock! One day it would be one price the next day $40 more!!! WTF?!?? I still want one more, but waiting for the stock market to go down in price.🤦🏼‍♀️",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Vaitkus",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Exactly what I wanted!",
      "text": "The chair came with all the parts neatly wrapped inside the zipper compartment, with all the necessary screws and an Allen wrench for tightening. The chair pad is comfy and seems sturdy enough. A good chair for sitting and having casual conversation, not necessarily for cozying up with a good book or anything! The orange looks awesome for the upbeat, fun and eclectic look I was going for. It’s not quite as bright as it looks in the picture online or the picture I included. Just the perfect orange for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Comfortable and Sturdy",
      "text": "My wife got this for her mother. She has arthritis and needs a certain floor to seat height to sit on comfortably. This is perfect. It is quite sturdy too. Very relaxing with a small ottoman to keep your legs on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Amazingly Comfortable!!",
      "text": "First I bought the gray. I do see hints of green in it but honestly I believe it's in the colors you surround it in. It's compact but I'm 5'3\" 160lbs and its perfect!! I can sit up n it holds the span of my legs but I can also curl up into it to read or watch TV. I love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "rmg78",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Would not recommend this chair",
      "text": "Even though we purchased this chair back in 2018 it sat inside our house unused. We recently put the chair on our newly constructed 3 season porch. It looks great but is hard and very uncomfortable. Also, the front part of the cushion is flattening after limited use. Unfortunately, we did not purchase replacement coverage and are stuck with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great slate gray chair, stylish and modern but firm",
      "text": "Easy to assemble and looks really stylish and modern in our dining room. Only giving four stars because as others have said it is a bit firm in the seat but not at all uncomfortable. Would buy again! Have placed throw pillows on it and it's great.",
      "rating": 4.0,
      "verified": true,
      "author": "L. White",
      "helpful_votes": 2,
      "publication_date": 20171030
    },
    {
      "title": "Legs uneven, firm chair, good to look at",
      "text": "My boyfriend put it together and it took him about 30 minutes. Two of the legs screw holes didn't line up so it took longer. One of the legs doesn't line up with the other three and so we will need to add something to the bottom of it so we don't rock back and forth. It is also very firm - you don't sink into it at all. Will need a pillow for some comfort at the back. Overall, it looks good and you get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Brianna",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "The chair itself is nice. But when choosing the gray option",
      "text": "The chair itself is nice. But when choosing the gray option, be aware it's definitely not gray, it's more of an olive/green.",
      "rating": 3.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 4,
      "publication_date": 20171211
    },
    {
      "title": "You will not be disappointed",
      "text": "Love them! Waited a while to purchase, read many reviews of other chairs. Only thing, if you have cats, they will pull strings out, if they stratch on it. So beware. But they are exactly what I was looking for to finish my \"happy hour\" room!",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Pinnock",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Great looking chair. Average quality.",
      "text": "Great looking chairs. You can tell that they are of average quality due to their lack of comfort. They’re a bit firm and squeak a little. We purchased two and are happy with the purchase. They’re not perfect, but I’d probably purchase them if they were on sale. I wouldn’t recommend this being the main chair you sit in on a daily basis.",
      "rating": 4.0,
      "verified": true,
      "author": "Padgy Soltis",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Love, love",
      "text": "Love, love, love this chair! Fast delivery. Easy assembly. Comfy sit. I own it in 2 colors and I am waiting and hoping it comes out in yellow upholstery so I can get another one for the living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard J Henny",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Attractive accent chair.",
      "text": "Not the most comfortable for continuous lounging, but it is a beautiful accent chair for occasional use. I love this color and style. All you have to do is screw the legs on.",
      "rating": 4.0,
      "verified": true,
      "author": "Darlene",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Very nice!",
      "text": "I love this chair! It arrived in perfect condition, it doesn't wobble, and it's very comfortable. My only issue is that the fabric snags super easy with kitties, I put a blanket over it to help but their claws are still catching the fabric through the blanket :( and the cats really love this chair so it's impossible to keep them off of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Z",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Easy and cute",
      "text": "This is a great accent chair. I find it comfortable - not Laz-E-Boy-Recliner-I-Could-spend-my-whole-life-here comfortable, but I wouldn't mind using this as my perch for watching a movie. It was easy to put together, and the color is great. It does seem a little overpriced.",
      "rating": 4.0,
      "verified": true,
      "author": "SmartShopper",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Great accent chair",
      "text": "Love this chair in our entry area, it adds a nice pop of color. It’s not really comfortable...more for aesthetics. It was an easy update & I’m happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Not comfortable.",
      "text": "This looked so comfortable but if you are not on the tall side, and you sit all the way back without a couple sofa pillows your feet will not touch the ground. And it is only comfortable for a short sit.",
      "rating": 3.0,
      "verified": true,
      "author": "Puppy",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Nice chair, good price!",
      "text": "For the money, great little chair. My son did not have any trouble putting it together. It goes with my living room stuff and is sturdy. Can’t go wrong for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "maurice chevalier",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Great for the price",
      "text": "At this price point, you cannot expect better quality. The chairs are the same quality as a place like Pier 1. I am very glad I purchased these for my family room. They look pretty and are comfy enough.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Looks nice, but thats about it",
      "text": "The chair looks nice but begins to sink very quickly, also the comfort isn't great. Good accent piece for a bedroom if you've got money enough for that.",
      "rating": 2.0,
      "verified": true,
      "author": "Carly Moore",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Good for the price.",
      "text": "The beige isn’t a lovely tan linen shade like I’d hoped. It has a slight greenish tint—I kind of wish id bought the gray. It’s fine, I’ll keep it—good chair for the price and fast shipping.at first I thought they forgot the legs but they were inside.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Kraft",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Great chair",
      "text": "Love this chair - very sturdy and string while comfortable. Great looking. I was looking at several options from other vendors and this was the best",
      "rating": 5.0,
      "verified": true,
      "author": "AF",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Beautiful orange color and stylish",
      "text": "Super happy with this chair. It looks amazing and stylish!! I couldn’t ask for something better!! Putting the legs on was extremely easy! And that’s all you have to install. They do have a certain way to go on the bottom, so match them each to it’s corresponding corner before screwing them on.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicco ",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Great chair for the price",
      "text": "I found this orange club chair on many websites all with good review but Amazon has the best price. The color and textured fabric are great and it is a perfect smaller chair for guests. The legs were easy and quick to install. Very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Customer Service is responsive but can't send right parts.",
      "text": "The chair came intact but was missing the parts to assemble it. It was lacking bolts, spring washers, flat washers, and the allen key. I contacted customer service for the parts. The sent them quickly. I just now recevie the parts... Wrong sized bolts, allen key doesn't fit the bolts, and no washers came. I confirmed what model I had twice to customer service and I cannot assemble to chair. Off to the hardware store for me...",
      "rating": 1.0,
      "verified": true,
      "author": "Grant Filus",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "great purchase",
      "text": "comfortable and WORTH IT! was so nervous to order a chair on amazon! lol but this one is amazing. paired it with a leather ottoman and it looks awesome in my space.",
      "rating": 5.0,
      "verified": true,
      "author": "Clayton Gray",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Nice looking",
      "text": "Good chairs for accent or occasional seating. Beware if you have cats with claws they will be inclined to scratch and the fabric weave pulls easy. Also seems it may tear easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Brox",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Good product nice and sturdy",
      "text": "I like the color and the sturdiness of the chair a little time to put on the legs. The nuts inside the chair had a few burrs but nothing to prevent buying again. The price is great for the chair. To bad they didn't have bright red. Chose blue instead. I bought two of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Kelly",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Comfortable enough",
      "text": "I wanted a chair for my bedroom that I could sit in while getting ready. This chair is good for short lounge sessions but probably not the best if you are looking for something you can really sink into, get extra comfy or nap in. The seat is deep, which I like. I'm 5'3 and my feet don't touch the ground when I sit all the way back.",
      "rating": 4.0,
      "verified": true,
      "author": "Pgeyez",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Great value",
      "text": "Great value on these chairs. Orange matched perfect. For the price - they are really nice but mine are just for looks. They most likely wouldn't hold up to every day use or kids, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "hvmi",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Looks good, but needs work.",
      "text": "As an accent piece I think it’s great. But unfortunately the manufacturing lacked follow through. Big tear at the bottom, I think due to the handeling and the heavy hardware zipped up inside the chair. (Which is a weird way to do that.) And leg holes weren’t cut out from the bottom. Finally, I had to cut away at the upholstery to get some of the screws to fit. Funny thing is this passed inspection number twice, according to the sticker. Ha! I’m happy Amazon costumer service was able to compensate for the condition it was delivered in.",
      "rating": 3.0,
      "verified": true,
      "author": "Exal Iraheta",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Nice looking firm chair",
      "text": "It’s a very sturdy chair, easy to assemble once I realized which legs went where. The fabric and teal blue color is nice. This chair is an extremely firm chair great for support, but not the most comfortable spot for reading.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenni",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "great chair",
      "text": "I quite like this chair. Everyone who comes into my office comments on how great it is.",
      "rating": 5.0,
      "verified": true,
      "author": "groovelady",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Great chair for small rooms",
      "text": "Comfortable, compact, great value. I liked it so much I bought another in denim color. First shipment arrived in good packaging but tear in front...had to pack up and return. Second shipment arrived in great condition",
      "rating": 5.0,
      "verified": true,
      "author": "Karen CA and TX",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "This green \"not gray\" chair is very nice. Bought two for a room",
      "text": "This green \"not gray\" chair is very nice. Bought two for a room. They are very easy to put together, comfortable and sharp looking. Luckily for me the GREEN color works in my room. Ordered Gray but more like an olive green color.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171226
    },
    {
      "title": "Love this chair",
      "text": "Only assembly was to screw legs in. Chair is firm. Only thing is I had to get throw pillow to go in it. I'm 5'4 and can't reach the floor if I sit all the way back lol. A 12x12 pillow fits perfect and makes it so we can sit comfortably",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Case",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Good chair for a small space",
      "text": "I love the color and look of this accent chair. It works well in the space I had and provides extra seating I needed. But the bottom is VERY hard to sit on for any prolonged period of time. I placed a throw pillow on the back for comfort on the lower back.",
      "rating": 3.0,
      "verified": true,
      "author": "Jill George",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Looks Good Really Firm",
      "text": "Lets get the negatives out the way. This chair is firm, almost hard. I suspect they did this to allow it to soften up after awhile. I would not recommend this as your primary sitting chair. It is however a good accent chair for when guests come over. It looks great and the comfort isn't horrible. The fabric looks robust and the legs look great too.",
      "rating": 5.0,
      "verified": true,
      "author": "DAVE",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "REALLY NICE.",
      "text": "WOW LOOKS EXPENSIVE AND SO COMFY! FOR THE PRICE, IM THINKING WOW. REALLY NICE.",
      "rating": 5.0,
      "verified": true,
      "author": "monika lukanus",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Great addition to any room at a good price.",
      "text": "Great chair I added to my home office. Love it... Quality is very good. I'm extremely happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Allycm",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Perfect!",
      "text": "I love everything about this chair. I have a small apartment and it fits really nice. It's pretty comfortable to sit in. The color is what I expected and the material seems durable. It was super easy to assemble too!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica L. Marsh",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Nice chair but the color description is a little off.",
      "text": "So this chair has a lot of padding so it is comfortable to sit on. The back felt like it was positioned a little too far back on it and the back was on the shorter side. Also, I would definitely say that the gray color appeared to have a slight hint of sage green. Perhaps it was the lights we had the chair in but it wasn't the color we were expecting.",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda Totman",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Nice comfy chair but missing screws",
      "text": "The chair didn't quite match our living room furniture, but fit nicely in our office room. It's comfy but as others have commented, the full 16x quantity srews were not included, instead 7 screws were counted. We'll have to go out and look for screws now.",
      "rating": 4.0,
      "verified": true,
      "author": "Atahmas",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Great looking chair!",
      "text": "Love my chair! And perfect size for my room. One of the legs had a small ding towards bottom of leg but otherwise arrived in good condition. I would suggest a stronger box because the box was dented and the chair could have been easily damaged during transport.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great shape and color",
      "text": "Was easy to put together and is durable. The fabric is also pretty forgiving of my cat and toddler. Love the color!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Kelly",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "I received the chair, but the bolts and Allen ...",
      "text": "I received the chair, but the bolts and Allen key are missing. I called the store, but no help. I contacted Amazon, but unless I return the entire chair ... And so, it sits on my floor.",
      "rating": 3.0,
      "verified": true,
      "author": "Cynthia Callard",
      "helpful_votes": 2,
      "publication_date": 20180227
    },
    {
      "title": "Lovely and comfy",
      "text": "I'm just in love with these chairs. I purchased the orange, and the color is spot on compared to then pictures. It was very easy for the mechanically handicapped gal to put together. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Stiff as a board.",
      "text": "This is a solid chair. Completely stiff and uncomfortable. Do not buy this if you want to sit and read or relax. Super sturdy though. Hopefully it will soften at some point?",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathan Frye",
      "helpful_votes": 0,
      "publication_date": 20190828
    }
  ],
  "product_meta": {
    "title": "Homelegance Fabric Barrel Chair, Beige",
    "description": "Color:BeigeRetro lines need not stay in the past with the mid-century inspired lines of the Lucille Collection. With fabric offerings that range from neutral to bold – Beige, Sage Gray, Blue and Orange – button-tufted accenting and stylishly appointed legs, this classic accent chair will provide a look that shows your personal style.",
    "rating": 4.1,
    "feature_bullets": [
      "Beige fabric upholstered barrel chair creates a Retro look",
      "Features button tufted back and brown exposed legs",
      "Expert wood construction supports up to 300 lbs.",
      "Seat Depth: 21 inches; Seat Height: 19 inches",
      "Ships in 1 box and requires minor assembly (legs only)",
      "Included components: Hardware",
      "Fabric type: Fabric Content: 100% Polyester"
    ],
    "specifications": {
      "Item Weight": "39.8 pounds",
      "Product Dimensions": "31 x 30.5 x 31.5 inches",
      "Item model number": "Lucille",
      "Assembled Height": "31.5 inches",
      "Assembled Width": "30.5 inches",
      "Assembled Length": "31 inches",
      "Assembled Seat Height": "19 Inches",
      "Weight": "40.5 Pounds",
      "ASIN": "B01N2LH0C3",
      "Customer Reviews": "4.1 out of 5 stars454 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#181,168 in Home & Kitchen",
      "Date First Available": "November 24, 2016"
    },
    "categories": [
      "Home & Kitchen",
      "Living Room Furniture",
      "Furniture",
      "Chaise Lounges"
    ],
    "price": 259.99
  }
}