{
  "website_summaries": [
    {
      "verdict": "The Vivobarefoot Primus Lux was well-received by most of its purchasers. They felt that this shoe was able to provide functionality and style within the same package; the looks were lauded, and the components were deemed efficient. On the other hand, the sizing scheme and the fit profile were elements that were considered unbound to expectations.",
      "pros": [
        "The lightweight nature of the Vivobarefoot Primus Lux was appreciated by many testers",
        "The leather upper was considered to be durable and long-lasting",
        "Several consumers commented on the underfoot experience, stating that it was comfortable for a low-platform shoe",
        "Most of those who have worn this product stated that the aesthetics were appealing",
        "The toe box had enough space for toe-splay, several runners commented"
      ],
      "cons": [
        "Some people noticed that the fit was a bit narrow",
        "A few consumers observed the sizing scheme to be smaller than the usual"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.3,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not a very durable shoe.",
      "text": "The shoe itself is pretty decent. It looks as expected and the surface material held together well. The sole is very flexible, as advertised, but they don't tell you that it also stretches over time. The sole on mine has stretched so much that it is detaching from the rest of the shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe G.",
      "helpful_votes": 13,
      "publication_date": 20181031
    },
    {
      "title": "fits great and looks nice",
      "text": "These fit me great. I wear a size 12 so I ordered size 46 in these shoes. The leather is good quality and the color is a deep navy blue. I wear them to work and around town. The only thing I don't like is that they could use a little bit more cushion because when walking on sidewalks my feet get sore.",
      "rating": 4.0,
      "verified": true,
      "author": "GuyinUSA",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Great shoe.",
      "text": "Awesome! This neutral shoe can allow you to wear them with anything in the wardrobe and they feel amazing!!!! I cannot wait until more colors come out.",
      "rating": 5.0,
      "verified": true,
      "author": "chris walker",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Just what I was hoping for",
      "text": "I worried these would be uncomfortable with no support but I have been able to walk extensively and do well. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Sheeler",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Comfortable shoes in an odd color",
      "text": "I like the shoes but, being colorblind, they are an odd color to try and match...especially when several people think they look charcoal colored...I’m confused",
      "rating": 4.0,
      "verified": true,
      "author": "End The Fed",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Happy feet!",
      "text": "I have worked outside on a farm for 20 years. I do most work barefooted... about 15 years ago I discovered barefoot shoes. When I have to wear shoes that's what I wear! I had to exchange this pair for one size larger: 45 eur exchanged for 46. Now I have the BEST SHOES ever!! I absolutely love these.",
      "rating": 5.0,
      "verified": true,
      "author": "James C.",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "It's a beautiful deep blue",
      "text": "It's Vivo and it fits like Vivo. It looks far better than the Amazon image.",
      "rating": 5.0,
      "verified": true,
      "author": "John T",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Nice leather walking shoes, fits as expected",
      "text": "I am a big fan of Vivobarefoot shoes, this is the fourth pair that I have purchased. The leather on this pair is high quality, and the shoes are quite comfortable. One difference from some other Vivobarefoot shoes is that the insole is not removable or replaceable.",
      "rating": 5.0,
      "verified": true,
      "author": "mcdickenson",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Excellent shoe. Size down.",
      "text": "Great quality. Fits about 1 euro size large. Normally wear a 43, this shoe fit like 44.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. Limas",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Amazing shoe. Everything is 10/10 quality",
      "text": "Amazing shoe. Everything is 10/10 quality. I just wish I had known to buy a half size to small. The shoe will stretch marginally that makes for a suboptimal fit. Buying a smaller size should fix this problem for future customers.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "Four Stars",
      "text": "This shoes are wonderfully made and extremely confortable, just too large! I wish vivo made 6.5 for men.",
      "rating": 4.0,
      "verified": true,
      "author": "michel",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Viva Vivo Barefoot!",
      "text": "Vivo Barefoot shoes are my new obsession (even though they all look a bit like aqua socks). I did a whole day at Disneyland (without socks) and my feet felt great and didn't smell as bad as you might think they would. Love these shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Black",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Most comfortable shoes I have ever owned perfect right out of ...",
      "text": "Most comfortable shoes I have ever owned perfect right out of the box. First day I wore them I spent 12 hours working on my feet, felt great. My only complaint is that wish they were a little less busy and casual looking. I have super wide feet and vivos are the best",
      "rating": 5.0,
      "verified": true,
      "author": "patrick donohoe",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "Run big",
      "text": "One of the most comfortable minimalist shoes I've ever worn.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "My favorite shoes I've ever had",
      "text": "These shoes are amazing. They look awesome, are super flexible - everything you could want in a barefoot shoe. I actually use it for indoor soccer on a basketball court, where it grips unbelievably well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mink",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "One Star",
      "text": "Not comfortable at all. The material just didn't feel like it was worth the price. Bought Allbirds instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Trevor Skogsbergh",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "No other shoe is as comfortable as this one*",
      "text": "These are my costliest shoes till date, but i would gladly accept that. You can't go wrong with Vivobarefoot shoes. I have 3 pairs so far (tracker, ra, plux) and they all are awesome! *But remember always get 1 size smaller than your actual US size.",
      "rating": 5.0,
      "verified": true,
      "author": "Ekalavya Munirathnam",
      "helpful_votes": 2,
      "publication_date": 20170824
    },
    {
      "title": "Awesome shoes for daily wear!",
      "text": "Awesome shoes for daily wear. Be careful with the sizing, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Shan",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "5 star shoes except I was expecting more blue in the color",
      "text": "Very nice shoes, very nice materials and construction, and very comfortable, as are my other two pairs of Vivo's. I would really like to give 5 stars but must dock a point for the color, not because it was misrepresented on amazon but because it was misrepresented on vivo's site. I was really hoping for a rich indigo blue but instead got a super dark almost black blue. I've attached a few pictures of them around my house (all natural lighting) and a picture from vivo's site for comparison. Color aside, really really great shoes.",
      "rating": 4.0,
      "verified": false,
      "author": "Clayton Thomas",
      "helpful_votes": 3,
      "publication_date": 20180508
    },
    {
      "title": "60 days later and the sole is detaching.",
      "text": "I loved this shoe but it's falling apart after 60 days. Vivobarefoot is refunding my purchase after I return it, but I wanted this shoe to last. Disappointing. I am wondering if lots of these high reviewers still have working shoes...",
      "rating": 2.0,
      "verified": false,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Simply Fantastic",
      "text": "Love these shoes. Perfectly comfortable and look great with shorts and slim fitting jeans. Vivobarefoot delivers once again!",
      "rating": 5.0,
      "verified": false,
      "author": "TL",
      "helpful_votes": 0,
      "publication_date": 20180621
    }
  ],
  "product_meta": {
    "title": "VIVOBAREFOOT Men's Primus Lux Everyday Trainer Shoe Sneaker",
    "description": "A heel-to-toe leather shoe designed for the kind of wild moves that only natural materials can provide. The ultra-minimalist primus lux is built for the urban playground and lets your feet breathe naturally every step of the way.",
    "rating": 4.9,
    "feature_bullets": [
      "Unlined leather upper,Premium everyday shoe",
      "If you're in-between sizes, we recommend you size up.",
      "Outer Material: Other Leather",
      "Inner Material: Leather",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Material Composition: Pittards Leather",
      "Shoe Width: Medium",
      "Wide, thin and flexible"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "34.01 x 13 x 19.99 cm",
      "Date First Available": "6 Mar. 2017",
      "Manufacturer": "Vivobarefoot",
      "ASIN": "B08DJ35HDD",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 186.05
  }
}