{
  "website_summaries": [
    {
      "verdict": "This beautiful pine wood dining set is a perfect addition to your home. Features two benches and unique cottage-themed styling.",
      "pros": [
        "Easy to put together",
        "Seats 6 people comfortably",
        "Bench dimensions are 14.25 inches by 63 inches by 17.75 inches and table dimensions are 35 inches by 70.5 inches by 29.25 inches"
      ],
      "cons": [
        "The surface of the table might need some sanding once assembled"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice set and coustomer service through the company was great",
      "text": "Light weight and sturdy. I was not pleased with the finished product. You will need to sand and polyurethane This top of the bench and table.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20180711
    },
    {
      "title": "Best table EVER!!",
      "text": "My 6 year old son helped me put this table together. I’ve bought pretty much my entire house furniture on Amazon and this by far is my favorite buy yet! Soooo easy to assemble, arrived yearly, the color is amazing, and they took absolute perfect care in packaging! The only thing is the texture of the table is raw, I think. I ran my hand over it and didn’t get any splinters but I’m debating putting a sealer on the top. But still, 5 Stars!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly K.",
      "helpful_votes": 7,
      "publication_date": 20180611
    },
    {
      "title": "Easy to assemble",
      "text": "Very easy to assemble. Says it’s suppose to be used for outdoor use but we love it as a kitchen table. It is real wood, comes natural. So if you are wanting to use it as a dining table in your kitchen as well you will need to seal it or liquids will soak up into the wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick&SamanthaW.",
      "helpful_votes": 2,
      "publication_date": 20200112
    },
    {
      "title": "Great table, amazing customer service.",
      "text": "Better than described. Most reliable customer service I've ever experienced from an online seller. Its a great table. Exactly as described. Easy to build, and very sturdy. Unique finish that costs at least double from other stores. Had a small crack in the table. They replaced it but FedEx lost the package. They sent a replacement (third table) before FedEx even closed the case.",
      "rating": 5.0,
      "verified": true,
      "author": "JB Bobbitt",
      "helpful_votes": 4,
      "publication_date": 20170730
    },
    {
      "title": "Not kid friendly, but gorgeous otherwise",
      "text": "I LOVE this table EXCEPT for the fact that it's hard to clean and I have four small kids. In another life, 10 stars, easily. The look is amazing, the benches are sturdy, the table moves a bit at first but once it's settles on in it's pretty sturdy. I assembled this item alone with four kids under 5 at home, so to say it's easy is an understatement. Definitely a little bulky since the benches don't fit under the table itself. Not an issue if you have the space. I ordered additional chairs for the ends, but totally not necessary. My husband and 3 of our kids can share one bench pretty easily. I would totally buy it again!",
      "rating": 3.0,
      "verified": true,
      "author": "Cass",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Missing parts",
      "text": "The table is beautiful though a part was damaged and assembly instructions were missing. After I called customer service, the assembly instructions were emailed to me but I had to wait an additional 7-10 business days for one part. I would have hoped that there was more care for paying customers and perhaps a faster way to send the missing part. The table though is very nice; does need a protective coat.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "Love the table",
      "text": "Love the table, but it was not sanded or sealed so a lot of the wood gave splinters. Beautiful table, horrible quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Lee Johnson",
      "helpful_votes": 4,
      "publication_date": 20180424
    },
    {
      "title": "I love my table",
      "text": "I love my table!!!!!!!!!! The price was incredible!!!! What a steal!!!! You WILL have to varnish this table and benches. I used a matte varnish and I love it!!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni W.",
      "helpful_votes": 5,
      "publication_date": 20171122
    },
    {
      "title": "Five Stars",
      "text": "This is my favorite one. All my guests visiting me are impressed with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaushik Sur",
      "helpful_votes": 3,
      "publication_date": 20170907
    },
    {
      "title": "This was a great set!",
      "text": "We bought this table for a cabin home and it is perfect. I did not like that the set had no finish on it. You have to varnish it then sand and repeat. Other than it is a great set.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy White",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Nice table but buy extra screw inserts for support brackets",
      "text": "Nice overall look but noticed the screw inserts were pulling out and several screws were loose and or not able to be tightened without stripping. I have replaced 4 screw inserts and 10 screws (went up in diameter and length) on the support brackets under the table and also the hinges holding the folding legs. Overall, easy fixes but time consuming!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Very easy to put together and came with extra parts for ...",
      "text": "Just as described, came very well packaged and definitely took their time in doing so. Very easy to put together and came with extra parts for the install just in case!! I would definitely order from GDF Studio again!!!",
      "rating": 5.0,
      "verified": true,
      "author": "blake",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Nice",
      "text": "a little pricey but I am happy with my purchase. Nice table.",
      "rating": 4.0,
      "verified": true,
      "author": "Rodrigo Canadas",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Arrived damaged",
      "text": "Table was delivered damaged!! A chunk of wood is broken off the leg",
      "rating": 3.0,
      "verified": true,
      "author": "Linda Osborn",
      "helpful_votes": 2,
      "publication_date": 20190606
    },
    {
      "title": "Five Stars",
      "text": "Good quality and easy to put together. Very happy and everyone comments on how unique it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Yourcocoloco",
      "helpful_votes": 2,
      "publication_date": 20170609
    },
    {
      "title": "The manufacturer has sent us a new table and we are very happy with it now",
      "text": "Missing parts and manufacturer says that they can not be replaced. Update: The manufacturer has sent us a new table and we are very happy with it now.",
      "rating": 4.0,
      "verified": true,
      "author": "Dustin A. Foust",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Good but needs a finish on top.",
      "text": "Nice table. Shipped and arrived on time and easy to assemble. I gave it 4 stars because I did not like how the table top has a rough unfinished feeling. I ran my hand across the table and came out with a few splinters. So we sanded it and put some coats of poly. Not a huge deal but definitely can't use the table instantly.",
      "rating": 4.0,
      "verified": true,
      "author": "Ajohn",
      "helpful_votes": 5,
      "publication_date": 20170924
    },
    {
      "title": "Love it",
      "text": "This table and benches took less than 30 minutes to assemble and looks great",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Scherer",
      "helpful_votes": 0,
      "publication_date": 20201209
    }
  ],
  "product_meta": {
    "title": "Christopher Knight Home Cottage Acacia Wood Dining Set, Brushed Grey",
    "description": "This Arlington dining set is perfect for your rustic themed home (or any home You may have. ) Featuring two benches and a table, this cottage dining set helps enhance the overall appearance of your room. Ideal for casual Get Together, This table will become the center point of your kitchen. Includes two (2) benches, one (1) table material: laminated acacia Color: Natural Grain leg Material: laminated acacia leg color: brushed mahogany easy to assemble Bench Dimensions: 14. 25”D x 63. 00”W x 17. 75”H table dimensions: 35. 00”D x 70. 50”W x 29. 25”H.",
    "rating": 3.9,
    "feature_bullets": [
      "Includes two (2) Benches, one (1) table",
      "Bench dimensions: 14. 25”D x 63. 00”W x 17. 75”H table dimensions: 35. 00”D x 70. 50”W x 29. 25”H",
      "Color: Natural Grain",
      "Easy to assemble",
      "This Arlington dining Set is perfect for your rustic themed home (or any home You may have. ) featuring two benches and a table, this cottage dining Set helps enhance the overall appearance of your room. Ideal for casual get together, this table will become the center point of your kitchen"
    ],
    "specifications": {
      "Item Weight": "66.1 pounds",
      "Product Dimensions": "70.5 x 35 x 29.25 inches",
      "Item model number": "299937",
      "Is Discontinued By Manufacturer": "No",
      "ASIN": "B01NBLWIAA",
      "Customer Reviews": "3.9 out of 5 stars25 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#1,193,902 in Home & Kitchen",
      "Date First Available": "December 17, 2016"
    },
    "categories": [
      "Home & Kitchen",
      "Kitchen & Dining Room Furniture",
      "Furniture",
      "Table & Chair Sets"
    ],
    "price": 527.7
  }
}