{
  "website_summaries": [
    {
      "verdict": "Although it isn't made of any special oils, many consumers who love to cook on cast iron surfaces swear by mineral oil to season them, and it would be hard to find a better deal than this generous portion and multi-purpose product.",
      "pros": [
        "All-natural mineral oil, which is a popular choice for seasoning and conditioning cast iron",
        "Doesn't tend to smoke once applied",
        "Large 32 ounce or gallon bottle",
        "food grade",
        "Versatile for numerous uses",
        "Company doesn't engage in animal testing"
      ],
      "cons": [
        "Must be stored in a darkened area away from direct light"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Great price per ounce for a large bottle of mineral oil that's the perfect size for a busy kitchen.",
      "pros": [
        "Excellent quality of food-grade mineral oil, as it's safe to use on nearly any item in the kitchen",
        "Works to restore wooden utensils or cutting boards by preventing water absorption",
        "Enriched with vitamin E, so it's safe to use on the skin"
      ],
      "cons": [
        "Consistency of this mineral oil isn't uniform from bottle to bottle",
        "It may be watery"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good Stuff",
      "text": "it works great. I am glad I got the big bottle see my before and after pix to see how nice it makes the wood look If this review and photos helped you, please click 'yes' below. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Zona Reviews",
      "helpful_votes": 9,
      "publication_date": 20190815
    },
    {
      "title": "Safe for food prep areas and is kind to your nose and skin.",
      "text": "I bought this to seal a raw parawood table, which will serve as a food prep & mixing center in my kitchen. So pleasant not to have to deal with the fumes from petroleum based sealers, plus the oil leaves my hands nice and soft. It brings out the gorgeous grain of the wood. Shipping was fast and it arrived in great shape. Price was good and I am a happy camper.",
      "rating": 5.0,
      "verified": true,
      "author": "CT Yankee gal",
      "helpful_votes": 8,
      "publication_date": 20170429
    },
    {
      "title": "Wow. Worked wonders on a teak kitchen table.",
      "text": "It does amazing things to teak! We have a very old teak kitchen table and the poor table has lost most of it's color and had some very noticeable water marks and such on it. This oil and some paper towels made the table look amazing. And it is certainly easy enough to keep looking that way with weekly or as needed touch ups. I bought it for a cutting board, and it certainly works well on that too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin J. PinkertonTop Contributor: Photography",
      "helpful_votes": 4,
      "publication_date": 20181025
    },
    {
      "title": "YUP- its oil alright.",
      "text": "Its oil... its supposedly food grade.. I'm not a chemist, so I can't verify, but I did use it on a cutting board and I lived long enough to write a review on this. The quality seems good... but then again, its just oil. It is clean and clear and pretty much odorless, all good things. I had a hard time finding this in a brick and mortar, so glad it available here!",
      "rating": 4.0,
      "verified": true,
      "author": "user",
      "helpful_votes": 6,
      "publication_date": 20180712
    },
    {
      "title": "Creates our favorite cutting board finish",
      "text": "Product was great! We are a small family based company that specializes is fine furniture and custom cutting boards. I have been experimenting with different finishing techniques and products for our cutting boards and bought this to make our own wood butter. This mineral oil is extremely easy to work with and so far, our wood butter made using this product has resulted in our most durable and highest quality finish. Will definitely be purchasing again!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 7,
      "publication_date": 20180603
    },
    {
      "title": "Not certified by nobody No stamp of certification from nobody ...",
      "text": "Not certified by nobody No stamp of certification from nobody not halal not kosher Glycerin is an organic compound known more formally as glycerol. Its common sources are animal fat and vegetable oil. Must have certification",
      "rating": 1.0,
      "verified": true,
      "author": "mikhail y.",
      "helpful_votes": 4,
      "publication_date": 20180610
    },
    {
      "title": "Works like you expect",
      "text": "If you seek a food-grade mineral oil for treating cutting boards, knife handles, wood utensils...this does the job well. And it it conveniently packaged in a size that assures you won't run out soon. This is a great value for the money. Don't waste time and money on the tiny 8 ounce bottles for $8 to $10.",
      "rating": 5.0,
      "verified": true,
      "author": "Perkmeister",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "18 oz in a 32 oz bottle",
      "text": "I make wooden cutting boards I use food safe mineral oil to help protect the wood I ordered a 32 oz bottle from amazon for $13.97 it was made by a company named raw and rare when I received the bottle from amazon it had 18 oz in it and no sign of leaking from amazon packaging I contacted raw and rare and they told me that it was a amazon problem not theirs obviously it was not filled at raw and rare I will never again order any thing that comes from raw and rare again",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190103
    },
    {
      "title": "Perfect for the do it your selfer.",
      "text": "This is wonderful stuff. I'm using mine to make a healing salve made with Yarrow. Been in a 1 gallon jar using the sun to infuse the Yarrow into the oil. I'll strain it in 2 more weeks with cheese cloth and mix 6 to 1 in honeybee wax, pour in 5oz jars and give away as presents to friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great value",
      "text": "Purchased for my butcher block countertops. Great product. Goes on smooth, soaks in and leaves no oily residue. Great value for the money. Does exactly what expected..",
      "rating": 5.0,
      "verified": true,
      "author": "C. Hines",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Good Oil for Cutting Boards",
      "text": "This is good food grade oil. I bought it for chopping blocks and cutting boards. This worked great and is a much better deal than identical \"cutting board oil\" in small bottles. But, if you will use a lot, buy the gallon size for under $18, but do NOT buy the smaller squeeze bottles, it's all the same thing.",
      "rating": 5.0,
      "verified": true,
      "author": "RANDY",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "this is the best bang for you buck (largest size for its price)",
      "text": "Comparably, this is the best bang for you buck (largest size for its price). I use it to treat my cutting boards. Soaks in well and evenly distributes. No smell, and not overly greasy (I splashed some on my shirt and quickly cleaned it with dish soap and water, and no residual spot). Product arrived one day early so that was nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny C",
      "helpful_votes": 5,
      "publication_date": 20170429
    },
    {
      "title": "Nice, simple, reliable product",
      "text": "I haven't used any other oils, so I don't have much comparison to contribute to this review. I use it on my butcher's block countertop every couple of weeks, and it seems to be holding up well. It has no odor. I used quite a bit of one bottle on the first coat, but touchups take less oil as time passes. The oil seems to spread more easily after 2-3 applications. I use one bottle every 2-3 months for my 6x3' island. I do tend to ruin papers and bills if I set them on the counter before the oil has completely absorbed (a day or two), but that doesn't bother me too much. Otherwise, works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Great for maintaining cutting boards",
      "text": "It works well to maintain my wooden cutting boards. I transfer a portion to a smaller squeeze bottle for treating my boards to avoid unexpected spills. It a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Good value",
      "text": "Was tired of buying small containers of oil to use on my new butcher block countertops. (And a bit $$$) This is perfect for what I need. The size is a much better value and I don't feel I need to sparingly use it for the counters. I found it went on easy and soaked in nicely",
      "rating": 5.0,
      "verified": true,
      "author": "rick lesser",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Four Stars",
      "text": "Arrived on time and was exactly as described. My wife used it on all of her cutting boards and was delighted by the results, we tried using it on our kitchen cutlery and were pleasantly surprised on how well it brought back the handles. Highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy W.",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Great for butcher blocks",
      "text": "Does what it says it will Love this for my butcher block counter tops. Also add to my facial oil concoction",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Messy, but great oil",
      "text": "Good oil. My only complaint is that no matter how I pour it, it oozes down the sides of the bottle",
      "rating": 4.0,
      "verified": true,
      "author": "ts0215",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Use as directed",
      "text": "I use it to maintain a large maple cutting board and 1 unfinished dining room table. If you use it correctly, you will not get grease stains on clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Schmidt",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Renewed my dark stone sink!",
      "text": "My friend told me that she used this on her dark sink once a week befor she went to bed and since mine was faded and old looking, I decided to try it. It made my sink look new again. I just rub it on with a paper towel. Love it. No odor either.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Dodson",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "RAW + rare Mineral Oil",
      "text": "Exactly as pictured and described. Arrived well-packaged with no spills. Great for giving oil baths to wooden utensils and cutting boards. I would definitely buy again and would recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Whit & Josh",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Good product",
      "text": "I use this to season my wooden salad bowl and cast iron cookware. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "catherine",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Use this as a safe alternative",
      "text": "Just what I was looking for. Priced right and quick ship. I don't use for skin or food but an alternative insecticide for box elder bugs. Works well and doesn't poison my plants, pets or wild life.",
      "rating": 5.0,
      "verified": true,
      "author": "wanderlustfinds",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Quality",
      "text": "After applying the mineral oil to my American Walnut butcher block counter top, they look fabulous. They stay conditioned and the natural colors of the wood standout. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Perfect Solution for Cutting Boards",
      "text": "Our friends gave us a cute Lake Tahoe shaped, wooden cutting board for Christmas, but warned us that we'd need to oil it first. I went online to find out the best method for oiling a new cutting board and found this Mineral Oil, ordered it, received it lickety split and immediately tried it out. Super easy application, and who knew it had so many other uses! It's awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Tanner",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Edit: Works well!",
      "text": "Picture shows 1 gallon bottle, it is easy to get decived. Very strange not to show 32 oz bottle picture.... Update: Amazon refunded my order due to picture confusion. The product itself is wonderful, I applied on my cutting boards and wooden spoons. Nice consistency, not too thick or thin. I didn’t use gloves. You can spread the remnants on hands for nice moisturizing effect. I am changing the rating to 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Abdul Shareef",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Couldn't find plain old mineral oil anywhere in town. ...",
      "text": "Couldn't find plain old mineral oil anywhere in town. This fit the bill. Using it to treat some sea shells for arts and crafts stuff to allow their vibrant colors to show. Arrived earlier than expected and it's exactly as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Good for countertops",
      "text": "I oil our soapstone countertops a few times a year so appreciate finding a good size container of it to store under the sink. Wipe one and wash off and they look like new! Bottle was packaged well (completely sealed bottle) and arrived as noted.",
      "rating": 5.0,
      "verified": true,
      "author": "PDX75",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Make your butcher block counters beautiful",
      "text": "Made my butcher block counters beautiful as well as functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "It is fine, as it should be",
      "text": "It is fine, as it should be, but the top is not quite suitable for pouring out into anything. It always ends up all over the place. I have yet to find a way to avoid spilling out, as soon as it is tilted enough to pour the liquid comes bursting out and not into the container or sponge or whatever.",
      "rating": 4.0,
      "verified": true,
      "author": "TracyTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "The packaging makes it look like it’s a larger bottle of mineral oil. It’s not. Don’t buy!",
      "text": "The packaging makes it look like it’s a larger bottle of mineral oil. It’s not. Don’t buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Jane Goddard",
      "helpful_votes": 3,
      "publication_date": 20190130
    },
    {
      "title": "Worth the value...",
      "text": "Smaller container than I had envisioned. Quality of the oil is excellent. Food grade quality is a plus. The jug and lid are durable enough to reuse again",
      "rating": 5.0,
      "verified": true,
      "author": "WhYsOsERiOuS_69",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Good value, good prosuct",
      "text": "I guess mineral oil is the same, but does this bottle suck. It's good enough that it doesn't constantly leak, but it leaks on every pour",
      "rating": 4.0,
      "verified": true,
      "author": "Rick W",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Works great on our stone sink.",
      "text": "We use this for our cutting board and also for our stone sink (Which is Black). It makes it look glossy.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Fabitz",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Since we prepare food on it I love how it is consumable",
      "text": "I purchased with for my butcher block island top. Since we prepare food on it I love how it is consumable. Immediately after applying it we could see a difference. We left it on overnight to dry and wiped off excess in the morning. It looks like the day we brought it. Definitely recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Good size, works for everything",
      "text": "Go this for my guitar fretboards, knives, and butcher blocks. Great value for the money",
      "rating": 5.0,
      "verified": true,
      "author": "MikeyArgie",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Shake a lot before use",
      "text": "I purchased this mineral oil for my cutting board and wood spoons. A lot of the review mentioned that it is watery the first time I used it it was watery and did leave spots but before adding the second coat I shook it for about 5 minutes and that helped out a ton. After shaking the mineral oil and using it it did an amazing job and my wood cutting board look like new.",
      "rating": 3.0,
      "verified": true,
      "author": "CJ4",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Very happy with this mineral oil",
      "text": "Very happy with this mineral oil. I have used it on a variety of materials from wood to ceramic/stone patio table top and black metal (patio furniture). Shine lasts and lasts. Would recommend and definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "wooden handles look great, but the oil is hard to pour without ...",
      "text": "My cutting board and wooden spoons, wooden handles look great, but the oil is hard to pour without dripping down the side of the bottle. I plan to transfer it to a squeeze bottle that is easier to manage.",
      "rating": 4.0,
      "verified": true,
      "author": "W Sharon",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Great product.",
      "text": "Good value. Use it to condition butcher block and cutting boards. Food grade does not get rancid.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Amador",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "It works",
      "text": "Not much to say, it’s mineral oil, but it really made the grain pop on this cutting board I made. Would have gave 5 stars if it had an easy pour spout. But not too big a deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew M.",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Pure beeswax for many purposes",
      "text": "Good price and exactly what I wanted. I mix this with mineral oil to make food safe finishes for wooden eating items.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great",
      "text": "The mineral oil arrived quickly. I use it to oil my soapstone sinks. It’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggiez",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Wonderful Mineral Oil",
      "text": "I just received the product and have used on 3 cutting boards and works great. Odor free, smooth and silky to the touch. I used the oil on my hands as a conditioner.",
      "rating": 5.0,
      "verified": true,
      "author": "philparty",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "good price",
      "text": "use this on my butcher block counters. the wood soaks it up and when used consistently protects well.",
      "rating": 5.0,
      "verified": true,
      "author": "Beatrix Kiddo",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Rip off",
      "text": "Paid way to much. I honestly thought I was getting a gallon not 32 oz",
      "rating": 1.0,
      "verified": true,
      "author": "lindy",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "Great value, good oil.",
      "text": "I use this oil to condition wood cutting boards and utensils. Compared to the small bottle of oil, we used to buy at Bed, Bath and Beyond...this is a much better value. The only thing I could suggest is that it come with some kind of pour spout, instead of it being an open mouthed jug.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Singer",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Cutting Board Oil",
      "text": "This is scent free baby oil I use to that bamboo in the kitchen",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy Joe",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Good quality product.",
      "text": "This product was precisely as described in offering. I have used it shortly after receipt and am well pleased with it. I would not hesitate to purchase further from this vendor.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "This product works great. I had a new custom made butcher block ...",
      "text": "This product works great. I had a new custom made butcher block made for my island. this mineral oil was just what I was looking for and works great. My butcher block looks so beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Gives new life to old drying Aero Press.",
      "text": "Tried a small section on my custom made mesquite cutting board. Good oil, thickness just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Brundige",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Worked as I had hoped!",
      "text": "It worked as I had hoped. I used it on my Catskill butcher block. It had dried out due to it being stored for years. I was not sure it would recover. It is one of those 4 inch thick blocks but I was able to make it look like new. A thing of beauty. It did take several applications. It would drink up the oil. I love my block so I love this oil!",
      "rating": 5.0,
      "verified": true,
      "author": "Lorenza Pennington",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Five Stars",
      "text": "fantastic for all the wood cutting boards and stainless utility tables",
      "rating": 5.0,
      "verified": true,
      "author": "Antoinette Brytowski",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "I like it",
      "text": "It works great on my cutting board and knife handles",
      "rating": 4.0,
      "verified": true,
      "author": "baker22",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Five Stars",
      "text": "Nice oil my counter looks great and is absorbing it like a sponge",
      "rating": 5.0,
      "verified": true,
      "author": "jhatch",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Raw and beautifully done, we say thanks a bunch. Sayunara.",
      "text": "I'm so proud of this purchase and of course I love it immensely! Thank You.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Shadrick",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Photo of product shows one-gallon size! You’re buying 32 ounces!!!",
      "text": "Main photo for product shows one-gallon sized container. I foolishly just looked at the photo and purchased...received 32-ounces....not too pleased! I’ll be more careful to read the descriptions in the future!",
      "rating": 1.0,
      "verified": true,
      "author": "G Brent Smith",
      "helpful_votes": 2,
      "publication_date": 20180926
    },
    {
      "title": "This is the good stuff. Food grade",
      "text": "This is the good stuff. Food grade. Will use on my Boos Block cutting board and any other wood surfaces where I prepare or eat food.",
      "rating": 5.0,
      "verified": true,
      "author": "L C H",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "As expected. Thankfully it wasnt leaking and the seal ...",
      "text": "As expected. Thankfully it wasnt leaking and the seal inside the cap was still intact, a bit of a rarity now.",
      "rating": 4.0,
      "verified": true,
      "author": "Faith and David",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Seems to work.",
      "text": "Works as expected without any issues... Need to wait a year or so to determine if it extends the life of the cutting boards I've used it on.",
      "rating": 4.0,
      "verified": true,
      "author": "Hal In Tex",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "This is a no scent oil that has renewed my ...",
      "text": "This is a no scent oil that has renewed my wooden handled knives and wooden spoons. I will use it every month to continue to maintain them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri Ober",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "No scent",
      "text": "Great product. Works really well in all woods and holds up nicely. The bottle is also nice as it doesn’t spill.",
      "rating": 5.0,
      "verified": true,
      "author": "Libra L.",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "It made the cherry wood beautiful. It was easy to apply",
      "text": "I used it for a butcher block countertop. It made the cherry wood beautiful. It was easy to apply, and worked as it was supposed to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Java",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Came fast already used it works great, I’m using it in an oil filled submersible ...",
      "text": "Came fast already used it works great, I’m using it in an oil filled submersible sump pump motor so didn’t really need the vitamin E. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Buddy",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Fills the NEED!!!",
      "text": "ust what I needed for my Cutting Boars I make. I could not find this in any locial stores in Williamsport PA. Works GREAT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Luther D. Leonard",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Mineral oil",
      "text": "I have been looking for a good oil to put on my cutting boards. This one is great. It is also food safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa ",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Five Stars",
      "text": "good stuff, polishes my butcher block table nicely and stays shiny for weeks",
      "rating": 5.0,
      "verified": true,
      "author": "Shane",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Cutting board protection",
      "text": "We used it for a cutting board coating. Seems to absorb fast and yet no greasy feeling. Had to use a lot but hopefully we have it covered good.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra K FLynn",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Protection for bambo cutting boards.",
      "text": "Got a bambo cutting board for Christmas and want to take good care of it so it will last a lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie D. Vincino",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Real Mineral Oil",
      "text": "Arrived on time and package intact. What else can you say about mineral oil?",
      "rating": 5.0,
      "verified": true,
      "author": "MountainCowboy",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Good purchase",
      "text": "Worked as expected, I treated our new butcher block counter-top with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Whammy",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Five Stars",
      "text": "Great quality in mineral oil. Received and starting using on my cutting boards. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Guy",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Trust and save your bee",
      "text": "Fast service. At the designated time. Quality the best, as it was described by the seller. Very effective against bee warroa. I recommend this to all beekeepers..",
      "rating": 5.0,
      "verified": true,
      "author": "khareba ltd",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Five Stars",
      "text": "awesome product - very happy i can finally use my new cutting board!",
      "rating": 5.0,
      "verified": true,
      "author": "stefasaurusrex",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Goo To Use Making Wood Butter",
      "text": "I used this mineral oil to make wood butter. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Happy with how quickly it arrived",
      "text": "Don’t really have much to say. It’s oil. I use it for my butcher block. Happy with how quickly it arrived.",
      "rating": 5.0,
      "verified": true,
      "author": "Badmofo ",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "great for oiling bread boards",
      "text": "It is what it is. Pure mineral oil, great for oiling bread boards,granite composite sinks,and the like.",
      "rating": 5.0,
      "verified": true,
      "author": "KGB",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Works well. Used it on all our wooden kitchen ...",
      "text": "Works well. Used it on all our wooden kitchen items. Soaks in well and is virtually odorless.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug F",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "light and odor free",
      "text": "Use it to lubricate tools while avoiding the odors that accompany thicker petroleum products",
      "rating": 5.0,
      "verified": true,
      "author": "Philip Whalen",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Mineral oil",
      "text": "Use this daily for medical reason and use it to oil my wood products Uses daily",
      "rating": 5.0,
      "verified": true,
      "author": "pb",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Seems to work great",
      "text": "I got this oil to treat several handmade wooden cutting boards I have. I used two coats as they had never been treated before and they look great! The oil seems to have done its job.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Very durable",
      "text": "I have used it on cutting boards and outside teakwood furniture. It has worked great for both uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey B.",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "... Acacia end grain cutting board and it looks so great I started using it on the rosewood handles of ...",
      "text": "Used it on our Williams Sonoma Acacia end grain cutting board and it looks so great I started using it on the rosewood handles of our kitchen cutlery as well. Very cool stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "... product came quickly and it appears to be a good product for my needs",
      "text": "The product came quickly and it appears to be a good product for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Perrotta",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "EXACTLY what I needed!",
      "text": "Used this wonderful product, mixed with bees wax, to create a wood finish that is 2nd to none. Bravo!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "My son built a very long oak dining room table ...",
      "text": "My son built a very long oak dining room table out of a fallen tree; we have been applying daily to season the wood tabletop. I will be placing an order for me to keep my wood cutting boards in shape.",
      "rating": 5.0,
      "verified": true,
      "author": "RAH",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "N/A",
      "text": "As described and delivered quickly: what’s not to like? Most highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Walt",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Five Stars",
      "text": "good price for mineral oil. works well with my wooden cutting boards.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Five Stars",
      "text": "Needed a larger size for my new cutting boards. This fit the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "Works great for soapstone! Shipped fast!",
      "text": "This mineral oil shipped fast and performs just as described. It works perfect for applying to my soapstone countertops!",
      "rating": 5.0,
      "verified": true,
      "author": "Teri S.",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Good product",
      "text": "Great for Wood cutting boards and cast iron. I love using it on my cast iron, as it does not gum up. Odorless and food grade.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Livingston",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Just what it says.",
      "text": "Great for whatever you need it for! I use it for cleaning my paintball gun, and it's cheap and lasts for a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew J.",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Works great!",
      "text": "Mineral oil brought my wood cutting boards and utensils back to original beauty. Love it!",
      "rating": 4.0,
      "verified": true,
      "author": "Erin Meeches",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Great product",
      "text": "On time, packaged well, great product. Can be used on teak, cutting boards etc.",
      "rating": 5.0,
      "verified": true,
      "author": "JMB",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Love this stuff",
      "text": "Good value. The package came on time and it works great. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Neilson",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Very good food safe seal and for cutting boards",
      "text": "Great product really seals all the scratches on wooden cutting boards. Lasts",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Leinbach",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Works just as intended used it for my homemade butcher block",
      "text": "Worked exactly how it should for the purpose I used it for which was for my butcher block that I made",
      "rating": 5.0,
      "verified": true,
      "author": "Vinny",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Five Stars",
      "text": "Excellent shipped fast great product for tools. And butcher block",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Quality product",
      "text": "Use it on a butcher block top in the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "dcwerner",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Pleased",
      "text": "Wonderful packaged, arrived quickly, used it today on all my cutting boards and wooden spoons! thanks nice product",
      "rating": 5.0,
      "verified": true,
      "author": "J. Goeller",
      "helpful_votes": 0,
      "publication_date": 20170423
    }
  ],
  "product_meta": {
    "title": "Mineral Oil 32 oz, Food Grade Safe Wood/Bamboo Oil, Cutting Board, Butcher Block Conditioner, Knife Blade, Cast Iron Tools, Pans For Food Kitchen, Vegan by Raw Plus",
    "description": "Mineral oil restores dry surfaces and promotes healthy skin and hair for an ultimate nourishing treatment. It is a wonderful natural addition to your beauty routines. Good for preserving razors, knives, stone, and wood. Safe for a multitude of cosmetic application. Tasteless, colorless, odorless. Enriched with vitamin E.\n\n\n\n\nRecommended Use: Apply directly onto wooden or metal tools to restore moisture. Multi-purpose lubricant for remedial treatment. Tasteless, colorless, odorless. Kosher certified. 100% white mineral oil. Do not apply over open wounds, infections, burns, or lacerations. In case of contact with eyes, rinse immediately and seek medical advice. Stop use and ask a doctor if condition worsens or symptoms remain the same. Do not use if tamper evident foil seal under cap is broken or missing. Manufacturer, distributors, and dealers disclaim any liability for misuse of product. Keep out of reach of children. Store in a cool, dry area, away from direct sunlight. Please recycle when empty. Raw Plus Rare does not test on animals.",
    "rating": 4.7,
    "feature_bullets": [
      "Our pure mineral oil is USP food based and organic derived. Kosher certified. Naturally tasteless, colorless, odorless.",
      "Enriched with vitamin e. Safe enough to use as a topical treatment for sensitive, dry, cracked skin like eczema. Can be used to remove makeup without clogging pores.",
      "Restores moisture in dull wooden cutting boards, metal blades, cast iron tools, or soapstone countertops.",
      "Food Grade Mineral Oil",
      "32 & 128 fl oz filled in a plastic container with heat sealed foil and resealable cap for leak-proof closure. Ergonomic design handle allows easy grip and carrying convenience."
    ],
    "specifications": {
      "Product Dimensions": "5 x 2.5 x 7.5 inches",
      "Item Weight": "1.9 pounds",
      "ASIN": "B01NBT0KD5",
      "Item model number": "R10003",
      "Customer Reviews": "4.7 out of 5 stars515 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#37,893 in Health & Household",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 1, 2017"
    },
    "categories": [
      "Wood Polish & Care",
      "Household Supplies",
      "Home & Kitchen",
      "Health & Household",
      "Wood Polish",
      "Household Cleaning"
    ],
    "price": 13.97
  }
}