{
  "website_summaries": [
    {
      "verdict": "The Nike Lunar Fingertrap TR was praised for its aesthetics and comfort. Users were also pleased with the shoe’s performance as an everyday workout trainer. On the downside, the need for a break-in period and lack of traction caused trouble for some testers. But overall, the product still offered adequate quality for a moderate price.",
      "pros": [
        "A considerable number of users were happy with how comfortable the Nike Lunar Fingertrap TR was",
        "A majority of the wearers claimed that the trainer was true to size",
        "Many buyers liked the overall design and colorways of the model",
        "The flexibility of the shoe was considered sufficient by most training enthusiasts",
        "The trainer’s sole offered ample cushioning and stability for various gym exercises, according to several customers"
      ],
      "cons": [
        "The trainer fit slightly tight at first and took some time to break in for a handful of buyers",
        "A few wearers warned that the shoe was not slip-resistant",
        "it had poor traction on smooth wet surfaces"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.7,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Horrible quality",
      "text": "Purchased these on 5/16/2018 as of 6/14/2018 they already are broken. The quality of these shoes are not on par with the Nikes we purchase from the stores. Not sure if these are not authentic or if it’s just a bad batch, I don’t think a shoe should already be broken after a month.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 78,
      "publication_date": 20180615
    },
    {
      "title": "These are NOT Nike.",
      "text": "These shoes are fake. The quality is absolutely terrible. This is my third pair of the fingertip shoes, and I loved the first two. The sole is a complete phony. The insole is not removable, it is glued down. Also, no nike sign on the insole was a dead giveaway. I tried to give you guys the benefit of the doubt, because they were so heavily discounted, but I bought these to run in, and they're the worst running shoes I have ever owned. This company is a SCAM! Do NOT waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Cory Scharnhorst",
      "helpful_votes": 45,
      "publication_date": 20190311
    },
    {
      "title": "They are GREAT SHOES!!",
      "text": "I LOVE THESE SHOES!! This is my second pair of them, my first were the white and black and now I have the gray and black. They take a little time to break in because of my wide feet, but I love them I was sad to see my old ones go but happy when my new ones came in 2 DAYS!!",
      "rating": 5.0,
      "verified": true,
      "author": "RANDY J",
      "helpful_votes": 40,
      "publication_date": 20180209
    },
    {
      "title": "Size issues",
      "text": "Serious issue with the ssizing on this model of shoe. I have worn a sz13 for years with Nike, ordered these in sz13, way too big. Ordered sz12, too big. Just got them in a sz11.5 and they are still too long but are now too narrow. It seems the length of this model doesn’t change. All of the sizes were marked as same width. No idea what’s going on, totally disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Heinkel",
      "helpful_votes": 25,
      "publication_date": 20180907
    },
    {
      "title": "The shoes are not pair",
      "text": "Shoes under rubber sole isn't pair. Right is more longer and larger... so ugly...I frustrate with Nike and Amazon. How they can failed in processing? is it fake one? This is not nike quality. I'm abroad now, so I will not return the shoes but I never buy nike in Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Jaehong L.",
      "helpful_votes": 21,
      "publication_date": 20190209
    },
    {
      "title": "Good Workout Shoes",
      "text": "Bought these shoes for my personal training sessions. I mostly do split workouts and at times throw in a few circuits. These serve me well for the most part. The other day I tried playing basketball in these and kept slipping constantly. So, stick to regular workout and not sports if you're wearing these. The right shoe fits my feet a little tight. Likely just an adjustment I need to make with the shoe laces.",
      "rating": 4.0,
      "verified": true,
      "author": "The Guy Who Bought This",
      "helpful_votes": 11,
      "publication_date": 20180911
    },
    {
      "title": "These shoes are stiff",
      "text": "My doctor wears these every day. He has multiple pairs of different colors. I thought they looked very interesting so I ordered a pair. Maybe my feet are getting bigger, but these shoes seem to run a bit small. I hope they get more flexible since these are very stiff at the moment. I am used to wearing softer shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "E. White",
      "helpful_votes": 4,
      "publication_date": 20181209
    },
    {
      "title": "Not real Nike shoes because..",
      "text": "These are not real Nike shoes because, I scuffed them just a little bit and I cannot get rid of it. Real Nike shoes of any kind are durable, not like these that got ruin by a small scratch. Not only, the fabric of the shoes started to peel off and turn white. I have the original pair of shoes of the same kind bought from the mall, and they lasted me 4years. These ones in the picture got ruined in less than a month and the straps are beginning to rip. They fit my size, but are very tight on the sides.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 2,
      "publication_date": 20191114
    },
    {
      "title": "Very comfortable",
      "text": "I find these to be very comfortable. The insole has even allowed some pain I've had in my metatarsals to heal. The unusual fingertip design does make the lacing process a tad more difficult than traditional eyelets and the sole has very poor performance on slick surfaces. But for use as a general fair weather walking shoe or indoor gym shoe, they are well suited.",
      "rating": 4.0,
      "verified": true,
      "author": "Phillip U.",
      "helpful_votes": 3,
      "publication_date": 20180928
    },
    {
      "title": "Awesome shoes!!",
      "text": "Generally i wear 10.5 but after looking at previous reviews, i ordered 11 and i was happy with my decision. I liked the design and the quality. It fits really nice. Its comfortable to walk/jog/workout, Actually this has become my \"go-to\" shoes. One thing i did not like is the traction on wet surface. I felt like there is no traction at all on the wet surface. Not sure if the sole material is like that. But other than that, i liked this shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Durgesh_Gnote",
      "helpful_votes": 3,
      "publication_date": 20180829
    },
    {
      "title": "Awesome shoe!",
      "text": "Purchased these shoes for my 8 year old son and he loves them. He said they are so comfortable. I like them because they do not shoe dirt easily and they clean up nicely. They have plenty of support in them and they seem to be holding up well. My son typically wears a Mens 7 and that is what I purchased in this shoe and it fit perfectly. No complaints!!",
      "rating": 5.0,
      "verified": true,
      "author": "D Roper",
      "helpful_votes": 3,
      "publication_date": 20180712
    },
    {
      "title": "Good Sneaker Purchase",
      "text": "The Lunar Fingertrap Cross Trainer feels lite yet solid and looks decent on my feet. Never been too thoughtful about styles, unless Nike's sneaker products offered advantages other companies do not use in the design of a sneaker. I wore my sneakers during a three mile walk, then a 2 mile run, followed by weight lifting. I did not need to change sneaker, no change in my feet either. Great feeling all the while wearing the sneaker. For comfort I may add a arch support later. Overall, I am satisfied with my purchase. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Claude",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great quality sneakers!",
      "text": "Bought these for my son for gym class and they are just as expected... Perfect!! He says they are comfortable with great support. They stand out and are a great looking pair of sneakers!! Great job Nike!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian \"SpookYouLaterz\" Lubecki",
      "helpful_votes": 3,
      "publication_date": 20190811
    },
    {
      "title": "Make sure your getting Nike’s if that’s what you ordered!",
      "text": "I have wore Nike tennis shoes for 25 years. Never has a pair fit like these. Not Nike Quality for sure. Really wonder where these shoes came from. I will never purchase shoes like this again. I will go to the store and see them, feel them and know what I’m buying. They actually hurt my feet an hour wearing them. That’s not Nike!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "AMAZING NIKE SHOES!!!",
      "text": "Well first off I wanna clear the air of reviewers stating they are fake. There are many types and sizes of shoes Nike makes along with different authentication they do vs what third parties do. Most easiest way to tell a fake from real is by serial number on shoe tong and detail and texture of shoes. These are NOT fakes. They are real. As for the quality it feel durable and are extra comfy to wear. If they are ripping I'm not sure how your doing it to them. Size matches what I usually wear and they have a nice style, overall I'm satisfied with them and hope to have them for some time.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Bought for a woman",
      "text": "Got this for my husband a year ago, but I was jealous of the design. I got it for myself and just used the nike.com sizing chart to switch between mens and womens sizes. I tend to have wide feet, and depending on the womans show style, have to purchase a wide width instead of medium. This fit well, and the arch support is great. My last pair of nikes needed extra arch support, so I got a pair of superfeet inserts, but these already have good arch support. They look amazing and fit well. Worth the buy!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Smith",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Worst shoes I've ever purchased",
      "text": "This hurt the sides of my feet. There is no stretch or flex with them so your feet start to hurt within 10-15 minutes because of the pressure being applied to the sides of your feet.. I recommend something more comfortable.. while these look good.. they don't feel good.",
      "rating": 1.0,
      "verified": true,
      "author": "Arcteryx",
      "helpful_votes": 3,
      "publication_date": 20190531
    },
    {
      "title": "Very narrow",
      "text": "As someone who does not have wide feet, I find these shoes to be very uncomfortable after about 30 minutes of wearing due to the tightness around my arch and top part of my foot. They are still somewhat comfortable, just don't expect extended wear to be comfortable unless you have freakishly narrow feet.",
      "rating": 2.0,
      "verified": true,
      "author": "Travis bryant",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Decent value",
      "text": "Very soft soles, wide base, decent tread, flexible uppers. Seem to shed dirt well after a week of wear. The strings are a bit wide so can’t be tied very tight without becoming sore on the top of the foot. That is an individual fit tho so not really a con. Bottom line, less expensive than air max so ok value.",
      "rating": 4.0,
      "verified": true,
      "author": "msmoll91",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Nice Styling...Terrible Fit",
      "text": "I was excited to get these. When I got them when trying on I realized they were really tight. I looked at the tag and verified that it was the same size as the 5 other pairs of Nike's that I own. They seem like they are the same size if you hold them up to other shoes, however the outside of it is just too tight. They also squeak when you walk. Tried to return and apparently missed the return window by one day. Frustrating for $100 pair of shoes.",
      "rating": 2.0,
      "verified": true,
      "author": "Mini Guy",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "No traction at all.",
      "text": "No traction on wet surfaces. I almost broke my leg wearing this shoes. It was like walking on ice.",
      "rating": 1.0,
      "verified": true,
      "author": "Mario.tamez",
      "helpful_votes": 4,
      "publication_date": 20190412
    },
    {
      "title": "Cool sleek design and comfortable to boot. Nike at its finest",
      "text": "I absolutely love these shoes. The moment I saw them I just knew that that I had to have them. I'm a size 10.5 and they fit perfectly. Not too tight or narrow but still snug enough to not slip out of even with the laces untied. They slide right off or on with ease. Definitely one of my favorite pairs of shoes ever. All at a very reasonable price. Not to mention they look great as well. Five stars hands down. Extremely pleased with the purchase and service.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Barousse",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great shoes",
      "text": "I think Nike shoes run a half size small in general.. I normally wear an 11.5 or a 12. I got a 12 this time and they fit good for me. I used them for reffing basketball. Very comfy, not the best grip on the court, but that's not what they are designed for. I didn't have sore feet after my first day of wearing them. So they look good and they feel good. I will buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff J.",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Great Light Weight Nike Shoe",
      "text": "Great shoe, I really love nike. The strange thing is that I had a nike size 11 that seemed tight so when I ordered this in a size 11 I was worried that it would be small. It turned out to be too large, I returned it and will reorder 1/2 a size smalled once the return goes through.",
      "rating": 4.0,
      "verified": true,
      "author": "Fadi",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "NO. Just NO",
      "text": "Wow! What we thought were a GREAT pair of shoes have started falling apart after 6 weeks of normal wear. No running, cross training, nothing and part of the material has torn away at the stitching!",
      "rating": 1.0,
      "verified": true,
      "author": "Jerrie Newport",
      "helpful_votes": 3,
      "publication_date": 20190220
    },
    {
      "title": "Fit's like a glove",
      "text": "Title says it all. I was skeptical at first. Don't really but shoes online but under the special circumstances of being away from society or the convenience of a store I had to buy. And my old shoes were getting the beat down. The shoes were awesome. Very happy guy and super satisfied with product.",
      "rating": 5.0,
      "verified": true,
      "author": "AlxCdog",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Don't waste your money",
      "text": "So the whole finger trap lace up system looks cool, but it's a pain in the neck to adjust when it's too tight. The shoes are not very supportive on the sides for heavier men (I'm just over 300 lbs) who want to lift weights or walk a distance. The inside cushioning is already compressed to the point where they are uncomfortable. Too bad I already threw out the box or I'd send these back.",
      "rating": 2.0,
      "verified": true,
      "author": "David J. Koby",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Tighter than normal.",
      "text": "they are great trainers, i just have an issue with the width. I’m aware that Nike shoes tend to be a bit tight, so I purposefully bought these 1/2 size too large because I have wide feet. They are still very tight. My workouts are generally less than an hour, and I don’t run in them, so it’s tolerable. Just be aware that these are a tight fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristi Dowden",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "a bit narrow",
      "text": "Fits a bit more tightly in the midfoot than other 10.5 Nikes I have had, noticeable mainly when I am putting them on, which takes a slight bit of effort. The lacing is ergonomically different as well, but tightens nicely. The shoes function well for athletic activities",
      "rating": 4.0,
      "verified": true,
      "author": "Bud K",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "My mistake",
      "text": "Originally got these in an 11.5 and the were pretty tight so I sent them back. Check my other Nike running shoes and they were a 12. Got a 12 and they have been great. Nice shoes but make sure you get your correct Nike size.",
      "rating": 5.0,
      "verified": true,
      "author": "g_mini18",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Decent Gym Shoe",
      "text": "Not my favorite Nike shoe. Normally I love the way Nike's hug my foot and have good cushion/support on the bottom. This pair of Nike's are a little more wide around the upper part of the foot than what I am used to with Nike. This shoe is good at the gym, but does not make for a great running shoe in my opinion.",
      "rating": 3.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "This is my second pair",
      "text": "They are really supportive and really hug your foot when you tighten them. I tend to lace them up a bit looser since they already have an internal sock and can get a bit too tight on my foot if I pull the laces too much. I paid $100 for a similar shoe a few years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Quality of shoe is bad",
      "text": "These were for my so. They fit him perfect and they look good. The problem was the second time he wore them the criss cross on the front of the shoe broke already. The quality of shoes are just not good anymore. I wanted to give less stars but the seller got the item to us quickly and it’s not their fault that the shoe maker sucks",
      "rating": 3.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Comfortable shoe and true to size for me",
      "text": "Comfortable shoe and true to size for me. Two weeks of wear and the grey dye is rubbing off on right shoe. Only worn to and from gym. Questioning if these are authentic nike.",
      "rating": 3.0,
      "verified": true,
      "author": "greg wright",
      "helpful_votes": 4,
      "publication_date": 20180605
    },
    {
      "title": "Nice look, good comfort, true to size",
      "text": "I use them for cross training workouts in the gym and daily wear. They are pretty comfortable and have a cool look to them. I usually wear an 11, but 11.5-12 in Nike shoes. I bought 11.5, which fit pretty well. I actually had enough room to add some athletic insoles which made them SUPER comfortable now.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Hughes",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Unbelievably comfortable!",
      "text": "These are the ONLY shoes my husband wears! He has terrible achilles heel issues and works on his feet all day. At the end of the day these shoes work! When he has worn other shoes or boots he is in a lot of pain. We buy these 2-3 pair at a time so that he will always have them on hand when the current ones are worn out. They run true to size, he’s a 10 1/2 and that is exactly what we buy. I can’t say enough about these shoes. Buy them, you wont regret it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanette B",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Great general purpose gym shoe.",
      "text": "Purchased men’s 10.5 . Nike sneakers seem to fit smaller than average walking/gym shoes. If you like a thick cushioned sneaker you need inserts. Great all around gym shoe but more cushioning needed for running on pavement.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Awesome shoe!",
      "text": "These are my favorite pair of Nike’s so far. Great comfort for walking on concrete all day. I’m not a runner so I couldn’t tell you how they hold up to pounding pavement. Great shoe for a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Cool but didn't meet all expectations",
      "text": "They fit just right providing you won't need a lot of insole cushion. I was expecting more of a black color but they are charcoal gray. Other than that, the design is catchy",
      "rating": 4.0,
      "verified": true,
      "author": "Crazy Earl",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Best sneaker yet",
      "text": "These are the best sneakers that I’ve ever had in my life! They fit great, they look great. Easy to clean. After 16 hours on my feet in them, I am not sore and there is no smell. They breath great!",
      "rating": 5.0,
      "verified": true,
      "author": "Harth Gillett",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Order bigger size than you think you need.",
      "text": "Nike must be made small I ordered an 11.5 and was thinking they may be to big, boy was I wrong they are snug. Not uncomfortably snug but snug. I’m sure they’ll stretch and as far as liking them I love them. And they got here a few hours earlier than expected delivery time.",
      "rating": 4.0,
      "verified": true,
      "author": "BigMan ",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Quality, excellent price!",
      "text": "I bought this sneakers for my picky teen boy and he loves it. He said there comfortable, he has gotten many compliments from his friends at school and he uses the them for running and daily activities! These are the ones you should buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus saves",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Gift",
      "text": "Got these for my boyfriend as a gift. He loves them and says they are comfortable. They are very stylish and dont get dirty as easily. Size is true to fit",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Shoes for feet.",
      "text": "This is my second set of these shoes, and I have to say that I'm very happy with the fitment of the shoes and how light they are. Breathable enough for summer and such. I'm a big dude and don't run much, but I imagine the cushioning is great for said activities. Last set lasted me about 7 months or so, but for the price, they're not bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Shoes are great.",
      "text": "I put these shoes to the test I work at a wearhouse and they go through A LOT. I always expect them to be ruined by the end of the day, but to my surprise they always hold up. They fit perfectly and are very light weight. I have had them for a year and they still look brand new which is very surprising. I am completely satisfied with the comfort and quality of these shoes. I highly recommend to anyone looking for extremely durable light weight shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen H.",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "uncomfortable and slippery when wet",
      "text": "Purchased for my hubby and he hates these shoes. He said the soles in the shoe are uncomfortable and the shoes are extremely slippery when wet.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Vargo",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "They ware down fast! Watch out people who work on your feet and go running or workout in them!",
      "text": "I’ve had these shoes just over 3 months for 3 days a week at work. I’m a nurse so I’m on my feet a good bit those 3 days. But at about the two and a half month mark my shoe on the back started to wear down and the plastic actually has been cutting into my foot. I was able to get away with a thick sock but I can not even do that anymore. I give 2 stars because they do look nice and fit well, but just wore out in such a short time frame and caused blisters.",
      "rating": 2.0,
      "verified": true,
      "author": "Jordano Marozza",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Price is OK. Keep in mind the shoes are a little narrow.",
      "text": "Shoes are A bit narrow but still wearable. She was a bang use for cross training purposes at a gym. They seem to be getting better as they are being broken in, I guess with time.",
      "rating": 4.0,
      "verified": true,
      "author": "Major",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Small fit it will hurt your foot",
      "text": "I took a while before I reviewed these shoes because I really tried to see the good in this shoe. This shoe is uncomfortable and hurts my foot.",
      "rating": 3.0,
      "verified": true,
      "author": "KareemND",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Nice and fairly comfortable shoes after a long day on ...",
      "text": "Nice and fairly comfortable shoes after a long day on my feet (Nurse). I purchased these for the practicality and function of a sneaker, but do enjoy the unusual design.",
      "rating": 4.0,
      "verified": true,
      "author": "A.e scott",
      "helpful_votes": 3,
      "publication_date": 20180115
    },
    {
      "title": "Trendy and great quality.",
      "text": "I bought these sneakers for my nine year old nephew. He absolutely loves them. They fit perfectly well and they are very cool looking.",
      "rating": 5.0,
      "verified": true,
      "author": "jenine l.",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Good shoe just not for people with wode feet.",
      "text": "Great shoe but bad for people that have wide feet. They were too tight even though I ordered a size larger to take into account the sooner fit of the shoe but it was still too tight. I don't have overly wide feet.",
      "rating": 3.0,
      "verified": true,
      "author": "Mars",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Great look, great fit",
      "text": "Interesting looking shoes but I love the look. Nikes fit my foot (size 15) perfectly. I've had them for a few months with no quality issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris G",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Snug fit. Flexible",
      "text": "Fit well. They’re really flexible. Good for moving around on rough terrain or pretty much anything that involves putting a lot of stress on your feet",
      "rating": 5.0,
      "verified": true,
      "author": "BTE",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Great!",
      "text": "It’s hard to find sleek shoes for my husband’s shoe size (15-16), so I was pumped to find these as a gift! He loves them and they look great on!",
      "rating": 5.0,
      "verified": true,
      "author": "OGSoup",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Mastering the lacing system will take time",
      "text": "The lacing on the shoe is different than most shoes, it really helps get a tight fit but can be too tight in some spots. I have had them for a while now and have found my sweet spot but it is difficult to keep the laces there.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Very uncomfortable / painful",
      "text": "These really hurt the top of both of my feet. I gave it 2 weeks to see if wearing them everyday to break them would help. Nope! Must be a poor laces design cause even tied loosely they put extreme pressure on the top of my feet. Never had an issue with Nike in the last 30 years but these are garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "WillyJ",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Runs small",
      "text": "They’re nice looking sneakers, but run WAY too small. It feels almost as if there’s a plastic barrier preventing them from expanding any on the sides.",
      "rating": 3.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Nice wide toes, a bit narrow arch",
      "text": "I need my walking shoes to be loose enough to put on and take off without tying the laces, because my wife is Asian and we never wear shoes inside. I find it is possible to loosen the laces enough to make this possible, while still feeling the fit is sufficiently snug.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry Wechsler",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Great Indoor Workout Shoe",
      "text": "This is a great all around indoor gym shoe. It's comfortable and provides a suitable platform for cardio machines and light to medium weight lifting. The toe box has plenty of room and fits snugly without painful pressure points on the feet. I marked somewhat small because I ordered a half size up in order to get a good fit.",
      "rating": 5.0,
      "verified": true,
      "author": "David B. Barrows",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Perfect",
      "text": "My husband loves them and said they fit perfect and comfortable I have noticed for his size (13M) they look a little bulky but then again he has very large feet so what shoes won’t lol",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Poor Design",
      "text": "When you buy shoes online because they are cool looking and too cheep to believe - don;t be surprised. These shoes gave me blisters on the ankle on one long walk. Tried them at the gym next day and both of feet were numb from all the hot spots. After I go them I also realize they are not so cool looking - a design I am sure Nike regrets.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott L Williford",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Very narrow fit",
      "text": "I’d already returned and exchanged a size 12 for the size 13, so I feel bad about returning these. I REALLY like the look, but they’re too damn narrow.",
      "rating": 2.0,
      "verified": true,
      "author": "David A. Jakes",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Good deal on Nike sneakers",
      "text": "Replaced my 6 yr old, heavily worn day to day Nike's with these, and they feel soooo gooood!! Good arch support, totally comfortable, and I like that they are ALL black. Don't show scuff marks like my old ones. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "PhillyBill",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "DOPE KICKS MAN!!",
      "text": "I love these shoes. I wear these almost everyday and they seem to get MORE comfortable each day. I wish I had more than one pair. These look great in my opinion and I love them",
      "rating": 5.0,
      "verified": true,
      "author": "MB Awesome",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Returned",
      "text": "I love the way these shoes look! That being said I tried them on and didn't make it 5 steps. These are extremely uncomfortable and I returned them immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "I really like the look of these but if you're looking for ...",
      "text": "I really like the look of these but if you're looking for a functional gym shoe I don't know about this one. They made my feet go numb after about 30 mins on the elliptical and I ended up getting Metatarsal Tendinitis.",
      "rating": 2.0,
      "verified": true,
      "author": "Taxman",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Supportive, but loose fitting",
      "text": "Very supportive of my walking pattern. I use odd maneuvers all the time, due to a mixture of stamina and scoliosis. A little wider than I realized. I usually buy the 'normal' width, but for these, I should have gotten a narrower pair.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan P.",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Very Uncomfortable",
      "text": "None of this is the sellers fault, but these shoes are not that comfortable. I had the version that had the actual visible air pockets on the side and thought these would be as comfortable as those, however they were not even close to that comfort level. They almost felt like a fake version until I saw the exact same shoes in a Nike outlet store and tried them on. Those were just as uncomfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen McCown",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Shoe already broke",
      "text": "I have had these shoes not even two months and they broke! The window has closed for returning them, I’m done with Nike!",
      "rating": 1.0,
      "verified": true,
      "author": "Garcia ",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Good for the price",
      "text": "These shoes are nice I use them for the gym they are very comfortable and don’t look to bad great shoe for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Jace",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Poor Quality Not for daily wear",
      "text": "Purchased Sep 19, 2019 poor quality. Do not buy if you plan to wear them daily. Picture taken November 7 2019. I am not the only dissatisfied customer.",
      "rating": 2.0,
      "verified": true,
      "author": "nate abbott",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "It is comfortable",
      "text": "I used it for work and for exercise. I stand for longer time in my work and walk a lot. It helped me to reduce the strain on my lower feet. I love it and it is like standing on a foam.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Heavy duty sole but a good fit",
      "text": "It’s a snug fit - but what I wanted for training. Sole is definitely heavier duty than I had expected but again I think I’ll give these a go. Like the design. Comfy. May be too narrow for some.",
      "rating": 5.0,
      "verified": true,
      "author": "DTee",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "My boyfriends favorite",
      "text": "These are my boyfriends favorite shoes. He says they are extremely comfortable! Glad I could surprise him and make him happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Madelyn Brite",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Pretty good",
      "text": "Cool looking shoes. Not my man's favorite sneakers, but they're not bad looking and feel good too.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "nice product",
      "text": "good product, would buy again. i had to return bc slightly too small but decent quality",
      "rating": 4.0,
      "verified": true,
      "author": "theavidlongboarder7",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Great for the price",
      "text": "Arrived in a damaged box so I had to repackage them for gifting but otherwise a great product. We've purchased these shoes in store for $30 more than this listings price.",
      "rating": 5.0,
      "verified": true,
      "author": "kailyn",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Its ok",
      "text": "Runs smaller than expected but great quality perfect design looks like in picture",
      "rating": 5.0,
      "verified": true,
      "author": "Hernan Parra",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "So Comfortable!",
      "text": "I love these shoes. I bought these based on my last pair of Nike's and they are the most comfortable shoes I've had. They are very lightweight and great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce Olson",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "But good",
      "text": "Loved the style but my bf wore them once and they began to Tear so I had to sew it back up",
      "rating": 3.0,
      "verified": true,
      "author": "Samantha davila",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Nice shoes. Not really for wide feet.",
      "text": "Hubs has wide feet and these were a bit snug but we kinda expected this could be a problem from the sizing chart. Not uncomfortable enough to return. They're nice shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Norell Brown",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Hate Nike PC marketing",
      "text": "This will be my last pair of anike... But these fit great, are light and cushion well.",
      "rating": 5.0,
      "verified": true,
      "author": "Provo6",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Great product great seller",
      "text": "The product was perfect it arrived just as promised I am very happy thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "great sneakers for the gym",
      "text": "great sneakers for the gym. At first it was a little too tight but they expand to your exact foot size as soon as your break them in. Great price also as I always wanted a pair of these when they first came out.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel J. Lopez",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "I stand on a concrete floor all day and these are great at keeping my feet and my back feeling good",
      "text": "I got these to wear at work. I stand on a concrete floor all day and these are great at keeping my feet and my back feeling good.",
      "rating": 5.0,
      "verified": true,
      "author": "K.M",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Makes My Feet look Super Wide",
      "text": "I have over 50 pairs of Nikes. These make my feet look so wide from the front. Thy are comfy though.",
      "rating": 3.0,
      "verified": true,
      "author": "Laura F Lebowitz",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Read on..",
      "text": "Since my other shoes S.T.B. on me at Work, I needed a new set of sneaks... Comfortable, very comfortable. Nuf Sed.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul C. Beck",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Instep trap",
      "text": "The woven material across the instep is overpowering. Perhaps they'll get more comfortable as they age.",
      "rating": 2.0,
      "verified": true,
      "author": "Brent D. Nolan",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Great Shoe!",
      "text": "I normally don’t buy shoes online because I like to know how they feel on my feet, but these shoe fit perfectly and are good looking. I’m happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Bearden",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Nike are too narrow",
      "text": "The length is correct but the shoe is too narrow. I don't have wide feet. I am going to keep them but I cant wear them longer than a few hours. Good for a workout not for running or an everyday casual shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "DAVID RICARD",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "New favorite shoe!",
      "text": "I have wanted these for so long..... kinda mad i didn't get them sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "tanner",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Quality Sneakers, great price",
      "text": "Sneakers came quicker than expected. There were no blemishes/imperfections on the shoe. Absolutely would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikosdad",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great looking comfy shoes.",
      "text": "Comfortable, solid looking shoes. I really like then and they go with everything in this color. I have wider feet and my pink felt like they rubbed a little intially but now that they have broken in a bit I no longer get that feeling. Great shoe for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Huston",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Great shoe",
      "text": "Shoe is comphy and fit as expected. Would recommend the shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "T DeL",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Comfortable shoe",
      "text": "I’m on my feet a lot where I work and need a good comfortable shoe and these have been great!",
      "rating": 5.0,
      "verified": true,
      "author": "Brett West",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Nice shoes",
      "text": "I really like these shoes, Theyre light weight and very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "SILVIA",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great for working out",
      "text": "Like this shoe. The structure gives good support in the center of your foot. The way the fabric is woven gives it a cool gladiator kind of look.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi and Jay",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Shoe make to havin the walk exkra goodz",
      "text": "Main.... Dis hear be. Like. Bruh Nah... FR FR them sizzles is fire!",
      "rating": 5.0,
      "verified": true,
      "author": "threewheela",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Great fit & great look",
      "text": "This is my son’s favorite shoe. Fits great & is true to size. Will gladly purchase this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200705
    }
  ],
  "product_meta": {
    "title": "Nike Men's Lunar Fingertrap Tr Fitness Shoes",
    "description": "Running Shoes Man Nike NIKE LUNAR FINGERTRAP TR 898066-406",
    "rating": 4.4,
    "feature_bullets": [
      "Outer Material: Synthetic",
      "Inner Material: Manmade",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Shoe Width: Medium mens_us"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "12.7 x 12.7 x 1.78 cm",
      "Date First Available": "8 Dec. 2006",
      "Manufacturer": "Nike",
      "ASIN": "B07RSSH4B7",
      "Item model number": "898066",
      "Department": "Men's"
    },
    "categories": [
      "Indoor Court Shoes",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}