{
  "website_summaries": [
    {
      "verdict": "It doesn’t fold as small as comparable bassinets, but if you’re looking for a portable bassinet with a flat mattress, this is a great option.",
      "pros": [
        "Flat, non-folding surface eliminates any bumps and creases that could make fussy babies uncomfortable",
        "Lightweight and easy to move",
        "Vibrate feature is a nice touch",
        "Comes with convenient carrying bag",
        "All-round mesh sides allow for improved breathability and visibility"
      ],
      "cons": [
        "Folded dimensions are a little larger than some"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Extremely disappointed with this crib",
      "text": "Extremely disappointed with this crib. My 1 month old's toe skin came off when she rubbed her leg against the mesh sides. The mesh fabric seems to be rough. Didn't expect this from fisher price products.",
      "rating": 2.0,
      "verified": true,
      "author": "Mathew",
      "helpful_votes": 161,
      "publication_date": 20180612
    },
    {
      "title": "Great Bassinet!",
      "text": "We LOVE our Stow 'n Go Bassinet! It's flat along the bottom, so there is no awkward fold for baby. The vibration has been amazing for keeping our two-week old calm. There is mesh on more than 75% of the sides, so we're not worried about her rolling her face over to the side and it's easy to see her without having to get up and hover over her. The baby has slept in it since coming home and we've had no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Acbjrb",
      "helpful_votes": 16,
      "publication_date": 20180601
    },
    {
      "title": "Sturdy",
      "text": "Well put together and an easy set up. Never had any problems with any of it. We had a bassinet before and it just felt cheap, this doesn’t give off that vibe at all which is good when you have to consider your own mental well-being either winding down from work or taking care of your kids all day you can count on this one to hold together and keep your kids safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Debaser",
      "helpful_votes": 17,
      "publication_date": 20171109
    },
    {
      "title": "Perfect size. Holds up to 20lbs and most babies ...",
      "text": "Perfect size. Holds up to 20lbs and most babies will be out of a bassinet by that weight because they can pull themselves up by then. Mattress is better than pack n play mattress which my first born refused to sleep in. I just wish you could buy additional sheets because it only comes with one. Set up and take down is quick and will be great for travel.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristyn831",
      "helpful_votes": 10,
      "publication_date": 20180406
    },
    {
      "title": "Dangerous for little ones toes - she doesn't like the movement of it anyway",
      "text": "My baby did not like sleeping in this. We think the movement of the bassinet when she would move slightly in her sleep upset her. Please be careful with this product. Our 3 month old likes kicking and ended up kicking her foot against the mesh to the point where she bled all over. I liked the mesh because I could see her, but now after 3 months we are realizing between her not sleeping for longer than a half hour in it and the blood on it, this product was a waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "thirty something in Grand Island",
      "helpful_votes": 3,
      "publication_date": 20191224
    },
    {
      "title": "Don’t buy unless you want to wake your baby",
      "text": "I chose this bassinet after reading all of the positive reviews and I liked that it was simple and safe. However, the way it is constructed means the bassinet hangs from the top and is not sturdy like a pack and play (for example). It moves when you put the baby in, triggering the startle response and waking him up. If you do manage to place the baby in it without waking him, the slightest movement will shake the whole thing and wake him anyways. Also, it is so low to the ground that I imagine my back would be killing me if I had actually used this for any length of time. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Brittni Kayne",
      "helpful_votes": 3,
      "publication_date": 20190705
    },
    {
      "title": "Five Stars",
      "text": "I was looking for something portable, that my newborn could practice safe sleep in. This is a winner!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Joyce",
      "helpful_votes": 8,
      "publication_date": 20180415
    },
    {
      "title": "... mouth against the edges of the beassinet and I love that it is mesh and not cloth",
      "text": "We went with this bassinet bc my baby likes to keep her mouth against the edges of the beassinet and I love that it is mesh and not cloth. It’s good quality and has held up great. Not easy to take down when traveling, but we just bought a Seperate travel bassinet for that. I would buy this bassinet 10 times over If I had to!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 5,
      "publication_date": 20180721
    },
    {
      "title": "Great buy!",
      "text": "Vibration is soft and gentle which is good. Some vibrating bassinets and swings can be too strong. Understandably, padding on the bottom is very thin so I folded a hospital blanket to give it a tiny bit more cushion and that works for my infant. I also like the mesh sides so I can easily see in when laying on my side facing him rather than having to lift my head and peek over the top for every sound he makes. Lightweight and easy to move from room to room. Put together within 10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly M.",
      "helpful_votes": 2,
      "publication_date": 20200726
    },
    {
      "title": "Great for a mobile bassinet.",
      "text": "Great bassinet were already have a standard fisher price bassinet from the first born and wanted another since we are in a 2 story home now and for travel definitely compact and easy to stow n go as they call it. I wish that it was easier to find bassinet sheets for the fisher price models if anyone knows of something I’m missing please let me know. I also wish the vibrations were a little bit stronger. The other one we have is much stronger and you can tell the little one likes it. This one seems more of an irritant to him. I’d assume it has to do with the size.",
      "rating": 4.0,
      "verified": true,
      "author": "Terrell Myers",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Works really well!",
      "text": "We love this bassinet for our newborn. The breathable sides were a major selling point for us as a safety feature. I love that the matress & support are each a single piece so there aren't any creades- it is truely a flat surface for baby to sleep on. This is both lightweight and durable. I haven't travelled with this yet but it is easy to take apart and put back together. The carrying case won't work well for air travel, though. I like this much better for an infant than the pack n play that we had borrowed previously.",
      "rating": 5.0,
      "verified": true,
      "author": "Emilie Rabbitt",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Great product",
      "text": "It’s a larger sleeping space than a typical bassinet. Our smallish 7 month old had plenty of room. Compared to a pack and play, it’s much lighter, less bulky, and easier to transport, has a smaller footprint, and allows you to access the baby without throwing out your back reaching down so low. Very sturdy, and we were able to easily fit a wedge under the mattress to help with her acid reflux. We didn’t use the vibration feature. Set up and take down were super quick and easy.",
      "rating": 5.0,
      "verified": true,
      "author": "lynguini",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Modern and Functional",
      "text": "This bassinet is beautiful. The mesh and fabric are good quality. The mattress pad cover washes well. The mattress pad is an odd size so you can't buy an extra, by the one included dries fast (I air dry it). The bassinet assembles and disassembles easily and is good for travel (car travel, not airline travel). The vibrating feature is quiet and nice to have though we don't really use it. The only thing I would wish is to gave adjustable height legs and collapsible sides, but then that would be the Halo at a much higher price point. For the price, this gets 5 stars from me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Turner",
      "helpful_votes": 2,
      "publication_date": 20171214
    },
    {
      "title": "Great Bassinet!",
      "text": "We got this so our newborn daughter has somewhere else to nap besides her crib. She prefers it and is her primary spot for the night which is great as room sharing with her sister hasn't been working our so far. This way we can use the bassinet in our room or place it in the living room. While not very mobile, I found it okay to move even 5 days postpartum with the baby in it by slowly sliding it. It was much sturdier than expected and gives me a sense of safety because of all the mesh! It is certainly a good investment for the first few months and a great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "Silviya  Angelova",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great for travel",
      "text": "I bought this for my new born when I found out the Rock n Play was recalled. I wanted something portable that I could move around the house to different rooms but would be safe for my baby. I also didn’t want to spend a fortune. After seeing how easy this was to assemble, we bought 2 more for the grandparents to keep at their house. We have several trips planned this summer and this will be perfect for taking with us. Everything folds up neatly into one little bag! I also love the mesh sides so I can see baby through the bassinet and feel comfortable knowing that he can breathe.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashleythecustomer",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Loved it more than our Halo",
      "text": "I bought this on a whim for a vacation with our little one and I ended up loving it more than our Halo. First, it's easy to put together and light enough to move around easily. Our little one slept perfectly in it (I think she really enjoyed the vibration, even though it wasn't very strong.) It was also easy to scoop her out of at night by our bed. Plus, it packs up so nice and neat! I think, moving forward if we have more children we're going to keep this and sell the Halo.",
      "rating": 5.0,
      "verified": true,
      "author": "Madison E Russ",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Turns out you do need a bassinet, this is a great option for the price.",
      "text": "I wish we had this before the baby arrived, didn't know we were going to need a bassinet. By the time my average size boy was 4 months old he was really to big to be comfortable in there though. We took it on a road trip and appreciated the portability. It's also pretty low, but seems that's just baby life, get used to it mom and dad!",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "Highly recommend",
      "text": "This bassinet was a life saver. The first bassinet we had folded in the middle and had lots of room to move around. My son was rotating 90 degrees and moving to the middle of the bassinet where there is a crease. After awhile he became too long to rotate and would wake up crying. This bassinet is perfect because it is much smaller and does not allow room to rotate. Sometimes my son would push up and get his face against the mesh but it never left a rash or mark. The vibration is a nice feature and effective when we used it. It is easy to put together and take apart for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "... a little lower to the ground then I would've liked - it would be really cool if the legs ...",
      "text": "This bassinet is a little lower to the ground then I would've liked - it would be really cool if the legs were adjustable. But for the price, this is a great, simple bassinet.",
      "rating": 5.0,
      "verified": true,
      "author": "Biff",
      "helpful_votes": 5,
      "publication_date": 20170719
    },
    {
      "title": "Good bassinet",
      "text": "Good-sized bassinet, I've been using this so far for our newborn for our bedroom before she goes to the nursery. She sleeps fine in it. And the vibration feature is subtle but definitely does help a lot of times to calm her. It's not too loud and we'll leave it on for extended periods and I barely notice. I think a couple other reviews said that the bassinet is low, which it is, but it doesn't bother me too much. The bottom of the bassinet is 1 ft above the ground. The legs come off very easily and the portable option is nice if we ever need it. The mesh is also nice to see her from the side.",
      "rating": 5.0,
      "verified": true,
      "author": "Mon",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Holes in box and musty smell",
      "text": "I believe this bassinet is a great product but when it was delivered the box was torn up and basically falling apart. The whole entire bassinet and box smell musty like it has been sitting in a wet basement. I'm really disappointed as this is something I'm using for my baby. I dont think it is possible to pull it all apart to wash.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie Dietrich",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "Just ok - legs are a trip hazard",
      "text": "We bought this bassinet after lots of research. While we like the mesh sides and they give us a piece of mind, other things are not so good. The legs are really annoying and a big trip hazard. They come out more than you'd expect. Also it's pretty low and my wife who had c section cannot pick our little one. I probably wouldn't buy it again especially at $75 price point, but we'll keep it for the time being.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Pretty nice.",
      "text": "Quick and easy to assemble. We bought this so the baby can sleep in our room in the beginning. It's way lower than I originally thought which is a bummer. But, I really like the fact that there's a mesh border, makes me feel better so I know there's ventilation and I can see her while she's sleeping. It comes with a carrying bag for easy travel.",
      "rating": 4.0,
      "verified": true,
      "author": "Richelle",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "great for preemie",
      "text": "We got this last minute and it has been AMAZING. It was VERY easy to put together and i love it was easy to move around if we needed too. The vibration actually we can feel in our king size bed too, and the batteries actually last longer than i thought they would. The mesh on the side is great too for peeking in on him He is not almost 5 months (on the 9th) and still sleeps through the night in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Mills",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Product is strong and sturdy but Baby doesn't like to sleep in it.",
      "text": "When I got the product I was quite impressed. However, when we started to use it we noticed that our child doesn't like to sleep in it. After laying him down, he wakes after about 5 minutes and needs to be held again. I'm comparing this to our pack and play with sleeper and our crib. In both of those when we lay him down he stays asleep for 3-4 hours between feedings.",
      "rating": 3.0,
      "verified": true,
      "author": "Unholyhero",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "This was a great buy! Our 3 month old is still sleeping ...",
      "text": "This was a great buy! Our 3 month old is still sleeping in our room and this is what shes in at night. It is extremely convenient to pack up and take with us when traveling out of town to visit family. As other reviewers mentioned, it is a little low to the ground, however if the legs were taller, I don't believe it would be as sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Katelin",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Perfect bassinet for Babies that love movement, until it stops working",
      "text": "We bought this bassinet for our son since he loves to be moving, and it helps keep him asleep wit the vibrations. Unfortunately, the vibration feature only worked for the first 3 months. We changed the batteries multiple times to make sure it wasn't a faulty battery, but it still didn't work. If it wasn't for this, I would have given this product 15 stars as it worked well when it did.",
      "rating": 3.0,
      "verified": true,
      "author": "yareiry alba",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Perfect bassinet!",
      "text": "Bought this to use in a small apartment before we could open out a crib ! Baby loves it and used it for close to 8 months till she outgrew it. It’s very convenient to use as it’s light and can be easily carried from room to room. Just be careful with the legs because they stick out a bit. All in all a great product for a newborn-infant stage",
      "rating": 5.0,
      "verified": true,
      "author": "Kirthana Michael",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Great for Sitters",
      "text": "This item is great for traveling and especially great to take to the home of the person watching baby. It has a nice mattress, mesh siding (breathable), and the vibrations assist in soothing the baby. It is easy to assemble and is sturdy. It can even be used as a full-time bassinet.",
      "rating": 5.0,
      "verified": true,
      "author": "Nimrah",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Moldy",
      "text": "I'm due to have my baby in less than a week and just opened the box. The bassinet is full of mold. Disgusting! The box itself is fine, not damaged, wet or moldy. I have requested a refund. So disappointing. I bought this when there was a great deal going for it.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather Wedde",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Great value and full nights sleep when used with the my snuggly insert",
      "text": "This bassinet is a great value. We bought a my snuggly to go inside of it and use love to dream swaddle up swaddles, as well as a baby shusher for noise. All of this combined has given us the peaceful rest we need. The baby is only 2 months old and will usually sleep from 10pm to 5 am no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Etan Wishnevski",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Stow N Go, Great Bassinet",
      "text": "It's a great bassinet, you only need to put the legs on to assemble it. I gave it 3 stars because the vibration is very weak, might as well not use it. If you plan to it needs 1 D Battery that's not included.",
      "rating": 3.0,
      "verified": true,
      "author": "Eddie",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Safe, affordable, comfortable! Totally worth it.",
      "text": "Love this. I was looking for a safe, flat, breathable bassinet for my newborn and this hit every mark. I think it’s a great height, and size. He sleeps awesome in it and it’s nice to have the vibration if I need him to relax a few more minutes to finish something. The cover slides right off for washing. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "brendon",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Too low to use next to bed but good for travel",
      "text": "This was easy to set up, sturdy and well made. Unfortunately it was way too low to use as a bedside bassinet so we returned it. It would be a great option to travel with because it easily folds and is very light.",
      "rating": 3.0,
      "verified": true,
      "author": "BandC928",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Love it!",
      "text": "Super easy to assemble. Came within 2 days. Everything is in great condition. I love it. It's simple and sturdy. Light enough that I can move by myself around the house if I want to.",
      "rating": 5.0,
      "verified": true,
      "author": "Glamarys",
      "helpful_votes": 3,
      "publication_date": 20170821
    },
    {
      "title": "Mesh sides make it breathable for squirmy baby",
      "text": "So happy to finally have a bassinet with all mesh sides. My LO likes to shove his face into the sides and it makes me feel better knowing he will still be able to breathe!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Greenlee",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "LOVE!",
      "text": "Love this bassinet! So simple and easy to travel with or just to use at home. This has went to the grandparents house when the baby stays there. It also has went on vacation with us. We use this daily and it's by far one of my favorite purchases I've made.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Buchanan",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Affordable Bassinet",
      "text": "This thing is easy to assemble and super affordable. The vibration is lacking but we didn't purchase for that. This is one of the only bassinets on the market with mesh around more than 75% of the sides and I honestly don't know why more don't do that. Our baby managed to mash her face into the side during several naps and I'm thankful I didn't get a bassinet with more solid sides.",
      "rating": 5.0,
      "verified": true,
      "author": "Cory",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Love this little bassinet",
      "text": "My baby seems to enjoy the vibration, it’s small and light and that’s what I love",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 2,
      "publication_date": 20190311
    },
    {
      "title": "Wonderful",
      "text": "Batteries run down fast and the vibration is only strong for a short amount of time once you replace them but overall it’s a wonderful bassinet. Our little loves it and sleeps 2-5hrs at a time in it. I chose this one so we can break it down and take it on several trips we have planned.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Wingate",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Great bassinet if you don't need the vibration feature",
      "text": "Wish I could give this 5 stars. I love everything about it, but the battery power to vibrate the bassinet lasts all of a few hours then it's as good as dead. Too bad. I love the portable feature and mesh!",
      "rating": 4.0,
      "verified": true,
      "author": "MichelleJ",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "This has been a lifesaver for frequent trips! Sets ...",
      "text": "This has been a lifesaver for frequent trips! Sets up and tests down in seconds. The travel bag is very convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "megan bosko",
      "helpful_votes": 3,
      "publication_date": 20170817
    },
    {
      "title": "Wish I could give it 6 stars",
      "text": "Very very easy to put together and take apart. The carrying bag is nice. Perfect hieght for a bed. I am very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Herron",
      "helpful_votes": 2,
      "publication_date": 20180414
    },
    {
      "title": "Exactly what I wanted",
      "text": "Super easy to assemble, quick and light enough to move around the house if needed. Doesn’t take up too much space and provides a safe place for baby to sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "MariaG",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Convenient, easily stored, attractive but thin mattress",
      "text": "Attractive with clean lines and very easy to put together, however my baby didn't like it so I returned it. My baby needed a thicker mattress but if your baby is okay with a thinner mattress (about one inch) than this is a convenient, easily storable and aesthetically pleasing option.",
      "rating": 3.0,
      "verified": true,
      "author": "Practical Parent",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Not comfortable",
      "text": "My baby did not sleep well in this at all ever, I don’t think it was comfortable me for her...",
      "rating": 1.0,
      "verified": true,
      "author": "Student 91",
      "helpful_votes": 4,
      "publication_date": 20180923
    },
    {
      "title": "Vibration doesn’t work at all",
      "text": "The vibration is terrible, it barely works and it only vibrates the sides, not the bottom where baby lays. For the price, not worth it. Also went through several types of batteries and it ate through them like crazy, doesn’t even last a full two-three hours.",
      "rating": 1.0,
      "verified": true,
      "author": "Marissa Addison",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Simple and compact",
      "text": "Baby isn't here yet so I can only rate assembly and size. It was very easy to assemble and would be just as easy to take apart. It comes with a bag for storage and transportation. I expect it will be easy to move around the house if we need to. It seems like it will meet our needs without taking much space.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great for small places",
      "text": "I ordered this because I needed something that was easy to move from room to room and easy to store away since I don’t have a lot of room in my apartment. It was super easy to assemble and comes with a bag to store it away when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "denedra",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Excellent quality and great price",
      "text": "Excellent bassinet for those on the go. The vibration is a bit strong with new batteries. I don’t often use that function though. Easy to put up and take down quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Great product!",
      "text": "This bassinet is a lifesaver! It travels well, it's easy to set up and take down, and it's a safe space for my little one to sleep on the go. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "bethelizabeth",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Very nice bassinet",
      "text": "It’s perfect for traveling when there is not enough space in the room and your bed is too small for baby to sleep in a sleeper. Otherwise I would use the Dock-A-Tot sleeper. Not too light to carry everywhere you go , but fits in the car. Very easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Not great for travel but excellent stationary bassinet",
      "text": "This is a pretty big bassinet for a traveling. We don’t use it for travel and it works great. Very sturdy and safe sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Safe sleep space",
      "text": "This has been an excellent safe sleep space for our baby. The bed is suspended, which allows for hand rocking. Our daughter just graduated to her crib two nights ago and I already miss the convenience of this.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "A little bulky",
      "text": "Bought this as a replacement for the Rock N Play. Not as portable but still great bedside. Vibration is on or off, there is no timer. We've had it a couple of weeks now and are satisfied with it.",
      "rating": 4.0,
      "verified": true,
      "author": "James S.",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Must have for newborns",
      "text": "Easy to assemble. Good quality for the price. Light weight. Nice features. Good item for keeping baby by the bed at night.",
      "rating": 5.0,
      "verified": true,
      "author": "LeahO10",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Mesh all around and can sway baby",
      "text": "Love this. It’s very deep and long for a travel bassinet and the mesh siding lets me see my baby from bed when lying down (see picture) and gives me peace of mind re SIDS risks. Also, the design permits you to lightly sway or jiggle the part where the baby lays to soothe him! I don’t think this was intentional but it’s awesome and for the price can’t be beat. Another picture shows me swaying with my hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison F.",
      "helpful_votes": 6,
      "publication_date": 20180517
    },
    {
      "title": "Nice size and the netting helps baby to see out ...",
      "text": "Nice size and the netting helps baby to see out and easier for you to see in. Granddaughter was 11 pounds and can had room to grow yet. Very easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Ceil",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Baby wouldn’t sleep in it",
      "text": "I liked this bassinet because it’s a safe sleeping option. Those trendy nests and dock a tots seem dangerous to me. This has mesh sides and a flat mattress. However, my little guy would not sleep in it. I tried various swaddles etc and he still didn’t like it. He sleeps better in the pack n play. I wish it would have worked better for us.",
      "rating": 3.0,
      "verified": true,
      "author": "Kylie",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Works great",
      "text": "We bought this so we could have a bassinet in the living room too. Worked great viewing angles are amazing with the mesh too.",
      "rating": 5.0,
      "verified": true,
      "author": "Norman",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Simple design",
      "text": "I read a lot of reviews on bassinets before i finally settled in this one. I chose it because it is simple, safe and would not break the bank. I like that it's mostly mesh which allows for good air flow and it has a sturdy and firm mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Mitchell",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Four Stars",
      "text": "It is pretty wide due to the legs and larger than expected but very sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "Lilwhodas",
      "helpful_votes": 2,
      "publication_date": 20171119
    },
    {
      "title": "Great bedside bassinet",
      "text": "We've used this for 5 months with our daughter and it's great. Perfect for bedside and travels well.",
      "rating": 5.0,
      "verified": true,
      "author": "Britums",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Wonderful bassinet!",
      "text": "My baby loves this bassinet, there is plenty of room for baby and does not take up alot of space. I highly recommend this bassinet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina Clermont",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Worth it !",
      "text": "Vibration not as strong as I would like but still does the job. Easy to assemble. Legs are angled out so hard to fit through door when assembled but still possible.",
      "rating": 5.0,
      "verified": true,
      "author": "Briana",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "It has a soothing vibration",
      "text": "This is great, it has a nice vibration that other bassinets don't have - just wish it cycled off after 30 minutes or so. the portability is amazing, pop off the legs, in bag and your on your way. Great purchase for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Sturdy",
      "text": "Great very sturdy, I have a toddler and don’t think he can knock it over",
      "rating": 5.0,
      "verified": true,
      "author": "PowerSeller999",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Smart buy",
      "text": "This is a smart buy. My son is 3 months old and still fits. He weighs 15 pounds and is 25 in length. He sleeps well in the bassinet. As well sturdy and not a flimsy product.",
      "rating": 5.0,
      "verified": true,
      "author": "KAS90",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Rubbed my babys toes raw till they bled",
      "text": "Woke up to my newborn screaming, the netting on the side of the bassinet rubbed her toes raw and they were bleeding. Don’t buy this for you baby!!!",
      "rating": 1.0,
      "verified": true,
      "author": "-kas-",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Cute but too low",
      "text": "My biggest issue with this bassinet was it was extremely low...my 2 and 4 yr old attempted/went into it many times once set up as a game--that was without anything around it just climbing. I could not see this being safe for baby once he came. I am only 5'2 as well and it would strain my back putting baby in and out.",
      "rating": 2.0,
      "verified": true,
      "author": "Katherine S",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Recommend",
      "text": "Great affordable bassinet. Works perfectly. Vibration is soft but thats ok.",
      "rating": 5.0,
      "verified": true,
      "author": "amy boatwright",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Overall not bad",
      "text": "It is slightly slanted so when my baby wakes up and starts to fuss he wiggles right down to the bottom. The vibrate is strong at first and fades quickly. But it serves the purpose for what we needed. I wish it was a little taller, my bed is normal level.",
      "rating": 3.0,
      "verified": true,
      "author": "Rzbud",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Ok bassinet",
      "text": "This is an ok bassinet but is low compared to a bed. If the bassinet height could be adjusted it would be better. It is very portable and super easy to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "For the price its a good bassinet, the vibration isn't as good as I ...",
      "text": "For the price its a good bassinet, the vibration isn't as good as I would like but again for the price its worth it. Also, its not as light as I thought it would be.",
      "rating": 4.0,
      "verified": true,
      "author": "sumaya",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Cost effective",
      "text": "This bed was great for the price my 3 week old will not sleep in it unfortunately. It's worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Deedee 09",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Rocknplay replacement",
      "text": "We got this to replace the rocknplay and I was nervous about the transition but my baby loves it and I love the mesh almost all the way around so I can see her and not worry about her breathing against a wall",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Great purchase",
      "text": "We use this on the main floor of the house and it’s perfect. It’s sturdy. The mesh is great and offers good circulation.",
      "rating": 5.0,
      "verified": true,
      "author": "CTYearOne",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Easy to travel with",
      "text": "We bought this to travel with. Very compact and sturdy. My son loves the vibration on this to help him fall asleep. Mesh sides are great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan ",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Perfect for on the go napping",
      "text": "Easy to put together and dismantle, doesn’t take up much room. Never put batteries in it, so I have no idea about the vibration.",
      "rating": 5.0,
      "verified": true,
      "author": "Meagan Sweeney",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "It's fine, but the vibrate motor doesnt last",
      "text": "Works fine for what it is, we still use it. But the motor for the vibrating portion burned out after like 2 weeks. And we were not overusing it, we just used it as a last resort if the baby wouldnt settle.",
      "rating": 3.0,
      "verified": true,
      "author": "Texas0529",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Great Quality and takes up less space when traveling",
      "text": "This is a great bassinet for on the go. We use it when traveling to visit family and hospital stays for our older daughter. Baby boy loves it. Great quality and very easy to put together and take apart. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber ",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Missing parts",
      "text": "Item was received, missing legs, not in plastic and dirty.",
      "rating": 1.0,
      "verified": true,
      "author": "PD",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Pretty Good Buy",
      "text": "Works well, baby likes it... wish mattress was softer / thicker.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess M.",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Amazing, worth every penny.",
      "text": "I travel a lot between states, and this bassinet is the perfect size for any space. It is so easy to assemble and I absolutely love the 360 breathable mesh, I am check on my son without even leaving the bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "The vibration isn't strong at all.",
      "text": "So cute, easy to assemble, and light. The vibration is NOT strong. Can hardly feel it. Over all worth the price and super cute!",
      "rating": 4.0,
      "verified": true,
      "author": "Some wants and stuff",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "good product, odd sheets",
      "text": "Great product, but the sheet it came with was plasticy and weird. we made our own using it as a pattern and are very happy with the bassinet.",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Terrible",
      "text": "had to be defective, tilted the side resulting in my babys head smashed against the mesh. worthless",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Three Stars",
      "text": "Really compact and convenient, but the mattress is way too thin.",
      "rating": 3.0,
      "verified": true,
      "author": "EF",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Great product!",
      "text": "I love this bassinet!! It’s perfect for traveling as well! Super easy to setup/take down. Great product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "H. m.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Three Stars",
      "text": "Great for travel. The vibration was a little intense though our son hated it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Great bassinet",
      "text": "Great size and easy set up. Giving it 4 stars because it’s a little low so sometimes the baby wakes up easily when putting him in and you can’t buy an extra sheet so we end up washing it frequently from spit up",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Easy assembly",
      "text": "Perfect for the living room. Easy set up and portable",
      "rating": 5.0,
      "verified": true,
      "author": "NouLia",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Short, compact, lightweight",
      "text": "Baby isn’t due until April, but so far we really like the easiness and compactness of the bassinet. I didn’t know it had a vibrating feature (my fault) but I’m hoping it comes in handy! It’s a bit shorter than I expected, fine for me as I’m short, but my husband is tall so it’ll be a bit harder to bend down. Again, not a big deal, but don’t be alarmed when you open this to how short it is. Can’t wait to use for baby #2!",
      "rating": 4.0,
      "verified": true,
      "author": "Arin Watt",
      "helpful_votes": 4,
      "publication_date": 20180120
    },
    {
      "title": "So cute",
      "text": "We got this for our newest grandson. It was easy to assemble, really cute and practical. It was shipped early as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Donna C",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Great product for the price",
      "text": "It’s pretty cute - baby hasn’t used it yet, but it seems like exacty what I was looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Morris",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "We love this as a bedside bassinet for our baby",
      "text": "Our baby is 5 months old and has been sleeping wonderfully in this for the last few months. I'll be sad when she's too big for it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Schillinger",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Works wonder",
      "text": "It helped me so much since it is movable and fits perfectly for my newborn.",
      "rating": 5.0,
      "verified": true,
      "author": "monica",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Perfect bassinet!",
      "text": "Easy to assemble. Great quality. Perfect for my newborn with plenty of room to grow. Love that it has a carrying case for travel too.",
      "rating": 5.0,
      "verified": true,
      "author": "Caci Pommerehn",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Very Nice Gift",
      "text": "Was a gift the Mom wanted and she was happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Darla Franklin",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Good buy for the price",
      "text": "Great bassinet. I didn't travel with it but used it as a bassinet in our bedroom. She slept very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny F.",
      "helpful_votes": 0,
      "publication_date": 20191031
    }
  ],
  "product_meta": {
    "title": "Fisher-Price Stow 'n Go Bassinet",
    "description": "Whether you and your little one are at home, visiting the grandparents, or jet-setting to an exciting vacation spot, this portable flat bassinet gives your baby a comfortable spot to soothe and snooze, without taking up a ton of space. It's easy to assemble (and take apart!), has calming vibrations for extra coziness, and everything stores in the easy-carry storage bag!",
    "rating": 4.4,
    "feature_bullets": [
      "Comfy, flat sleeping surface for sweet dreams at home or on the go",
      "Easy to assemble & pack; legs remove for stowing",
      "Age Grade : Use only with child who is unable to push up on hands and knees, pull up or sit unassisted",
      "Calming vibrations help soothe baby",
      "Mesh sides for breathability—makes it easy to see baby, too"
    ],
    "specifications": {
      "Product Dimensions": "33 x 18 x 26.5 inches",
      "Item model number": "FBR72",
      "Batteries": "1 D batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Maximum weight recommendation": "25 Pounds",
      "Material Type": "Polyester",
      "Care instructions": "Machine-washable",
      "Additional product features": "Vibrating, Portable",
      "Number Of Items": "1",
      "Style": "Stow 'n Go Bassinet",
      "Best uses": "Baby",
      "Finish": "White",
      "Power Source": "Battery",
      "Batteries required": "Yes",
      "Battery life": "50 Hours",
      "Orientation": "Horizontal",
      "Forward-facing maximum child weight": "25 Pounds",
      "Is portable": "Yes",
      "Item Weight": "11.48 pounds",
      "ASIN": "B01N8TURNC",
      "Customer Reviews": "4.4 out of 5 stars484 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#4,090 in Baby"
    },
    "categories": [
      "Nursery",
      "Furniture",
      "Infant & Toddler Beds",
      "Baby Products",
      "Bassinets",
      "Baby"
    ],
    "price": 67.99
  }
}