{
  "website_summaries": [
    {
      "verdict": "A car seat cushion that’s better suited for those with petite or medium frames. Choose it if you need a firm cushion to provide relief from driving discomfort or if you require a bit of a height boost.",
      "pros": [
        "Wedge shape with coccyx indent helps alleviate back, hip, and tailbone pain when sitting",
        "Made from high density memory foam for firm, form fitting support",
        "3\" height is ideal for shorter drivers",
        "Compact size is suitable for smaller car seats",
        "Textured non-slip base works well to prevent sliding",
        "Cover is removable and washing machine safe"
      ],
      "cons": [
        "Only suitable for people with narrow frames",
        "Some users felt it was too firm"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice for Petites Too!",
      "text": "Gives me the perfect boost in my Honda Odyssey as I am 4'11\". This cushion is incredibly comfortable! It has a memory foam, but it's more firm so you won't just flatten out when you sit on it. It is not like sitting on a pillow, it's much more stable and secure than a pillow. For the most part, the small, rubber textured balls on the fabric, on the bottom, holds it in place nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Kearison",
      "helpful_votes": 61,
      "publication_date": 20180307
    },
    {
      "title": "levels out bucket seats",
      "text": "this is great for leveling out a bucket type seat. the cut out gives relief on the spine. it is firm, but not hard so it keeps you elevated. It really helps to keep my back in a more comfortable position for driving. In really cold weather it is rather hard until your body heat warms it up which only takes a few minutes. I keep it inside if we have extended cold periods. it has a nice case with a handle on it. No handle on the cushion itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou Smith",
      "helpful_votes": 30,
      "publication_date": 20171223
    },
    {
      "title": "This has proven to be just perfect for me",
      "text": "Since I'm not as tall as I use to be (which was under 5' anyway), I needed a booster in the car to see over the steering wheel and down the hood. I was afraid that whatever I bought would move around and fall out of the car with me when I got out. This has proven to be just perfect for me. It sits in the bucket seat just right, stays put and gives me the support and the visibility I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 20,
      "publication_date": 20180805
    },
    {
      "title": "Might be good for those who need less support",
      "text": "This wedge does not provide the firm support I had hoped for. The reviews were much better than I think this product warrants. It looks nice and has a soft cover, but its support is more of a medium to medium-soft. I have long dealt with lumbar pain and have used seat cushions for years along with tilting chair seats. This cushion is not helpful for my needs. I suppose if you are not experiencing chronic lumbar pain issues, this cushion may serve as a soft seat for a hard surface.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucy Jerome",
      "helpful_votes": 9,
      "publication_date": 20190710
    },
    {
      "title": "If you are an ascetic, sit on this rock.",
      "text": "If you are buying the wedge for increasing your height, you will be pleased. If you like the comfort of sitting on a block of wood, you will be pleased. Otherwise, it is extremely uncomfortable. With memory foam, the claim is that it reacts to body heat and it may take a couple of minutes to soften and conform to the person's weight. Well, this rock hard block of foam never responded to sitting on it. It remained hard.",
      "rating": 2.0,
      "verified": true,
      "author": "Mitch",
      "helpful_votes": 14,
      "publication_date": 20170403
    },
    {
      "title": "I love",
      "text": "I am only 4ft 10 this pillow lets me drive my new car without getting peddle work done. i am so excited Thank you thank you thank you for having this. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "S. Jaggers",
      "helpful_votes": 17,
      "publication_date": 20170630
    },
    {
      "title": "Made my back pain intolerable.",
      "text": "The depth of this thing in the back doesn’t help the back of the car seat much higher at all. I bought it for back pain but before I got out of the driveway, the pain was intolerable. Now I am returning it and even though it says “free returns,” that is not true. They are not returning all of it and Amazon has made it more difficult to get actual real person help and the bot thing doesn’t give you a box to chat when using a phone. They are keeping about 20% what I paid for it!",
      "rating": 1.0,
      "verified": true,
      "author": "Thistle",
      "helpful_votes": 3,
      "publication_date": 20200606
    },
    {
      "title": "A waste of my hard earned money!!",
      "text": "Cushion is thin, cheap made cover, slips around while driving, won't stay in place..is so small..backside is hanging over on each side! Little suction things don't do anything! The cushion is too narrow!! Too short, front to back! My seats are small..doesn't begin to cover the seat area! The only thing I like about it is the color! The fabric wrinkles and is cheap made/ fabric! I would like a refund..a waste of my money and time..actually makes my back hurt worse while driving as it slides and won't stay centered! Is so thin it is pathetic!! Will Never buy again!! Needs to be replaced with something of better quality! Or my money reimbursed!! Sincerely!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemary Shelton",
      "helpful_votes": 2,
      "publication_date": 20180829
    },
    {
      "title": "Almost perfect",
      "text": "This cushion levels out the bucket seat of my car. I have a bad hip, and that's just what I needed to be comfortable. It does slide around a bit just when getting in and out of the car, but that really isn't a big problem. It does not move once I am seated. It suits my needs, and I'm happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "hstew art",
      "helpful_votes": 5,
      "publication_date": 20171204
    },
    {
      "title": "Great, But Beware If You Live Where Cold Weather Exists",
      "text": "My car's seats are at a weird angle to where my hamstrings would get tight really easily. This product has helped a lot; it's very comfortable and it doesn't move (much). That said, I live in Colorado, and when it's cold, the cushion becomes rock solid. It doesn't warm up very quickly with body heat either and I don't have heated seats. It's otherwise great and has been super helpful with my chronic pain but will have to find an alternative solution for when it's cold out.",
      "rating": 4.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 2,
      "publication_date": 20191011
    },
    {
      "title": "Too small in width, did not help much in sciatica(may be a little), alleviates lower back pain",
      "text": "Find it small in width. So my hips are out of the pillow if not sitting very cautiously and not moving. That further creates an imbalance and cause more pain/discomfort. Had ordered it for sciatica pain, cant say there is noticeable difference, but tbis wedge has started giving me lower back pain which was not there on regular car seat. While the wedge does alleviates a little, i dont think its enough to help sciatica relief.",
      "rating": 3.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 3,
      "publication_date": 20191222
    },
    {
      "title": "great if you live in a warmer climate - a cold one, not so much.",
      "text": "This cushion would have been perfect for my needs (I want to sit higher in my Honda Fit driver's seat) but in cold outdoor temperatures (-30 to + 30 F) it became very hard and uncomfortable - literally no give at all. I returned it. I would highly recommend this cushion if you are not going to leave it in the car in a cold climate. I am giving it 4 stars because it is a good quality product, just not in cold temperatures.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "Really helps in the car",
      "text": "I'm recovering from a quadratus lumborum strain in my low back, and bad seats can be a problem. I don't need this in every car I get in, but I hauled it across country to help my kid drive home from college, and am happy to say I'm very glad I did. It helped me survive 2100 miles. As for the comments on width, I'm not a wide load (short woman, size 6 pants), but yes, the cushion is pretty narrow. I think the designers made it to fit in the inner \"bucket\" part of bucket car seats, not to fat shame us all.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Firm, good angle for proper postural alignment",
      "text": "Sitting with my spine erect helps keep my back pain at a minimum, and this wedge is perfect. It's so easy to sit upright with it. It is very firm, and the cutout is not deep for the tailbone, so there is light support/pressure there, but it works for me. If you need no pressure in that area, get a different cushion. I've tried it in my car as well as chairs and it works for both. I've done a lot of yoga where proper alignment is emphasized and this wedge is firm, comfortable, and has the correct angle for me (female, 5'8\" 150 lbs).",
      "rating": 5.0,
      "verified": true,
      "author": "CWard",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "works for sciatica",
      "text": "Use it in the car & home works well for sciatica it's has the correct angle to avoid pain. It's a bit firm but needs to be as with other pads you'll just sink in and will not be effective in avoiding the sciatica pain. One tip while using in the car tilt your seat downward if possible while sitting on the pad to help prevent sciatica pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Tutonia",
      "helpful_votes": 2,
      "publication_date": 20190714
    },
    {
      "title": "I find this works better than others in my recliner because it is a ...",
      "text": "I find this works better than others in my recliner because it is a wedge style. Other types may be better if you are using it on an office chair or hard bottomed kitchen or folding type chair. The recliner causes too much pressure under your thighs and hurts after a while with most cushions. The wedge reduces the pressure on your thighs while giving you the needed tailbone relief you need. I can't say which type would work better in a vehicle as I don't use either type that way.",
      "rating": 5.0,
      "verified": true,
      "author": "TT",
      "helpful_votes": 4,
      "publication_date": 20171114
    },
    {
      "title": "works, with a caveat",
      "text": "Used on a long, long car trip. Ended up switching back and forth between this one and another one I had bought previously. Overall this one helped at the end of the day but what I didn't like about it was that it would make me ache during it's use. When I got out of the vehicle in the evening it eased and went away, and the type of pain I had bought it to ease was almost non-existent, so it does help, but. Switching back and forth seemed to be my best option.",
      "rating": 4.0,
      "verified": true,
      "author": "RR3",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "A godsend",
      "text": "I bought this for my husband. He has a history of DVTs and is a mail carrier with many hours a day driving (the worst thing you can do with blood clots). He said this cushion is wonderful. It alleviates pressure behind his knees, makes him sit straight which helps his back and legs, and is comfortable on his backside. He would recommend this cushion to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Tallarico",
      "helpful_votes": 2,
      "publication_date": 20190928
    },
    {
      "title": "The best!",
      "text": "I am really short and my car is big; needed something comfortable to sit higher while driving. Was struggling with different type of \"seats\" for a long time when came across this product on Amazon. Today I was driving using this car seat and all my problems evaporated in a blink of eyes! Wonderful product! Thank you !",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Excellent quality, wedge support",
      "text": "This is very durable and high quality memory foam. It gives me a lift at the rear to make up for slanted seat in my Mazda CX5 for an improved ergonomic leg position and avoid severe bend at my knees. I think it will last a long time. When it's cold outside, it is very hard at first when sitting on it, but it starts to soften after a short while.",
      "rating": 5.0,
      "verified": true,
      "author": "DAN",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Didn't sell this car",
      "text": "I use this cushion in my husband's car with deep bucket seats. Before getting this cushion, I wanted him to sell the car due to the sciatica I experienced after driving it. With this cushion - I'm pain free! I do like to place it bottom up because the little spine depression isn't especially helpful for me. It's cool and comfortable. I really like the height it gives my 5' 1\" body in the car. I would buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "AnninNY",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "It gives good, solid support",
      "text": "Product accurately described. It arrived on time and it works very well. It gives good,solid support, does not slip or side and adds about three inches height to my wife when she is driving making it easier for her to see over the hood. We feel it was a good value for the money ,it does what it said it would and we are quite satisfied with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Traveler",
      "helpful_votes": 2,
      "publication_date": 20180717
    },
    {
      "title": "Great for Short Drivers!",
      "text": "After buying a new car with a bucket seat that isn’t fully adjustable I was having trouble reaching the pedals and having hip pain from the angle of the bucket seat. This cushion helped fill in that terrible bucket seat incline and gave me a level seat. I’ve added a normal pillow behind my back and I’m able to comfortably reach the pedals in my car now! I’ve been using it for two months and haven’t noticed any issues with the shape of the pillow, it squished a little when I sit on it but holds its shape very well. For reference, I’m 4’11” and 107lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "CatTop Contributor: Korean Beauty Products",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Harder than I expected",
      "text": "I ordered this wedge to raise the height of my truck seat and correct the sag at the back of my seat. This it has done. I cannot fault the product because it has done what it was supposed to do but it is still hard on the backside. It was listed as a firm cushion so the advertising was not deceptive I just didn't realize how firm it was going to be, my bad. I wish that it was wider but that was my fault too for not paying closer attention to dimensions.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Musselwhite",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "A+.",
      "text": "This thing is fantastically comfortable and an excellent driving aid for someone who is really, really short and likes to be able to see above the steering wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "Rue",
      "helpful_votes": 6,
      "publication_date": 20170718
    },
    {
      "title": "Great cushion.",
      "text": "This is an update to my previous review. I recently bought another cushion to leave in my car, the first one is being used at home. As a vertically challenged (4 ft. 10 in) person, seeing over the dash, either as a passenger or driving, was difficult. This pillow wedge has been a great help, as I do not have raise the driver's seat, and I can actually see over the dash from either side. It also cushions and relieves back pain, and it is easier to get in and out of the car (2018 Nissan Maxima). Would recommend this cushion to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "I'm so pleased with this fairly firm seat cushion that levels the ...",
      "text": "Piriformis Syndrome from bucket car seat begone! I'm so pleased with this fairly firm seat cushion that levels the bucket seat and makes it possible to drive my \"new\" to me 2015 Civic. If you can identify with this challenge, this is the cushion you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Enteranet",
      "helpful_votes": 3,
      "publication_date": 20171129
    },
    {
      "title": "Perfect Adult Booster",
      "text": "This has been the answer to my visibility woes while driving. I’m a 5’ tall woman who can barely see over most steering wheels. It makes driving safely 200x harder than it needs to be. The wedge rectifies this and makes any seat more comfortable. The cover itself is very soft, but the support is adequately firm. After trying to substitute height with pillows and clothes, I can honestly say this was worth the price and the lack of hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "stringsonthings",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Comfort is great",
      "text": "Comfort is great, plus it elevates me slightly to I can see better in SUV. I am a petite person, so this helps me. Pain relief is not why I purchased this, however, if driving on long trip I a sure this would help, if you had pain. Warmth in winter would probably be good, due to the cover on cushion. Currently mid-fall in mid-west now, still having a few days in 80's, cushion not hot at these temps.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Perfect booster for Shorties!!",
      "text": "I’ve only had this a couple of days. So it hasn’t quite molded to me yet BUT I can tell I’m really going to like it. I’m just not used to finally being able to SEE! I got this mainly bc I’m sick of not being able to see well. I’m 4’11 and this gave me just the boost I needed. I think over time I will notice it helps with piriformis muscle issues as I can tell it corrects my posture already.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Comfy",
      "text": "My new cushion works well and stays in place without straps or anything to hold it. The only thing I am having trouble getting used to is the firmness. It is quite firm and I was not expecting that. Perhaps it will soften some with time. Otherwise it works exactly like I wanted it to. Shipping was very quick and I was impressed. I like the removable cover too.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel.B.",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "No more pain!",
      "text": "No more back ache! This cushion really works!!! Takes the impact off your tailbone/coccyx. It's the second one I've bought. My husband wanted one too!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Halsey",
      "helpful_votes": 4,
      "publication_date": 20171111
    },
    {
      "title": "Good driving cushion",
      "text": "I have a 2008 Honda Civic Hybrid which is great in many ways...but the front seat beds slant down toward the back of the car. If you know what a pyriformis syndrome is, you'll know what I've been dealing with on long drives. Ouch! This cushion seems to have the right amount of softness and of firmness, and has a good, ergonomic shape. I haven't had a long drive with this yet, and I hope to update the review after I have one--but so far, so good. I think this cushion was a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles H. Kuttner",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Comfy cushion for my car",
      "text": "Got this for my car, and it is so comfortable that I end up carrying it in with me when I get home. Helps me sit much more comfortably, lower back pain is less noticeable I think because it makes me sit with better posture. Also, I am 5'2 and did not realize how much of my range of vision was limited by my height. Since getting this cushion I can see the road so much better, I feel like a much safer driver. Recommend it to anyone looking for more comfort & a better view of the road while driving.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Stardust",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Veyry firm",
      "text": "Did not like it at the start--bought it for comfort in the car. It is WAY TOO FIRM for the car. However, it is working out adequately on my home office chair, but I have to use it backwards to make it work. For now, warmth is a bad ting--it is summer and I want a more breathable cushion. Maybe my mind will change when it becomes winter.",
      "rating": 4.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "This seat is of good quality. I would recommend it",
      "text": "A little hard. I need something to raise up the rear portion of the seat in my new GMC pickup. On longer trips my leg \"falls asleep\" because of pressure on my thigh. It seems to help. This seat is of good quality. I would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "TSZ",
      "helpful_votes": 3,
      "publication_date": 20170807
    },
    {
      "title": "This cushion sinks down to about an inch in a short time - useless.",
      "text": "I am 5'3\" and weigh 115 lbs. This cushion sinks down to about an inch in a short time - useless.",
      "rating": 1.0,
      "verified": true,
      "author": "BJS",
      "helpful_votes": 10,
      "publication_date": 20170725
    },
    {
      "title": "Rock hard",
      "text": "I really wanted to like this cushion, because the size is perfect for my chair. But I have come to terms with the sad reality... this is not a cushion, but a flat, semi-cushion-shaped wedge of hard, dense uncomfortableness. If you are in search of a solid, wedge shaped booster seat, then search no longer, you’ve found it. Congrats. If, however, your goal is something reasonably cushy for your tushy, then this “cushion” is a dead end for your rear end.",
      "rating": 1.0,
      "verified": true,
      "author": "Jerdrey",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Great product.",
      "text": "Sinks after awhile just a bit. Works well all day. Theres better ones out there, but don't want to deal with too much trial and error. Works great for me after 6 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Felipe",
      "helpful_votes": 4,
      "publication_date": 20171010
    },
    {
      "title": "Cured my leg numbness!",
      "text": "My left leg and foot used to go numb after sitting for only a short amount of time. A similar cushion helped at my desk, and this cushion solves the problem when I drive. I love the grip part--it never slips when I get in or out of the car. I have a Toyota Corolla (2017) and the pillow fits perfectly. Very comfortable too. I highly recommend this pillow if you have problems with numbness when you sit in a car.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "good quality and really helps",
      "text": "i am of a short stature and female.I was having trouble while driving to see in the front of the car while parking.This cushion elevated the height and i was able to see a lot better in the front of the car.The quality is good and have been using since 6 months and it is holding up well.for your info i drive a honda accord and i am 5ft1in height.This really gave a better visibility for driving.",
      "rating": 5.0,
      "verified": true,
      "author": "samakali",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Cushy",
      "text": "I bought this so I could be raised up a bit in my driver seat to be able to see Over my hood, it worked perfectly! It is very comfortable, I also suffer from lower back pain, I can see how this would be of a great help to someone who sits at a desk for long periods of time. (Takes the pressure off your back)",
      "rating": 5.0,
      "verified": true,
      "author": "HM",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Best cushion, cheap price",
      "text": "I originally purchased one of those 3\" all the way across cushions, but it lifted the front of my thighs to high and eventually became uncomfortable. I spend most of my work day in a sprinter van and needed a cushion to just raise up my butt area and this one works perfectly! when it arrived it was very stiff, and i didn't think i would like it but after the first week of use i was sold.",
      "rating": 5.0,
      "verified": true,
      "author": "E&C",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Car seat wedge well made and I am happy with it.",
      "text": "I needed to have a cushion in my car to see over the hood. This cushion is very nice, comfy and helps my spine to be relaxed. If the material was a little easier to slide across, it would help. Happy with product and deliveries through Amazon are always great!",
      "rating": 4.0,
      "verified": true,
      "author": "Rea James",
      "helpful_votes": 3,
      "publication_date": 20170908
    },
    {
      "title": "makes my chevy cruze seats bearable.",
      "text": "my cruze seats were killing me...the seats put pressure on my hips, which translated to terrible back pain in the evenings. I started using one of the wife's couch throw pillows to make it better, but this wedge worked way better and a lower profile. (not sitting too high) I'm about 5'11\" 240 pounds. Pretty good memory foam. Been using daily for about 1 year so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave Wex",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "As advertised. Soft and comfy and just the right rise.",
      "text": "I bought this coushion because I have a new truck and I am 4'10\" and needed a boost to see better. It elevates me just enough and is soft and comfy. Being only 110 lbs it did not squish down much at all. I haven't deiven any long distances yet so I have no opinion on pain relief. I do have some back issues and so far the cushion serms to keep me comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Sher",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Not Bad",
      "text": "I had imagined this product to be a lot more comfortable that it actually is. I kept it in the hope that it might become more comfortable over time but that has yet to happen.",
      "rating": 3.0,
      "verified": true,
      "author": "Catfish Tales",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Firm and comfy",
      "text": "I bought this to give me more height for my new car and it did its job. I am a toothpick so the pillow didn't get smooshed too much, so I'm not sure if this pillow would give any boost in height for someone bigger. It might be a bit on the firm side for some, but I like it. The color is also a silvery grey.",
      "rating": 5.0,
      "verified": true,
      "author": "Darbi",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Not for me",
      "text": "I wish it wasnt so high. Its super comfy dose what its suppose to do ..but the height is way to much for me..Super bummed",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191119
    },
    {
      "title": "Great for those bucket seats!",
      "text": "I've had back issues for several years. After a car accident in December, I was told by a physical therapist that bucket seats in sedans are very difficult on the lumbar spine. This wedge helps bring those seats that are tilted slightly back to being level. It made driving my sedan so much easier. Really took some pressure off my back.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "probably fine for the car, not so great for cello playing",
      "text": "the product is fine but didn't work for what I needed. I play cello and needed something to stop my wooden chair from cutting off feeling in my legs after an hour or two of practicing. The slant was a plus because it helps posture while playing, but the thin edge was too thin to make a difference. I returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Ravenlyn",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Great Product! Good Value!",
      "text": "I ordered this for my uncle who needed a seat cushion for his new car to provide a little lift. This was the perfect cushion. The bumps under the cushion really prevents slipping, the color matches his leather seats perfectly, and the price is right. It was so great he asked me to purchase another one for his passenger seat!",
      "rating": 5.0,
      "verified": true,
      "author": "Thuy Trang Nguyen",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Wears out very fast",
      "text": "Bought this in March and despite seeing very little use due to covid19, it's lost so much of its support and is now so squishy. Totally satisfied initially but the durability is very poor, and I'm only 125 lbs or so.",
      "rating": 2.0,
      "verified": true,
      "author": "Pat M",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "SO IS NOT THAT COMFORTABLE. I DON'T DRIVE LONG DISTANCE SO DECIDED TO ...",
      "text": "WAS GOING TO RETURN IT - WELL MADE BUT I HAVE BUCKET SEATS AND IT DOESN'T QUITE FIT PROPERLY, SO IS NOT THAT COMFORTABLE. I DON'T DRIVE LONG DISTANCE SO DECIDED TO KEEP IT - I BOUGHT THEM TO RAISE ME UP SO I COULD SEE BETTER BEYOND MY SIDE MIRRORS - WHICH THEY DO - FIGURE I'LL GET USED TO THE DISCOMFORT, AND NOT HAVE TO SHOP FOR ANOTHER.",
      "rating": 3.0,
      "verified": true,
      "author": "Pat C.",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Very comfortable",
      "text": "These pillows are great,so comfortable. They keep your posture correct and make our backs feel great. We had ordered similar products before and were disappointed. Thank you for making a product that does what it promises.",
      "rating": 5.0,
      "verified": true,
      "author": "debbie",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Too stiff",
      "text": "It's a good size especially for car bucket seats, but the foam is just too stiff. I tried leaving it inside my house (heater on), instead of in the car in the garage, but the foam was still too stiff. It's good if you're really looking to add height, without sinking down too much.",
      "rating": 3.0,
      "verified": true,
      "author": "clambake",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Nice wedge",
      "text": "I bought this for my wife for long trips in the RV and she loves it. She has a very sensitive tail bone, and this provides the necessary support to abate the pain she often gets from sitting for long periods. Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr ATC",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "This is perfect for driving",
      "text": "I'm very short, 4'11 and I needed something. I read the reviews on this and it's perfect for my car. I also like that it's grey and it matches my seats. It also doesn't loose shape - if you're short and need something - I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "It’s comfortable",
      "text": "I bought this for my sister as a booster for her new truck. Her husband bought this monstrosity of a vehicle & she damn near needs a parachute to get out of the thing. It’s a beauty, but with manual seats, there is no way to raise it for better visibility. This cushion does just that, and it’s comfy, according to what my sister told me.",
      "rating": 5.0,
      "verified": true,
      "author": "icv",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Perfect for short drivers",
      "text": "My daughter is 5ft tall and was driving her little suv sitting on pillows. This is a much safer sturdier option. The little grips keep it from sliding on the seat while she drives. The memory foam is firm but comfortable and lifts her just enough that she can safely drive.",
      "rating": 5.0,
      "verified": true,
      "author": "GlamBlondeBombshell",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Must have for worn seat.",
      "text": "My older Silverado seats are worn out. It was a construction used truck I bought. Seats sunk so this gives good lift. I’m 250lbs in a good day and this hasn’t caved in. Also very comfy and supportive. I used it for a long trip in my wife’s Honda Pilot. I wish I bough sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper1",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Ok, but doesn't help much",
      "text": "I bought this for use in a car, because of the wedge shape. But the flat back of the cushion doesn't fit in well with the rounded back of the car seat. Also, the padding is somewhat stiff, so it doesn't provide much relief. However, it's well made, and the fabric of the cover is nice, and a good neutral grey.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Jenkins",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "soft as marshmallow",
      "text": "I bought this item it was shipped quickly however on receiving, I found it to be so soft it was like sitting on a marshmallow. Not doing its job to give my back any support. Returning asap",
      "rating": 1.0,
      "verified": true,
      "author": "Gugu-gaga",
      "helpful_votes": 3,
      "publication_date": 20180921
    },
    {
      "title": "Stinks until it airs out",
      "text": "It arrived off gassing heavily but it didn't last super long. It doesn't smell anymore. It is firm enough to raise me up in my car which is why I bought it. I didn't have particular pain before I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Delayed Gratification",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Finally, something that works!",
      "text": "I was suffering from coccyx pain for about 6 months, and I tried all the soft or memory foam pillows I had at home without comfort. I purchased the COMFYSURE Wedge Pillow for its special shape, and finally I have found comfort. There's no more pressure on my coccyx when I have to sit for long periods. I will highly recommend this pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lake",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "worth the mula!",
      "text": "LOVE this cushion! I am so short, as I drove my Lincoln MKX, I could not see the hood of my car, nor judge how far into a parking space I was. ( I has been used to a big ol' SUV, sitting up high and able to see the traffic pattern ahead of me) This cushion helps my line of sight by a million percent, yet it is not so high that my head brushes my headliner. Great value and cheaper than buying a new vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "JDP",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Feels Like A Marshmallow",
      "text": "This is way too soft to provide support while driving or sitting long hours at a desk. I'm only 128 lbs, and it compressed more than half way to the bottom within a minute of my sitting on it. And the grey pseudo fur cover looks like it would show dirt and wear terribly. Not a good idea.",
      "rating": 1.0,
      "verified": true,
      "author": "Mommallama",
      "helpful_votes": 2,
      "publication_date": 20180828
    },
    {
      "title": "Saved my back!",
      "text": "Saved my back!!! Bought it for an 8 hour road trip (plus return trip). Worth every penny! I took the same trip last year without this pillow and had to take heavy pain killers upon my return due to a pinched nerve. No issues this time around. Now I’m using it at work and have much better posture.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Ferrer",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "perfect wedge pillow",
      "text": "This wedge pillow was much more comfortable that I had even expected. Would definitely buy again. I use it for an office chair that tilts forward and I had to hold onto in order not to slide out. This wedge pillow solved the problem perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Perfect for shore ladies in cars.",
      "text": "I am 5ft 2 in and my new Cadillac XT5 does not raise the seat high enough for me to comfortably see the road. Cadillac does not provide an alternative seat pillow. So I was delighted to find the ComfrySure pillow by searching online. I t does move a little when I get in the car because the Cadillac seat is not exactly right. But that is a little adjustment and after I settle the pillow in place, it stays in place !",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Altadena",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Works great for me",
      "text": "Takes the pressure off the tailbone which helps to reduce the back pain. I also like the slope at the end of this cushion, which helps to keep pressure from the back of the legs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jmgreen57",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Car Seat Wedge Pillow",
      "text": "I am of a short stature, and I needed this pillow to give me enough height so the side view mirrors do not block my vision. This pillow has done so, and is comfortable for long or short drives, and holds its height (does not pack down). I am very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "RatherBeReading1000",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Great size",
      "text": "Love this cushion? Just the right size for a small bucket seat. Must cushions like this have a cutout for tailbone. After awhile the seat becomes uncomfortable. This keeps its shape. Just wish it came in tan.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Solved the posture and hip problem",
      "text": "I heard about using a wedge on NPR for hip problems and proper posture , so I ordered this the same day. It worked and added height, too, so there's less sun in my eyes. I'm just over 5'4\". It is also comfortable and tolerated our summer heat in Louisiana.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Liljeberg",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Good on hard surfaces, not as good in bucket seat.",
      "text": "This is small for a man and is stiffer than needed on a car seat. I find it is helpful on wooden seats where softer cushions sometimes are still uncomfortable. I bought it originally for a Honda bucket seat to try to relieve the angle and prevent pain from hip arthritis. I found that a wider cushion worked better.",
      "rating": 3.0,
      "verified": true,
      "author": "zrose",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Comfy for sure",
      "text": "I really like this cushion,,,, it did have a tiny odor to it but it was gone in a day. I made adjustments to my mirrors and seat.... It honestly does help my sciatica.. I didn't even have a problem with it sliding around when I got in or out of my car... I would recommend this product to anyone...",
      "rating": 5.0,
      "verified": true,
      "author": "Senior Painter",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "I didn't like it but my husband did.",
      "text": "I didn't like it because it did not hold my body steady. When I sat on it I felt like I was teetering sideways and had to tense to stay stable. So I gave it to my husband, who thinks it's just fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Sylvia Keepers",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Really Great Cushion",
      "text": "Love this cushion, it is very comfortable. The cover of it it is very soft yet seems durable. It also gives a little bit of a boost, which works for me because I'm short (5'2\"). But not too much of a boost that anyone else couldn't use it. Another bonus is that it doesn't slip around on the seat. Because of the design on the bottom it stays put. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "I've got a big butt and I will not lie",
      "text": "This seems like a decent enough product but it's made for folks with itty bitty behinds. I needed a cushion for both cheeks at the same time and this wasn't it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mari",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Gives me an extra boost for driving my truck",
      "text": "I purchased this pillow so I would be more comfortable driving my new truck. The seat wasn’t quite high enough for me. It works wonderfully. Very comfortable and it even looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Maine girl",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Great on hardwood chairs",
      "text": "I bought this to use at the kitchen/dining room table. It has been very comfortable and has made working at our dining room table and sitting on hardwood, bow backed chairs much more comfortable. I find that my sitting posture is better and my back and shoulders do not ache after using the cushion. I have yet to try it in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Hellenbrand",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "comfysure",
      "text": "Firm but, too small. if you have large behind wont work for you and it could have come with straps or something to hold it down. Other than those, the best in market that I've seen.",
      "rating": 3.0,
      "verified": true,
      "author": "gene",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Booster for Driver's Seat",
      "text": "I am 4' 10\" and needed a \"booster\" for the driver's seat. It is very firm ... but I like more structure. I have referred it to a friend for her young son while in the car. Good product !!",
      "rating": 5.0,
      "verified": true,
      "author": "Minnow",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Helps with sciatica",
      "text": "The pillow is perfect for me. It's soft and comfortable and really helps alleviate pain. I am a small person, 5'3'' and average weight. I also drive a small car. .If I or the car were larger the pillow would be too small.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Not comfortable",
      "text": "The product looks just like pictured. I like the color and material. However, right away, you’d notice that the cushion is made with a really hard foam wedge. It’s not that comfortable to sit on especially for prolong work hours.",
      "rating": 3.0,
      "verified": true,
      "author": "TheBaron",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "This is a great product, big difference between the discomfort I felt ...",
      "text": "This is a great product, big difference between the discomfort I felt driving in the car for a couple or so hours without it, compared to with it. This wedge really does take the pressure off of your lower back/tailbone, after some time, the foam does get compressed a bit, but still a huge benefit compared to driving without it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Works great!",
      "text": "I purchased this because the seat on my car sits just a little too low for me. This pillow gives very comfortable firm support and solved my problem.",
      "rating": 5.0,
      "verified": true,
      "author": "April Constantine",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Like the height it gives, with comfort.",
      "text": "Used often in a couple different seats around the house. I like the smaller profile of the wedge pad. Fits alot better in smaller seats. Plus the added height it gives me is a plus. It’s comfortable and doesn’t flatten out for me, at least not yet. I’m currently 150 lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane Adam",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Comfortable on My  Aching Back",
      "text": "The cushion is comfortable on my back as I drive my car without lumbar support. It also does not slide on my car seat. It is well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "M.C. Buyer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Very comfortable.",
      "text": "E are using these in our recliners as they were making our backs hurt. They have been wonderful as keeping the tailbone off of the chair seat. We will also use them in the car when traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Could use a bit more width...",
      "text": "I needed this \"booster seat\" for my truck, and I'm glad I have it now! (I'm 5/4\" and 109lbs., so it bumps me up just enough to see better, especially when parking in a tight spot.) My only comment is that I wish it were a bit wider. I'm pretty skinny, but I often feel like I'm going to fall off of either side of the cushion. Other than that, I'm completely satisified with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy A.",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Great for Hip Implants",
      "text": "I bought this for my mother who has two hip implants, and would always complain about her car seat being too uncomfortable to ride in, but everything changed when I got her this product. She no longer has problems driving, and is very satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Used in 2013 Honda Accord Coupe",
      "text": "If you own one of these cars, YOU need this, or you'll be a cripple after a long trip. In cold weather, it is like a rock, but gets comfortable quickly. It works great with these very, very low grade seats.",
      "rating": 5.0,
      "verified": true,
      "author": "walt",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "It is very comfortable and does not put pressure on the thighs like ...",
      "text": "The Comfy Sure wedge cushion is the only cushion that worked for my tailbone pain. It is very comfortable and does not put pressure on the thighs like the others I tried. I especially like that the wedge is angled so that I am able to place my feet on the ground. Delivery was quick, nicely packaged, good quality. It does have a chemical smell, but eventually wears off.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "The best for back pain",
      "text": "I love it! I have a pinched nerve in my back and I need this so it doesn't send pain all the way down my leg when I am sitting. I have one for my couch, my husband's truck and my chair at work. This is the only one that I found that really helps me.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Vestal",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Fits a Mitsubishi ASX/Outlander seat almost perfectly",
      "text": "Have been using this for the past 3 months and has been great so far. Needed something to make my car seat (which is very firm) a bit more bearable but at the same time take care of my spine/tailbone aching during long drives. Was a bit skeptical at first if it would fit (bought another seat cushion which was great but didn’t fit the curves of my car seat so couldn’t use that one) - this one almost perfectly fits! It still protruds on the sides (as per pics) but settles in fine when sat on. Doesn’t add much height but I wasn’t looking for one that did.",
      "rating": 4.0,
      "verified": true,
      "author": "Shari",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "“Quality was better than I expected",
      "text": "“Quality was better than I expected. Firm, durable, well made cushion that makes my Honda CR-V seat so much more comfortable and ergonomic. It replaced another brand cushion that I bought less than a year ago on Amazon that has lost its shape and did not hold up well at all. I can tell that this one is of much higher quality than the other one, for essentially the same price. I'm very happy with this cushion.“",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Benton",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Goo value, good product",
      "text": "Just bought a 16 year old pickup truck with a sunken driver side bench seat. This cushion is well made, very comfortable with just the right firmness. It sits comfortably but does not compress much. Soft, attractive cover that zips off for launering. Wish it were just a few more inches wider.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Harris",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "It's ok",
      "text": "Bought the cushion because my doctor felt it would help with the shooting down my leg/ nerve pain while driving. This has never happened before and I've been dealing with back issues for years. i'm tall so it took some adjusting with the seat to not feel like I was sitting too high. It took the edge off regarding pain but I was still uncomfortable. Didn't have complete relief. The cushion is comfortable and doesn't slip while driving. it may depend on the severity of your pain",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole J.",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Works like magic for hip pain releif!",
      "text": "This pillow is like magic. Do not try to go cheaper they do not stand up.",
      "rating": 5.0,
      "verified": true,
      "author": "Doreen Coursen",
      "helpful_votes": 0,
      "publication_date": 20190614
    }
  ],
  "product_meta": {
    "title": "ComfySure Car Seat Wedge Pillow - Memory Foam Firm Cushion - Orthopedic Support and Pain Relief for Lower Back, Tailbone, Coccyx and Hips for Driving, Office Chairs and More",
    "rating": 4.3,
    "feature_bullets": [
      "Medium-firm Memory Foam",
      "HIGH DENSITY MEMORY FOAM CUSHION: Built to provide maximum comfort and support – 100% durable therapeutic grade memory foam material molds to your body type and shape.",
      "MUSCLE SUPPORT FOR DRIVERS: Driving all day takes its toll on your body. Our wedge cushion ergonomically relieves coccyx, tailbone, and sciatica pain as well as pressure sores.",
      "FOR EVERYWHERE: This wedge pillow is not only great in vehicles; it is perfect for office chairs, armchairs and airplane seats. Take it with you when you travel, or keep it at your desk.",
      "EASY CARE & PORTABLE: The lightweight, ergonomic pillow is easy to carry and perfect for travelling. The soft velour cover is removable and machine washable for easy cleaning.",
      "NON-SLIP BOTTOM: With a safe and secure grip onto your seat, there is no slipping, no sliding, and absolutely minimal movement while you’re driving with no need to readjust."
    ],
    "specifications": {
      "Product Dimensions": "13.8 x 3.1 x 15.8 inches",
      "Item Weight": "1.4 pounds",
      "Manufacturer": "COMFYSURE",
      "ASIN": "B01N4DFPU6",
      "Item model number": "13",
      "Customer Reviews": "4.3 out of 5 stars712 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#4,626 in Automotive",
      "Is Discontinued By Manufacturer": "No",
      "Seat Height": "3 Inches",
      "Fabric Type": "Medium-firm Memory Foam",
      "Fill material Type": "Memory Foam",
      "Batteries Required": "No"
    },
    "categories": [
      "Accessories",
      "Home & Kitchen",
      "Interior Accessories",
      "Seat Covers & Accessories",
      "Automotive"
    ],
    "price": 24.99
  }
}