{
  "website_summaries": [
    {
      "verdict": "A high-protein treat that contributes to a healthy turtle diet.",
      "pros": [
        "Available in 2.5-, 5-, or 10-ounce jars",
        "High in protein",
        "Can be used as regular food or an occasional treat",
        "Appealing red shrimp flavor",
        "Assists with weight gain and energy levels",
        "Floats on water"
      ],
      "cons": [
        "Treats may be too large for smaller turtles to break apart"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "My turtles love me for this",
      "text": "As soon as my turtle sees the container he goes crazy. I actually love the smell, it reminds me of shrimp stir fry paste (but this isn't for humans!) I had to knock a star because a couple weeks after I opened it, it started to smell like ammonia. Full strength, eye stinging ammonia. Even though I closed it tightly and kept it in a ziploc after every use it either went bad or was bad to begin with...I'm sad to throw out a huge container of shrimp but I don't want to poison my turtles. :( Will repurchase in a smaller oz container this time around.",
      "rating": 4.0,
      "verified": true,
      "author": "Camille",
      "helpful_votes": 9,
      "publication_date": 20181008
    },
    {
      "title": "The Best I Ever Got!",
      "text": "I was very impressed with this purchase. Usually I go to the pet shop for this and all the time there is so much crushed shrimp on the bottom of the container that it looks like powder not shrimp. I purchased this product from Zoo Med and I am amazed. There was literally No crushed or powdered shrimp on the bottom. I love it! This is worth purchasing over and over again.",
      "rating": 5.0,
      "verified": true,
      "author": "RonnieMarz",
      "helpful_votes": 5,
      "publication_date": 20180321
    },
    {
      "title": "Fish and turtle just go nuts over this shrimp.",
      "text": "Fish and turtle absolutely devour this shrimp. However, unlike other dried shrimps which is 100% dry, this product the shrimp is slightly moist and with a little greasy feel to it. Since seller actually did send a post sale followed up email so I replied with the question on the moist and greasy feel. Never got a reply. Therefore, I was going to leave 4 stars but the fish and turtle talked me out of it as it's possible my email was simply overlooked and the shrimp is so delicious!",
      "rating": 5.0,
      "verified": true,
      "author": "behbeh",
      "helpful_votes": 5,
      "publication_date": 20170707
    },
    {
      "title": "This was great, just order now  ! ! !",
      "text": "I really like these freeze dried shrimp & my Red Eared Slider turtle loves it. The shrimp are really large with not that much shake in the container. I compared these 2 bottles to the 1 little bottle that I bought from Pet Smart. I paid $8 for that little bottle & only $16 for both those big containers, so u guess what the better buy was. I'll never buy this from Pet Smart again. My RES almost jumped out the tank trying to eat these shrimp.",
      "rating": 4.0,
      "verified": true,
      "author": "Dolemite",
      "helpful_votes": 3,
      "publication_date": 20181113
    },
    {
      "title": "Turtles love them!",
      "text": "I have two red eared sliders (female 10\" and male 7\") and they love these!! They practically climb out of the tank when we open the jar. This brand seems to be their preferred. The are nice and large and complete shrimp, just how my turtles like them. The smell when you open the jar is very strong though, it gets around the room pretty fast, but smells like fresh fish. I feed these as treats with their regular food. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "My Fish Did Not Take-TOO SMELLY",
      "text": "I have a very carnivorous fish that eats similar dried baby shrimp, live ghost shrimp, brine shrimp, etc...EXCEPT for this food. After I saw him eat one of my relatively large Cory catfish, I knew he needed something larger to swallow which is why I purchased these. BUT the SMELL is an extreme smelly smell...that smells...smelly. Each time he went to the surface to eat it, he backed away in fear. SO, this is probably fine & dandy for turtles but possibly not your fish (coming from a fish that eats several types of shrimp). SO, I either got a defective/expired product, or the manufacturer needs to reduce the smell if it wants to target fish owners.",
      "rating": 3.0,
      "verified": true,
      "author": "Robr",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Red Eared Slider Backlash",
      "text": "My red eared Slider turtles practically jump out of the tank when I put the Red Shrimp in there. And when I just feed them their normal diet they seem to just stare at me for a minute before eating. But when I hold up the container with the blue top they go crazy, it's really funny. Great product with a lot of good protein. Thanks, Shelton",
      "rating": 5.0,
      "verified": true,
      "author": "Louis Minor",
      "helpful_votes": 24,
      "publication_date": 20130503
    },
    {
      "title": "My turtles go nuts for these things. They get ...",
      "text": "My turtles go nuts for these things. They get these as a healthy treat once or twice a week and this 5-ounce container lasted us many many moths. One caution, though, they really really stink and by the end of the couple months the smell was stronger. Maybe refrigerating would help? Also, be absolutely sure to skim any uneaten shrimps or little shrimp bits out of the water or it will turn your whole tank rank smelling in a day.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "the stuff must be pretty darn tasty",
      "text": "I first purchased Zoo Med's Red Shrimp at the local pet store. Figured I could save some money (and a trip to the store) by Amazoning the item. Sure enough, same item, less money. Can't praise or complain about the quality of the shrimp since I'm not snacking on it myself, but judging by how my red-eared sliders gobble them up, the stuff must be pretty darn tasty. If I had one complaint, it would be that the bottom of the container is mostly shrimp crumbs as opposed to whole shrimp. I end up tossing the last bits that could've been used for 2 more feedings had it not been all crumbs. Oh well.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron S.",
      "helpful_votes": 2,
      "publication_date": 20180416
    },
    {
      "title": "Not large sized anymore",
      "text": "We have been feeding our turtles these for a long time, they used to be bigger than they are now, honestly I don't know why they label them as large anymore, they are very tiny, the last bottle they finished had lots of tiny crumbs which made the turtle tank look dirty and messy, quality is definitely not as good as before",
      "rating": 3.0,
      "verified": true,
      "author": "Chatita",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Junk food for fish",
      "text": "Pungent smell like a batch of rotten cod liver oil I doubt this is natural shrimp. Have been using Omega One which smells like real shrimp which my fish all 47 of them used to devour. Now this Red River stuff is being spat out all over the place. The Fish know that its junk food.I am returning the entire batch of made in China garbage",
      "rating": 1.0,
      "verified": true,
      "author": "Anna Phillips",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Seems okay but turtles don't like it.",
      "text": "Well this item seems like it's good quality but my common snapping turtles wont eat it more than one small shrimp. Plus, even when the cap is tightly closed it puts off a disagreeable smell. I dont think there is anything wrong with the product itself so 3 stars...but I bought two containers thinking they would like it just as much as the ones I have fed them previously but I was mistaken.",
      "rating": 3.0,
      "verified": true,
      "author": "Meredith J",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Pond fish love this stuff. For larger fish. Not small ones.",
      "text": "My large Koi and large Goldfish go nuts over this stuff. These are large bites so they akre for bigger fish. Mine are 5\" to 16\". They are too big for the ones smaller. The smaller ones can pick at the broken pieces. They also love eating what they can. I do recommend from my own fish feeding experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Wilson",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Turtles LOVE, smelly, messy (filter)",
      "text": "I have 3 female, aquatic turtles. They absolutely LOVE their shrimp. I feed them a combination of 3 different food, these shrimp, dried crickets, and pellets. If you only use the shrimp, it might dirty up your filter quicker. They also do NOT smell pleasant when you open the jar up to feed them, but as soon as you close the lid it gets better.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelse Manwell",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "It’s alright, a bit smelly",
      "text": "Before anyone buys this you should know: This has a HUGE shrimp smell. Not a bed smell but it’s potent. We moved it to a cabinet and now the whole thing smells shrimpy My water dragon didn’t like this so unfortunately I’ll need to toss it",
      "rating": 5.0,
      "verified": true,
      "author": "Candice Langston",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Cichlids won't touch it!",
      "text": "Cichlids are not notoriously picky fish, but mine won't touch these shrimp with a ten foot pole. I have hand sized fish so the size isn't the issue. They take a bite and spit it right back out. Not sure if its sprayed with preservatives when drying, but its not good. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Your Turtles and Reptiles will go nuts over this food!",
      "text": "Your reptiles will love you for Zoo Med Sun Dried Large Red Shrimp! While they do claim it can be used every day for food, you should study to make sure what your pet needs daily for food. Some reptiles require more protein at different stages of growth and this is full of it! I find that my turtles beg for this over their regular pellet food. It does have a strong fish odor so you'll want to keep it capped it all times. This is a huge bottle and usually at a great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "Jolene Sugarbaker",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Turtles Love It!!!",
      "text": "Good Product Overall- Turtles Love it! ******** I think there should be a universal knock or doorbell ring that signifies its an Amazon package. We need to make this a thing. I hate running like a maniac to answer the door for no reason. Please pass along if you agree! **********",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Our baby turtle absolutely LOVES this food",
      "text": "Our baby turtle absolutely LOVES this food.... If I hold the container in front of the tank he comes right to it and will follow the container when you move it....until you feed him. He just can't seem to get enough of it. This was a good purchase and will not go to waste. Just remember, it contains fish oil, so use it sparingly (as directed) or you will have to clean your water/change your filters more often. It arrived very quickly and the price was OK as well. The best part is I didn't have to go to the pet store to purchase it, so I saved on fuel costs and my time (they're always busy).",
      "rating": 5.0,
      "verified": true,
      "author": "Ruger",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "My turtles love this",
      "text": "I have 5 water turtles various breeds. They love \"stinky food\" and this fits the bill, it stinks. They love it. I just wish it shipped with less crumbled and crushed parts but it is like that when I buy it in the store as well. I recommend, and will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Babs Rubarb",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Box Turtle Approved",
      "text": "We have a box turtle and she's super picky like she only eats bananas and fresh shrimp or tuna cans. Spoiled brat. We previously ordered freeze dried crickets, she hated them. We got these because of the good reviews and they were right. She loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer ",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Eek",
      "text": "I’ve bought this product before and was pleased, until NOW! The smell coming from the container was horrible! A musty over-powering smell.",
      "rating": 1.0,
      "verified": true,
      "author": "bainton2",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Our turtle loved these! After he passed away",
      "text": "Our turtle loved these! After he passed away, I started feeding them to our fish and they love them. Usually only the bigger fish will eat them and when they do, they will grow larger. I swear by this. We had two medium fish. One started eating nothing but these. He's now about three times the size he was, the other one stayed smaller. We have five goldfish in our tank. Most of them eat regular fish food. One fish has just started eating these and he is growing much larger while the others are remaining smaller.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "Better now",
      "text": "Update May 22, 2015 Moved to 4 Stars Took another chance on these and the next batch didn't have the same bad smell. The turtle started liking these over the other brands we tried so I guess these are a winner. Price wise, these are a really good deal for the price. ~~ OLD REVIEW ~~ These are priced well, but compared to other shrimp, they have a really strong and strange odor. We feed shrimp to our turtle as a treat and these she will eat but doesn't seem to like them as much as other brands. The price is really good, but I do not think I will buy these again because of the strange smell.",
      "rating": 4.0,
      "verified": true,
      "author": "Tech On the Mark",
      "helpful_votes": 0,
      "publication_date": 20150130
    },
    {
      "title": "These stink up the whole house",
      "text": "I don't know if it is due to exposure to air after they have been opened or what, but soon after I started giving these to my red-eared slider, I noticed a terrible smell throughout my place. For some time I couldn't figure out the source, but finally last night I realized it is these things! Yes, my turtle loves them but I can't deal with the smell.",
      "rating": 2.0,
      "verified": true,
      "author": "Linda A.",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "good",
      "text": "I was skeptical as to whether or not my painted turtle would take to these as he is pretty finicky about food. It took him a while to warm up to them, but he eats them. This is a great value compared to the overpriced Petco down the road. The smell isn't that bad compared to the smaller variety shrimps I used to buy for him,",
      "rating": 5.0,
      "verified": true,
      "author": "Dr K",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Smells like chemicals and is hollow so I don't know how ...",
      "text": "Smells like chemicals and is hollow so I don't know how much nutrients could be in these. Maybe this is normal for red shrimp but I wouldn't buy again. Also leaves an oil slick every time I feed...no surprise that my turtle will not eat",
      "rating": 1.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Turtle loves it but packaging container doesn’t hold the smell inside.",
      "text": "Bought these for my turtles nightly bedtime snack. He loves them. Only issue is the container they come in does not hold the stink in. Had to get a heavy duty zip lock to cut the smell.",
      "rating": 5.0,
      "verified": true,
      "author": "D Lipper",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Nice deal but",
      "text": "It is really messy in aquariums especially when fed on oscars.. good as treats only.. i only feed this a day or two before a water change. my oscars love em so much but its so messy and could mess with your water quality!",
      "rating": 5.0,
      "verified": true,
      "author": "MurseB",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Old",
      "text": "My turtle would not eat them and I didnt blame her. They were soft and spongy.. they were not crispy like they were in the past orders. I threw them out.. every upsetting.. because I bought 2 orders.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Zepka",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Great for RES and Dogs!",
      "text": "My Red Eared Slider loves these shrimp and so do my dogs! I sprinkle a few for the dogs every time the turtle gets them. It is a great dog treat with minerals and protien and less expensive per serving size than regular dog treats.",
      "rating": 5.0,
      "verified": true,
      "author": "MaMaCatCanDo",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "These shrimp are perfect to buy with the Fluker's Buffet Blend",
      "text": "These shrimp are perfect to buy with the Fluker's Buffet Blend. The other food contains just a few shrimp and mostly pellets. I buy both and then combine them, so that there is a higher amount of shrimp along with the vitamin fortified pellets. I'd like to think my turtle appreciates the extra effort.",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Turtles love these!",
      "text": "Our red eared slider loves these things! As soon as I take one out of the container she starts moving all her legs in excitement! As soon as I drop one in the water, she hunts it down and it is gone! Ready for some more. These must taste real good to turtles!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Shore",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Good stuff",
      "text": "My turtles love them. They seem to go after these and now hesitate to eat the pellets I give them. Like they're waiting and hoping for the shrimp instead. I had to cut these into 2's and 3's since they are large and I have small turtles just as an FYI. If you have small or juveniles turtles than these may too large right out of the can. Recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Skimbleshanks",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "not too smelly and your turtles will love them",
      "text": "my turtles will go crazy every time i shake the bottle, they will jump out the water and even let me feed them by hand, great compliment for sliders diet",
      "rating": 5.0,
      "verified": true,
      "author": "MALM",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Turtles love it!",
      "text": "Our turtles love this stuff. Much prefer this over their usual turtle food. Quality seems very good, has a pleasant smell and shrimp pieces are intact and not crumbled like some are.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Maki",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "My turtle loves them",
      "text": "My turtle stopped eating during the winter month and didn't eat anything for more than six weeks. We even tried meal worms as I read that turtles can't resist meal worms. He was otherwise healthy and active. The vet said that was normal. I got him these shrimps and he loves them. These are a little bigger than normal turtle food. He runs towards them when I put it in his tank. I think he like the smell of these, as he eats only when I put fresh ones in there and any left over are collected around the filter, he doesn't eat them.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "Good, lasts a long time",
      "text": "This is good food for my water turtles. The 2 I bought lasted 6 months for 3 red eared sliders. Highly Recommend this product! A+++++",
      "rating": 4.0,
      "verified": true,
      "author": "TJROX",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Feed them what they like but don't overfeed enjoy watching them enjoy the food and they get excited",
      "text": "My very large flowerhorn. I got him as a young fish the size of the tip of my first & before I get to the knuckle now lest than a year he is the size of my whole hand to my wrist. he eats blood worms, brine shrimp, raw 🍤s, sun dried shrimp, bug larva. My female flowering she is very picky eater Frozen brine shrimp, blood worms, bits of raw 🍤 s For now I ordered some Omega flake food see how she will like it.",
      "rating": 5.0,
      "verified": true,
      "author": "john s. williamson",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great quaility product from ZooMed",
      "text": "Healthy quality food. When ordering the large container, even the the total is the same. The seller should not send two containers totaling the amount that you ordered. Just send one large container.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Good price",
      "text": "I'm not saying this product is not good but for some reason my aquatic turtle didn't like it, I buy her shrimp as a treat, she loves shrimp, this is a different brand than I normally buy, she just won't touch it",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Turtle Loves Shrimp",
      "text": "Purchased these for our turtle as a little treat in addition to his regular food. He really enjoys eating them and as a size treat they lasted about 6 months. One small complaint is that they have a lot of \"shrimp dust and particles\", which when given to him make his tank a little dirty. Would buy again though.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg P",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Well liked but stinks to heck.",
      "text": "My turtles sure love these shrimp but man do they stink the house up. Open that container and people in the other room complain.",
      "rating": 3.0,
      "verified": true,
      "author": "Edwin M.",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "I still recommend this! Remember",
      "text": "My turtle cant stop eating these!! I always include a couple of shrimp for my 5 inch red eared slider and he always picks them out and devours them first! The only reason why I took off a star is because once you get to the bottom of the container, a lot of them are already crushed into a grain and only create a mess if put into the tank (maybe the last half inch of the container). However, I still recommend this! Remember, diversity (food) is the key to a healthy life!",
      "rating": 4.0,
      "verified": true,
      "author": "Megan L.",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "Not Good Product!",
      "text": "Hi I usually leave a good review for mostly everything I buy, and I usually read a lot of reviews before but with this I didn't do it. There is no meat in here is pure shell with nothing in it my fish (Oscar, Gold Severum) wont even get close to it they see it and they don't even try after a few times they tried. I did not return it but still there maybe for a turtle but not for fish is hard.. I do not recommend it but if you buy it anyway I hope it works for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Dimitri",
      "helpful_votes": 0,
      "publication_date": 20140518
    },
    {
      "title": "Great price! Not sure about presentation?",
      "text": "It's the first time I buy this for my red ear slider at first it took her a while to eat them, slowly she started to not sure if because of flavor or because of presentation? They all look like they would be expired I don't blame my turtle if she doesn't finishes the whole thing :/ not sure if I would buy again... we'll see!",
      "rating": 4.0,
      "verified": true,
      "author": "Estrella Sevillano",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Not great for fish.",
      "text": "Well... I have mixed feelings about this product. I don't want to down it since its specifically for turtles as advertised. However, it is well known that this type of food is also widely used for aquarium fish. I have a 350 gallon fish tank. My large fish don't like eating this food very much at all. The only fish that does eat it is my silver arowana, (who happens to have the biggest mouth). I will eventually, slowly, use this entire bottle of food but doubt I'd buy it again for my fish.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabe",
      "helpful_votes": 0,
      "publication_date": 20150213
    },
    {
      "title": "but regardless they all like them, especially the tiger barbs",
      "text": "I feed them daily as a part of the diet to my angels, cories, african dwarf frogs, loaches, a senegalus bichir, and tiger barbs. They're mostly on the large side, so I had to break them up a bit, but regardless they all like them, especially the tiger barbs, loaches, and bichir! They particularly go crazy after them. And yes, they do stink quite a bit, but I expected that coming from a bottle of dead shrimp. They're also not much of a mess, which is a definite plus.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "OUR TURTLES EAT THIS AS PART OF THEIR DAILY DIET....  THEY SEEM SATISFIED WITH IT.",
      "text": "I can't say that I love this, because it smells, but our two rescue turtles love it. They eat this everyday as part of their diet. They're happy with it so I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "DreamyOneTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "My baby turtle loves these.",
      "text": "I bought a new res turtle. She would not eat the pellets I received when I bought her, I was so worried about her because she would not eat. I tried everything, I bought another brand of pellets, I tried fruit, and lettuce and carrots. I decided to try these and she loves them. I am so happy, I thought she was sick, I guess she is just a picky eater.",
      "rating": 5.0,
      "verified": true,
      "author": "JOY",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Good shrimp",
      "text": "This a much better deal than I could find on the same sun-dried shrimps at my local pet stores which had 1oz bottles for nearly the same price. They have a good, fresg, strong smell, which is perfect for my hermit crabs (since they find food primarily by smell), not moldy, stale, or spoiled. They were still sealed and did not break open in shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "NeatHedgehog",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Excellent shrimp for turtles",
      "text": "This large plastic container of brine shrimp is a good food in the mixed diet for and is well liked by my freshwater turtles. The large size is a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie J Samuels",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Crunchy goodness... For your fish",
      "text": "Another deliciously crunchy, albeit slightly fishy, snack. Could use some salt, but otherwise great 😋😁",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Better for Reptiles; NOT fish",
      "text": "NOT for Fish, as they will NOT eat them. They look at them smell them and just let them sit there. Also they make the aquarium water cloudy. I think they will do better being fed to reptiles. My Oscar is a foot or more in length and the size of a large mans hand and quite aggressive as he is in a 110 gallon aquarium all alone as he kills any and everything that is put in with him. Yet he refuses to eat these dried shrimp.",
      "rating": 3.0,
      "verified": true,
      "author": "Jcherrish",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "Turtles Love❤ Red Shrimp!",
      "text": "Large amount of Red Shrimp for a low price. My Turtles are in heaven when they get Red Shrimp! Yummy for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Mz.Daniels",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Waste of money",
      "text": "I got this for my turtle. He will not eat it at all. He usually loves shrimp. Just not this shrimp.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great value!",
      "text": "Turtle really likes this! The water gets a little dirty but not bad! Size and flavor the turtle seems to love!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherald W.",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Happy turtle",
      "text": "Good price and since my turtle spends no time at all gobbling them up, I'm thinking they taste pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "A.J.",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "My turtle is addicted",
      "text": "My animal is addicted to these shrimp! My turtle really seems to enjoy this type of food rather then pellets, plus the shrimp are a better source of protein. There is also a lot of shrimp in the container, therefore it lasts for awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Morris",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Stink!",
      "text": "These are very stinky. I've purchased freeze dried before and no stink. These I think may be just dehydrated? Maybe that's why they stink. Now I have a huge container for a single fish that will last forever. I may throw them away. Makes you fingers stink also. He still likes them. That's the only reason for the 2 stars.",
      "rating": 2.0,
      "verified": true,
      "author": "Prime❤️er",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Waste of time",
      "text": "This is an amazing product for your turtle only if they could ship it correctly don’t waste your time two times I have ordered this and then ends up having to get a refund.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Bach",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Turtles love this!",
      "text": "Whenever the turtles see the bottle they get so excited! They love these red shrimp, gobbling them up and sometimes fighting over the pieces. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "My turtles like this",
      "text": "I just wish it did not flake so at the end of the bottle it is just left over pieces. Not the fault of the product just what happens to dried shrimp.",
      "rating": 4.0,
      "verified": true,
      "author": "Babs Rubarb",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Only food my red-eared sliders will eat!",
      "text": "After going through a phase of trying to discover which foods my red-eared sliders would actually eat, I finally found these to be their favorite! They don't need anything other than these. They get super excited when they see the container and can never get enough of it. Great value for the purchase, I have 2 really big sliders and they finish the container in about 2 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Levana Taban",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Turtles devoured these shrimp",
      "text": "My red eared slider turtles devour these shrimp. Nice treat from their usual pellet and veggie diet. Con: the smell is awful More frequent water changes when I feed them the shrimps.",
      "rating": 5.0,
      "verified": true,
      "author": "R Alexander",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Large dried shrimps",
      "text": "My Cichlids love this dried shrimps. Feed them twice a day. Only thing I noticed that the fish cannot eat the shrimp as it is; so I crushed them to pieces and placed in the aquarium. The Shrimps are in an air tight plastic bottle and the packaging is excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "DAVID KALLEL",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Quality treats for my turtles!!",
      "text": "Best treat for my turtles, they never tire of these! Such quality treats for the price, much cheaper than in stores. So much for the price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen Doan",
      "helpful_votes": 4,
      "publication_date": 20161121
    },
    {
      "title": "Great product at a great price.",
      "text": "I've kept Cichlids for years, and this is a must. I currently have a pair of Oscars, and I alternate feeding them dried shrimp and cichlid pellets. I don't know if fish can feel happiness, but they really seem to enjoy the shrimp.",
      "rating": 5.0,
      "verified": true,
      "author": "FROS",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Buy for turtles",
      "text": "I keep a selection of dried foods for my turtle. If she sees me pick up one of these, she tries to get out of the tank to me. Loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Raist",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Delicious",
      "text": "Lol... not that I tasted it myself, but this is literally the first product that I've ever fed the turtles that they leave not a single piece alone. They make sure these shrimp died for a real purpose. It has a strong odor but it's not for me to eat so who am I to complain. Good product. Buying the larger size now that I know the turtles approve.",
      "rating": 5.0,
      "verified": true,
      "author": "Verified Customer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "smelled bad",
      "text": "this food would smelled the house up really bad. Had to throw it out.",
      "rating": 1.0,
      "verified": true,
      "author": "E W.",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Great price but smelly",
      "text": "My turtles love these shrimps but they're really smelly. I've used other dried shrimps before and this one smells the worst. After feeding my turtles and the smell lingers even after closing the cap tightly.",
      "rating": 3.0,
      "verified": true,
      "author": "Msthach",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Sad little shrimp looking at me from beyond :(",
      "text": "My reptilian children love this, but it does smell even when closed. I suggest keeping the bottle in a gallon (high end brand) zip-lock bag. *Note: you may not want to feed these if you have young kids watching.The shrimp have little eyes and I actually cried the first time I fed my reptilians these.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "Turtle loves them",
      "text": "Turtle loves these! Always A good buy and lasts while. Have only one turtle.",
      "rating": 5.0,
      "verified": true,
      "author": "kellie",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "good size shrimp. a little hard but good product.",
      "text": "definitely big shrimp. well, bigger than most. a little to hard for my liking (my pets kinda have to gnawed it more than other shrimp products. be sure to be mindful that these are about 1-2 inches long so if thats too big for you pet, considering a small size shrimp. other than the hardness of the shrimp...its shrimp. what more can one expect. 4 stars. would do 4.5 but that is not an option",
      "rating": 4.0,
      "verified": true,
      "author": "Gustavo Payano",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Highly recommended for aquatic turtles",
      "text": "We love this shrimp. We feed our aquatic turtle this brand. We have had the turtle since a baby, he is now almost 4 years old and has grown to almost his full size.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Cici",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Great product!",
      "text": "Great aroma and quality but my Oscar fish doesn’t like it. He doesn’t like other brands either so lol.. I did break it up and feed to my coney goldfish and they went insane!!! Get it if your fish like river shrimp.",
      "rating": 5.0,
      "verified": true,
      "author": "Vee",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "My turtles will not eat it ☹",
      "text": "I bought this product for my turtles (5) and they will not eat it. I am not sure if it's because the smell is too strong but they refuse to eat it even if avoided feeding them for a few days in hopes that they will cave in and eat it. I ended up caving in and feeding them their regular shrimp. Other than that the package was received on time and it was a great size for the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Lizette Rivas",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "My turtle is a very happy turtle!",
      "text": "My turtle loves this product. She loves it so much she will actually not eat her regular diet food and wait for her shrimp treat. My only complaint is that this is an add on product... so I have to spend $25 before I can even buy it. Sometimes this shrimp is all I need but I still have to find something else to buy so I can buy the shrimp. But still, that is not a complaint about the actual product. I love this product, and so does my Hanna!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Haggerty-Smith",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "Great value. My turtle loves it",
      "text": "Great value. A lot of product for the money you pay. Shrimp is good quality too. My turtle loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Love it",
      "text": "My turtle loves it and won’t eat anything else it last 6 months for me, I have a red slider turtle but that’s for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Awesome price for so much shrimp! (Watch out for the smell though)",
      "text": "My turtles are absolutely obsessed with this food. So obsessed that they refuse to eat their staple food pellets, so I had to wean them off of shrimp xD A bit of a warning: the shrimp have a strong odor that can fill the room when you open it, but you'll get used to it eventually. The turtles definitely don't mind!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Venesky",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Turtle fav",
      "text": "Our son's RES turtle goes crazy for this stuff. Like actively tries to crawl in the container crazy. Ridiculous. So naturally, we'll be buying again. I've never seen a turtle so excited.",
      "rating": 5.0,
      "verified": true,
      "author": "Cierra",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Turtle loves this Dried Red Shrimp",
      "text": "Our Turtle loves this Dried Red Shrimp, this is the first time we try this product .",
      "rating": 5.0,
      "verified": true,
      "author": "spencer douglas",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "My turtle loves these",
      "text": "My red eared slider enjoys these so much that she knows when I am about to feed her and she just opens her little mouth and noms on the shrimp. These are a great size, not too big and not too small either. It does have a stronger shrimp smell from other products I have bought, but I just think it makes it much more fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Barby0104",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Good value",
      "text": "The turtles love these shrimp. Good price. Arrived on time",
      "rating": 5.0,
      "verified": true,
      "author": "Frances E. Briani",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Great turtle treats!",
      "text": "I just love watching my little red eared sliders go nuts over these treats! The shrimp are large enough for hand feeding. One great thing about this product is that the shrimp are largely intact, even after shipping. Other dried shrimp products I have tried have at least 1/4 crumbled shrimp at the bottom that is useless for big turtles and just makes the tank a mess. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20130627
    },
    {
      "title": "My turtle loves them",
      "text": "Arrived on time, product was as expected, and my red ear slider is addicted to these shrimp. A little pricey but better than in the local pet stores.",
      "rating": 4.0,
      "verified": true,
      "author": "Deb Shinder",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "WATER TURTLES LOVE IT!",
      "text": "My water turtles (painted/red earred slider) love this shrimp. I switch off every other feeding with this. Have been using this for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Augustyn",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Smells odd to me",
      "text": "My turtle wont eat it unless he starved a whole day.",
      "rating": 1.0,
      "verified": true,
      "author": "Frankly",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "It’s whole body shrimp",
      "text": "my larger tropical fish like it much always in theier diet daily",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Calcagno",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Tiny!!!!!",
      "text": "I meant to get 5 oz not .5 oz. not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "KAREN ROX :)",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Turtle crack",
      "text": "Turtle loves them, he pokes at his normal food but if you put a few of these in they disappear instantly. They do however have a stronger odor than any previous brand of shrimp I've used, so I'm always hearing the cats knocking the bottle on the floor and batting it around in the middle of the night.",
      "rating": 4.0,
      "verified": true,
      "author": "Weaselball",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Great treat for turtles.",
      "text": "My turtle love these things amazon always has the best price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mudlife",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Turtles Flip Out for this!",
      "text": "My turtles go crazy over this! I've also bought it as gift for other turtle owners who also rave about how their turtles go wild! Nor sure why they like it compared to pellet food, but they are sure disappointed if they don't get their shrimp!",
      "rating": 5.0,
      "verified": true,
      "author": "Jolene Sugarbaker",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "Great! Turtles Love Them!",
      "text": "My baby turtles love these! I call them the \"Smelly Shrimps\" (They do smell) but my turtles just eat these up so i just feed them when I'm leaving for school so i don't have to smell them and the turtles still get to enjoy their shrimps!",
      "rating": 5.0,
      "verified": true,
      "author": "H and the J's",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "They ARE big",
      "text": "These are large...about 1 inch in length. And really smell fishy - I guess that is a good thing. Red Eared Slider really enjoys them. I put 2 or 3 in the tank each day.",
      "rating": 5.0,
      "verified": true,
      "author": "judyTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Well worth the price",
      "text": "Well worth the price! You get large amount. I have african clawed frogs and a blood parrot. The frogs loved them. Blood parrot not so much",
      "rating": 5.0,
      "verified": true,
      "author": "Mitchell Martin",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "My read eared slider turtle likes these. She gobbles them up.",
      "text": "I have a good-size slider and she has a good appetite. She gets food sticks, tubifex worms, raw shrimp and dried crickets. I added this product to her diet and she went after them right away and quickly gobbled them up. The value is good as even with a larger turtle there is plenty of shrimp to last a while. No odor either. I will buy more to have on hand as I like to offer her a variety of foods and she likes this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Garden Lady",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "Nope",
      "text": "Don't buy them. They changed something in the processing and they smell strongly of ammonia. My turtles won't eat them. Total waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaybird",
      "helpful_votes": 0,
      "publication_date": 20180514
    }
  ],
  "product_meta": {
    "title": "Royal Pet Supplies Inc Zoo Med Sun Dried Large Red Shrimp",
    "description": "Size:10-OunceZoo Meds Large Sun-Dried Red Shrimp are an excellent high-quality, protein rich food ideal for large aquatic turtles and large size freshwater or marine aquarium fish and invertebrates. Fish and turtles typically show an increase in weight and vigor within only a few days of feeding. Whether used as a staple food or an occasional treat, Zoo Meds Sun-Dried Red Shrimp provide a nutritional boost to any feeding regimen.",
    "rating": 4.7,
    "feature_bullets": [
      "For all aquatic turtles",
      "High protein",
      "Can be used as a staple food or treat"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "9.21 x 7.6 x 3.39 inches; 8.16 Ounces",
      "Date First Available": "March 29, 2017",
      "Manufacturer": "Zoo Med",
      "ASIN": "B01NARX4LL",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Food",
      "Pet Supplies",
      "Fish & Aquatic Pets"
    ],
    "price": 20.64
  }
}