{
  "website_summaries": [
    {
      "verdict": "Real leather dip belt with heavy-duty parts that will give you an excellent longevity.",
      "pros": [
        "Uses a comfortable level of padding in the areas of the hips to ensure the belt doesn't dig into your body",
        "Weight strap can hold up to 270 pounds",
        "Uses a metal buckle to ensure the belt stays in place, even during long workout sessions",
        "Nicer-looking design than many dip belts"
      ],
      "cons": [
        "Metal D-ring parts on the belt occasionally give out or bend under stress"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great quality",
      "text": "This is great for that extra push i needed been doing bodybuilding for sometime now and have always wanted a sterdy and sleek dip belt ive used so many in my times but this 1 is top notch i highly recommend to anyone that needs to push their limits. The belt is comfy and doesnt bother your lowerback or sides once you load up the extra weight the rope to attach the weights looks like it can hold a couple hundred pounds havent tested that much weight on it yet just a plate. This belt looks like it will last me some time by looking at the quality",
      "rating": 5.0,
      "verified": true,
      "author": "Willy J. Rodriguez",
      "helpful_votes": 24,
      "publication_date": 20180818
    },
    {
      "title": "it is strong and comfortable. The only recommendation I would make is to ...",
      "text": "This is a high quality belt, it is strong and comfortable. The only recommendation I would make is to make the strap which goes through the buckle in the front a bit longer. Maybe about 6 inches longer. If you have a 34-36 inch waist, then the length of the strap is fine. But I have a 38-40 inch waist and there was barely enough strap to go through the buckle and get the belt closed properly. Some of us that like to lift do not have a small waist. Beyond that, this is a very nice belt.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 3,
      "publication_date": 20180505
    },
    {
      "title": "YOU CAN KEEP SQUATTING !!!",
      "text": "I am using this belt for squats. Can’t do the traditional kind because my back is wussing out on me. Just stand on platforms and perform squats while hanging the plates between my legs. Legs still get a workout and the weight doesn’t affect my back. Don’t know how much weight the strap can take. Up to 3 plates now so, we will see. Belt is really sturdy strap is also. I’m just used to chains. The strap is grippy so the plates don’t slide around. That’s nice.",
      "rating": 5.0,
      "verified": true,
      "author": "murrtown",
      "helpful_votes": 3,
      "publication_date": 20190227
    },
    {
      "title": "Almost perfect",
      "text": "I really like this belt as it has good padding and seems like it's put together well. I also like the fact that it's a strap and not a chain so you are going to beat things up with it. The one change I wish it had that would make it perfect is if there were multiple loops in the strap so you could adjust the length that the weight hangs at. It's not a huge deal for me but may be more of a problem for shorter people.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Well made but strap is waaaaay too long",
      "text": "The belt seems durable and well made, and finally allowed me to get back to doing dips and weighted pull-ups at the gym. But the strap that holds the weights isn't adjustable and is way too long. Most belts have the weight hanging just above my knee height. This one is nearly on the floor. With that, the movement feels more awkward.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. R. Fitt",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "guess i got the wrong size. also, MAKE SURE IT DRIES CORRECTLY",
      "text": "i wish there was something in the description that said \"if you are size 30-32 waist, get this size... i didn't notice being able to choose a size. maybe it was just me at order. got it, and tightened ALL the way.... was not tight. also, i thought i was drying it out correctly, but apparently not because white, fuzzy mold started to grow on it. it could just be that it's humid in Korea, but i'm sure this has been purchase for SEC country in those humid states... probs just my experience with this product. won't buy again, but i wouldn't tell someone not to buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Yeam",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Description of sizing is an absolute lie",
      "text": "I have a 36in waist and this thing barely fit. I was able to loop the band through the belt-mechanism but about an inch, but because it was so short it took quite a bit of time to get it through just right. If you had a 38in+ waist you would be completely out of luck. Not sure how they can possible say that its a one-size-fits-all. Absolutely false. The construction seemed fine, but I bought it based on their description which could not be further from the truth. Buyer beware.",
      "rating": 2.0,
      "verified": true,
      "author": "CGriesemer",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Great belt...if your waist size is 36 or under",
      "text": "If your waist size is above a 36, then this is not the dip belt for you. There is almost not excess belt material and a 40 is about all you're going to get out of this at most. I wish they made an XL version of this belt for bigger waists. Otherwise it's a fantastic belt. Very comfortable once I was able to get it on (barely) and the way it's constructed keeps the weight from crushing my thighs like my old chain belt did. It's also far easier to get the weights on and off due to keeping the belt itself on and using the strap to load with plates instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr Big",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Very well built",
      "text": "This is a very well built belt, I also own the 4Inch lifting belt and love it. The leather material is the same as their lifting belt, but has the benefit of having extra padding added to the inside so it's not digging into your sides during the dip. The loop belt is very sturdy and stays in place, I really like that they have the middle buckle sliding to allow for easy adjustments when you tug to either loosen or tighten the belt. Stays in place and holds weight without any adjustments needed mid-lift. Really happy with this purchase, this seems like a way more expensive belt than what I paid for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Hayden",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Most Bang for My Buck",
      "text": "This belt will easily last me for years, maybe even decades because of the lifetime warranty. I like that when I put it on, I can focus on doing my dips or pullups without thinking about how uncomfortable the belt feels around my waist with added weight. It's also easy to use. Do yourself a favor and don't skimp out on a cheap nylon belt that will break in a couple months, or splurge on some leather monstrosity. Dark Iron Fitness has made an affordable high-quality product worth all the 5 stars I've rated it with.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Dark iron fitness never disappoints",
      "text": "Time and time again dark iron fitness comes through with high quality products. I already own their weight lifting belt and was extremely happy with the quality so I knew the dip belt would not disappoint. The strap for the weights will support kettlebells and or 2” Olympic plates. Standard plates won’t work unless they are those with handles. During a workout the belt was comfortable and didn’t dig into the hips thanks to the padding. The great thing about all their merchandise is that it is all covered under a lifetime warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuriy S",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Does not work for larger lifters, no disclaimer on product page.",
      "text": "I sit ~240lbs, roughly 38\" mid section and I have large hands. The belt with strap is approx. 48\" long. Anyone with a waist of 38\" or more might have trouble with this belt because you need a good 8-10\" of strap to tighten it properly. I really wanted to love this belt, the build quality seems great, but there really should be an option for larger people or at least a disclaimer that it won't work above a certain waist size.",
      "rating": 1.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Quality construction and comfortable belt",
      "text": "I have been using the dip belt for doing weighted Chin-ups and weighted Dips. This has helped with my strength gains. It is so comfortable and much easier than trying to balance dumbbells with your legs. The old way of adding weights to your exercise (using the dumbbells) was very uncomfortable and took the focus off of the actual exercise that I was trying to perform. As a result, you can actually use more weight without any concerns about it slipping. The quality of the construction is very high and very sturdy even as I have been adding more plates to my lifts. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen A Tarantino",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Awesome product.",
      "text": "Have used a lot of dip belts in different gyms for many years. Decided to set up a home gym when everything closed down this year due to covid. For sure wanted to get a dip belt for weighted pull-ups and dips. Went with this one. It is comfortable, the material it’s constructed of is heavy duty the strap in place of the usual chains is great, the plates aren’t slipping around and I’m not getting pinched by chain. This is a great product will be buying from these guys again for sure for other accessories. Plus a lifetime replacement warranty!?! Hell yeah. Registration of belt was super easy too. Buy it. You won’t regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuy",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Best belt out there",
      "text": "I’ve tried many dip belts and this one is perfect. It has a buckle so you can tighten it. It has a fabric strap that is stronger than most chains. I have loaded over 100lbs and it hasn’t let me down. It has padding lined inside the entire belt so it is very comfortable. Unless you want to use chains cause it makes you feel manly, go to the hardware store and spend more money on a steel chain. Most give you aluminum. If you’re looking for a great belt at a decent price. Do yourself a favor and get this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Amazing product",
      "text": "Very high end product. One of the most comfortable and well designed dip belts I've ever used. Excellent quality at a ridiculously low price for what you're getting. Mine is used by multiple people several days a week under heavy loads and has held up perfectly without any real signs of wear or tear. My ONLY complaint is that the placement of the attachments doesn't make it a good belt for belt squats as the attachment will ride against the quads, but that doesn't apply to dips or chin ups whatsoever.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan Wade",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Quality belt",
      "text": "I bought this for my wife actually. She has neck and back issues so she can’t really back squat. I got this so she can do belt squat with a landmine or our cable machine. She hasn’t used it yet, but I’ve tested is out. Works great for that. The rope is a tad long for use with the landmine, but that’s an easy fix. The belt has a lot of padding, so it’s comfortable. It also appears to be made well. I don’t think you can go wrong with this belt.",
      "rating": 5.0,
      "verified": true,
      "author": "ryon thornton",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Hard to use with only one carabiner.",
      "text": "I thought this was supposed to come with two carabiners. Mine came with one which I tried to make due with but it’s such a hassle to do that. Otherwise, it feels very durable and like it would last. I will probably just buy another carabiner whenever I get the chance but it’s just a poor experience having such a seemingly small part of my order missing making this otherwise quality product an annoyance. Not sure where the responsibility of the mistake lies.",
      "rating": 2.0,
      "verified": true,
      "author": "Hassan S. Suboh",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great addition to my workout routine!",
      "text": "This is a great dip belt! I use it for doing weighted pull-ups. So, I am only adding about 30 pounds to it at the moment. This belt is very comfortable. The strap prevents the weights from sliding around. The belt is easy to adjust, and it does not loosen when worn. I have a 32\" inch waist. The belt fits me fine, but it does not seem like it would fit people a lot bigger than me which seems kind of weird.",
      "rating": 5.0,
      "verified": true,
      "author": "KfillyTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "My new favorites weight belt",
      "text": "Dark Iron keeps coming out with top notch products. I already have their lifting belt and gloves and ankle straps and eagerly anticipate new products. Like the other products, this one really shines. My previous dip belt from Kinobody had the strap running from the back to the front. That meant that the weight plate wanted to twist between your legs. That never made sense for me, and was really irritating. This Dark Iron belt hangs the weight from the front so that the weight plate comfortable fits between my knees. Not only is it well made, but the belt is comfortable. Definitely worth getting over the other dip belts on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "RSG",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Great construction, super strong",
      "text": "Product came as expected. I use it for weighted dips and pull ups. No problem holding the weights I'm pulling and good positioning of the harness. It's a bit bulkier than I like and skinned my hands during dips. So now I modified my form to keep my arms a bit farther out. A tip for people using it in a routine, you can just unclip the weight to do a different exercise (keep the belt on). It's a pain to take the belt on and off, but that's what helps keep it on!",
      "rating": 4.0,
      "verified": true,
      "author": "Coleman",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Terrible workout, but awesome product!",
      "text": "This belt is attached to one of my least favorite workouts. That being said, even with some weight just hanging there, the settled-in leather kept its form and did not feel like there was any undue pressure around my waist. I am used to the rawhide and chain setup; so this almost feels luxurious, but without pawning off my first-born for such an experience. I am around a 36” waist, and this fit quite comfortably. Like any leather product though, allow for some break-in time before going 6 plates deep!",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory & Kristina",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "It's easy to do dips but...",
      "text": "...it's hard to find a good leather dip belt. If your like me you can do body weight dips 'till the cows come home so if you really want to get those triceps to grow you have to add weight and the Dark Iron Fitness Dip Belt makes that easy. I'd like to see them come out with a weighted vest so I can add additional weight for other activities/exercises ; )",
      "rating": 5.0,
      "verified": true,
      "author": "DresdenSinn",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Sturdy leather belt with a padding around the inside sewn in.",
      "text": "Everything feels very sturdy and good quality. The belt is leather and thick. There's a soft fabric holding the padding on the inside that touches your waist. The padding is not inside the leather, inside just means the side that touches your body. There's 1 clip on each side to hold the cable/strap that holds the weights. See the pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "D-DUB",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Really like this belt",
      "text": "This belt is great. The stitching and materials are durable and high quality. I use this mainly for standing and donkey calf raises and it works really well, but I imagine it'd be great for weighted dips and chin ups too. Weight strap is long enough to fish through the center of 45's without bringing the plate way up near your delicate parts.",
      "rating": 5.0,
      "verified": true,
      "author": "S.B.",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "a good weight belt",
      "text": "I like this belt. The only changes I would make is to have the connection points a little closer to the front, and the waist belt's length is just a tad shorter than I'd like (can be sorta fidgety to get it into the buckle; my waist is 36). It's super comfortable and I don't get any hot spots on my hips when I'm using it. I'm going to replace the fabric loop with an actual chain at some point because the heavy-duty fabric sorta rasps my skin, but it is sturdy as heck & can sure hold a lot of weight. I don't go to the gym without this belt. I'd definitely recommend this belt.",
      "rating": 5.0,
      "verified": true,
      "author": "Ja Lan",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "So far so good",
      "text": "I've been using for about five weeks, mostly for weighted pullups. Works great. Easy to take on/off and I like that it has the feature to more securely tighten it around my waist. I had minor concerns that not having a chain might be less durable, but so far it is holding up beautifully. As a bonus, it doesn't scratch up my plates.",
      "rating": 5.0,
      "verified": true,
      "author": "Nolan Collins",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "high quality, customer service and warranty",
      "text": "Honestly bang for the buck this is the best weighted dip belt I have ever purchased. I hate the chain style ones makes so much noise and heavier when carrying in my backpack. The nylon strap to hold the weights are super strong and light weight. I have recommended this belt to many people at my gym and I continually see more people sporting the belt. Customer service is awesome, I lost the metal piece that holds the belt tight and they sent me a brand new belt, talk about life time warranty! I would highly recommend this to anyone looking for a dip belt you won’t be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Karissa Chin",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "So far so good, I've used the belt a couple times and ...",
      "text": "So far so good, I've used the belt a couple times and it's solid. However, the belt strap has got loose once or twice. Maybe the design of the locking mechanism? It startles me a bit but hasn't slipped completely off. I'm also thinking it could be the belt positioning itself to my hip. As I go up in weight, I'll continue to monitor the belt strap and report back. Would hate for it to suddenly become undone mid dip or pull up, but I don't think that'll happen any time soon. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Phigeta439",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Worth the money",
      "text": "All of my lifting support equipment is Dark Iron. They have a phenomenal customer service program and like to ensure customers are pleased with their product. The product itself is padded more than any other weight belt I've owned, which is awesome for dips. Additionally there is no chain so there is less damage to rubber coated weights by the chain. Best dip/pull-up belt I've ever touched.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Premium Dip and Pullup Belt!",
      "text": "I have been lifting weights for over 25 years and this is one of the most comfortable dip belt I have ever used. I first purchased the Dark Iron weight belt a while ago, so if figured the dip belt had to be as good if not better than that. I would highly recommend this belt, it doesn't have any break in time like the lifting belt. I had over 100#'s on it and didn't feel uncomfortable or weak. I would definitely purchase this belt again.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikenedge",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Outstanding Dip Belt!",
      "text": "This is exactly what I needed. The belt has excellent build quality, it's tough but comfortable. I use it for dips and pull-ups. For dips I've used it with 100 pounds and the belt holds very well. Nothing looks like it's going to tear, carabiners and the metal clips did not bend or lose their shape. The belt looks good, feels good and most importantly, holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose R",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Not screwing around...",
      "text": "I was impressed with the build quality of this dip belt. It seems like it will be indestructable in normal gym use. It is very comfortable to wear and easy to use. I think it may be overkill for most people that probably can get by with just one of those cheap leather/chain belts. When I wear it I feel like I'm about to go rock climbing or repelling. If you want people to know that you mean business...it's worth every penny. ;)",
      "rating": 5.0,
      "verified": true,
      "author": "J.M.K.",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "its ok",
      "text": "So far so good...as a dip belt. Today i went to use it and noticed the strap that hugged my waist was odd. The slide bar within the buckle was missing. This belt has been in my gym bag while i nursed an injury so ive not used it in a couple months. That said, the belt has never left my bag and through travels, this slide bar, which hugs the waist strap in place just...fell.off? Im not going through earthquakes or hurricanes over here, so how does it fall off?",
      "rating": 3.0,
      "verified": true,
      "author": "N. TROVATO",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "Not big enough for 38-40",
      "text": "They wrote in the description this goes up to size 40 waistline. The one I received was closer to size 36. I sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "greg galyean",
      "helpful_votes": 2,
      "publication_date": 20190703
    },
    {
      "title": "first dip belt but last dip belt!",
      "text": "It is super comfortable and is very well constructed. but beware make sure you have Olympic sized weights before you get this though because the strap does not fit standard homeowner weights other than that you should be good to go. Also the price to quality ratio is very impressive only payed 30$ which is a knock your socks off deal. would highly recommend this item for pull-ups, dips, and strength training!",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Sisu",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Great weight belt that offers tremendous value",
      "text": "This is my third Dark Iron product purchase and I must say they offer a lot of quality for the price! Their wrist wraps are my all time favorite (and I've used a lot of wrist wraps). I needed a weight belt for dips and looked to Dark Iron Fitness and they did not disappoint. Easy to use and very comfortable. Quality materials that should last a very long time. Thanks again Dark Iron...I'm sure I'll be back for something else.",
      "rating": 5.0,
      "verified": true,
      "author": "A. G.",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "A fantastic belt, almost perfect",
      "text": "I bought a cheaper weighted belt. That was a mistake, I immediately returned it. I have a few products from this company and the quality is always superior. The only knock would be the nylon/rope to attached the weight could be a little longer. I think it's a little short for some of us taller folks...",
      "rating": 4.0,
      "verified": true,
      "author": "The Grier Family",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Love this dip belt!",
      "text": "This thing is awesome! I'm used to using the leather ones with chains on it that cause you to lean forward at the waist to keep it from sliding down. Not a problem with this one! There is ample padding that when you tighten down the belt it doesn't slip in the least. They sewed rubber into the straps as well which helps keep the weights from slipping around as you move. The leather is there mainly for comfort, the weight is spread out functionally across nylon webbing, which gives it great strength. A lot of though went into improving the dip belt that resulted in this product. This is top notch!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi's Family",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Excellent belt for dips or pull ups..",
      "text": "I can't say enough good things about this Dip Belt. The belt is extremely easy to use and very comfortable around your waist. The quick release spring clips make it easy to put the weight on or take it off. Since the belt is strapped on, no more readjusting every time you put the weight on. You can concentrate on doing the exercise and not worry about keeping the belt in place. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee N Tutt",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Padded and adjustbale support.",
      "text": "The unit has a heavy duty leather outer belt with a nice pad on the inside. You put the belt on, cinch it to your liking, then attach the weight with the included strap and carabiner. Ive used the traditional style often in the past and you have to be very careful with the chain around your clothing and skin. This design eliminates that safety issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian C Anderson",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Does exactly what it's supposed to and is comfortable and easy to use",
      "text": "It's a dip belt. The ONLY thing I wish was that there were multiple attachment points for the strap so that I could shorten the hanging length as needed - more like a chain in that regard. I've somewhat worked around that by looping the strap through twice though this is an extra inconvenience.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew DeNardo",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great belt with minor issues",
      "text": "I prefer using this belt whenever I'm doing weighted lifts over the belts at my gym. The cushion on the belt is extremely comfortable and the strap to hold the weight seems durable. My issues are with the belt buckle part and the length of the strap. The metal insert that you thread the belt between sometimes falls out. It's not hard to put it back in but is annoying when it happens. The strap is very long. I'm 5'10\" and I have to put the strap thru one of the D rings before I put a weight on it instead of just going thru the weight. Not a big issue just got minor annoyance.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel E.",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "What a great product",
      "text": "Immediately upon opening the package I was impressed how durable it is compared to others out there. It is so impressive with its design and sturdiness that as my 1st dip belt ever I dont feel the need to have to look elsewhere. I researched many and read reviews and chose this as my 1st belt and boy am I glad I did. From the look and feel you can tell it will last and handle some weight. Good Job Dark Iron",
      "rating": 5.0,
      "verified": true,
      "author": "yancy oropesa",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Nice addition to my covid gym",
      "text": "A weight belt is essential for any home gym and I like this one. Great for dips and weighted pull ups. Wasn't sure how the nylon strap would hold up, but no signs of stress with 120 pounds hanging from it. The padded belt seemed unnecessary but it does feel more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "a beast of a dip belt",
      "text": "This thing is make of thick leather as advertised, the padding makes it comfortable to ware. It is pretty much the best gym accessory I've purchased to date. I am knocking off one star because of the strap where it connects the belt together is beginning to fray after 2 months of use. It makes putting on the belt more difficult if the fray continues. I would recommend add a leather tip to prevent the fraying.",
      "rating": 4.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Great quality and value",
      "text": "I had shoulder surgery but still wanted to be able to lift weight. I hung the weight from the belt and was able to get a great leg session in. Holds tight enough on my waist and doesn't loosen up even with added weight. Good construction, is holding up great with lots of use. Great value",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Best belt money can buy !!",
      "text": "I was looking for a belt to up my game in tricep dips, and as I have other products from Dark Iron Fitness, I decided to purchase their dip belt as well. It is built solidly, and extremely comfortable, and as the belt was broken in, it became even more comfortable. My triceps have gotten tremendously stronger with this belt, and it beats trying to hold a dumbell between my feet. The only knock I have is that the belt part that goes through the loop could be a little longer. My waist is 38” and I think anything over 42” would be a real struggle to put on.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt Z",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Best Belt and Company Out There",
      "text": "I'm quickly becoming a fan of Dark Iron Fitness products. I'm actually disappointed that I bought a few similar items from other companies before finding out about them! This belt is extremely durable and comfortable, and easy to use. It adjusts to any size quite easily, and doesn't rub or chafe like a lot of cheaper belts do. I am also confident that it is going to last longer than my body can actually still use it! Couldn't recommend this company, and this product, any more than I already do. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Watson",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Top Quality Product for a good price",
      "text": "This is a top quality dip belt, well constructed and durable and comfortable. Unfortunately it is too small for me, apparently people of larger girth don't use dip belts! LOL. I suggest waist size of 42-44 may be the max for the belt. However my loss is my wife's gain and she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Liberty4All",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Buy it!",
      "text": "Very well made belt, perfect length on the weight holding strap. Fits well, easy to put it on. Easy to feed the weights onto it. If you are looking for a comfortable high quality dip/pull up weighted belt, this is the one to buy. The weights don't drag the floor nor do they smash your groin from being to high up.",
      "rating": 5.0,
      "verified": true,
      "author": "Artfuldodger2134",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "This added weight belt for Sparta!!!",
      "text": "This belt is diesel! It’s only used to add weight it is not a support belt. So if you need to add some weight for dips or chin ups this belt is the shiznit! Plus I get lots of looks at the gym like “where’d he get that?” I love using it. It would easily hold 4-5 plate load with slack if you feel you need that kind of weight added.",
      "rating": 5.0,
      "verified": true,
      "author": "coloradopete42",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Excellent dip belt.",
      "text": "This belt is made of super high quality materials. The leather is beautiful, the cushion on the inside is soft and the rope is very strong. I will never go back to a chain dip belt. I did change the hooks because I felt the original ones were not wide enough. Other than that it's almost perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Best Dip Belt",
      "text": "This dip belt oozes quality and does the job with a cloth band instead of a chain, which means no chain marks on my legs from doing weighted dips. Plus the wide belt part is padded and super comfortable, along with a securely locking buckle and thinner belt attachment. A great find. Buy it before it disappears!",
      "rating": 5.0,
      "verified": true,
      "author": "Dirk Diggler",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Good Dip/Pullup Belt",
      "text": "This is much more comfortable than some of the other belts out there. Definitely feels strong and I like the build. A little bit of a hassle to get the rope into the clasp but otherwise works fine. Haven't used more than 50 lbs but I feel like it could hold up to 100lbs no problem",
      "rating": 5.0,
      "verified": true,
      "author": "Wanhope",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Comfortable and sturdy dip belt!",
      "text": "This dip belt is great! The inside of the belt is lined with a soft cushion to keep it comfortable. I use mine for dips and don't have any issues with it sliding on my back or slipping off. The strap can easily hold two 45lb plates, and I'm sure it can hold much more, although I haven't tested the 6 plate claim. The strap is long enough that it doesn't get in my way or disturb me, and the loops can fit nicely through 2\" plates. Definitely recommend investing in one of these if you're tired of doing bodyweight dips/pull-ups or want to upgrade your current belt!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Perez",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Careful of the sizing.",
      "text": "I have a 38 inch waist and about a 36\" hip measurement. This belt was FAR too small. It was impossible to get it on. Really too bad as it seemed like a very good quality belt. If your waist size is over 36\" you'll never get this to fit. At 36\".....It will be tough to do.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Could use more padding on the top",
      "text": "It's a good weight belt, definitely does the job but the padding doesn't extend up to the edge of the belt and as a result it digs into you when you've got serious weight on there. It's not unbearable but having the padding extend up and maybe over the top would've been a really nice feature.",
      "rating": 4.0,
      "verified": true,
      "author": "Proto",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "One size DOES NOT fit all.",
      "text": "One size fits all most be a joke. I have a 36 inch waist and it's a struggle to get it on. It's very well built and if you have a 32 inch or less waist you'll love it. Why they couldn't have added 6 inches to the waist fastener is a mystery to me but until they do they should say \"one size fits all as long as you're a medium or under.\"",
      "rating": 2.0,
      "verified": true,
      "author": "william grocke",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Blown away!! Great product, great price!",
      "text": "Just received my weight lifting dip belt and could not wait to use it and it did not disappoint!! The belt is very nicely made with high quality leather and stitching on the outside and a very cushioned suede on the inside about 1/4 inch thick. All of the hardware on this belt seems to be very high quality and I do not see if breaking or wearing down anytime soon so I can see my self getting many years of service out of this belt.",
      "rating": 5.0,
      "verified": true,
      "author": "LA22",
      "helpful_votes": 2,
      "publication_date": 20170523
    },
    {
      "title": "Amazing dip belt and pull up weight belt",
      "text": "Hands down the best thought out dip belt I have ever used. It is sturdy in it's construction and with the duel carabiner design it centers the weight very well. Although I would prefer the center belt be slightly longer, the weight being close to your body allows more center control and keeps the weight more centered for easier control. Overall I would highly recommend this product in the gym. Well worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Best Dip/Pullup Belt EVER",
      "text": "I have a slim waistline, 31-32\" and normal dip belts were always a pain to keep from falling off when weighted up. They would also dig into the hips and cause discomfort. This belt solves both those problems - it's got a soft cushioned padding and it secures all the way around your waist so there is no worry about it sliding or falling down. It's a little more expensive than a regular dip belt, and worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Superior quality. End of story",
      "text": "First review I ever made, forgive me for my mistakes but this product deserves a ovation. The Weight Belt is far superior to others. You’re paying a slight premium compared to their brands but it’s definitely worth. Interior of the belt is padded and feels very comfortable even with slinging heavy weight. With other brands I usually have to worry about pinching in my crotch area which is very painful, but the way these belts are designed eliminate that problem all together. I even got a email thanking me for the purchase from the company. Would 100% purchase again, hoping the product will last as I’ve not had it for a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Tran",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Quality Product, Quality Customer Service",
      "text": "This is the second product I've bought from Dark Iron Fitness. What made me come back? Besides the excellent customer service, their products are well-made. From the minute I opened up the package and pulled the belt out, that statement sill stands true. Smooth and sturdy. It looks like it will last. I expect it to. And in case it doesn't, I know that the company will reimburse me with a brand new one. As for the belt itself, I've never used one before so I have nothing to compare it to. All I know is that it works, and that's all that matters.",
      "rating": 5.0,
      "verified": true,
      "author": "pi",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Must have for lifters",
      "text": "As someone who has been in the fitness industry for many years and an experienced lifter, I can honestly say, that this belt is not only of great quality, but also a great price. A must have for anyone trying to gain strength through increasing their resistance during body weight exercises.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy and Daddy",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Very pleased. Good stuff.",
      "text": "The package arrived very quickly and the item exceeds my expectations. I usually train with a chain style belt at my club and needed another one for home workouts. This belt is extremely comfortable as it has padding almost the entire length. Another plus is the weight strap attaches above the hips instead of at the centerline as with most chain belts. The workmanship is very nice and the logo is really cool.",
      "rating": 5.0,
      "verified": true,
      "author": "21 15 9",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Doesn’t fit us thicc lifters. Even fat people might be strong enough to for weighted pull ups.",
      "text": "Good solid construction, the right amount of padding, and a good price. My problem is that the strap connecting the front of the belt is short. The description says the belt will fit anyone. I’m big, but not massive. Even fat people may be strong enough for weighted pull ups or dips. The belt still works since I can still hang the weight off of it, but it would be nice if the front strap closing the belt was just a tiny bit longer.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike Meskel",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Top Quality Product",
      "text": "I've been using this belt consistently for a while now and it still shows little to no sign of wear and tear. Using it for weighted pull ups and weighted dips from low to high amounts of weight. It is definitely the most comfortable weight belt I've had the pleasure of using. The cushion isn't stiff enough to dig into your sides or back, but it is stiff enough to give you comfortable support. overall, I just love this belt and have had a lot of good comments about this belt and people love using it. Hopefully they will purchase one themselves to help further the brand. This is my go to brand now for weight lifting gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt B.",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Durability problems",
      "text": "I received this item today. First load with 40lbs caused the stitching securing the left steel ring to start separating. Thought about just returning for a replacement, but upon further inspection I found the \"Made in China\" label. Not interested in rolling the dice again with Chinese quality control. The belt is otherwise very comfortable and seems well designed for its intended purpose. If the stitching held together, I'm sure it would be a great product, which is why I give 2 stars instead of 1. As it stands, I'll be returning this and buying a Rogue dip belt, which is made in the USA and will not have this sort of issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Comfy and functional!",
      "text": "This belt is really comfortably and sits perfectly on my waist. It's easy to adjust and the padding feels nice. We will see how it hold up! I have this company's squat belt and it's held up to the test though! I'm really happy they came out with this. The strap to hold the weights is super strong and long enough to adjust the height of the weights easily. I highly recommend putting your money toward this instead of the higher costing belts. It's not worth it, and yes I've used them. Dark iron fitness also has great customer service and I enjoy dealing with them.",
      "rating": 5.0,
      "verified": true,
      "author": "WillAT12",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "High quality belt awesome price, top notch customer service!",
      "text": "Excellent belt. High quality stitching and craftsmanship. Customer service is top notch. I had an issue with the spring clips missing from my order and Alan one of the owners at Dark Iron Fitness personally took care of it and got me the clips no questions asked. He also checked back with me to make sure evehthing was all good. This kind of excellent customer service is rare these days. I’m glad I didn’t mess around with any other belts and you shouldn’t either. These guys rock!",
      "rating": 5.0,
      "verified": true,
      "author": "Dillan James",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Extremely comfortable",
      "text": "You would think carrying weight attached to your waist as uncomfortable, but the Dark Iron Fitness Leather Weight Lifting Dip Belt feels very comfortable, secure and stable. I am pretty sure I will reach the limit of what I can handle before the belt does. I only gave 4 stars on sturdiness, because I haven't used or owned the belt very long so I can't judge how long it will last. The construction does look like good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas M",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Comfortable even for skinny guys",
      "text": "This belt is awesome! I have used it for dips and pull-ups and it's very comfortable doing both. I have already seen an improvement in my lats and chest since buying this belt 2 months ago. I've used as much as 90lbs so far and even though I'm a skinny-waisted guy, this thing is still comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "broxhouse",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "High Quality",
      "text": "Very good quality product. I’ve used a chain style belt in the past but it eventually broke where the chain attached to the belt. Due to design of this belt, I don’t foresee that being a problem. The inside is padded which is nice for heavy weights. The belt does hang a little lower than I’d like but I solved that problem by running it back across my waist and attaching both ends to the same ring. That becomes a little inconvenient if you want to take the weight off between sets. All-in-all though, a very nice and comfortable belt even when loaded with a lot of weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Myles B.",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Great quality, comfortable",
      "text": "I would like to echo the good reviews of this weighted dip belt. Very comfortable and easy to use. I would buy it again. Glad I spent a little more on this one instead of competitors. Pretty sure it has a lifetime warranty too.",
      "rating": 5.0,
      "verified": true,
      "author": "pinwheelsunshine",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Fastener strap too Short for Big Guys",
      "text": "Looks like a Fantastic Belt but for me I have to return it. The fastener belt strap is too short. Not every lifter has a 34 or 36 inch waist. If the fastener belt strap was 4-6 inches longer ... I could use this belt. Sorry to send it back. It looks of Fine Quality. Only problem I see is sizing.",
      "rating": 4.0,
      "verified": true,
      "author": "dfigz",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Workmen ship first class",
      "text": "Compared to the normal dip belt dark knight fitness quality is night to day better it’s comfortable really well made and more functional I like two features first you can secure it around your waist via strap, second the loop is leather not a chain and a bit longer to add more weights I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Crsreb",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Well designed and constructed",
      "text": "Spend the extra $10 to get this belt. You won’t regret it. The belt is very well constructed and designed. This belt can be adjusted to fit your waist which means it stays on you when you are adding/removing weights. Some other belts that have chains simply “hang” off of your hips and are cumbersome to add/remove weights from. If you are going back and forth between buying this belt or a cheaper one, stop, and buy this belt.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Quality",
      "text": "I was extremely impressed with the quality of the belt! I didn’t buy if for dips, I bought it to do squats with cause my lower back doesn’t tolerate the regular squats anymore. Couldn’t wait to use this belt, absolutely love it. One of my best squats/legs workout in a long long time. Highly recommend this bad boy!! Brian",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "The best I've used",
      "text": "I love this belt and have used many. Very comfortable and sturdy, very well made. The attachment works as it should keeping weights from moving around, unlike the normal chain ones. Great value for the money, would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ADillon",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Great design, well made",
      "text": "Very high quality product. The workmanship and stitching is outstanding. It is easy to use and quick to take on and off. It is light enough and comfortable enough to leave on in between sets. This design is far superior to a standard chain style dip belt, there is no chance of accidentally pinching your clothing or fingers in the chain like a chain style. This belt is a substantial upgrade from my low quality chain style.",
      "rating": 5.0,
      "verified": true,
      "author": "dm",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Awesome dip belt",
      "text": "I’ve used this belt probably 20 times so far over a couple months, and passed it around to other guys at work to try as well. It’s extremely comfortable and feels much more secure than any other belt like this that I’ve used. Securing the waist strap and then adding weight through a different strap is a great design. This belt is far superior to the chain belts that bend and come apart. Hands down, well worth the money and everyone I’ve lent it to thinks the same. If you’re loooking for a belt for weighted pull ups or dips, this one is a great option.",
      "rating": 5.0,
      "verified": true,
      "author": "Rockforce",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "A Spartan's Weight Belt",
      "text": "GREAT product!! Quality is impeccable. Real leather. Reinforced stitching at the major stress points. Padded belt makes adding weight desirable. All metal carabiners and buckles. Price point makes this product more than affordable. I implore you, if you are in the market for a weight belt get this product. Stop looking now, add this to you cart, and be amazed...once you are over your initial awe, get to the gym and get your gains on. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Didn't last, very upset",
      "text": "I literally own every thing this brand has to offer from writst straps, belts, you name it. All are great, but this fell apart after only a few uses, the stitching all.came apart. Very upset I have to buy another after 2 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Jackson Family Reviews",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "too small for 36 inch waist",
      "text": "says one size fits all......fits thin people, nice but needs longer strap sending back",
      "rating": 1.0,
      "verified": true,
      "author": "brad hatcher",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "A lot better than the one at your gym",
      "text": "I usually use a community belt my gym has for doing weighted pullups/chinups. Decided I should get a belt of my own for a home gym I'm building and this does the job a lot better than I expected it would. Definitely worth the investment",
      "rating": 5.0,
      "verified": true,
      "author": "Ranveeeer singghh",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "so far so good",
      "text": "I just received this belt 1 week ago. the belt is comfortable - though the attached weight seemed to hang much lower than what I am used to. (previously owned a harbinger leather/chain belt) so far it's handled 100 lbs attached - I will re-update when I try 180lbs. Should the product ever fail I will also update.",
      "rating": 4.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Quality and sturdy weight belt",
      "text": "Belt is comfortable on lower back, sturdy around waist, able to hold heavy plates with good stitching. Worth the money. I paid $40 Seller reached out multiple times to ensure quality assurance. You won’t regret and you get what you pay for, which is quality product and service.",
      "rating": 5.0,
      "verified": true,
      "author": "Do, Michael",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Dip Belt - Great Investment",
      "text": "I'm a 52 year old woman and I purchased this belt to assist me in improving my pull-ups (both weighted and non-weighted). When I got the belt, I could only do 4 with a 25lb weight attached and my goal was to be able to do 10. I did it! I could not have done it without the belt. The belt is strong and is of excellent quality.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Payton",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Really nice product, won't disappoint!",
      "text": "I really like this dip belt. Until now, I've been attaching chains to my weightlifting belt......super uncomfortable but it got the job done. The first time I used this belt, I realized how bad my make-shift dip belt really was. This belt seems to be of good quality, similar to the weightlifting belt I purchased from Dark Iron a few months ago. It is very comfortable and has a nice fit. My buddy and I have shared it a few times while working out, and it adjusts easily. It stays in place while using, so one less worry about the weight shifting around. Kudos on this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Cornelius Bosland",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Super uncomfortable and bulky.",
      "text": "Product is super bulky and uncomfortable. The strap in the middle digs into your clothes and waist once you put weight on. And has so much padding that it just doesn't sit well on the waist. Its way too overbuilt. I've had many belts and this was the worst. I went back to my Harbinger belt.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180712
    },
    {
      "title": "Review from user, not purchaser",
      "text": "I would like to give my first use opinion for you to pass on to amazon. I like the belt it works fine but there is room for improvement. The padding needs to cover the edges of the belt because the edges do dig in the more weight I add on. Also I am a short guy and if the weight strap was adjustable it would be better for me so the weights don't hag so low. other then that it seems well made",
      "rating": 4.0,
      "verified": true,
      "author": "MacMaster",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "The quality is great. You can't even tell he's had it 3/4 ...",
      "text": "I bought this dip belt for my husband 8 months ago. He absolutely loves it. He uses it every couple days. The quality is great. You can't even tell he's had it 3/4 a year and uses it constantly. I love this company's products. Currently own numerous items from Dark Iron Fitness and now my husband wants me to get him the weight lifting belt.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat0508",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Great",
      "text": "I just received this and honestly it’s great. It’s sturdy, like well made not no cheap stuff. It’s comfy and it has a better design than most dip belt because a lot of them just have the chain that goes around your waist which hurts compared to this one that’s more like a belt and then you secure the weight to the loops. - well recommended if you’re looking for a dip belt!",
      "rating": 5.0,
      "verified": true,
      "author": "Victor P.",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Best Dip Belt I have ever used!!!",
      "text": "This belt is amazing! I've used several other dip belts in the last 20 years and this is the BEST! It's well made, the thick padding made it comfortable even with (3) 45 lb. Weights hanging from it, adjusts and tightens easily to secure around my waist, and the strap with clips was easy to attach and detach. The strap positions the weight lower so it's not rubbing or clipping my legs during each set. I wish I had known about this belt earlier! As a competitive natural bodynuilder and personal trainer I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Beck",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Absolutely worth the extra $10-$15",
      "text": "Awesome belt, you can tell right away it’s very durable. 1. Tough material but feels light during workouts. 2. Fits great 3. The padding on the inside makes it very comfortable. 4. Easy to strap on. 5. Clips and rope to add weight for pull-ups or dips, etc... handles heavy weight. 6. Absolutely worth the extra $10-$15 then a regular belt. 7. Price is very affordable",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge F. Pardo",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Neat belt",
      "text": "I use this belt for belt squats and weighted pull-ups and dips. The coolest feature of this belt is the lanyard used for plates or for wrapping around a barbell for belt squats is fabric with little rubber grippers on it so its perfect for wrapping around a barbell for belt squats. It gives me supreme confidence under load where a chain can shift or slide. Also, the belt is well made - surprisingly considering the price. I really like the tightening mechanism on the belt (also with the rubber grippers) versus a run-of-the-mill belt.",
      "rating": 5.0,
      "verified": true,
      "author": "Reynoldo",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "No more back pain!!!!!",
      "text": "If you have lower back problems due to issues like scoliosis and cannot do normal back squats then try this belt out. Its amazing! I can perform deep \"belt squats\" and never have to worry about lower back pain or irritated shoulder joints. This belt is extremely well made and is an unbelievable value for the price. Very comfortable and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Rickey P",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Amazing quality",
      "text": "I was amazed when I received this. The quality of construction for the price is unbelievable. The strap that holds the weights is fay better than dealing with a chain. The carabiners also make for easy loading of weights onto the belt. This should last for many many years.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth H",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Polr quality",
      "text": "Stitching came apart during first use. Using a 35lb plate. :(",
      "rating": 1.0,
      "verified": true,
      "author": "k-b-one ",
      "helpful_votes": 2,
      "publication_date": 20200515
    }
  ],
  "product_meta": {
    "title": "Dark Iron Fitness Leather Weight Lifting Dip Belt with Chain for Dips and Pull Ups",
    "rating": 4.7,
    "feature_bullets": [
      "BUILT TO LAST: our leather weightlifting dip belt doesn't break, tear, or wear out like inferior dip belts made from fake leather, nylon, or polypropylene. This belt is made of premium reinforced 100% genuine real leather",
      "DOESN’T DIG INTO YOUR SIDES OR HIPS: our dip belt has built in pillow like padding for extreme comfort and support which eliminates any pain when wearing while still being light weight and not bulky",
      "LONG WEIGHT STRAP HOLDS OVER 270 POUNDS: with our thick 40” heavy duty weight strap you’re able to load over 6 olympic plates of weight for extreme weighted reps quickly and easily",
      "DOESN’T FALL OFF WHEN WEARING: with a heavy duty metal buckle and adjustment strap our dip belt fits all waist sizes for the perfect fit while insuring it never falls off when being worn",
      "CUSTOMER SATISFACTION: We're so confident in the quality of our weightlifting dip belt, we'll send you a brand one at no cost to you if yours ever fails"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Department": "Womens",
      "Date First Available": "November 26, 2016",
      "Manufacturer": "Dark Iron Fitness",
      "ASIN": "B01N1L4IHR",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Strength Training Equipment",
      "Exercise & Fitness",
      "Weight Belts",
      "Sports & Outdoors",
      "Sports & Fitness"
    ],
    "price": 34.99
  }
}