{
  "website_summaries": [
    {
      "verdict": "If you are looking for a Greenworks weed eater that is suited for most medium to large yards, this model is durable with acceptable power. A good choice if you already have a battery and charger; otherwise you'll need to buy both to get started.",
      "pros": [
        "Delivers 40 watts of power, which works well for most yards",
        "Rechargeable",
        "Not too heavy or difficult to maneuver",
        "Does not tend to be noisy or produce too much vibration"
      ],
      "cons": [
        "Doesn't come with a battery",
        "Some problems restringing it have been noted"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "An ergonomic nightmare.",
      "text": "This thing is garbage. Heavy and unbalanced, super front heavy. Motor has plenty of power, battery life is great, but it’s awkward to use. No real sense of where you are cutting height wise, either barely cutting or buzzing to the dirt. And you are going to wear whatever you trim. For an extra penny they could have had an actual guard that functions. Going to pony up for a gas powered one that this tried to replace. This little toy is going to the trash heap. Do yourself a favor. Get a 4 cycle that runs on straight gas and has bump feed. My last one lasted 20 years. I’m done with this after 2 uses.",
      "rating": 1.0,
      "verified": true,
      "author": "AJW",
      "helpful_votes": 9,
      "publication_date": 20190518
    },
    {
      "title": "Glad I got this weed trimmer",
      "text": "Great for fast trimming borders and general lawn upkeep. Finally cut the cord. Battery lasts long and dual lines do the job well. Auto feed works well. Bought the blower as well and switching the battery allows for quick clean up of trimmings. Don't need a second battery, which is good since they aren't cheap! Expect about 20 minutes of run time each before the battery runs down. Charges fast in less than an hour.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Broome",
      "helpful_votes": 4,
      "publication_date": 20180418
    },
    {
      "title": "For me, instructions were lacking",
      "text": "I bought this tool months ago and it’s still sitting unused because I couldn’t figure out the assembly instructions. Got the handle attached but it’s so wobbly it’s unusable. I couldn’t begin to figure out assembly of the guard and string. (This my first trimmer so it’s not intuitive to me.) I’m not great at assembly but have always managed to figure it out. This tool is the exception. I even went to the company’s site hoping to find a video, but there was no help there.",
      "rating": 3.0,
      "verified": true,
      "author": "NinaTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Solid value at its price point.",
      "text": "This is not an industrial/professional tool but it is effective for what it is. I'm a bit confused about the string advancement, but the string has a metal core (!!!) so despite 2 months of heavy use, I've only had to advance the line once. Charging is a little (just a little) slow, and the unit is a little heavy, but I think that's what you get unless you want to pay double this amount. Glad I purchased this.",
      "rating": 4.0,
      "verified": true,
      "author": "Kirk Mantay",
      "helpful_votes": 3,
      "publication_date": 20181212
    },
    {
      "title": "Lots of Power",
      "text": "I bought this trimmer for smaller jobs where I didn't want to fire up the gas trimmer. It has plenty of power and is able to tackle most jobs. The line advances automatically when you release the trigger so to save wasted line I learned to reduce the speed with the trigger between cuts & turn it off then on when the line gets too short. Very happy with this trimmer & great that it uses the same battery as my chain saw from the same company.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Not very satisfied",
      "text": "This item is heavier than expected and awkward to use without a shoulder strap. Also, the cord only extends a few inches on each side so the cutting area is very, very limited. The contact with the ground is not close enough to edge a walkway. This did not cut thin grass alongside my fence...you can't get close enough for the cord to reach. I do not recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Linda  Moore",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Great Trimmer for average size yard",
      "text": "Perfect trimmer for the average size lawn. Good battery life provides enough power to do needed trimming and still has enough power to slip into my Greenworks Blower to clean off walk and drive ways. Really like the way the string automatically feeds out when you slow down the speed.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony T",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Quiet, efficient, & light",
      "text": "Best string trimmer I’ve had of the total of three. No more electric cord to drag around/trip over, and no mor noisy gas engine to run out of gas. It’s quiet, does a great job of trimming, and is light enough not to wear the operator out.",
      "rating": 5.0,
      "verified": true,
      "author": "Bilgewater",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Excellent power and usage time",
      "text": "Got this to compliment my Greenworks 40 volt hedge trimmer. I used both today with the same battery and was able use them for a total of about 50 minutes with no noticeable power lag over time. It was able to take care of all the weeds big and small.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Goodson",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Heavy and hard to hold. Cheap materials.",
      "text": "While I was a fan of other green works items, this trimmer isn’t designed very well and feels off balance. The plastic seems cheap. Would recommend something else.",
      "rating": 1.0,
      "verified": true,
      "author": "m546",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Great Trimmer",
      "text": "My husband love it only with a 4AH battery makes a little too heavy. This one didn't come with a battery so I purchanced the lawnmower was well and it came with 2 Batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "dyermom",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Works great, but heavy",
      "text": "Works great! My arms were DEAD after using it the first time. It’s not very light. Battery life seems to be good so far. We’ve had it for a couple months.",
      "rating": 4.0,
      "verified": true,
      "author": "Jasmine P.",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Nice!!",
      "text": "Great trimmer! REALLY gets the job done! The only thing I don't like about it is the auto-string function. There MUST be a better way to dispense more line than having to stop the trimmer to get a tiny bit of string..",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Works well, perfect if you already have Greenworks 40v gear!",
      "text": "I already had a Greenworks 40v mower. My old corded string trimmer decided to fall apart so I gave this a try. I don't miss the 100' cord and this unit is tremendous for my smaller yard.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Wiz",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Powerful trimmer",
      "text": "The 40V Greenworks trimmer is great. The extra voltage makes for a very powerful trimmer. I already had a 40V blower so this gave my an extra battery as well. Love it and bought my Dad one.",
      "rating": 5.0,
      "verified": true,
      "author": "DLL",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "I am pleased because it is stronger than what I expected",
      "text": "It is so convenient; the batteries last much longer than expected. It will not handle tough weeds but eats through grass quickly. I didn't expect a brush cutter; I have a big gas powered machine for that. I am pleased because it is stronger than what I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Rancher",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "BETTER  THAN  GAS",
      "text": "It does have its limitations but even with our large property it acquits itself very well. Like my other GREENWORKS products its well built. Good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "fritz",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Strong quality machine",
      "text": "Well built machine; quality throughout. Very strong motor. Great head.",
      "rating": 5.0,
      "verified": true,
      "author": "EDWARD R MEYER",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Impressed",
      "text": "This thing rocks. I bought a mower with a compatible battery and I got both trimming and mowing done on one charge. It feeds string simply and it has all the power you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Good place to shop",
      "text": "Good product, great service at a reasonable prices. You could find cheaper but you don’t get the quantity.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Great for elderly due to its light weight",
      "text": "My back could not tolerate trimming anymore until I tried this trimmer. It is light and easy to manipulate. Works great, I have 2 batteries so just switch them out if needed!",
      "rating": 5.0,
      "verified": true,
      "author": "John Barewicz",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Light and long lasting on a charge",
      "text": "I like everything about this trimmer, so much so that I bought another one, what more is there to say.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Powerhouse",
      "text": "I’m impressed with how powerful this is, and the trimmer string it comes with is very tough-chops down even woody stems (like blackberry bushes and tiny trees). I get tired out a little before the battery dies.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Needs wider shield.",
      "text": "Cuts great, but needs wider shield. Some cuttings fly back and hit me.",
      "rating": 3.0,
      "verified": true,
      "author": "DONROB",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Solid performing unit.",
      "text": "Does a good job. I like the line advance feature. It is pretty heavy with the battery attaches.",
      "rating": 4.0,
      "verified": true,
      "author": "Step Man",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "My first electric trimmer and...",
      "text": "I bought mine towards the end of summer and only had to use it once. I was impressed with the performance and ergonomics of this trimmer. Assembly was extremely easy. This is a light trimmer and I was able to do a medium size yard and only used 50% of the battery charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Over_9000",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "This thing rips!!!",
      "text": "Very satisfied! This rips the weeds! I am very happy with the result.",
      "rating": 5.0,
      "verified": true,
      "author": "W. H.",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Does what it’s expected to do",
      "text": "No problems what so ever! Don’t know what some people complained about but this unit works exceptionally well!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Longevity",
      "text": "Weed eating / hedge trimming. Use the same battery. Well pleased, so far. I am hoping that it has longevity.",
      "rating": 5.0,
      "verified": true,
      "author": "gary townsend",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great product",
      "text": ". Works great. Love that the battery is interchangeable with other products.",
      "rating": 5.0,
      "verified": true,
      "author": "AmySue",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Quiet",
      "text": "It is quiet compared to others I have used. Is not too heavy (I am 66 yr old woman).",
      "rating": 4.0,
      "verified": true,
      "author": "H. Pocklington",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "No more struggling with my gas powered weed wacker.",
      "text": "Amazing. Did whole yard with lots of trimming in a short time. See all kinds of ways to manage my gardens. Yes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Good weed eater",
      "text": "It works as advertised, I have other greenworks tools. Great brand.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Vincent",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "2nd One",
      "text": "Daughter wanted to borrow mine, so I gave it to her and bought me another one because it works so well",
      "rating": 5.0,
      "verified": true,
      "author": "Leonard Griffin",
      "helpful_votes": 0,
      "publication_date": 20190419
    }
  ],
  "product_meta": {
    "title": "Greenworks 12-Inch 40V Cordless String Trimmer, Battery Not Included BST4000",
    "description": "GreenWorks GMAX 40V System offers a wide range of easy to use tools for the homeowner and those who just want more power. This 12-inch cordless string trimmer features an front mount motor for optimum balance. Light weight and easier to use, it has a variable speed trigger for power on demand, 12-inch cut path, .065 line diameter auto feed head for easy line advancement. Designed for ease of use and comfortable operation without the hassle of gas",
    "rating": 4.5,
    "feature_bullets": [
      "High Performance G-MAX 40V Lithium-Ion Battery delivers fade-free power with no memory loss after charging",
      "12-inch cut path with .065 dual line with auto-feed head to rip through weeds for fast trimming",
      "Variable speed trigger for power on demand",
      "Compatible GreenWorks Replacement Spool, Model 2900719",
      "Battery and Charger Not Included - Compatible with GreenWorks G-MAX 40V Lithium-Ion Battery Models 29472 and 29462 and Charger Model 29482"
    ],
    "specifications": {
      "Product Dimensions": "65 x 7.8 x 14.9 inches",
      "Item Weight": "6.5 pounds",
      "Manufacturer": "GreenWorks",
      "ASIN": "B01N9ZG83L",
      "Item model number": "BST4000",
      "Customer Reviews": "4.5 out of 5 stars107 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#147,958 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "String Trimmers",
      "Outdoor Power Tools",
      "Garden & Outdoor"
    ],
    "price": ""
  }
}