{
  "website_summaries": [
    {
      "verdict": "While it doesn't have as cool a design as some competitors in this size and price class, the Anker SoundCore Boost delivers excellent sound..",
      "pros": [
        "The Anker SoundCore Boost delivers strong sound for its size, has decent battery life and is splash-resistant",
        "There's a USB out for charging devices and a built-in microphone for speakerphone calls"
      ],
      "cons": [
        "Design is somewhat generic"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Sound": 8.0,
        "Value": 8.0
      },
      "publication_date": 20171005,
      "rating": 7.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Battery Charger Problems",
      "text": "After being plugged in to the charger for a day the speaker/battery goes dead. The first time it happened all the controls on top went dark. The 2nd time it happened (a day later) the lights looked normal for a max charge, but it would not play. The blueTooth was connected to an Echo Dot, which said that the bluetooth was connected but the speaker did not play. The same thing happened when connecting with the Aux cable, so it's not a bluetooth problem. To get the SoundCore working again, I have to unplug the power and plug it back in. At that point it looks like its charging a completely drained battery.",
      "rating": 1.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 32,
      "publication_date": 20170919
    },
    {
      "title": "Sound quality is epic and the extra features rock!",
      "text": "This thing is epic. I bought (and subsequently returned) the Sony XB31 and the UE Boom because they were lacking in sound what this speaker has: punch. Granted it’s only IPX5 certified, but I’ll just have to be more mindful of that. It’s a trade off. At this price you’ll be hard pressed to find a better, bigger, fuller sounding Bluetooth speaker. Update: This thing is a wonderful two in one device, a solid great sounding speaker and power bank. I had to go out of town for a week and packed this speaker with me. Since wall outlets were scarce, the ability to use this speaker as a power bank to charge my phone really helped during the trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Smokey The Bear",
      "helpful_votes": 3,
      "publication_date": 20190410
    },
    {
      "title": "The Bose sounds amazing, but I was worried about it getting bounced ...",
      "text": "I am a test driver for a company in the states.We test all different kinds of vehicles.Some of them have no radios in them.I already owned a Bose SLIII.The Bose sounds amazing,but I was worried about it getting bounced around,and scratched up.I did some research and purchased this Anker SoundCore.It doesn't sound quite as nice as the Bose.The bass boost on the Anker helps a lot.Like I said.It doesn't sound as good as the Bose,but it was 3 times cheaper.It looks good and sounds good.It is easy to connect to Bluetooth.Keeps a good charge,and is easy to charge as well.I would recommend this product.I purchased the travel case to keep it in as well.Over all a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180629
    },
    {
      "title": "Not the best, but it will do.",
      "text": "The speaker is solidly constructed and produces full sound. I am disapponted that it is covered in fabric rather than metal screening. The bass boost does provide additional bass, but it is not significant (depending on the degree of bass in the original recording). The boost also darkens the mids and highs. Really, without the boost, the bass is fine and the mids and highs are clear. It's nice to have the option of not using the boost. There is distortion at higher volumes, especially with the boost activated. Blootooth paring is easy. It is not the best speaker, but it is adequate for the application I have in mind.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry C. Norris",
      "helpful_votes": 2,
      "publication_date": 20201006
    },
    {
      "title": "Anker did it again..",
      "text": "I didn't think they could improve much on the sound and build quality of the Premium speaker,but I was clearly wrong..This thing,for it's size,sounds incredible!!!Very pleased with this purchase,and,again,thanks Anker,for making all these wonderful toys ...",
      "rating": 5.0,
      "verified": true,
      "author": "Nedzad Mehic",
      "helpful_votes": 34,
      "publication_date": 20170616
    },
    {
      "title": "Super sound in small package one year update.",
      "text": "Love the sound and base from this little wonder. Easy to pair with Bluetooth devices. Charge last a long time. 1 year later and still going strong. I bring it with me when I’m working in the garage or out in the yard , full charge still last all day and still sounds great. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "e hosman",
      "helpful_votes": 8,
      "publication_date": 20180314
    },
    {
      "title": "Good sounding speaker!",
      "text": "I bought this to use in my private office. I've always been a sony speaker guy and love my SRS-X55 but did not like some of the complaints I was hearing from the new sony bluetooth speakers. The Anker Soundcore speaker works excellent. The bluetooth connectivity is quick to connect and so far the battery life has been very good. Overall sound quality for this size speaker in my opinion is very good which is essential to me as I mostly listen to ambient/house/techno on this speaker and want that rich sound. Portability is also great. You can buy better sounding speakers for way more $, but for the price of this speaker, you cannot beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Good bass!!!",
      "text": "I was very skeptical in forking over the money to buy this. But I've had purchased 2 other Anker Bluetooth speakers. And I was already happy with them. I use one for work and one for home. But I was wanting one with a little more umph on the bass end. So after 2 weeks I went ahead and pulled the trigger on this. I got to say I am glad I bought this. The BASS! For this little thing it sounds IMPRESSIVE!!! So this my favorite now out of my other 2 Anker speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "NOY",
      "helpful_votes": 7,
      "publication_date": 20170724
    },
    {
      "title": "Great speaker!",
      "text": "This is a very good deal for a very, very good small Bluetooth speaker. It’s about 1/3 the cost of a comparably sized Bose speaker. Yeah the Bose is a bit better, but not $100+ Better. The Ankar has a base-boost button which I really like. When I set it at the corner of my kitchen counter, The bass sounds like it’s coming from speaker many times it’s size. This thing can fill a room with sound. This unit replaces my old small jam box, which I bought seven years ago for four times as much. This is got about four times more umph than my old Jambox. Great battery life Great Bluetooth connectivity.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Great sounding speaker.  Can also use to power your phone at same time.",
      "text": "Great sounding speaker, feels very solid and slightly heavy. It does seem to have a mind of its own. I have it plugged into my Echo Dot via cable and when my paired phone rings it mutes itself! Very cool, but probably the youngsters out there will tell me this is how Bluetooth devices are supposed to work! Also has NFC but haven't tried that. I'm just happy to have been able to set up bluetooth! Age matters, y'know. Battery lasts a long time and has a USB socket so you can use the battery to power/recharge your phone at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Toolmanjsp",
      "helpful_votes": 3,
      "publication_date": 20180130
    },
    {
      "title": "Most Bluetooth Speakers are Lame This one is No Exception",
      "text": "I guess it sounds better than some of the $20 ones I have tried, but it was kind of expensive and sounds so crummy. I am sorry bought it, but I'm too lazy to return it. I kind of tolerate my Bose Soundlink, but it was a lot more $. I wish someone would make a good $60 bluetooth speaker, but so far I haven't found one.",
      "rating": 1.0,
      "verified": true,
      "author": "801eric",
      "helpful_votes": 6,
      "publication_date": 20181027
    },
    {
      "title": "Does not power on and can’t hold a charge.",
      "text": "Does not power on, because it doesn’t hold the charge. I use to trust this brand, but I’m done with them. Listen to the other one star reviews that mention the battery life. Every negative review mentions the battery, so yours might be good but down the line your stuck with a dud. No thanks Anker I’ll pay more for a trust worthy brand",
      "rating": 1.0,
      "verified": true,
      "author": "Adrian C.",
      "helpful_votes": 3,
      "publication_date": 20190702
    },
    {
      "title": "Great sound for price range, but...",
      "text": "Great sound for price range however, I do see room for improvement for this speaker. High frequencies are a little distorted when volume is at 70% volume which most people won't even notice. I happen to do a lot of recording and noticed it right away. One more thing I believe could be improve is the increase of the volume, whenever I want to increase the volume just a bit, I notice that a single button press increases the volume a little too much. Lastly, I wish battery lasted a little more but still is good enough.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Great speaker !",
      "text": "This speaker definitely punches above it's price list. It gets quite loud for it's compact size, and I like the quality of the sound of produces. Way better than my JBL which is about the same size. I don't even know where the JBL is anymore, I haven't used it since I got this one, not to mention I was so tired of JBL's proprietary charger, this one can be charged with every micro USB charger cable, so I have those laying around everywhere in the car and house, way better than to be stuck looking for the one single charger that can charge my speaker. Very very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "a4k",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Worth every penny. No regrets!",
      "text": "Awesome speaker! Great build quality! The sound is amazing for the money. I out off buying this thing for so long figuring it would just be another cheap speaker. After spending 2-3 times more money for other more popular brands, I returned them all for not being worth the cost. This speaker delivers more for what I paid. A+ Only negative is, for the size and weight, (it’s a bit heavy for the size) you’d think it would last longer than a 12hr charge. Especially since the previous model was a 24hr charge. If anything negative should arise I’ll update this review. Otherwise I highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan B.",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Doesn't hold a charge",
      "text": "The BRAND new speaker doesn't seem to want to hold a charge. Highly unsatisfied. Buying a new item I would expect it to work flawlessly, but not in this case. Now I have to go through the hassle of returning this defective item like I have all the time in the world to do so. It works plugged in, but the bass quality is absolute trash. EDIT: The company sent me a new one. It works! We’ll see how this one goes, but when I tried it, it was good. Gotta try it more for a better review.",
      "rating": 3.0,
      "verified": true,
      "author": "Seng Dieng",
      "helpful_votes": 3,
      "publication_date": 20190226
    },
    {
      "title": "Totally surprised me with it's excellent sound quality.",
      "text": "I wanted a bluetooth speaker to work with my new laptop. The Anker Soundcore worked flawlessly right out of the box. It paired right away with my laptop and when I played my music I was totally surprised by the great quality. The \"superbass\" added a wonderful bass level which far exceeded my expectations with the overall music quality. I would highly recommend this to anyone looking for a high quality speaker unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoff Hallett",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Great little Bluetooth speaker",
      "text": "I purchased this to replace a Bose Soundlink III, which stopped working properly after using less than 5 years. Considered fixing the Bose and/or replace battery, but that was going to cost more that it was worth. Don’t know if the battery was the problem with the Bose Bluetooth connectivity or not, but the unit was always plugged in. This speaker connected easily via Bluetooth, and the sound isn’t appreciably different than the Bose in the industrial environment it’s used in. This coming from a guy who used to make his own home speakers. Considering it cost about 1/5 the price of the Bose, it is a great bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "Roscoe",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Anker pretty much makes the best third-party accessories.",
      "text": "Coming from a JBL Flip3 i am blown away by the sound difference. Everything sounds rich and clear crisp and the bass is great for the wide range of music i listen to and can also be boosted by a simple button.Build quality is what you'd get from a major manufacturer like Sony. I also love that the SoundCore Boost 20W comes with a 5200mAh battery that can be used to play the speaker for 12 hours and a USB to charge most cell phones. This speaker will satisfy you and you'll be glad you didn't spend twice as much on big brand names.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Impressed!!",
      "text": "Sound quality is pretty good. Close to a Bose SOundlink I previously had, but for a fraction of the price. The bass boost is good, not impressive, but good enough for enhancing bass without distorting much. Battery life SEEMS good. I say \"SEEMS\" because I have used for about 4 occasions, for around 8 hours in total, and the battery indicator says it is about 2/3 full. It has not yet discharged since I charge it, so I do not know if the indicator is indeed accurate, or not. I LOVE the feature to be able to answer/hear phone calls via the speaker. Love it! For the price.....I am impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Felix L. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Clicks and Claps when volume increases",
      "text": "Purchased this for my daughter for Christmas and out of the box it seemed defective. The sound quality at low volume was excellent but anything even remotely louder than what I assume is 1/4 the capacity of the speaker, it clicks and sounds terrible. I have quite a few Anker products and have loved them. I'm hoping I just got a bad speaker out of the box, time will tell as I'm going to return this one for a new one. I will update this review after receiving the new speaker.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard L.",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Wow!!! Blown away!!!!!",
      "text": "I just received a replacement speaker for one that I ordered and they even upgraded it to a flare+ !!! The sound is fantastic and the response time and service was so amazing!!! Thank you Helen for keeping my faith in your quality products and great service I am a fan of Anker and soundcore products! when I save a little bit more money I am going to buy a 2nd Flare+ and pair them for a complete stereo surround sound!!!! Helen you asked me to let you know how I feel when I received the new flare+. so I decided to let everyone know how cool you are! :) Thank you again Helen :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Speaker Only Worked for 9 Months",
      "text": "Great little speaker that was handy to have. But it only lasted 9 months. NINE MONTHS. The speaker will no longer charge, so it's junk. So I came back to leave a review, so the company can make a product that can last longer than a year under normal use. I would not purchase this product again and have in fact, just placed an order for another speaker from a different brand in hopes that it can make it past the 12 month mark. smh. JUNK.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Fantastic!",
      "text": "Anker did a great job in designing and building this bluetooth speaker. I seem to have developed a definite \"liking\" for bluetooth speakers. I have Bose, Klipsch, JBL. Dell and others. But I believe this inexpensive Anker product outperforms them all in sound quality and frequency response. The sound is very natural. And the bass response from a speaker that is 2 1/2 inches tall is phenomenal. If you were just listen and not looking, you wouldn't believe the sound was coming from such a small speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "JERRY W JANSA",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "speaker phone poor",
      "text": "Sounded good, but the speakerphone function was poor. I tried the speakerphone function with couple Anker products and the Tribit, and got about the same results. Maybe it is my Motorola g6, but my son's Pixel 3a didn't work well either. I know the speakerphone function does not work like the regular phone function, i.e., half duplex, but I also remember a time when the BT speakers (or perhaps the phones) did a really good job of overcoming these drawbacks. Ended up with the lower cost Anker speaker, that works fair at best..",
      "rating": 2.0,
      "verified": true,
      "author": "stevelk",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "What A world we live in.",
      "text": "If your source is terrible (aka Amazon Music whatever they're calling it now) the output will be terrible. The speaker will probably work great for me, but the various shait stqins that want to \"own\" my access to said music despite promises to the contrary really do make a huge difference. You playing CD quality music, this speaker is great!",
      "rating": 3.0,
      "verified": true,
      "author": "D. Vaughan",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Decent little sound bar for being hooked up to my computers",
      "text": "The sound is great. Not much use, personally, for bass boost, but that is a matter of taste. I DID try to play the launch sequence from \"Apollo 13\" at a volume level above 1/2 on the computer and the speaker went a bit nuts distorting out (NO BASS BOOST). It does not seem to handle high-level DTS bass well. So I set the volume level to about 1/2 and the sound was fine. I am happy so far. This is NOT a surround sound system :-) but seems to do great at what it is made for. The battery gets about 8 hours with my usage habits. Updates as needed",
      "rating": 5.0,
      "verified": true,
      "author": "Kamoola",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Happy with this wireless speaker unit",
      "text": "Three things stand out: 1) Sound Quality- I've tried more than a few different brands, and this is definitely quite acceptable. I had heard the older Bose unit and was impressed, but the price seemed too high. 2) Price- the price of this unit allowed me to enjoy Bose-like quality at a price that I felt was more appropriate. 3) Customer Service- the unit I received had a bad connection issue at the USB port on the side. I came up with a workaround, but still, why put up with a defective unit? Customer Service was very responsive and honored their 18-month warranty within days. So, 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence Lam",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Full mid and bass, high frequencies lack sparkle, bluetooth to 2018 Mac Mini regularly drops",
      "text": "Initial impression of build quality was very positive. Buttons feel solid and the port cover is very snug. Sound quality is very impressive but lacks high frequency sparkle of better speakers such as my old Bose Soundlink Mini. Biggest problem is that the bluetooth connection to my 2018 Mac Mini drops every hour or two... big downer. Seems to work fine with my iOS devices but for some reason doesn't play as well with the Mac Mini. Battery life is excellent and the ability to charge the speaker over USB *and* use the speaker to charge your phoen is of course awesome.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Baumbach",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "This surely doesn't need another 5-star review as such ...",
      "text": "I am hard to please when it comes to speaker sound quality, whether it is earbuds, headphones, home theater systems, PA systems, or well, portable bluetooth speakers. The latter have a clear challenge for producing good bass given the size limitation, but Anker seems to defy the physics here. The base boost from the Bass Up button on the top indeed dies not mess up the sound quality while managing to raise the bass well. The Bluetooth range is phenomenal; it keeps working fine when I am behind the walls. Anker has proven to be a role model in product quality once again.",
      "rating": 5.0,
      "verified": true,
      "author": "Alok G",
      "helpful_votes": 2,
      "publication_date": 20190601
    },
    {
      "title": "Great speaker but don't but listed travel case (wrong size)",
      "text": "I use this speaker instead of truck's built-in speakers for listening to my iPhone: can't find a decent connection via the radio plus can just set up this speaker (again, for listening to my iPhone) when I'm relaxing at home. For its size, the sound quality is excellent for symphonic music and jazz. I dinged the rating because of the incorrect Anker hard case listed at the bottom: too small (Anker doesn't have a case for the SoundCore Boost -- Anker unsympathetically pointed out rightly that the information on the case explicitly states \"not for SC-Boost\" and that the listing is Amazon's mistake), which I purchased and then returned.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Arnett",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "False advertising.",
      "text": "Purchased the Anker sound core boost Blue tooth speaker off Amazon. Connected via Bluetooth to my phone. Great. It had a great sound. But.... This is supposed to be able to connect to MP 3 players according to add. I bought the suggested cable for hook up. BUT the auxiliary jack the cable goes into is non existent. It had a cover over it which I attempted to remove to gain access and it would not come off. I do not know if the jack was concealed under it or not. Returned the miss represented item back to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth B.",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great for a few month",
      "text": "Sound and size are great for a few month but later the bass goes like in a broken speaker, this is all ready my second set after the first was replace for the same problem. Be clear that this pretty buy good for the price but I believe some of the compress sound that band use this days is to much for this little speakers and they die after a few try.",
      "rating": 3.0,
      "verified": true,
      "author": "DaLi",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "A smooth sounding speaker.",
      "text": "This is a nice quality speaker. It has a smooth clear sound with noticeable increased bass. The soft rubber exterior is a nice look and feel. I really like how easy it is to turn on and sink to Bluetooth, and to shut it off quickly. Anker has quality customer service, and stands by their products with swift service that makes sure to take of their customers. If you are looking at buying this speaker know it is of good quality, and made by a company that takes care of their customers.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Fredrickson",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Love This Little Speaker...",
      "text": "Great sound and volume for such a small speaker! Good balance of treble and bass. We downsized and started minimizing our home and no longer wanted clunky, large electronics in our home, so this was a great solution. It’s really convenient to be able to bring your music to whatever room you want and have good quality. The sound was comparable to 3 small speakers we had connected to a receiver. We also discovered that if you put the speaker on top of a piece of furniture that’s kind of high, like a refrigerator or a shelf, the sound quality is even better. I would buy this again...and recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Really nice bluetooth speaker",
      "text": "I really like this speaker. The sound quality is really nice, and it is easy to set up. The power cable is short, but that's OK. It was replaced with a longer USB/mini cable. The operation is flawless. The only issue is that it doesn't automatically turn-off after a period of inactivity. Also, if using the phone, the bluetooth automatically comes on while talking. That could be a set-up issue, but having tried rebooting, reconnecting, resetting the bluetooth on my phone, does not resolve the issue.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Carroll",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Useless for Movies and Youtube",
      "text": "I've had the Anker Soundcore Speakers for six months. The Anker speakers produce sound in only a small range of frequencies which gives the sound a garbled quality. Listening to voices (like movies and youtube video) is IMPOSSIBLE because so much of the frequency range is missing. The \"Oontz\" brand is far better.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Not any louder than a regular soundcore",
      "text": "I really like the anker brand, this is the fourth bluetooth speaker that I've purchased from them. The other speakers that I have are 12watts and they're pretty load. The reason why I purchased this one and paid the extra money was because it's a 20 watt speaker. Playing this speaker next to my other sound core(12watt) speaker, it isn't really any loader. The sound quality is definitely better tho, more bass! I wouldn't buy this one again, I'd go with the regular anker sound core for 1/2 the price.",
      "rating": 2.0,
      "verified": true,
      "author": "justin toole",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Loud but Muffled Sound",
      "text": "This is plenty loud and the bass is nice but it really does produce a muffled sound. And when I say muffled I don't mean that the sound has warmth, I mean it sounds muffled. I've tried it on different flat surfaces including wooden desks, kitchen counter, and bathroom counter. This speaker is horrible for listening to movies, tv shows, podcasts, ted talks, or anything else where you're trying to understand what the people are saying. It is also not good for vocalists that have a warm tone. It is a good-looking unit, is easy to sync, easy to charge, and easy to operate. It is beautifully boxed as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucy  ¯\\_(ツ)_/¯",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Sound is great.",
      "text": "When I got out of the package, it connected immediately. However, there are times when it says it's connected and you hear the sound if it connecting, but the sound doesn't come through the speaker. I have to disconnect, disregard the bluetooth and reconnect. Seems to take several tries to get it to connect? Not sure what I may be doing wrong. With that being said the sound that comes through is really nice and I\"m happy with that. It is a little larger and heavier so I thought about taking it abroad with my travels, but it will weigh too much and take up too much room for my luggage.",
      "rating": 4.0,
      "verified": true,
      "author": "Abby Friedman",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Sounds Good, some Bluetooth Issues",
      "text": "This speaker sounds pretty good and gets to be very loud. However the distortion is very noticeable at max volume so I wouldn't pass 80%. I have an Oontz Angle 3 plus as well and they have similar sound but this speaker has much louder bass. The main complaint I have is Bluetooth takes an abnormally long time to work right. If I connect the Oontz to my phone it will play media to the Oontz in about 2 seconds. With this speaker it's more like 15 or 20 seconds which is annoying and strange.",
      "rating": 4.0,
      "verified": true,
      "author": "Seth Schaffer",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Good quality, but lacking overall in volume output.",
      "text": "I love Anker's battery back up options so I decided to give this bluetooth speaker a try because of its \"enhanced\" bass output. It is a decent speaker that connects with my phone effortlessly. However, the bass up feature I feel does more to distort the clarity of the speaker more than it adds depth to the music. Also, the volume just doesnt match some of the cheaper bluetooth speakers I have bought over the years. Battery like is very good though. Overall, if this speaker holds up over time it will be a good buy, but as of now, I just cant get past the overall volume and clarity of the music output.",
      "rating": 3.0,
      "verified": true,
      "author": "Perry Del Rossi",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "So good, I gave it away!",
      "text": "Yup. I bought this to try out in my tankbag on my Sportster. Well, it's a great little speaker but unfortunately my Sporty has those stupid Screamin' Beagle pipes and I couldn't hear diddly-squat over those things (hey, I bought the bike used and it came with them and I am NOT going to spend my money putting stock pipes back on, LOL!). So I gave this great little blootoof speaker to a dear friend and so far she says she reeeeeeeeeeeeeeally likes it. So there! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Best in class",
      "text": "The bass really comes through better than other speakers of its size and in this price range. It feels like a brick: heavy and solid. I like its simplicity. I use it to listen to podcasts as well as a variety of music throughout the day and the battery lasts all day! I find the best room filling sound quality when I perch it at about 5-6 feet above the ground, like on top of a book case or the fireplace mantle. It doesn't sound as good down low or within a shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Beecher",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Not very good and eventually stopped holding its charge",
      "text": "I was disappointed by this product. I like Anker products and always use their cables and chargers, which I find to be high-quality. This speaker had okay/passable sound, but not great battery life. Worst of all, it stopped holding its charge a little over a year and a half after I purchased it. Unfortunately, I was outside of the 18-month warranty window, so the speaker is now an expensive paperweight. It also had problems syncing with my Dell laptop running Windows 10. The laptop connects to other speakers and bluetooth devices without problems. I wouldn't recommend this speaker; its quality is below that which I expected from Anker.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Not worth the Money..",
      "text": "Bought to use during ZOOM Conference's.. and Phone Calls.. Terrible Sounds like you are under water.. I have purchased 25.00 Speakers and they were Great.. This is very overrated.. Battery life doesn't last.. Do Not waste your Money....",
      "rating": 1.0,
      "verified": true,
      "author": "chocolitchik",
      "helpful_votes": 2,
      "publication_date": 20200927
    },
    {
      "title": "I like it",
      "text": "I think it's a good speaker and I do like it. I guess I need something more powerful than 20 watts because I often have it cranked to full volume and it's still not quite loud enough. Running it at high volume like that pretty quickly blew something out, so I can't have the bass turned on anymore. I have no idea where they're getting 12 hours of battery life. Not even close. I like it a lot better then the anker 12 watt and I now have a 30 watt on the way.",
      "rating": 3.0,
      "verified": true,
      "author": "frjaldomr",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "A great little speaker",
      "text": "I bought this for my studio apartment and it puts out a great level and quality of sound. I use it primarily to play music when I'm lounging on my bed or on the couch. I can't attest to its outdoor usage however if you're looking for a small speaker for your kitchen or on your nightstand I would recommend picking this one up. The only cavort I have for this speaker is sometimes it plays youtube vidoes and podcasts extremely low. I'm not sure why but it is an issue from time to time.",
      "rating": 4.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great little speaker - well was but now doesn't work properly",
      "text": "This is a good sound & the bass boost gives it that little bit extra. The battery lasts a long time, which is the main reason I bought this speaker. I haven't used it much. Will update review if I find any changes. UPDATE 3/4/2020 - this speaker will not connect to my phone via blue tooth even tho it says it's connected. It also will just shut off immediately after turning on & it has a full battery charge. It is hit or miss if it works - very frustrating. Now I have to look for another speaker yet again.",
      "rating": 1.0,
      "verified": true,
      "author": "Marie R",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "I supposed it's a matter of taste",
      "text": "I stopped using this and went back to an old cheap bluetooth cube speaker I purchased a long time ago. This just has way too much base. Maybe be okay for backyard dance parties but just to listen to a track or a meeting it just rumbles with bass. I go to a lot of meetings on ZOOM and wanted to enhance my laptop with a tiny little speaker but the bass is so deep I couldn't even hear people clearly. Sorry I didn't send it back in time. But here I come Ebay.",
      "rating": 3.0,
      "verified": true,
      "author": "LJK",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Great sound and volume for size & price",
      "text": "For the small size, I'm impressed with this little speaker. Performs like a $150 speaker. Battery life seems great so far too. It lasts all day on the beach with plenty of power to spare. Good volume and lots of bass, especially indoors. With the ability to also charge another device via USB, it's just what we wanted for day trips. Only complaint is sometimes the bluetooth won't connect automatically and I have to go to phone settings to connect it. Whatever, I think it's a bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin S.",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Very poor quality control.",
      "text": "Upon receipt and attempted to charge the unit, I noticed that only three lights lit up instead of the four that are supposed to be lit up upon the unit receiving a full charge. What a piece of junk. Very poor quality control. Aren't these units tested before being sold to the consumer?",
      "rating": 1.0,
      "verified": true,
      "author": "eric albert",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "SOUND OUTPUT POWERFULLY UNDISTORTED",
      "text": "ANKER SOUND BOOST—A RESPONSE (1) I appreciate the quality of the sound—its deep resonance. (2) It is difficult for me to determine the difference in sound when the boat feature is activated—therefore, do not give it five stars . (3) I would not attempt to determine the percentage of it being waterproof. (4) The access port is secure and airtight. (5) It is certainly most portable. (6) The 20-meter (66-foot) range allows it to be taken to any room indoors or carried outdoors—unless one lives in an expansive hotel or castle. (7) Direct input is as simple as bluetooth. (8) Charging the unit easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Defective out of the box",
      "text": "The battery died a few hours after it was turned on (surprisingly it died while it was plugged). We tried to use it after a full night charge, even plugged the speaker turned off for no reason after a few minutes, we tried to use it a couple of times again but it turned off again. In general, the sound was god and the size of the speaker was perfect for traveling and camping but it was not possible to use it more than 15 minutes so we had to return it. This may not happen to you our unit was clearly defective.",
      "rating": 1.0,
      "verified": true,
      "author": "J. F. V. Davis",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "No go",
      "text": "I really wanted to like this thing. The battery life went dead after two charges. It consistently has a hard time connecting with my devices, and randomly disconnects. When it reaches 20 percent battery capacity, it starts screeching and squealing. When you pick it up, it feels like it's really well built and has a great design. . . The quality just isn't there. For the price, I'll stick with soundbot",
      "rating": 2.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "This thing sounds great!",
      "text": "This is the second Anker product I have purchased from Amazon and, like the first one (a portable battery), I am very pleased with the performance, value and quality of the product. First things first, this speaker sounds really good - clear, rich, full, and the 'bass boost' is a real thing. I'm by no means an audiophile, but I do enjoy listening to all types of music as well as sports talk and audio books, and the Anker performs well for all of those 'workloads.' It was super easy to do the Bluetooth pairing (no instructions needed, frankly) and seems to hold a charge great, so far. Thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Bcattleman",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Great Sound up close with Sansa plus even better from Chromebook",
      "text": "For a personal speaker using my Sansa mp3 player, - four feet or closer, the sound is great. When you get farther away, you lose volume. Connecting this via wire to my Chromebook with the Volume Booster app, the sound is LOUD and fills the room. I bought this mainly for presentations, so the sound from this tiny speaker is perfect. I did not test the Bluetooth since it has caused me numerous problems in the past on other devices.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Great unit but control buttons on top should be lit or colored",
      "text": "It's a great little speaker. Anker makes some great products and this unit is no exception. My only complaint is you can barely see the buttons on top of the speaker. They should be colored so its much easier to say raise volume. Ideally, they would be colored and illuminated. You cant see the buttons al lin a semi-dark room let alone a room with no light. This would have been a5 star review but Anker needs to address the usability a little.",
      "rating": 4.0,
      "verified": true,
      "author": "BM",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Good value for money!",
      "text": "While the sound quality is not better than my previously owned mini-Bose soundbar, it is very close and it easily projects sound across my kitchen and adjacent seating space with minimal distortion at the low-to-upper-mid ranges. Also, this sound bar has better Bluetooth connectivity than my Bose. I also appreciate that it does not mysteriously stop working in the middle of a song as did my mini-Bose. If you are a cost-conscious shopper and can live without having the higher-end brand, this is definitely the way to go! One satisfied customer",
      "rating": 5.0,
      "verified": true,
      "author": "Steve-O",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great sound for this price range.",
      "text": "I choose this for the Anker build quality, price and the fact is won't roll away. I seemingly spend a lot of time at an angle, motorcycle seat, car hood and desk top use (not angled). The only this taking away a 5th star is the battery capacity could easily have been greater. Its not that I listen for 24 hour period straight but charging after a day or two of use is not as good as charging every 3 or 4 days of use. A bit nit-picky and not a deal breaker. And for what its worth, just leave the BassUp feature on, even audio books sound better that way. The battery hit is nominal.",
      "rating": 4.0,
      "verified": true,
      "author": "SeaTech",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Issues w/ speaker, Anker CS phenomenal",
      "text": "Unfortunately I was not impressed by this speaker; I had hoped to use it for a cookout for some background music but the battery didn't last me 2 hours on a full charge, it wouldn't go very loud (couldn't even hear it from the kitchen to the bedroom, which is right down the short hallway), it kept dropping the signal and disconnecting (we have a very small yard, and I was never more than 20 ft away) EDIT: While this particular speaker was not worth the price to me, and was likely defective, the Anker customer service was phenomenal. They emailed me right away and resolved the issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah C",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Excellent sound - easy to use",
      "text": "I am completely new to Bluetooth technology, but I am using two of these speakers now. One is connected to my computer, another to a portable CD player. Somehow they magically connect and play music with amazing clarity for a speaker system you can hold in you hand. I got the Bass Boost version because I am trying to learn to play bass (a new adventure for this 75 year old) and needed extra help to hear the low notes in recordings.",
      "rating": 5.0,
      "verified": true,
      "author": "John Elberfeld",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Great speaker and inexpensive too!",
      "text": "I bought this as a replacement for a JBL Flip 2. Out of the box it had a small charge so I connected the Bluetooth and the sound was most definitely better than my old JBL. After 1 full charge I haven't had to charge it again and I use it in the bathroom so the water resistance stands up to the steam. I play with the BassUp a little, but on some songs it just seems to make the bass muddled so I mostly leave it off. Great little speaker for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip Kaun",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "8 Months In and Still Sounds Great! Very Satisfied!",
      "text": "I've owned this speaker for 8 months now and love it! It's portable, has good sound and volume levels and the battery life is as advertised. I don't write many reviews but felt compelled to do so when listening to some music on this speaker while doing some reading today. I typically use this speaker in a variety of settings including my man cave, my garage when doing car maintenance, when i'm out boating or when I want some background music at dinner. If your needs are similar I don't think you will be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Redbarn",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "My Favorite Portable Speaker",
      "text": "i once purchased this speaker from a well known supermarket and returned it hours later. This product has astonishing sound quality and bass for its size. It has more sound than a couple of different soundbars ive heard (Different brands). Volume increases works great and what makes this my favorite portable speaker is the \"BassUp\" technology, when turned on the sound gets wealthier and slightly louder without and distortion to the sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Skinner",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Bass-up Feature is not very useful.  Cheap construction",
      "text": "I have two SoundCores and the first one was great (did not have battery charging or Bass-up) and is still going strong. This one has decent sound, but for many songs the Bass-Up feature results in a muddy bass sound. Also, the micro plug used for charging is not durable. The micro plug has actually broken loose and fallen inside of the speaker rendering it useless. I have a $60 brick that I can no longer return. Update: Anker was amazing and replaced the first unit ASAP. Unfortunately, the same thing happened with the replacement - micro usb is junk. Obviously, they have a bad production run with the micro usb problem. I would avoid this product.",
      "rating": 3.0,
      "verified": true,
      "author": "Darren Baun",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Yep, it’s a good buy, alright!",
      "text": "Just received this item today, so I can’t speak to the battery life, but the sound quality is terrific and the Blue Tooth connected so easily. Great value for this little gem. I’ve owned an Oontz Curve and there just is no comparison. Spend the extra few bucks and get good sound. The clarity and powerful bass are terrific. I was looking at a less expensive model, but SO glad I got this one. Much better quality sound than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Beth",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Another great Anker product",
      "text": "I have yet to buy an Anker product that I don't like. I have a couple different Anker SoundCore and use this one as my PC speakers. I mostly use headphones on my computer, but when i do want to use speakers, this works fine and saves a ton of desk space. As far as portal soundbars go, any of the Anker SoundCores are a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "sks",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Not worth in the long term",
      "text": "I love this portable speaker. Best one I've had but after 3 months it wont charge pass the 2nd light. Unfortunately I cant return it and will have to take a loss.",
      "rating": 1.0,
      "verified": true,
      "author": "N@$#[]n€",
      "helpful_votes": 2,
      "publication_date": 20191014
    },
    {
      "title": "Excellent buy, but....",
      "text": "When hooking up the audio jack you always get a bussing noise. The bluetooth operation works excellent.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200928
    },
    {
      "title": "Great big little speaker!",
      "text": "I own several Bluetooth speaker systems, and each has its own characteristics. I purchased this Anker speaker after having very good experiences with their cables and adapters, and with their customer service. It connected with my iPod Touch via Bluetooth with no problem. I also connected to it with my Samsung Galaxy S7 with no problem. The speaker sounds very \"full\" and really does pump out pretty good bass, considering its size. I can't speak to the battery life, as I've used it for only a few hours. All in all, definitely well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Tremendous sound in a little inexpensive package.",
      "text": "I can connect using the bluetooth in my phone and my notebook computer. This is great for sitting on the deck and listening to some tunes. I am really surprised and how good this little inexpensive speaker sounds. The power bank feature is also a big plus. I do have separate power banks, but I forget to keep the charge up. Since I am always using the speaker, I make sure it is fully charged. It will always be ready if there is a power outage. The separate power bank that I have may not be ready.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Lockensmith",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Good sound and good battery life in a small package",
      "text": "This little speaker has good sound and good battery life, I was really impressed. It does distort turned all the way up and it gives a little bit too much bass even when the boost is turned off. Good battery life at 12 hours but I have seen others with 24. However, at this price point I don't think you can get much better. I would recommended the purchase unless you have lots of money to spend on a top-tier bluetooth speaker. Just a tip... If you want a case for it, do not purchase the case Amazon recommends, it is too small and for a different speaker. I had to return it and get a different one.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris R",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Sounds great, lasted a year before battery gave out",
      "text": "Had great sound, unfortunately the battery gave out after a year - now holds charge for ~half an hour. Bluetooth can be wonky, sometimes it takes several minutes to connect, sometimes takes several minutes to show up when in pairing. Overall, a bit underwhelmed after having it for a year.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Johnson",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Bought, Listened, Returned",
      "text": "I bought this based on my favorable experience with Anker products. The sound quality was between poor and terrible. Distortion was prominent at low, mid and high volumes. The build seems solid and it connected easily in one try, but above all it is a speaker and the features are secondary to the listening experience. I bought this to replace a speaker I got as a $25 grab bag gift. My cheap, dead speaker had similar sound quality. Back to research.",
      "rating": 2.0,
      "verified": true,
      "author": "BJBSF",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Great Battery Life and Good Sound quality.",
      "text": "What I like: * sound quality is above average for this sized speaker * bass UP feature ads a bit more bass and volume * great battery life. What I do NOT like: * The controls are hard to see at night. I use a flashlight. Overall a good device that I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Hobby Woodworker",
      "helpful_votes": 2,
      "publication_date": 20171209
    },
    {
      "title": "Fantastic product for what it is",
      "text": "Got this as a gift for my wife. She carries it everywhere around the house now and listens to her music (annoying the crap out of me) but she looks happy so life is good. The sound is surprisingly good for a bluetooth speaker and one in this price range. And I say this as a person who owns individual headphones that cost 100 times more than this. Just buy it, none of these JBL or other \"competitors\" can match this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Way to much base..It kills the vocals on traditional music.",
      "text": "If you like nothing but BASE, you will like this...If you like vocals you will hate it....I wrote to Anker to see if maybe I got a broken system...To my ear, this speaker setup acts more like a sub-woofer than a regular speaker system....There is no way to adjust the base and even with low base on the player, the speaker is 80% base.. And NO I was not using the base up feature on the speaker",
      "rating": 4.0,
      "verified": true,
      "author": "#1 Buyer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great Sound Great Price",
      "text": "I bought this for myself as a Birthday Present. I deserve it, right? I bought at least 3 including this one to see which one I liked best. One was the Bose Soundlink Mini. The Bose has only a slight edge in sound quality-but it does not sound enough better to warrant spending the extra money! The Anker sounds incredibly rich. I have had several Bluetooth speakers (including an older Anker) -and for the price there is none better than this one.",
      "rating": 5.0,
      "verified": true,
      "author": "KAC",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "A Huge Step Up From Anker Soundcore 2",
      "text": "I had initially purchased the Anker Soundcore 2 looking for an inexpensive bluetooth speaker that was also durable and waterproof. I was very disappointed in the very muffled sound and mediocre bass. I decided to give the Anker Boost a try and it' s complete night and day. The range is much fuller with actual bass you can feel if you are close to the speaker. If you are considering the soundcore 2, spend the extra $20 (or less depending if it's on sale) and get the boost. I'm very glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "North Purpose",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Quality of Sound is Amazing!!!!",
      "text": "I love music and I love it loud !!! I would compare this Speaker to the Bose version of this speaker. I have been looking for one similar to the Bose version without the price of Bose . I found it and I Am very Happy with the Quality of sound Blue tooth ability and sleek look Amazing!!!! I just received it and could not turn it off I just kept playing one more song every type of music the more I played the more I love this speaker and what a fabulous price. I compare this to the $300 Bose we purchased for my brother for Christmas",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Wagner",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "A great small speaker",
      "text": "My son has an older model of the same speaker. I’ve listened to it several times. I primarily bought this one as a test speaker for my smart tv and it worked great. The only draw back I can see is that if sound source (my tv) is greater than 25 feet from the speaker there will be a lag in the lip-syncing but then speaker still sounds good. I may consider using these for a surround sound for our tv, instead of purchasing a sound bar system. It’s a good buy. Anker makes quality products. You can’t go wrong with purchasing from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Missing the Aux connection",
      "text": "I usually like Anker hardware, but I was extremely disappointed when I received this speaker that was described clearly on the Amazon product page as supporting an auxiliary connection - even recommending purchase of an Aux cord - but no Aux connection. Anker has apparently updated the device and replaced the Aux connection with a TWS capability. This should have been done through a more obvious change to the model or name of the device.",
      "rating": 1.0,
      "verified": true,
      "author": "FatherOf6",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Even a grandma can connect this!",
      "text": "It didn't take much instruction form the Tech Generation to get me listening to my favorite Spotify songs on this handy, portable speaker. It sounds different than my iPhone but I get used to it right away when I start listening. I love that I can have my music with high quality sound anywhere. When on the kitchen counter it helps me forget that I don't love to cook, so I'm cooking more often.",
      "rating": 5.0,
      "verified": true,
      "author": "Momooshka",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Terrific speaker . Very reasonable price.",
      "text": "The sound quality of the speaker is very, very good for the size and price point.. Connecting via Bluetooth was easy. The only negative that I encountered was connecting via the AUX connection, where I had to significantly raise the volume in order to hear it and there a very noticeable degradation of the sound quality. Other than that, it is an excellent speaker that lived up to its ratings.",
      "rating": 4.0,
      "verified": true,
      "author": "DQ Voices",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Fantastic Speaker",
      "text": "This speaker was exactly what I was looking for. I use it out by the pool and wanted something a little water would not hurt. The sound is good and the battery lasts a long time. The speaker is very portable.",
      "rating": 5.0,
      "verified": true,
      "author": "DonnaH",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Best Bluetooth speaker I've owned",
      "text": "I've had a few different Bluetooth speakers. This is the best one I've owned. The sound is rich and full and quite loud without being distorted. I like the sounds as it powers up and down (useful for knowing I hit the button right). It looks nice. This DOES have an auto-off feature. It seems to turn off after about 1 hour of no sound. I have the Soundcore Boost model.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Unreliable Disappointment",
      "text": "I've had this speaker for a little over a year now and it keeps dying out after less than an hour of use. It dies and then there are still two dots of battery showing. Turn it back on and it will last maybe ten minutes. I feel like I'm always plugging it in to charge and then having to do it again in the same day. Definitely not worth the money. Buy the cheaper one instead (that one at least lasted me 2 years).",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. M",
      "helpful_votes": 2,
      "publication_date": 20180302
    },
    {
      "title": "5 Months Later and I still love this Speaker",
      "text": "Ultra good speaker for the price! I've used it daily for the past 5 months at my desk at work and it's perfect! Haven't had a single issue with battery life nor sound quality! My only issue is that my laptop volume up and down don't work with the speaker, I have to press the physical buttons on it to raise and lower the volume, but other than that its been a great device for the past 5 months! I highly recommend getting one if you are in the market for a good Bluetooth speaker!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Tyson",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Not recommended",
      "text": "Not a good product, the sound is muffled and the quality is not lasting. The speakers seem like they are busted and seem to vibrate with bad sound anything over 50% volume. I rate 1 star unfortunately.",
      "rating": 1.0,
      "verified": true,
      "author": "DeLtA^177",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Love this speaker!",
      "text": "I'm so glad I got this speaker. The sound fills the room and is very well balanced. Connects easy. Looks nice and feels like it's solid. We've had a Bose speaker before that cost a lot more and I feel like this one holds up pretty well against that one. The Bose might have sounded a little better but cost a whole bunch more. If I ever need another one then I'll get this one again.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Paultre",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Not bad",
      "text": "Not bad. This next to my Tribit XBoom. The XBoom wins. Crisper mids and highs, bass blends beautifully compared to the Sound core Boost. It's not a terrible speaker, but for $89...? Ehh. Go with Tribits XBoom $69, much richer sounding and blends bass with mids and highs better.",
      "rating": 3.0,
      "verified": true,
      "author": "R.Edward",
      "helpful_votes": 2,
      "publication_date": 20190120
    },
    {
      "title": "Fabulous product.",
      "text": "This is the 3rd one of these I’ve bought in the last 18 months. Sound is awesome. Ease of use and connectivity is incredible. No maintenance and durable as all get out. My kids keep stealing mine, which explains why I’m on my 3rd one. Fortunately, they’re all outta the house now and I’m looking forward to putting this new one into some extensive use.",
      "rating": 5.0,
      "verified": true,
      "author": "richard",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Revived dirty damaged speaker.",
      "text": "I’ve purchased other Anker speakers, and have been very pleased with them. This time not so much. The unit arrived dirty, beat up, stained and damaged. The sound out of it is horrible. It’s very buzzy, and rattling. Follow up. I got an email from Anker offering to replace the speaker at no cost. A few days later I received a replacement unit. This one was in perfect condition and sounded great. The bass was deep and rich sounding, unlike the last one.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Kurtz",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great for recorded books",
      "text": "I am very happy with this speaker. Connection to the player was easy and quick. The speaker is small but not too small to have a good sound. It's not terribly heavy. I use it primarily for listening to audio books. This replaces a Sony SRS-X55 which was over $100 and gave me trouble from the beginning and stopped working altogether after about one year. This has made me skeptical about Sony's quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph L. Breckenridge",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Anker Is Great & Keeps Getting Better!",
      "text": "This is the 2nd Anker Bluetooth speaker we've bought in 3 years - and what a great speaker it is! This one's for home, I'll take the old one (a $45 Sport XL) to work. I like the old one, but it can't match the new one for sound, controls & battery life. Anker just keep getting better!",
      "rating": 5.0,
      "verified": true,
      "author": "J. FOLSOM",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Powerful sound from small speaker",
      "text": "This is a nice looking 20W crisp sound speaker. I did not give it 5 stars, because the first I got DID NOT WORK. I was really surprise since Anker makes \"good\" products, but the first one did not charge and produced no sounds after connecting to my phone. The exchange was flawless with Amazon... So now I am a happy customer. Hopefully this speaker will last.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos E. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Bluetooth dropped then stop working all together",
      "text": "I've had this speaker for about a month and don't get me wrong the sound quality is great. But couple days ago the Bluetooth kept dropping and eventaully stop connecting all together. I tried my laptop and other devices w9th bluetooth and nothing works. I was really expecting a lot more from anker because I've been using their products for years and have never had anything happen till now.",
      "rating": 1.0,
      "verified": true,
      "author": "Adrian",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Thought it would be louder",
      "text": "I bought the highest end of the three Soundcore models to play iTunes in my non-Bluetooth truck. The sound level I would give a 3 out of 10 but there really is no rating for decibels listed for these units. I will try it again tomorrow but I needed a unit to play at least as high as my crappy truck's speakers. I'm trying NOT to compare it to my old school Bose Sound Dock but if it's not markedly better tomorrow, I will probably return it. It would be very helpful if there was an industry-standard decibel rating listed in the product description.",
      "rating": 4.0,
      "verified": true,
      "author": "Carl W.",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Very Impressed",
      "text": "I was a little surprised at the sound coming from this little device. I really believe the sound is almost as good as my Bose sound bar. The 20W speakers do a good job. Since my laptop is my primary machine the speaker in the laptop are next to useless so good aux speakers are a must. Don't care for bluetooth connection so I use the aux jack. Very, very satisfied with this purchase. If it died tomorrow I'd buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney Henderson",
      "helpful_votes": 0,
      "publication_date": 20200726
    }
  ],
  "product_meta": {
    "title": "Portable Speakers, Anker Soundcore Boost 20W Bluetooth Speaker with BassUp Technology, 12H Playtime, IPX5 Water-Resistant, Wireless Speaker with Superior Sound & Bass for iPhone, Samsung and More",
    "description": "SoundCore Boost\nThe Premium Bluetooth Speaker with Adjustable Bass\n\nFrom ANKER, the Choice of 20 Million+ Happy Users\nIndustry-Leading Technology\nWorry-Free Warranty\n\nLower The Tone \nSimply hit the \"UP\" button, and your tracks will play with an extra dose of bass. Personalize your music and set the mood.\n\nHigh-Fidelity Audio \nSoundCore Boost delivers 20W of powerful, crisp audio via dual high-performance drivers, and twin passive subwoofers.\n\nPlay Further \nListen for up to 12 hours from a single charge. NFC enables instant pairing, Bluetooth 4.2 provides play from up to 66ft, and aux-in allows you to plug and play.\n\nMusic and More \nIn-built microphone turns the Boost into a hands-free speakerphone, while a 5200mAh external USB port allows you listen and power-up simultaneously.\n\nAudio Everywhere \nDesigned to complement any interior - SoundCore Boost looks great at home, and away. Compact build and IPX5 water-resistant rating means the Boost slips into your bag and plays practically anywhere.\n\nWorry-Free Warranty \nAt Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.\n\nNote \nPress \"power\" once to turn on, and once to turn off.\nLong press \"power\" to enable Bluetooth pairing.\nPlaytime varies depending on volume and audio content.\nDoes not support Qualcomm Quick Charge.",
    "rating": 4.5,
    "feature_bullets": [
      "Boost Your Bass: Enhance your audio at the press of a button with patented Anker BassUp technology. Make your music sing, with solid lows at any volume.",
      "Superior Sound: Dual drivers and twin subwoofers deliver 20W of powerful, high-fidelity audio. Boasting room-filling sound—ideal for podcasts, through to parties.",
      "Play and Charge: Listen for up to 10 hours / 210 songs, and power external devices with a USB port packing Anker's trademark battery technology.",
      "At Home, Anywhere: A classic, minimalist design complements virtually any interior. Portable build and IPX5 water-resistance means you can effortlessly enhance your music on-the-go.",
      "What You Get: Anker Soundcore Boost Bluetooth speaker, Micro USB charging cable, welcome guide, our worry-free 18-month warranty and friendly customer service."
    ],
    "specifications": {
      "Product Dimensions": "9 x 3 x 5 inches",
      "Item Weight": "1.85 pounds",
      "Manufacturer": "Anker",
      "ASIN": "B01N4V4X5M",
      "Item model number": "A3145011",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.5 out of 5 stars10,198 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#33 in Portable Bluetooth Speakers#380 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 1, 2017"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": 49.99
  }
}