{
  "website_summaries": [
    {
      "verdict": "Coming from the Skechers Burst Collection, the Skechers Burst – Donlen, with the Air Cooled Memory Foam insole, offers instant superior comfort and maximum cushioning. The lightweight feeling and flexibility of this low-top shoe are offered by its soft, responsive Burst Compound. Its Burst Compound midsole provides great energy response and impact protection. The stylish design of the shoe also comes in a variety of colorways and with each pair sold at a wallet-friendly price.",
      "pros": [
        "A lot of the reviewers expressed that the Skechers Burst – Donlen feels lightweight on foot",
        "The Skechers Burst – Donlen provides great comfort on foot as what most of the users stated",
        "A good number of buyers loved the stylish design of the sneaker",
        "Several of the users claimed that the shoe provides good arch support and overall cushioning",
        "The shoe can match with various outfit types, according to some of the commenters",
        "A handful of reviewers have been loyal users of the shoe, owning a few pairs already",
        "Most users admired the durability of the shoe",
        "One buyer said that the shoe didn’t need any break-in period",
        "A user noted that the shoe dries up quickly as he uses them for fishing",
        "Most reviewers said that they recommend the product",
        "A buyer can choose from a variety of colorways offered for the shoe",
        "One can purchase the shoe at a rather affordable price"
      ],
      "cons": [
        "A reviewer claimed that the Skechers Burst – Donlen needs a removable insole",
        "One user complained about the sneaker getting loose in fit with wear",
        "A few of the commenters said that the shoe fits a little wide on foot"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.0,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Another great buy.",
      "text": "Skechers leisure shoes have got to be the most comfortable shoe ever, i suffer from aching feet when walking but these are so comfortable it's like walking on air, since i started wearing Skechers i won't buy another brand, i have about 5 pairs now and these are really nice, they look stylish and feel great. One thing you have to be aware of with Skechers is that they all 'breath', they let the air in to cool your feet but that means you don't want to go splashing in puddles with them!",
      "rating": 5.0,
      "verified": true,
      "author": "colin thomas",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "High hopes but sadly Worst Buy Ever :(",
      "text": "If I could give zero stars I would - Was so excited to find a similar pair to my usual Skechers but these are honestly the most uncomfortable sketchers I’ve ever tried - have started to fall apart after a few wears :( really really disappointed I’m afraid- these were complete waste of money - if I could return I would!",
      "rating": 1.0,
      "verified": true,
      "author": "Stacey Twintastic",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Like walking on the moon!",
      "text": "I bought these as they were on offer, not sure about the looks. When they arrived I really loved them, they're half super-modern style and half knitted by your nan with love :) They are supremely lightweight and have the bounciest most comfortable soles ever. Superb",
      "rating": 5.0,
      "verified": true,
      "author": "alw Audio",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "they are amazing to walk on",
      "text": "Never owned any memory foam shoes before, bought these during this cyber monday week for half price, they are amazing to walk on, walking 5 miles feels like 2 miles honestly, because I think that's the point of memory foam. I personally don't think most memory foam shoes look great, and these look about as good as I think you can get without losing performance.",
      "rating": 5.0,
      "verified": true,
      "author": "rgesrhg",
      "helpful_votes": 2,
      "publication_date": 20171128
    },
    {
      "title": "Another pair to the collection",
      "text": "I have about 10 pairs of various Skechers , all are so light and comfortable . I won't buy anything else . I couldn't resist at this price",
      "rating": 5.0,
      "verified": true,
      "author": "Villan57",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Great sneaker",
      "text": "A very light shoe - wouldn’t say it was a trainer but more a lace up sneaker and exactly what I was looking for my holiday. True fit - I’m a size 13 wide fitting .",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Middleton",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Very uncomfortable from the top rear",
      "text": "The back of this shoe is very uncomfortable because it is hard and it digs into the back of your foot. The trainers look really good and are comfortable from the bottom, but they caused me a lot of pain and that is even after wearing them for 2 days - which I thought would make them soften.",
      "rating": 1.0,
      "verified": true,
      "author": "athar",
      "helpful_votes": 3,
      "publication_date": 20171219
    },
    {
      "title": "Great shoes for the money",
      "text": "First set of sketchers and won't be the last, so light and comfortable. Great shoes don't know how long they will last but after 2 weeks all seems amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "coops",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Not great..blisters .",
      "text": "Mine where comfy for 2 weeks and then they started to hurt my feet it multiple ways. And started falling apart inside.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh atkinson",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great fit",
      "text": "I have trouble getting great fitting shoes as they normally don’t fit properly but these do. They feel like walking on cushions and the fit is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Wall",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Ideal!",
      "text": "My first pair of Skechers and they are excellent - just what I needed in a casual black shoe. And they fit perfectly without any problem from the high ankle shape that other reviewers have highlighted.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen James",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Good pair of trainers",
      "text": "Still have these now, very comfortable. Soles faded fairly quickly but none the less are still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "LJG",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Comfy as ever!",
      "text": "Amazing product, amazingly comfy, don’t want to wear anything else, tread worn pretty quick but may be down to myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee.",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Size does matter",
      "text": "I was expecting wide fitting shoes, but ended up with standard fit, hoping that these will not give me walking problems",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Lovell",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Great trainers",
      "text": "Once again a pair of great fitting shoes, Sketchers never let you down with the quality and workmanship, like walking on air.",
      "rating": 5.0,
      "verified": true,
      "author": "leonard wilson",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Im not happy",
      "text": "Im not happy at all, size 10 is way too large, I changed for a 9.5 but still too large.",
      "rating": 1.0,
      "verified": true,
      "author": "Japs3016",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "It's like having the most comfortable slippers in the world but ...",
      "text": "If you don't have these, you are missing out. It's like having the most comfortable slippers in the world but your outside",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. I. Bekri",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Sketchers trainers",
      "text": "first time I have worn sketchers of any sort and I found them to be very comfortable and fit was good to",
      "rating": 5.0,
      "verified": true,
      "author": "mark reeves",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Good quality, very comfortable and great price",
      "text": "Comfortable. My son has broad feet so sketches are perfect for a wider fit and give well. He’s a size 41/2 so bought the 5. Fits perfect. He says the soles are very comfortable like slippers. Look smart. Quick delivery. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerry from Worksop",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Different from last order",
      "text": "I have ordered another pair about a year ago (probably from ebay) and the old one was a bit different , the layer under the laces were fixed to the sides, this one has a more usual built. I liked that other one a little bit better, but this one is good too.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "One of the most comfortable shoes (if you use ankle length socks)",
      "text": "They look perfect and the memory foam is incredibly comfortable, can't believe I hadn't tried this before. Only slight problem is when using invisible socks the shoe can hurt the back of your foot. With ankle length socks it's perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Muhamad G.",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Fantastically comfortable trainers!",
      "text": "Fantastically comfortable trainers...best I have ever owned . Would wholeheartedly recommend them to others looking for very comfortable trainers.",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon Johnston",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Five Stars",
      "text": "Bought for work as on feet all day. Fit as expected. Very comfy.",
      "rating": 5.0,
      "verified": true,
      "author": "IJ",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "great shoes",
      "text": "great shoes as expected from skechers would recomend to anybody",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Perfect for daily use",
      "text": "They're comfortable and not narrow, this is why I use them every day!",
      "rating": 5.0,
      "verified": true,
      "author": "aserto",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Skechers No 1",
      "text": "Love Skechers and these didn’t let me down, and what a great price, more please",
      "rating": 5.0,
      "verified": true,
      "author": "stephen coles",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Heel lip causes irritation",
      "text": "I've had a pair of Skechers before and they're amazingly comfortable, but this one unfortunately fails to hit the mark. They are well cushioned as expected and when standing still or walking a short distance, they're comfortable. They look great too. Unfortunately the heel lip isn't well designed - it's caused the top of my heal massive discomfort resulting in a sore redness after a moderate amount of walking over an ~8 hour period. I couldn't wear these unless I had thick socks on to cause less rubbing. Had the heel lip had any sort of padding, this wouldn't be an issue.",
      "rating": 2.0,
      "verified": true,
      "author": "TechLAD",
      "helpful_votes": 2,
      "publication_date": 20171216
    },
    {
      "title": "Comfortable, but issues causing heel blisters",
      "text": "The shoes are very light and comfortable fitting as you’d expect from Skechers, however the back of the shoe is not well designed. It’s pretty solid and rubbed against my heel / Achilles causing blisters, so had to return them.",
      "rating": 2.0,
      "verified": true,
      "author": "Ross Basketter",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Memory foam is a bad idea in shoes",
      "text": "Do not buy these. Caused blisters on both heels within a mile due to the memory foam allowing movement up and down against the back of the shoe. Advertised as the most comfortable shoes in the world. What a joke. They are so uncomfortable I can't wear them.",
      "rating": 2.0,
      "verified": true,
      "author": "mr hd-dvd",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "nice comfy trainers, good gripping sole",
      "text": "I've been thinking of sketches for quite some time, when it was time to get rid of my under armour these were my choice considering the good price they were selling at, very comfy sole, the best i've ever had. Nice shoes and design too, cosnidering the fact that sketchers have no good design aesthetics",
      "rating": 5.0,
      "verified": true,
      "author": "Amadeus",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Sooooo comfortable!",
      "text": "These were perfect. Very comfortable. I'm on my feet for 12 hours straight, and these trainers are the 1st I've had that when I wear, I get no feet or lower leg pain. Cool feet too, not hot or sweaty! So good, I bought another pair within days.",
      "rating": 5.0,
      "verified": true,
      "author": "andy richards",
      "helpful_votes": 0,
      "publication_date": 20190712
    }
  ],
  "product_meta": {
    "title": "Skechers Men's Burst-Donlen Trainers",
    "description": "Locate that sweet spot where comfort and style combine in the SKECHERS Burst - Donlen shoe. Soft woven sporty knit fabric upper in a lace up casual sneaker with stitching accents and Air Cooled Memory Foam insole.",
    "rating": 4.4,
    "feature_bullets": [
      "Memory foam",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Heel Type: Flat",
      "Shoe Width: Medium mens_us"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "30.48 x 30.48 x 12.7 cm; 226.8 Grams",
      "Date First Available": "21 Sept. 2015",
      "Manufacturer": "Skechers",
      "ASIN": "B0714R331H",
      "Item model number": "52114",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Nordic Walking Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 59.85
  }
}