{
  "website_summaries": [
    {
      "verdict": "Low price tool that delivers good quality. Has just enough adjustable features to work for basic jobs.",
      "pros": [
        "Will work with 18-gauge brad nails ranging in size from 0.625 to 2 inches in length",
        "Also can handle crown staples",
        "Easy to adjust the depth of the nails",
        "Rubber grip ensures your hands won't slip, even while using this tool for long periods",
        "Can rotate exhaust air vent 360 degrees",
        "Good value"
      ],
      "cons": [
        "Not powerful enough for some people",
        "Will have some misfire issues"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I was very pleased to receive this",
      "text": "I was very pleased to receive this, used it within minutes after receiving it. Quality is far more then I imagined and ready to go right out of the box. If you are one of those amature carpenters this is certainly the product for you. Seen some bad reviews but I do believe those where from people that failed to follow the guidelines in the owners manual. This is an excellent quality tool, well made and as of yet I have not had any problems and to be honest dont expect to have any",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 17,
      "publication_date": 20180120
    },
    {
      "title": "Great Tool",
      "text": "I originally bought this to build beehive boxes but have ended up using to attach pallet wood to walls. It has been used probably more then intended and has not missed a lick. Wall and ceilings. Love that it is light weight and is able to hold up under such extreme use. Had a couple of jammed staples, but this is easy to take apart and remove any and back in business. Wonderful tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie Endsley",
      "helpful_votes": 13,
      "publication_date": 20181229
    },
    {
      "title": "Descent air nail gun",
      "text": "Descent air nail gun, skips sometimes at 60psi, works much better at 80psi. Would be nice if trip tip had rubber coating, tends to leave mark on soft wood - pine baseboard (indentation, just another mark to fix). Good general purpose around the house brad nailer.",
      "rating": 4.0,
      "verified": true,
      "author": "JKH",
      "helpful_votes": 15,
      "publication_date": 20171018
    },
    {
      "title": "Good for the money....not intended for everyday use.",
      "text": "Just finished installing wood floors in my house and this little thing did what I needed for trim and such. The only thing is sometimes it would not set a brad all the way in the wood. Every now and then, it was like a misfire or something. Still a good product for small, periodic projects. I wouldn't use it as a professional contractor or anything that would require daily usage.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel W.",
      "helpful_votes": 13,
      "publication_date": 20170908
    },
    {
      "title": "Cheap and it works",
      "text": "It works just fine...I've mostly used it with staples but I've also used brad nails successfully too. I didn't give it a five because I've had a couple of jams and it also leaks air at the connector. You have to jiggle the air connector and it stops...but if you don't it will run the air tank down. Overall though it is a great buy....inexpensive and it works. No major complaints.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey W. Kilgo",
      "helpful_votes": 11,
      "publication_date": 20171121
    },
    {
      "title": "No support, No Instructions, Misfires and trigger will stick.",
      "text": "Manual is more of a legal safety guidebook with specs on the type of staples and nails that the unit will take. Insertion and adjustment instructions do not really exist and Troubleshooting section refers to damaged O-rings, Trigger Valve Head, Valve Stems, Seals etc. all on a brand new unit. Manual mentions to contact manufacturer for additional information, but no phone, fax, email or address is provided. Doing a search for the manufacturer on-line just brings you to an Amazon advertisement. Machine seems to be nicely made for the price, but it will misfire and the trigger will stick quite frequently, I highly recommend that you spend a few dollars more and buy a brand that you can rely on.",
      "rating": 3.0,
      "verified": true,
      "author": "amarevw",
      "helpful_votes": 20,
      "publication_date": 20170402
    },
    {
      "title": "Does not work",
      "text": "Mine didn't work from day 1. It was leaking air. My return window had passed before I used it the first time so I called the company. They told me I could return it, but did not provide a pre-paid label, which means I have to pay to return it. They have not been responsive about a free return, even after additional tries. I would not purchase this item, especially because I did not even get one use from it. Luckily, I was able to borrow my neighbor's gun for my project.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20191024
    },
    {
      "title": "Don’t waste the money it’s literal junk",
      "text": "This thing arrived and I tried it . It skips nails and jams constantly . Very poorly constructed feels like it’s going to fall apart . Being a combo nailer/ stapler is NOT a benefit , it actually causes more misses and jams than it’s worth... Even if you are just a weekend garage warrior this thing will let you down . I used it once and put it back in the case and never looked at it again ... it’ll go out at the next yard sale . Just spend the $40 or so at the big box store for a name brand nailer .",
      "rating": 5.0,
      "verified": true,
      "author": "John Lauler",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Good for the price but inconsistent",
      "text": "Can't argue with the value for the price. Most of the time it drives the brad or staple in just fine. Every once in while it will leave two or three in a row sticking out anywhere from just proud to well above the surface. If you are stapling chicken wire, no big deal, but if you are fastening something that you want to look nice, it is a pain to try and remove the staples without damaging the surface. Once again, you get what you pay for. If you don't mind a little inconsistency, you'll probably be happy with this tool.",
      "rating": 3.0,
      "verified": true,
      "author": "mTeryk",
      "helpful_votes": 3,
      "publication_date": 20180227
    },
    {
      "title": "Very nice nail gun",
      "text": "So far this has been a great little nailer. I'm working on a project using 1x2s, and it's saving me a ton of time although once in a while when I pull the trigger, it fires, but nothing comes out. I like the fact that it will take up to 2\" brads which my last nail gun would not. The manual, however, is not so great. The box includes a small bottle of oil, but it's not even half full, and the manual doesn't tell you anything about what kind to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Pat N",
      "helpful_votes": 2,
      "publication_date": 20171106
    },
    {
      "title": "Good when you're in a pinch",
      "text": "It has a habit of misfiring every few shots. 🙄 It's a definite pain in the ass, but I have to deal with it for now until I can get one that's of better quality. It jams quite frequently, too. But not nearly as much as the misfiring. I'm predominantly using it for upholstery (currently my four Parsons chairs), but I might just return it, because there's a safety mechanism in the front that prevents me from getting into corners. And as far as I can tell, there's no way to remove it.",
      "rating": 3.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Air leaks had to return.",
      "text": "The product was leaking air after 1 use which made where we were unable to use it bc the air was leaking out the back loading pressure.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara Call",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "You won't be sorry you bought it.",
      "text": "I love it. Great service so far and looking to use it for a long time to come. I would repurchase this product, and I do recommend it to anyone looking for a brad nail and staple gun of this size and gauge. And the price beats the other well known makes, and to my knowledge works just as good if not better than the more pricier ones.",
      "rating": 5.0,
      "verified": true,
      "author": "evesspirit",
      "helpful_votes": 2,
      "publication_date": 20170825
    },
    {
      "title": "Handy - Durable - Built well",
      "text": "I am actually surprised. I have used this for many projects already. I have had one jam - it was the nail lines fault - out of about 2,000 nails. Even the ham was so easy to fix. Took less than a minute. Not commercial quality - but a commercial contractor could make money using this product. I enjoy it. Built well.",
      "rating": 5.0,
      "verified": true,
      "author": "Fuller",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Cheap, cheap, cheap",
      "text": "Second one I ordered. First frequently did not shoot staples. Replaced it, new one worked okay first few times I used it. After 30 days, it broke. Cheap, cheap, cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Frequent User",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Allowed me to finish the job",
      "text": "I had a Senco that I bought about 20 years ago. I don't use it often, but was assembling frames for my new hives. My Senco died, so I searched Amazon ad found this one. Specs are very similar. I don't have an idea about long term life of this tool, but it got me out of a man (literally).",
      "rating": 4.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "ZERO STARS!!!!!",
      "text": "DO NOT BUY!! THIS IS A PIECE OF JUNK. STOPPED WORKING AFTER 3/4 OF MY WAY THROUGH STAPLING CHICKEN WIRE TO A NEW RUN I WAS MAKING. MAYBE GOT 50 STAPLES IN ALL TOGETHER. THANKS A LOT VALU-AIR. I GUESS THE NAME SHOULD HAVE TOLD ME SOMETHING.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara Leonard",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Sturdy, Easy to load",
      "text": "Purchased this nailer to replace a broken black and Decker trim nailer. Seems sturdy, easy to load. May use Staples or trim nails. Could have better instructions for a first time user, but a builder would be able to figure it out pretty easily. I bought it for light use, non commerical, so I cannot attest to that.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Well designed, well-constructed",
      "text": "After my 15 year old Porter Cable nailer stapler broke in the middle of a fencing project, I found this one on Amazon. For the price, thought I would take a chance on it. The day after I got it I ran 400 1 inch staples into 4X4's without any issues. I couldn't be happier",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff s.",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "This nail gun is JUNK!!",
      "text": "Save your money and time! This nail gun is a perfect example of “You get what you pay for!” I used it, or tried to used it for about 20 minutes before I took a hammer to it and tossed it in the garbage! If you want a nail gun that miss fires, jams, leaves marks in the wood and doesn’t sink the nail 80% of the time, then this gun will work great for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Soccer3Mom",
      "helpful_votes": 2,
      "publication_date": 20180908
    },
    {
      "title": "Great tool for the price.",
      "text": "Works well, used staples, drive , pressure was good unit, a little heavy, but I like the dual purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "buddysjr",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "It’s ok for small jobs",
      "text": "Jammed a few times but for the price it isn’t bad for small projects. Came with a nice durable hard case. If you’re a professional carpenter I would suggest buying a more expensive nail gun.",
      "rating": 3.0,
      "verified": true,
      "author": "Freakshow",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Solid",
      "text": "I wasn't sure how this would do..but for the 10 times year I use it , it works great and seems to be holding up well.. If buy from them again",
      "rating": 5.0,
      "verified": true,
      "author": "Seth Leighton",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Great tool for stapling or nailing!",
      "text": "Very happy so far with this nailer/stapler. I've already used both in this tool and so far, it is working flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "GSC",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great value for a low price",
      "text": "Purchased this nailer because of the price and good reviews. I have used it on several projects so far and it has worked great. Definitely worth buying considering how much cheaper it is than the big name brand nailers out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Deforest",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Works Great!",
      "text": "Used it today for the first time to assemble frames for a beehive. Nailer worked perfectly on the minimum air setting.",
      "rating": 5.0,
      "verified": true,
      "author": "John Petrie",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Great, simple stapler/nailer",
      "text": "This tool is just what I wanted...inexpensive, light, easy to set up & operate. It takes up to 2\" nails & staples and comes with a starter pack of both (2\") as well as a small bottle or nailer oil.",
      "rating": 5.0,
      "verified": true,
      "author": "onepiper",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Air tools",
      "text": "I love the use f air tools for my small projects. they are light weight and is to get in small places. this stapler works great and was a Great value. Thanks Gene",
      "rating": 5.0,
      "verified": true,
      "author": "Gene",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Great gun",
      "text": "This has been great been remodeling our home and it has been a great benefit",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great buy",
      "text": "Just as good as any high dollar unit. Highly recommend this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "NC Res.",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Good quality nailer!",
      "text": "Great tool works good with a variety of fasteners! I would recommend the flexzilla hose its really light and flexible making the tools easier to maneuver!",
      "rating": 5.0,
      "verified": true,
      "author": "Robbie",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Great $25 gun",
      "text": "Great $25 gun for building chicken coops. Shoots BOTH staples and brads. Has an adjustable depth for attaching wire cloth/chicken wire. Yes you could get the same thing from harbor Freight for about $15, but you have to drive there, and deal with potentially opened packages...",
      "rating": 5.0,
      "verified": true,
      "author": "W. Higgins",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Easy, lightweight and amazing!",
      "text": "This tool works great! I’m a female and need something that is easy to handle! It worked great for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Great Service",
      "text": "I used this gun driving 1 1/2\" staples for about 10 hours with absolutely no problem, not a single jam or miss fire. But then the drive piston broke and the stapler was finished. The seller contacted me and provided a full refund :) , I would have accepted a replacement, but had gone to my local HF and bought one there since I had a project to finish. Not high quality, but great customer service.",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Worked well when I needed it most.",
      "text": "Fast shipment. Item just as described. Just used it to perform a fence repair and it worked just fine. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald J. West",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Works like a tool three times it's price.",
      "text": "Arrived yesterday. Tried out today. Works perfectly at a much lower air pressure than my other two brad/staplers. Solid feel. Responds well during pressure adjustment. I'm gonna like this tool. Fantastic price.",
      "rating": 5.0,
      "verified": true,
      "author": "lee whitworth",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Lightweight and handy case",
      "text": "Works great. Used it on an aviary where I am using a lot of wire netting. Using long staples also. Have not had any problems",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Ojeda",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "This tool is great!",
      "text": "Easy to handle and works like a charm. I would recommend the Valu-Air SF5040 2\" 18 Gauge 2 in 1 Brad Nailer and Stapler with Carrying Case to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen Holt",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Cheap, and inconsistent",
      "text": "The main problem is that it was shooting staples about 70% of the time. This was a big negative for me. After about 1000 staples it improved to 80 or 90%.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Failed after first use",
      "text": "The unit ran about 6 cycles of staples and then started jamming. Seller immediately refunded the purchase price when I informed them of its performance.",
      "rating": 2.0,
      "verified": true,
      "author": "Tim A. Graham",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "works great for being cheap AF",
      "text": "for looking like a cheap POS, it works pretty dam well. The nails it comes with though jam alot, but once it got oiled up and fresh nails it worked great",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Simple to use",
      "text": "Good product for the price, had it jam on me once but was a simple fix. Recommended for it's price.",
      "rating": 4.0,
      "verified": true,
      "author": "John Stevens",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Great tool for price.",
      "text": "Great tool. Have used it a lot the last few months. Nails and staples. Has only jammed once and is pretty easy to disembble tip to remove jammed nail.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine K. Slick",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Gun does not work consistently when using staples",
      "text": "I've used this product once using 1\" staples and the gun misfires about every 4th try. Not sure if it's any better with nails.",
      "rating": 2.0,
      "verified": true,
      "author": "Blaine smith",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Nail gun",
      "text": "Was a bit small, but for the price it was good for a gift",
      "rating": 5.0,
      "verified": true,
      "author": "Romana",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Works great",
      "text": "I've used this tool for hours on end with various staples and finish brads. Works great and never a jam or any issue so far. Amazing for the price ... paid for itself easily already.",
      "rating": 5.0,
      "verified": true,
      "author": "KW Kinne",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Happy here",
      "text": "Works great. A fraction of the price of brand name nailers.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Mccormack",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Fell apart after firing 10 fasteners",
      "text": "Wow. I shot maybe 10 fasteners with this and the entire depth gauge fell apart. Bearings and washers everywhere so I couldn’t even put it back together. Spend the extra $10 or $20 and get something moderately decent. Not this.",
      "rating": 1.0,
      "verified": true,
      "author": "Crispin Weir",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Good Tool",
      "text": "Works perfectly. Didn't expect it in it's own hard case. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Very Cheap, do not Buy.",
      "text": "I used the product 4 times, and now the trigger does not function. I missed the return time by 10 days, so I will just have to lose that money. This is a cheap product and I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "David Ruhlman",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "This gun just doesn't work properly",
      "text": "You can shoot once or twice and then it doesn't work and you have to keep opening it up then closing, use a couple more times then do this again. WOULD NOT RECOMMEND - should not buy. Very dissatisfied",
      "rating": 1.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Glad we purchased it",
      "text": "Purchased a similar gun at Home Depot for $100, promptly returned it after receiving this one. It has held up well stapling cedar fascia boards around a 3000 sq* house. No issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Poor performing. Skips every third/second nail our staple",
      "text": "Poor performing. Skips every third/second nail our staple. Fires hammer but no feed. Tried different sizes, different pressure/lubrication. Very poor performing gun. I do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Jansheski",
      "helpful_votes": 2,
      "publication_date": 20170904
    },
    {
      "title": "Not working correctly",
      "text": "When I was using the tool using staples I had to go slower than I could because it would not fire anything and had to go back to make sure one was there.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura Esper-Hart",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Mine lasted less than a box of staples.",
      "text": "I guess you get what you pay for but only lasted a couple of projects, less than a box of staples. I followed all instructions on use and care.",
      "rating": 1.0,
      "verified": true,
      "author": "Anita",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Good price for an occasional use.",
      "text": "Good for the occasional home owner use. Fixed a fence that an oak destroyed without any issues and it still seems fine.",
      "rating": 5.0,
      "verified": true,
      "author": "ER",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Broke after 15 times of use",
      "text": "Used one half a roll of staples and it broke, the bolt that holds the pin in fell out and spring came out. They can't be found.",
      "rating": 1.0,
      "verified": true,
      "author": "Marleen Morris",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Nice quality!",
      "text": "Good quality. I will use for Staples only. But great product for driving Staples.",
      "rating": 5.0,
      "verified": true,
      "author": "DG",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Take the chance",
      "text": "Took a chance because of the low price. This item was received quickly and meet all expectations. Have used it on several home projects and have experienced zero problems. Excellent purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Henry ",
      "helpful_votes": 0,
      "publication_date": 20170218
    },
    {
      "title": "Waste of money",
      "text": "never worked! Couldn't even fire one nail! Waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "nornat",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Case is great to have portability.",
      "text": "Cheap and seems to be functional, will let you know more once I use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Thomas",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "VERY happy",
      "text": "VERY powerful at 100 psi. Scared me at first. Thought I was using a framing nailer. Rubber grip. Solid construction nice case. NO OIL. The bottle of oil was empty but I think they sent it for you to refill but I have a big bottle anyways. Love this thing. I've only used it twice for Speaker boxes. Just remember the trip trigger isn't where the nail is going to go lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Nascani",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Easy to load and use.",
      "text": "Great nail gun. I use for small and large projects!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Good tool for the price. 😁",
      "text": "I recieved this product and the only complaint I have is that it does not come with a manual that explains how to use it. The manual that comes with it gives you quick familiarization but that’s it. Thank goodness for google..lol. But it works well and saves on the smacked fingers from trying to drive in small nails. It helped make my tank stand project go a lot quicker.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Casto",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Well made",
      "text": "Got this for a wood worker I no he loves it",
      "rating": 5.0,
      "verified": true,
      "author": "stanley",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Excellent",
      "text": "More than a 1000 Staples later still running strong, compares to all other brands in quality and durability, happy with purchase save some real $",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "For the price I'm not sure how you get better than this",
      "text": "For the price I'm not sure how you get better than this. Was able to put back on all the trim in the house that was removed during remodel. Tool performed flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Athair11",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Nice tool",
      "text": "I liked everything about it, no adjustment needed for the length of Staples I was using, I was using it to repair a roof on a rv",
      "rating": 5.0,
      "verified": true,
      "author": "maddog",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Stopped working after 2nd time using it.",
      "text": "This is item stopped working just after the second use. It’s cheap in price and material. Don’t purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "PCakes",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Just what I wanted.",
      "text": "Light weight and easy to handle. Looks and feel strong. The price is right, highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Rene",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Great quality item.",
      "text": "Great quality item and works real well. Came with a case, which is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Campion Journot",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Good trim nail gun.",
      "text": "Very pleased with this little nail gun. It is only for hobbie use not an industrial or trade. Works great for what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Bamman",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "18 Guage 2 in 1Brad Nailer and Stapler with Carrying Case",
      "text": "My husband was very pleased with this product. I got it for him for Christmas and he said it did exactly what he needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Colegrove",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Five Stars",
      "text": "Great gun does the work around the house and more would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "joel",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Does was its supposed to",
      "text": "It does what it is supposed to do, can't make a pbj but building pipe boxes for the basement sure was made easier",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Five Stars",
      "text": "Very nice product. Works as advertised. Instruction sheet poor--especially on how to insert staples.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill W",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "great tool for the money.",
      "text": "drives my 1.5 inch staples and 2 inch finish brads with no problem. Be aware that when you drive finish brads that you will get a dimple the size of a staple. nail is on the left size of the staple size dimple.",
      "rating": 4.0,
      "verified": true,
      "author": "Ruby James",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Five Stars",
      "text": "Just received this item but so far it's very good works fine no problems",
      "rating": 5.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Reliable",
      "text": "Using it with S S staples building a fence, working great.",
      "rating": 5.0,
      "verified": true,
      "author": "S G",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "... be well lubricated first few uses after that work like the more expensive brands",
      "text": "Works as its supposed to takes some adjustments to get used to the depth settings needs to be well lubricated first few uses after that work like the more expensive brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Five Stars",
      "text": "Bought it for the hubby, he likes it and that's what matters.",
      "rating": 5.0,
      "verified": true,
      "author": "AK Glenmist",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Five Stars",
      "text": "Worked well for a specific project on installing fake ship lap in the bath.",
      "rating": 5.0,
      "verified": true,
      "author": "Levon",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "All the way around this is a great product, 2 in 1",
      "text": "All the way around this is a great product, 2 in 1, feels heavy duty, came in time, it is in its own tool box, be sure to have pressure regulator and air filter and lubricator inline, do not connect directly to air compressor as it suggests. Sam from Anderson CA",
      "rating": 5.0,
      "verified": true,
      "author": "sam",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "This is good for light duty home projects at a great price",
      "text": "Seems well made. I appreciate the quick connect, hard case and allen wrenches. This is good for light duty home projects at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "jjj",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Seller is one of the good ones==always hope for this one if something goes wrong",
      "text": "Really nothing to dislike== can't say that about many. May we all have more like this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck C.",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Great tool",
      "text": "Stapling rabbit wire to window frames for a chicken house. Tool worked as expected. Just what the Dr. ordered.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry W Kammlah",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Easy to adjust and fits a variety of nails",
      "text": "Works well. Easy to adjust and fits a variety of nails. Light compact yet strong.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Stacey",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Five Stars",
      "text": "Works great I have went through about half of a box of 5000 staples with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "hubert r eldridge",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "For more info on the use and operation of this ...",
      "text": "For more info on the use and operation of this Gun, send a email to CastleRock Tools - Amazon Marketplace x1hdyjy83kpfttr@marketplace.amazon.com",
      "rating": 4.0,
      "verified": true,
      "author": "William R Morgan",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Valu-Air SF5040 2\" 18 Gauge 2 in 1 Air Brad Nailer and Stapler it works!!",
      "text": "Its easy to work with especially for home projects. Light weight and came with a nice case. It also get the job done with the two in one staple and nails.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason Higgs",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Great value",
      "text": "So far so good. I was skeptical at first. But once I put this thing into action it’s a beast. Great for the DIY’er. Drives 2 inch brads and 1 5/8 staples with authority.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy C",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Not great.",
      "text": "Not the best. I had issues on the first day. Went back to using my old one.",
      "rating": 2.0,
      "verified": true,
      "author": "jbdvill",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Good value",
      "text": "Great tool for the price. It drove the extra long staples all the way in.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Szyszkowski",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "This is a great little staple gun / brad nailer for the money ...",
      "text": "This is a great little staple gun / brad nailer for the money it can't be beat. So far it has done nothing wrong",
      "rating": 5.0,
      "verified": true,
      "author": "kp31",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Five Stars",
      "text": "Great quality for the price. Does a great job. Be sure to keep the PSI per recommendations.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Reed",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Seems to be a good piece of equipment",
      "text": "I haven't got to use it yet but just for the weight and durability seems to be a good piece of equipment",
      "rating": 4.0,
      "verified": true,
      "author": "mark Alan Baker",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Five Stars",
      "text": "I’ve only used it once but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Falisha",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "like",
      "text": "Well made, like it. Easy to use. Can't get the depth setting dialed in perfect though",
      "rating": 4.0,
      "verified": true,
      "author": "Candi",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Easy to change staple lightss.",
      "text": "Build a crate for my sister grandfather clock today. Uses for the first time today. So far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "eric anderson",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "This has been a good tool and for the price of it",
      "text": "This has been a good tool and for the price of it, seems like what I want. Now send me the free tire inflator as I forgot to put my name down when I filled out the review. Arnold Criddle",
      "rating": 5.0,
      "verified": true,
      "author": "Arnold Criddle",
      "helpful_votes": 0,
      "publication_date": 20170315
    }
  ],
  "product_meta": {
    "title": "Valu-Air SF5040 2\" 18 Gauge 2 in 1 Brad Nailer and Stapler with Carrying Case",
    "rating": 4.4,
    "feature_bullets": [
      "Drives 18-ga. brad nails 5/8\" and 18-ga. 1/4\" crown staples 5/8\"-1 5/8\"",
      "Lightweight aluminum alloy body weighs only 3.2 pounds. Working air pressure 70-110 PSI (air compressor needed)",
      "Tool-free depth-of-drive adjustment and quick jam release",
      "360 degree adjustable exhaust and no-mar rubber tip",
      "Include carry case and two strips of 18GA brad nails/staples"
    ],
    "specifications": {
      "Manufacturer": "Valu-Air",
      "Part Number": "SF5040",
      "Item Weight": "3.2 pounds",
      "Product Dimensions": "11.8 x 11 x 2.7 inches",
      "Item model number": "SF5040",
      "Batteries": "1 Lithium ion batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Style": "Brad Nailer and Stapler with Carry Case",
      "Material": "Aluminum",
      "Power Source": "Air-powered",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B01N038KV5",
      "Customer Reviews": "4.4 out of 5 stars539 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#29,316 in Tools & Home Improvement",
      "Date First Available": "December 14, 2016"
    },
    "categories": [
      "Brad Nailers",
      "Power Tools",
      "Tools & Home Improvement",
      "Nailers & Staplers",
      "Power & Hand Tools",
      "Nailers"
    ],
    "price": 42.95
  }
}