{
  "website_summaries": [
    {
      "verdict": "A great set of irons for beginners or those looking for good quality at an affordable price.",
      "pros": [
        "Every club is the same length, which helps give a more consistent feel, especially for newer golfers",
        "Hits accurately and produces good height"
      ],
      "cons": [
        "The club length often means a loss in distance, but helps hit more accurately"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome irons",
      "text": "Great set of irons and the quality was excellent. They took a little time getting used to, once I figured out the ball placement, swing and grip everything started falling into place. I really like all the irons being the same length, lie and weight. I lost maybe 5 yards on the #4 and #5 irons but gained about 5 yards on all the wedges with a higher trajectory which I prefer. Great irons for me at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall Sisk",
      "helpful_votes": 20,
      "publication_date": 20170905
    },
    {
      "title": "Great clubs!",
      "text": "I was skeptical. I ordered the clubs, they arrived quickly. My game had stagnated, I was stuck. I got the clubs and took them to the range. They had a great feel, nice weight. I hit them very well. The lower clubs went 10 to 20 yards longer. I expected the 7 through 4 to be shorter from what I had read, but because they were lighter I hit them longer. Played a course I always play and usually shoot 95 to 98. Shot an 88 today, first time out. Great clubs, I would recommend them to all.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20190330
    },
    {
      "title": "Gotta try them!!!",
      "text": "Exactly what you should expect from single length and weight irons. The quality is excellent and is what would be expected on clubs four fold the price. Some reviews have folks not hitting as far as their old clubs.....guess what..that is how they are supposed to be. The four through seven will be a bit shorter than standard as they are shorter, so less clubbed speed and weight. Eight through wedges will be a bit longer as the shafts will be equal to a seven, so faster clubbed speed. It is all just getting used to them. If you have some trouble with the long irons, then this set is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "ryleemax",
      "helpful_votes": 17,
      "publication_date": 20170903
    },
    {
      "title": "Love this clubs",
      "text": "Love this clubs. After 3 rounds practicing with this clubs I went from avg. of 95 per round to 89. For me single length irons are the solution",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20170322
    },
    {
      "title": "Five Stars",
      "text": "Excellent set of irons, no loss of distance but hitting the ball much straighter.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry R Norris",
      "helpful_votes": 6,
      "publication_date": 20170928
    },
    {
      "title": "Absolutely nothing was correct with this order. I selected one star..there was no option for ZERO.",
      "text": "Wait..there's more. I ordered graphite shafts, senior flex. In addition to all clubs being left handed, only 3 clubs were graphite and they were regular flex and the remaining clubs were stiff shafted steel !!! Was the person who packed this mess intoxicated ?? I have to rewrite the above horrible review. I reordered the original clubs ( right handed, graphite, senior flex) and today I received a beautiful set which was exactly what I ordered. All is forgiven !!",
      "rating": 4.0,
      "verified": true,
      "author": "John Procopio Jr",
      "helpful_votes": 2,
      "publication_date": 20180924
    },
    {
      "title": "I have hit these irons only once.  It is far too early to evaluate accuracy and overall rating.",
      "text": "After going to the range only once and never playing a round with the irons, there is no way I can do a full evaluation. So far I am pleased with my purchase. They are attractive clubs and the value for the price appears to be exceptional. We will see! They arrived 3 days later than expected, but were boxed and very well protected. I ordered R graphite shafts, but the shafts feel closer to S. I might consider Senior flex if I had known.",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford Luttrell",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Received clubs earlier than expected delivery date. Played with ...",
      "text": "Received clubs earlier than expected delivery date. Played with clubs and found them to be easier to hit than my regular irons.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonesman",
      "helpful_votes": 5,
      "publication_date": 20170708
    },
    {
      "title": "Hit the driving range before playing a round.",
      "text": "Did quite a bit of reading on this type club and as every article said, they do take some getting used to - especially when using the wedges. Also, lost some distance in the beginning but after two rounds, am regaining that. Great feel and they do seem to create a more lofted shot. Overall, am completely satisfied with the clubs and would recommend them. The only con is that the club head could be just a tad larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas H. Bowling",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Four Stars",
      "text": "I did not get the distantce that I was expecting",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos D. Manrique",
      "helpful_votes": 4,
      "publication_date": 20171008
    },
    {
      "title": "Love the swing weight on the clubs",
      "text": "Love the swing weight on the clubs. Very good golf grips and appear to be made of high quality steel and graphite. Can't wait until golf season!",
      "rating": 5.0,
      "verified": true,
      "author": "lori trent",
      "helpful_votes": 4,
      "publication_date": 20180103
    },
    {
      "title": "Something different",
      "text": "Grips to small for me. I typically use Golf Pride Jumbo Grips so I had some put on at Dick’s Sporting Goods Store. Gained some distance with the 3 wedges. Think I lost some distance on the 8 and 7 irons. Still adjusting to same length irons. Still experimenting with these inexpensive same length irons. Some day I may purchase a much more expensive same length set but for now these are okay. In the past I played with Callaway irons and driver and Cobra hybrids.",
      "rating": 4.0,
      "verified": true,
      "author": "Phillip D. Wood",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Coming unglued!",
      "text": "I have been happy with the performance of these clubs until recently when heavy, very sticky glue started leaking out of some of the club heads. As long as this keeps up, the entire set will be unusable. I hope this review will cause the seller to contact me to arrange some kind of correction.",
      "rating": 1.0,
      "verified": true,
      "author": "IdahoBob",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Blown away by Mazel.",
      "text": "2 rounds in and i can clearly see i made the right choice. I love to play golf, shoot mid 90's and up but recovery golf is hard on a man.. my 7 iron down to the lob wedge is my strength, now i am hitting the 4 iron 170 straight as an arrow. Shot an 88 yesterday and didnt take a single mulligan. I will take a little loss on 4, 5 and 6 iron for the control these irons give me. I am already looking at Mazel drivers and hybrids to complete the set..",
      "rating": 5.0,
      "verified": true,
      "author": "steven streeter",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Consistancy",
      "text": "I've used the irons at my driving range and really enjoyed the head weight and equal length making for a comfortable, consistent swing. I'm 74 so these things are maybe more important to me since I am not trying to be perfect and adapt to each club. The same stance and feel of each swing will help me to better accuracy, I'm sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Rex Gehring",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Great for beginners and seniors",
      "text": "What is for my 84-year-old father he is enjoying them much easier for him to hit due to the same length on all clubs They arrived undamaged and look good we did change the grips on our clubs",
      "rating": 5.0,
      "verified": true,
      "author": "Dan T.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Worth twice the price I paid.",
      "text": "Beautiful clubs that are the equal of the Ping irons they replaced. Large sweet spot and comfortable grips. Don't let low price s steer you towards more expensive brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Biller",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Great product",
      "text": "Take a little getting used to but I love them, very well built and look great.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Logston",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Club's are great,the grips suck.",
      "text": "The club's are better than expected.The grips are crap.I would have expected a lot better.I will regrip them.I think I will be happy then.",
      "rating": 4.0,
      "verified": true,
      "author": "mike ferrie",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Takes getting use to.",
      "text": "The clubs are ok for the money. As stated in research before purchase, they take some getting use to. If looking to try these one length clubs, recommended over investing in high dollar sets.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Nice.",
      "text": "These clubs worked for me too. I am able to hit the 4 iron like never before in my previous variable length clubs. These clubs do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "ogalethorp",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Pheonminal",
      "text": "Thank you. These clubs are great. I did not have any problems with glue like other reviews. They are perfect. Well wrapped but the box it came in was destroyed. I will update when I get a round in on Sunday. Just for reference you will need to get a nice set of covers.",
      "rating": 5.0,
      "verified": true,
      "author": "jason price",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Do a better job",
      "text": "The 4, 5 irons have glue coming out of the club head it was all over the club face when I opened them, all over the bag it was shipped in, just a mess. Other clubs are ok, went back to my old clubs. Can I get my money back?",
      "rating": 1.0,
      "verified": true,
      "author": "LNash",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Waiting for seller credit for changing my rating stars",
      "text": "The shaft is too whippy and instead of gaining more distance I lost more than 10 yards especially the 5 irons with same lenght as 7 irons",
      "rating": 4.0,
      "verified": true,
      "author": "D'Roeck",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Super Deal",
      "text": "Super clubs...only thing I wish it included 5,4 & 3 wedge...love that it had a gap wedge perfect for those mid range shots! Wish I had invested in these before I purchased a standard set...5 stars",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Miller",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Great set of All in one Clubs",
      "text": "Bought this as a second set of clubs for somewhere I frequent 3-4 times a year. Just as good if not better than my sterling irons, and less than 1/3 of the cost. Great feel, good looking and base package is better than most. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Single length and weight clubs equate to DISTANCE LOSS",
      "text": "The quality of these clubs is acceptable, but expected benefits to the improvement to my golf game were minimal at best. As a 3 handicap, I was able to adjust my game to accommodate the single length/weight, but the overall loss in distance was disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Great buy!",
      "text": "The construction and feel of these clubs are nice and solid. I couldn't begin to tell you how much having single length clubs had changed my game. These have helped to make my swims much more consistent.",
      "rating": 5.0,
      "verified": true,
      "author": "John H.",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Quality clubs",
      "text": "Received quickly. Clubs well packed. Had to change the grips, I use mid size and clubs came with standard. Have played six rounds and as I get use to them my scores are dropping. So far very pleased with these clubs.",
      "rating": 4.0,
      "verified": true,
      "author": "Douglas Bishop",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Clubs are well built with great attention to detail.",
      "text": "Prompt delivery and packaged well. Haven't played a round yet but on driving range found distance, trajectory and gap between clubs to be more than adequate. Will update after a few rounds.",
      "rating": 5.0,
      "verified": true,
      "author": "wyocook",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Great addition to my bag",
      "text": "One length is the way to go. Improved my accuracy overall in irons.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Worth",
      "text": "Not sure what warmth means but my game has improved for sure. Good grip and head weight. You won’t be shooting like Tiger but DeChambozo is comparable",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "One swing for all",
      "text": "Purchased for my son, he loves them, same swing with each club because all shafts are the same length. He took 10 strokes off game at end of second round.",
      "rating": 5.0,
      "verified": true,
      "author": "brian Charltray",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Mazes clubs for a better game",
      "text": "This set of clubs were well constructed and hit great. I put Jumbo Max grips on them, like Bryson Dechambeau uses. Single length are the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan T.",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Being all the same length you have to get use to them. They will go a little further.",
      "text": "I think they are good. I just started using them and with a little adjustment from me, I will be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Louis Kasitz",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Mazel golf clubs",
      "text": "Order was short 2 clubs, was unable to get missing clubs replaced because they not available so I returned them. did not get to use clubs so I cannot rate quality. Jack",
      "rating": 4.0,
      "verified": true,
      "author": "jack severt",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "It's a new concept. I want to try it.",
      "text": "I'm trying these out. I like the one length concept and I have hit the clubs once and was pretty satisfied. I'll let you know as I use them as the weather gets warmer.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Great set of clubs for beginners!",
      "text": "Great set of clubs for beginners. Equal length and weight makes for mastering one swing instead of many.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan J Robertson",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Really like the single length club",
      "text": "They work fine will take awhile to get use to",
      "rating": 5.0,
      "verified": true,
      "author": "Dave C Joilet il",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Too early to recommend clubs, but the service was excellent.",
      "text": "My first experience at the range with these clubs was not encouraging. I found the grips too small, but otherwise nice finish and appearance.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Awsome price",
      "text": "Clubs came a day late but were in excellent shape. Was only able to hit a few but seemed pretty good for a guy with inconsistent iron play time will tell",
      "rating": 4.0,
      "verified": true,
      "author": "Trent Rottscheit",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "One length one weight",
      "text": "As a senior I could not get enough spin on the ball to make it go high. With mazel irons the ball goes high and lands soft",
      "rating": 5.0,
      "verified": true,
      "author": "Marion G.",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "They are great!",
      "text": "If you are willing to give up some distance for consistancy these clubs do the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent Haver",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "the clubs are great! The same length shafts are better than expected",
      "text": "For the price, the clubs are great! The same length shafts are better than expected! They are perfect, my game still needs work though!",
      "rating": 4.0,
      "verified": true,
      "author": "MV",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "while I like the feel and the idea of a single set ...",
      "text": "have played three rounds, while I like the feel and the idea of a single set up... I have lost much distance with these irons compared to my ping I 3's, ping 5 iron versus this 5 iron, 50 yards less with the Mazel iron. 30 yards less with the 8 iron. I guess you get what you pay for. looks like I might have wasted the 265.00 and will have to spend the money for a set of Cobra's.",
      "rating": 3.0,
      "verified": true,
      "author": "Dean Anderson",
      "helpful_votes": 10,
      "publication_date": 20170419
    },
    {
      "title": "Three Stars",
      "text": "Soles of the clubs scratch easily; however, pleased for the money.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "I like one size",
      "text": "Here is why four stars. Look and feel are fine. I have hit the irons at the golf dome and they seem OK. As a golfer you never really know until you get to the course a few times. It's winter in Illinois so I won't know for sure until the end of March or the first of April. Hoping for the best .",
      "rating": 4.0,
      "verified": true,
      "author": "Robert M. Roberts",
      "helpful_votes": 3,
      "publication_date": 20170131
    }
  ],
  "product_meta": {
    "title": "MAZEL Single Length Golf Club Irons Set for Men & Women,Right Handed",
    "rating": 4.3,
    "feature_bullets": [
      "⛳SIMPLIFY YOUR GAME:100% graphite shaft one length (37.5 Inches) provide same swing weight and consistent feel for every shot,easy to enhance your performance,perfect for junior and professional players",
      "⛳431 stainless steel golf irons feature a combination of large sweet spot for improved accuracy,hit to more further distance",
      "⛳Comes with 9 pieces golf irons club set,Including 4,5,6,7,8,9,PW,AW,SW",
      "⛳Lower center of gravity to get the ball fly straighter and longer,more speed on the shot",
      "⛳High performance rubber grip offers good hand feel to hold,anti-slip & Shock Absorption"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "48 x 5.6 x 5.6 inches; 8.82 Pounds",
      "Date First Available": "November 5, 2016",
      "Manufacturer": "MAZEL",
      "ASIN": "B07R1HPSWB",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sets",
      "Sports & Outdoors",
      "Irons",
      "Golf Clubs",
      "Sports & Fitness",
      "Golf"
    ],
    "price": 258.0
  }
}