{
  "website_summaries": [
    {
      "verdict": "This earth-friendly yoga mat has features yoga enthusiasts love with just a few quality concerns. Also comes at a mid-range price.",
      "pros": [
        "Lightweight mat",
        "Made of natural cork and rubber",
        "Attentive customer service",
        "Slip resistant"
      ],
      "cons": [
        "Cork texture can feel slippery",
        "Rubber can separate from the cork"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "... yoga mats and this one is by far my favorite. Like the other reviewer",
      "text": "I have several \"traditional\" yoga mats and this one is by far my favorite. Like the other reviewer, I like the smell of this mat and I feel much more comfortable practicing on it because it is free from chemical smells. At first, I thought the mat would cause my hands and feet to slip, however, with use and as the body heats up, the mat gets better as I start to perspire. I highly recommend it and it comes with a nice carrying bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Moni",
      "helpful_votes": 4,
      "publication_date": 20170405
    },
    {
      "title": "great non slippery comfortable mat",
      "text": "great non slippery comfortable mat, comes in a good box, I wish the mat carrier had a pocket for keys etc, but it is ok as is. the mat has a rubbery smell the first few times you use it, which gets much better by week two.",
      "rating": 5.0,
      "verified": true,
      "author": "dorotheagr71",
      "helpful_votes": 2,
      "publication_date": 20170516
    },
    {
      "title": "The Quintessential Cork Yoga Mat",
      "text": "Fantastic mat, exactly what I was looking for in a yoga mat in every aspect. Free of bad odors, as the previous reviews stated, and has great grip. Honestly, I just love every aspect of it (size, materials, aesthetic). Very minimalist, but what more do you need? I had some issues with my order, but WODFitters was very helpful. They were able to politely and satisfactorily remedy the situation.",
      "rating": 5.0,
      "verified": true,
      "author": "Zak",
      "helpful_votes": 2,
      "publication_date": 20170606
    },
    {
      "title": "Very nice mat. I let it air out for a ...",
      "text": "Very nice mat. I let it air out for a day to get rid of the rubber smell. The carry bag is really nice, too. Glad I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "Annette L.",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Free smells!",
      "text": "Granted I haven't tried very many yoga mats but this is by far and away the best I've ever owned. The cork feels and looks great, has lots of grip and is sweat absorbent. My girlfriend and I both love the way it smells too, which is kind of strange but worth mentioning since so many yoga mats smell ghastly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Klingelhoefer",
      "helpful_votes": 3,
      "publication_date": 20170320
    },
    {
      "title": "Absolutely love the mat",
      "text": "Absolutely love the mat, it was worth the investment. The follow up from the company plus CEO (Kat) was just the frosting on the cupcake!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Walsh",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Hands down best matt ever",
      "text": "Hands down best matt ever! I do heated yoga and I do not slip. Its smells amazing. Only reason i didnt give 5 stars. It doesn't tell you how to clean it.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "Five Stars",
      "text": "Awesome product. Very high quality and provides secure comfort on the floor while exercising.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Cayea",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "I tried using this for hot yoga and the top ...",
      "text": "I tried using this for hot yoga and the top layer of cork starting coming off after only 1 use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Great product",
      "text": "I love this mat. Even when my palms start to get sweaty they dont slip or slide around on the cork surface. This mat is exactly what I needed for my workouts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Sliding",
      "text": "Cork and no toxic fumes/surface is the best thing. Worst thing is that my feet slide in downward dog. Makes it subpar.",
      "rating": 3.0,
      "verified": true,
      "author": "V Yee",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Best Purchase Ever",
      "text": "I didn't think any matt would keep me from slipping during my hot yoga classes. It definitely does The grip is even better once you start sweating. It smells nice but would agree with others that it is a bit heavy. I am ok with the weight of it. This matt has helped me in my practice. I recommend to anyone who is tired of using the matt and towel combo.",
      "rating": 5.0,
      "verified": true,
      "author": "Jcsun",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "One Star",
      "text": "has a bad almost like chemical smell to it and still after many month smells",
      "rating": 1.0,
      "verified": true,
      "author": "Kacy",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Worth the price",
      "text": "Got mine today. I absolutely love it so far. It's beautiful and feels great to the touch. 5 stars, thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Metro",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "BEST YOGA MAT",
      "text": "Well the only thing I have to compare this to are the awful mats at my gym - wish I had ordered this a LONG TIME ago. What a great mat - and the cork is Perfect. I'm Super happy with this product and their great customer service. I will be ordering more products from WODFitters in the future.",
      "rating": 5.0,
      "verified": false,
      "author": "Stephen P.",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Yoga Teacher Perspective",
      "text": "I teach yoga in a variety of locations and wanted something durable and comfortable without being distracting. Fits the bill. Love it.",
      "rating": 5.0,
      "verified": false,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20180117
    }
  ],
  "product_meta": {
    "title": "WODFitters Cork and Rubber Yoga Mat (4 mm)",
    "description": "Our WODfitters yoga mats are completely all natural and chemical free. Each plant-based mat is made from a cork and rubber blend and measures 72” x 24”. At only 4 mm thick, the sleek design makes it easy to carry around and lay out. It is PVC free, plastic free, and foam free. \n\nThe advantages of cork \n\nCork provides better traction than almost any other yoga mat choice available. It’s a great way to jumpstart your practice at any level, letting you grip the surface of your mat more tightly as you work through your flow. Cork is also less likely to get too hot if you are practicing outside in the sun. \n\nEasy to clean \n\nMost foam yoga mats need to be constantly cleaned because they are prone to mold and bacteria build-up. This mat is naturally antimicrobial and won’t develop the same level of buildup in the first place. Most of the time to clean it, all you need to do is lay it out and let it air dry. If you get dirt on your mat, you can simply wipe it off with a small amount of soap and water. \n\nWhy it’s better for the environment \n\nHarvesting cork from trees actually improves their levels of carbon production. So when you choose our cork and rubber blend, you are choosing a mat that’s both sustainable and plant-based. Synthetic, TPE mats may claim to be environmentally friendly, but if you genuinely want to go green, then this is the mat for you.",
    "rating": 4,
    "feature_bullets": [
      "TOP QUALITY ECO-FRIENDLY MATERIALS: Each WODfitters yoga mat is made from a plant-based cork and rubber blend that is all-natural and free of harmful chemicals, including PVCs.",
      "PREVENTS BACTERIA: Many inexpensive yoga mats encourage bacterial growth, mold, and lingering smells. Our cork mat is antimicrobial and won’t need constant washing.",
      "THE TIGHTEST GRIP: Cork provides one of the tightest grips in the industry. The non-slip surface remains grabbable even after it’s wet, which makes it a great choice for hot yoga or sweaty Bikram yoga practice sessions.",
      "MULTI-PURPOSE: This yoga mat is perfect for both brand-new and experienced yoga practitioners. It can also be used for aerobics and pilates. It measures 72” x 24” and is 4 mm thick.",
      "100% SAFE PURCHASE: Here at WODFitters, we have great faith in our workout mat's quality. After all, we use it ourselves! That's why we offer you 100% satisfaction - we're that certain that you'll love it!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "24 x 4 x 4 inches; 2.6 Pounds",
      "Date First Available": "December 5, 2016",
      "Manufacturer": "WODFitters",
      "ASIN": "B01N2QDN4K",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Yoga",
      "Sports & Fitness",
      "Mats"
    ],
    "price": ""
  }
}