{
  "website_summaries": [
    {
      "verdict": "Students and professionals will appreciate this bag's padded laptop compartment and multiple pockets.",
      "pros": [
        "Offers 2 open side pockets for water bottles",
        "Sternum strap for comfort",
        "Available in various colors and styles",
        "Padded laptop compartment",
        "Pocket for storing tablet"
      ],
      "cons": [
        "Fabric could be thicker",
        "Some complained of the bag being flimsy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great adult daypack",
      "text": "I am a teacher and decided to purchase my very first backpack. We had little book bags when I was a kid, so backpacks are new to me. This one fits the bill rather nicely. It has room for everything I need for the day. Box of Kleenex, lunch, first aid kit, notebooks, Kindle, phone, keys, hall passes, coffee, water bottle...all at the ready. Has a nice extra pocket should I want to take my iPad. After 8 months of use, it still looks new.",
      "rating": 5.0,
      "verified": true,
      "author": "Teri Leigh Baird",
      "helpful_votes": 3,
      "publication_date": 20180713
    },
    {
      "title": "Good for college students or commuters",
      "text": "Nice smallish daypack for commuters or students; well thought out pockets, nice-looking, high quality materials. I was looking for a daypack that would be ideal for hiking, and outings with my dog. Two deep water bottle pockets are a must. Surprisingly, it is a rare feature. This bag met my requirement, but I found a less expensive Gonex brand bag, that has even deeper pockets and includes a rain cover. FYI... this seller charges for return shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "lisa decker",
      "helpful_votes": 2,
      "publication_date": 20190223
    },
    {
      "title": "As A Serial Backpack Buyer, This One Is The Best!",
      "text": "I love this backpack! It has all the right pockets in all the right places. I am in dental school and am usually carrying around a fair bit of supplies. I love that it has easy access pockets on the front and top, that it has not one, but TWO mesh waterbottle holders, and it has both a folder and laptop sleeve on the inside. On top of the functionality, it is super stylish and fits well, even for me who is 5' 1\" and 110 lbs. I have recommended this backpack to anyone who asks about it, and I can tell I will be happy with it for several years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Madison Hauritz",
      "helpful_votes": 3,
      "publication_date": 20180708
    },
    {
      "title": "Holding up very well after a few international trips",
      "text": "I got this bag to replace a cheapo 7 year old backpack from Target. So far so good after a few international trips. I dumped all my stuffs into this bag as the only luggage for me on these trips, and it's holding up very well. It is easy on the shoulder and my back. The only \"wish\" is to have some small compartments.",
      "rating": 5.0,
      "verified": true,
      "author": "MY",
      "helpful_votes": 2,
      "publication_date": 20181222
    },
    {
      "title": "My EDC bag",
      "text": "I love this bag. Carry it every day! Keeps my MacBook, charging cords for multiple devices, first aid kit, meds, notebook, tablet, flashlight, external hard drive, glasses and sunglasses. Plus gym clothes. Comfortable, light enough and small enough for every day carry. No matter if I'm in the jeep, on the motorcycle or just walking. Has everything and does everything I need it to do. Props to you Burton for another dope product!!! Only thing I did was add some soft side Velcro to the top face of the bag so I could put moral patches on.",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter L Collins",
      "helpful_votes": 4,
      "publication_date": 20170411
    },
    {
      "title": "Got two of them!",
      "text": "Love this bag so much! I bought one for myself a year ago and now got another for my boyfriend. It's suitable for the college student or young professional who needs to carry a laptop every day. The inner layers are also helpful to organize your stuff. Thumps up!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20171019
    },
    {
      "title": "Best pack ever!",
      "text": "I love it!!!! Used for international travel and my daily pack at home. So much organization. The only thing it lacks for me aren't must haves: hydration pack tube exit or headphone exit. I loooooooove the sunglass compartment! Interior organization panel is legit. Great material, durable well made. For me I wish there was a way to remove the chest straps because I would never use them, without the hydration pack capabilities you can't really take this hiking... Plus the fabric is too nice for that. I use s-clips to secure the zippers and deter pocket pockets while seeing sights.",
      "rating": 5.0,
      "verified": true,
      "author": "RedMcQ",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Great backpack",
      "text": "Bought this backpack for my boyfriend so he could have some sort of bag to take back and forth to work everyday. he LOVED it!!! im so happy I snagged this",
      "rating": 5.0,
      "verified": true,
      "author": "steph",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "So cute! and functional!",
      "text": "I use this bag for work, school, gym, everything. It's really roomy and comfortable. I bike to work and its's comfortable enough to wear on the 4 mile commute. I get a lot of compliments on it. The inner pockets are great, although when it's packed with stuff (like my ice skates) the pockets are harder to get to. I also like the mesh bottle holders. They hold my big nalgene and can compress to hold my skinny coffee tumbler. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Hughes",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Awesome bag for snowboarding as well as everyday use!",
      "text": "i love this bag. shipping was super fast just one day before my snowboarding trip. i can put two goggles, two pants, wallet, phone 7 plus, keys, one headphone, one kindle fire and two bottle of water(outside on each side). i love it. beside i also use it for work after the trip. it holds my notebook nicely. the logo on the front looks really nice. it also has a life time warranty which is always good to know.",
      "rating": 5.0,
      "verified": true,
      "author": "Xian",
      "helpful_votes": 2,
      "publication_date": 20170102
    },
    {
      "title": "Durable, lots of compartments, adjustable straps.",
      "text": "Best backpack I’ve owned. Straps are adjustable, padded for comfort and ergonomic. The strap that goes across your chest is optional / doesn’t get in the way if you’re not using them and really thoughtfully designed — esp for women — because you can move the height up or down depending on your liking. Most backpack chest straps are sewn in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Comfortable! Lots of pockets!",
      "text": "Ended up getting a black one (simpler) instead of this patterned one, but really love the way the backpack is constructed. There are a lot of pockets inside, which help me stay somewhat more organized. I love that my big laptop (17 in) actually fits in this. A miracle. Really comfortable too!",
      "rating": 5.0,
      "verified": true,
      "author": "Even",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "10/10 would recommend",
      "text": "I absolutely love this bag! First off, it’s really high quality. Second, the colors on this bag are amazing. Third, this bag has so many compartments to store everything you need. I definitely recommend purchasing this!",
      "rating": 5.0,
      "verified": true,
      "author": "rachael diaz",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Nice backpack, terrible water-resistance",
      "text": "Maybe it’s my own fault for not noticing the description includes nothing about water-resistance, but for an outdoor gear brand like Burton I figured it was table stakes to at least keep the laptop compartment from getting wet in the rain. The lack of water resistance seems like a massive oversight to me. Other than that, the bag looks and feels sturdy.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex Okon",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "So happy!!",
      "text": "Fashionable, Comfortable, Functional. Love the top pocket for sunglasses/glasses- the fleece lining took away my worry of scratched lenses! Easy to adjust straps, zippers stayed closed, pocket(s) of computer, book, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "IAHAWKS38",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Durable and Sleek",
      "text": "This Burton Backpack is a made with durable material and comes with plenty of storage space inside. Zippers are thick and trustworthy. The only criticism I have is the outside netting (for water bottles etc.) is located pretty high up and towards the front outside of the bag versus on the side. This makes grabbing and putting back water while walking an extreme challenge. Other than that, this backpack is sleek and durable.",
      "rating": 4.0,
      "verified": true,
      "author": "Cass P.",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Small size but Great Backpack!",
      "text": "The backpack feels great and looks great. I like the tan color too. It is a bit on the small size but, it holds enough for school.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonuser",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "like nearly every other company out there (I’m looking at ...",
      "text": "I bought this to replace another Burton Prospect (stolen) that I bought several years ago – exact same color, model, etc. Unfortunately, Burton, like nearly every other company out there (I’m looking at you, Levi’s, Converse...) has gone cheap. The replacement bag I purchased is simply made from crap materials. The fabric is thin and flimsy, whereas it used to be strong and durable. The clips and webbing are also made of cheaper materials. What’s my solution to the problem of corporations deceiving and manipulating their customers? Militancy, of course. Screw you, Burton.",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher Piatt",
      "helpful_votes": 6,
      "publication_date": 20180104
    },
    {
      "title": "Top and front pockets for things that need easy access. Side pockets",
      "text": "Big with many pockets, laptop, documents, pouch, and one with a zipper. Top and front pockets for things that need easy access. Side pockets, usually for water bottle, are deep.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 2,
      "publication_date": 20161031
    },
    {
      "title": "Front Pockets are not made for a lot of items",
      "text": "This backpack is amazing! The only problem I am seeing is the fact that if I have multiple items in the front pocket, it is a little difficult to get my books in. But as a science/computer major, I carry more than usual.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Lowther",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Little small, but decent",
      "text": "It's okay. I wish it were a little larger. Seems a little tight, and have to carry my books in another bag. Great for day hikes, maybe not for school.",
      "rating": 4.0,
      "verified": true,
      "author": "William Schaerer",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Perfect size - great for books, and still \"cool and stylish looking.",
      "text": "My high school junior son bought this for school. It's the perfect size - great for books, and still \"cool\" and stylish looking.",
      "rating": 5.0,
      "verified": true,
      "author": "Muk3Mom",
      "helpful_votes": 2,
      "publication_date": 20160420
    },
    {
      "title": "Great pack, perfect size for skiing father",
      "text": "Great pack used for skiing. Kept all my stuff dry and wasn’t too bulky when skiing. Perfect size for this father of 3 to carry all the things needed for a day on the slopes.",
      "rating": 5.0,
      "verified": true,
      "author": "why are there so many fake pixelmon apps",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Great backpack",
      "text": "This is a well built pack. Pockets are well placed and there are plenty for good organization",
      "rating": 5.0,
      "verified": true,
      "author": "riley",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "A stylish bag with plenty to offer.",
      "text": "Holy crap I love this backpack. I utilize it as a diaper bag, day bag, and soon, it will be once again my bag. The lifetime warranty on the backpack is a sweet touch as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Josiah Lund",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Great everyday backpack for school",
      "text": "My daughter loves this backpack. Cute but not too feminine and the black helps keep it looking clean. It seems well made and fits most of her school supplies (folders, books, lunch etc). She does need to carry a second bag for athletic gear.",
      "rating": 5.0,
      "verified": true,
      "author": "ABNYC",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Impressed with quality",
      "text": "Awesome backpack! So stylish, lots of space and pockets for storage, semi-waterproof material, and lifetime warranty. I will start buying more products from burton from now on!",
      "rating": 5.0,
      "verified": true,
      "author": "Tara Mashkory",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Great Backpack",
      "text": "Awesome backpack, nice pockets and separation inside. Good capacity, nice design, sturdy feel, and it won't break the bank. Overall, a good purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Karate",
      "helpful_votes": 2,
      "publication_date": 20160428
    },
    {
      "title": "Quality",
      "text": "Had this for my whole college career. Has held up amazingly. Plenty of room for taking a book or two and laptop to class.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Demsien",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Upgrade",
      "text": "My old Burton backpack finally fell apart after 12 years (and I wasn't the original owner), so I replaced it with this very similar bag. Its perfect for work, traveling and short hikes/ day trips outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "It looked just like the image felt like solid construction",
      "text": "Was bought for my niece as a Christmas present along with some travel patches. It looked just like the image felt like solid construction. Would order from this brand again.",
      "rating": 5.0,
      "verified": true,
      "author": "GS",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "It has held up nicely. I am a larger guy",
      "text": "Rode for a week in Colorado with it. It has held up nicely. I am a larger guy, so wearing it over a coat can be tricky, but it is something that I do not take on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "KALVO",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Love burton backpacks",
      "text": "Burton backpacks are my favorite! May have a couple now! Design is so pretty and bag is very durable. Use one almost everyday from a gym bag to diaper bag and anything in between! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Well built, roomy and light backpack",
      "text": "Lightweight yet well built and roomy. Fits up to 15\" laptop and has a separate tablet sleeve which is not common. The roomy main compartment is versatile and many smaller pockets helped me keep things organized during travel. Deep outer pockets hold small items or regular sized water bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "heather budimulia",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Super great daily backpack",
      "text": "Great backpack and quality! Two bottle carrier on the side comes really handy! I use it for school, carrying it on my bike or in the rush to get to class, the strap helps to avoid the shaking",
      "rating": 5.0,
      "verified": true,
      "author": "Hans",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Exactly what my son wanted",
      "text": "My high school aged son loves this backpack. He wanted something different, and he got it! The quality is also very good. Burton never disappoints. :)",
      "rating": 5.0,
      "verified": true,
      "author": "sassymimama",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Last for years unless not taken care of at all",
      "text": "Still using it YEARS later. Still looks and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "AlaskanRidge2006",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Great backpack",
      "text": "Best backpack I’ve had for school. Love the colors, the design, and the material.",
      "rating": 5.0,
      "verified": true,
      "author": "HK&RF",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Perfect for Commuting/Gym/One Day Pack",
      "text": "I got this for my boyfriend as a gift as he was going back and forth from my apartment. He loves it! Perfect size for his one day needs and laptop!",
      "rating": 5.0,
      "verified": true,
      "author": "Demi",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Great Quality Pack",
      "text": "Love this backpack! I used it over Christmas break while I was boarding at Whistler Blackcomb in beautiful BC and now that I am back in Texas use it when I ride my motorcycle to and from work. Good quality pack everything still works how it should.",
      "rating": 5.0,
      "verified": true,
      "author": "Make it Snappy Tools",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Love this bag",
      "text": "Great bag--especially for traveling. Has plenty of internal pockets to keep all my things organized. The bottle holders on the sides are a welcome addition for quick access to a water bottle. This thing looks like it will last me years.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Great all-round backpack.",
      "text": "Good looking backpack for the cost, that has a quality that compares to a north face backpack. I’m very happy with the purchase and 3 months of use has yielded no wear and tear.",
      "rating": 5.0,
      "verified": true,
      "author": "rexthunder",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Nice and compact",
      "text": "Nice and compact, but you can really fit a lot of stuff in there. A must have for my snowboard trips",
      "rating": 4.0,
      "verified": true,
      "author": "Zaki1166",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Big little backpack!",
      "text": "Big little backpack! Great for my commute and works well with a tech guy like me. Special pocket for my table, laptop, and a bunch of other pockets in a small form factor. Was actually a little larger than I was expecting.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathon",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Nice commuter pack.",
      "text": "I was hoping the profile would be a bit more flat to the body, but it's fine. It has the extra room I was looking for and sits well on my shoulders and back.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Berry Jr.",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "Awesome fit.",
      "text": "What you see is really what you get. It’s amazing, fits all my stuff and is super comfy to tag along with",
      "rating": 5.0,
      "verified": true,
      "author": "Dana J.",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Great for Boarders",
      "text": "Excellent backpack. I have now taken it snowboarding three times and can say it is entirely waterproof. The pockets inside also make it so you can use this backpack for school or business if you like.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Absolutely excellent backpack! Fits all of my school stuff",
      "text": "Absolutely excellent backpack! Fits all of my school stuff, a 15.6 in laptop, and still looks and feels great to wear. I go through backpacks about once a year, but this is one of the sturdiest I've owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaden",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Love it! I was looking for a bag that ...",
      "text": "Love it! I was looking for a bag that holds my boards but it natched my clothes, so i had to get this. Its durable, so far no complains! Price is just right for me :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "I am very pleased with this pack very well made",
      "text": "I am very pleased with this pack very well made, . I can not believe I waited my time with unfamiliar brand I don't know what I was thinking. Will never Buy A different brand again.",
      "rating": 5.0,
      "verified": true,
      "author": "mar",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Works good for keeping a days worth of snacks/gear in while ...",
      "text": "Works good for keeping a days worth of snacks/gear in while on the mountain. I was also surprised with how well it kept water out of the pack.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick R.",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Good daypack.",
      "text": "Just what i wanted. The product and the seller is good. I have received my package on time and in very good and new condition. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "ted abrenica",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Four Stars",
      "text": "Side and inner pockets are functional, just expected the entire bag to be bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Loves it!",
      "text": "It was a gift and my 21 year old nephew loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Johnston",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Love it.",
      "text": "I really like this back pack, took it traveling with me. Lots of things fit in it. It looks pretty. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Y Lucero",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Backpack is great! The only thing I wish it had was ...",
      "text": "Backpack is great! The only thing I wish it had was some kind of pen/pencil organizer. Maybe just a few sleeves to put pens. Otherwise I love this backpack.",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Its a great back pack but beware the darkest color is brown ...",
      "text": "Its a great back pack but beware the darkest color is brown and it looks black in the picture. I bought it thinking it was black.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary D.",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Perfect for Commutes",
      "text": "Perfect size for daily commuting. The lone main pocket holds your laptop, charger, lunch, jacket, etc. All the storage room you need without fifty zippers and compartments.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby P.",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Decent snowboarding backpack",
      "text": "This is a decent backpack for snowboarding, it's not extremely durable or waterproof but overall pretty good.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Nice Bag",
      "text": "Nice quality, just wish it was a little bigger. Husband bought for vacation and could barely fit our family’s electronics inside.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Burton FTW",
      "text": "Great size, Great quality. Burton never fails to meet expectations and reach beyond them.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikkandy",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Don't look for another backpack; this is THE ONE you have been expecting to find for so long.",
      "text": "The best backpack I ever had (and I had a lot before this Burton)!",
      "rating": 5.0,
      "verified": true,
      "author": "MCK",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "I ordered the red and it is closer to a rust color but still nice. Perfect size for day to day use without ...",
      "text": "Well made. I ordered the red and it is closer to a rust color but still nice. Perfect size for day to day use without being too bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Five Stars",
      "text": "Very happy with this backpack. Lots of pockets and hardy. Small enough to wear on the slopes.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Russell",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "it's not really good for school there's not many areas for Storage",
      "text": "It's more of a casual backpack use, it's not really good for school there's not many areas for Storage. that's my fault for not looking Thoroughly",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon D.",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Five Stars",
      "text": "Great price on this quality backpack! It was a hit with my teenage grandson.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb in Duluth",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "I love the backpack",
      "text": "I love the backpack. I use it for college and have room for all my binders and can still fit a lunch on top!",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Four Stars",
      "text": "It was a little smaller than we expected - but still a cute, quality backpack.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "He's absolutely in love with it",
      "text": "Got this for my boyfriend. He's absolutely in love with it. He takes it to work and there's a compartment that he puts his laptop in it",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Heiney",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Five Stars",
      "text": "Worked perfect for my personal carry on item when traveling to Colorado .",
      "rating": 5.0,
      "verified": true,
      "author": "marc browning",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Happy with my purchase",
      "text": "It fits everything, has a lot of pockets inside and out. Has a laptop compartment, and another one for a tablet. Its really roomy but not bulky. Happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Great quality, a bit small",
      "text": "Hmmm. The quality is there, but it is definitely is smaller than I was expecting. I think it's a combination of the straps being a tiny bit smaller than anticipated, as well as the bag being pretty narrow. I have a hard time recommending this because it's $50 and just doesn't live up to what I thought it would be. Look at the other reviews and you will see that they all seem to (positively) comment on it being small...so that is something to think about before you buy this. It's great as a bike-commute bag, but it probably would be obnoxious as a school bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen P Daugherty",
      "helpful_votes": 7,
      "publication_date": 20150605
    },
    {
      "title": "Great backpack. Holds a lot even though it does ...",
      "text": "Great backpack. Holds a lot even though it does not look like it while you're wearing it. Also very comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Five Stars",
      "text": "Awesome. Comfortable. Stylish. High Quality Product for a Reasonable Price.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "... brother loves it the quality is one of the best",
      "text": "my brother loves it the quality is one of the best",
      "rating": 5.0,
      "verified": true,
      "author": "shenique maycock",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "Laptop sleeve is well padded, elevated from bottom of bag, and fits my 15.6\" laptop like a glove.",
      "text": "Perfect bag for my laptop. laptop sleeve is adequately padded as well as elevated from bottom of bag preventing damage every time it is put on the ground. The zippers and seams are rugged and built to last! If you are on the fence don't be. You will not be disappointed! Fits my 15.6\" Samsung laptop perfectly. The front pocket is spacious and runs the length of the front section. The side tension straps can be cinched tight when not using a bottle and do so using multiple points along the side allowing the entire side to be cinched.",
      "rating": 5.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Came in perfect time for",
      "text": "I've got so many compliments. Came in perfect time for school",
      "rating": 5.0,
      "verified": true,
      "author": "Kisa m.",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "It is a bit smaller than I would of liked. It is an alright bag",
      "text": "It is a bit smaller than I would of liked. It is an alright bag, but I wouldn't of bought it in a store.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Wheat",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Looks so cute hoping it will be good for the snow because I want to put my ...",
      "text": "Looks so cute hoping it will be good for the snow because I want to put my professional camera in there. It's not too padded though, which is what I wanted but it is roomy.",
      "rating": 3.0,
      "verified": true,
      "author": "Joan v.",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Great adventure backpack.",
      "text": "This is a nice small-med backpack that I picked up for hiking and urban exploring. It's comfortable and can hold a decent amount while still holding a slim profile.",
      "rating": 5.0,
      "verified": true,
      "author": "Peylix",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Three Stars",
      "text": "Looks great and feels great but was smaller than I expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Nushie",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "This backpack is amazing. I just downgraded (in size",
      "text": "This backpack is amazing. I just downgraded (in size, not quality) from a huge pack I used all throughout high school and college. That was back in the days when I needed to carry giant AP Bio textbooks and 5 laptops. Now, all I need is my iPad, a few notebooks, and room for external hard drives - and occassionally my 13inch macbook. All of these things fit excellently into this small pack without it becoming too obtrusive to carry on the bus with me. I used it every day as I commute in and out of the city for graduate school. It's also a great traveling companion with tons of inside pockets, but a secure outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Cassano",
      "helpful_votes": 0,
      "publication_date": 20150622
    }
  ],
  "product_meta": {
    "title": "Burton Unisex-Adult Prospect Pack",
    "description": "The Burton Prospect 21L Backpack has a low-profile and a designated spot for all the tools you can't get through your day without. A laptop compartment, tablet sleeve, internal storage pockets, and an external accessory pocket keep everything organized. Two mesh water bottle pockets grace the sides, because dehydration is nobody's friend.",
    "rating": 4.7,
    "feature_bullets": [
      "100% Polyester",
      "Imported",
      "Dimensions: 19\" x 11.5\" x 7.5\"; Volume: 21L; Durably constructed",
      "Main zip compartment with internal organization; Padded laptop compartment [15.5\" x 10.5\" x 1\"] and tablet sleeve [9.5\" x 10.5\"]",
      "Ergonomic shoulder harness with adjustable sternum strap for comfortable carrying",
      "Fleece-lined accessory pocket, external accessory pocket, dual mesh water bottle pockets with compression straps, internal zippered mesh pocket with key clip, internal Velcro slip pocket for storage",
      "Lifetime warranty"
    ],
    "specifications": {
      "Item Weight": "1.19 Pounds",
      "Item model number": "13650100611NA",
      "Department": "Mens",
      "Date First Available": "August 8, 2005",
      "Manufacturer": "Burton",
      "ASIN": "B07NJN7VP6",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Hiking Daypacks",
      "Sports & Outdoors",
      "Backpacking Packs",
      "Backpacks, Bags & Accessories",
      "Camping & Hiking"
    ],
    "price": 54.95
  }
}