{
  "website_summaries": [
    {
      "verdict": "Gabriela is the 2017 American Girl doll of the year. It has the high quality and great stories you  expect with any AG doll.",
      "pros": [
        "High quality",
        "Newest doll design",
        "Great book",
        "Book and  backstory fit in with current events"
      ],
      "cons": [
        "This doll is expensive, but the quality is hard to beat"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dream The Dreams",
      "text": "This doll is sturdy, well made, and a beautiful addition in my daughter's life. The best part is that my daughter worked hard to earn this doll since the cost is high for my pockets. It was well worth it though to see the joy on my daughter's face after her efforts were rewarded. Just like Gabriela my daughter knows that if you dedicate yourself you can acheive your goals! Love that the book came with the doll!",
      "rating": 5.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 4,
      "publication_date": 20180303
    },
    {
      "title": "Granddaughter's first American Girl Doll.",
      "text": "This doll is gorgeous. Gave to my granddaughter for her 8th birthday. She took it to New York to The American Girl Doll Store, and had her ears pierced. She also brought new outfits there. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "ms. mimi",
      "helpful_votes": 2,
      "publication_date": 20180304
    },
    {
      "title": "Adored by all",
      "text": "My daughter loved this gift from Santa. No complaints except, of course, for the price. Always too expensive for a doll.",
      "rating": 5.0,
      "verified": true,
      "author": "BJW",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Gorgeous",
      "text": "Doll was beautiful and bigger than I thought it would be.Bought for my niece but sent back because she’s to big for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Tameka Burks",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Overpriced",
      "text": "Decent doll. Very overpriced. My daughter and I thought the legs were broken but apparently they are mad that way. Bought another doll that was al most identical but about $110 less.",
      "rating": 3.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 2,
      "publication_date": 20180426
    },
    {
      "title": "It's American Girl product, nothing to add.",
      "text": "Quality as usual in American Girl products, excellent, nothing to add.",
      "rating": 5.0,
      "verified": true,
      "author": "Alfonso GRANA-JONAS",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Very pleased, looked just like I had bought her from ...",
      "text": "My daughter was so excited to get Gabriela for her birthday. She has wanted her since AG announced she would be girl of the year. Very pleased, looked just like I had bought her from the AG website/store and price was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 2,
      "publication_date": 20171023
    },
    {
      "title": "... do the doll justice as she is much more beautiful! I know my granddaughter is going to absolutely ...",
      "text": "I bought this doll as a Christmas present and have to say the picture doesn't do the doll justice as she is much more beautiful! I know my granddaughter is going to absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Ford",
      "helpful_votes": 2,
      "publication_date": 20171213
    },
    {
      "title": "Five Stars",
      "text": "I purchased this doll for my nine year old niece. She loves this doll.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "The Doll came as described",
      "text": "She came one day before Christmas Eve, which was perfect and my granddaughter loved the Gabriela",
      "rating": 5.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Much loved.",
      "text": "This was purchased to auction off at our school. So many people loved it and connected to American Girl memories.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherin M. Sniffin",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Beautiful",
      "text": "The front ofthe box was a little scuffed but the doll itself it perfect. Super fast delivery!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Great Buy! My Daughter Loves Her!",
      "text": "My daughter loves her Gabriela McBride American Girl doll. She saw her in the AG catalog and talked about her up until she finally received her as a birthday gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 4,
      "publication_date": 20170613
    },
    {
      "title": "Five Stars",
      "text": "Perfect just like I went to AG and got her..",
      "rating": 5.0,
      "verified": true,
      "author": "ruthless",
      "helpful_votes": 3,
      "publication_date": 20170719
    },
    {
      "title": "AG 2017",
      "text": "My daughter loves her!!! Got her in just 2 days!",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 2,
      "publication_date": 20170303
    },
    {
      "title": "Great condition but expensive",
      "text": "The doll was in like new condition. It was overpriced because it's discontinued. My daughter really wanted this doll so I'm surprising her for her bday with it. Doll is in great condition.",
      "rating": 4.0,
      "verified": false,
      "author": "LMJ",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Finally another doll of color!",
      "text": "Loved the fact they created a doll for the black community. I may be White, but the fact they created a GOTY to represent them is one of the best things! It gives them an opportunity to relate to someone and makes them feel valued, all lives matter!",
      "rating": 4.0,
      "verified": false,
      "author": "Elisha Teegardin",
      "helpful_votes": 14,
      "publication_date": 20170207
    },
    {
      "title": "This doll Gabriela is the best doll I wanted lea but I didn't get her ...",
      "text": "This doll Gabriela is the best doll I wanted lea but I didn't get her and I am getting Gabriela this year I am so excited that I am getting her",
      "rating": 5.0,
      "verified": false,
      "author": "Samantha Zinn",
      "helpful_votes": 2,
      "publication_date": 20170123
    },
    {
      "title": "Five Stars",
      "text": "Beautiful doll but not a good starter doll hard to mange hair",
      "rating": 5.0,
      "verified": false,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20170221
    }
  ],
  "product_meta": {
    "title": "American Girl - Gabriela McBride - Gabriela Doll & Book - American Girl of 2017",
    "description": "Meet Gabriela, the 2017 Girl of the Year! She's a true talent who gets creative for a cause. The 18\" Gabriela doll has warm brown eyes that open and close, and curly dark-brown hair. She has a huggable cloth body, and her movable head and limbs are made of smooth vinyl. She comes with the Gabriela paperback book, plus her signature outfit: A cropped purple sweater with silver dream graphic and soft turquoise tank top A fitted pair of dark-blue jeggings to keep her comfy A pair of purple shoes with turquoise straps, a pink double headband, and 10 hairbands",
    "rating": 4.8,
    "feature_bullets": [
      "Meet Gabriela, the 2017 Girl of the Year! She's a true talent who gets creative for a cause. The 18\" Gabriela doll has warm brown eyes that open and close, and curly dark-brown hair. She has a huggable cloth body, and her movable head and limbs are made of smooth vinyl. She comes with the Gabriela paperback book, plus her signature outfit:",
      "A cropped purple sweater with silver dream graphic and soft turquoise tank top",
      "A fitted pair of dark-blue jeggings to keep her comfy",
      "A pair of purple shoes with turquoise straps, a pink double headband, and 10 hairbands"
    ],
    "specifications": {
      "Package Dimensions": "19.2 x 8 x 5 inches",
      "Item Weight": "340 pounds",
      "ASIN": "B01N4LCKWZ",
      "Manufacturer recommended age": "8 years and up",
      "Best Sellers Rank": "#227,152 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars57 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "8 year and up",
      "Manufacturer": "American Girl"
    },
    "categories": [
      "Dolls & Accessories",
      "Toys & Games",
      "Dolls"
    ],
    "price": 184.99
  }
}