{
  "website_summaries": [
    {
      "verdict": "A spacious, contractor-standard box that provides excellent value for the money.",
      "pros": [
        "Relatively lightweight with great durability",
        "Useful organizer included for small items",
        "Comfortable handle",
        "Stackable design can be combined with other TSTAK units"
      ],
      "cons": [
        "Lid hinges have been known to break, though not often",
        "Some distortion under heavy load"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Tidy things up in the tool section of the garage.",
      "text": "I purchased this model for the top of my stacker, I'll include some pictures of it's size and internals. I got this one for my OSC tool and corded drill, I like the upper compartments for holding all of the drill bits and screw bit tips. It feels pretty tight and secure, not sure I'd trust it to fall from the back of my truck...but just tipping over or the occasional item falling on it may be okay. I look forward to it's being put to use.",
      "rating": 5.0,
      "verified": true,
      "author": "ID I Am",
      "helpful_votes": 453,
      "publication_date": 20170607
    },
    {
      "title": "Dewalt is Latin for Garbage",
      "text": "Seller was fine, product is not their fault.Total piece of garbage, the top holding screws broke the very first day, the metal closing clips fell of the second. If it says dewalt on it, that’s Latin for junk! I will never buy anything with that name on it again!",
      "rating": 1.0,
      "verified": true,
      "author": "Rex",
      "helpful_votes": 57,
      "publication_date": 20171214
    },
    {
      "title": "After a few months the hinges snapped off",
      "text": "Few months after purchase, the top lid hinges snapped off. It’s cheap plastic and not meant for heavy duty use. Bought it for the name and ended up regretting it. Do yourself a favor and get something with more qualitAfter a few months the hinges snapped off. See pics.",
      "rating": 1.0,
      "verified": true,
      "author": "Paxter",
      "helpful_votes": 7,
      "publication_date": 20181218
    },
    {
      "title": "I've got to believe this wasn't by design....",
      "text": "I like every thing about this trolley except one thing. Except when the lid of a hinged box is above the handle it can't be opened when it's on the trolley. Doesn't matter which hinged box, Large Tool, Small Flat Top, Parts. None of them open without hitting the handle unless they are mounted backwards. The handle is in the way. It's not that big a deal because I usually break boxes into a tray for a lull but when you want to confirm the contents of a box it's a pain.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Morgan",
      "helpful_votes": 7,
      "publication_date": 20170510
    },
    {
      "title": "Space inside smaller than dimensions imply",
      "text": "This seems well-made and a solid storage unit. But for my needs, it is too small. The dimensions listed are a little bit deceiving as there are many wedges and ledges and plastic barriers that prevent larger items to be stored in The central compartment. Three stars since it does seem like a good product, but not really advertised correctly regarding the space inside",
      "rating": 3.0,
      "verified": true,
      "author": "Violet2Blue",
      "helpful_votes": 4,
      "publication_date": 20171116
    },
    {
      "title": "Very useful for keeping camping supplies organized!",
      "text": "I bought the two-drawer organizer along with the deeper 17\" box to build a one-stop kit for all our wilderness camping supplies. The drawers are GREAT for keeping cooking and eating utensils organized, along with anything else small that you don't want to lose. The drawers latch shut, and this is small enough to fit just about anywhere you need. It was perfect for my needs. This would also be great for keeping supplies organized and portable in the home - crafting and sewing stuff, or handyman tools. I'd probably go for something bigger for garage use, though. This is compact and probably isn't all that useful if you have a lot of hand tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Durable box but be careful about the staking system",
      "text": "I like this product line and have several T-stak boxes. The annoying thing is that DeWalt appear to make three or four slightly different systems, all w/ the \"T-stak\" name (e.g., T-stak I, T-stak II, etc). My T-stak II boxes fit on top of this one more or less, but it doesn't feel as snug and secure as the two T-stak II boxes I have that it together.",
      "rating": 4.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 5,
      "publication_date": 20170604
    },
    {
      "title": "Really like this product line",
      "text": "Really like this product line. Holds several sets of screwdrivers, pliers, etc. The drawers slide nicely and close with a satisfying click. While not as heavy duty as the dewalt tough system, I think these will last quite some time.",
      "rating": 5.0,
      "verified": true,
      "author": "Brendan",
      "helpful_votes": 189,
      "publication_date": 20150110
    },
    {
      "title": "Great quality box",
      "text": "This is a high quality tool box. I am actually using it to store fishing tackle on my kayak. I like having a covered \"crate\" for my stuff. This is really nice because it is the same size as a milk crate, yet it has a covered top and no holes like a crate. It also has a nice handle and a top compartment to hold small things. Love it and think it would be great for all sorts of applications and not just tools. Plus you can link other boxes to the bottom of this and add other storage to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent Blackburn",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Wastes an incredible amount of space.",
      "text": "This is, without a doubt, the dumbest design I've ever seen for a storage box. At least 30% of the volume of this box is unaccessable, being filled with an un-removable spacer that holds the small storage bins. Dewalt actually has a similar stackable box (DWST14825) that uses these same storage bins, but it uses 100% of the volume of the box for these bins, fitting more bins and thereby more storage in a smaller footprint. That's smart. These boxes are flat out stupid. Sent them back immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "James Koehler",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Poor Design",
      "text": "TSTAK (Stanley, Dewalt, etc) wastes an inordinate amount of space while structurally being ineffective. As many reviews state, the drawers drag (even when empty). The floors sag despite literally inches of wasted structural space: 2 inches on each side (four combined), 2 inches above the drawers, 1-1.7 inches inside the case, etc. I tested at ~50% weight, 80% and 110% and was disappointed in all. I bought the ToughSystem at the same time (and four other similar designs) and can state emphatically that despite the ToughSystem having flaws (still the best choice if you need drawers), the TSTAK should not be considered a viable modular toolset.",
      "rating": 3.0,
      "verified": true,
      "author": "Smithy Smith",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "4 stars because of inside shelf",
      "text": "The only thing that makes this box a 4 star as apposed to a 5 star is that the inside shelf is smaller than appeared in the picture. It doesn't really fit, but other than that, it works perfectly, is durable and looks great.",
      "rating": 4.0,
      "verified": true,
      "author": "Caitlin Benedict",
      "helpful_votes": 2,
      "publication_date": 20200507
    },
    {
      "title": "Basic case, lost space inside, not a water tight seal.",
      "text": "This is the Dewalt BASIC model of a stacking case. I thought my small tool box would fit inside, but the interior dimensions are limited by the indents of the plastic on the sides. So my 17\" box would not fit. I also noted that the case did not seal as well as the upgraded model B005HNJPHO Tough System. more space, dust and water seal. It was a little cheaper at Home Depot. Sent this case back. If I was just looking to store on a shelf, this lower cost (half price) case would be fine. But taking outside to work or leaving near water or dust, would not.",
      "rating": 3.0,
      "verified": true,
      "author": "cwglindn",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "and love everything in its place",
      "text": "This is my first DeWalt TStak. I'm an organization freak, and love everything in its place. I've had totes, boxes, toolboxes etc. for my tools, home items, and hunting stuff. I'm using this TStak as my hunting case that holds hunting shells, electronics, cleaning supplies etc for long trips out west. It's simply amazing. It's heavy duty, and functions so well I think I'm buying more. The long aluminum handle functions great, along with the side handle. If you're looking for an open, tough, and affordable option, go with these. You can't beat them for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "BJM",
      "helpful_votes": 2,
      "publication_date": 20161009
    },
    {
      "title": "Using it to store my flashlights and possibly knives while camping",
      "text": "This case is the one. Price wise I couldn't beat it for the construction. The foam insert was cut perfectly and was about $15 from Amazon where the case was amazingly only $18. I really can't seem to find a better deal anywhere on this type of case. Will certainly stand up to the test of time. Flashlights are as followed if you want their size dimensions: Noctigon K1 SBT90.2 5700K EMISAR D18 NW SST-20 4000k default optics BLF LT1 Lantern 8xLH351D 4x18650 Sofirn SP31 v2.0 Convoy C8+ 365nm LG UV filtered Convoy S2+ 365nm LG UV /6W filtered",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Works with Stanley TSTAK also.",
      "text": "I found a Stanley tstak rolling toolbox set at a local store on clearance and bought this hoping it would work with the Stanley. They are the same company but didn't know if they were made different for the different brands. Was pleasantly surprised to find out that they do work. Using the TSTAK system I can carry all my tools easily in my truck to the job site then roll them to the job, keeping them organized on site so I can spend less time picking up at the end of the day.",
      "rating": 5.0,
      "verified": true,
      "author": "T C",
      "helpful_votes": 2,
      "publication_date": 20180111
    },
    {
      "title": "Again DEWALT would have another excellent product, the box is quite good",
      "text": "Again DEWALT would have another excellent product, the box is quite good, BUT the lid only opens to 90 degrees. Extremely unpractical and bothersome to have that vertical open lid in the way, AND it is inevitable that at some point this causes damage to the hinges, which may be DEWALT's idea of \"programmed obsolescence\". If the lid would open 180 degrees, which means flat, i would give 4 or 5 stars to that toolbox..",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 3,
      "publication_date": 20180120
    },
    {
      "title": "i was able to fit my dcf885 impact driver and the dcd771 drill/driver into this box",
      "text": "Unfortunately, there is no drill storage box specifically designed by Dewalt to fit my DCF885 impact driver and DCD771 drill/driver. So I did some browsing and found this box from Dewalt. I was unsure if both of these drills would fit, but I am happy to say they do. I also had to purchase the Dewalt DWST88801 TSTAK foam insert to keep the drills stabilized inside the box when transported. Unfortunately, again, the battery charger does not fit and had to be stored in another smaller box ,not manufactured by Dewalt, for protection and transport.",
      "rating": 4.0,
      "verified": true,
      "author": "Vince J.",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Dewalt tstak cart",
      "text": "Hi this is a review for the Dewalt tstak cart. This cart is a lifesaver. I have about 5 boxes of the tstak line stacked onto this daily. I am a foreman for a fence company and love this line and the cart to roll it all. The clips just like the boxes are sturdy and has never failed. The wheels are very nice and study but at the same time are rubber and can be wheeled inside on floors or carpet with no problem. It saves so much time bringing all of your tools in one trip compared to 4 or 5 trips and time is money. I highly recommend this product for the pros. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "sabrina",
      "helpful_votes": 9,
      "publication_date": 20150312
    },
    {
      "title": "Worth it...very sturdy.",
      "text": "For a contractor, this may or may not work, but if you've been a homeowner for over 30 years you know how boxes of screws and bit can get scattered here and there. This unit may be plastic but it is pretty tough and very sturdy. The organizer trays are removable so even if you carry the whole box to where you are working you can still grab just the one box of whatever and go. The small organizer trays on the sides are also a good feature and due to the design, when you close the lid to carry it, everything in the trays stays in the trays. I'll be buying several more of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Domeika",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "I found the TSTAK's to be a fantastic budget alternative to Systainers and L-Boxx's",
      "text": "I found the TSTAK's to be a fantastic budget alternative to Systainers and L-Boxx's. The deep box and flat top box work best for holding power tools and the organizer model works best for small parts. I would suggest favoring the organizer over either drawer model. The drawer models can be problematic if something pokes up high and prevents the drawers from opening. Note that the sidewalls on the cups can cause the organizer (TSTAK V) top to be a bit difficult to close but you get the knack for it if it does happen. The TSTAK cart is also something to consider. While limited to nice flat terrain, the cart is really nice for pushing stacks about the workshop.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott and Wendy",
      "helpful_votes": 4,
      "publication_date": 20160612
    },
    {
      "title": "Excellent design and very happy with this tool storage system",
      "text": "I really like this system. I'd encourage those who are considering them to lean more toward the drawer versions, as opposed to the box versions. I kept un-stacking and stacking the layers of tool boxes just to get to the one what required lifting a lid from the top. These drawers allow me to pull out just the drawer I want, while the entire group is stacked. I also just love the dual handles of these boxes. One on top, and one on front. I can remove just the box I want, when I want it, and it is easy to carry. I WANT MORE of them!",
      "rating": 5.0,
      "verified": true,
      "author": "RichBald",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Great Storage Solution",
      "text": "It’s a smaller box, but it’s just the right size for specific items. I got it to store batteries and I am very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Corey Scott",
      "helpful_votes": 2,
      "publication_date": 20200512
    },
    {
      "title": "Heavy duty.",
      "text": "I like the box but the one thing I don't care for and it's not a deal breaker is the tray doesn't stay in place. It's not a full width tray that you can put on either side but it comes off the molded hooks on the sides of the box when the sides flex. I carry it in my car so when I open it the tray is on top of the tools in the bottom. Any small parts like nuts or screws may fall in the bottom. Like I said not really a deal breaker hence the 5 star rating. You might see it differently.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirk M.",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Very happy with this",
      "text": "It took me a lot time to browse and choose a tool box but I am very happy with my choice. This is such a great box! I am an amature craftswoman but I do a lot of projects like furniture transformation and minor house repairs/updates. I needed a tool box with a lot of space that was also portable. This box is durable and well made. It fits all of my basic tools and accessories with lots of extra space. It feels very durable and definitely on Par with my Dewalt expectations. I would like to buy the next set that attaches too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160902
    },
    {
      "title": "Not deep wasted space under standard bins",
      "text": "I give this one star in storage space the bins sit on top of a very impractical second storage area the bins are no deeper than dewalts other cases therefore I have found no practical use for the space below the bins. it was a little misleading that thay advertise this as deep",
      "rating": 3.0,
      "verified": true,
      "author": "Kane",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Low capacity, Sturdy, and Reliable.",
      "text": "It's my fault because I should've measured my tools and everything better before purchasing this, but this toolbox can only effectively hold like 3 small power tools and a handful of accessories. Not quite the capacity I was hoping for, but it is sturdy and does what it is supposed to do perfectly. Unless you have a small tool set for a specific task, I'd recommend buying a much larger case if you anticipate accommodating a bunch of tools. Otherwise a great toolbox!",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin H",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Good, BUT very weak stack system hinges",
      "text": "Product arrived within 2 days as amazon is known for, the plastic used for the shell of the box is much thinner and flimsier than the dewalt tough system; Top drawer won’t open or close with more than 50lbs sitting on top of it. I ordered one of the single drawer t-stak boxes and it doesn’t feel as flimsy and definitely doesn’t flex as easily with some weight on top of it. Most importantly, the stacking hinges on this box broke with ease, kind of disappointed that I can’t stack anything on top of this box.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Duft",
      "helpful_votes": 2,
      "publication_date": 20190701
    },
    {
      "title": "Really good space, not as heavy duty as the brand is known to be",
      "text": "This toolbox is great for all of my standard tools. I was hoping that the quality would be more heavy duty, hence the 4 stars. But overall, it does the trick. However, I wouldn't keep super heavy tools and accessories on the top compartment, though. The main compartment has a removeable tool caddy with handle that you can arrange to your desire. It has really good space inside the main compartment. I am able to fit a drill, battery, hammer, and two, separate slim accessory boxes full of nails and things inside.",
      "rating": 4.0,
      "verified": true,
      "author": "aliceholic",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "bought for size and brand",
      "text": "A very good toolbox sized to fit the tools I wanted to store safely. Plenty of room for the tool, and all the accessories. Sturdy enough to stand on it, and I weigh just over 200 pounds. Plastic boxes are better for work sites that may have standing water or to be rainproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim White",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "The drawer craftsman forgot.",
      "text": "I purchased this model to add to my versa stack since craftsman does;t have the big drawer. I needed and option that would hold \"ALL\" of my tools from computer and small parts repair to around the house DIY work. I like the compartments for holding all of the little bits and what notes. It feels pretty tight and secure, and stacks perfectly with my craftsman versa stack items. I look forward using it and adding more stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "J1",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Great cart, and way better than the wheeled base.",
      "text": "Fantastic dolly. IT WILL NOT HOLD THE DEWALT TSTAK DWST17808 LONG HANDLE ANYWHERE BELOW THE HANDLE. At the top of the handle low structure (not the part that extends), there are two bulges on the black wrap around part that prevent the hinge area from sitting back flush so the locking handles will engage. For the DWST17808 to mount you need three of the other boxes below it to move it above the handle structure and those bulges. This is in no way a negative reflection upon the Trolley, but if they removed those bulges it would expand it's usability.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Browning",
      "helpful_votes": 6,
      "publication_date": 20150629
    },
    {
      "title": "I was delighted to finally find a toolbox set up with four ...",
      "text": "I was delighted to finally find a toolbox set up with four wheels and ordered a set of boxes plus this Trolley. The entire set could use better engineering and quality control. (see my comments on individual boxes) To secure the stack of tool boxes to the Trolley (other than the plastic clips holding each box to the next) there is only ONE strap with a akward plastic clip, the placement of the strap cannot be adjusted. The front lockable casters do not roll well over rough terrain, they should be a larger diameter. The rubber of the tires will leave black marks on flooring if there is friction such as sliding the loaded Trolley sideways.",
      "rating": 3.0,
      "verified": true,
      "author": "JLS",
      "helpful_votes": 3,
      "publication_date": 20151209
    },
    {
      "title": "Perfect for tool storage",
      "text": "I have a love for dewalt and this case brings it all home. Now I have a huge and roomy case to store all of my \"around the house\" dewalt tools. It can hold tons of tools, has a large open area inside as well as a compartmentalized section on the lid for smaller items like screws or nuts and bolts. Handle clicks into place for a sturdy grip. Can't complain, it's amazing. Highly recommended to anyone who needs tool storage",
      "rating": 5.0,
      "verified": true,
      "author": "Cody Bachman",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Not pleased with this",
      "text": "Do not use with small parts. They will shift compartments. There is over an inch of open space above compartments when drawer is closed. Just ridding in vehicle will make the parts jump compartments. Not pleased with this.",
      "rating": 2.0,
      "verified": true,
      "author": "Oregonian",
      "helpful_votes": 3,
      "publication_date": 20170628
    },
    {
      "title": "Able to stack but can't be latched",
      "text": "Disappointed for this DEWALT (DWST17814) Tstak Deep Long Handle tool box. The side latches are severally deformed which make it impossible to be latched to downstairs Tstak boxes. Seemed Dewalt now is consuming its reputation to selling cheap product. Not recommended",
      "rating": 1.0,
      "verified": true,
      "author": "Icewolf",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "OK this is one of those Items that's better than expected!",
      "text": "I took a chance because of the good reviews and I am glad that I did!. I am a full-time RVer, and space is everything. My tools are important but lugging around a toolbox is heavy and cumbersome. I tried tool bags and they are a pain as everything is tossed together. These are very well made, have bearing slides and are so good I'm buying more to use ! Sturdy build, compact, locking drawers, modular.",
      "rating": 5.0,
      "verified": true,
      "author": "Fwayne",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "SERIOUS AND EXCELLENT SUPER LARGE TOOLBOX",
      "text": "Dewalt has been one of my favorite maker of great toolboxes in many styles and sizes. This is a serious toolbox that I am using for my main utility container. All the batteries and tape and glue and hardware for all scenarios. Plus staple guns and nails/screws and..... This very large and beyond well made toolbox is a toolbox freak like myself nirvana. I have never owned a Dewalt piece of equipment (especially toolbox) that I didn’t appreciate.",
      "rating": 5.0,
      "verified": true,
      "author": "Major T.Top Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "PLEASE OBSERVE REVIEWS OVER DEEP TOOLBOX SHORT HANDLE",
      "text": "Everything about this box looks great except the the fact that, as other reviewers have noted, the tray in 2/3 the size that it appears. Please keep this in mind and i am reviewing this along with others so that future buyers and/or it’s distributors can illustrate this at the very least in their description or dimensions. The picture is very misleading and I am returning and buying the long handle which seems to have the best success under this great brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Andres D.",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Quit wasting money and life on small things!",
      "text": "Nice tool box like the dividers in the top! Coming back to change my review got several months of use take this to box and throw it in the damn trash these drawers are so small they get tangled up on each other when you got a little bit of tools in them the drawers are continuously getting stuck on tools beneath them. Give the Box some size for god sakes.",
      "rating": 1.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "My tray is only a partial",
      "text": "The images I looked at showed a tray that went all the way across but mine only goes 2/3 across and I think it's a bad design. Also the box is not that deep when it has the tray and it's so narrow a small box of screws doesn't sit flat inside the tray. I have that small box of screws sitting at an angle because it's too big to sit flat.",
      "rating": 2.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "I Like it Pretty Well",
      "text": "My only complaint about this box is the ease at which it is to raise the lid with the top compartment cover not latched. When you do that all your tools in the top compartment go everywhere - trust me, I know. I have got to get in the habit to making sure the top is secure - you can't tell visually. The good side is you get to clean out and reorganize the top frequently! Love it otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "ckm",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Have over a dozen of the TSTAK.",
      "text": "I initially purchased three sets, of a four item combo pack (dolly, large case, small case, small-case w/big handle), and have since purchased several more of the TSTAK cases. The system works nice for my small SUV. While I did not plan on it: Coming in to a clients residence with a stack of matching cases makes a very nice impression on the client (versus my old hodge-podge of non-matching tool cases collected over the years). It's pretty good value. They are not perfect, I did make a warranty claim. There is a video from DeWalt showing a stack tumbling over (really recommend you NOT try that) and DeWalt was pretty prompt about sending me a new case.",
      "rating": 5.0,
      "verified": true,
      "author": "Reese T.",
      "helpful_votes": 2,
      "publication_date": 20160903
    },
    {
      "title": "Tough stuff, good for your garage",
      "text": "Those are some solid boxes. I seen them on a maintenance truck for a bunch a guys we use for repairs. SO i ordered some for myself. Spare parts, screw collections etc. Would be great if you could exchange compartments to make things fit, there are different configurations I received, liked them so much I ordered more. Like to idea that is has a place for screw bits of all sizes. Well done.",
      "rating": 5.0,
      "verified": true,
      "author": "Petrus",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Sturdy and well made",
      "text": "Perfect tool box to throw loose tools in. It's nice that it has a long handle across the top of the box, but then there's also a smaller handle on the front side of the box. When you open the lid, the depth to add your tools in is almost 4\". The top of the lid opens separately from the main compartment to store small items (7 compartments, non-adjustable). Since it's plastic (but excellent quality hard plastic), I don't know if contractors would be happy with it, but it's a perfect toolbox for a homeowner.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny from Nebraska",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Would buy again a zillion times over!",
      "text": "Bought 7 of these, first 1...then 2more, then 4 more!!! Do yourself a favor if you want to get organized. Now I have a very nice and sturdy option to travel with all my different projects and tools. I am beyond happy with these, I wish I had room for more just as backups from more projects to come. OH, and what a bargain price!! Can't beat the quality and price.",
      "rating": 5.0,
      "verified": true,
      "author": "CallmeJack",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Nice Drawer",
      "text": "This drawer comes filled with plastic containers for holding things like screws, nails, or any small piece items. However, I just wanted to use the drawer as a drawer, not a container holder. The containers are easily removed and put aside for other uses and that's what I did. I would enjoy having an even deeper drawer, but these are the biggest TStak drawers offered at this time.",
      "rating": 4.0,
      "verified": true,
      "author": "Shopping Guru",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great box for the price",
      "text": "Love this box, while it's no Milwaukee Packout, it's also much cheaper and lighter. Thought it was a steal at $25 so I bought a second to gift. I keep my Dewalt 60V grinder, 20V jigsaw, 20V oscillating tool, and an Arrow slap stapler in the box along with plenty of blades/staples and a 6ah 60V battery. Don't even have to arrange everything perfectly, theres a bit of room to spare",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Lee",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Quality Product / Great Price!",
      "text": "I was looking for something to store my circular saw, jig saw, sander and electrical cords for a quick grap and go when needed instead of grabbing each item in its own cardboard box. This box is perfect for all those item and even room for more. Nice and sturdy with two front clamp locks to keep lid nice and secure. The top handle is also extremely sturdy and snaps nicely in place when not using it so other Dewalt boxes stack on top. The day after this one arrived I purchased another for other tools. Highly recommend!!!! Thanks Dewalt for such a high quality product!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S.F.",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Make sure you read the measurements.",
      "text": "I got the box and noted it didn't fit the rack I have. Went back to the listing and realized it is not as long as the others I have so that's my fault. Should have paid more attention. More research and I finally noted may not be able to get one I can actually use with the other two. I guess the one I need they no longer make. The box is good and well made.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Eakin",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Perfect for RV",
      "text": "Fits perfectly in the storage compartment of our RV. It has handled the wear and tear of travel and being tossed around. We are able to store all the things you need or might need when traveling. Was more expensive than other toolboxes, but worth it. We bought this one to replace one from home depot after the handle broke off. The Dewalt brand is definitely worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "TBF2020",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Organizer",
      "text": "I replaced one of the large cup containers with 2 small ones, because I found the number of individual sections lacking. The storage under the cups is OK, but I would have preferred either deeper cups or an overall thinner organizer. The perimeter storage around the cups is a good idea, but poorly executed: items stored there do no stay in place when you carry the organizer by its handle; not even the bits which have individual holes. Therefore, it would have been better to just fit more cups in the organizer. Regardless, I chose this unit since it locks into the TSTAK system, and it's a pretty useful organizer with good sized removable cups.",
      "rating": 4.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Great for the average guy",
      "text": "I must admit, even though I needed a tool box I got THIS ONE because it has a pretty color and design. This is a nice box for the average guy who does work around the house, but I wouldn't recommend it for a professional because it's all plastic that with a lot of rough handling or dropping it will get scratches and possibly break moving parts or crack the body.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "TStak is the cheap junk  Tuff box is a little betterboth Dewalt",
      "text": "This TStak cannot even touch Rigid wheeled box and cases. The Tough system is a bit closer match. Tough system is 14 some odd inches wide the 4 port fast charger clicks on top of Tough system . T stak is 12 inches wide nothing clicks on top of it . Nothing worth clicking anyway. In the retail rollin cart tool world Rigid is still it even over Milwaukee..",
      "rating": 1.0,
      "verified": true,
      "author": "TomD3",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Perfect. Not to big, not to small.",
      "text": "Perfect. Not to big, not to small. Solid axel keeps it stable even with 4 other boxes stacked on top. I install home theaters and this looks good from my customers standpoint. It’s clean and looks professional not a kids toy or way over the top. I’m fitting all of my trucks with this system. The draws are awesome if you get the set.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170921
    },
    {
      "title": "Love this box",
      "text": "Great for my soldering irons and i can keep the solder and flux with parts in the upper draw and in the bottom remove the vertical slats so i have 3 long storage bins for the irons. The different things you can do with the drawers makes this a very versital box and they do stack very well too. Not a bad setup and the price was reasonable",
      "rating": 5.0,
      "verified": true,
      "author": "Cogswheel",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Perfect solution for me.",
      "text": "I got this to fit under the back seat of my F 150. It holds all of the tools I carry in the truck, and it fits perfectly under the seat. I just got it last week, so I can;t speak to it's durability. That said, it seems very sturdy and is much the same type of material as my old box, which I have had for over 15 years, and will give to my son. A perfect solution for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Travis",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Best box of the bunch of great boxes.",
      "text": "I really like this series, but this one is the best so far. The tubs come out of this as well, and there is storage under the tubs. You have storage on the side and the front holds some drill screwdrive bits. The latches are secure and it's easy to find parts and pick them out. You can interchange the tubs from the drawer unit as well (those have covers) so if you need to bring parts along you can use those lids. Great finish to my stack.",
      "rating": 5.0,
      "verified": true,
      "author": "MNPilot",
      "helpful_votes": 2,
      "publication_date": 20170126
    },
    {
      "title": "Good quality well built box.",
      "text": "I was a little disappointed most power tools will not fit in the box with the tray. So you need to remove the tray in order to fit most battery Dewalt tools. The box should have been another inch deeper (H) and another inch to an inch and half longer from front to back. Then you could get two battery power tools in the same box. The more tools I can get into the box the less I need to carry to the jobsite. I do not want to have a box for each tool.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Easy to use",
      "text": "It is a good product for general use. I use it as a work tool box carrying all of my heavy tools. The wheels seemed to struggle. Within 6 weeks, the endcap came off the wheel which I had to replace. The handle is good and sturdy but the attachment point of the lid to the handle appears weak. I still would buy it again as it is well worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Five Stars",
      "text": "Love it got a second one (This is for the black short handle deep box) my third tstak these are tough but you can't throw them off a roof. Seems to be water tight sat in the rain all night opened it up and was completely dry inside. The long handle yellow top leaks into the top storage compartment but not the deep bottom part. Got two of these also. Good investment. Have had the long handle one's for five years now and no issues except leaky top section. Don't be kickin em around will last for years. Amazon seems to be the best price.",
      "rating": 5.0,
      "verified": true,
      "author": "Deadbeat",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Great box, but with a design flaw",
      "text": "Well built and durable box, just as I expected. Perfectly organized with compartments of different sizes. One thing that I discovered the hard way is that if the box is not locked and you lift it by the handle, its entire contents find themselves on the floor in one nice pile. Design problem I would say.",
      "rating": 3.0,
      "verified": true,
      "author": "Jack M.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Quality control could be better",
      "text": "Arrived with the e clip that retains one wheel on , lying in the bottom of the box. This is the 2nd piece in 8 that have arrived broken in the tstak line",
      "rating": 2.0,
      "verified": true,
      "author": "kiwidispora",
      "helpful_votes": 14,
      "publication_date": 20140902
    },
    {
      "title": "Not professional at all",
      "text": "The plastic is thin. The bin ontop doesn't fit perfectly, in transport is falls off the hooks. One thing I do like is you can reach the bottom from the top with the tray in because the tray is about 70% of the width. You can fit a decent amount of tools inside but it is flimsy. On a warm summer say it flexes so much the tray falls and spills the tools all over.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Very good deep toolbox for organization.",
      "text": "I wasn't certain just how much I would be able to jam into this toolbox, but I am very pleased with it. I already own a few other of the smaller TSTAK tool boxes, and this is a welcome addition. I have put my cordless drill, impact, and bit sets in here along with a spare battery, wrenches and screw drivers in the tray, and miscellaneous bits, washers, nuts and bolts in the top compartment. I also recommend the two drawer unit if you have small parts that you want to keep organized. I've also seen them with the Stanley name brand, and they are interchangeable with the Dewalt TSTAK boxes for anyone that is wondering.",
      "rating": 5.0,
      "verified": true,
      "author": "AnotherAmazonJunkie",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Very strong and sturdy",
      "text": "Fabulous tool box for small jobs. I would consider myself a mild-moderate \"handy-woman\". I have a drill, different screw drivers, wrenches, etc. Two layers of storage. The top allows for storage of drill bits, nails and screws while the bottom allows for bigger things with no organizing separators. Definitely suits my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Just one complaint",
      "text": "This is the same rating/review I will give other pieces. The cases all seem robust enough for everyday work, however the metal latches just have a feel like they're too thin (at least they aren't plastic). They may be perfectly fine and hold up, and they do \"function\" well, but they could have coated them for a better tactility. The handles and hinges seem to be well designed for durability, only time will tell. A few of the boxes came with individual storage bins, and some were covered (nice touch), not saying this piece necessarily does. All in all, I think they will work well for the purpose I intend to use them. If not, I will post an update.",
      "rating": 5.0,
      "verified": true,
      "author": "clearly deranged",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Very nice",
      "text": "No plastic clasps like a lot of them out there - last boxes I got with plastic clasps broke in less than a week. Already used, while full, for over 2 weeks and holding up strong! If I can find a set of wheels to go in the base, going to order another storage base and use the set of three like a dolly set-up to wheel around the property",
      "rating": 5.0,
      "verified": true,
      "author": "MrMega",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "wasted space - lots of it",
      "text": "I have a lot of Stanley and deWalt organizers and like them a lot. However this product totally misfired. It has a huge amount of wasted space underneath the organizer containers - something the other models do not. There's no way to use that space or even to access most of it. I will avoid this one in the future.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "I Don't Like the Interior Tray",
      "text": "Overall it's good quality but I don't like how the interior tray sits. It doesn't fit well inside the box. It keeps sliding around around and falls down inside the box when you try to put in. Not very well designed! Also I left my tool box out one time in the rain and a lot of water got inside of it. They need to make this rain proof.",
      "rating": 3.0,
      "verified": true,
      "author": "BLACKWIDOW",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Sturdy, convenient",
      "text": "I purchased 4 different TStaks and glad I did. This unit is perfect for storing many tools when you need quick access and don't want to be digging into a deep box or bag (a major frustration). I have numerous screwdrivers, crescent wrenches, vice grips, hex wrenches, and more in this box. I can see them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Yachtman",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "A Great Part of a Great System",
      "text": "Like the DeWalt TStak toolbox components it carries, this is top quality. Rolls in all directions very easily. I have two of these, with two highly customized stacks of components. They organize my tools better and are easier to move than the heavy, wider, rolling steel tool chests.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Moyer",
      "helpful_votes": 2,
      "publication_date": 20161113
    },
    {
      "title": "its great!! Wheels are not too hard",
      "text": "You must have bought this knowing what it is. Its a cart that attaches to the other Tstak boxes, so you wont have to lug all of them around... for that, its great!! Wheels are not too hard, so it rolls smoothly. I don't understand why it needs to be that much bigger than the boxes, it adds like 2-1/2\" all around. would be nice if it would have fit flush. multiple boxes, multiple carts, stack them next to each other.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaiukeino",
      "helpful_votes": 3,
      "publication_date": 20161226
    },
    {
      "title": "I love the idea behind the TSTAK system and think this ...",
      "text": "I love the idea behind the TSTAK system and think this is a great addition to my took cabinet. I will note that the plastic containers that come with these on the inside of the drawer are pretty worthless. The lids do not snap down very well and will open when the drawer is closed. This makes it either impossible to close or open the drawer depending on which way the containers are situated.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul S GC",
      "helpful_votes": 2,
      "publication_date": 20170320
    },
    {
      "title": "Cheaply made wheels / beak very easily.",
      "text": "The wheels are cheap! They break very easily. I would not recommend buying this product if you are going to be taking it in and out of a truck.",
      "rating": 1.0,
      "verified": true,
      "author": "Walter Wheeler",
      "helpful_votes": 3,
      "publication_date": 20180425
    },
    {
      "title": "Love this thing... must check out yourself!!",
      "text": "Well I bought for storage of some tools but then I ended up storing more than I had planned on doing. It has plenty of space and you can get additional tubs that will connect them together. I labeled them with the label now I have them easy to find when I need them. I am not a contractor but if I was would definitely use this product. Put some wheels on it and off you go.",
      "rating": 5.0,
      "verified": true,
      "author": "prnavy2002",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Smart Concept",
      "text": "Love the box. Love the concept of the boxes clipping together and separating. Very convenient; saves floor space in my storage area and makes it easy to move them to and from my work area or vehicle. The mechanism to clip the boxes together and pull them apart is fairly simple to operate. I have two pieces so far and will be getting some other ones bit by bit.",
      "rating": 4.0,
      "verified": true,
      "author": "Delta Hotel",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Very sturdy yet lightweight",
      "text": "This was the perfect fit to store my mis matched tools. Very sturdy (I used it as a step stool in a pinch and held my 150+lbs). Love the stacking system and cant wait to get some wheels added so it's easier to move around (I FILLED it!).",
      "rating": 5.0,
      "verified": true,
      "author": "Liz McBride",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Great Tool Box/Kit for people who have a lot of tools and in need for tidy up their tools.",
      "text": "Great product that I use for tidy up my tools. It helps me to save space as I have a lot of tool kits. The drawer come with slot divider (segregation) so that i can segregate my tools according to my needs. Now I am slowly combining all my tools from different tool kits into one Dewalt tstak tool kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Lim Siong Chuan",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Best tool box ever for your drills and bits along ...",
      "text": "Best tool box ever for your drills and bits along with your fasteners all in a lightweight case. Please do yourself a favor and and buy the foam insert. It's definitely worth it and you can customize its shape easily to fit any drill and impact set. 1 Dewalt impact ready box fits perfect in the above compartment and you can also fit other various bits and all your ammo for the job in an easy to carry case that works great as the top to your other tstaks because of the large handle on top. I use this every day and honestly like it way better than the extremely heavy tough boxes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Neill",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Sturdy Storage Case",
      "text": "Bought this case for my Dewalt 20V Max XR reciprocating saw ( DCS367B ) as you can see it fits my saw , battery , charger and blades perfectly . Inside measurements are 10 3/4 “ - ( inset handles ) 15 1/4”- ( stacking inset ) and 16 1/2” wide , odds sizes because of it being stackable .",
      "rating": 5.0,
      "verified": true,
      "author": "Hot Tights",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Dewalt has various tool box systems. One must be careful to order the correct width and depth to fit the whole assembly.",
      "text": "I am a fan of Dewalt products. I returned this order because it was the wrong width size for the tool box configuration I have. I gave this a 3 star rating because I made the mistake not Dewalt.",
      "rating": 3.0,
      "verified": true,
      "author": "Out in the Sunshine",
      "helpful_votes": 2,
      "publication_date": 20180502
    },
    {
      "title": "Missing Label Holder",
      "text": "I bought a DEWALT Tool Box, TSTAK II, Flat Top (DWST17807), ASIN #B00B6K4V80 on 8/31/2020. The box is fine. It comes with a label but the label holder is missing. First I don't even know there is a label holder. Afterwards, I purchased a second box. There I find out the first box is missing the label holder. Can you send me a label bolder?",
      "rating": 4.0,
      "verified": true,
      "author": "Seasonal buyer",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Appears to be rugged",
      "text": "First review. I orders this to mount onto the luggage rack of my can am side by side. I needed something rugged with the capacity to hold tool, tire repair, small 12v air pump, recover tool for the winch. I have been useing Plano ammo cans but they lack the capacity.",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Better than expected.",
      "text": "Combined with Kaizen Foam Inserts for this box, this box is really really handy. I was able to precisely cut out slots for my most frequently used tools and now they are just a drawer pull away. The box is much sturdier than I expected. It weighs in at 9 1/4 pounds. And that's all structure. They built this thing to last. The drawers pull out and slide back in really easily. And they snap firmly closed with no play. The handle is comfortable and folds flush into the top. This is my first DeWalt TSTAK product, but it's definitely not my last. Mine was made in Israel.",
      "rating": 5.0,
      "verified": true,
      "author": "Hooliator",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Lots of wasted space.",
      "text": "These are definitely sturdy. But they are a too big for what they hold. There is a plastic liner under the trays that occupies a good bit of the case space. Also the trays cannot be put in any position, like some others can. If none of that bothers you, they will probably last a good while.",
      "rating": 3.0,
      "verified": true,
      "author": "Pursual",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Could be better.",
      "text": "Good product, but could be better. The bottom pushes up into the bottom drawer when weight is added. I added blocks to the bottom outside corners like one of the other reviews described, it worked ok. I'm a loyal Dewalt customer, but they need to step up there game, in this product line. Love the Flexvolt line.",
      "rating": 4.0,
      "verified": true,
      "author": "C,J Hayenga",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Handy dandy storage case",
      "text": "Like😄,it's perfect for what I needed it for, to store my semi emerald items in the back of my truck,first aid kit, emergency sleeping bags,three,like those solar blankets,an few other things,dog stuff,collaspable shovel, going to order another one for camping gear,not really big but like I said perfect for my needs",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Spend a few dollars more and get metal.",
      "text": "The slightest weight and the bottom drawer runs the bottom on the case, love the product but if you or the weight in it they say, 16lbs I think... In afraid it'd run a hole in the drawer with any regular user, probably sending back. Few dollars more and I can get a real metal box. Shane, I love DeWalt products usually.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Great for my off-label application",
      "text": "I can't vouch for the strength of design, as my contents are pretty lightweight. But for organizing, storing, and transporting my sound equipment, it's perfect. Everything closes securely. The handle is convenient and locks in place. I may look into getting other units for my cameras, but right they're in another similar, modular, stacking system that's incompatible with this Dewalt system. Note that the foam in the shot of the bottom section (with microphones) is some that I had on hand and is not included with the toolbox.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "It's a plastic box....",
      "text": "It's a plastic box, a bit more sturdy or rigid than rubbermaid. Plastic boxes are a bit overpriced these days but I needed something a tad together than a rubbermaid bin sooo that's what I, this plastic box. Holds things just like a box should I guess.",
      "rating": 3.0,
      "verified": true,
      "author": "mr crazy guy",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great heavy duty tool case for the price",
      "text": "These things are great for the price (compared to the tough system units). I used the flat top toolbox for a drill and impact driver and also have room for some drill bits, a battery and a small charger (depends on brand of charger). Thee are not waterproof like the tough system boxes, but they are heavy duty compared to other brand regular tool boxes (traditional plastic). Highly suggest if you are getting more organized and want to have tool boxes that can be tossed around.",
      "rating": 5.0,
      "verified": true,
      "author": "SK Wire",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Sturdy and practical",
      "text": "My 15 year old son is beginning to be interested in cars and this is perfect starter toolbox for the beginnings of his tool collection. He loves that it can be added to/expanded. The tray inside is nice for smaller tools. This is something he'll have for a long time",
      "rating": 5.0,
      "verified": true,
      "author": "L. J. Crescenzi",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Heavy duty",
      "text": "This system of tool storage seems to be durable, however you don't get a lot of usable space for the actual size. Found them to be very heavy and rather cumbersome size for use from a service vehicle. Overall, I am not pleased with the ones that I purchased and would not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "stonej",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Solid and Versatile and Rain-proof!",
      "text": "I purchased this to keep emergency gear for roadside assistance in a manner that makes it easier to move around and provide seating for passengers in my truck. I used to use canvas and plastic bags, but now everything fits in a nice rain-proof container that is easy to transport.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig A. Smith",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Stackable Toolboxes - Very happy.",
      "text": "Bought three of these to try and get a bit more organized. Have a good amount of space, and nice storage under the lid in some compartments, my only reason for making this 4 star, was you can't re-arrange the compartments under the lid.. Stacking is quite nice too. The clasps are quite hard to open too, and the lid is just a pressure latch.. Design could be better, but for the price not taking additional points off.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Pick",
      "helpful_votes": 2,
      "publication_date": 20150425
    },
    {
      "title": "Well worth the money",
      "text": "Bought this as a Christmas gift for my husband with full intentions of using it myself. Its huge! I can fit so much in this thing that it becomes pretty heavy to carry around. Some complained that their circular saws didn't fit. Don't know about that as I've filled it with every other tool I have. Great toolbox for the money. I'd buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Lechman",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Bigger and better than I thought.",
      "text": "I didn't bother reading the specs and made a few assumptions. What I was looking for was a simple, tough box to put my leather working parts in but this was much larger than I thought it'd be and nicer. I didn't pay attention and the handle in the front of the box was a pleasant surprise. Now I'm considering tossing the Dewalt bag for my drill and driver, and putting it in there. I like this thing and I'm considering getting MORE.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Useful, uniquely sized toolbox",
      "text": "I’ve been looking for a toolbox in this size/shape and this one fits the bill. Due to the construction, the inner capacity seems small for the outer size, but it fits where I need it to and holds almost everything I need it to. The construction is very sturdy and the latches are simple and strong. It seems that this should last for a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Douglas King",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "It's about the best you can do mobility.",
      "text": "I really like the TSTAK system. I use it professionally and have found no need to upgrade to their top of the line system. Like I said this is about the best you can do mobility, then the big mechanics metal ones for your garage that break the bank. I recommend this when it's under 60. It goes there. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "ajb03",
      "helpful_votes": 0,
      "publication_date": 20191223
    }
  ],
  "product_meta": {
    "title": "DEWALT (DWST17814) Tstak Tool Box, Deep, Long Handle",
    "description": "Style:Deep Toolbox with Long HandleThe DEWALT DWST17814 TSTAK deep toolbox with long handle features extra large volume for large tools storage. The top organizer has fixed dividers for organization of drills & bits, with a deep box for your larger tools. A bi material handle on top of each unit allows for easy & comfortable lifting. This box also offers heavy duty rust resistant metal latches for durability and longer life. The TSTAK family features units that can stack on top of each other, connected with durable side latches. Overall length: 17 1/4\" x 12 5/8\" x 13 1/4\".",
    "rating": 4.7,
    "feature_bullets": [
      "Extra Large volume for Large tools storage",
      "Bi material handle on Top of each unit for Easy & comfortable lifting",
      "Heavy Duty rust resistant metal latches",
      "Durable side latches allow unit to be stacked to other tstak modules",
      "Top organizer fixed dividers for organization of drills & bits"
    ],
    "specifications": {
      "Manufacturer": "DEWALT",
      "Part Number": "DWST17814",
      "Item Weight": "6.71 pounds",
      "Product Dimensions": "17.25 x 12.63 x 13.25 inches",
      "Item model number": "DWST17814",
      "Is Discontinued By Manufacturer": "No",
      "Style": "Deep Toolbox with Long Handle",
      "Material": "Metal",
      "Item Package Quantity": "1",
      "Measurement System": "Metric",
      "Included Components": "1) Tool Box",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Limited Lifetime Warranty",
      "ASIN": "B01N2IMKYO",
      "Customer Reviews": "4.7 out of 5 stars6,171 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#416 in Tools & Home Improvement",
      "Date First Available": "November 19, 2016"
    },
    "categories": [
      "Power & Hand Tools",
      "Tools & Home Improvement",
      "Tool Organizers",
      "Tool Boxes"
    ],
    "price": 34.99
  }
}