{
  "website_summaries": [
    {
      "verdict": "Attractive, effective black masks for the filtration of flu germs, allergens, and other irritants.",
      "pros": [
        "Breathable with an active carbon filter",
        "Four layers of material in each mask",
        "Masks fit well and look good"
      ],
      "cons": [
        "Some complaints about a chemical odor in the masks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not for the chemically sensitive.",
      "text": "This is an excellent product. The reason I am giving it a four rating are: 1. It smells like glue and isn't very breathable. If you are sensitive to smells or have trouble breathing due to allergies, you will quickly notice. 2. It has a residue. The first two weeks of using this product my face swelled. In fact my skin continues to feel stiff using this product. I find it helps to shake vigorously and air out the mask before using it. I am going to buy my second box if I have any more skin reactions I will chalk this off as not for me. Great odor cancellation once you get past the mild suffocation and glue smell.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarta",
      "helpful_votes": 117,
      "publication_date": 20171105
    },
    {
      "title": "If you like a heavy chemical smell, go for it.",
      "text": "Couldn't use these. I tried, but the smell was so bad I had to remove immediately. I tried to air them out to see if was just from being in a sealed bag that didn't work still smelled of terrible chemicals.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 47,
      "publication_date": 20180408
    },
    {
      "title": "Ok.",
      "text": "Ok product. Not great. But it will do for home use. I do not recomend this for medical use or extreamly dusty conditions. The masks are individualy wrapped and are realy soft. However they are thin and the top nose pink are dosen't secure very well, the side of the cheeks opens up more than other medical grade masks and allows for an entry way for dust and debris. Delivery was super late. Did not arrive on time.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190116
    },
    {
      "title": "Wet face",
      "text": "I don't like the way my nose and mouth get wet inside of this mask. I prefer a vented mask. Disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 7,
      "publication_date": 20180823
    },
    {
      "title": "I like this one better than others that have cute patterns",
      "text": "I have bronchitis and currently live in a very windy desert. I like this one better than others that have cute patterns, they cause my nose itching like crazy. This is so comfortable to wear all day, no itching at all. Also they are each independently wrapped to make sure absolutely no dust on them after the whole package is open, no other seller's black masks have this seller's feature of the independent protection of each mask. It makes a huge difference. BEST MASK for bronchitis or any respotorial problem.",
      "rating": 5.0,
      "verified": true,
      "author": "g3heavenlyfruit",
      "helpful_votes": 3,
      "publication_date": 20180810
    },
    {
      "title": "Smell badly",
      "text": "Smell badly, ended up not using even one piece at all",
      "rating": 1.0,
      "verified": true,
      "author": "Qin J.",
      "helpful_votes": 7,
      "publication_date": 20180908
    },
    {
      "title": "they work and they're good quality. Each one is individually wrapped",
      "text": "hard to get excited about dust masks, but hey, they work and they're good quality. Each one is individually wrapped",
      "rating": 5.0,
      "verified": true,
      "author": "NotSoFastEddie",
      "helpful_votes": 9,
      "publication_date": 20170518
    },
    {
      "title": "Definetly Buying More Soon😃!",
      "text": "Placed my order Two days ago and recieved my order today. I was so impressed with the quality and that the masks are individually wrapped. I am a nail technician in training and my teacher said to order Carbon Filter Masks. The Nail Supply Store only had blue I love that these are Black, they look more elegant. Overall an excellent buy !",
      "rating": 5.0,
      "verified": true,
      "author": "t.",
      "helpful_votes": 5,
      "publication_date": 20181002
    },
    {
      "title": "Breathable and sturdy",
      "text": "I have to wear a mask in certain public situations. I’ve tried many different dust and surgical masks. I am really pleased with the quality of theses masks. The material is breathable and I don’t feel my breath in the mask as I exhale. The fit is perfect and stays in place throughout the day. The material is also sturdy - many masks I’ve tried tend to tear at some point throughout the day. Each mask comes in it’s own individual wrapper. This is a great price for 50 pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "AZ Guy",
      "helpful_votes": 2,
      "publication_date": 20190516
    },
    {
      "title": "Great!!",
      "text": "Very effective for blocking dust, coughs, pollen, and other allergens -- fashionably at that! It also provides the best value and quality compared to others I've used. I could easily breathe through these; although it makes my face a little too oily after wearing one for too long, it is easily fixed by wearing a new one. Each mask is individually wrapped as well, so there's no need to worry about exposure in storage. Definitely would buy again when I run out.",
      "rating": 5.0,
      "verified": true,
      "author": "Jem",
      "helpful_votes": 3,
      "publication_date": 20190227
    },
    {
      "title": "These masks are great, and I get compliments all the time!",
      "text": "These are the absolute best. I get compliments all the time on these face masks. I use them when I'm going around NYC, when I'm sick and need to breathe in warm air, and when it's cold and I don't want the wind to hurt my face. You need this mask!",
      "rating": 5.0,
      "verified": true,
      "author": "adreagayle",
      "helpful_votes": 5,
      "publication_date": 20180112
    },
    {
      "title": "A mask that is comfortable",
      "text": "Before this COVID-19, I had bought these because I clean kennels and the most from the disinfectant gets to my lungs. So, in hindsight I'm glad I purchased these when I did. They are comfortable and seem thicker than the regular cheap ones.",
      "rating": 5.0,
      "verified": true,
      "author": "sigkap",
      "helpful_votes": 2,
      "publication_date": 20200422
    },
    {
      "title": "Perfect for this horrendous flu season",
      "text": "Perfect for this horrendous flu season. If nothing else, it gives me peace of mind when I see other people coughing around me",
      "rating": 5.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 4,
      "publication_date": 20180210
    },
    {
      "title": "Bought it for flu season",
      "text": "Like the look of this mask. They are individually sealed so I can leave them out at my desk at work so anyone concerned about spreading germs during flu season can take one. Not a germaphobe but for some reason people at my work like to work when they are sick and share their germs. I can't afford to be sick. Simple as that. Added plus - I look like a Kpop Idol wearing a black mask! Daebak!",
      "rating": 5.0,
      "verified": true,
      "author": "M. D. Minuth",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Works Great",
      "text": "This is so cute, all the masks come in a tissue like box so when you need one, it's covered in plastic which is great and you pull it out and use it. I tried one on to see if it would fit my face, I have a big face/head, it works great, just like the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 2,
      "publication_date": 20180829
    },
    {
      "title": "Five Stars - Love the stye",
      "text": "I love this mask. I mainly use them when I go to the Casinos (shout out to Pala Casino and Valley View Casino). I don't smoke by I like to play in the smoking section because they usually have better (video poker) machines there. Very stylish I think.....does not look like ones you see used in hospitals or clinical settings. Helps from smelling smoke from the person smoking next to you.",
      "rating": 5.0,
      "verified": true,
      "author": "RioHard91",
      "helpful_votes": 2,
      "publication_date": 20180114
    },
    {
      "title": "Pretty good. My work has an unfortunately high level ...",
      "text": "Pretty good. My work has an unfortunately high level of particulate and mold spores. When I wear this mask I notice my cough and allergies are greatly reduced. Took a while to accustom to the fit as I am a small lady and have a small face, but I now like the fact that the mask can pleat out to fit over the nose and under the chin to achieve a pretty full coverage with little visual distraction when looking down at work. Took some getting used to, but now a staple, highly recommend. Small faces can be fully protected, good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 4,
      "publication_date": 20171104
    },
    {
      "title": "Good temporary protection",
      "text": "As an Uber I get a ton of coughing and hacking people in my car all the time. Before I got these, I always got sick. Now I haven't been sick in over a year since buying my first pack. If you don't care about getting sick, they can last a very long time before the strap eventually snaps They do get uncomfortable around the ears if u wear them too long but they're strong and good quality. I definitely recommend these if you're getting an Uber or airplane",
      "rating": 5.0,
      "verified": true,
      "author": "B17 Bomber",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Love these mask.",
      "text": "They are seriously amazing. Most mask have a smell to them but these are individually wrapped and very nice quality. Love the black. Made so well!! Thank you ✨",
      "rating": 5.0,
      "verified": true,
      "author": "d",
      "helpful_votes": 2,
      "publication_date": 20190420
    },
    {
      "title": "Works well but could be improved.",
      "text": "I use these when I mow the grass. They fit pretty loosely at the bridge of the nose and give me the feeling that I'm not getting as much protection as I could with a better fit. Could use a little metal strip at the nose bridge to make them fit better.",
      "rating": 4.0,
      "verified": true,
      "author": "Verified/Frequent Buyer",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Cheap, effective, just be ready for everyone to look at you like you're crazy or a terrorist if you wear these on a plane.",
      "text": "I definitely scare people on the plane and at airports WAY more than I used to with these on, but I haven't gotten sick on any flights since I started wearing these. Good stuff! Served their purpose well, and they're so cheap!",
      "rating": 5.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 2,
      "publication_date": 20180508
    },
    {
      "title": "Sleak & Clean",
      "text": "Nice carbon filter mask for working with light air contaminants in the air including flour, sawdust, and non-eco friendly cleaning supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "William Cap",
      "helpful_votes": 5,
      "publication_date": 20170620
    },
    {
      "title": "I would repurchase in a heartbeat",
      "text": "Due to a family member’s compromised immune system, our family has been wearing masks for 3 years. This is a favorite brand of ours. No smell, individual & hygienic outer wrapping, no face stains and breathable. Our only concern is when will it become available again?!",
      "rating": 5.0,
      "verified": true,
      "author": "Joli",
      "helpful_votes": 2,
      "publication_date": 20200504
    },
    {
      "title": "Don’t waste your money😡🤬",
      "text": "Junk but they look cool but do not work so don’t buy",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Jones",
      "helpful_votes": 2,
      "publication_date": 20190509
    },
    {
      "title": "If you want black surgical mask, these are the ones",
      "text": "Very nice presentation, fits very good. Only problem is the comfortability around the ears. I work in the medical field and need to wear masks for long periods of time, around 30 minutes to an hour the elastic ear wraps almost cut the circulation off of my ear. It’s not a sharp pain but it’s a noticeably irritating feeling. But if you’re wearing these in short burst, definitely recommend 👍",
      "rating": 4.0,
      "verified": true,
      "author": "danny",
      "helpful_votes": 2,
      "publication_date": 20190520
    },
    {
      "title": "Very Effective Mask",
      "text": "I ordered these because I have a very low immune system, and these are really effective with the carbon layer. It takes getting used to wearing a protective mask in public, but no one even seemed to notice.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan G.",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Good Masks",
      "text": "I ordered these masks because I have allergies and like to garden. Used the mask yesterday while gardening and it protected me from getting the usual allergy symptoms. It was comfortable to wear and did a good job of filtering out the pollen, I highly recommend this mask.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita M Ben-Or",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Saved me!",
      "text": "I was able to wear this throughout the process of a keratin treatment at my salon. They tend to bother me due to my asthma. I was perfectly fine thanks to these masks! Definitely buying again.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Modern looking masks with comfort",
      "text": "I bought these masks and tried them on to do some work around the house and they are perfect. Easy to breath than the ones given in hospitals or the regular blue ones you see. You won't see the dirt getting on your face because it's black. Overall very comfortable and has no scent.",
      "rating": 5.0,
      "verified": true,
      "author": "FELIX TORRES",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Great mask!",
      "text": "I like these mask. Much better than the other ones I had ordered on Amazon. They don’t fog up my glasses like the other ones if you wear it right. I would definitely buy them again. 👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Cute and durable",
      "text": "People keep asking me where I got these. They're also way more durable compared to the masks I get from my cancer center. You can wear them for a while without getting that annoying thing where the mask starts to get sucked into your mouth when you try to breathe. They also look very cute and go well with most clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "Teela Wyman",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Buy before catastrophe",
      "text": "These are fantastic! Oddly enough, I bought them in January because I was planning a trip to China. Who could have imagined my trip would soon be canceled and there would be a global shortage of masks two months later. My timing was spot on for once in my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Bown",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Good quality, individually sealed, adjustable.",
      "text": "Works perfectly for when i'm cleaning the house especially cleaning my cat's litter box. High quality and each mask is individually sealed. As there are horizontal folds along the mask, it can be adjusted to fit your face. Would buy again. I paid full price for this and was not paid to write a review.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "pretty good, but...",
      "text": "I think it could fit around the neck and jaw just a little better. Overall it did the trick and pretty well. I'm sure it's not what they are intended for, but i used them during the last California wildfires. The air was gross. I ended up giving most away and will probably pick some more up to store.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Pretty good protection from smells, cold and flu.",
      "text": "Reasonably priced. Four layers and activated carbon means very good filtering. Although mask is not intended to be reused, I found no problem with a few uses if you are not in a very dusty environment for long time. A bonus- saves lips from drying out in cold weather. Very lightweight but obviously, it does attract attention if worn in public places.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayant",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Top notch face masks",
      "text": "Perfect masks, I tried the cotton reusable ones and found I couldn’t breathe. These masks allow me to breathe while also filtering the air. I get asthma attacks around cigarettes and these prevent that from happening.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Julian",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Make ear loops stronger and a thicker metal at nose part",
      "text": "This product is good I’m not happy because those ear holders they ripped as soon as you open to put on your face you cannot even use as soon you touch they separate from the masks I think they did on purpose so costumers buy more is a good product but earl oops not good and the nose clip is not strong enough to sealing the nose part air gets in by the nose space 🥴",
      "rating": 1.0,
      "verified": true,
      "author": "Chuyyy",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Glad I bought in 2019",
      "text": "Bought these some time in 2019, came to be very useful all of 2020. People always ask where I found these \"stylish\" black masks. 5/5 didn't catch Corona so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Z Gallagher",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "My new masks",
      "text": "I have used other surgical masks and I could not breath. With your mask I can breath while raking leaves that creates a lot of dust. I also like the ear loops.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluemax190",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Hospital approved!",
      "text": "LOVE that these are individually wrapped. They also definitely have an extra layer that make it more breathable somehow but DON’T let as much offending smells in. Trust me, when you deal with patients in isolation with gastric issues you WANT that. Even our hospital Infection control nurse gave me the green light on these. You do have to replace them after a couple of hours (they get damp if you talk a lot) but otherwise I will definitely buy again since I wear them EVERYDAY.",
      "rating": 5.0,
      "verified": true,
      "author": "Nourished Nat",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "The face masks are great and they arrived when expected",
      "text": "The face masks are great and they arrived when expected. I was pleasantly surprised to see that they are individually packaged; I was not aware prior to delivery. They give great protection. It's allergy season and it's time for spring cleaning. I would definitely order more when necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "JRB",
      "helpful_votes": 9,
      "publication_date": 20170511
    },
    {
      "title": "Convenient",
      "text": "I love these face masks. Perfect size for my face. I love the individual wrap, which makes it more convenient to carry. We use them whenever someone is sick in our house. We also take them with us when we take flights.",
      "rating": 5.0,
      "verified": true,
      "author": "GreenTea",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "I love these",
      "text": "I just ordered these and used them twice and they keep cigarette and perfume chemicals from getting to my lungs. As soon as I put then on it was like night and day. I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Smith",
      "helpful_votes": 2,
      "publication_date": 20190529
    },
    {
      "title": "Life saver",
      "text": "I’m really glad I bought these in 2019, using this during pandemic and of course allergies which was the original reason I bought them.",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Poor design/scam/junk",
      "text": "Very poorly designed. Nosepiece is so flimsy as to be ineffective, allowing free air/breath bypass in both directions, making the filter material useless. Ear loops are of very thin/fragile elastic, and tear free with any but the very slightest pressure, thus the masks can not be tightened sufficiently to be effective. I give this product one star only because Amazon does not list a \"junk\" rating.",
      "rating": 1.0,
      "verified": true,
      "author": "Gary R. Kuehn",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Works great",
      "text": "This mask work great and look very stylish. Highly recommended to protect yourself. But be aware, it's not for virus protection but good for bad air.",
      "rating": 5.0,
      "verified": true,
      "author": "2momo",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Quality",
      "text": "Wifes is an RN, I am an exterminator, these are worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "StormMaster",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Comfortable to wear.",
      "text": "We only sneezed once while cleaning out the heating vents! We laughed! We looked like characters from our Kdramas! The masks hooked around the ears comfortably and we could squeeze pinch at bridge of nose for a snug fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Doesn’t fit well",
      "text": "It doesn’t cover from my boat to chin like other face mask does. I’m a registered nurse so I wear mask often and these do not fit like multiple other brands do.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Carter",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Super comfortable and adjustable",
      "text": "Exactly as pictured and individually wrapped. Super comfortable and doesn't make your face hot- also fits really well and is adjustable around nose area- going to order more and told friends about it.",
      "rating": 5.0,
      "verified": true,
      "author": "L.H.",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Excellent choice",
      "text": "I was pleasantly surprised to find these individually wrapped! Although it will take a while for me to go through a box of 50 this will absolutely be a repeat purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel White",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Fits a variety of faces.",
      "text": "These are a great value for the price. They hold up well. They are a bit more robust than your average hospital mask. The way they are accordioned, you can keep it small for a pointy-face person, or expand it for those with huge fleshy-type faces.",
      "rating": 4.0,
      "verified": true,
      "author": "Dashing",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Great mask if you don't mind waiting months while it ships from China",
      "text": "Great mask if you don't mind waiting months while it ships from China",
      "rating": 3.0,
      "verified": true,
      "author": "OnTheMountain",
      "helpful_votes": 3,
      "publication_date": 20171007
    },
    {
      "title": "Cool looking and allergy/dust masks",
      "text": "Im a big dude and these masks fit me perfectly. They are easy to breathe in and look cool in the process (ala mortal kombat)",
      "rating": 5.0,
      "verified": true,
      "author": "Santiago bermudez",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great mask",
      "text": "Bought these in 2019 for domestic use for dust etc. So glad I had them as now I am using to go in public as masks are required and they are very hard to get plus the prices have tripled since. Comfortable, light weight, great quality and passes the candle test",
      "rating": 5.0,
      "verified": true,
      "author": "Ria Ramdial",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "not as shown in picture. weird odor.",
      "text": "not as show in picture, in the picture they are individually packaged, but they came in a one bag. also has a weird smell, similar to old paper mixed with someone i cant quite make out. looks cool, but im not so sure if i feel comfortable wearing it for germ/dust (as advertised)",
      "rating": 3.0,
      "verified": true,
      "author": "BeeMo",
      "helpful_votes": 3,
      "publication_date": 20180327
    },
    {
      "title": "You will get strange looks in public...",
      "text": "This product is absolutely necessary for cold and flu season. If you are immunocompromised or just a decent human being who doesn’t want to get other people sick, you need this. I think because it’s black it weirds people out, but I think it looks cool, like an anime character in a post-apocalyptic..NVM, just buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "comeoutpunching",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Okay",
      "text": "This gaps a little at sides; maybe due to me being small frame??? I wished it were a little snug.",
      "rating": 4.0,
      "verified": true,
      "author": "JanT.",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "great for outdoor allergies",
      "text": "I have really bad allergies, rag weed, cedar and mold. i love doing work in the garden and this mask is allow me to do work outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "ppca",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Face doesn’t get hot",
      "text": "I was actually quite surprised by these. My face didn’t feel sweaty or hot at all. It was a big difference from the other ones I was using. I think they’re great!",
      "rating": 5.0,
      "verified": true,
      "author": "PrimeQueenT",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "It did help not at all for my mold allergy.",
      "text": "Not good for me . I have severe outdoor mold allergy. I kept coughing and it was not effective. Then I tried 3M -9210 N95 face mask and it was great!!",
      "rating": 1.0,
      "verified": true,
      "author": "Samuel R. Williams",
      "helpful_votes": 8,
      "publication_date": 20180126
    },
    {
      "title": "UNACCEPTABLE",
      "text": "THE ELASTIC STRAPS WOULD BREAK 6/10 TIMES. THESE WERE ON PETITE WOMEN",
      "rating": 2.0,
      "verified": true,
      "author": "Garry Parsons",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "Comfortable... works as advertised.",
      "text": "Works as advertised. I use them while doing yard work and cooking. Very comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Ike",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great preventative",
      "text": "Used to avoid breathing in dust while mowing. Did not obstruct my breathing while working.",
      "rating": 5.0,
      "verified": true,
      "author": "oolang",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Five Stars",
      "text": "These are perfect. I use them for eyelash extensions. It helps keep the glue fumes away from me",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 2,
      "publication_date": 20170623
    },
    {
      "title": "Great face masks for cleaning",
      "text": "All face masks are annoying in that they obstruct your face. But that's the point. These masks I use to clean my Airbnb, and they work wonders. Previously, I would sneeze and sniffle throughout the entire cleaning process from all the dust. With one of these one, I sneezed just twice, very few sniffles. Night and day!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Chella ready",
      "text": "These are my go to for Coachella and long air travel",
      "rating": 5.0,
      "verified": true,
      "author": "Royce Jakob",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great for travel",
      "text": "These came in handy for traveling on a long flight. I used them from Atlanta to Qatar and then from Qatar to Singapore. I def recommend them. Keeps the germs away, yet still breathable.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Good mask for COVID",
      "text": "I bought these in 2019 because of recent wildfires in the area. The air quality was terrible and I wanted to be prepared for the next fire season. Now I use these to follow COVID mask mandates and I'm glad I had these on hand. They are light weight and cooler than cloth mask. The activated carbon really freshens the air.",
      "rating": 5.0,
      "verified": true,
      "author": "Francis  M Quitazol",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "False Advertising",
      "text": "What I got from them today wasn't even close to what they advertising here. It is blue three layer mask not black 4 layer mask. It is not individually wrapped either. The quality is bad. Don't buy this mask.",
      "rating": 1.0,
      "verified": true,
      "author": "JTB65",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Nail tech musta",
      "text": "This mask are thick and durable for the price you get quality and quantity",
      "rating": 5.0,
      "verified": true,
      "author": "Natassja martinez ",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Individually wrapped masks",
      "text": "I bought it for them being individually wrapped. A little thicker than store bought dust masks b/c of the carbon layer making it black. Similar fit and finish to regular dust masks. 50 pieces is a good deal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "All my coworkers ask where I got them!!",
      "text": "These are perfect for work. And easier to breathe in....and let's not forget they are antibacterial with charcoal in it !!",
      "rating": 5.0,
      "verified": true,
      "author": "Trece",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "No metal nose strip",
      "text": "They're black like I wanted but don't have that metal strip for the nose contour which makes it a little more loose than it already is. Just a basic mask. Ear loops are fine and comfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Great product",
      "text": "These masks keeps dust out better than any other ones I ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Storey",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Small",
      "text": "These masks are individually packed, but they are on the small side.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Rountree",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "I hope they start selling these again",
      "text": "i really liked these. they were comfortable and i could still breathe no problem. I would buy more if they sold again. very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "karahmm",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Recommend!",
      "text": "Good masks! They don’t get super hot like some and I feel are a good value for your money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Comfortable with black",
      "text": "Comfortable with black and the fit. . Glad I bought. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Wiser-now",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Good quality, Good value face mask",
      "text": "The face mask is well made, comfortable and works as advertised. They were delivered on time and packaged individually in the manufacturer’s box.",
      "rating": 5.0,
      "verified": true,
      "author": "Badger",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Good price, works good as well",
      "text": "Works good, better than those N 95 filter masks, but couple of this mask is defective... Right out from the package.",
      "rating": 4.0,
      "verified": true,
      "author": "Can Ye",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Perfect in every way",
      "text": "These are individually wrapped, very comfortable, and you can position them so that they don't fog up glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia W.",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Nice fit",
      "text": "These fit very comfortably around the ears. There is a small wire across the nose that can be molded for a perfect fit. I wear these to mow the lawn and they are not hot or uncomfortable. I forget I'm wearing one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Perfect fit.",
      "text": "Got these for airplane travel great product and being black they have that hospital look when you are in public. Best deal for the $",
      "rating": 5.0,
      "verified": true,
      "author": "My",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Protective and comfortable",
      "text": "It even helps with strong odors . I’ve been using it for work and it works great",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Yoder",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Approved",
      "text": "They work well with decent material for the cost i would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Steven L",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Very Nice.",
      "text": "It was fairly cheap in price to be good but when I got them, to my surprise it was very durable. I gave two to each of my family members and they all enjoy them. It fits nicely and looks so minimalistic it's good for anyone to where for any reason.",
      "rating": 5.0,
      "verified": true,
      "author": "David H. ",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Love the individual wrapped mask.",
      "text": "Bought this to prevent pollen allergy. The individual packaging makes carrying extras very sanitary. Will buy and recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Moni",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "No good against virus or bacteria!",
      "text": "This is not a qualified surgical mask. I cut open the mask and found that the filter layer is not a non-woven fabric. This will not provide any protection against common virus (especially the Wuhan kind) or bacteria. I went back and found the box, made in China, no wonder!",
      "rating": 1.0,
      "verified": true,
      "author": "L. Ming",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Awesome Masks!",
      "text": "I am very pleased with the quality and durability of these face masks! They are very efficient at filtering the floating dust particles and overall I am happy with the purchase of this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "value for money, i liked them individually warped",
      "text": "i use them to prevent dust, flu, and other allergents. they are individually warped. nice product and good value,will buy again",
      "rating": 4.0,
      "verified": true,
      "author": "icyicybaby",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Flu masks with class",
      "text": "So far the product is as described. We will have to wait out the flu season to know for sure",
      "rating": 4.0,
      "verified": true,
      "author": "Ryly",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Good for the price",
      "text": "They were very useful while visiting China. Helped filter poor air quality and secondhand smoke.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Tapscott",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Individual packaging",
      "text": "Very happy with this product. Love that they are individually packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Honesty",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "These are great!",
      "text": "I use these at work as I use a blower indoors and it kicks up a lot of dust. I also work with cleaning chemicals and these help with exposure.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Krieger",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Nice product",
      "text": "Verdict is out. Kinda cheap but they may be as good as others.",
      "rating": 3.0,
      "verified": true,
      "author": "Johnny V Music",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Four Stars",
      "text": "They dont fit quite as well as the KC blue ones but the charcoal filtering is a plus",
      "rating": 4.0,
      "verified": true,
      "author": "DG",
      "helpful_votes": 2,
      "publication_date": 20170922
    },
    {
      "title": "great purchase",
      "text": "best mask EVER. I can't wait for them to become available again.",
      "rating": 5.0,
      "verified": true,
      "author": "talkerlonger",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "quality may come into question. After all it is made in China.",
      "text": "I start to question quality of a product when the box isn’t spell checked for errors. You might want to change “acticated” to “activated”.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "As an allergy sufferer they work great for mowing.",
      "text": "I suffer from terrible allergies and asthma and i wear these when I mow and i'm not near as miserable as i was not wearing any PPE. I also recommend a shower soon as you finish mowing to get all the pollen and debris off yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180924
    }
  ],
  "product_meta": {
    "title": "Yamde 50 Pcs Disposable Earloop Face Masks Dust Protection Four Layer Activated Carbon Filter Face Masks",
    "description": "Yamde 50 Pcs Disposable Earloop Face Masks Germ Dust Protection Four Layer Activated Carbon Filter Face Masks",
    "rating": 4.5,
    "feature_bullets": [
      "High filtration barrier dust : Gentle on skin, breathability.",
      "Superior four layer material (3 ply non woven fabric + 1 ply activated carbon)",
      "Disposable Four Layer Activated Carbon Filter Face Masks,Filters out dust.",
      "Fits adults & children",
      "Elastic ear loops easily fit on & stay"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.9 x 4.6 x 4 inches; 9.59 Ounces",
      "Date First Available": "January 23, 2017",
      "Manufacturer": "Yamde",
      "ASIN": "B01N9UOKHR",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health & Household",
      "Health, Household & Baby Care",
      "Medical Supplies & Equipment"
    ],
    "price": ""
  }
}