{
  "website_summaries": [
    {
      "verdict": "A secure solo rack that's easy to install on the top of your car.",
      "pros": [
        "Lightweight",
        "Quick and easy to install on crossbars",
        "Automatically adjusts to bike for secure fit",
        "Bike remains firmly in place during travel",
        "Easy to remove and store"
      ],
      "cons": [
        "Need crossbars to use",
        "Only holds one bike at a time",
        "For 2 bikes, you'll need to install 2 systems on top of your car"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love it but will not fit 2014 BMW F31 OEM rack via T-track system",
      "text": "This is a great roof rack but it DOES NOT FIT THE OEM BMW roof rack via the t-track for a 2014 F31. BMW roof racks require a 24x30mm T-track adapter. Thule does sell the adapter (Thule 889-1) but it is not sold in the USA. (Not sure why). You can purchase the 889-1 adapter on amazon.uk but it will cost about $22 at current exchange rates.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Mark",
      "helpful_votes": 5,
      "publication_date": 20171202
    },
    {
      "title": "Wont fit 2019 Subaru Impreza factory crossbars",
      "text": "So I went to the Thule website and fitted my car with a bike rack. The Thule Pro Ride Rack was one of 3 recommended racks that were supposed to fit my factory crossbars. Upon trying to mount the rack I quickly discovered that my crossbars are too wide for the mounting brackets. I have contacted Thule and they are working on a solution. Short of altering the brackets or finding larger ones this rack will not work. The rack appears to be well built and sturdy enough but I wish they would be more accurate as far as the fit goes. My crossbars are about 2 3/4 wide.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon M Bacon",
      "helpful_votes": 4,
      "publication_date": 20190307
    },
    {
      "title": "Great Bike Rack from Thule",
      "text": "Rack arrived on time and no shipping damage. Rack is great! easy to setup and use. Rack arm is a breeze to switch sides. I take them off after use to avoid sun damage, and they are easy to take on and off. Locking mechanism works really well. Many of the parts on it are replaceable should you ever need to replace something. The only drawback of this type of rack is where it holds the bike frame, on some mountain bikes there is very little room under a water bottle cage for the arm to clamp on. So you do have to be aware of that when buying. It was a tight squeeze with my son's MTB.",
      "rating": 5.0,
      "verified": true,
      "author": "DavidDoesReviews",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Easy to install",
      "text": "Easy to install, manual was confusing just like every other THULE product, but easy to figure out. Thule needs to get a better designer for their USA market instruction manual.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170615
    },
    {
      "title": "Keep your muddy mountain bike outta my car!!!",
      "text": "Excellent Bike Rack, I liked it so much I bought another. One was delivered missing a small piece. I contacted Thule and they replaced it free of charge. Excellent product and awesome customer service. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Strong and sturdy rack!",
      "text": "This is a great bike rack. Fits a variety of bikes since I’ve had it. Drive cross country with a bike on the roof with no problems. The rack is so strong that when you accidentally drive into a building your bike doesn’t break! The rack holds it so strong it takes the brunt of the force and damage. Don’t do what I did and drive into a garage bough to test this out!",
      "rating": 5.0,
      "verified": true,
      "author": "Crimson Cool",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Got a semi-used unit",
      "text": "The box showed on my porch was really busted up and one end was sticking out. The actual unit looked pretty used but certainly functional. One of the end caps was missing which does bother me. A little disappointing but it does hold the bike up. Unfortunately I have a trip this weekend so don't have time to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Bobby",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Packaging",
      "text": "Package was badly damaged with large holes. I'm not sure yet if any of the parts are missing.",
      "rating": 3.0,
      "verified": true,
      "author": "Andre Brown",
      "helpful_votes": 2,
      "publication_date": 20180902
    },
    {
      "title": "Stable",
      "text": "Does what it needs to do without having to take your bike tire off and locks in nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey R.",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Excellent bike rack.",
      "text": "Great product...easy to install and use. My bikes are secure attached and locked when I leave the car parked and unattended.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel R.",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Watch out",
      "text": "Rubber piece that goes on the wheel flew off in the wind",
      "rating": 4.0,
      "verified": true,
      "author": "jose terronez",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Great bike rack",
      "text": "Great bike rack. It only takes a few minutes to install and seconds to remove. Holds bike very securely too.",
      "rating": 5.0,
      "verified": true,
      "author": "MXracer",
      "helpful_votes": 2,
      "publication_date": 20170603
    },
    {
      "title": "Love these",
      "text": "I have three of these on my station wagon and they perform flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "KeithD",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "WARNING: only fits narrow cross bars. Not a good rack.",
      "text": "I thought I'd warn potential buyers (I bought this outside of Amazon, and unfortunately I couldn't return it). This rack only fits crossbars up to 2 3/4\" wide. My Mazda's 3\" crossbars are too wide. It also won't work on an Acura MDX's cross bars. The mounting kit does not have any expansion options. I emailed Thule to see if they sold adapters, but no luck. For a rack that costs $200 you would think the system could adapt to standard cross bars on Japanese SUVs. This is a badly designed mounting system.",
      "rating": 4.0,
      "verified": false,
      "author": "Rom",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "A perfect fit",
      "text": "Easy to set up with my current Thule bike rack. I have a Trek multirack 7300 with 24 inch tires and to locks it with no wobbling. There is no fuss when removing the bike also. I cannot assure you that the Proride will fit anything other than a Thule. I would recommend calling the manufacturer and looking at specs to make sure this would fit on other brand and models. What I can say is that using it with my current Thule bike rack was awesome and would highly recommend it based on quality and price it is well worth it in the long run",
      "rating": 5.0,
      "verified": false,
      "author": "nitsa",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "A great bike rack, feels solid and stable",
      "text": "I've never had issues with Thule gear and this Proride bike carrier is no exception. Everything feels solid and secure when put together. How to put it together - well that's another story. Skip the instructions, they're pretty worthless, and go straight to You Tube. There are quite a few assembly videos out there, they make much more sense than the weird pictionary instructions included by Thule.",
      "rating": 5.0,
      "verified": false,
      "author": "Storm the Penguin",
      "helpful_votes": 2,
      "publication_date": 20170706
    },
    {
      "title": "Works great on 2017 Subaru Outback",
      "text": "Works great on my 2017 Subaru outback. As one of the reviewer commented, it is possible to put this on a 2017 Subaru outback using factory crossbars. I bought two from another retailer. You can put two up with no problems you could probably even fit a third if you wanted to.",
      "rating": 4.0,
      "verified": false,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20180405
    },
    {
      "title": "Thule quality rack as usual",
      "text": "Thule alwyas produces quality products. I also have a Thule hitch rack and love it. When you order this you need to be aware that you need the rail system to accept this. This particular rack does not come with it, but if you already have it for a box or other utility carriers this one with fit right in.",
      "rating": 5.0,
      "verified": false,
      "author": "JA Wolf",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Great rack for Thule owners",
      "text": "High quality rack that fits my existing Thule bars perfectly. Easy set up and holds bike without a lot of rattling or noise. Has made it a one woman job to take my bike anywhere I want.",
      "rating": 5.0,
      "verified": false,
      "author": "Holly Lewis",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "Customer Service agent with Thule was non responsive and completely ...",
      "text": "Customer Service agent with Thule was non responsive and completely unhelpful. Thule has no problem being rude to a customer with a defective product. Thule won't send me the part or work with me, instead having me do all the leg work likely hoping that I will simply go away. Thule does not do customer service right.",
      "rating": 1.0,
      "verified": false,
      "author": "James C Shelby",
      "helpful_votes": 3,
      "publication_date": 20180511
    }
  ],
  "product_meta": {
    "title": "Thule Pro Ride Bike Rack",
    "description": "FEATURES of the Thule ProRide Upright Bike Carrier Automatically positions your bike when you secure it, thanks to the uniquely designed frame holder and wheel tray Quick and easy bike securing ? the torque limiter dial controls the force going into the bike frame with a clear sign of correct mounting Pressure is spread via large, soft claw pads that adapt to your bike's frame tubes - minimizing the risk of frame damage Safe mounting - your bike is prevented from falling thanks to the claw's extended lower jaw Stable wheels - firmly fixed in smartly designed wheel holders with diagonal quick-release wheel straps Easy, tool-free interface for switching carrier from one side of your car to the other Maximum bike weight up to 20 kg T-track adapters (20x20mm) are included for mounting on Thule WingBar Edge, Thule WingBar, Thule SlideBar, and Thule AeroBar Fulfills the City Crash norm",
    "rating": 4.2,
    "feature_bullets": [
      "Automatically positions your bike when you secure it, thanks to the uniquely designed frame holder and wheel tray.",
      "Quick and easy bike securing – the torque limiter dial controls the force going into the bike frame with a clear sign of correct mounting.",
      "Pressure is spread via large, soft claw pads that adapt to your bike’s frame tubes – minimizing the risk of frame damage.",
      "Safe mounting – your bike is prevented from falling thanks to the claw’s extended lower jaw.",
      "Mounts on Thule AeroBlade Edge, Thule AeroBlade, Thule SquareBar and round bars",
      "Available Accessory: Thule Carbon Frame Adapter, 984101 (sold separately)"
    ],
    "specifications": {
      "Department": "Unisex",
      "Date First Available": "March 15, 2017",
      "Manufacturer": "Thule",
      "ASIN": "B06XNS7GX1",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Cargo Racks",
      "Outdoor Recreation",
      "Bike Racks & Bags",
      "Sports & Outdoors",
      "Cycling"
    ],
    "price": ""
  }
}