{
  "website_summaries": [
    {
      "verdict": "A durable, heavy-duty bottle opener that runs longer than most.",
      "pros": [
        "Superior rechargeable battery is capable of opening a whopping 180 bottles per charge",
        "Fast and highly efficient",
        "Easy-to-use convenience in an ultra durable design",
        "Foil cutter doubles as a base for streamlined storage"
      ],
      "cons": [
        "Design is somewhat lacking in elegance",
        "Solid corkscrew shell hinders visibility"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love this product",
      "text": "I love this product. It works exactly as described! If you are a wine lover or you are like me and you love things that are unified. This is a great product, it would also make a great present for anyone who loves wine. Especially the 5 year warranty makes it much more reliable than other products.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby",
      "helpful_votes": 4,
      "publication_date": 20170529
    },
    {
      "title": "It is good too! No it was good for only six weeks and 30 bottles!!",
      "text": "Very high quality. So much so that I looked for other Famili products and bought a kitchen scale. It is good too!! Started out great!! But after nine weeks and 45 bottles it quit. Will pull cork out about and inch and then quits. I have checked that the battery is charged but doesn't seem to make any difference. Foil cutter continues to work fine. Nice design but life of 45 bottles is a bummer. Don't buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "So easy to use!",
      "text": "This is an absolutely great product! It works just as expected and has a great design. For years we had one of those big bulky wine bottle openers sitting on our counter until it failed mechanically and we had to replace it. We wanted something smaller since we recently down-sized from a large home to a condo. My Amazon search brought me to this little jewel, and we couldn't be happier with it. Having the foil cutter built into the base is genius because now I always know where it is!",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Pierce",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Great buy!",
      "text": "I bought this as a gift to my brother after a family member told us about one they had. It seemed neat but I was seeing it a bit pricey in stores. I jumped at the chance to buy this one and a year later it's still working great! That family member has visited since then and liked the features on this one over the store bought $30 one. Even asked for a link to it. It's easy to use and looks nice sitting out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Great value",
      "text": "We went through so many openers. This one works better than the others and less expensive. Plus the 5 year warranty is a major plus. All the others failed in a very short while. Just had to throw them away.",
      "rating": 5.0,
      "verified": true,
      "author": "Butler ",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "I do like it and it is effective",
      "text": "I do like it and it is effective. I wish it came with better instructions, though. It took a few times to figure it out. But once that was sorted, there have been no issues! I use mine weekly and have had it since August 2017.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "It stylishly gets the job done!",
      "text": "This is a new kind of wine opener for us. Always used a rabbit or a gas energized opener. This is new but we like it so far. It looks nice on the counter to!",
      "rating": 5.0,
      "verified": true,
      "author": "SaltLife",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "It looks good and works well",
      "text": "It looks good and works well. But beyond that, a few days after having received this item, I received an email from the customer service department inquiring about my satisfaction with the item; explaining proper use, and reinterating their one year warranty policy. Now, that is good service.",
      "rating": 5.0,
      "verified": true,
      "author": "MICHELLE  PHAM",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "GREAT WINE BOTTLE OPENER",
      "text": "This item was given as a gift. I have one very similar to this as my friend uses it regularly when we hang out. Based on this and her reaction when she opened it, I would have to say SHE LOVED IT!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MaryBeth P.",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Didn’t Last...",
      "text": "Opener looks very nice, operated easily and was very quiet. However, it stopped working after a dozen uses, tops. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "AnHnP",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Awesome",
      "text": "I am not a big wine drinker but it is embarrassing when you get a bottle out and cannot open. I no longer have that problem-although you MUST read the instructions or you will look like an idiot getting it open.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey G",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "My two units were junk.",
      "text": "The first one I bought lasted for only three bottles, then just stopped working. The replacement lasted only two, after which it started taking only the top third of the cork out whilst destroying what was left. Really....I don't get how all these great reviews came about. But my units...both of them...pretty much are junk, only worse since they destroy those corks and make them difficult to remove what's left.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Power",
      "text": "So far so good. Like it better than my last one. Powerful and can store in drawer, rather than constantly in plugged in charger. Pulls out corks with ease and ditto on release.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Ease of use and very stylish.",
      "text": "I bought this as a gift. They love it! Easy to use. I especially love that the base is also the foil cutter. Great idea. So far, no complaints. Love the design also",
      "rating": 5.0,
      "verified": true,
      "author": "Cheri A. Smith",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Works well",
      "text": "I bought this for my dad and he loves it. Will probably buy myself one as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "open the bottle now!",
      "text": "The unit charged quickly so I could open that emergency bottle of wine....after a particularly stressful day! It is small and doesn't clutter up my counter top - would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Kelly",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Great wine opener!",
      "text": "This product was easy to order and delivery was quick. It works great! It sits in its own stand which also doubles as the foil cutter. So far it seems to hold a charge very well. It works exactly as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "TRossi",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Five Stars",
      "text": "Thank you for my order it works great and so easy to use thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Joyann Evans",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "This product worked great ONCE. Disappointed that the only thing it does ...",
      "text": "This product worked great ONCE. Disappointed that the only thing it does is break the cork so it's almost impossible to remove. Foil cutter works well but overall this one was a miss for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Cindy C",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Five Stars",
      "text": "Very nice, compact wine bottle opener. Easy to charge, easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony T. Pizzo",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Five Stars",
      "text": "I love this! Slim, portable and works great! I will be buying more for gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie A. Anderson",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Famili Cordless wine opener",
      "text": "Really good wine opener. Customer service is exceptional. They have checked in multiple times to see if all is good. 5 year warranty is exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Three Stars",
      "text": "Purchase went fine but product is not what was expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Worst product",
      "text": "It’s the worst wine bottle opener I’ve had. It keeps breaking the cork and ruins my wine every time. I thought he first couple of times it was the wine but I have come to notice that it’s the opener, it’s defected and if I could return it, I would.",
      "rating": 1.0,
      "verified": true,
      "author": "Nictav",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Three Stars",
      "text": "Loved it while it lasted. Cork got stuck in it after couple months and it broke.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "One Star",
      "text": "Worked fine at first and now it tears up corks after 4 months. Terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Mimi Manners",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "but it works perfect! The foil cutter is so smooth",
      "text": "I have only had it a week, but it works perfect! The foil cutter is so smooth. And the wine opener is a breeze to use! No more struggling with corks.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Iin seems to work just fine.",
      "text": "Seems a little slow, but everything else seems great. Haven't opened enough bottles to know battery durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Excellent Product That is Easy to Use",
      "text": "The Famili FM700BR rechargeable cordless electric wine bottle opener is easy to use, has a long battery life, and is attractively styled. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "James M. Nelson",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "We will recommend it to our friends & family",
      "text": "I haven't used it yet however, your video is what sold me & my husband. After receiving it and looking the product over then testing the buttons....we have becone future customers as well. Your product is well made & very affordable. We will recommend it to our friends & family.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela H.",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Great wine bottle opener",
      "text": "Just used it last night! Very happy with this purchase. It worked very well and we really like the built in foil cutter.",
      "rating": 5.0,
      "verified": true,
      "author": "Love Reading",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Didn’t last!",
      "text": "We bought this two months ago and it has already stopped working. I do not see where the manufacturer will exchange.",
      "rating": 1.0,
      "verified": true,
      "author": "L. S. Hogan",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Defective item...company replaced",
      "text": "Didn't work. Tried with 2 different bottles. Based on other reviews, maybe mine was defective. Unable to release stuck cork. Edited to add: 1 star rating changed. The company replaced the item and the new one works well. For some reason the button direction to press for opening or releasing the cork feels like they should be the other way around, but that could just be me. The replacement was very easy and fast. Good customer service.",
      "rating": 3.0,
      "verified": true,
      "author": "MarylandLady",
      "helpful_votes": 2,
      "publication_date": 20170909
    },
    {
      "title": "The battery power does not last long at all",
      "text": "The battery lasted less than 1 year - I used it about 6 times and I won’t open a bottle of wine at all now",
      "rating": 1.0,
      "verified": true,
      "author": "KSmooth",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "I love it. I’ve always had trouble taking the foil ...",
      "text": "I love it. I’ve always had trouble taking the foil off the bottles and it’s so easy with my electric bottle opener. Gave it a 5.",
      "rating": 5.0,
      "verified": true,
      "author": "alicia blazejewski, AB",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "I purchased the wine bottle opener as a gift, ...",
      "text": "I purchased the wine bottle opener as a gift, so I am not in a position to render a review. If the recipient is dissatisfied I will let you know.",
      "rating": 5.0,
      "verified": true,
      "author": "Elvira Sorrentino",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "fast and easy is preferred",
      "text": "Loving this bottle opener! Used to work in a restaurant with a classic corkscrew. Makes the experienceence memorable, but at home, fast and easy is preferred!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan N",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Love that you have the seal opener in the base ...",
      "text": "Tried your wine opener and it operates as stated. Love that you have the seal opener in the base which makes is easily accessible. Hate to look for such when entertaining. Unit was quiet and efficient.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen T. Smith",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Love it",
      "text": "It works great, it's super fast, and pretty to look at, customer service is great, only time will tell how it holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Camila S.",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Two Stars",
      "text": "Consistently rips corks....hard to determine if you are inserting at the right angle.",
      "rating": 2.0,
      "verified": true,
      "author": "Chistopher J. Fuller",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "The corkscrew goes down the side of the cork; total disaster each time",
      "text": "I really wanted to like this. The design is nice. It looked nice on the counter. But every time I used it, I would carefully position the corkscrew right in the center of the cork, and each time, the thing would veer over to the side of the cork and wouldn't go down all the way. I had to get out my ordinary wine bottle opener to try and get the damaged cork out. I kept trying it, but to no avail. Such a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "An observer",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Easiest Opener Ever!!!",
      "text": "I've bought several kinds of openers over the years but with arthritic hands they've all become more difficult to use. This one is a breeze! So easy to use without any physical effort. I charged it when I received it and haven't charged it since; I've probably opened close to 50 bottles so far on this charge. I totally love this opener and wouldn't use any other kind!",
      "rating": 5.0,
      "verified": true,
      "author": "L D McCoy",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "EXCELLENT!",
      "text": "I love this! No more struggling, trying to open a bottle of wine. It works quickly and smoothly in a matter of seconds. I would highly recommend this opener to anyone who has a sore wrist, Carpal Tunnel Syndrome, or arthritic hands. Thank you so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Bordeau",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Very nice opener. We have used it once & it ...",
      "text": "Very nice opener. We have used it once & it really works as advertised. The opener not only works great, it looks great (very contemporary) looks good on the counter. I like it so much, i am getting one for my sister-in-law. Hope this lasts for a long time. Great purchase. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann B.",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Not worth it",
      "text": "I bought 2 of these last year, they both worked well but one of them broke after the first charging session, which is a quite a long period it didn't need charginging for about 4 months, the whole charge chip popped out. Worked well but ended up in the trash, disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Too weak to uncork bottle properly.",
      "text": "Has no torque, no strength, can hardly uncork one bottle... battery dies halfway through the first bottle. With \"help\" it can uncork a second one.",
      "rating": 1.0,
      "verified": true,
      "author": "Maria E. P.",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "No more sore arms and hands!",
      "text": "This is something I wish i bought years ago! This inexpensive device saves the headache of manually removing corks! And it is super simple to operate.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Great wine opener👍",
      "text": "So far the wine opener has been working great. Power connector goes into the body of the wine opener (instead of the base as most others have) and it's a little hard to find the mini connector port but other than that, this is a great product and with the new battery technology, I'm hoping it will last longer than the 12-18 months of other openers.",
      "rating": 5.0,
      "verified": true,
      "author": "David Troisi",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Wine Opener - Electric",
      "text": "I have only opened 2 bottles, but love the way it functions. Will not know about battery life or durability, but love it now",
      "rating": 5.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Love the product!",
      "text": "This is product is great! I was having trouble at the beginning and now a little better in opening the wine bottle. I think once I master it, then it will get easier opening the bottle! I love the product!",
      "rating": 5.0,
      "verified": true,
      "author": "Mag",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Easy to use!",
      "text": "So easy to use. I thought I'd treat myself since I am the one who opens the wine bottles. This is a dream to use. Looks nice too on the counter.",
      "rating": 5.0,
      "verified": true,
      "author": "Christah",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Its good, buy it.",
      "text": "Had the original rabbit and it died. This is certainly an upgrade, looks good on the counter, does what its suppose to do.",
      "rating": 5.0,
      "verified": true,
      "author": "ZenReader",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Better than me trying to hold, turn, and pull without wasting it.",
      "text": "Better than me trying to hold, turn, and pull without wasting it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "I have only used it twice so far, it ...",
      "text": "I have only used it twice so far, it exceeds my expectations for ease of use and takes up no room. Buy!",
      "rating": 5.0,
      "verified": true,
      "author": "mariecm",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Famili FM700Br electric wine bottle opener",
      "text": "This is the best wine bottle opener that I have ever used. No comparison anywhere. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "eajbets",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Good product.",
      "text": "More powerful than any other I tried. Keep charge for a long time. Good product.",
      "rating": 5.0,
      "verified": true,
      "author": "VIA101",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "worked for two bottles!",
      "text": "Loved it for first two times. After that it would not work. Seems it will not take a charge.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "so good. Worked like a charm",
      "text": "Have only used this once but so far, so good. Worked like a charm! I am hopeful the battery will live up to expectations because that is why I had to replace my old opener (different brand)",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Erdbacher",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Better than less expensive options",
      "text": "We have had numerous wine openers (rechargeable), and this is by far the best we've had. The base is a foil cutter which is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse's Gurl",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Great product",
      "text": "Small footprint on my countertop. Like the foil cutter base. Easy to operate.",
      "rating": 5.0,
      "verified": true,
      "author": "Hathaway",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Great wine opener",
      "text": "It works fine and we received it quickly and without damage.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Great product!",
      "text": "Replaced my old Houdini opener with this one. This one is much better. Faster, quieter, better battery life, just better in every way. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Love it!",
      "text": "I've only used it about three times so far, but it's by far the easiest wine opener I've ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwen",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "One Star",
      "text": "Very disappointed, not worth the money ! I'm unable to remove the cork from the bottle!",
      "rating": 1.0,
      "verified": true,
      "author": "Celia",
      "helpful_votes": 0,
      "publication_date": 20180620
    }
  ],
  "product_meta": {
    "title": "Famili FM700BR Rechargeable Cordless Electric Wine Bottle Opener with Foil Cutter, Opens up to 180 bottles with one charge, Black",
    "rating": 4.1,
    "feature_bullets": [
      "Conveniently Fast. Automatic Wine Bottle Opener removes the cork in seconds, ideal for opening multiple bottles at once for your guests",
      "Efficient. Built-in first-of-its-kind Tesla Type rechargeable lithium battery, opens up to 180 bottles on a single charge. Painlessly simple push-button operation. Includes foil cutter as well!",
      "Safe. The corkscrew is placed in the inner structure of the device, and will not protrude out the bottom of the wine opener during operation. Don’t need to worry about the dangers of an exposed corkscrew",
      "Elegant and Durable design. Manual corkscrews don’t look nearly as beautiful as an automatic wine opener which matches almost any kitchen décor nor are they considered durable!",
      "Effortless. No more looking strained and frustrated in front of your guests when fumbling with a corkscrew or worse, a knife, a shoe, or a coat hanger. Simply use our device and get back to enjoying your evening in seconds."
    ],
    "specifications": {
      "Package Dimensions": "13.86 x 4.25 x 3.7 inches",
      "Item Weight": "1.37 pounds",
      "Manufacturer": "Famili",
      "ASIN": "B06VVKWVTJ",
      "Item model number": "IC700",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.1 out of 5 stars114 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#238,250 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 15, 2017"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Specialty Appliances",
      "Electric Wine Bottle Openers",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}