{
  "website_summaries": [
    {
      "verdict": "Despite a few quality issues, it's a good choice for consumers who are looking for a backpack that looks both professional and rugged.",
      "pros": [
        "Sports a handsome design with canvas exterior and leather accents",
        "Main interior pocket fits laptops up to 15 inches",
        "Complements most business attire"
      ],
      "cons": [
        "Quality of the hardware isn't comparable to the bag's materials – buttons have been reported to fall off and zippers to stick or break"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A smart-looking backpack that functions well for both school and work.",
      "pros": [
        "Fits 15-inch laptop",
        "Carries books, laptops and water bottles in an organized fashion",
        "Reviewers especially like the leather and canvas touches that set this backpack apart from others"
      ],
      "cons": [
        "A padded laptop sleeve would enhance the backpack's comfort"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great looking bag just not durable",
      "text": "Great looking bag. According to product detail able to carry textbooks/laptop. Read the reviews quite a few said \"don't buy it\"!!! Hardware falling off and backpack not durable. Just loved the bag so much I ordered anyway. Because of the reviews I found myself babying the bag. After one week of use a few paperback manuals in the bag the hardware popped off right side. Because I was very careful when pulling buckles apart this wouldn't happen. Emailed the company and so far no response. Would I buy it again? No, probably not.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 56,
      "publication_date": 20170817
    },
    {
      "title": "Turned out to be a lemon.",
      "text": "Had to come back and update my review - a week after I posted this everything started to fall apart on this bag. In less than 2 months this bag was completely useless. The zippers all broke, the metal buttons popped off, the buckles broke...I am so deeply disappoint. The 1st week I had this bag I love this purchase - It looked nice, was more professional than a regular back-pack with plenty of space my large laptop and other things. I am so sorry it fell apart so quickly. The quality just couldn't hold up, unfortunately. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Randa K",
      "helpful_votes": 11,
      "publication_date": 20171231
    },
    {
      "title": "Almost perfect, but one nuisance.",
      "text": "I had been looking for a backpack like this for a while and am glad I stumbled on this one. The design and features are great and it looks and feels like a bag that costs significantly more. My only qualm with the bag is that the material between where the shoulder straps mount buckles and creates a point that pokes at your back. Not an issue if you are wearing a jacket, but definitely a nuisance when not.",
      "rating": 4.0,
      "verified": true,
      "author": "Edwin",
      "helpful_votes": 9,
      "publication_date": 20170628
    },
    {
      "title": "This is a backpack you can have a long-term relationship with",
      "text": "The leather aged very nicely! Most of the scratch marks faded with time and became this darker shade of leather (which I love). I've had this bad boy for about 3months now. Unfortunately you can see where the zipper came undone. Positive side is the zippers are super smooth. They never get caught or stuck anywhere. One zipper came undone because the stitching on that side became loose. Best way to deal with this is to either sew another of stitching yourself or take it to a tailor. Otherwise the canvas fabric is very durable and can withstand some light rain without soaking through.",
      "rating": 4.0,
      "verified": true,
      "author": "LYL",
      "helpful_votes": 7,
      "publication_date": 20171006
    },
    {
      "title": "I love the bag",
      "text": "I love the bag. I love the color. i love the quality! the reason why it didnt get 5 stars is due to the markings that are on the leather right out of the bag. I wish it was so carefully packaged that maximum 3 scratch marks are there because like me, others use markings on the bag to remind them of adventures, moments or places they have been. Mine has a lot of scratch marks already sadly but i still recommend as not many people buy the bag for such purpose. however I love it just the same. :D",
      "rating": 4.0,
      "verified": true,
      "author": "Dwayne",
      "helpful_votes": 6,
      "publication_date": 20170606
    },
    {
      "title": "Most definitely worth buying!!",
      "text": "I bought this amazing backpack a few months back, after an extensive search for exactly what I wanted. This backpack definitely has everything I need and then some. It's bigger than I expected, and it's incredibly sturdy and just plain awesome!! Whenever I have it with me, I get lots of compliments and people asking me where I purchased it. This backpack is HIGHLY RECOMMENDED!!!! So glad I made this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "T.L.T.",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Company is good, but they're still improving the bag",
      "text": "When I got this bag, I was very excited about the look, and it seemed like a quality bag. The zipper has begun to fall apart. Otherwise, the bag seems fairly sturdy. I would recommend just being careful with the zipper. UPDATE: The company sent me another bag, so hopefully this one will last longer. They seem to be committed to customer service and continuously improving their products.",
      "rating": 3.0,
      "verified": true,
      "author": "HS1234",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Textured leather? Yes!",
      "text": "I love all the design choices they made with this bag. Definitely a beautifully crafted item. I am a web developer and use this to work in various locations. It fits my 15.6\" inch screen perfectly! I saw some other reviews critiquing the back of the leather for being rough and yes, it is a roughened texture. However I do not think this is a flaw, to me, this is a part of the overall charm of the bag. It's made to look old, but modern. Rustic, but practical. I believe that the textured side of the leather is a beautiful design choice and adds to my appreciation of just how beautiful this bag is.",
      "rating": 5.0,
      "verified": true,
      "author": "Melany",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Outstanding Quality, Design and Materials.",
      "text": "I received my backpack today and was extremely pleased with the style, quality and size. The leather is soft and the canvas is thick and durable. The backpack fits my a laptop and files for work comfortably with extra room. There is a hidden zipper on the front pocket which was a nice surprise as it will keep its contents secure. The backpack is a little heavy before adding anything in it. I highly recommend this backpack. The quality exceeds the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Harvest Crush",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "If you like the look, go for it.",
      "text": "Really nice. The fabric and the stiches well done. God space inside de backpack. The straps are confortable. Leve the security pocket in the back.",
      "rating": 5.0,
      "verified": true,
      "author": "Milena Quesada",
      "helpful_votes": 11,
      "publication_date": 20170723
    },
    {
      "title": "Trendy, functional and sure to bring compliments.",
      "text": "This bag fits my 15.6\" laptop quite well. I didn't find any structural flaws in the product's assembly as it is quite durable. It's also plenty padded to ensure your laptop stays protected. I was surprised the bag's leather was actually real. It's beautifully accented. My only criticism is the difficulty in releasing the straps that go around the shoulder. It can be a struggle. It's also a bit heavy/bulky. That just may be my own stupidity though. Overall a trendy and functional accessory you're sure to get complemented on.",
      "rating": 4.0,
      "verified": true,
      "author": "Herby Beam",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "VERY cool but",
      "text": "VERY cool. But it was TOO SMALL for my daughter's 15.6 HP Envy. You could cram it in there but the corners would be in danger. The supposed \"padding\" is pretty non-existent. This would be fine if you had a little 13.3 with a foam sleeve. Some people make a big deal about whether or not a laptop bag can stand up. So for the record, no this one is thin and floppy. It's SO beautiful I didn't want to return it but found something more practical and safe for the laptop.",
      "rating": 3.0,
      "verified": true,
      "author": "reviewer",
      "helpful_votes": 2,
      "publication_date": 20170822
    },
    {
      "title": "nice",
      "text": "I really like this. I bought it so I could store papers and flimsy folders in there without them crinkling and it does the job mostly, However I did buy it expecting the back of it to be more stiff.. Its not as stiff as I was hoping but its still wonderful and looks nice. Looks just like the photo. The leather is really nice looking too. Like a matte suede.",
      "rating": 4.0,
      "verified": true,
      "author": "Danaya Khartchenko",
      "helpful_votes": 2,
      "publication_date": 20171001
    },
    {
      "title": "Comfortable, sturdy, fashionable",
      "text": "Very comfortable and very spacious. It's a bit limited on pockets but it looks great. It's got a space for up to a 15 inch laptop. I wear it to university and got lots of compliments 10/10. Although the pockets on the sides are barely big enough for plastic water bottles. I'm not sure what the thought process there was. I used those pockets for my MacBook Pro charger instead so it works out anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 2,
      "publication_date": 20180424
    },
    {
      "title": "Nice, sturdy backpack for the fashion conscious",
      "text": "I bought this for my fiance who wanted a classy but functional and roomy backpack. She loves it and I was surprised at the build quality. It's a very sturdy backpack and it is holding up very well after about 4 months of use. My fiance also gets a lot of compliments on the bag, so it certainly seems stylish haha. It's a good backpack for those who are fashion conscious. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Ambriz",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Beautiful and sturdy bag",
      "text": "I’m giving this four stars to start with because the top leather came scratched up and a little dirty. I really needed a bag though and i don’t wanna send it back because The scratches don’t bother me too much but it still shouldn’t be sent like that. However, I will say it’s a beautiful bag. For the price, it’s super sturdy and the leather feels really nice and the bag itself isn’t cheap looking and doesn’t feel cheap. It’s got a lot of great compartments and holds all my books and my computer perfectly! I’m happy with the bag. The side pockets fit my water bottle and a coffee mug. Think it’s gonna last me a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine Alzate",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Love the bag but disappointed in the design/quality",
      "text": "As a mature student who has returned back to school, I was looking for something unique to carry my books in. I've received a lot of complements on this bag. Unfortunately, one of the rivets on the top tab feel off recently. Since, I've only had this backpack since late August. I am disappointed and concerned how long this backpack will last. If the other rivet falls off, I won't be able to snap the bag closed on that side. Hopefully, I will be able to figure out how to fix it.",
      "rating": 4.0,
      "verified": true,
      "author": "SKeays",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Functional and Stylish",
      "text": "I was searching for a leather backpack that would accommodate both my DSLR camera and laptop as well as any accessories I needed to carry with me for traveling and this pack was exactly what I was searching for. The canvas is thick enough to not wear through and the leather flaps and buckle straps are soft, supple, and genuine leather. The bag came in a nice protective draw-string bag and was presentable all around. I am pleased enough to purchase this bag and other from this company again.",
      "rating": 5.0,
      "verified": true,
      "author": "GoGetHer",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Well built bag, especially for the price",
      "text": "This is a very nicely constructed bag. The canvas is sturdy, but not stiff and the leather looks and feels nice. All of the straps and clasps seem well-made and fit together nicely. In short, this backpack is exactly what I wanted, a way to tote all my stuff to/from work, but also providing a way to take my 15.6\" HP Spectre x360 with me, without needing a separate laptop bag.",
      "rating": 5.0,
      "verified": true,
      "author": "David C. Robine",
      "helpful_votes": 2,
      "publication_date": 20170825
    },
    {
      "title": "Overall great. Beautiful design",
      "text": "It does seem to be good quality and the design is great. It is made in China which sucks, I'd rather be supporting domestic jobs in the US. The bottle side pockets are also a bit small, you wouldn't be able to fit a standard blender bottle in there and an aluminum water bottle just barely fits. Everything else is amazing, I've had it for nearly two months at college and it's serving me well. The zipper doesn't mess up and the material is holding well.",
      "rating": 4.0,
      "verified": true,
      "author": "Everette M.",
      "helpful_votes": 2,
      "publication_date": 20171012
    },
    {
      "title": "Give it a try",
      "text": "A general all-purpose mid-average bag. I returned the same day because of the zipper handle design. One tug on finger strap and the metal grommet was lost, leaving the zipper with only metal portion.",
      "rating": 3.0,
      "verified": true,
      "author": "Sage",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "not well made",
      "text": "The backpack is absolutely gorgeous (with lovely real leather), but it's not well made. The second time I used it, one of the shoulder straps came apart. I got maybe 5 hours of use with light loads out of it before it broke. I've had about 2 months now, and it's just outside of any return window.",
      "rating": 2.0,
      "verified": true,
      "author": "fireflystars",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Love it! I needed a backpack to tote books ...",
      "text": "Love it! I needed a backpack to tote books back and forth to a professional work environment, and this one works great while still looking stylish and not too \"young\". The canvas is thicker than I was expecting, and the zippers and straps seems super sturdy. The side pockets are too small for a water bottle, however they work great as a phone slot.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Thomas",
      "helpful_votes": 2,
      "publication_date": 20180105
    },
    {
      "title": "Very nice backpak",
      "text": "I am using this backpack as my purse. It’s roomy, sturdy, and looks nice. I was carrying a traditional backpack but wanted something more dressy for work and business casual attire. This bag fits the bill. I can carry everything I need along with my 15” MacBook Pro laptop. And the lake blue canvas material actually dresses the bag up, adds some color, and accents nicely with the leather flap and trim. Quality bag. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda S Nuernberg",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Nice bag but...",
      "text": "I just opened my bag and was happy with the way it looks, and the size. However, the inside strap that is supposed to hold your laptop in place had not been stitched correctly and is falling off, so I just used a seam ripper to remove it the rest of the way off. Not that's it's a big deal, but for over $50 for a bag I would have hoped the quality would have been a little better, or that the company would have looked at it before shipping it. Doesn't matter I'm still going to use it.",
      "rating": 3.0,
      "verified": true,
      "author": "K.R.",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Love this backpack!",
      "text": "Great looking backpack and excellent quality. Everything was just as shown on the Amazon listing. This backpack was packaged beautifully upon arrival. It was carefully protected in multiple layers with attractive labeling and even a thank you note. I felt like I had purchased an item from a high end specialty store. I can tell that Vaschy takes pride in their products. Can't wait to use the bag at The Grand Canyon this weekend! I know it will provide years of service.",
      "rating": 5.0,
      "verified": true,
      "author": "Wheelin' Willy",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Perfect bag for my needs.",
      "text": "I do a lot of traveling for my job and even when I am in the office, I do not have my own desk. I need to live out of my bag. This backpack is perfect. It is design pleasing, well made, and has just enough space - not too much, just enough. While it was not advertised as \"anti-theft\" I do appreciate how there are both flaps and zippers to get into either pocket areas. Just enough trouble to make a wood-be pick pocket find a softer target.",
      "rating": 5.0,
      "verified": true,
      "author": "DRH",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "I wish I ordered it a lot sooner.",
      "text": "This arrived wrapped as a gift specifically for me although I didn't order it as a gift. Very well made. Its a perfect unisex bag. Thanks for the extra pouch bag and grocery bag that it comes in. I can put those extra bags in one of the side pockets when I visit BJ's. My laptop fits perfect in the bag along with my other stuff. And it doesn't feel like I'm carrying an overload. I plan on buying this again as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Nice design, but a button came off",
      "text": "I love the backpack and its design, but after about a month of use one of the four buttons attached to top flap came off. I can't put back the button :( #Edit: I originally gave 2 stars, but I re-adjust to 4.5 stars since the customer service was nice enough to send me buttons to fix the bag. The backpack is really functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Nicely crafted, solidly built, beautifully looking backpack for work",
      "text": "It is a beautifully crafted backpack. It has a nice rustic feel to it, and fits very well. The bag easily fits a 15” MacBook Pro and extras. The pockets are well placed inside so easily store the basics of wallet, cards etc. The leather does get a worn look pretty easily, but I think it adds character to the bag. The directions inside also tell you how to remove them and prevent them. The buckles do have magnetic pop off buttons - which I didn’t realize.",
      "rating": 5.0,
      "verified": true,
      "author": "Vamitra",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Awesome Rugged Backpack!",
      "text": "This is the best backpack I've ever owned! I'm a guy teacher, a rare breed indeed, and when my old backpack died, I wanted someone that looked adult and professional but also rugged. This was exactly what I was looking for. It's lightweight yet very well built and comfortable to wear. The leather is top notch quality and I get compliments on it all the time. It has plenty of pockets for everything I need but not too many. I'm glad I'll have this backpack for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good quality!!",
      "text": "I was a little skeptical about the bag because of the reasonable price! When I received the bag it was in a box, which opened up to a fancy cloth cover which contained the bag. Pulled out the back pack and I was impressed with the quality, stitching is neat and feels very durable and well made. Looking for more items from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Sal G",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "She loved it! But \"loved\"",
      "text": "I bought this backpack for my daughter, and I'd have to say we would've given a 5-star for it. It's stylish and well-functioned. She loved it! But \"loved\", past-tense is the keyword. It's March 2018 right now, barely a year from the purchase date and one of the slings has already torn-off its stitchings / metal fasteners. Of course, I don't mind buying another one of yours, but it's rather regrettable that something so well designed was not also so well produced.",
      "rating": 3.0,
      "verified": true,
      "author": "antonius lin",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Great product!",
      "text": "This is an AMAZING bag for the price. I use it daily and it has held up so well. I get so many compliments on it. I plan on buying some of the other matching stuff. The pictures and descriptions are completely accurate. My photo is with it stuffed and having been used everyday for over 6 months. I’m thrilled with this purchase. It came quickly too.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Great for Work",
      "text": "I got this bag as a present for my dad to use for his laptop. He has been using it everyday for at least a year! He even brought it as a carry on when we took an airplane for a family trip. This bag is very stylish and feels like it is made from high-quality materials. It is honestly one of the best gifts that I have ever given someone because it is so useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Genny",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Rugged old school backpack",
      "text": "I’ve only been using this bag for a few days. For me it could use one or two more zippered pockets. But I like it Looks great. I ride motorcycles and will take it on long trips to save room in the saddle bag. Word of caution. This bag s not water proof",
      "rating": 5.0,
      "verified": true,
      "author": "splattttttt",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Excellent Product and Pristine Service!",
      "text": "I cannot say enough about this beautiful product. I purchased a bag in January 2018 to carry my laptop and other papers to campus and have received so many compliments on its beauty -- from colleagues in Europe to strangers in public venues. Also, the service is stellar. I recently had a small problem (broken zipper) and wrote to Vaschy about a replacement, receiving the most courteous, prompt and amazing response. Within a week, I had received my replacement, with kind correspondence from the Customer service staff throughout the process. And, the new bag is pristine and beautiful! I recommend this product and buying all products from this company!",
      "rating": 5.0,
      "verified": true,
      "author": "Joyful One",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "My all times favorite bag. ⭐️⭐️⭐️⭐️⭐️",
      "text": "This is my all time favorite bag. I use it daily for work and always get people asking where I got it. It not only looks amazing, it holds it shape perfectly, its very well made and provides awesome protection and accessibility to my laptop, iPad, documents and all my accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "Haneylive",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "I love it!",
      "text": "I received the product within 24 hours of ordering it, arrived in a cloth bag (and the bag inside an Amazon box) very well packaged and in perfect condition. It's very comfortable and seems to have a very good quality. I saw the pictures online, on my phone, and generally was what I was looking for, but when I received it, it actually looked better than the pictures! Arrived: on time Support: Haven't needed it Condition: perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Javier",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "BEST work and school bag ever",
      "text": "I'm so happy with this bag! Quality is exceptional. Shipping was fast and on time. The bag came I. High quality simple packaging with a beautiful thank you note. The material is high end and durable. The Leather flap is flexible and soft, very washy to open and close. The arm pads are thick and padded so it's very comfortable. My 15 and 1/2 inch laptop fits nicely I. The sleeve with plenty of room for books and my charger. I love the interior and exterior pockets for storing my water bottle and wallet! excellent price and value!",
      "rating": 5.0,
      "verified": true,
      "author": "S.S.R",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Good Buy - Fits 14\" long laptop.",
      "text": "I'm really happy with this backpack. It fits my 14\" long laptop (length, not diagonal screen size), although it stretches the velcro tab holder quite a bit, so I would say this is the pretty much the max laptop length you could get away with. The leather is nice, the canvas is durable, and it looks good too, I have received many compliments on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Best bag!!",
      "text": "I am extremely impressed with the quality of this backpack. It's even nicer than I expected! It's a decent size (true to its picture), which is good - can handle a laptop and pretty much anything else you want to carry. The best part is that, even packed, it's a very comfortable fit - the weight is well balanced and the shoulder straps are padded nicely. As far as appearance - the soft, slightly worn leather and canvas together are a perfect combination. It looks like a bag that would cost way more than it did. I would highly recommend this backpack to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon MacDonald",
      "helpful_votes": 2,
      "publication_date": 20171030
    },
    {
      "title": "I love this backpack.",
      "text": "I absolutely love this backpack and get compliments where ever I go. Working at a tech company, having a great backpack is practically required. This is classic but modern. The leather is thick and the bag is sturdy. I've had it a couple of months and could not be happier. I also took it with me on a trip to Paris, where it managed to look chic and not like I was a tourist. Sturdy, beautiful bag. Who could ask for anything more?",
      "rating": 5.0,
      "verified": true,
      "author": "@juliannajanayoung",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "Narrow but great quality",
      "text": "This is made very well. Just a little long, deep and narrow, but works well. Great quality. I think it will last “forever”. Just wish it was roomier inside. Deep for a laptop and thin for a lap top and not thicker stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonin",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Zipper won't last",
      "text": "I love the look and feel of this backpack but am very disappointed that the zipper didn't last. I purchase in Mar 2019. I really only use this to transport my lunch and other light weight misc. items to and from work. I would've expected this to last me for many many years like some of my previous back pack. Sadly disappointed in the longevity of this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Toni Ann Garcia",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Fashionable and sturdy",
      "text": "So far so good. I wish it was waxed to be waterproof and a few threads on the shoulder straps were loose. Other than that I love it. It fits everything I carry to work. I get lots of complements. Very cool.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy O",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Even better than expected",
      "text": "Wow, even better than expected. I’ve packed this full of stuff and it’s still comfortable to wear. I have my laptop, iPad, camera, sketchbook, etc. all fits perfectly. Very good quality materials.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Smith",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Great for daily carrying, not so much for frequent opening/closing",
      "text": "The backpack works well for daily carrying of items. Not that great for traveling if you're prone to having to open your bag often. This is due to the flap, which takes a little finesse to undo just to get to your stuff. Sometimes it takes a few tries to get the magnetic buttons to align before they clip into place. Mine lasted for about a year before I had to use the warranty to get a free replacement. The zipper had lost its ability to hold and would require some force to finally zip. After repeated attempts, the zipper finally gave and tore.",
      "rating": 5.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "The same quality as my Audi A8L",
      "text": "Never have I purchased a backpack or carry bag of this quality. I could name many bag makers. However. It will not be fair to do so when they can not complete with this bag. Blow the @@@@ away.",
      "rating": 5.0,
      "verified": true,
      "author": "James Emmert Hunt",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Vintage, Cute & Durable",
      "text": "I LOVE this bag. Super durable, and I tend to always shove too much stuff in my backpacks. I love the design and smell of the leather. The only thing that would make this perfect is more pocket space. Otherwise, a great bag. I have gotten lots of compliments.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney Lautner",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "When they say they send their products with care, they mean it!",
      "text": "I was amazed by every inch of this backpack! Okay so the material is great I love the way you open it (unbottoning the 2 buttons) and this isn’t one of those backpack that are super tiny and barely fit your school binders or folders... this bag leaves you with plenty of room in the main opening. If your looking for this style of bag, I’d tell you to stop searching when you get to this one... I wanted to do a pros and cons, but I honestly don’t know what I’d put in the cons. Their way of even packaging this bag was so cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "My absolute favorite backpack! It was packaged really well",
      "text": "My absolute favorite backpack! It was packaged really well! It looks great, but more importantly, it’s great quality makes this backpack durable. I use it daily and love it! I highly recommend this backpack to not just students, but also to busy parents, like myself. Can be used for many things... Daily use, travel, school, etc. Thanks for making such a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Compliments and Very Well Constructed",
      "text": "I have received so many compliments on this bag!! Not the largest, but so convienant with the three outside pockets and inside pockets. Leather is nice, but it will need to be waterproofed. I think it's a little on the heavy side, but I think for how strongly made it is, it's worth it. Also the somewhat hidden zipper on the back top of the backpack is perfect for keeping my wallet in there safe and accessible when I take of the backpack! I'm tempted to buy another color for how cheap this is for the quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Ariellah",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Looks and feels professional.",
      "text": "Bought this for my brother's 33rd birthday for him to take to work. He really loved it because it looks good, looks professional and can fit everything. Perfect for a laptop, water or coffee bottle and personal items. Keeps things nice and organized.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Iskandarian",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Odd design",
      "text": "This is a nice looking backpack but does not stand up well as the cloth material is very flimsy. Makes for hard to pack and unpack. Bigger issues is there is a zippered pocket on the back which means the bulky zipper digs into my back with every step. Very uncomfortable and seems like a poor design choice.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Nice Proessional Backpack",
      "text": "I ordered this backpack to use for work in lieu of a traditional shoulder bag or an old school attaché case. The feel of the leather is smooth, the canvas feels durable and the pockets inside are perfect. The test of time will be the final judge for durability, nevertheless, we're off to an excellent start.",
      "rating": 5.0,
      "verified": true,
      "author": "Reginald Randles",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "This is an all-around excellent bag. I've been carrying it for over a ...",
      "text": "This is an all-around excellent bag. I've been carrying it for over a month now and I get compliments on it nearly every day. It's held up well with daily use for university classes and various trips- really good quality backpack and sturdily made. It is also very roomy. I can fit several books, my MacBook and anything else that I might normally carry in a purse with room to spare. I would definitely recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "clo",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Target Demographic?",
      "text": "I just did a search for a leather backpack and found this at a fair price. Materials seem to be quality and while I've only had it a few days, it has not fallen apart on me yet! That being said, I think I maybe would have looked into it a little further? It seems the packaging and such that it came in is directed primarily towards females. But why should that be a problem if it works and looks otherwise so gender neutral right? A+ Would buy again (hope I won't have to)!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Great looking back but zipper doesn't hold up.",
      "text": "Updating my review: Their customer service team was really helpful and resolved the issue. I got my replacement bag and everything looks good. Thank you! I've had this bag for less than 2 months. The bag looks great, received lots of compliments, holds what I need such as a 15\" MacBook Pro. The only problem (so far) was the stitching that holds the ends of the zipper came loose and now I'm struggling to get it back together. Was bummed as I was really excited about the bag, now it's frustrating.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean H",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great backpack for professional use.",
      "text": "It’s a great backpack for professional use. It’s very attractive and functional. After about four months with it, a seam ripped and the zipper came out. The manufacturer quickly sent me a replacement nad asked for photos to see how they could improve the design in the future. Great company.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Solitro",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Classy, High Quality, and Stylish",
      "text": "This bag is classy and high quality. The leather is such a nice touch and easy to maintain and clean. There is a medium snap pocket on the front that is perfect for charging cords. The side pockets have no stretch but are nice for storing pens or smaller items. The inside laptop pocket is perfect for a MacBook 13\" and other similar sized computers. I love and am still currently using this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "ArtGirl12",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Durable",
      "text": "I love this bag, Its durable, fashionable and has a lot of pockets to keep me organized. (I just have to remember which pocket I put my stuff in) I use it as travel bag as well as it is a laptop bag. I get a lot of compliments on it.",
      "rating": 5.0,
      "verified": true,
      "author": "TAMMIE HILLIARD",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Looks very rugged, but maybe not the best for carrying a laptop.",
      "text": "Nice rugged looking backpack. My only complaint is that the laptop sleeve section is not padded on the exterior side. If something hits the side normally against your back, there’s no padding, just a single layer of canvas.",
      "rating": 4.0,
      "verified": true,
      "author": "W. Warren",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Great Product",
      "text": "This backpack showed up on time and well protected. There is even an extra bag around the bag in order to protect the Leather pieces. It is a very classy backpack and fits my 15\" laptop perfectly. The side pockets are also slightly stretchy and will accommodate a 16 oz can.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Londen",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Favorite Backpack",
      "text": "Since I have been in high school, I have wanted a canvas backpack. This backpack is the one of my dreams! It has a zipper as well as magnetic straps (which are very strong) and very classy. I am a fashionable person, I buy Valentino, Prada, Dolce and Gabanna; quite honestly I like this bag more than anything I've ever seen or bought from them. I highly recommend this backpack and if you leave a question I will do my best to answer it for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip W",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Sturdy, good value.",
      "text": "Using daily for work. Excellent bag, sturdy construction, good zippers. I oiled the leather to waterproof it a bit more but other than that it’s good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna M.",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Love this backpack!!!",
      "text": "Love this backpack. This is well designed, stylish and durable. My wife loved the retro look, and the packaging was also a plus, as it comes with a plastic gift bag inside. I would highly recommend this to anyone looking for a great vintage backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas K. Giles",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "The bag looks great and is very stylish in looks",
      "text": "The bag looks great and is very stylish in looks. However it was not a comfortable bag to carry. When I first tried the bag I noticed that it was a little tight in my shoulders. So I loosen the straps and loaded it up and it just didn’t fit right and was uncomfortable no matter what I did.",
      "rating": 2.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 2,
      "publication_date": 20170917
    },
    {
      "title": "Broken zippers in one month",
      "text": "I bought this june29thand liked it but today both zippers Broke for no reason-the zipper pull Just fell right off. I didn’t get protection plan because this is the second one I bought and never had a problem Before but just a month in it is completely useless",
      "rating": 1.0,
      "verified": true,
      "author": "Marilyn Augustyn",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Looks real cool when she rides her scooter",
      "text": "Bought this for my fiancée - she loves it. Looks real cool when she rides her scooter. Our bad came without a leather zipper tag for the back pocket - I got in touch with the seller about it and they responded real fast, saying they're going to mail us two replacements at no charge and free shipping. Very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "garreputo",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Stylish but not very comfortable to wear every day",
      "text": "Its a very good product, stylish and the design is exquisit but I think it is not very comfy as I expected. The material and all the shipping and packing details are very well done and make the customer feel valued. I would say.. if you are looking for a confy backpack to wear everyday you might cosider another option. This is perfect for short trips and no everyday use",
      "rating": 5.0,
      "verified": true,
      "author": "Ester ",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Great bag!",
      "text": "I take this bag to work every day. This bag is deceivingly large. It packs more into it than what's apparent. Very sturdy construction and I've already got multiple compliments how good this bag looks. For the price, the aesthetics and sturdy construction cannot be beaten. This bag even survived a 5 day trip to Alaska. Go for it!",
      "rating": 5.0,
      "verified": true,
      "author": "abhishek ravva",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "So far so good.",
      "text": "I’m not used to do reviews but here it goes. I love the style. It’s just wow. Is really a good bag. I use it to work every day. With some clever packing it can hold two laptops and their power cables (I have a Mac and a Dell pc 15”), an Android tablet, a note book and a technical book. Can’t complain so far. I really love the look. Good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Ariel Class",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Broke first time I used it.",
      "text": "I bought this backpack for work. I used it for the first time this week on a business trip. I carried the bag with me on the plane. When I got to the hotel, one of the steel buttons had already fallen off. Not happy!!",
      "rating": 1.0,
      "verified": true,
      "author": "Trisden",
      "helpful_votes": 2,
      "publication_date": 20171026
    },
    {
      "title": "Craftsmanship doesn't hold up",
      "text": "I like many others love the backpack design and style. The problem is the craftsmanship my first one lost the stitching which resulted in losing the zipper. Amazon replaced it and now my second one had the exact problem. Unfortunately I will not purchase a replacement, style is amazing but craftsmanship is a waste.",
      "rating": 3.0,
      "verified": true,
      "author": "MPre",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Love these Vaschy bags!",
      "text": "I bought a whole set of these and I love them. I get compliments on them constantly. They are a bit smaller than I thought they would be but I think it retains its fashion and function this way. I would recommend these bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah Johnson",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Love this backpack",
      "text": "It is super comfortable and a great bag. I was worried the leather top would scratch easily but it still looks great. Has space for a laptop and plenty of other items. It is big enough to use for a weekend trip (for me anyway), but I bring it to work every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "A+ Customer Support",
      "text": "This is a good-looking bag! I often get complements on it. I use this bag for day-to-day computer use along with books, chargers, etc. Easily fits a 15\" macbook pro. The seam split after about a year of use... but no worries the company honored the replacement warranty without stress for me. I don't have any concerns about the durability of the bag. Recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "GREIG POWERS",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Great quality",
      "text": "Very nice bag 💼 my only issue is I’m using as a purse /backpack so no laptop.. but wallets and keys 🔑 it so deep I loose stuff ha!! 😃 other than that fantastic! Very durable",
      "rating": 5.0,
      "verified": true,
      "author": "KD.",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Excellent upgrade to previous backpack",
      "text": "So far, I’ve loved this bag. It is an excellent upgrade over my previous backpack for my job. Classy, durable and unique. It does fit a 15.6 laptop, but it’s snug. So long as you aren’t using this to carry too much (i.e. more than a couple textbooks at a time or a whole bunch of papers), I think you’ll like what you are getting for the value.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Holt",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Awesome",
      "text": "Super premium feel. Boyfriends new daily backpack. He loves the slot for his Macbook and all the extra room as well. Would think this would be from Fossil.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "It’s aqesome!",
      "text": "I love it! It’s very good quality! It’s not super roomy, so I wouldn’t recommend it for travel or anything, but I knew this going in so I’m not at all disappointed! It’s perfect for me since I’m easily able to return home in between classes, I didn’t need it to have a very large capacity. It fits my laptop, my notebooks, and my textbooks just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Affordable and Attractive",
      "text": "Great backpack and affordable. I got it for traveling for business so I can move easily but still look out together. I’ve gotten several compliments.",
      "rating": 5.0,
      "verified": true,
      "author": "S. K. W.",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Super cute definitely unisex",
      "text": "Didn't realize the size but perfect for school that only requires laptops.. not too much room for books however it is very sturdy :)",
      "rating": 5.0,
      "verified": true,
      "author": "alicia",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Great Looking backpack, works well for the price",
      "text": "I really enjoy this backpack, I frequently get compliments on it and people are surprised when I tell them I got it for $50 on amazon. It fits my laptop (15\") plus a few books and other gadgets, I'm not moving around a ton of stuff every day. The only issue is that the bag sits flat on your back, and it may make you sweat a bit. Noticeable on a hot day. Otherwise this would have gotten 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Very nice bag",
      "text": "We love this bag. Have taken it out of town and out of the country. It still looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenski",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "It doesn't look it feel like it was made poorly",
      "text": "Leather scratched and stained right out of the bag. It doesn't look it feel like it was made poorly. It looks like it was handled poorly. Images included for reference.",
      "rating": 2.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 5,
      "publication_date": 20170729
    },
    {
      "title": "Great backpack and great company!",
      "text": "My son did much research and selected this bag. He is extremely pleased with both the look and utility of the bag. It is very durable, fits a lot and looks great! I would most definitely recommend the bag to anyone as well as the company, which has been very helpful in resolving a question unrelated to the backpack itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl Allenson",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Fantastic and Versatile Backpacks!",
      "text": "We have two Vaschy backpacks and we love them both! I use this one for work/daily use and the other to take camping or to the river. Both are great quality backpacks. One of my backpacks had an issue with the zipper, but Vaschy replaced it quickly. These are the only backpacks I'll order online because of the quality, style and customer support!",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Gress",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "A better way to get around",
      "text": "I had been using a true backpack to get back/forth to school (teacher) and this rucksack is so much better! It's less bulky, better designed for carrying items and not cramming them together, or having them 'jostle' about inside and, its much better on my back! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Good communication! High Quality bag",
      "text": "First of all, I would like to thank Vaschy for their fast action in resolving the issue with the first bag that was sent to me. It had a minor nick in one of the leather straps, so I sent photos to Vaschy and they quickly sent a replacement bag. The new bag is perfect, no more nick. The bag really looks classy, materials look very high end, construction seems durable. I highly recommend Vaschy! Would definitely buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "It seems very sturdy and looks super well put together",
      "text": "My sister wanted this to use as a diaper bag. She loves it and recommends it to anyone! It seems very sturdy and looks super well put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Great bag. The leather is nicer then Unexpected",
      "text": "I love this bag. Ive visited leather stores and they asked about this bag. Buy it. Worth the money by far. It does well in the rain.",
      "rating": 5.0,
      "verified": true,
      "author": "Nani M",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "It’s march and my bag already reaped the stitches got ...",
      "text": "It’s march and my bag already reaped the stitches got loose and there is a hole on top, i don’t abuse my stuff so if you are planning to buy this think it twice",
      "rating": 1.0,
      "verified": true,
      "author": "jesus m.",
      "helpful_votes": 2,
      "publication_date": 20180311
    },
    {
      "title": "Great looking. I wish it had leather on the ...",
      "text": "Great looking. I wish it had leather on the bottom to reinforce it and I wish the computer section was padded more. Other than that, it is exactly what I was looking for. The canvas is somewhat thin, so I am hopeful that it holds up. We shall see!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Durable & appealing",
      "text": "I get many compliments. It holds my 17” laptop. It has enough room for my wallet and files. Durable! Has additional pockets for my bottle water, keys, & cell phones....easy assessable pockets for all my extras.",
      "rating": 5.0,
      "verified": true,
      "author": "Nylmartin",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Nearly perfect.",
      "text": "Got it on sale at $45 and was shocked at how nice it was, it's by far the nicest bag I've ever bought. I don't intend to use it for traveling, so I don't mind how heavy it is, but I do wish it had more pockets inside, or at least one with a zipper.",
      "rating": 4.0,
      "verified": true,
      "author": "Just trying to help.",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Stylish & Functional - Go For It!",
      "text": "I got tired to hauling a sling laptop case during my mile walk to work so I was looking for a backpack that was stylish, functional, and professional. This fit the bill perfectly. Very happy with my purchase and would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike R.",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "I love this backpack",
      "text": "I love this backpack, a ton of pockets. I like there are two compartments, one for the laptop and one for whatever else. It's perfect for work. I haven't traveled with it because I throw around my bags and I want to keep it nice.",
      "rating": 5.0,
      "verified": true,
      "author": "HD84",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Great backpack! I love the quality and it works ...",
      "text": "Great backpack! I love the quality and it works for just what I needed. The only caution I would warn, be careful when cutting off the tape from the buckles. There is protective paper taped around the hardware protecting it in shipment. There is a loop holding the end of the steps under the paper that can be cut...",
      "rating": 5.0,
      "verified": true,
      "author": "TR R.",
      "helpful_votes": 0,
      "publication_date": 20170713
    }
  ],
  "product_meta": {
    "title": "Vaschy Vintage Leather Backpack for Men Canvas Rucksack Bookbag Daypack",
    "rating": 4.6,
    "feature_bullets": [
      "100% cotton",
      "Imported",
      "Canvas lining",
      "Zipper closure",
      "1.VINTAGE:Fashionably designed with top quality genuine leather and canvas, this is a casual, simple and generous backpack. It is made of 100% cotton canvas which is soft, breathable, durable and shrink resistant.",
      "2.DURABLE:This leather backpack has an main pocket covered by a leather flap which is concealed with two narrower leather straps for enhanced security and tight packing. It has two interior pockets. It also has padded compartment for a 15 inch laptop. The large main pocket has a heavy duty and smooth zipper.It has two sides pockets for water bottles. It has a leather flap front pocket with magnetic closure.It has a secured zipped pocket at the back.",
      "3.SPACIOUS:Dimension: 34x14x42cm/13.4x5.5x16.5in Laptop compartment :29x5x31cm/11.4x2x12in Adjustable strap : 45-85cm/17.7x33.5in Weights: 1.22kg,Capacity: 0.7cu ft/ 20L",
      "4.EASY TO GO WITH:The laptop backpack is ideal for school, college going students for carrying books, notebooks and it has compartments to store basic necessities such as keys, stationaries,calculator, cellphone, wallets, a 15 inch laptop, cameras, iPods, iPads, tablets etc., which cover most of our life's necessities.",
      "5.IDEAL GIFT:It is perfect backpack for tourism, hiking, short trips, mountaineering, vacations, camping, shopping and so on.It is a perfect gift for Christmas,Thanksgiving Day,Father's Day and so on."
    ],
    "categories": [
      "Computers & Accessories",
      "Backpacks",
      "Clothing, Shoes & Jewelry",
      "Bags, Cases & Sleeves",
      "Electronics",
      "Laptop Accessories"
    ],
    "price": 43.89,
    "specifications": {}
  }
}