{
  "website_summaries": [
    {
      "verdict": "A heavy-duty chopping block for cutting meat, but it's also attractive enough for serving.",
      "pros": [
        "This durable board is naturally resistant to bacteria growth",
        "Very sturdy and durable, designed to prevent movement when cutting",
        "Great for prepping BBQ creations, and easy to clean",
        "Delivered in a gift box by manufacturer, it can be used as a presentation board"
      ],
      "cons": [
        "Heavy",
        "Only comes in one size and would be difficult to store in a small kitchen"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "LOVE IT!",
      "text": "This board is so beautiful I didn't want to cut on top of it. However, after holding off for a couple of days, my significant other stepped in. We've only had it for a short time, so i can't speak long term, but thus far it is seriously preforming beyond our expectations. I will add that weight wise it is heavy. I need both hands in order to pick it up. This isn't a criticism. If anything, it speaks of how solidly put together it is. It will definitely be gracing our holiday table. The significant other particularly likes the grooves for catching juices. For anyone that has cooking aficionados in their lives, this would make an awesome gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Nova M.",
      "helpful_votes": 2,
      "publication_date": 20170623
    },
    {
      "title": "GREAT CUTTING BOARD!",
      "text": "I was skeptical about this, as I've had a lot of bad cutting board experiences in my life. This one, I'm happy to say, exceeded my expectations. It's big enough to handle all our everyday cutting and chopping. I like having one full side to use for veggies, and the other side with liquid channel around the perimeter for meats. This thing has a really nice finish to it, which holds up to daily use. It's heavy, so nice and stable when in use. I recommend this board to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Miller",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "I love this one just as much as the smaller one",
      "text": "I bought this board and the smaller version. I love this one just as much as the smaller one. My husband and I grill a lot, and this has become our go to board for prepping for the BBQ and then serving it. We have also used it to serve a cheese platter and crackers when we've had friends over for dinner. It looks beautiful and very high quality. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mikele Aboitiz",
      "helpful_votes": 3,
      "publication_date": 20170808
    },
    {
      "title": "Beautiful cutting board",
      "text": "Very happy with my purchase. Seems very sturdy, and I love how it looks displayed on my countertop with the two tone stripes. Would also make a nice gift cause it's well made and comes in it's own box as well as a shrink wrap.",
      "rating": 5.0,
      "verified": true,
      "author": "Beaverhausen",
      "helpful_votes": 3,
      "publication_date": 20170617
    },
    {
      "title": "Nice large cutting/slicing surface",
      "text": "I like the large size of the cutting surface and the trough to catch grease and juices as your slicing food.I also like the serving tray side as well",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Guelcher",
      "helpful_votes": 2,
      "publication_date": 20180919
    },
    {
      "title": "I have been looking for a good quality chopping board for some time and I finally ...",
      "text": "I have been looking for a good quality chopping board for some time and I finally found this one that arrived today. I am really happy with it, the quality is there, even the wrapping was perfect. It is very solid so it does not move at all while chopping but also, it looks beautiful on the other side to use it as a serving tray!!! I could not be happier about it!!! GREAT PRODUCT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Client d'Amazon",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "It doesn't get any better than a 2 sided cutting board (specially for pictures) ...",
      "text": "It doesn't get any better than a 2 sided cutting board (specially for pictures) 2 for one deal and nice and heavy duty too! Love at Kooq boards hands down best value for a expert made cutting boards",
      "rating": 5.0,
      "verified": true,
      "author": "Big john",
      "helpful_votes": 3,
      "publication_date": 20171017
    },
    {
      "title": "Great Cutting Board",
      "text": "great size, cleans easy, good quality. ridges on the sides make it easier to move around. what more could you ask for?",
      "rating": 5.0,
      "verified": true,
      "author": "Shoutingtoe",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Great product, highly recommended.",
      "text": "Solid (and heavy) board that is well built and won't warp. So many of them that I have had seem to warp after a short time, this board is thick and easy on a knife edge.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah E",
      "helpful_votes": 3,
      "publication_date": 20170613
    },
    {
      "title": "Perfect gift.",
      "text": "Very sturdy, easy to clean but can be bit heavy for some. I use it every day for chopping and at least a few times a week use as a butcher block. Worth every penny spent.",
      "rating": 5.0,
      "verified": true,
      "author": "ZM",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Excellent product",
      "text": "I love buying good quality cutting boards/blocks that do not cost me a lot of money. They look good for display too. My friends who love to cook appreciate them a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "isabella",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "A great board",
      "text": "A very well made sturdy and heavy chopping board that is beautifully used for cheese she charcutterie displays. I want another.",
      "rating": 5.0,
      "verified": true,
      "author": "Rugz",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Beautiful and well made",
      "text": "Its even prettier in person than on the screen. Tried it out last night for the first time and can already see this is going to hold up really well. Super happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Arellano",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Nice cutting board",
      "text": "This is a great cutting board. It's also pretty to use as a charcuterie tray. Very glad I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Heavy and sturdy!",
      "text": "After doing some research I found this reversible board because I liked the design and the fact that was reversible. Is so heavy and sturdy! I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Sturdy and good looking.",
      "text": "Great product. Heavy and well constructed. I use it a lot and it holds up great. Looks nice sitting on the counter and as a serving platter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "This thing is heavy and heavy-duty!",
      "text": "It's a well-built piece of kit but man is it heavy! A little too heavy but not a deal-breaker. I like the finish on it and it's easy to clean. Would not have minded it being a little larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Bear",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Excellent cutting board",
      "text": "This is a nice large cutting board with a good cutting surface. It catches liquids very well and extremely easy to clean. I conditioned it prior to use and once a month to minimize the visible cuts on it.",
      "rating": 5.0,
      "verified": true,
      "author": "M.G.M.",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Great For Carving Meat Keeping Juice From Spiling Over !",
      "text": "This is great for cutting meat . The Juice from the meat being carved stays on the board and does not spill over .",
      "rating": 5.0,
      "verified": true,
      "author": "sue saidel",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Heirloom quality piece.",
      "text": "Must see it to believe it, order now with confidence, absolutely top notch block/board. Stunningly beautiful, must see/buy.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Curtis",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Chop away",
      "text": "Great cutting board. Yes, heavy, but lays flat, great work space. Very happy with purchase. Need to get some mineral oil now...",
      "rating": 5.0,
      "verified": true,
      "author": "Dark Helmet",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Nice cutting board",
      "text": "Very pleased with cutting board. Tossed all my other ones in the trash. Appears to be well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Tani Haller",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Versatile for cutting and serving.",
      "text": "My son loved it..especially that both sides could be used.",
      "rating": 5.0,
      "verified": true,
      "author": "susan mogan",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Great cutting boards!",
      "text": "I own 3 cutting boards from Kooq and can’t wait to receive this one! You really get the best bang for your buck with these boards! Thanks for making a quality board for a reasonable price!",
      "rating": 5.0,
      "verified": false,
      "author": "Jessica R",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Great board",
      "text": "Great for parties or even just yourself. Awesome look and you will get compliments!",
      "rating": 5.0,
      "verified": false,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Not only is it beautiful, but it is so nice to cut on",
      "text": "Absolutely outstanding cutting board. Not only is it beautiful, but it is so nice to cut on.",
      "rating": 5.0,
      "verified": false,
      "author": "MH",
      "helpful_votes": 0,
      "publication_date": 20171220
    }
  ],
  "product_meta": {
    "title": "The BEST High-End Reversible Cutting Board, Period! The Most SOPHISTICATED Serving and Chopping Block on the market! Cutting Board on one side for cutting and chopping.",
    "rating": 4.9,
    "feature_bullets": [
      "An essential for any chef’s arsenal - REVERSIBLE CUTTING BOARD - No more mess. Simply chop away nice and easy on the solid chopping side. Wipe down the easy-clean surface. Flip it over and present the food ready-to-serve. Beautiful design - This is a cutting board that belongs in your kitchen. In fact, you might find yourself wanting to cook just so you have an excuse to chop and serve!",
      "BEAUTIFULLY PACKED & WRAPPED - It comes in a beautiful gift box that not only protects the chopping block but also gives the packaging a product like this deserves!",
      "SOLID, STURDY SERVING BOARD - The ideal cutting surface that's gentle on your food and knives. The weight and quality will impress you. The handy juice grooves keep everything in this chopping board, so that's one less thing to worry about.",
      "EASY CLEAN SURFACE - Sustainable, approved bamboo is less porous than other natural woods. That means less liquid soaks into the cutting board, keeping it solid, sturdy and hygienic for longer. Easy care - Unlike other boards, The Reversible Bamboo chopping block by Kooq is treated with natural, wood-safe oil that makes this cutting board a dream to care for. When you're finished, just rinse with warm water. (Something stronger after use with meat though, of course).",
      "ANTIBACTERIAL HYGIENE - Bamboo naturally resists bacteria growth, keeping you, your family, and your guests safe and healthy. Handling grooves on the side - Make it easy to move this butcher's block and serve it to guests. Dimensions - 18 X 12 INCHES: The perfect size to fit neatly in your kitchen, to cut almost anything you want, and adequate space to serve plenty for guests."
    ],
    "specifications": {
      "Product Dimensions": "18 x 12 x 2 inches",
      "Item Weight": "9.9 pounds",
      "Manufacturer": "Kooq Shop",
      "ASIN": "B06WVMDZJP",
      "Item model number": "KS3001",
      "Customer Reviews": "4.9 out of 5 stars48 ratings4.9 out of 5 stars",
      "Best Sellers Rank": "#238,162 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 21, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Cutting Boards",
      "Cutlery & Knife Accessories",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}