{
  "website_summaries": [
    {
      "verdict": "A quality choice for when you are spending a long time in the sun and need a little extra protection.",
      "pros": [
        "Coconut oil and acai oil make this product feel and smell like pure beach relaxation",
        "It's fast absorbing and adds a touch of shimmer to the skin"
      ],
      "cons": [
        "This is a reliable tanning oil but isn't as moisturizing as others on the market"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Ugh, no!",
      "text": "Supposed to be a “dry oil” but isn't very moisturizing, dries sticky and the worst part piles/rolls off your skin. Total fail.",
      "rating": 2.0,
      "verified": true,
      "author": "Audra R",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Clean and effective",
      "text": "Love this spray oil, way better than pouring from a bottle!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Upchurch",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Sticky!",
      "text": "This goes on well and dries, but leaves you feeling a bit sticky. Would not re-order.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul M",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Lower chemical residue, sprays evenly & feels light",
      "text": "Sprays on evenly & feels light, minus the undesirable chemicals that most sunscreens. Really hard to find a clean brand with lower SPF in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia D. Austin",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Nice even spray, drys quickly, seems to protect well.",
      "text": "This is mostly a sun screen that I use with my kids when we are at the park (so haven't been in water to test its waterproofness). But it is a good light sun screen that sprays evenly. My kids are 2 and 3. They don't want to hold still for long, they want to play. 15 isn't a real strong spray, but enough for a the length of time I need. The spray drys almost immediately so I am not worried it is being rubbed off. There is a light coconut scent to it, which is pleasant but not overpowering.",
      "rating": 4.0,
      "verified": false,
      "author": "Adam Shields",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "The scent is very nice, protection OK as long as you're not outdoors long",
      "text": "I love the scent of this, although it's a far cry from the scent of Hawaiian Tropic products (darn it!). As long as I don't stay outdoors longer than an hour, the SPF 15 is enough protection. What I don't like is the over-spray when I'm applying this before going outdoors...I have 2 cats and I don't want them licking the areas where this lands other than my body....it could make them sick.",
      "rating": 4.0,
      "verified": false,
      "author": "Nacho Libra",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "I love this sunscreen spray",
      "text": "I love this sunscreen spray. It sprays on well without mess or oily residue. It dries quickly and even has a nice fragrance. I like that it's only SPF15, so I still get some color. But if I'm out all day, I do have to reapply. I especially love the easy twist cap for traveling so it doesn't spray all over items in my bag.",
      "rating": 5.0,
      "verified": false,
      "author": "SciFiChick",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Worked for soccer",
      "text": "I tested this out in the most grueling of ways: a 10 year old's soccer game in direct sunlight for the whole time. None of us got burned! Also, it was dry sickly and not greasy. Finally, it smelled great and made me want to go on vacation to a beach.",
      "rating": 5.0,
      "verified": false,
      "author": "AshertopiA",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "KMF sunscreen spray",
      "text": "I love how this sprays on. I have never used a spray sunscreen before but decided to try this one as I have never been disappointed with KMF products. It is not greasy or sticky and I love how it smells. For me it is perfect when running errands, gardening or just enjoying life on the deck.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "The coconut sent was like being on the beach but not going there",
      "text": "Kiss My Face spf 15 dry oil went on very smooth and now sticky or greasy feeling. The coconut sent was like being on the beach but not going there. I would definitely buy this sunscreen product.",
      "rating": 5.0,
      "verified": false,
      "author": "Jane Marie",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Great Sunscreen with low SPF",
      "text": "Kiss My Face works well, has a light scent and protects well. It's important to read the directions, as Kiss My Face is the brand name. Do not spray directly on your face. It is an oil, but rubs in nicely and does not leave a sticky residue. The only downside to this particular product is the low SPF. It's best if you are in and out during the day or shopping or something other than the pool or the beach. Kiss My Face does make products with a higher SPF. The price is high too, but I don't mind that for an environmentally friendly product.",
      "rating": 5.0,
      "verified": false,
      "author": "Eric A. Hofstetter",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "I wish all sunscreens felt like this.  Highly recommend.",
      "text": "I have found that I love this spray. First, this does not smell like regular sunscreen. There is a light tropical/coconut scent that I found lovely. Second, this spray feels great on. This is not heavy or greasy. I feel moisturized after application. Not how I typically feel after applying sunscreen. Lastly, I have not burned with this stuff on. It is easy to apply and I use it before heading out to a ballgame or the dog park. It works well. I wish all sunscreens felt like this. Highly recommend.",
      "rating": 5.0,
      "verified": false,
      "author": "Shane O. Laake",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Spray outside; you'll also need to still rub this in",
      "text": "I usually stay away from spray products since they can often cause my allergies/asthma to flare up, but so far this hasn't done so. Although using a spray makes it more convenient to cover areas like your back, I've found that you still need to rub this in to get good coverage. The dry oil nature of this is nice, and doesn't make your skin feel greasy like sunscreen usually can. I wouldn't use this on my face, but it's great for the body. I also like that it's vegan and cruelty-free.",
      "rating": 4.0,
      "verified": false,
      "author": "Leanne",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Don't spray your face...otherwise a good product!",
      "text": "This Kiss My Face Sunscreen gave me a little bit of a surprise when I realized that I can't actually use it on the face. I didn't know this until AFTER spraying my husband's face/ears/head with it...oops! Because of the low SPF, it was intended for use just by the adults in the house, but since I can't use it on such a sensitive area, I'll be looking for another option. For use on other areas of the body, I did find it easy to spray (the twist lock feature is easy to use on the top) and it definitely smelled of coconut. Too bad about the face...",
      "rating": 3.0,
      "verified": false,
      "author": "Loves Books",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "Smells great and works",
      "text": "Sprays nice and evenly on skin. Rubs in easily and drys quickly. Smells great with a subtle suntan lotion type smell. Protected my skin while I was out in the sun today running errands.",
      "rating": 4.0,
      "verified": false,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Love this lightweight dry oil",
      "text": "This is a lightweight, non-greasy dry oil sunscreen that feels great and protects me from burning. Its a great addition to my beach bag!",
      "rating": 5.0,
      "verified": false,
      "author": "Live Laugh Love More",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Summer staple.",
      "text": "Very nice spray sunscreen. Seems to work well. Not too greasy. Sprays well (love the lock feature) and pleasant scent.",
      "rating": 5.0,
      "verified": false,
      "author": "Lindsey W",
      "helpful_votes": 0,
      "publication_date": 20170603
    }
  ],
  "product_meta": {
    "title": "KISS MY FACE SUN DRY OIL C-SPRAY SPF15",
    "description": "Practice safe sun with this Vegan & Cruelty Free, non-Nano mineral formula blended with nourishing Safflower Oil.",
    "rating": 4.4,
    "feature_bullets": [
      "Broad Spectrum spf30 protection & Water Resistant for 80 minutes. When used properly, mineral sunscreens will leave a whitish tint.",
      "NSF Certified Organic formula is made with 73% organic ingredients - also has a convenient twist & lock trigger spray.",
      "Vegan, Cruelty Free, Oxybenzone Free, Paraben Free, Gluten Free & Phthalate Free. Leaping Bunny Certified.",
      "Kiss My Face. Kiss it & make it better."
    ],
    "specifications": {
      "Product Dimensions": "2.13 x 2.13 x 7.75 inches; 6 Ounces",
      "Item model number": "1800613",
      "UPC": "028367844365",
      "Manufacturer": "Kiss My Face Corp",
      "ASIN": "B06W9G61J9",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Sunscreens & Tanning Products",
      "Body Sunscreens",
      "Beauty & Personal Care",
      "Sunscreens"
    ],
    "price": ""
  }
}