{
  "website_summaries": [
    {
      "verdict": "Filtration system, accessories, and the newest version of the the BioCube line.",
      "pros": [
        "Powerful LED light comes with timer to create a unique look",
        "Light system produces natural effect similar to actual day and night lighting",
        "This tank comes with numerous features for a luxury setup",
        "Newest model, but it is compatible with all older BioCube accessories",
        "Has built-in filtration system"
      ],
      "cons": [
        "Some customers found some of the accessories, like the hydrometer, to be unnecessary"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stand is horribly built...",
      "text": "So, the tank itself is great! I've had one before, and loved it. Now, the stand they sent is really crap... The holes were drilled poorly and at odd angles, and off center of where they SHOULD be. With that, I cannot properly mount one of the doors, as the side panel overlaps where they placed the hole for the door... I would've sent it back, however I needed to set it up right when I received it as I had live rock, water and sand waiting... So, I'm not at all happy with this purchase as the stand really messed the whole thing up. Total bummer as the tank itself is great.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20190328
    },
    {
      "title": "I absolutely love this tank",
      "text": "I absolutely love this tank! Would recommend for any one just starting out in the saltwater hobby. I already wish I would have gone bigger, but this is wonderful for my space. The tank stand is a little wobbly without the tank on it. However, once you get the tank on the stand filled with water, sand, and rock, it stays pretty stable.",
      "rating": 5.0,
      "verified": true,
      "author": "Feisty_Unicorn",
      "helpful_votes": 6,
      "publication_date": 20171024
    },
    {
      "title": "Nice tank BUT",
      "text": "Nice tank BUT, I didn’t listen to the reviews about the tank stand. It would wobble just from wiping the glass. I had to get wood cut that fit the back and screw it in myself and now it’s ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180228
    },
    {
      "title": "This is a beautiful set-up. Looks great in my living room",
      "text": "This is a beautiful set-up. Looks great in my living room. I have had it running about a month. Plenty of room in the stand to keep food, extra filtration, siphon, salt, test kits, etc. Very nice lighting and it is great to have room to conceal the heater and skimmer under the tank lid.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 7,
      "publication_date": 20180104
    },
    {
      "title": "Great tank!",
      "text": "This bio cube is a great little tank. Easy to assemble, up and running in no time. We have it in the corner of a room and it looks great. Love the day/night lights, and so do the fish! Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Moon",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Beautiful tank puffer loves it and so do we",
      "text": "Love this tank and stand .stand is sturdy and tank is beautiful, our F8puffer loves it . Filter and pump is good .. only complaint is the skimmer stopped working after one day .i would recommend this tank",
      "rating": 5.0,
      "verified": true,
      "author": "Zack",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "protein skimmer never worked",
      "text": "like the tank itself very much but the skimmer never worked for me/I had to buy another one for the tank",
      "rating": 3.0,
      "verified": true,
      "author": "steven",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great product",
      "text": "I bought this for a gift and she loved it! Easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Three Stars",
      "text": "Skip buying the stand, in my opinion the stand is flimsy junk. Tank seems decent so far.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike Peters",
      "helpful_votes": 6,
      "publication_date": 20180110
    },
    {
      "title": ".  I have to had it for 3 years and love it",
      "text": "Easy to maintain. A lot quieter than having a sump filter. Easy to clean, always get compliments on the tank",
      "rating": 5.0,
      "verified": false,
      "author": "steve p.",
      "helpful_votes": 6,
      "publication_date": 20180926
    },
    {
      "title": "DONT BUY THIS PRODUCT",
      "text": "Mine cracked in the middle of the night in the front left bend. if you do a google search you will see these are known for cracking in the front left bend",
      "rating": 1.0,
      "verified": false,
      "author": "Sam S",
      "helpful_votes": 2,
      "publication_date": 20191030
    }
  ],
  "product_meta": {
    "title": "BioCube Coralife Size 32 LED Aquarium Reef Package (with New Improved Stand)",
    "description": "This REEF PACKAGE combines the Size 32 LED BioCube with the NEW & IMPROVED BioCube Stand and BioCube Protein Skimmer along with a BioCube Algae Cleaning Magnet and Coralife Mini Hydrometer. The Coralife NEW STYLE Size 32 LED BioCube Aquarium features LED lighting and timer capabilities–taking it to the next level of all-inclusive aquariums. Just like older BioCubes, it has a compact and customizable filtration chamber, hinge-top canopy design, quiet submersible pump, dual intakes, adjustable return nozzle and clear glass back panel for easy refugium set-up. Compatible with all existing BioCube accessories. Included is the NEW AND IMPROVED BIOCUBE STAND. This NEW & IMPROVED VERSION features a solid back panel for added stability. No glue is required.",
    "rating": 4.1,
    "feature_bullets": [
      "This REEF PACKAGE combines the Size 32 LED BioCube with the BioCube Stand and BioCube Protein Skimmer along with a BioCube Algae Cleaning Magnet and Coralife Mini Hydrometer",
      "The Coralife NEW STYLE Size 32 LED BioCube Aquarium features LED lighting and timer capabilities–taking it to the next level of all-inclusive aquariums",
      "Just like older BioCubes, it has a compact and customizable filtration chamber, hinge-top canopy design, quiet submersible pump, dual intakes, adjustable return nozzle and clear glass back panel for easy refugium set-up",
      "Compatible with all existing BioCube accessories",
      "Included is the NEW AND IMPROVED BIOCUBE STAND. This NEW & IMPROVED VERSION features a solid back panel for added stability. No glue is required."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 3, 2017",
      "Manufacturer": "Coralife",
      "ASIN": "B06XDV9NBQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Aquariums",
      "Aquariums & Fish Bowls",
      "Pet Supplies",
      "Fish & Aquatic Pets"
    ],
    "price": 529.95
  }
}