{
  "website_summaries": [
    {
      "verdict": "The aluminum frame makes this model lightweight and easy to assemble, and the memory controller allows users to program the desk to remember their preferred setting.",
      "pros": [
        "Easy assembly with just a screwdriver",
        "Aluminum frame is lightweight enough for most users to move the desk into place after assembly",
        "The height range runs from 27.5 inches to 45.5 inches with simple push-button motor operation",
        "The 6-button control also includes a programmable memory function, which allows users to return the desk to their preferred setting without having to hold the button"
      ],
      "cons": [
        "This desk tends to wobble slightly, especially when raised to the top end of its height range"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect Ergonomic Desk to Work from Home",
      "text": "Like many who are now working from home, I needed an ergonomic, adjustable height desk. Saw this one on Amazon and the price and style met my needs. I have been very pleased with it. Packaging was great. Not overdone, but certainly kept the desk protected. Assembly was very straightforward and easy. It adjusts to the height settings that I need. It is made of very sturdy materials. It looks nice too! I also had to contact customer service via email to ask about how to display in English vs metric and I got a reply with a solution in less than 15 minutes! That's impressive customer service!! Highly recommend this desk!",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent Romano",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Best Work from Home Desk",
      "text": "facing extended work from home time under covid, I needed a desk that wasn't too large to fit the space in the spare room and loving my stand up desk at the office, figured this was the desk for the at-home job. It is big enough to be functional but not so large that it overtakes what little space I have. (with a laptop and desk lamp on it, I still have space for two cat beds for my coworkers.) The surface is sturdy and I love the preset options for desk height. Big win for the value and the functionality (assuming you do not mind not having desk drawers -- i do not mind)",
      "rating": 5.0,
      "verified": true,
      "author": "JuliR",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Just an inch lower, and it would be perfect.",
      "text": "I'm short. 5'2\" on a good day. And I have neck and shoulder issues. I was really hoping that this desk would lower just a tiny bit more. Between desks that won't lower, and chairs that won't raise, it's nearly impossible to get an ergonomically sound workspace, without cushions, and footstools. That's my only complaint about this desk. It's sturdy, and I think it will be fine. I have 2 monitors a laptop, a docking station and a keyboard. There's not room for anything else, but it suits me fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Great adjustable height desk",
      "text": "I had been having back pain from sitting so much, as I am a 100% remote worker. I had read reviews for desk models as well as manufacturers. This one reviewed well, and is large enough for my 2 monitors. I am a 5'2\" woman, and although it said 2 people were needed for assembly, I accomplished by myself. By attaching the top to the base from below (instead of the reverse as the instructions called for and would then require inverting the full assembly, taking 2 people), the mission was safely completed!",
      "rating": 5.0,
      "verified": true,
      "author": "BRENDA D.",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Quality has improved",
      "text": "I bought this same desk 4 years ago, and though the frame is the same, the desktop, motor and controls are improved significantly. The desktop laminate covers the sides fully, so there is no problem with the side trim peeling off. The desk raises and lowers quickly and relatively quietly. It is stable at full height. I'm very pleased with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great desk so far",
      "text": "This was very easy for me to put together. I have been on an IKEA kick and to be honest, had they been open I would have gone there. Compared to some of the IKEA things I've assembled, this was simple. I only needed help attaching the base to the desktop because it was heavy and I didn't want to damage the top. When fully raised, there is some sway if you lean too hard on it. I am very happy with this purchase and now my home office is workable during this coronavirus mess.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "How easy it was to set up.",
      "text": "It is well built and very sturdy no shaking when moving it up and down. I like that I can also do presets on it also. It holds two laptops and to 27 in Monitors and I have no wiggle. I bang on my keyboard pretty hard and my monitors do not bounce around, like on my old desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Chandler",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Sturdy and easy to put together",
      "text": "I have been wanting a stand up desk for a while now. I have looked on many websites at the desk and the features. This fit the bill entirely. Cost effective, sturdy and electric. I LOVE my new desk. It is the perfect size. At first I was concerned that the moving the desk up and down would shift my monitors (which are on a placed on a brace); but I have not had any issues. The desk is wonderful. So happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisa",
      "helpful_votes": 2,
      "publication_date": 20170426
    },
    {
      "title": "love my new adjustable desk",
      "text": "Very happy with this. I was surprised by the value. The units that set on top of an existing desk and just pop part of it up cost more. I put it together myself. Pretty easy. I like that I could use my existing desk top and mount it to this base and not change the blueprint of my office. EVERYTHING on my desk rises with the base so my entire workspace is the same. I stand all morning and when I'm dong a webinar. Nice to have everything i need at the same level. And when I need to sit, I hit my preset and back down it goes. Wish I got it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger Bratzel",
      "helpful_votes": 3,
      "publication_date": 20160125
    },
    {
      "title": "It rises high enough for 6'5\" person use",
      "text": "Overall it went together well. The motors are more noisy than the ones I have used in Europe. Those are whisper quiet. This one does raise high enough given my height that it works well and is sturdy at the height I need. I did have to drill two small holes to mount the controller to the desktop because the pre-drilled were too big. Not a big issue but for the money I expected the motors to be more quiet and not have to drill anything for assembly.",
      "rating": 4.0,
      "verified": true,
      "author": "p d g",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Defective piece delivered",
      "text": "The unit I received has multiple issues 1. The left leg is wobbly and keeps moving around. 2. The hole for wires is covered on the wrong side - at the bottom (you can see that the bottom side on top in the pictures). 3. The nails for the LED control do not go in because the hole is way too small. This means the controller is shaky plus you run the risky of the nails falling off and hurting someone in the house all the time.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "I’m not sure if it worth it",
      "text": "It’s a good desk and I was excited to get it assembled and use it. First the manual is outdated for the current design. It says look for holes where that there is none. Second after I finished assembling I realized the desk has came with a damaged surface. I’m going to keep it as it is, since it takes too much effort to return it at this point. This is very unfortunate and I didn’t expect it for a desk with this price.",
      "rating": 3.0,
      "verified": true,
      "author": "Behnoosh",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Everyone loved it so much that we all converted to standing ...",
      "text": "I bought this table for myself at the office I work in. Everyone loved it so much that we all converted to standing desks. I wouldn't say the desk is really loud when moving up or down--but then again, we work in a factory warehouse so sound doesn't matter to us. I think if you used this at home and had to raise/lower during a nice quiet night, it would probably be a lot louder than expected. I also like how light weight this desk is in comparison to the bulky wooden desks that we've been using. It feels much more natural and I love being able to decide if I want to sit or stand without breaking my back.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruby L.",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Very easy setup, just go to you tube for many ...",
      "text": "looked at al to of desks and bought this one because of the reviews and price. Very easy setup, just go to you tube for many videos. Service was excellent, part was broken in shipping, I had it within 2 working days. I went to home depot and had them cut me a 3/4 in 24 by 48 one side finished plywood and plan on staining it but at this point will probably be in next life time because it is awesome just the way it is. Desk works wonderfully and is easy assembly and does the trick. Not wobbly or unstable in any way.",
      "rating": 5.0,
      "verified": true,
      "author": "Lenny",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Some quality control would be nice",
      "text": "For the price there really should be some quality control. Screw count in the assembly guide does not match the actual count, misaligned holes for screws, and in one case one of the holes wasn’t even punched out. I was able to assemble it but in a few cases I was unable to assemble it as designed due to these issues.",
      "rating": 3.0,
      "verified": true,
      "author": "Brad Carchidi",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Great Price and a Quality Product!",
      "text": "I'm very happy with my desk. It was easy to put together. My ambitious 13 year-old built it for me. I supervised. The motor works great and is not very loud. I have a desktop computer, and 24lb monitor sitting on this desk, and have had no issues. The presets work nicely so I have a standing present and a sitting one. My work has a model similar to this that runs $1,500! and I like this one better. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Wedgies",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Great so far",
      "text": "I have been using this desk now for a few weeks and it has been great so far. The build quality is excellent and it feels quite sturdy and does not wobble much when standing. Setup was a breeze, minus a couple of oddities that I had to work around, but the parts were labeled well and the instruction manual was easy to understand. I would recommend using a plastic desk protector to protect the desktop surface from damage from everyday usage. I usedwhich was pretty well perfectly sized with the \"New Cherry Top\" desk option, except I had to cut holes for the wire grommets.",
      "rating": 4.0,
      "verified": true,
      "author": "admiralspock",
      "helpful_votes": 2,
      "publication_date": 20171021
    },
    {
      "title": "Excellent adjustable height desk",
      "text": "Excellent adjustable height desk. Very sturdy and well made. Only wish it could go lower than 28.5\".",
      "rating": 5.0,
      "verified": true,
      "author": "H.L.",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "great desk",
      "text": "this is a better product than I thought I was going to get. heavy, sturdy, good motor, thick desk top.",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Great product and great support!",
      "text": "The desk is great and the assembly instructions also. One nice thing is it came with a few extra fasteners so when I dropped that small piece I didn't have to panic when I couldn't find it. After I had it all assembled, I noticed the controller was broken. I don't know if it came that way or of I broke it during assembly. I contacted their support via email. Since it was Saturday I didn't expect a response until Monday, but I received a response right away telling me they would ship a new controller on Monday. I installed the new controller today and everything is working great. Great product and great support!",
      "rating": 5.0,
      "verified": true,
      "author": "Tory",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "9 Months Later: Still Quiet and Solid",
      "text": "I slapped my IKEA desk top on top of this, drilled some holes and set some screws, and it's amazing. It raises and lowers relatively quietly and stably. Time will tell how long it lasts, but this feels like a good purchase and a good product. ** UPDATED AFTER 9 MONTHS ** Still going strong. No hiccups or problems. I raise and lower it about once a day during the work week, I'd say.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawson",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "This desk is perfect! ❤️",
      "text": "This desk is perfect! I am already in love with the functionality, look and stability of this desk ❤️ It is deep enough to comfortably fit my laptop, monitor, work phone and extra monitor + all my extras! It was easy to put together and was delivered a couple of days after ordering it! The preset option allows me to preset my preferred sit/stand positioning and easily allows me to go between them with the touch of a button! I am super impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly T.",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Very well Built!",
      "text": "It came in the mail today, so I sat down and assembled it. It was fairly easy, some of the screws were not easy to get in by hand, but not impossible. The desk base feels very solid! I don't think I have to worry about it ever coming because of how well all the parts fit together and how tight everything is. The motor feels and sounds very smooth, and all the buttons work on the controller. I'm pretty happy with my purchase, I ordered the base without the top, and will be building and installing my own top as soon as the parts arrive in the mail.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20151203
    },
    {
      "title": "Excellent Frame and Customer Service from Apex",
      "text": "I was a bit hesitant to purchase this at first because the frame is so light and I believe I read some complaints about it not being stable. The frame is very stable with two 29 in monitors, a desktop, and a laptop on top of it. On its tallest setting (i think may be 44 in) it does move a little bit more but not too much for it to actually bother me. Overall I am very pleased the frame and it was easy to put together by myself. I paired the frame with an Ikea Linnmon top.",
      "rating": 5.0,
      "verified": true,
      "author": "LN",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Better quality than I expected",
      "text": "Better quality than I expected. It smelled funny though. I suspect it was the China butter, likely applied to the riser shafts at first, but I think it was actually the shrink wrap. So once that was gone, it was good. I made my own table top from a 30x60 piece of glued together Pine from Menards I bought for $40 that I then stained myself. It screws together quite easily, and they give you the needed tools.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Engelkemier",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Extremely well made.",
      "text": "Spectacular. Extremely well made The packaging for shipment was excellent also. Assembly: Simple, each step had individual bags of bolts. Assembled item: Sturdy. No structural movement whatsoever. Motion: Smooth and not very noisy at all. The preset height stops are useful, although I will adjust them for my height. I paired this frame with a solid wood Ikea 61x29 table top (58 lbs). An iMac sits on top. The motor has no trouble moving the table and computer up and down. I paid $299 for the Vortex Frame and $89 for the table top. I am EXTREMELY satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Casper",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Great work space for standing or sitting.",
      "text": "Several months of daily work use, using the convenient presets to raise and lower the table several times/day. Nice looking form, rounded corners a plus to avoid hard bumps. Stable platform for computer work: I have two monitors on stands, a keyboard and two small form lamps, yet still room to spread some notes and papers.",
      "rating": 5.0,
      "verified": true,
      "author": "Netgurney",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "Great Desk - Easy to Assemble, Very Sturdy",
      "text": "This is a very nice desk/table - It went together very easily and the quality is good. The top is thick and sturdy and the controls are very nice",
      "rating": 5.0,
      "verified": true,
      "author": "S. Beamer",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "I would purchase again",
      "text": "Have been using this desk for almost two months now, and am very pleased. The desk is very stable at normal heights, While it is somewhat less stable when extended to a full standing height, I have not found the minor movements while working to be significant enough to be distracting or annoying for typical computer and desk work. I tend to raise and lower the desk once or twice a day so that I can work both standing and sitting -- the motorized lift with 4 preset buttons is a great feature. Apexdesk was also response when one of the cable hole covers was broken -- I received a replacement in 2 days. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Li B",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Love this desk",
      "text": "I love my new desk. It holds my video studio. I have a 27” monitor and a MacBook Air on it. Works as expected. Assembly was very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "El chato",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "nice desk",
      "text": "Probably the easiest piece of furniture I have assembled. A little wobbly up high but isn't too much of a concern for me",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "wobbles at stand position",
      "text": "Wobbles very bad at stand position. Contacted with amazon representative. He asks me to hire a professional to assemble the table. I did assemble the table by myself and the process is pretty straightforward. It is not the assembly problem. It's the problem of table itself.",
      "rating": 1.0,
      "verified": true,
      "author": "Chunfang Li",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Great desk with great customer service",
      "text": "Great desk with great customer service. They forgot to give me the power cord but was able to replace it very quickly. The desk is compact and very sturdy. Great addition to the office! Would recommend this desk!",
      "rating": 5.0,
      "verified": true,
      "author": "tingting wang",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "I love this desk!",
      "text": "A great stand up desk for the money, Assembly is not too difficult, the instructions are good and all the hardware packets are well labeled. The desk was shipped quickly and packed very well. I have back issues and being able to change positions throughout my day keeps me from getting stiff and sore.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell S",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Lack of quality control and customer service",
      "text": "I couldn't mount the table top because the screw holes do not align. After spending over an hour I figured out that incorrect frame was sent. There is no instructions on how to get in touch with the customer service. I do not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Faria Musharraf",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Great table. Mine showed up with a small ding ...",
      "text": "Great table. Mine showed up with a small ding from shipping but that's ok. It's under where the keyboard would go so it's not noticeable. Not as stable as a fixed-height table but the adjustable nature of the desk is really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Awesome! I just purchased the frame (not with table ...",
      "text": "Awesome! I just purchased the frame (not with table top as I build a custom top). Delivered promptly and well packaged. The frame was easy to assemble and took about 30 minutes. It's very stable and was easy to attach my custom table top (which weights about 35 pounds). It just takes some care measuring to line up the holes correctly. The preset height adjustments are fantastic to transition from sitting to standing. Everyone in my office is so jealous.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Mills",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Solid desk, but not a $1k desk",
      "text": "Great value. Sturdy and looks nice. I'm disappointed how slow it is and how loud the motor is. Other than that, great product.",
      "rating": 4.0,
      "verified": true,
      "author": "J.G. III",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "nice desk, good customer service",
      "text": "Edit: It’s a nice desk. They did sent one of the legs without threading, which was a pain. After I complained they sent a new leg right away, so because customer service was good and the desk is nice upping the review to four stars. Previous: Annoyed because two of the screw holes securing the crossbeam to the legs aren’t made properly, do nothing will screw in. Desk is still secure-ish. But bad job for a $500 piece of furniture.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Sturdy, motor is strong enough to lift desk",
      "text": "Sturdy, motor is strong enough to lift desk, all the crap on it, and 3 monitors with their stand.",
      "rating": 5.0,
      "verified": true,
      "author": "McSquid",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Smooth operator",
      "text": "Arrived on time, looks really nice and works great. Has 3 adjustable settings, as well as manually anywhere in between, changes effortlessly at the touch of a button. Very happy with this desk.",
      "rating": 5.0,
      "verified": true,
      "author": "TWU Dance",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Great stand desk frame",
      "text": "Love my desk. You do need two people to put it together. I didn't want to pay the extra monies or assembly. Besides , if was very easy. All the parts came labeled and the instructions and pictures were clear. It took us about 30 minutes to assemble. The desk frame is durable and made with quality parts. Everything works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Shangri-La D. Jackson",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Love the desk",
      "text": "Love the desk. I work from home often and its so nice to be able to stand up. Shipped sooner than expected and was fairly easy to put together (took about an hour in total which included cleanup of everything and setting up my computer and monitors). Holds a triple monitor stand without any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Nice quality product that was very easy to assemble",
      "text": "Nice quality product that was very easy to assemble. Purchased for my employe who has a back issue and prefers to stand. He is very happy. My operations manager who use to sell office equipment said this product is as good a quality as the units he use to sell for 1000.00.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron J.",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Overall I couldn't have been happier with the receipt and installation process and will update ...",
      "text": "This item was packed about as well as could be with complimenting instructions which left nothing to the imagination. Further, the screws were even labeled in individual bags per \"section\" of the desk. Overall I couldn't have been happier with the receipt and installation process and will update this review once the desk has been used for awhile!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad H",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Easy assembly with excellent instructions",
      "text": "Easy assembly with excellent instructions. All the parts are well labeled. I used my old desktop, drilling holes for the inserts and attaching everything. I like working standing up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim G.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "One of of the best purchases I've made in a while",
      "text": "One of of the best purchases I've made in a while. Worth every penny. Rounded the Office set a comfy chair: Serta® iComfort For WorkPro® i5000 Series Big & Tall Chair.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Douglas",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Worth every penny!",
      "text": "Love it! As a teacher there are times for standing and times for sitting. This desk does it all at the touch of a button!",
      "rating": 5.0,
      "verified": true,
      "author": "Melody Barry",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Impressed",
      "text": "Bought this for my office. The space is very small. But this fit perfectly. Assembly was a snap. It is very sturdy. NO COMPLAINTS AT ALL.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Cole",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "very easy to assemble",
      "text": "works well, attractive, very easy to assemble, very stable - one small disappointment: the assembled size is one inch too big for a 24\"x48\" top, which is too bad because you can buy very nice looking, ready to finish tops like that at Lowe's or Home Depot.",
      "rating": 4.0,
      "verified": true,
      "author": "LVRMP",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Great Quality, Easy Assembly, Absolutely No Complaints",
      "text": "I've been using this stand for a few months now and have no complaints. It feels sturdy, has a smooth motion and zero problems. The packaging was tight and the instructions were clearly written and easy to follow. I have no hesitation recommending this stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik R. Knowles",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Get ready for many calls to Customer service to fix the unit",
      "text": "It is the second unit purchased. The main assemble failed after 2 months would not go up or down, it took 5 emails and many calls to get the replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "LIBONE3",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Awesome desk.",
      "text": "Great desk. Well built. Extremely well packaged for shipping. Each type of hardware was labeled individually. Assembly can be done by one person. I also purchased the cable management tray and it is well worth it. Everything is neat, including the power strip for the lights, monitors, and computer on the desktop.",
      "rating": 5.0,
      "verified": true,
      "author": "PeaceHopeLoveJoy",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Very sturdy and easy-to-operate table stand.",
      "text": "Had a recommendation from a friend that also purchased this adjustable desk base. Came quickly, easy to set up with simple tools, and it works flawlessly. I found programming two heights very easy. Very pleased, only drawback over a manual lift style of table is the motor does make some noise when changing positions. This could wake my wife when I work early in the morning but has not been a problem yet. I added my own table top from several I have around the shop, mounted easily and it will last quite a while I expect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Ok Budget standing desk",
      "text": "Wobbles badly at full extension, and even a little when all the way down. It's good value for the price, but it does not compare to more expensive tables.",
      "rating": 3.0,
      "verified": true,
      "author": "Zaphod",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Great stand up adjustable desk! I love it! Lot s of desktop work space.",
      "text": "Very happy with this purchase. Nice looking, sturdy and very stable. A great value at the price. I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "MarkInSJC",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Buy this if you are thinking about a standing desk!",
      "text": "I've only had this desk for a few hours but I had to write a review. This desk is amazing. It came packed in one box, with neat seperate packages of bolts and washer for each different step. It goes up and down with a push of the button. Took me less than 30 mins to put together! Added a $30 table top from Menards and my office is set! Would definitely recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Anderson",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "Great Table",
      "text": "The color is pretty. We love it. Good quality too.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Works well and lifts a surprising amount of weight. ...",
      "text": "Works well and lifts a surprising amount of weight. The only complaint that I have is that my up and down arrows seem to be reversed. Down goes up and up goes down. Aside from that I would buy it again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "jon",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "I love my extending desk frame!",
      "text": "I love it! Once I figured out Icould drive screws directly into the top. This came together quickly! Sturdy frame that is very stable when extended! I am truly a happy camper!",
      "rating": 5.0,
      "verified": true,
      "author": "EAGVGS",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "great instructions, simple to assemble and packaging was very ...",
      "text": "These are first class, great instructions, simple to assemble and packaging was very good so desk tops don’t get damaged. I would recommend these over others out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "High quality, looks great",
      "text": "Very high quality product. Looks great and was relatively easy to assemble. I used a cordless drill with Allen bits to speed up the build. Can't imagine cranking something every time I want to raise and lower. This is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Allan",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "good base!",
      "text": "So far, so good. Only have had a week, but I love it. Wasn't difficult to put together, but you need 2 people. I like that it is electric with the digital display so I can get the height just right. I purchased a 30x60 tabletop and it looks good!",
      "rating": 5.0,
      "verified": true,
      "author": "JulieL",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Best purchase to help with working remotely!",
      "text": "This deal was easy to put together! I’m so glad we made the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Installed easily and forms a solid support for my desk",
      "text": "Well made, works well. Installed easily and forms a solid support for my desk. I've been standing ever since!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Black",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Great value and quality for price",
      "text": "Great construction. Simple to put together. Needed smaller bracket arms and the company was very helpful in making this work in my office. Definitely impressed with the product and the customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Massie",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Great customer service",
      "text": "Had the desk for almost two years and when the gearbox started making a noise, I was able to get a replacement part shipped out within 24 hours of contacting customer service. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rooster",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Works great with my existing oak desk top",
      "text": "Works great with my existing oak desk top. I love the four setable height settings . A surprise feature is the ability to run the desk up to max height. Makes \"crawling\" under a desk for cables much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian B",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Upsy-downsy",
      "text": "Nobody should ever bypass this- Although directions are a classic bit of ChineseEnglish",
      "rating": 5.0,
      "verified": true,
      "author": "Denham B. Crafton, II",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Five Stars",
      "text": "Highly recommend for a DIY desk project. I saved hundreds over buying an Ikea.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Fantastic! Would buy again,",
      "text": "Fantastic! I purchased another adjustable desk 4yrs ago for twice the price, for another office. This desk is just as good, at half the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike C",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "This product is amazing. I coupled it with a ikea tabletop",
      "text": "This product is amazing. I coupled it with a ikea tabletop, and it works like a charm. Real easy to set up, and really easy to use. It is a little wobbly when fully standing, but that is fine. It is strong, despite the little wobbles when typing.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew John Thanabalan",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Good purchased",
      "text": "I've been using this table for more than 3 months and I like it so far. The table is very sturdy. I adjust the height several times a day and it's been working well.",
      "rating": 5.0,
      "verified": true,
      "author": "reachbye",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "well worth the money",
      "text": "Perfect size for two 27\" monitors. Assemble instruction was good. I like that they organize screws into packets with labels.",
      "rating": 5.0,
      "verified": true,
      "author": "Young",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "High quality low cost well worth it",
      "text": "Nice fast delivery, solid quality, well worth the money, best price features on the market, the presets work great. I would recommend this to anyone who is looking for a high quality low cost desk. The desk had a few issue and the company responded very quickly to send replacement. First class company that stands behind its products.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "Looks good too! Excellent product😊",
      "text": "It is adjustable without any trouble. Looks good too! Excellent product😊",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "... using this for a few months now and I love it!",
      "text": "I have been using this for a few months now and I love it!! It works great",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Great product",
      "text": "Very sturdy. Raises and lowers without issue. Easy assembly. I have a 63\" long desk with dual 27\" monitors, Xbox, PC tower/peripherals all on desk and no weight issue at all. If your looking for a stand up desk this one is great and at a decent price as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Absolutely love this desk and so does my back",
      "text": "Absolutely love this desk and so does my back! Built my own top out of blue stained pine. TOP NOTCH! Quality product I use everyday! Would recommend this to anyone! They even sent me a new controller cable after I broke mine while moving! Thanks so much for making a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Five Stars",
      "text": "Good, solid frame. Mechanically sound and despite slower than manual desk speed of changing height it works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "A. S.",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Great Desk.",
      "text": "Great desk, Im happy I made this purchase, thinking about buying the 72\" desk now.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Great option and streamlined to fit almost anywhere.",
      "text": "This desk has been a life saver! Flexible and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "great desk for newbie to standing work SOHO",
      "text": "Works great helping my bad hip, by standing 2-3 hours per day. worth the effort to replace old desk. raise and lower works great smooth pretty quiet. Set-up took 2.5 hours was kind of a pain but got it done no issues instructions were spot on. great quality should last decades.",
      "rating": 5.0,
      "verified": true,
      "author": "krpah",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Great for the price!",
      "text": "I bought eight of these for our office, and for the most part they work fine and simple enough to put together without much technical knowledge. The main point of criticism I have is that the feet of the desk don't remain parallel to one another, and sometimes need adjusting after the desk is set up.",
      "rating": 4.0,
      "verified": true,
      "author": "Spencer K Toyama",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Easy to assembly and easy to operate",
      "text": "Just as advertised. Easy to assembly and easy to operate. Ordered another one for my colleague.",
      "rating": 4.0,
      "verified": true,
      "author": "Candace",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Good quality and materials but few flaws (may just be the one I received)",
      "text": "I am really enjoying this standing desk but mine does have a few minor issues. The motor is smooth but it does squeak on the right leg when lowered, the face of the controller was peeling off (had to super glue it in place), and occasionally when I push a programmed height the desk stops before it is reached.",
      "rating": 4.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "I love it! Very strong and is working very well",
      "text": "I love it! Very strong and is working very well. The only problem is that does not have a remote control as I was expecting.",
      "rating": 4.0,
      "verified": true,
      "author": "ACP",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "The table top has a nice finish but it can get chipped quite easy",
      "text": "The table top has a nice finish but it can get chipped quite easy. The table can shake a little bit even at the shortest level. When I type, it does shake a bit also. It is a big deal but you have to get used to it.",
      "rating": 4.0,
      "verified": true,
      "author": "Chi N.",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble. I used my own desktop, and it works great. For the price, I don't this can be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Nora L",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Okay but still very overpriced and wobbly...",
      "text": "Okay but still very overpriced. This frame should cost no more than $200. Pros: - Motors/gears seem strong. Easily lifts a heavy table top, full tower, 2 monitors, and bookshelf speakers. - Not super loud - Memory setting is nice (display turns off when not being used) - Easy to assemble (took me about 30 minutes) Cons: - Price - Wobbles a lot a full height - Controls and display are cheap",
      "rating": 3.0,
      "verified": true,
      "author": "xMishka",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Very easy to set up and surprisingly very stable",
      "text": "Very easy to set up and surprisingly very stable. We love it. But one annoying thing is that the motor is slightly noisy.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Phang",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Easy to assemble amd very sturdy",
      "text": "Easy to assemble amd very sturdy. Cant beat the price. I just used the top to my old desk and put it on this.",
      "rating": 5.0,
      "verified": true,
      "author": "Louie",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "It works! With all the bells and wissles",
      "text": "I was able to put it together in under 80 minutes. I would recommend this table. It’s sturdy and does the job",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Five Stars",
      "text": "Excellent desk. It works as advertised. The service I received when it malfunction is incredible. They went out of their way to fix it fast. I have no reservation in recommending this desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Five Stars",
      "text": "It is a berry nice desk and I works great",
      "rating": 5.0,
      "verified": true,
      "author": "Rob white",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Good value - great product",
      "text": "Great product! Arrived packed well - not damaged. Very good parts - good quality. Went together easily.",
      "rating": 5.0,
      "verified": true,
      "author": "socalPaguy",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Five Stars",
      "text": "This unit is surprisingly sturdy and solid. The lift electronics and motor function very efficiently. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "maggie soboil",
      "helpful_votes": 0,
      "publication_date": 20160216
    },
    {
      "title": "Five Stars",
      "text": "excellent quality , easy assembly , exceeded my expectations. Get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Randal D Wills",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Three Stars",
      "text": "DIdn't work at first, company sent parts to fix it so far so good",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Wrong \"Product Dimensions\" !!!",
      "text": "This desk is erroneously showing actual measurements. We have requested replacement in order to received as advertised 60\"x 30\" desk, however already second time we were given again the desk that measures only 59\"x 29\".",
      "rating": 1.0,
      "verified": true,
      "author": "adamp123",
      "helpful_votes": 0,
      "publication_date": 20170911
    }
  ],
  "product_meta": {
    "title": "ApexDesk Vortex Series 60\" 6-Button Electric Height Adjustable Sit to Stand Desk (Memory Controller, Black Top)",
    "rating": 4.4,
    "feature_bullets": [
      "Height adjustable from 27.5” to 45.5” (without top)",
      "Superior stability & sturdy industrial-grade aluminum underframe. This product meets the minimum requirements of ANSI/BIFMA standards.",
      "1\" thick, 59\"x29.5\" top with scratch-resistant high-pressure laminate",
      "2 x 80mm grommets & adjustable leveling studs",
      "This desk is packaged in 2 boxes. Multiple piece shipments sometimes arrive 1-2 days apart. To track packages go to carriers website and enter tracking number, this will pull tracking of the other packages as they are linked."
    ],
    "specifications": {
      "Manufacturer": "ApexDesk",
      "Brand": "ApexDesk",
      "Item Weight": "89 pounds",
      "Product Dimensions": "60 x 30 x 48 inches",
      "Item model number": "VT60BLK-M",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Shape": "Round",
      "Material Type": "Metal",
      "Number of Items": "1",
      "Size": "60\"",
      "Manufacturer Part Number": "VT60BLK-M",
      "ASIN": "B06XS74GRD",
      "Customer Reviews": "4.4 out of 5 stars168 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#136,303 in Home & Kitchen",
      "Date First Available": "October 20, 2015"
    },
    "categories": [
      "Furniture",
      "Office Products",
      "Home & Kitchen",
      "Home Office Furniture",
      "Home Office Desks"
    ],
    "price": 529.99
  }
}