{
  "website_summaries": [
    {
      "verdict": "This pan has a bit of a unique shape and a patented coating that helps the cakes come out easily.",
      "pros": [
        "The angle on this pan makes it easier for cakes to slide out",
        "Sold by a family owned company",
        "Heavy, solid feel to the product",
        "Handles are useful",
        "Batter bakes up evenly, creating perfect cakes"
      ],
      "cons": [
        "Despite the nonstick coating, some people prefer to still grease this pan before use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love this bundt pan",
      "text": "Love this bundt pan. Have been using it since Dec’17. I always coated with butter and flour, cake always comes out easily even after 10 minutes of cooling. It’s big too, the biggest of all my other bundt pans. It can hold up to 15 cups cake batter and not dripping up while baking.",
      "rating": 5.0,
      "verified": true,
      "author": "Evy Syartika",
      "helpful_votes": 38,
      "publication_date": 20180617
    },
    {
      "title": "Look no more",
      "text": "USA delivers exactly what it claims. I just spray lightly and nothing ever sticks. My cakes come out perfectly perfect !!!! Great brand. I own 8 products made by USA. this seller is terrific. Fast delivery. BUY IT!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Krieger Chalaire",
      "helpful_votes": 21,
      "publication_date": 20190830
    },
    {
      "title": "Great quality",
      "text": "USA bakeware has become my favorite. I've never had a problem with cake sticking. I do grease prior to putting in cake batter. I use Crisco to grease but I don't flour. Bakes my cakes perfectly and comes out easily. Very easy to clean as well. Sturdy, heavy duty quality. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Knitty59",
      "helpful_votes": 16,
      "publication_date": 20190110
    },
    {
      "title": "Nice heavy pan",
      "text": "This pan makes a great bundt cake. The cake does not stick after the baking is finished. Usually I prefer a springform pan for high cakes, but this one-piece pan works well. The pan is heavy and sturdy. I love the USA Pan brand and have other baking pans it manufactures.",
      "rating": 5.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 11,
      "publication_date": 20190907
    },
    {
      "title": "A++++!  My date cake fell right out of it, and it's USA made!!",
      "text": "I make a to-die-for date-nut cake at the holidays and have been banging the heck out of my old aluminum bundt pan for so many years that it was time to replace it. I am so glad that I picked this pan. The dates are really sticky and it is really to ruin the look of the cake if it has chunks stuck to the pan - that's apparently never going to happen again. This pan is the creme de la creme, and it is made right here in the USA. Buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "MIMI",
      "helpful_votes": 7,
      "publication_date": 20200227
    },
    {
      "title": "Best quality I've found",
      "text": "This pan is superior quality and if cared for properly should last for many many years. I promptly made a chocolate sour cream bundt and finished it with ganache. Delicious. The pan still may stick a bit as will any bundt pan I have ever had anyways, I'd still recommend a light spray of Canola spray and light dusting of flour and or flour + cocoa for chocolate items before filling your batter. Happy Baking!",
      "rating": 5.0,
      "verified": true,
      "author": "Shimmy",
      "helpful_votes": 13,
      "publication_date": 20180812
    },
    {
      "title": "Solid addition to our bakeware",
      "text": "Better than expected . Very well made bakes perfectly uniform cakes.",
      "rating": 5.0,
      "verified": true,
      "author": "James D. O'malley",
      "helpful_votes": 12,
      "publication_date": 20180107
    },
    {
      "title": "Looks like it was stored poorly, all scratched up",
      "text": "I love this brand, which is why I bought this pan. But it looks like it was stored nestled into other pans with nothing in between them. If it was just the outside I'd not care, but it's all over the pan. I don't know if all that would affect baking in it or not, but it's not what i paid for. I'm pretty disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 3,
      "publication_date": 20200515
    },
    {
      "title": "Bake to perfection!",
      "text": "The USA Pan 1087FT Bakeware Nonstick Fluted Tube Cake pan is now my all new favorite bakeware! I love how thick and durable this Aluminized Steel pan is. It's very simple to use and even simpler to clean. I've made 3 cakes in the last couple weeks and have had excellent results and many compliments on how beautiful they turn out. Post bake, the cakes slip right out with no effort whatsoever! If you need a good bundt/flute cake pan, this is definitely worth it's weight in gold.",
      "rating": 5.0,
      "verified": true,
      "author": "Felix",
      "helpful_votes": 2,
      "publication_date": 20191228
    },
    {
      "title": "Saved my limited baking street cred",
      "text": "Fantastic pan. Heavyweight and durable. I had several tube pan disasters before I got this one. Cake comes out easily and cleanly. You just have to wipe the little sections a bit attentively but that's true for any fluted pan. A big hit.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Berman",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Absolutely Fantastic!",
      "text": "You will never be disappointed with any of the USA Bakeware. They are really the greatest bakeware that I have ever had in my 60 plus years of cooking and baking. I even started gifting them to my adult children to make their time in the kitchen easier and more enjoyable. I would recommend these in a heartbeat. The Bundt pan needs no oiling or greasing and the cake comes out perfectly each time. The clean up is a breeze because there is nothing stuck to it.",
      "rating": 5.0,
      "verified": true,
      "author": "cajunmama",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "One of Amazons few flaws",
      "text": "Great pan, love the whole USA line, but Amazon needs to ship this in a box and not in a plastic bag. The pan came with scratches all over the entire pan.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Rezsonya",
      "helpful_votes": 2,
      "publication_date": 20200508
    },
    {
      "title": "Best Bundt pan ever",
      "text": "I love to bake on a regular basis and I was looking for a high quality pan and this was it! Cakes bake evenly and release from pan with no problem (I use cooking spray). This pan is sturdy and cleans up super easy! I love it - i even bought some other baking pans from this company as well and they are all good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Cmospin",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "USA BAKEWARE Is the best out there",
      "text": "Love anything made by USA BAKEWARE. Nice heavy study pan! Will not warp , baked evenly, cakes come out easily, easy to wash. Will not rust. Will last a lifetime! I also have their large lasagna pan that I live also . Would highly recommend any of their products. Easily gift-able",
      "rating": 5.0,
      "verified": true,
      "author": "beauti4ash",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great pan, even for novice baker",
      "text": "I’m new to baking, learning how so as to add variety to our keto diet. My favorite keto blogger highly recommends USA pans, so I spent the extra dollars and bought this pan. So glad I did! This is my first Bundt cake, and only second cake ever. It came out perfect; cake surface intact and perfectly smooth, and pan was completely clean. Money well spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff in Georgia",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Fabulous pan",
      "text": "I make a very dense pumpkin cake that I have never been successful in removing in one piece. This cake slid out beautifully in one piece. USA pans are the best! I also have the large muffin pan and plan on replacing all my pans as I can afford to.",
      "rating": 5.0,
      "verified": true,
      "author": "Meadows Mom",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Awesome pan!",
      "text": "This is an awesome bundt pan. I ordered it because the cakes I baked in my previous bundt pan would often stick. I've made several pound cakes in this pan and have never had a problem with sticking. In fact, my granddaughter wanted my recipe so I sent her a pan to make in, too. She loves it as much as I do.",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie Pagliai",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "This Bundt pan makes beautiful cakes and cleans up so easily!",
      "text": "I love this Bundt pan! I was really surprised at the quality of the metal and how sturdy it was. The first thing I made in it was monkey bread. It really helped keep the form of the dough, and even with all the sticky caramel inside, clean up was a dream. It has a wonderful non stick surface, and I would definitely recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Vazquez",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Best Bundt pan !!!",
      "text": "Wow ! I've been at a disadvantage using the bundt pan I've had for years, and didn't know it. This pan is durable and well crafted. My blueberry cake came out flawlessly and without any effort on my part. I did lightly grease the pan with crisco, no flour, and let the cake cool briefly. The cake was evenly cooked, delicious, and perfectly shaped. Clean up was a breeze as there was not even a crumb of cake left in the pan. This company should be proud of themselves for a very well made USA product that does a fantastic job !",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Cake came right out!",
      "text": "Based on my first time using this pan, I am satisfied. My other cakes were sticking in certain places. After cooling 10-15 minutes, it turned right out without any problems. I was skeptical of not using any oil so I buttered and floured as usual.",
      "rating": 5.0,
      "verified": true,
      "author": "Bondgirl6",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "I love these USA pans!",
      "text": "This isn't my first USA pan, and it won't be the last. They're great. My cakes and breads come out easily thanks to the nonstick coating.",
      "rating": 5.0,
      "verified": true,
      "author": "Smart Shopper",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Always Pleased",
      "text": "This was a good purchase. The cake pan is just what you want it to be, well made, sturdy, and easy to clean. Cake comes out of pan easily and I am glad I made this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Suntime",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Best brand baking pans I have found",
      "text": "Changing all of my baking pans to the USA pan brand. They are all great and clean up is super easy. I feel my baked goods are better in these pans.",
      "rating": 5.0,
      "verified": true,
      "author": "Wizard50",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Mmmmm Good",
      "text": "Sent to my granddaughter. She loves it and can't wait to to use it. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Lanore",
      "helpful_votes": 2,
      "publication_date": 20180607
    },
    {
      "title": "Better angels food cake 😇♥️",
      "text": "Finding a bundt cake pan with the right design and price are found in this item. Your protein molecules in your cakes will love climbing your pan and taste buds with this invaluable kitchen pan!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Sutherland",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Poorly made bundt pan",
      "text": "Do not purchase. This bundt pan is terrible discolored. Sending it back. For a product that claims it was made in USA, is a huge disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeanne Marie",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "USA products are Great!",
      "text": "All the USA baking pans I bought were great, they cook evenly and they clean easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great pan!",
      "text": "I LOVE this pan! It was a replacement for an old pan and it’s everything I expected and more. My cake dropped out of the pan after cooling. The weight is amazing. I don’t need two but if I did , I would certainly buy another of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Excellent pan for baking!",
      "text": "I absolutely love this pan!!! Everything comes out wonderfully! A must have in the kitchen. I needed this pan years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "mnloonatic",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great cake pan ever",
      "text": "This is the best cake pan I have ever owned. Cleans very well, very study. Cakes cook evenly and cakes releases easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl Farrier",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "worth the price. very sturdy and build strong",
      "text": "My cakes and molds always cook perfect with the pan. never sticks and easy to clean. Strong made.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaleo ",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "The best pan ever",
      "text": "Possibly THE BEST pound cake pan I've ever purchased. I've had a cake business for 8 years now. This is like heaven! I'll be buying more!",
      "rating": 5.0,
      "verified": true,
      "author": "S to C Delights LLC ",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Love to bake!",
      "text": "I'd bought one of your bread (loaf) pans and loved it, so when I needed a new Bundt pan, I went back to your products. I love to bake and do it often and your products are awesome! Thanks and so happy they're made in the USA!!",
      "rating": 5.0,
      "verified": true,
      "author": "GrandmaBecks",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "No more Pound Cake Blues",
      "text": "I used this pan for pound cakes. I used a Nordic Ware anniversary pan and no matter what I did it stuck. No more anxiety with this pan. I lightly crisco the pan and lightly flour the pan. I let the cake cool 5 minutes then turn it over and let the pan sit on the cake 5 more minutes. The cake is Perfect!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosey",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Well made.  Good value",
      "text": "Cakes slide right out. This pan is so easy to clean. I do use a light spray of Pam.",
      "rating": 5.0,
      "verified": true,
      "author": "beverly",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Totally stick free!",
      "text": "Bundt cake pans tend to hold a cake hostage. I've only used it once so far, and the cake released from the pan with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Buzz",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Perfect chocolate Bundt cake",
      "text": "I bought this because it’s made in the USA. My bundt cake came out beautiful. First time using it today. I wiped the inside with small amount of oil. Once it cooled I turned it over and 10 seconds later out it came! It. It looks perfect! I would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Great  Nonstick Fluted Tube Cake Pan",
      "text": "I love this tube cake pan. It is sturdy and easy to clean. It just feels good to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Newport5",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Nice pan",
      "text": "It fits the plastic case I bought, so I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "AliKatzzz",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Treat yourself, you’ll be glad you did!",
      "text": "Top of the line, and made in the USA! Totally worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "sage ",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Top Quality!",
      "text": "Love the quality of this bundt pan. Very sturdy and cake comes out easily. Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 3,
      "publication_date": 20171026
    },
    {
      "title": "Love this pan!!",
      "text": "Was easy to use, cake came right out - no spraying or flour, clean up in a minute. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl C",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Bundt Jello Mold",
      "text": "I used this pan as a cranberry salad mold. It worked well.",
      "rating": 5.0,
      "verified": true,
      "author": "John Atkinson",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Love it",
      "text": "This pan is non-stick. It's made of heavy duty material.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Works fine.",
      "text": "Wife made monkey bread in this and it worked fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan_L",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Five Stars",
      "text": "love USA Bakeware products. Sturdy. do not warp or crack. cleans easily",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie P",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Bakes the best pound cakes!",
      "text": "Loved this brand of bakeware and it was great for baking pound cakes from scratch.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Robinson",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great quality but came with many scratches",
      "text": "Let me just say it’s an amazing pan, the quality is excellent, however when I received this pan there were so many scratches which was a big disappointment because this pan was purchase for my mother-in-law as a gift, I must return and get a another 1",
      "rating": 5.0,
      "verified": true,
      "author": "Nikesha sherwood",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Happy!",
      "text": "Used this pan the day it was delivered. Cake slipped out just as advertised. Can’t tell you how many pans I’ve used in the past that have failed. This is by far the best",
      "rating": 5.0,
      "verified": true,
      "author": "Online shopper",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Love, love, love this pan!!",
      "text": "I absolutely love this pan! I use oil and flour in the pan and my cakes are beautiful. The handles make it so easy to turn the cake out. And, the best part, it is made in the USA!! I ordered a second pan for my mother, and plan to gift more.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie Tucker",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Bulletproof!",
      "text": "I read reviews from a lot of people that this was super sturdy, but whoa! They weren't kidding! This thing will never warp. Love it! Works awesome and great with nonstick!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Wright",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "It's well made.",
      "text": "If I/or someone else needed this type of pan I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "cakelover",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Cake stuck to the pan",
      "text": "I bought this based on all the reviews, but my cake stuck to the pan. I washed the pan, greased and floured it, and part of the cake stuck when I removed it from the pan. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Diane Smith",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Perfect bundt pan!",
      "text": "Love this pan! Looked at more expensive options but this had better reviews. I wish I had taken a picture of my cake, it came out perfectly, no sticking at all after greasing and flouring the pan. The cleanup was easy and the pan is sturdy!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Pierce",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Amazing. Say goodbye to greasing!",
      "text": "I've tried three recipes now, which all called for 'heavy greasing.' I took my chances and simply poured the batter straight into the pan and wow- not even a crumb got stuck. Extremely sturdy and so easy to clean!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Do Yourself A Favor!",
      "text": "Buy this pan! I have cooked countless cakes in mine and have never had a problem. Just spray with Baker’s Joy and the cake literally slides out. Clean up is a breeze. Love, love, love this pan!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherian A. Davis",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Buy now!!!",
      "text": "Been cooking for 58 years, best pan I’ve ever used!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Great pan",
      "text": "Great pan, exactly what I was looking for. Not too heavy and not too thin. The cake comes out perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Cake does not stick!",
      "text": "This is the most wonderful pan I have ever used. My ake comes out perfect every time. Love it 😍!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine V. Amoroso",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Great Pan",
      "text": "This is a heavy pan. It bakes really nicely and is super easy to wash. I use spray to prevent sticking and in combination with it's surface have had fabulous results. I would definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "bulgingbookshelf",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Sturdy",
      "text": "It's not as non-stick as I would have hoped, but it is very sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Easy to use and fun.",
      "text": "I love this. I’m not a cook. This pan is so easy to use. I’ve been making Bundts every week with eith it. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Lee Caruso",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Excellent Bundt Pan!!",
      "text": "Excellent product. Used it this past weekend. Heavier than I thought it would be, so very sturdy. Cake slid right out.",
      "rating": 5.0,
      "verified": true,
      "author": "WayneL",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Would buy again!",
      "text": "Every time I've made a bunt cake, they have come out so clean that I am sold on this brand and have ordered more pieces, Really nice bakeware!!",
      "rating": 5.0,
      "verified": true,
      "author": "MSummers",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "LOVE",
      "text": "I just received this pan and it is beautiful and very solid. It has some weight to it. I am making monkey bread now for my family",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Performs as advertised!",
      "text": "My cakes pop out effortlessly with this pan. Absolutely love it! I've since ordered their muffin pans as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy W.",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Best bundt pan",
      "text": "Absolutely the best bundt pan ever. My cakes never stick, gold brown exterior",
      "rating": 5.0,
      "verified": true,
      "author": "Valencia",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Perfect bunts pan",
      "text": "Great pan. Heavy so it bakes evenly and cakes never stick to the sides. My favorite bundt pan ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Parke",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Perfect and pretty!",
      "text": "Easy to clean with a little cooking spray added before baking. Super sturdy and good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Great!",
      "text": "Just what I thought it would be. Best pan ever. Just like the other USA items.",
      "rating": 5.0,
      "verified": true,
      "author": "davide",
      "helpful_votes": 3,
      "publication_date": 20170721
    },
    {
      "title": "Highly recommend this cake pan",
      "text": "Very good cake pan none of the cakes I made so far have stuck in the pan they come right out.",
      "rating": 5.0,
      "verified": true,
      "author": "wayne m",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Good pan for sure",
      "text": "Cake came right out of the pan cleaned up so easily I'm really glad I got this pan",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Product is not in new condition",
      "text": "The product came not in new condition look like renew product, but I have to pay with new product price.",
      "rating": 1.0,
      "verified": true,
      "author": "Tu T.",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Best cookware ever!",
      "text": "This is the best cookware I ever found. No surprise, built in America!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Bruneau",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Perfect bake!  There is definitely a difference using good quality bakeware.",
      "text": "Death by chocolate cake was perfect! I’m very happy with my selection.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmie Bruner",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Very happy purchase",
      "text": "Love the look of it. Have not use it yet but I'm sure it will come out just as I like.",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 3,
      "publication_date": 20180227
    },
    {
      "title": "Love these USA Pans",
      "text": "Love these USA Pans!!! I have baked many Lemon cakes in this pan and they never stick. I don't use spray of oil to grease this pan. It's coating is perfect. Loved it so much I bought another one for my daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 9,
      "publication_date": 20180108
    },
    {
      "title": "Heavy duty and beautiful, but a bit marked up",
      "text": "I’ve purchased two baking sheets from USA pan. They are sturdy and well made, so I ordered this beautiful bundt pan as a gift. The pan arrived with the pictured blemishes on the bottom of the pan. I’m told they won’t affect the use of the pan, though I am a little concerned about one spot where the finish seems worn off. Since nothing should affect how it functions, it wasn’t technically damaged, and my recipient wasn’t bothered by the marks, I chose to keep it. I’d likely buy again — I think the company makes quality products, and this pan is solid and stout feeling. The interior appears blemish free, easy to clean, and perfect for a gorgeous cake.",
      "rating": 4.0,
      "verified": true,
      "author": "WiredNightOwl",
      "helpful_votes": 3,
      "publication_date": 20181228
    },
    {
      "title": "The only Bundt pan you'll ever need!",
      "text": "NOTHING will stick to it! This is my second rum cake and I used Baker's Joy on the first one, but not on this one. Came out just as clean! Check out those edges! Perfect! The pan isn't light weight, but not as heavy as cast iron, just sturdy. It cleans up like a dream. I will have this pan for years! I also love every other USA Pan company product I own. They're high quality and made in USA I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "DianaB",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "I am a Bundt cake master now",
      "text": "I didn’t think I could ever master the art of a Bundt cake. After trying with different pans and techniques, I decided to bite the bullet and spend a little extra on this pan. My thought was if I couldn’t master the art of Bundt cakes with this pan, I’d hang up my apron and stick to baking cookies instead. I was pleasantly surprised I am now a Bundt cake master. The cake came out evenly baked and with ease. The pan was easy to clean too (bonus)!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly G. Dugay",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Cake doesn't stick and even baking! Perfect!",
      "text": "We haven't been big bundt cake bakers in the past because they rarely came out as well as we would like. We have USA Pan cake pans we recently bought and they have been great so we bought this bundt pan to see if that helped. We have baked 4 different cakes and each has came out just great. The cake rises and bakes even and best of all the cake releases easily and completely from the pan. Easy cleaning with soap and water.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin B",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "THE Best pans ever made",
      "text": "Quality all the way. Keep them nice by drying them thoroughly after each use. Honestly, you don't even have to wash them. Just wipe them clean with a soft cloth or wet paper towel and they are good for the next use. Love these pans and have used them for a lot of years. Won't waste my money buying anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Made in the USA",
      "text": "I am loving this pan so far. Made pound cake in it the other day. The cake come out perfectly. Clean up was very easy. The main thing I love is it is made in the USA. I try not to buy from out of country but it's not easy. So glad I bought this and will be buying more USA pans in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "January 19",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "The best",
      "text": "You get what you pay for , It’s heavier ,cakes come right out,I have had cheaper ones before, and the cakes didn’t come out easily. I love this one and highly recommend this cake pan. I have used it about ten times so far and the cake still slides right out, like the first time. And cleans up very easily",
      "rating": 5.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Another winner from USA Pan",
      "text": "Fantastic. I had an old Teflon coated Bundt pan which never turned out perfect cakes. This pan is amazing. Completely even baking. A little bit of browning/caramelization for a slightly toothsome outside edge. Every pan I have from USA Bakeware is the best quality, and this is no exception. I should have gotten it years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy in Chicago",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Bundt cakes come out easily!",
      "text": "And for anyone who bakes bundts, you know that's almost never the case! This pan does the trick. I've made several cakes (I have my own small dessert biz) and for the first time ever, my bundt cakes come out each and every time without a hitch. I would have given it a 5th star, but for the fact that after a few uses the top part of the pan is showing some stains. Not a big deal really.",
      "rating": 4.0,
      "verified": true,
      "author": "MaryLeeM",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Marvelous product for bundt cakes and it is nice and heavy to allow even baking",
      "text": "Marvelous product for bundt cakes and it is nice and heavy to allow even baking. Yes, I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Williams",
      "helpful_votes": 4,
      "publication_date": 20170430
    },
    {
      "title": "I would 100% recommend this pan",
      "text": "I would 100% recommend this pan. I would also recommend all \"USA\" bakeware. I am replacing all my bakeware with this brand. It is par excellence.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171129
    },
    {
      "title": "USA pans are the best! Will use nothing but from now on",
      "text": "USA pans are the best! Will use nothing but from now on! No sticking with any food items and I do not use grease or flour beforehand.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Lewis",
      "helpful_votes": 2,
      "publication_date": 20180524
    },
    {
      "title": "Perfect Pan for a novice baker",
      "text": "Perfect pan. I am not a baker and always hold my breath during the confection extraction process. This pan made up for my lack of skill in this dept. would def by from them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie's Kids",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Bakes evenly, never sticks",
      "text": "USA Pans are the best for even, never stick baking. No more \"mush in the center, burned at the edges. At this point, we wouldn't use anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "David Powell",
      "helpful_votes": 2,
      "publication_date": 20180610
    },
    {
      "title": "Good Baking Pan!",
      "text": "I needed a larger cup bundt pan for pound cakes. This is a brand I was not familiar with, but it handled a 12-cup cake with no problem. No overflow and no left over batter. Will probably get another one in the holidays. Also, this pan has good weight to it, but not too heavy. Distributes heat well.",
      "rating": 5.0,
      "verified": true,
      "author": "theladytee",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Bundt pan",
      "text": "This is a nice, heavy pan. I've only made one cake in it and it cracked when I tried to take it out but that might be because I used spray Pam for baking instead of shortening and flour.",
      "rating": 4.0,
      "verified": true,
      "author": "Nancy Miller",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "I only buy USA Pans",
      "text": "Although I have not used this particular USA pan, I know I will be delighted with its performance. Since I discovered USA pans, I will only purchase their pans.",
      "rating": 5.0,
      "verified": true,
      "author": "RHM",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "I LOVE IT!",
      "text": "I finally replaced my 45+ year old bundt pan. This Nonstick Fluted Tube Cake Pan is WONDERFUL! This is made much better than my previous. one.",
      "rating": 5.0,
      "verified": true,
      "author": "Dimples 22",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Definitely the best pan I have ever had",
      "text": "Definitely the best pan I have ever had. A fabulous product made in the USA, and it stands up to the advertisement the company states. I can’t wait to purchase something else from them.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy",
      "helpful_votes": 5,
      "publication_date": 20170604
    },
    {
      "title": "Worth the price you pay",
      "text": "Great pan! I was in need of a bigger bundt pan and this was it. Cake came out perfectly, used Baker's Joy as always. This is a hefty pan with some weight to it. This is my third USA Pans product and I'm sure it won't be the last.",
      "rating": 5.0,
      "verified": true,
      "author": "S Dot",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Excellent product",
      "text": "Very good item ,I bought so many expensive Nordic cake pan, I wasn’t happy , always I had problems . But I am so happy with this pan . Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "fsassani",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "My wife wanted",
      "text": "My wife wanted this bundt pan. I bought her other bakeware from USA pans and she really likes those. This bundt pan is definitely sturdy and the first cake out was perfect. Will buy more from USA Pans.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Solidily built will last your life time",
      "text": "it bakes, solid structure. it will last your lifetime and possibly your kids lifetime too. It is truly non stick used it and cake flips out no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "The Lopez Family",
      "helpful_votes": 0,
      "publication_date": 20190730
    }
  ],
  "product_meta": {
    "title": "USA Pan Bakeware Nonstick Fluted Tube Cake Pan, 10-Inch, Aluminized Steel",
    "description": "Size:10-InchThe USA Pan fluted tube cake pan measures a full 10 inches in diameter x 3 3/4 inches deep. The unique shape and design of the fluted tube cakes allows for cakes that come out the perfect shape and texture. With a patented Americoat plus non-stick coating, the USA Pan Bundy cake pan allows for easy clean-up and truly effortless release of your baked items. Americoat plus is PTFE, PFOA, and BPA free. Every USA Pan is made in the USA from globally sourced materials and has been designed with the same standard High performance features that commercial bakers enjoy including Aluminized Steel and heavy gauge steel construction that allows for even heat distribution and maximum service life. USA Pan fluted tube cake pan's unique fluted surface design facilitates air circulation and also maximizes pan strength, which helps to resist warping. USA Pan professional grade bakeware helps everyday home bakers produce professional grade baked goods. USA Pan bakeware is long-lasting, durable, reliable, and comes with a limited lifetime . USA Pan is a Bundy family owned company, based in the greater Pittsburgh, Pennsylvania area that has been producing high performance bakeware for over 50 years. Dimensions represent baking surface, not overall pan size. Made in USA.",
    "rating": 4.8,
    "feature_bullets": [
      "Perfect for your fluted tube cakes, pound cakes and ring cakes that bake evenly and taste great; heavy gauge Aluminized Steel that is commercial grade",
      "USA Pan baking pans feature Americoat which promotes quick release of baked-goods plus fast and easy clean up; wash with hot water, mild soap and gentle scrub brush or sponge",
      "Nonstick Americoat coating - a patented silicone coating which is PTFE, PFOA and BPA free - provides quick and easy release of all baked-goods and minimal easy clean up",
      "Every USA Pan has a limited Lifetime ; made in the USA from globally sourced materials",
      "USA Pan is a Bundy family company which has proudly manufactured high quality bakeware and provided jobs in the USA for over 50 years"
    ],
    "specifications": {
      "Manufacturer": "USA Pan",
      "Part Number": "612864-1087FT",
      "Item Weight": "1.7 pounds",
      "Product Dimensions": "12 x 10 x 3.75 inches",
      "Item model number": "1087FT",
      "Is Discontinued By Manufacturer": "No",
      "Size": "10-Inch",
      "Color": "Aluminized Steel",
      "Material": "Steel",
      "Shape": "Ring",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Certification": "",
      "Included Components": "One nonstick fluted cake pan",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Limited Lifetime",
      "ASIN": "B06XWJ2K7B",
      "Customer Reviews": "4.8 out of 5 stars496 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#7,064 in Kitchen & Dining",
      "Date First Available": "March 28, 2017"
    },
    "categories": [
      "Cake Pans",
      "Home & Kitchen",
      "Specialty & Novelty Cake Pans",
      "Bakeware",
      "Kitchen & Dining"
    ],
    "price": 24.99
  }
}