{
  "website_summaries": [
    {
      "verdict": "A luxurious mask for a variety of soothing and purifying needs.",
      "pros": [
        "Works for spot treatments, masks, or as a daily cleanser",
        "Rich in minerals",
        "Cleans and minimizes pores without leaving skin dry or pores clogged",
        "Leaves skin feeling softer and smoother"
      ],
      "cons": [
        "Not all customers love the scent"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Leaves your skin soft and clean",
      "text": "I bought this for my 16 year old son after a friend recommended it to him. We have both used it and like it. Other masks I have tried made me feel like I could be damaging my skin because they pull so much when they are removed. This one definitely clears out your pores and leaves your skin feeling clean and soft without being uncomfortable to peel off.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer G",
      "helpful_votes": 123,
      "publication_date": 20170530
    },
    {
      "title": "Great stuff!",
      "text": "Bought this for my husband and me to use for our \"spa night\" at home and they worked amazingly! We both kept it on for 60 minutes and then rinsed our feet really well afterward. I started shedding a few days before he did, but we both had so much dead skin just peeling right off in 4-7 days; it was fascinating and gross at the same time! Definitely wash your feet well before you apply this mask. (If you have any lotion on your feet, it won't work very well.) Also, don't forget to moisturize your feet really well after your skin starts peeling; they'll stay softer for longer that way!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruch",
      "helpful_votes": 17,
      "publication_date": 20180206
    },
    {
      "title": "This masks works great, but make sure to open your pores with ...",
      "text": "This masks works great, but make sure to open your pores with hot water to get the best results!",
      "rating": 5.0,
      "verified": true,
      "author": "C.Nyckol",
      "helpful_votes": 29,
      "publication_date": 20170418
    },
    {
      "title": "I can definitely say we like it. It's only been a day and I've ...",
      "text": "I've been wanting to try a foot peel for a long time now. I was skeptical because I'm diabetic. But I bought this one and another one for my husband. I can definitely say we like it. It's only been a day and I've noticed a slight difference. I wore socks over it because I'm allergic to tapes so I didn't use the tape. It did leak a little but not much. I plan to buy some more and wanted to share the review for others who are skeptical from being diabetic. Also the smells were crazy strong wither.",
      "rating": 5.0,
      "verified": true,
      "author": "justin kielbon",
      "helpful_votes": 4,
      "publication_date": 20180508
    },
    {
      "title": "My 40yo feet were pretty course and scratchy",
      "text": "I'm not the pampering type but decided to give this a shot. My 40yo feet were pretty course and scratchy. Someone suggested a product like this. It works. I did a 45 minute soak, put on the booties, covered them with socks and sat for 30 minutes. No pain, no chemical smell, easy to clean up after the booties were removed. A couple days later, skin started shedding. I then soaked my feet again and took a callus remover to expedited the skin shedding. My feet are a lot smother than they were. I did get this at a discount, but that did not bias my review.",
      "rating": 5.0,
      "verified": true,
      "author": "Gshul512",
      "helpful_votes": 2,
      "publication_date": 20180617
    },
    {
      "title": "Lavender scented",
      "text": "I am on my feet a lot so they get abused and neglected. These foot peels are great. I used them a couple weeks before a weekend out with the girls. Sat with them on for an hour. Rinsed and waited. About 5 days later my feet started peeling. A couple more days and i had soft beautiful skin on my feet that made walking around barefoot no problems at all. This comes with 2 pair of booties so I can do it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Smurfmisfit",
      "helpful_votes": 2,
      "publication_date": 20180605
    },
    {
      "title": "Pretty Bad, just Dip your foot in acid - cheaper",
      "text": "I tried this brand instead of another one out there that I used last time. This one is kind of bad compared to it. Just messy and VERY SLOW. You have to cut the booties in half yourself and peel the stickers off to “close” them when you are first starting the peel. My stickers wouldn’t come off properly, so I literally just duct-taped them closed. After the allotted time, I took them off and I am just beginning to peel after I used this product 10 days ago.... I would use a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Maureen Dwelley",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Thought it’d be more fun.",
      "text": "It worked. Just not how I thought. I didn’t get any sheets of skin. It just seemed to dry out my feet and then it all just fell off in chips. If I took off my socks, dry specks of skin would go flying everywhere. Kinda gross. Now, my feet were in pretty bad shape. Maybe because they were so bad, that’s how it works? I don’t know. But my feet are much smoother. I tried to get pictures but it was too hard to see. I would do this again.",
      "rating": 4.0,
      "verified": true,
      "author": "Loves_2_read",
      "helpful_votes": 3,
      "publication_date": 20171128
    },
    {
      "title": "Works! Don't forget to soak!",
      "text": "This stuff is magical. I used it once, then soaked my feet as directed for the next few days. The first 2 days my feet looks tight and shiny. The peeling began around day 3, and last for about 5 days (accelerated because I was helping it along!) My feet lost a few layers of callus, which was awesome. Didn't totally remove the big callus under the ball of my foot, nor the corns on my toes, unfortunately. but it did lessen them.",
      "rating": 5.0,
      "verified": true,
      "author": "monique18",
      "helpful_votes": 2,
      "publication_date": 20180227
    },
    {
      "title": "SO GROSS BUT SO GOOD!!",
      "text": "ok, first of all: it's works!!! I left them on for 90mins, I just put them on and watched a movie ;) rightvafter that you would not see anything different, you are going to start feeling your feet weird in about two days! Then the third day your feet will start peeling heavily: ITS SUPER GROSS, a bit disgusting but HEY that's why we spent our money on this, you get what you want, a peeling feet mask! Enjoy! I decided to not took any picture because it's nothing nice to see ;) But I'm definitely happy with the product!",
      "rating": 5.0,
      "verified": true,
      "author": "Judee Loud",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "Great for stubborn feet!",
      "text": "3rd day I started to see my feet peel and it was fascinating. I tried my best to remind myself to soak my feet and it works. I always had problems with feet feeling like they are in need of a pedicure. I'd recommend this. Comes with two and I'm ready for the next one by the end of this season. Glad I got this before summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica V.G",
      "helpful_votes": 4,
      "publication_date": 20180426
    },
    {
      "title": "Doesn't peel all the way",
      "text": "I hoped this would make my feet baby soft... This stuff dries your skin out and then the skin is supposed to peel/fall off but no. I did this about 3 weeks ago and all the skin didn't peel/fall off. The parts that did peel off aren't any softer than before and the parts that didn't are extremely rough, dry and cracked.",
      "rating": 1.0,
      "verified": true,
      "author": "Lena",
      "helpful_votes": 4,
      "publication_date": 20180124
    },
    {
      "title": "READDD!!!",
      "text": "BEWARE! This product does work BUT, not just the bottom of your feet will peel. If you put the whole foot mask on, your whole foot is going to peel. This means the top of your foot, your toes, in between your toes, all the skin around your toe nails ect EVERYTHING. Next time I'm going to cut the wrap enough just so it gets the skin on the bottom of my feet. Otherwise, this foot mask is LEGIT!!",
      "rating": 4.0,
      "verified": true,
      "author": "Cwooooo",
      "helpful_votes": 2,
      "publication_date": 20170920
    },
    {
      "title": "WORST CUSTOMER SERVICE REP! Product didn't work!",
      "text": "I wish this item worked for me I have some bad callus and this is so much cheaper than going to a salon. I followed the directions to the T and nothing ended up happening I was so disappointing. I even attempted to reach out to the company and needless to say I received the most rude email I have gotten. The sender from the company basically called me an idiot saying I didn't follow the instructions like I was suppose to. I was so disappointed in the company and don't think I will be purchasing anything again solely based on the rude representative.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Bouet",
      "helpful_votes": 8,
      "publication_date": 20180218
    },
    {
      "title": "Chemical burns",
      "text": "Do not, I repeat, do not buy this product. I have tried other foot peeling masks in the past with no issues. I am currently serving overseas and desperately needed a foot peeling mask seems as I wear boots all day, every day. Like I said, I have NEVER had issues with other foot masks. I followed the instructions as directed and the results are devastating. I have chemical burns on both feet and can barely walk. I am not sure if it was just a bad batch. I would have been disappointed if I didn't see results. But to have chemical burns from it is completely unacceptable.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181003
    },
    {
      "title": "This WORKS!",
      "text": "I have average crusty feet, not too bad so I was skeptical on leaving this on for the full hour and a half. I left it on for an hour. Then I forgot I used it and two days later I looked down and to my amazement my toes were peeling and it only got worse from there. I had small baby like peels but this definitely worked for the most part. I was not aware I had dry skin where it was peeling! My hard callouses we’re not affected but I will be leaving the next one on for the full amount of time.",
      "rating": 4.0,
      "verified": true,
      "author": "Hailey L.",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Everything peels!",
      "text": "Worked after soaking my feet for 90 min. Then dry. Then booties for 90 min. Then rinse and dry. 4 days later they were peeling but not in big pieces. I have to admit even the skin between my toes peeled and the last product I used did not do this. You get 2 pairs of booties. I will totally order this again. But I would recommend soaking your feet daily after the initial treatment, so you can get a better peel.",
      "rating": 4.0,
      "verified": true,
      "author": "Megan D",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "This was easy to peel off and took off nothing with it",
      "text": "I have no idea how this has so many 5 star reviews, but I purchased this product because of them. It doesn't work AT ALL. Other black masks I've used really firm up and are usually difficult to remove, but you can feel the blackheads being removed from the skin. This was easy to peel off and took off nothing with it. It was a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "bookgirl582",
      "helpful_votes": 6,
      "publication_date": 20170422
    },
    {
      "title": "This stuff works great it, I suffer from blackheads bc of my ...",
      "text": "This stuff works great it , I suffer from blackheads bc of my line of work and this stuff helped me get my skin cleared again",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar sanabria",
      "helpful_votes": 16,
      "publication_date": 20170418
    },
    {
      "title": "Save your money",
      "text": "Doesn't work, it's so thin the consistency and doesn't pull anything up. Biore black head remover strips work way better then this product. Very Dissatisfied",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 5,
      "publication_date": 20170507
    },
    {
      "title": "My two pack was a one pack.",
      "text": "I bought this last April, thinking I was saving a little money over the real thing - ie. Baby Foot. It took me several months to get around to opening it... and, only one pack was in the box. I got ripped! Boo.",
      "rating": 2.0,
      "verified": true,
      "author": "Bobby's Girl",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "Would Use Again",
      "text": "This really does work. I soaked 90 min prior to applying, and again 30 min a couple days later. The only cautionary tale I have is to be mindful as to when & where you'll be barefooted. 2 days later, part way thru my yoga class I looked down & noticed my mat covered in skin! Looked like a leper!",
      "rating": 5.0,
      "verified": true,
      "author": "TL Miller",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "Better than expected",
      "text": "It worked as advertised, which I wasn't really expecting it to. It made the skin on my feet peel like in the pictures and thankfully, my feet didn't burn off or anything. Since there are mixed reviews on these kinds of things, I was worried that they would be harmful or something, but they weren't. I can see how someone with sensitive skin might have an adverse reaction to these though, but that is not necessarily a fault of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Historia",
      "helpful_votes": 2,
      "publication_date": 20180813
    },
    {
      "title": "Don’t use before a major event",
      "text": "This product works but it take at least two weeks for the shedding to be completed. Your feet will be raggedy and ugly for two weeks. The chemicals used to get soft feet is very strong. You can taste it in your mouth when soaking your feet. Just get a foot file and call it a day. It’s not worth it but it does work at a cost.",
      "rating": 3.0,
      "verified": true,
      "author": "PrimeAddict ",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Great foot exfoliation",
      "text": "This product works great. A second application may help to remove my foot callouses more thoroughly. After about 2 days I hadn't seen any peeling really. I soaked my feet in hot water for about 30 minutes and the next day my feet started to peel a lot! I still had some foot callouses afterwards, but it worked very well overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaitlin McRoberts",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Not good",
      "text": "I’m giving this mask two stars because it is awful to use. Very thick and gooey, takes forever to dry (an hour in hot dry Los Angeles). When you peel it off mostly it just takes all the tiny little hairs. Might get little blackheads but does nothing for small, under the skin zits. I will stick with a clay mask.",
      "rating": 2.0,
      "verified": true,
      "author": "redhawk",
      "helpful_votes": 2,
      "publication_date": 20180713
    },
    {
      "title": "Works but is kind of weird",
      "text": "So I've used both that came in the package now and it really does work but it's a bit yucky as the peeling happens over more than a week. It would be great to help the process along as I'm self-conscious wearing sandals during the peeling process. And be prepared to clean up all the dead skin lol.",
      "rating": 4.0,
      "verified": true,
      "author": "angmoore",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "It works",
      "text": "It works. I didn't have large portions of skin peel off, so there was a lot of extra work to do on my end. First time I did 60 min, 2nd time around I did 90 and it seemed to work a bit better. Peeling started about a week in for both. My heels are bad, like pilling on my bed sheets bad. This worked to help smooth my heels a lot",
      "rating": 4.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Great Product!",
      "text": "I was a little hesitant about purchasing this product, but any doubts that I had were quickly erased. This is a great product! It's inexpensive, easy to use and didn't take long to see the results. I used it as directed, soaked my feet everyday for 25-30 minutes, 7 days straight after the 48Hour period (I also used a pumice stone to gently scrub the dead skin cause I couldn't stand the peeling), and used a light heel moisturizer. My pictures were taken every other day, but you can see enough to get the point overall. I have no complaints and I will definitely be using it again if needed (hopefully not ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Brittney J. ",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Not the best",
      "text": "It makes your feet itch like crazy, and the skin kind of flakes off instead of peeling. Not very effective.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180628
    },
    {
      "title": "Great",
      "text": "I was skeptical when looking at these types of products, but this one really works. It does take some time for the skin to start coming off and it really helps to soak your feet everyday like the package says. The only thing is it is kind of gross when you wear the booties, real squishy.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie Asselin",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Great for at home pedicures",
      "text": "I love these! I and my husband have used these many times and they always make your feet so soft and smooth! If your feet are rough I’d use both sets but with a month or so in between once your feet have stopped peeling. Smell isn’t bad and it’s relaxing.",
      "rating": 5.0,
      "verified": true,
      "author": "Alayna",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "having a lot of blackheads myself thought it would be good to try this out",
      "text": "I've seen a lot of people trying this on social media and how it works really well and gets rid of all your blackheads. I, having a lot of blackheads myself thought it would be good to try this out. I ended up buying this more expensive one because it had better reviews. I can only say I was very disappointed. The first time I tried it, I thought maybe I didn't open up my pores well. The second time, I applied it after a shower and had the same result. Both times it got close to no blackheads. It didn't hurt either like most people claimed. This was not worth it and I do not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Peeling and good scent!",
      "text": "Update:do soak afterward! The soak is really helping the peeling! At first it only peel a little bit, after soak it peels half of my foot! I used a lot of foot mask before, only this one and the baby feet one really giving the peeling results! This one need cut open the pack and wash it off after the masking. The scent is good not too strong. I always wear socks outside of the mask its comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "louis",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "It worked, but...",
      "text": "It works, but be prepared to be really uncomfortable for a week or so. If you've ever had really dry skin, imagine that times 10. My feet were SOOO dry and tight. They felt like a brillo pad when it started peeling and it did NOT come off in huge chunks...more like tiny little pieces. Sure, after it was finally done my feet were soft for a week or two. Not worth it to me. I'd rather have gnarly feet.",
      "rating": 3.0,
      "verified": true,
      "author": "mandican",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Would not recommend this product",
      "text": "The chemicals started burning my ankles within 5 minutes of putting them on, so they had to be taken off. I had to throw the other pair away. Took over a week for the burns to clear up. Have used other foot peeling masks in the past with no problem. Would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Cara J. Akridge",
      "helpful_votes": 3,
      "publication_date": 20180308
    },
    {
      "title": "It removed nearly all calluses with one application",
      "text": "I have calluses on both feet and this removed nearly all of them with one application. When showering, I plug the drain, so that my feet soak. I did not ever experience the large peeling that others describe, but it worked just the same.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Shopper",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Best mask ever!",
      "text": "This is the best mask I've ever tried! It leaves my skin clear and smooth, with a beautiful soft shine. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew S.",
      "helpful_votes": 15,
      "publication_date": 20170418
    },
    {
      "title": "Doesn't work as good as Baby Feet brand",
      "text": "This was ok, I was hoping it would be as good as the more expensive Baby Feet brand but it didn't quite have the same effect. The results don't last long either. Next time I will just spend the extra money.",
      "rating": 3.0,
      "verified": true,
      "author": "Katie Drewry",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "This is the best!",
      "text": "My mom told me I needed to get an exfoliating foot peeling mask. I am absolutely obsessed with it now. It works so well. I keep my feet nice and they don't get really dry, but this made feet so soft. It's a 2 pack, but you want to wait at least 4 months until you do it again.",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Exfoliating great",
      "text": "I like this foot peeling mask. I used them when I am watching TV. At the same time, it gave me a pair of clean feet. I loved it. It is so easy to use and convenient. At least, I don't need to scrub.",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer yang",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "It was OK but not the results I was wanting",
      "text": "It says to wait 20 min before peeling it off. I waited almost 40! It still didn’t seem 100% dry. I have some clogged pores on my chin and near my nose that didn’t seem to change. As for the mask itself, it seems to take oils on the skin off but doesn’t unclog or pull up any underlying oils or dirt, and also pulled out the hair which hurt a lot but was not unexpected. I think the product was misleading but still serves a purpose. Afterward I still had to pull at part of the mask that didn’t come off with the bulk of it. I was uncomfortable and made my skin red in the process.",
      "rating": 2.0,
      "verified": true,
      "author": "Troy McSimov",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Works very well",
      "text": "I wore it for an hour, two days later my skin was peeling like I'm that big lizard from The Amazing Spiderman. The scent is pretty annoying but that's all it is, annoying.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Holy feet!",
      "text": "Wow ok so really read the instructions and reviews it takes about a week after application to see peeling but after that hello crocodile feet! Best to get a pedi 15 days after application to get rid of the peeling",
      "rating": 5.0,
      "verified": true,
      "author": "becca",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "don’t get this it makes ur foot forever peely",
      "text": "Don’t get this!!! It’s not like the Baby Feet clean peels —- my feet are STILL slowly peeling like a little bit like 6 months later.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Dries quickly, works great",
      "text": "This was my first black mask purchase. It dries quickly, was very thick and doesn't drip as you're waiting for it to dry. It really tugs at your skin as you peel it off, and I felt like it was grabbing all the dirt and grime from my pores, though there wasn't much on the mask afterwards. I'll definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Thomas",
      "helpful_votes": 2,
      "publication_date": 20170524
    },
    {
      "title": "Doesn’t work",
      "text": "I have used baby feet many times and I tried this product because it was less money thinking it would be the same. It didn’t do anything",
      "rating": 1.0,
      "verified": true,
      "author": "M. Mumma",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Gross but great",
      "text": "This is totally disgusting. But well worth it if you truly want to take the time to get rid of your dead foot skin. It definitely accomplishes that. You have to make sure you upkeep on what the directions say. Soaking feet every day after use for about 1-2 weeks to get all the dead skin off. It’s so gross, but that’s what you want!",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "you will get excellent results. Give these a try",
      "text": "This foot mask is unlike the others. It really works! I've tried the more economical versions that do not much more than soften your feet for the afternoon. There is some work involved here, but if you follow the directions, you will get excellent results. Give these a try!",
      "rating": 5.0,
      "verified": true,
      "author": "Alma",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "STAY AWAY. DOES NOTHING IT PROMISES.",
      "text": "Worst crap I ever put on my face. Did absolutely nothing for my skin but dry it out. Peeled off without any blackheads. Also makes a huge mess and is almost impossible to clean. I threw the tube away after trying it twice. Save your money it's utter garbage!",
      "rating": 1.0,
      "verified": true,
      "author": "Elysia",
      "helpful_votes": 4,
      "publication_date": 20170419
    },
    {
      "title": "But def worked good on the bottom of my feet",
      "text": "This doesnt exactly work tge way the videos I have seen show, but it for sure gets the job done. Just as a warning though, make sure you cut the bootie so that it is not touching any part of your leg, just your foot. It caused a little bit of a chemical burn on my leg and made the top of my foot dry - so just be aware of that. But def worked good on the bottom of my feet!",
      "rating": 3.0,
      "verified": true,
      "author": "Kenz",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "I have to say the strips work better. However",
      "text": "I got this to remove black heads from my chin and nose. I have to say the strips work better. However, I put the mask on my whole face and even though it hurt to remove it, my skin felt refreshed, smooth and wonderful. So if you're trying to get blackheads out, maybe try strips, but for a full face mask to remove dead skin, its wonderful.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexis F.",
      "helpful_votes": 2,
      "publication_date": 20170526
    },
    {
      "title": "Mine may be defective?",
      "text": "I read up before purchasing. Several reviews stated the booties ooze with slime and can even be messy. Mine were hardly even “damp” inside. Are mine defective?? It’s like a foot baggie with a reeeeeally old baby wipe lining it :/ It’s disappointing because it seems like there’s no product in my pair compared to what I expected",
      "rating": 2.0,
      "verified": true,
      "author": "Peggy L.",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "good",
      "text": "It hurts a little bit from the nose, but it's worth it. It may not be very clear from my picture, but it really removes a lot of dirt, and I like the smell very much.",
      "rating": 5.0,
      "verified": true,
      "author": "ben",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Not impressed",
      "text": "Not too pleased with this one. I guess I had higher expectations. It didn’t clear out my pores the way I thought it would. Tricky to apply as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "This was the first time I have used this product ...",
      "text": "This was the first time I have used this product, though I have used similar brands before. The smell was rather off-putting. While it was lavender, it was also very chemical and not pleasant. Following the soaking every day instructions, I saw results in about two days with complete dead skin removal in about six days. Barring the smell, for the price I believe this to be a very effective product.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenny S",
      "helpful_votes": 2,
      "publication_date": 20180123
    },
    {
      "title": "Love it!",
      "text": "Wrapped each foot in its own bag, taped up the top & laid back for 90 minutes massaging the bag and my foot every few minutes. Washed it off completely when done & discarded the footsies. Soaked my feet in warm water 2 days later for 20 minutes. On day 3, the skin started to peel off. It was great!! Found that after every shower, the skin would peel off more and more. On day 7 now and I’m almost baby-skin soft",
      "rating": 5.0,
      "verified": true,
      "author": "Toot",
      "helpful_votes": 2,
      "publication_date": 20171011
    },
    {
      "title": "Amazingly disgusting!!",
      "text": "Didn't think these things could ever work with my feet and proved me wrong big time! They started peeling after 4-5 days and I've never had softer feet! So glad I purchased these - as gross as all the peeling was it was totally worth it! :) very satisfied!!",
      "rating": 5.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Totally works!",
      "text": "Holy moly do these things work! I used my husband as my guinea pig lol his feet shedded let me you would not believe. Definitely not for the faint of heart..but...his feet are baby smooth now.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "but it is so great! I will definitely buy again in the spring ...",
      "text": "It takes about 3-4 days for the peeling to begin, but it is so great! I will definitely buy again in the spring when my feet being to callus again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Recommend soaking your feet in warm water everyday to speed ...",
      "text": "Used only one pair. Saving the second pair for later. It takes about 5 days for the peeling to start, and then another 5 for the peeling to stop. Recommend soaking your feet in warm water everyday to speed up the process. Left with baby soft skin.",
      "rating": 5.0,
      "verified": true,
      "author": "OnlineShopper",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Worth every penny",
      "text": "I ran track, danced, played volleyball all my life. On top of being active I never wore shoes. The state of my feet was tragic truly. I’ve only done one treatment (wore one pair of socks) and my feet look brand spanking new. It’s ammmaaazzzzing!!! I doubt I’ll need the second but I’ll keep it around just in case winters rough on my heals.",
      "rating": 5.0,
      "verified": true,
      "author": "NLNtegaza",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "but my feet didn't really peel like any of the other reviewers",
      "text": "I think this works well on some people and just okay on others. I am one of the others. Product did as it said, but my feet didn't really peel like any of the other reviewers.",
      "rating": 3.0,
      "verified": true,
      "author": "Sara King",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Highly recommended",
      "text": "A little bit intimidating especially if you watch YouTube videos but definitely worked highly recommend it great product",
      "rating": 5.0,
      "verified": true,
      "author": "K8",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "... I barely followed the instructions and I'm still getting pretty impressive results",
      "text": "So I barely followed the instructions and I'm still getting pretty impressive results. I have really deep calluses where the plastic part of flip flops meet the foam part you step on. It didn't CLEAR those out, but it definitely toned them down enough that I didn't feel like I had dinosaur feet anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimie Landseadel",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Skin peels like an onion.",
      "text": "I have terrible feet from serving in college. This peel has been the only one that consistently helps to remove calluses. Super easy to use and effective. My friend and I typically soak our feet for an hour first in a hot epsom tub then follow the instructions and always add thick fluffy socks over the booties. Works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Will buy again",
      "text": "Amazing. First you feel like your feet are wrapped in hidden plastic. Funny feeling. But after 3 days my feet started peeling and lasted about one week. Soft feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Muni",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Beware of smell. Good luck if you have big feet.",
      "text": "So, I just got these tonight and I'm currently giving them a go. Right off the bat, this thing stinks. It's says lavender, but that isn't any sort of lavender I've ever smelled. Also, be wary of buying these if you've got big feet. I have a size 13 in men's and I ended up tearing one open just trying to get my foot in. Ended up having to tape the back of it shut. I'll edit my review in a week with how it actually works.",
      "rating": 4.0,
      "verified": true,
      "author": "Jayden Mitchell Stewart",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Shed like a snake",
      "text": "Works well takes a few days to peel but the skin comes off your feet like dried elmers glue comes off your hands.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Weiss",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Not as good as Baby Foot",
      "text": "I have used three other products and they don't work as well as baby foot.",
      "rating": 2.0,
      "verified": true,
      "author": "Mercedes",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Do not waste your time. This does not remove anything.",
      "text": "I bought this product to remove blackheads from my nose. It does not remove anything. A piece of scotch tape would do more for your pores than this product. Do not waste your time.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170704
    },
    {
      "title": "Works, Just Not as Well as Described",
      "text": "I used this product as directed and experienced results, but not like what you see in the pictures, and most of the peeling occurred on my toes. Just me?",
      "rating": 3.0,
      "verified": true,
      "author": "Zachary Craft",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Works but peeling gets annoying after a few days because it doesn’t peel all ...",
      "text": "Works but peeling gets annoying after a few days because it doesn’t peel all of in one day and after a couple of days you have tiny pieces of dead skin everywhere. Also before peeling your feet will feel like leathery and i do not recommend wearing sandals or anything that exposes your feet it looks pretty gross",
      "rating": 4.0,
      "verified": true,
      "author": "Rose Diaz",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Wouldn't buy or use the 2nd pair again",
      "text": "Only gave a 2 star because it did make my feet a little soft/ smooth. It was terrible when trying to peel off. It was coming off in hundreds of tiny pieces, zero large ones at all. So it took much longer to get it all off.",
      "rating": 2.0,
      "verified": true,
      "author": "Alicia English",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Peel my feet like a banana, please",
      "text": "These ARE WILD! I did them on a Tuesday. I didn't see peeling until Friday morning after my bath. I recommended them to my roommate and she is happy with the results. They are REALLY weird if you aren't used to foot peels. And that graphic on the product isn't a lie. My feet REALLY did look like that.",
      "rating": 4.0,
      "verified": true,
      "author": "Colleen",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Used for hands and feet",
      "text": "This really does work! Despite everyone saying not to, I used this on both my hands and feet. The skin didn't come off my hands as dramatically as it did for my feet, but it was still nice to get rid of some of that dead skin. I also did not soak like it says to because I'm lazy, but it still worked pretty good. I will definitely use this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Feet are super soft",
      "text": "Will be purchasing this again. I had terrible callus on my heels and toes. Now my feet are really soft!",
      "rating": 5.0,
      "verified": true,
      "author": "kaitlyn keller",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "This product arrives as advertised. It is for one ...",
      "text": "This product arrives as advertised. It is for one use only but it does do its job. The instructions are loud and clear with no misunderstandings. If you follow the instructions your feet will be baby soft in no time!",
      "rating": 4.0,
      "verified": true,
      "author": "kay150",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Happy with the end result",
      "text": "Totally works but be prepared not to show your feet for at least 1 week. Scaley flaking skin but that’s what the product is for. Took a day or two to start working. Happy with the end result.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Sardella",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "REALLY WORKS",
      "text": "I gave this to my mom for Christmas. She LOVED it. It took away ALL of her calluses and she had quite a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "It definitely doesn’t make your feet peel like the picture shows",
      "text": "It definitely doesn’t make your feet peel like the picture shows. It got rid of a little of the roughness but I had to repeat and it didn’t do any better.",
      "rating": 2.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Heck yeah",
      "text": "These things were great. I wear military boots at work and have been for 11 years now. I've got calluses typical of someone who's on their feet most of the day. These helped to take most of it off and keep it that way for quite a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Kessinger ",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Terrible Product",
      "text": "First of all, the smell is horrendous, it has no trace of a lavender smell. It also irritated skin around ankle area and there was absolutely nothing that \"peeled\". I wouldn't waste the money nor time with this product. Made in China.",
      "rating": 2.0,
      "verified": true,
      "author": "Melanie Y Hill",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Doesnt work",
      "text": "I brought this to try a cheaper version of baby foot..... Waste of money doesn't work.. No peeling.. just made my feet dry like sand paper...Im going back to using baby foot.",
      "rating": 1.0,
      "verified": true,
      "author": "annette",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Waste of money",
      "text": "This stuff managed to rip off the top layer of my skin and still didn't remove any blackheads. Pointless.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Two Stars",
      "text": "These did not remove my calluses like other brands do.",
      "rating": 2.0,
      "verified": true,
      "author": "Susan G.",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Small, not effective",
      "text": "I have used this twice now and have not noticed a difference. The bottle is also tiny - I feel like if you used on your entire face it would be gone after a few uses.",
      "rating": 2.0,
      "verified": true,
      "author": "Krystal",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Love it",
      "text": "Works very well and doesn’t smell terrible like all the other ones. Plus this one has a way more comfortable sock",
      "rating": 5.0,
      "verified": true,
      "author": "Los Angeles Resident ",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Works, but....",
      "text": "This item really does a harmless and easy peel for your feet, but claims about callous removal are exaggerated. My feet do feel better but the callouses remain. All in all it was a fun experience with some minor improvement, but peeling one layer of skin does not create a dramatic improvement. Period.",
      "rating": 3.0,
      "verified": true,
      "author": "Lips",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "A decent mask",
      "text": "This mask worked decently. I had expected it to work like some of the videos I have seen. It does pull the fine hairs on your face when removing, so it'll sting a tiny bit. I did get some cleansing results left on the peel once removed. Overall it was worth the purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Shay P.",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "Pleasantly Surprised",
      "text": "My feet are so smoothe! I honestly thought it wouldn’t work for me but it did. The only thing was I didn’t get giant peeling pieces of skin, it was more small pieces I got off with a foot buffer. Overall really pleased with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Amazing product.",
      "text": "Works amazingly. But don't use it if you plan on wearing sandals for a few days. Best to use right before sandal season as your feet will peel for a few days.",
      "rating": 5.0,
      "verified": true,
      "author": "lalapeepers",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "this product took over 2 weeks to work as well ...",
      "text": "this product took over 2 weeks to work as well and still didn't remove dead skin and I am a person who receives pedicuress",
      "rating": 1.0,
      "verified": true,
      "author": "Ladybost",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Dry time isn't accurate at all",
      "text": "It says it dries in 20-30 minutes. I had it on for an hour and it still wasn't dry! I put it on before work thinking I had plenty of time and I ended up having to scrub the half dried mask off my face and was late to work because my face was absolutely bright red and burning after removal. Besides there's no applicator that comes with? Not happy at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin Glosser",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "This is a great blackhead mask",
      "text": "This is a great blackhead mask. Cleaned up my pores well. The only drawback is the mask is pretty funny when you first put it on, which results in drips. It does however dry quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Johnson",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Burns",
      "text": "Not for me. I have sensitive skin so this product really burned. My toes peeled a bit but not in a satisfying way...",
      "rating": 2.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "good foot peel",
      "text": "good foot peel. it really does work but not in the large chunks as advertised. i was vacuuming the house everyday until my feet stopped peeling.",
      "rating": 4.0,
      "verified": true,
      "author": "SSays",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Did not work for me.",
      "text": "Followed directions and feet got extremely dry but no peeling. Thought first was defective, so tried again after a week and still no results. Wasted money.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Not the elaborate peel",
      "text": "Followed the directions. Wasn't as elaborate as the box states in regards to the peeling.",
      "rating": 3.0,
      "verified": true,
      "author": "C. L. Cilley",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Love",
      "text": "I had really bad calluses and dry/cracked heals. My feet are like brand new now! Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Stefanie Torre",
      "helpful_votes": 0,
      "publication_date": 20190821
    }
  ],
  "product_meta": {
    "title": "Liberex Exfoliating Foot Peeling Mask - 2 Pairs Peel Booties for Callus Dead Skin, Get Soft Touch Smooth Feet in 1 Week, Repair Rough Heels for Men Women",
    "rating": 4,
    "feature_bullets": [
      "Say goodbye to your dry rough feet: Liberex foot care treatment can effectively soften the aged cuticle, remove dry dead skin and repair your coarse, cracked heels",
      "Baby your foot naturally: Contains milk extract and a variety of plant extracts, like aloe, rose and tea tree essential oil etc. Mild and non-irritating, Liberex foot pedicure mask peels your hard foot skin without irritation or discomfort",
      "Important Tip: A sensibility test is highly recommended if you have sensitive skin due to the exfoliating nature of the mask. Get some liquid from the mask and put it on your ankle or on the top of your feet. Then wait 10 minutes to see how it works",
      "Important Tip: There will be nothing to peel if you do not have callus or dead skin. Daily foot soak for 15-20 minutes 48 hours after the application is highly recommended for the best results. Generally, the peeling will begin at Day 3-4 and the whole process lasts about 7 days",
      "Studies have shown that most individuals have positive results. Please note that results may vary based off thickness of dead skin or skin sensitivity."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.5 x 1.5 x 4.5 inches; 2.88 Ounces",
      "UPC": "696177795971",
      "Manufacturer": "Jellas Technology Limited",
      "ASIN": "B06XQJ8MVT",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Facial Peels"
    ],
    "price": ""
  }
}