{
  "website_summaries": [
    {
      "verdict": "If you don't need complicated components or a fancy display, this is the most accurate thermometer for the lowest price.",
      "pros": [
        "Its straightforward design, bold digital display, and accuracy make it a contender with higher-priced models for monitoring temperatures and humidity",
        "The 5 yr. warranty makes it an even better deal"
      ],
      "cons": [
        "Very basic",
        "Some reports of malfunctions, but the warranty comes in handy in such cases",
        "Rain tends to interfere with the sensor"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great unit, minor design flaw.",
      "text": "Not sure what others are taking about regarding discrepancy in temperature reading. After startup and waiting an hour, mine synced perfectly. Only 4 stars given due to design flaw. I plan to wall mount mine, and there is no way to check min/max temps without accessing the button on the back of the unit. Who wants to take it off the wall each time to check? Not me. Otherwise great.",
      "rating": 4.0,
      "verified": true,
      "author": "John M. Flora",
      "helpful_votes": 111,
      "publication_date": 20171010
    },
    {
      "title": "Keep looking.",
      "text": "It worked for two days and then stopped communicating with the remote sensor. I suspected bad batteries and replaced with new but had the same issue. The remote sensor is only about thirty feet from the base unit. I think the size and overall design is okay but the components are apparently not ready for prime time... I'm returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 26,
      "publication_date": 20170721
    },
    {
      "title": "Works well.  Easy set up.",
      "text": "Works well. Easy to set up. You will need a small screwdriver to open the battery compartment on the outdoor component. Link the two devices before putting the battery door back on (the sync button is also inside - makes sense). Be sure to replace the flexible seal to match the outline of the door seal. Read the section of the instructions carefully to get the single outdoor device to display properly on the indoor device. I accidentally put it into the mode in which it cycles through three outdoor devices. Overall, a very sturdy and effective device at an excellent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Nom de Plume",
      "helpful_votes": 19,
      "publication_date": 20170622
    },
    {
      "title": "Works beautifully. Ordered another to put at the other end ...",
      "text": "Ordered on to replace old Radio Shack unit that died. Works beautifully. Ordered another to put at the other end of the house. Both were within 1 tenth of a degree in the temperature reading and 1 percent in the humidity readings. Both sensors were at different ends of the house. Now using one sensor and two receivers. Will keep the second sensor as a spare but doubt it will ever be needed. Company contacted me on purchase to thank me and explain policies. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry R. Fravel",
      "helpful_votes": 20,
      "publication_date": 20170822
    },
    {
      "title": "Already stopped working.",
      "text": "Remote sensor stopped transmitting data within 2 months. Previously, I had an Accu-Rite system that was very similar to this: one base unit that told me the temperature indoors, and a remote sensor that radioed in the temperature outdoors. THAT system lasted many, many years, accurately reporting the 115+ temps we see in Southern Nevada summer after summer. This item worked for approximately two months, during the autumn... it's not even hot outside! Tried new batteries, tried hitting the Tx button, tried hitting the RESET button. Nothing works.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Henry",
      "helpful_votes": 17,
      "publication_date": 20171011
    },
    {
      "title": "I like to set the outside sensors in my freezers and ...",
      "text": "I bought 3 of these & set them up next to each other. So they display 6 different temps (2 readings-inside & out) and none of them are the same. Variance of at lest 2 degree high or low. I like to set the outside sensors in my freezers and fridges to see inside temps without opening them. They seem to function just hard to have confidence with their accuracy. They will read each other when they are synced but even when you turn off the scrolling feature for whatever reason they scroll whenever they want. Disappointed in that as a just want them to give me the reading in one place.",
      "rating": 1.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 13,
      "publication_date": 20170817
    },
    {
      "title": "Good value!",
      "text": "My review with updates got long so simplifying. The remote sending unit that I received had problems. Seller acted quickly and replaced both the remote unit and the main unit. Devices do not always work as they should, so what counts is the seller's actions to correct the issue. So I am upgrading to 4 stars. Would be 5 had it worked properly from the start. I like this unit. Seems a bit slow in tracking temp changes, but I think that may be common to all of these types of devices and may be by design; therefore not downgrading for that. So I would rate this item a good value.",
      "rating": 4.0,
      "verified": true,
      "author": "Jere F. Moore",
      "helpful_votes": 7,
      "publication_date": 20171206
    },
    {
      "title": "Don't throw away your money.",
      "text": "The placed sensor in my shed about 30 feet away from the inside sensor so the signal has to go through the wall of my house and through the wall of my shed. It worked for about 2 days before I had to go through the process of getting it to recognize the outside sensor. I've done it several times in the last couple of days but I'm not messing with it anymore. It was a complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Dct2065",
      "helpful_votes": 7,
      "publication_date": 20181107
    },
    {
      "title": "Update: Will not work in low outside temperatures : I was wrong and apologize for prior poor review. Put new batteries in sensor",
      "text": "My sensor batteries were six months old: replaced and now registers -23. The instruction manual is not very good and needs editing... the manual also contradicts itself; it claims the outside temp will sensor temperature to -58F; which it does not, and then notes outside temp will not register during extreme cold conditions; its -17 here today, but i determined that from my car thermometer. Not worth it, My new high end batteries are less than 6 months old in the outside sensor.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171229
    },
    {
      "title": "Easy to set up and ACCURATE! But essentially dead since Dec 2017. New batteries revive for 2 days only. Hygrom no longer works",
      "text": "This is so much easier to set up than my 10 year old version! Plus, it comes with its own mini phillips screwdriver. Wow! My old one required about 90 minutes of mickeying with both components to set and reset repeatedly. THIS ONE worked the first time and had a visual display of the connection attempt. Accuracy: I left the initial set up inside and let it stabilize. The temps were within a half a degree of each other and matched our thermostate readout. The humidity indicators were within 1/10 of a percent of each other and agreed with our house thermostat. Remote is happily outside in the shade and both in and outdoor data being reported.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 2,
      "publication_date": 20170908
    },
    {
      "title": "Fantastic Customer Service",
      "text": "I like the receiver. It is really simple; temp and humidity inside and out. I have a pier and beam hours and the outside sensor is actually under the house. The receiver stopped working about a month ago. I contacted ThermoPro because I had registered for an extended warranty (I think). I used Amazon to contact them and there was absolutely no problem. The send me another unit and sensor right away. I have it set up and it is working perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "good son",
      "helpful_votes": 2,
      "publication_date": 20191104
    },
    {
      "title": "Does well what it does, for this balcony gardener",
      "text": "Simple, effective. Using it to monitor conditions for balcony plants & flowers that face unobstructed sun for 6 hours a day in NYC Area. High moisture = less watering; low temp = bring inside the least hardy ones. History of high & low gives me peace of mind. Easy to read. Discreet design.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry",
      "helpful_votes": 6,
      "publication_date": 20170602
    },
    {
      "title": "Medium size case & display",
      "text": "While this is the low end of the price spectrum for this type device the size, indoor/outdoor temperature/humidity functions are exactly what I was looking for. The setup instructions prepare the user for some delay but I found mine to sync immediately and hold the signal since setup. Range is adequate for a normal size house. I have found the sender fails on these small wireless thermometers after 2 - 3 years so I don't expect great reliability but am OK with the price if it doesn't outlive my others. While return postage will likely be more than the replacement value this item has a five year manufactures warranty. The vendor conducts a very active customer satisfaction email campaign.",
      "rating": 5.0,
      "verified": true,
      "author": "der Penguin",
      "helpful_votes": 13,
      "publication_date": 20170625
    },
    {
      "title": "Not sure why people gave good review for this product",
      "text": "Not sure why people gave good review for this product. When the room temperature is 80 degree, it show 80. But today, when the room temperature to 74 degree, it still showed 80 degree. I want to return, but unfortunately, I have passed return window. So I am writing this review so that other people will not buy it any more. Update 8/22/2017. The seller is very responsive, after they saw that I had a malfunction product, they mailed me a new one. The new product is much better so far. It is about 1-3 degree higher than my heater/cooler control thermostat reading. As long as it is consistent I can live with it.",
      "rating": 3.0,
      "verified": true,
      "author": "WY",
      "helpful_votes": 3,
      "publication_date": 20170815
    },
    {
      "title": "Seller replaced faulty unit",
      "text": "Remote sensor failed after 2 weeks outside. I put it under the eave. I brought it in and replaced the batteries. Placed base unit and remote within inches. Still not working. Base unit still shows inside temp. Tried the reset and Tx buttons on the base unit. No change. Remote only lasted 2 weeks. UPDATE 8/14/18 Contacted the Seller thru Amazon. They responded quickly. After a little more info from me, the Seller sent another unit which is working perfectly now. On the first unit, a day after the Remote failed, the Remote began sending the temp but the humidity was 50 percentage points off what the Base was registering.",
      "rating": 4.0,
      "verified": true,
      "author": "arcticgardener",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "WIRELESS SENSOR DID NOT WORK",
      "text": "I have 1other thermopro device in my home. I received a defective wireless sensor. the thermometer would pickup my other sensor on Channel 3 but wouldn't pick up the new sensor on channel 1 or 2. I put the new sensor on channel 1 in the freezer and it still read 75 degrees and wouldn't move. I hit reset on the back - did channel scan on the thermometer itself and NO GO. I returned it and purchased a TP65 and it is working great. One thermometer on channel 1 and other on channel 3. No problems with TP65.",
      "rating": 2.0,
      "verified": true,
      "author": "CHAD954",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "What is accuracy?",
      "text": "My previous ThermoPro indoor/outdoor unit lasted a couple years then quit. I got the TP-60s to replace the failed unit. The new one is much smaller (I failed to check the specs since the pic looked similar). It has been 9 months and I brought in the sensor to replace the batteries (2nd time) because it stopped sending. This time the readings did not compare favorably with my thermostat or another thermometer I have. It took more than 10 minutes for the readings to catch up when I moved it back outside. The accuracy is now way off. 7-11 degrees and humidity is at least 6%/9% (in/out) low. I am calling this one done. NEVER another ThermoPro.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve Petrosino",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Good product - Instructions need improvement.",
      "text": "Seems to be a good product. Have not had it during a winter yet. Monitor could use a bigger display. Instructions do not cover why the monitor cycles looking for other units and it is a temporary conditionon. I thought it was broken at first. Good price and product does what you want it to. Needs better instructions. Batteries lasted a little over a month. Hope this does not continue.",
      "rating": 2.0,
      "verified": true,
      "author": "Clint",
      "helpful_votes": 3,
      "publication_date": 20170815
    },
    {
      "title": "Testing the ThermPro TP60",
      "text": "This item works great. I'm impressed by the range of the sensor. I have the receiver located in our ground floor kitchen of our 2-story home and I currently have the remote sensor in the attic (2 floors above the kitchen) and it reads the temp/humidity fine. I have also tried placing the sensor inside the refrigerator and freezer to experiment on that location and, again, it reads the colder temperatures accurately. I purchased it to primarily show the temp inside out RV refrigerator when we travel on the road. I have not had opportunity to test it in that mode yet but I'm sure it well work equally well. I have been very satisfied with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170904
    },
    {
      "title": "Cheap inaccurate junk",
      "text": "Product arrived quickly highlight packaged in a small box. First issue: the sealed batteries were leaky (see pictures) and had no power. The seller proposed to refund the cost of the batteries (haven't heard back yet) After buying new batteries and setting up the inside and outside units temperatures appeared to be in a normal range. MAJOR PROBLEM: over the next two days the outside and inside temperatures never changed despite the outside temperature obviously changing a lot. As other reviewers have pointed out this thermometer is inaccurate at best and in my case totally worthless. Final problem: Amazon doesn't cover returns on this product. So I'm stuck with waiting on the seller to respond.....",
      "rating": 1.0,
      "verified": true,
      "author": "Eric Brandt",
      "helpful_votes": 3,
      "publication_date": 20181221
    },
    {
      "title": "Reliable readings from attic",
      "text": "I purchased this to monitor humidity in our attic. I have an indoor/outdoor monitor as well as a humidity reading on my thermostat. The indoor temp and humidity readings on this units are always very close to my other units (La Crosse Technology). The remote sensor reflects same readings as base unit when nearby, and appears to be reporting remote readings correctly. The remote sensor is about 20 feet away and one story up in the attic. It is only a few weeks old, so not sure how it will hold up through the winter, but the LaCrosse unit is well over 5 years old and still reporting accurately.",
      "rating": 5.0,
      "verified": true,
      "author": "Ownid ",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Works Well for Monitoring Crawl Space Conditions",
      "text": "Arrived quickly, easy to set up, and seems to be working flawlessly so far (have had it in operation for about 2 weeks). I have the base unit on my screen porch near a window for measurement of outside temperature and humidity and the remote unit down in my crawl space to remotely monitor temperature and humidity down there. This set-up works great with no loss of signal so far, even though the house floor separates the two units. Numbers on screen are large and have good contrast making it easy to view data from a few feet away and through an outside window. Based on my experience so far, I would definitely buy this unit again.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Markwardt",
      "helpful_votes": 2,
      "publication_date": 20171210
    },
    {
      "title": "Almost perfect!",
      "text": "This is an excellent indoor/outdoor wireless thermometer/hygrometer. Very easy to set up and very accurate. I inserted the batteries per the instructions and let the two units sit side by side overnight in my home office to become accumulated. The inside receiver shows 72.5 degrees/51% humidity. The outdoor sending unit indicates 72.1/52%. One can't ask for better match. Both are now installed and there's no issue with distance (about 40 feet) and multiple obstructions (walls, cabinets, etc.) to the transmission of data. Great inexpensive combination that I highly recommend. Thanks for listening!",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Wood",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Nice while it lasted",
      "text": "Product was fine, easy to read, compact and unobtrusive, and accurate as far as I know... right up until it stopped working at six months. I know, our expectation of the longevity of electronics is incredibly low, and appropriately so, a cynical conclusion reinforced by the 30 second warranties that have become standard for electronics. But still... six months, really? This is the best we can do? This is now the third digital thermometer I've purchased and all of them have conked out in less than a year. Enough, I'm going back to the old fashioned mercury thermometers, at least they're reliable.",
      "rating": 2.0,
      "verified": true,
      "author": "kvnj",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "This thing works great. I have the sensor/transmitter installed probably 60 feet ...",
      "text": "This thing works great. I have the sensor/transmitter installed probably 60 feet away from the base station, with a metal wall between them, and I have no issues with the base picking up the sensor's signal. By running comparisons with an analog thermometer and checking temps for my area online, I have concluded that the ThermoPro TP60 is accurate with regards to temperatures. I have done no testing on humidity readings. I received the product on time and in good condition. I would recommend this seller and product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20171219
    },
    {
      "title": "Seems to be working well",
      "text": "My first shipment of this item got stuck in the mail, but the seller shipped me another one after I notified them. I've been using it for about a week, with the remote unit sitting in my attic. When I initially set the base unit and the remote unit up, I set them side by side, expecting to see identical temperatures. The temperatures varied by about 1 degree at first, and then matched each other within a half degree of difference after that. The remote attic temperature shown on the base unit comes close to the temp displayed on another thermometer that I have in the attic. The attic temp has gone as high as 135 F with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Gatorboy",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "It works and it's easy to use.",
      "text": "Just got it 2 days ago. So, with that in mind, I think the thing is great. It takes a day for it to fully \"stabilize\". To test that it is receiving from your remote location use a mist spray bottle to very lightly mist receiver (you'll see 3 or 4 small holes on the underside of the remote reader) and then re-check humidity. It's 65 to 70 feet away from the base, in my kitchen. Seems to read fine from that distance. Other than that is was easy to set up. Easy to synchronize and easy to read (I got \"old guy eyes\"!). No more walking through the snow to check the greenhouse stats!!!",
      "rating": 4.0,
      "verified": true,
      "author": "coconut nut",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Good value for a reliable product.",
      "text": "I bought this so I could keep an eye on temperature and humidity in my chicken coop. Before I placed it in my coop I calibrated it with another digital thermometer and they were within a few tenths of a degree in both temperature and humidity, so it seems reliable. Every once in a while the remote reading shows up as a series of dashes, but after re-reading the instructions (insert red face here!) I realized I had my indoor unit set up incorrectly. I am glad to have found such a reliable product for such a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "S. J.",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "Great at first . . .",
      "text": "I bought this in January 2019 to monitor the temperatures in my chicken coop. You need to use lithium batteries in it when the temperatures hit freezing--I live in WI, so there are plenty of those days. I really loved it at first: it gave me peace of mind knowing that my coop was secure over the winter in terms of drafts. This year, however, the part of the thermometer that goes inside isn't consisting telling me the temperature. It just keeps showing a blank screen with dashes. I have changed the batteries in both the outside and inside sections, but to no affect. Alas, I really liked this product at first.",
      "rating": 2.0,
      "verified": true,
      "author": "TK",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Accurate and very convenient to have",
      "text": "So far I am pleased with this product. It is accurate and very easy to read. It doesn’t have a built in light, nor does it need one. The display is very clear. Just remember to mount the outside sensor where it will never be exposed to sun or any other heat source. I mounted it on the north side if the house under the roof overhang to protect it from direct rain or snow. So far it’s working well.",
      "rating": 5.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Just what I needed...",
      "text": "Gauge was easy to set up (just install batteries), and it worked right out of the box. The temperature readings are within a degree of a much more expensive sensor I already had and humidity is within a couple if percent. So I don't think we're talking National Bureau of Standards accuracy, but it's good enough for its intended use. Batteries are included for both the display and remote sensor, which is nice. My only complaint (and it's not much of one) is that the display background is a little dark, so the contrast is a little less than others I've seen. But overall a great device at a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Always aware.",
      "text": "Had a number of water leaks under the house the last few years. Became a black mold issue with health probs. Started using the TP-50 quite a while ago to keep tabs on inside vs. outside humidity. Just had another incident two months ago. So, ordered multiple TP-60S and now can be prepped with double outside transmitters and displays in multiple rooms plus garage. Seeing outside temp and humidity vs. inside makes for ease of mind in not mistaking weather influence as a need to panic about another covert leak under the house. Peace of mind (and great for nerd weather freaks too)",
      "rating": 5.0,
      "verified": true,
      "author": "crankybuyer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Poor instructions but excellent YouTube Video",
      "text": "Instructions are written on about a 2.5x2.5\" tiny booklet which is most difficult to read. Once you get a magnifying device to read the instructions, they are poorly written and confusing. There is no return policy through Amazon but perhaps through the seller. The idea is good, the execution of instructions is poor. However, an enclosed card does give a phone number for assistance as well as a website and email address. What accounts for a good evaluation is that there is an excellent instructional YouTube Video titled ThermoPro TP60 Indoor and Outdoor Thermometer that should answer all the questions you might have.",
      "rating": 5.0,
      "verified": true,
      "author": "Skipper",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Looks good - should be good - design is not good",
      "text": "Setting this up was deceptively easy enough until we had to open the remote sensor to insert the batteries. Impossible to do. In the end the back was cracked open which, when they tell you it has to be closed and dry, is inconvenient to say the least. If there is a magic word to open the back it was omitted from the instructions. So, while it looks good, I have to give it a 1 as by their own warnings it has to be closed, which obviously is impossible if you have to crack it open like an egg to get the batteries in in the first place.",
      "rating": 1.0,
      "verified": true,
      "author": "Woody",
      "helpful_votes": 3,
      "publication_date": 20181019
    },
    {
      "title": "Well-engineered & Accurate",
      "text": "Set-up was simple and the instructions were clear. The temperature readings are 0.5 degree Fahrenheit apart and the humidity readings are 2% apart. The temp is 0.3 F from my analog thermometer. It remembers daily or all-time high and low indoor and outdoor temperature and humidity. You can see how dry it got inside this winter or how cold it got last night. It lost the signal briefly once with the sensor only 25 feet away, but it reconnects automatically and this was probably a placement issue. It was behind my water heater and metal fireplace. A well-engineered, accurate, and reasonably-priced device.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A. Gilliam",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Good Thermometer",
      "text": "I like the simplicity of this thermometer as I've had this almost identical model almost three years. Just had to replace batteries from time to time. I ordered this one which is almost identical. The old one got moisture in the sensor and it fried in a recent rain storm. I was so well pleased in general that I got another. This sensor seems to be a better design so hopefully I won't have the same problem. This sensor now feeds temps to two receivers in my house - a bonus I guess. The only complaint, made in China - but difficult to find one not made there.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Products seem to perform well",
      "text": "About 8 months ago, got a simple thermometer / humidity monitor from this company and it has performed well. A few days ago also got one with a remote transmitter normally designed for \"outdoor\". I'm using the remote to monitor temperature in the attic (it's rated to go to 158F) prior to installing a radiant barrier under roof rafters. Unfortunately, I didn't think to get this during the heat of the summer to get a fair comparison for next summer, but am getting useful info now in mild days (70-80 ambient outside temps). So far the new dual unit is performing well. Transmitter is powerful enough to send signal from upper attic above second floor to ground floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Sline",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "A small package with large text",
      "text": "I can easily read the temperature/humidity display from 10 feet away. The base station fits well in a narrow space, replacing my old thermometer very well. I knocked off one star on the weatherproof rating because the manual warns you not to allow water into the sensing unit. The case has vent slots in the bottom to provide better response. But you should place it in a sheltered location with the vents on the bottom to avoid wind-blown rain. It is an outdoor unit however, so that should be handled with better sealing of the internal components.",
      "rating": 5.0,
      "verified": true,
      "author": "JRW",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Stopped working after just over 1 year",
      "text": "I bought this indoor/outdoor temperature & humidity gauge for use at my condo, which has rules about what can and can't be placed outdoors. This was allowed, but it wasn't worth the money. After just over a year, the outdoor temperature/humidity will no longer sync with the display. I cannot get any outdoor temperature & humidity reading, and the indoor only works when I remove/replace the batteries. I've put new batteries in both and tried all available channels with no success. My indoor only model, ordered a few weeks earlier, still works but is poorly designed with the humidity rather than temperature displayed most prominently. Don't waste your money; this brand isn't worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "RE",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "easy install/setup. came with batteries",
      "text": "easy install/setup. came with batteries. good product for the price. I wish I bought one with some color coding...for looking at 4 sets of number, it's a little confusing at first (especially since I have 2 other thermometers in the house by different manufactures and displays are all different), but I should get used to the display...also, I wish the display had light, but it's still good product for the price). lowered from 4 stars to 3 stars. batteries died after just a couple months and layout of numbers not the best...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170716
    },
    {
      "title": "They work in cold and hot temps so far!",
      "text": "I have been wanting to write a review. I have 3 of these little bad boys. I did have to return one which was faulty. I got a replacement and it works just fine. I have one in my deep freezer which has gone down to -25 F one in my garage temps as high as 105F. LL is what it reads for humidity in my garage I'm guessing lower level and -- in my deep freezer? Humidity is read in the house at regular temp levels just fine. Anyway they work. If they don't I suggest getting a replacement. I am happy with my purchases. Very easy to read and setup! I wish we could connect more than 3.",
      "rating": 4.0,
      "verified": true,
      "author": "P.M.",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Inexpensive and unobtrusive way to track temperature and humidity",
      "text": "During my years in agriculture I monitored a sophisticated weather machine for data to inform my decisions. Since retiring, I don't need that much information and don't want the extra maintenance and bulky equipment. This thermometer duo does a fabulous job. It's small but easy to read, easy to install, and easy on the budget. We're completely thrilled. I monitor indoor temperature and humidity almost as much as outdoor. This provides both. I centered the indoor unit above a light switch in the living room. Perfect location and doesn't take up any counter space.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Baber",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "1 star because fails at its main task.",
      "text": "First let me say that Thermopro has great customer service. However good customer service does not make a good product. The indoor unit reads well but I have an indoor thermostat for that. What I really wanted this for was the outdoor temperature/humidity. This unit is so far off that its worthless. You may as well take a guess and you will likely be closer to actual than this unit is. Lately it been in the upper 40s and this unit more than 10 degrees off. Its telling me its 60 out..... 60?.......... 60? Its 48 degrees out! Thermopro sent me a replacement and I have the same problem with both, sorry but it's going in the garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob P.",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Works great for young chics. Don’t know yet about very young chicks..",
      "text": "Use this for my young chickens not tried it for tiny baby chicks yet, it works great for these girls.. It’s right outside pressed to the side of the large dog crate I use. I leave the monitor part on top to check temp. The 4 chicks stay close to it when it’s cold. The perch is above and close so handy for them. The set up is in my barn. I keep it covered, sides and top, the front is open where the door is. I use chopped straw. The heat is centralized to the location of the unit and radiates out to just the area where it’s located.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee F Dorrance",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Impressive",
      "text": "This is a great thermometer, it shows indoor and outdoor temps along with the humidity. Easy to set up, and has large numbers make it easy to see and read. At first I was skeptical due to the small size, but it works great! I plan on purchasing more of these as I think they would make great house-warming gifts, or stocking stuffers.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 4,
      "publication_date": 20170822
    },
    {
      "title": "Misleading",
      "text": "I can't review the performance because we didn't bother to test it. The actual measurements are listed in the small print so to speak, in the product description (we didn't think to look since the photo showed it's supposed size). We wrongly assumed that the measurements being shown (and bragged about) were probably the actual measurements. Not even close. It's tiny, and would be hard to see from a distance. They use it's size as a selling point, and they're lying. I'll give it two stars (benefit of the doubt) because it probably functions properly. Returned, buyer beware of flat out false advertising.",
      "rating": 2.0,
      "verified": true,
      "author": "Sandy Flaxman ",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Easy installation, Accurate",
      "text": "This ThermoPro caught my attention because of its reviews. The price was very reasonable and after owning this for a few months now, it hasn't disappointed. I've owned several atomic clocks and the transmitters were always the first thing to fail. So far this unit hasn't required any attention for the short time I've owned it. The installation was straight forward. If there is one thing I dislike, it's the fact that you can't read the display from across the room but a few more steps and its not a deal breaker. Bottom line: I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug W",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Good company to deal with",
      "text": "I have purchased two devices through this company and have found them to be very good to work with if an issue arises. Very accommodating with great customer service. The PT-60S units work great individually. I bought two units, one to place in a room in different parts of the house. I also wanted the transmitter for each to be in totally different parts of my property. I've had a problem with getting that working correctly. One transmitter, the one closest to the house, seems to override the other transmitter thus I get the same reading on both bases. I can circumvent the issue by placing one or both bases on circular display mode.",
      "rating": 5.0,
      "verified": true,
      "author": "Rod Case",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Quite good for the price",
      "text": "great for the price. I like this little thermometer. It replaced a more expensive that one that need four new batteries about every two weeks, which was getting expensive. This one is just as accurate and does not used excessive batteries. The only drawback is that the way you get the cover off if you do need to change the batteries is with a tiny screwdriver (which they send). It's a pain, as opposed to having a slide-off cover. But otherwise it reads accurately and I haven't had to change batteries yet, though it's been about a month and bitter cold here.",
      "rating": 4.0,
      "verified": true,
      "author": "Tena S.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Very nice, but Humidity????",
      "text": "Too new to comment on battery life and durability but appears to be a quality product. I had to contact the manufacturer to confirm that the humidity level shown is relative humidity (instructions don't say that anywhere), which is a confusing measure that doesn't really let you know how it feels, (unless you can mentally factor in the current temperature). I would have preferred humidity shown as Dewpoint, but I recognize that most people don't understand this either. Letting you choose between the two would be a nice option.",
      "rating": 4.0,
      "verified": true,
      "author": "Nic from New Jersey",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Good, except the batteries were junk (corroded, had to be replaced).",
      "text": "Batteries = Bad The only bad thing I experienced is that the original batteries corroded soon after purchase and had to be replaced. Unfortunately for some people who do not check the batteries regularly, they could end up permanently damaging your devices. Devices = Good Working well so far (4 months). Calibration is what I expect at this price range. Here are the averages of the relative differences between each of my units, through 11 samples over the last week. I am keeping track in a spreadsheet... Temperature: \"In\" > \"Out\" by 0.4 degC (0.7 degF). Relative Humidity: \"In\" > \"Out\" by 6%.",
      "rating": 4.0,
      "verified": true,
      "author": "MrHosen",
      "helpful_votes": 2,
      "publication_date": 20171221
    },
    {
      "title": "DO NOT BUY THIS",
      "text": "DO NOT BUY THIS PRODUCT. It seems to work as soon as you put in the batteries right out of the box...But then it fails. I synced the receiver and transmitter as per the manuals instructions 3 times on all three channels. It showed the temperatures for about 5 minutes and then it goes to ---- ----- on both the outdoor temp and humidity. I thought may be the wall was the issue so i placed it near a window (10ft) fro the transmitter. NO GO. This product is garbage. I tried removing the batteries and retrying it. After the 6th try (inside and 3 ft apart) I threw it in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 3,
      "publication_date": 20180522
    },
    {
      "title": "Doesn’t stand the test of time",
      "text": "I purchased this in May of 2019 and it has stopped working. I replaced the batteries, but only get a reading for indoors. The outdoor unit was in a safe place, no water or sun could hit it directly. It was good while it lasted, but I needed to leave this review so buyers can see what the product is like after months of use.",
      "rating": 2.0,
      "verified": true,
      "author": "Missy S.",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Meant to operate with three outdoor sensors. Great support.",
      "text": "Nice size and well designed product. The sensor is capable of displaying up to three outdoor sensor and it cycles through the three sensors continually so only having the one sensor that it came with didn't make much sense. Ordered two more. One of the three stopped sending humidity data and while this wasn't a show stopper for me it felt like a new product should work. I contacted the manufacturer and he got back to me right away, asked me to try a couple things and when that didn't work asked me to provide him with proof of purchase and mailing address. I got a replacement quickly and everything works just fine. Highly recommend the product and product support.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan E. Wood",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Great product backed up by world class customer service",
      "text": "This is the second ThermPro wireless weather station I have bought this year. I really like both of them. This particular one is dedicatef to our greenhouse. There was a little problem with the humidity reading it only showed LL and no humidity. I contacted customer service and with no questions asked they had another on it's way to me with emailed shipping info in under an hour. Now that's customer service! I would of given it all 5s if it wasn't for the humidity issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Coloradoclintons",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Easy-to-read temperature and humidity data.",
      "text": "Easy to set up and install. Easy-to-read temperature and humidity data, both inside and out. No trouble with reception between the sensor and the base unit. Just don't use the batteries that come with it. There is one pair for the base unit and one pair for the sensor that goes outdoors. The batteries in each unit went bad within the first couple of months of use, and both times I thought that something had gone wrong with the thermometer. The thermometer is fine, just needed new batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Zep1",
      "helpful_votes": 2,
      "publication_date": 20171016
    },
    {
      "title": "Updated review",
      "text": "Latest addendum 7/14/18 It is rare I receive feedback from a vendor due to a poor review, let alone a replacement product. I have tested the new unit which I just received and it is working perfectly. I've changed my rating to a five stars; not only for the product but for the most important part of any company, their customer service. _____________________________________ Tried to get a more accurate reading but the device always read approximately 20%+ higher when tested against other similar devices. Also tested against Alexa, Google Assistant, Weather Channel & Weather Underground APPs, etc... I can understand a 5% margin of error but not 20%. Need to find a device that is more accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc W.",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Thermo pro is the way go.",
      "text": "This is a very good product. Its has been performing as advertised. I use this in my tower humidor and its been very accurate plus or minus 1 to 2 deg and humidity is about 1-2 %The batteries that come with the product is not as good as the better brands won't last as long. If you feel that the remote sensor went through the batties rather quickly do not get worried its just the batteries that it came with. I replaced the batterirs with energizers and its been doing fine over 3 months now. Good product and its doing well in my humidor. I ordered other thermo pro products and they are working nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Rivera",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "It wasn't broke",
      "text": "I bought this item in October, 2018. The outdoor sensor stopped working this month and I changed the batteries, but the red light on the sensor did not go on and the indoor main unit did not indicate any signal. I was ready to pitch the whole thing when I read online a report that replacing the batteries in the main unit restored function. I tried it and it worked. There are many reviews of this item that report failures to function after months of service. I wonder how many units have been discarded that only needed batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "retired1",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Just what we needed",
      "text": "This thermometer replaced a much more expensive model from a major \"Scientific\" supplier. The previous unit had lots of bells and whistles but the outdoor transmitter failed after a couple of years. All I really use is the temperature and humidity and the entire new ThermoPro TP60S cost $10.00 less than a replacement outdoor unit. Easy to set up, takes up much less space on the window sill and reads within a degree of other thermometers to which I compared it.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda S.B.",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "works well but has a small screen",
      "text": "We use this for reading outside conditions as well as a backup check on our inside thermostat's reading. It is great for those functions. I had to call in to find out why the external sensor gave readings differing from the internal sensor when the two were side-by-side inside, and was advised to leave them sitting side-by-side for overnight as it sometimes takes a while for the outside unit to take an accurate measurement. That worked and we moved the outside sensor to its desired outside location and it seems to be working fine. We cannot assess either battery life or durability since the set is new to us.",
      "rating": 4.0,
      "verified": true,
      "author": "Ace",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Better quality than I expected for the price!",
      "text": "This digital wireless thermometer has now been in use for 3 days - all readings match my \"analog\" (dial style) thermometer/hygrometer, and the wireless feature makes it a snap to check the temps and humidity in my greenhouse without going outdoors to do so. The min/max feature shows me the daily highs and lows in the greenhouse and indoors, which helps me avoid heating the greenhouse unnecessarily (saves $$!). Package arrived on time and in good shape, and the manual is actually readable and correct! Highly impressed with ThermoPro products and shipping, and will be using this company in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Seijas - Simply Spotless Housekeeping of Citrus County",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Remote sensor worked for 75 days.",
      "text": "While it worked, it was a nice thermometer for the price. The remote sensor worked intermittently after about 60 days and completely died about 10 days later. For the price, it's not worth sending back under the warranty. Plus, I've wasted 2 sets of lithium batteries for the sensor as I wanted to ensure the first set weren't the problem. I noticed in reviews of most of these thermometers that the quality seems hit or miss, with many failures similar to mine, after the return window closes. For next thermometer, I'll purchase locally or from online with the ability to return to local store within 90 days.",
      "rating": 2.0,
      "verified": true,
      "author": "G Hammer",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "The ThermoPro 60s tell you the temp and humidity inside and outside just like my old Acurites",
      "text": "I bought 3 to replace 3 Acurite indoor-outdoor thermometers that stopped working after a year. When I went to replace the outside sensor for the Acurites, the company had changed their engineering, and what they sent me (I did provide model #) did not work. So, I bought 3 ThermoPro60s. The ThermoPro 60s tell you the temp and humidity inside and outside just like my old Acurites. Set-up was a snap. It was easy to program them all to work off the same sensor. In addition to working, they cost less than the Acurite thermometers I replaced. If this sensor ever dies - I now have 2 spares.",
      "rating": 5.0,
      "verified": true,
      "author": "Tomonthebeach",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Excellent thermometer, reasonably accurate, easy to read.",
      "text": "This is an excellent thermometer: easy to read, easy to use, and reasonably accurate. (And yes, the readings are consistent if you place the two components side by side, just wait 1-2 hours for readings to stabilize.) No problems with reception. I'm not sure how much to trust the humidity readings, that measurement tends to be unreliable with most such instruments. The inside unit hangs nicely from a nail, the outside unit does so similarly, and seems pretty weatherproof. I'm not sure how long the rubber seal might be functional, it will certainly deteriorate over time. I'll know in a few years. :-)",
      "rating": 4.0,
      "verified": true,
      "author": "CSX",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Works, not super accurate.",
      "text": "Appears to be off by 6 degrees F. Knowing this I just subtract 6 from temp shown. Not sure on the humidity but it’s close. Installing the batteries on the sending unit a bit of a puzzle at first. If I did not look at the book I would have broke off hinged door where batteries go. As far as distance about 125’ is it’s max range for me. I’m sure it depends on what the building is made of. For me, remote sensor is in brick building with windows and indicator/display is in the house in a window sill. Can’t comment on water proof part.",
      "rating": 4.0,
      "verified": true,
      "author": "kevin w jay",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Accurate, easy to install/sync, and it just works like it should",
      "text": "Seems to be doing a great job. I mounted the outside sensor on my patio wall in the shade so it doesn't get direct sunlight or weather. So far it seems to be very accurate. Easy sync process to the indoor module and I have them about 40' apart and with an outdoor wall in between and they never lose connection. I put the indoor module right above my downstairs thermostat where it is most handy to look at. It's nice to compare it to my AC thermostat and compare indoor temps of both, and to see outdoor actual temps before heading out for the day.",
      "rating": 5.0,
      "verified": true,
      "author": "MudholeTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Inconsistent Performance",
      "text": "This is the second unit I've purchased (the receiver on the previous unit failed-screen became garbled and wouldn't reset). The replacement unit I just purchased (June 2020) the transmitter does not work consistently and temperatures are off (based on other models placed adjacent to this one and the weather - reads at least 5 degrees high when the receiver gets a signal). Distance of receiver is not an issue; we've reset multiple times and gave up on the new transmitter and paired with the \"old\" transmitter and so far so good. Probably wouldn't purchase again based on performance",
      "rating": 2.0,
      "verified": true,
      "author": "Pigsnert",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Great temperature monitor for the price",
      "text": "Price was great, transmission distance good and temperature seems to be accurate. The humidity indicates 'LL' most of the time (this started after about 45 days) and sometimes it indicates humidity 10% to 20% - but the sensor is in a greenhouse this is nowhere near what the actual humidity is. As I needed to monitor temperature and had no concerns about humidity, this is not a big problem. It does have me concerned that the temperature sensing may lose accuracy too - but hopefully not. Customer service has been good - and I have not contacted them about the humidity sensing problem (because I don't really care how humid or dry it is in the greenhouse).",
      "rating": 3.0,
      "verified": true,
      "author": "Graybeard",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Working Perfectly",
      "text": "I have only had this for a few days but so far everything is working perfectly. I have a small pump house with water lines that must be warmed to keep the lines from freezing. So I bought this item which comes with a remote sensor and I purchased another remote sensor for outside temperature readings. Now, from the comfort of my house, I can know the temperature in my pump house and the outside/inside temperatures. Fantastic!!",
      "rating": 5.0,
      "verified": true,
      "author": "dangerbird",
      "helpful_votes": 2,
      "publication_date": 20171215
    },
    {
      "title": "Works as advertized",
      "text": "I'm getting good use out of the unit. In order to control mold and dust mites in our home, I keep tabs on the indoor/outdoor relative temps and humidity, knowing when to open doors and windows to reduce inside moisture. The unit and its remote are sufficiently accurate (I compared their readings to two other older hydrometers I have lying around) I chose this one over the larger, more colorful devises assuming it will use up less battery pwr. They have only been in use for a week or so and if they fail in the future, I'll attempt to update review.",
      "rating": 5.0,
      "verified": true,
      "author": "trader",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Indoor temp almost 2*F too high on TP-60S",
      "text": "In addition to the TP-60S, I also compared the TP-53 plus some Acurite temp/humidity monitors. With all in the same enclosure, including the outdoor sensors, humidity readings were within +/- 2% and, for temperature, within +/- 0.2*F with the exception of the indoor thermometer on the TP-60S -- that was 1.6 to 1.8*F higher than the actual temperature. The TP-60S outdoor temp reading was +/- 0.2*F of the accepted temperature. Why the indoor reading was almost 2*F higher than the outdoor sensor reading on the 2 components that arrived in the TP-60S package needs to be further investigated. Will follow up.",
      "rating": 3.0,
      "verified": true,
      "author": "Russell Dietz",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Love it!",
      "text": "Bought this thermometer after my old one finally played out. Found it difficult to find one that didn't have a lot of bells and whistles, was simply battery operated and read outdoor temperatures. This one proved to fit the bill. It was delivered on time and was packaged with care. After reading several reviews I admit I finally took pot-luck to a certain degree hoping for the best. In this case I struck a winner. Highly recommend for appearance, functionality, and practicality.",
      "rating": 5.0,
      "verified": true,
      "author": "M Daniels",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Accurate and easy to read.",
      "text": "Indoor/outdoor thermometers are pretty common. This thermometer adds a hygrometer to the mix to give you humidity info. I find the thermometer very accurate compared to other sources of data. But, I have no calibration for the hygrometer as of yet. The display is outstanding, and although small, it is very legible from a distance. There is a small kickstand in the back and I have had no stability problems. Four AAA batteries, two in the sender and two in the receiver power the system. Hopefully, it will last at least a year. My only regret is that the device has no clock.",
      "rating": 4.0,
      "verified": true,
      "author": "Frank Yee",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "It works well as a basic gauge",
      "text": "The documentation is excellent, as are the controls on the device. That made setup quick and easy. This is not the backlit model, but the display it big and clear in all but a dark room. I like the kickstand. The one issue I have is with the size of the outside sensor. It's kind of wide. The sensor that came with my old unit fit nicely between the screen and the window, so there was no change of it falling off the ledge. This sensor is too wide for this, and I had to place it out on the ledge. We shall see if severe weather knocks it off. Otherwise, I'm very happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Alleluia",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Stopped working after 1 week.....",
      "text": "Received Thermometer and it worked well at the beginning. However, after less than a week it stopped reading the outdoor temperature. I changed the batteries figuring the cheap ones that came with it had run their short course and it started working as normal. Unfortunately after a couple more days it happened again. Tried changing the batteries again but this time it would not connect. Went through the setup again per instructions but would not connect to outdoor reader. My wife called and they are sending a new unit for us to try. Hopefully it will work better the second time around.",
      "rating": 2.0,
      "verified": true,
      "author": "Catfish76",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Received mine today",
      "text": "I received my unit today got it all set up put the remote sensor out on my deck and a few hours the outdoor temperature reading was way off as was the humidity reading contacted the company and they have shipped me out a replacement remote sensor free of charge and without issue. Outstanding customer service I will update my review when I receive my new remote sensor. Update, this unit works great indoors, received my replacement remote sensor and sad to say as an outdoor remote sensor not good at all, the outdoor temp was off by 20 deg and the humidity was off by about 30%. I will be returning.",
      "rating": 2.0,
      "verified": true,
      "author": "david demers",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Works exactly as intended",
      "text": "Works perfectly, great price, nice and compact, clear b&w display. Only slight downside is I wish it had an external power option so it could run off a power supply and have a backlight - but I knew it didn't before purchase. Replaced an expensive AcuRite unit that first had display failures, then shows 1-4% humidity when another Acurite unit (they can share sensors) reads correctly - as verified by this new unit, plus a couple of indoor-only gauges I have.",
      "rating": 5.0,
      "verified": true,
      "author": "EFlyGuy",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Good for the price",
      "text": "I must like the product because I’m on my third one Price, ease of use are the pros. Longevity is the con. All three of my remote sensors.still work fine and transmit accurate data to my third display unit. One could think that the remote sensors would fail in MN weather but not the case. Rather my first display unit just crapped out after a few years of use(no complaints there). My second display lifespan was only months with the surprising failure being that it would not display “inside” temp",
      "rating": 3.0,
      "verified": true,
      "author": "Dave H",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "On My 2nd one and it already broke",
      "text": "**Edit 4-19-2020- I am now on my second ThermoPro and my second one has already broke. I keep the outside part outside in a dry safe place. I do not know what happened. Super bummed, I was really excited about this product and it was working great. Will be changing from 5 stars to 2. *Original Post* My friends were laughing at me when I bought this but now all of them want one. It is really accurate and being on the East Coast I like to see what the humidity is outside and inside. So happy with my purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Kayla Burke",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Failed less than three months.",
      "text": "This thing is failing in less than three months. The remote unit keeps going out. It seems like the batteries are dead, but resetting the unit per the directions brings it back up after a lot of fiddling. This happens more than once a week. Now it's started to stick at one temp and broadcast that wrong temp until a reset. This item was meant to replace a more expensive unit that died after three years. I'm starting to believe there are no really good ones at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 4,
      "publication_date": 20171218
    },
    {
      "title": "Excellent value.",
      "text": "If you can put batteries in a gizmo...you can use this! Has plenty of range to read inside of chicken coop on back corner of property...90' plus a concrete wall (and wooden chicken coop too). Chicken wire enclosure does not affect it. Reads to an accuracy of 10th's of a degree. This reads both inside and outside temperature and humidity. Certainly looks like an excellent value so far!",
      "rating": 5.0,
      "verified": true,
      "author": "RCP",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Sensor re-sync issue",
      "text": "Approximately every 3-4 weeks, because the outside sensor indication stops reading properly, I have to: 1.Take the battery cover off the outside sensor 2.Press sync on the inside receiver 3.Press TX on the outside sensor 4.Reassemble outside sensor battery cover 5.Place both devices back in their normal location This SUX! I've contacted Seller and await a reply. Edit: Seller contacted me promptly and sent a free replacement. The new one works perfectly and battery life in the main receiver is now around 4 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Zinoswink",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "ThermoPro TP-60S Digital Hygrometer",
      "text": "Easy set up and work well. A little small. They have several models. I thought I had purchased the same one prior but didn't realize from the picture (they look similar) that this model was smaller than the one I had (the TP65). I should have looked at the dimensions or checked the model number of the other one I had bought a few months ago. This is why it seemed like such a bargain when I clicked on it impusively without checking. Not such a great value compared to that one.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Mendelberg",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Just What I Was Looking For",
      "text": "Ideal! I have used an indoor/outdoor thermometer for years. The first one lasted years, and was pretty accurate. The second only a few months, the read out was poor and it ate batteries. I went a few months without replacing it, but really missed the info. Although I hadn't heard of this brand I decided to try it based on other's reviews. It arrived quickly, was packed well, included batteries and a tiny screwdriver and was up and running in 5 minutes. I have found it to be accurate, and the addition of the hygrometer is a plus for me. In fact, I bought a second one as a gift to son and family.",
      "rating": 5.0,
      "verified": true,
      "author": "Shrimp",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Products fails in less than a year.",
      "text": "Initially this product was great. I've had this product for a little under a year and the remote sending unit has become inaccurate. It has been kept under a patio and out of the weather. The unit still appears as if brand new with not wear. Within the last month the temperature information provided would often drop off 10 - 20 degrees below that actual temperature. No it reads around -50 when its really about 35 outside. I've tried changing the batteries and resetting both the display and the sender, but that only temporarily fixes it if at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Fitzwell",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Thought it died again but I was wrong.",
      "text": "The transmitter died not long after I first bought the set but it was replaced under warranty. I thought the transmitter died again because no matter what the temp outside actually was, the reading said 74 degrees F. But after spending more time experimenting, I found the problem was low battery power in the indoor receiver unit. The low battery power wasn't obvious but I recharged the two NiMH AAA cells I had in it and and the set resumed working. There probably ought to be a battery indicator on the display.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas Stover",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "It works as advertised; easy set up",
      "text": "I'll give it a 5-star rating because it is quite easy to set up and program and, just for folks concerned about quality, the sensor was left fully exposed to a rain deluge that rendered the sensor completely waterlogged. The batteries needed to be swapped, and there was minor corrosion, but the sensor survived. I'd recommend making sure it is not fully exposed to summer downpours.",
      "rating": 5.0,
      "verified": true,
      "author": "F.R.",
      "helpful_votes": 2,
      "publication_date": 20170627
    },
    {
      "title": "Temperature and humidity, in and out, min and maxo. Works well!",
      "text": "This model T60S has replaced the older T60 and has improvements in the transmitter. The batteries can be replaced without using a screwdriver. I bought 5 additional units to give as door prizes for my garden club. I have one of my home 3 transmitters in my garage. I like the accuracy and the sharp displays. My only problem has been the angle of the display screen does not catch the light in the room. I have made angled blocks of wood that hangs the display at an angle that catches the light for the display.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Coppernoll",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Great basic unit, good value and demure size.",
      "text": "I like the unit quite well, it set up quickly and connected to the outside unit with no issues. Took outside unit to my little shop outside and it stayed connected. Now I can see outside temp before letting my puppies out each morning and know if I'll need a jacket going to work. My only qualm is that unit is small compared to the unit had previously, it is 2.5 by 3 inches. Even with demure size it is quite easy to read.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynwood Hightower",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Great Device!",
      "text": "We have set up a green house in our garage using a tent of heavy duty plastic walls and mylar overhead with growlights and a heater for our dwarf fruit trees. This device allows us to see what the temp and humidity is inside the tent without walking into the cold. My husband is very watchful to this device and depends on it to let us know if the temp is not right for his babies. We were previously wintering these trees in the sun room, but carrying them up the steps has become too difficult. So far this setup is working wonderfully!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "gasquelm",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Great Little Device",
      "text": "This product is replacing an Ambient Weather Station that stopped syncing, had difficult to understand instructions and poor customer service (no return call). I set my new ThermoPro weather station up in a matter of minutes and it synced immediately. Enclosed in the box is a laminated card with customer service info, very impressive. So far I love this device. If someone is looking for a station with more info this wouldn't be the one, but for someone like me who really only want to know the indoor and outdoor temps, it is fantastic!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Be Cautious of other units nearby",
      "text": "I made the mistake of testing my neighbors unit, which, gave me confidence I'd get reception from the remotes in my application. However, signal strength from my neighbor's remote units is pushing through my own. I wrote the company and asked if they had any solutions. Not a word. So - be wary of similar units nearby. My situation may be different or rare. But the company surely knows the potential for this happening and does not disclose it. So - decent product. The company? Not so much. Update. One year on, it died. I reached out to the company over two weeks ago. Crickets. I'll try someone else's junk just for variety.",
      "rating": 1.0,
      "verified": true,
      "author": "windguy",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "A little story: I received it right before I ...",
      "text": "A little story: I received it right before I left for vacation, so after i came back, I assembled it and it did not work, so i contacted the seller, they were very prompt and gave me suggestion to do a hard re-boot, which helped and from about October 10 until November 13, it worked well. Then the sensor light started to flash and unit stopped showing temperature outside, which was the only purpose of this purchase, i tired to replace the batteries in the sensor (it lasted only one month), it did not help, so here I am, too late to return, and have gadget that does not work.",
      "rating": 2.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "So far, so good.",
      "text": "Where I have give. It 3-stars it’s because I don’t know whether it’s really weather proof or it’s accuracy, although the temp reading were certainly in the ballpark. I got this to use in my Motorhome. I haven’t found a good place to place the outside unit, so just placed it in a picnic table on the first day. I do like the stand for the inside unit, no need to drill a hole or “stick” it somewhere. It is a way to read and living in Missouri, I like knowing the humidity. So yes, so far I am happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Dseabee",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "very simple set up.",
      "text": "This is doing a very good job. I t was very easy to set up, and I like that the outdoor box is rain resistant. It is very accurate. The indoor temperature of the device always is the same as my thermostat reading. Numbers are easy to read, and it also gives the humidity of the indoors. I have not had it long enough to comment on the battery life or durability, but I am confident that if there should be a problem iTronics will handle it quickly and fairly. I also ordered a second one as a gift for a friend, and she loves hers, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Harlean Greathouse",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Works for indoor temperature but outdoor is sketchy",
      "text": "This unit is easy to read but the signal to the outdoor unit is not reliable. It comes and goes routinely. Sometimes it is strong and steady and others it just won't connect. The temperature reading is a full 4 degrees different that the other unit in the house and I don't know which is correct. I had a unit I loved before that I wanted to replace since I misplaced it during a move. This one is OK but not as good as I would like.",
      "rating": 3.0,
      "verified": true,
      "author": "SDC",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Not perfect, but functional enough",
      "text": "I bought this to monitor temperature and humidity in two places: Inside my broken microwave in my kitchen where I keep my plant cuttings and inside of one of my mini-greenhouses on my terrace. This was working fine at first. But after a week or so, it stopped showing me the outdoor stats. I’ve reset it, and it would work fine for a bit but stops working again. But the inside stats are shown correctly and consistently, which helps.",
      "rating": 3.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Accurate and convenient",
      "text": "I have had 4 of these units (and 2 Taylor brand)...All have been accurate but...and this is a deal breaker for me...the Taylors are not made to hang on a hall. I do not understand complaints of inaccuracy; I have compared them both with an old fashioned glass thermometer and with a 70-80 year old steel with 10\" arm (which I believe once hung in a service station window)...and all units are within 1-2 degrees (The ThermoPros have identical readings!). I also complement the customer service which promptly corrected MY OWN ERROR when I ordered a wrong model #.",
      "rating": 5.0,
      "verified": true,
      "author": "Logs",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Five Stars",
      "text": "November 2017 - Very nice product so far. Accurate temperature and humidity for indoor and outdoor. Recommend this product. April 2018 Update: in 5 months the outdoor unit stopped working. I contacted the company and they sent some trouble shooting ideas. I tried them and after about 4 tries following the prescribed trouble shooting technique the outdoor unit started working again. Unfortunately, in a few days it stopped again. I contacted the company again and they sent a replacement unit quickly. I am impressed with the customer service. Hopefully, the replacement unit will not fail like the first one. I am leaving the 5 stars because of the customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "JmJen",
      "helpful_votes": 0,
      "publication_date": 20171118
    }
  ],
  "product_meta": {
    "title": "ThermoPro TP60S Digital Hygrometer Indoor Outdoor Thermometer Wireless Temperature and Humidity Gauge Monitor Room Thermometer with 200ft/60m Range Humidity Meter",
    "rating": 4.1,
    "feature_bullets": [
      "【Informational】Weather stations wireless indoor outdoor records all time/24 hours MAX & MIN temperature and humidity readings; Wireless thermometer indoor outdoor with temperature trend arrows indicate whether it’s getting warmer or colder near the remote temperature monitor",
      "【Smart Design】Inside outside thermometer hydrometer measures indoor outdoor temperature and humidity percentages simultaneously; Temperature and humidity monitor can display the readings from up to 3 temperature sensors to monitor different locations【Additional sensor can be ordered (ASIN B072BY1M2V/ B07M6SCWZR/ B07RDPYK1K)】",
      "【Hands-Free Monitoring】Wireless thermometer outdoor with strong signal penetration humidity sensors to get the temperature and humidity records from 200ft/60m remote range away; Tabletop or wall-mountable design; Powered by AAA battery (included)",
      "【Widely Application】Indoor/outdoor hygrometer wireless ensures proper temperature and humidity control, which has important skin, allergen and other health benefits, Termometro digital can be placed in baby room, nursery, cellar, basement, warehouse and greenhouse"
    ],
    "specifications": {
      "Product Dimensions": "3.1 x 2.6 x 1 inches",
      "Item Weight": "6.1 ounces",
      "Manufacturer": "ThermoPro",
      "ASIN": "B06XKH666P",
      "Item model number": "TP-60S",
      "Batteries": "4 AAA batteries required.",
      "Customer Reviews": "4.1 out of 5 stars9,805 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#790 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Warranty Description": "1 years warranty.",
      "Batteries Required": "Yes",
      "Included Components": "4 x AAA Batteries included"
    },
    "categories": [
      "Outdoor Thermometers",
      "Patio, Lawn & Garden",
      "Home & Kitchen",
      "Outdoor Décor",
      "Thermometers & Weather Instruments"
    ],
    "price": 19.99
  }
}