{
  "website_summaries": [
    {
      "verdict": "An iPad stand that offers tremendous strength and durability.",
      "pros": [
        "Includes a 360° base, bracket holder and folding arm to offer maximum flexibility",
        "One-button functionality ensures you can instantly attach or detach your iPad from the stand",
        "Weighted base helps keep your iPad in place",
        "Can be used with both Apple and Android devices"
      ],
      "cons": [
        "Intended for point-of-sale applications",
        "Tends to wobble at times"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product",
      "text": "This has been a life saver for us. My husband and I do trade shows. We started using an I-Pad to process payments. This is perfect. It rotates left/right and back/forward. I do put my hand on the back of the I-Pad when customers are signing for their credit card transactions, just because. Really no reason, I just do it. Some people press very hard when they write, and I just don't want to take a chance of it falling backwards. You can put the I-pad vertical or horizontal. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy McNemar",
      "helpful_votes": 25,
      "publication_date": 20190723
    },
    {
      "title": "VERY PLEASED",
      "text": "This is in the rank for best purchase I have made on the ZON all year! I love this stand for my ipad mini! Also fit my iPad and iPhones. It swivels and the parts that hold the divines also turn for different direction (vertical or horizontal) uses. Very durable and extremely sturdy! Did I mention I LOVE this product!!!!!! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Shawntam",
      "helpful_votes": 24,
      "publication_date": 20190311
    },
    {
      "title": "Very Sturdy Stand",
      "text": "I bought this stand to hold my iPad at Fairs and Markets so I can easily access the Square app for purchases. This stand is very sturdy and the base weighs enough so that it does not get knocked over. I have read the other reviews about the holder having some play in it, but this has not been the case for me. I did have to take my iPad out of the case it was in because the case made the iPad too thick and I could lock it in. All in all I would highly recommend this stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Kirkland",
      "helpful_votes": 24,
      "publication_date": 20181226
    },
    {
      "title": "Strong and Sturdy",
      "text": "I was a little weary about buying this product not knowing if the base strong. I didnt want a plastic lightweight product to hold my ipad. This is not that. It's made really well. The bottom base has a heavy weight to it to keep it from tipping over when using it and it also holds the ipad strongly in place. I couldn't have asked for anything better. I also love the white color. It's not off white nor bright white, its sort of a cloud white which makes it staying clean, easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Ortega",
      "helpful_votes": 32,
      "publication_date": 20190111
    },
    {
      "title": "quite sturdy",
      "text": "Love this stand. Started with my iphone, went to a small tablet then to my larger tablet. I will be using this in a retail situation and wanted to be able to swivel it around for customer to sign. This will make things so much easier. Attached my Square and will be ready to go. Base is a good weight and neck and clamps very sturdy..no bouncing when using. Just received this and I think it will work out very well. Good price and fast delivery. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "CLAY LADY",
      "helpful_votes": 28,
      "publication_date": 20181011
    },
    {
      "title": "Don't recommend it for high use",
      "text": "flimsy and only swings in one direction. Don't recommend it for high use. ***** Update - The seller contacted me after seeing my one star rating of the product. He offered to reverse the charges which I highly appreciated. Plus offered to replace the unit. Seems like good business practice.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Talavera",
      "helpful_votes": 14,
      "publication_date": 20171129
    },
    {
      "title": "Great product for home and office",
      "text": "I purchased this kiosk iPad stand to use in the home as we were turning an old iPad into a family calendar/message center. The I liked that the stand came with two different sized claps used to hold the iPad in place. After about a month of use, the Gen 1 iPad was replaced with an iPad Mini. It was so easy to replace the claps holder on the stand. With the kids handling the unit, we have not had to worry about the entire unit toppling over. Great quality product and extremely versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "The Infochick",
      "helpful_votes": 18,
      "publication_date": 20180929
    },
    {
      "title": "Love it",
      "text": "I love it was so excited when I got it especially since how much it cost I have a Galaxy Note 5 with the OtterBox it fits lengthwise just fine with the OtterBox of clamps on it or not wide enough so it doesn't sit in there properly without the OtterBox It Don't Fit it all it's too short my phone is the tablet one I almost dropped it one day and I caught it and then one of the prongs is broke off easily so I had to glue that back together the same day that I got it other than that love it",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal AutismMom",
      "helpful_votes": 18,
      "publication_date": 20180816
    },
    {
      "title": "Wasn’t sure if they would work, yea they do.",
      "text": "I used this to hold up 2 Samsung tab E tablets (9.7” I think) and use them as kinda kiosks at the shop for customers. I’m surprised they hold the tablets so well, I was pessimistic about it but have full confidence now in them. Do it",
      "rating": 5.0,
      "verified": true,
      "author": "338 Lapua Shooter",
      "helpful_votes": 14,
      "publication_date": 20190923
    },
    {
      "title": "Very sturdy stand. I use it everyday.",
      "text": "Love the sturdiness of the stand spring loaded bracket that holds the iPad and the stand. One thing I don’t like is the the swivel feature is a bit sticky going one way but smooth the other way. It would be nice if it was smooth both ways.",
      "rating": 5.0,
      "verified": true,
      "author": "kelisurfs",
      "helpful_votes": 15,
      "publication_date": 20190706
    },
    {
      "title": "I bought this stand based on all the good reviews it had the quality of the stand is ...",
      "text": "I bought this stand based on all the good reviews it had the quality of the stand is good overall but there is a major problem with the locking mechanism of the holding bracket there is too much play it swivels left and right when you touch the ipad and I just hope it lasts with the use I'm going to be giving it at expos and at my showroom hopefully the vendor stands behind its product.",
      "rating": 2.0,
      "verified": true,
      "author": "AVMPhotoBoutique, Inc",
      "helpful_votes": 12,
      "publication_date": 20180330
    },
    {
      "title": "Works Great",
      "text": "I love this stand. It is exactly what I was looking for to use in my business. I required a stand that would allow me to be hands free while showing my product. It is very sturdy and hold my iPad Pro perfectly. Live that it is very versatile on the angles you can move it to. Will definitely buy again if I ever need another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie O",
      "helpful_votes": 14,
      "publication_date": 20190416
    },
    {
      "title": "Love it!",
      "text": "Love it! Can't believe I waited so long to get one. Beats having to hold it or deal with floppy stands that just dont work. Love the grip on the bottom that holds it securely in place. Keeps the pad more comfortably at eye level. Recommend this for anyone with a tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "BOGART",
      "helpful_votes": 13,
      "publication_date": 20190321
    },
    {
      "title": "Great quality",
      "text": "Used daily for a year. I never had an issue with this product. The only negative is it spins one direction - not really an issue but my kiddo forced it to spin the wrong direction and broke it. I'm purchasing another one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20190411
    },
    {
      "title": "Excellent product...",
      "text": "This is a very well made stand and well thought out. It fits the iPad pro 12.9 inch model perfectly. Assembles in under a minute and it secures the iPad making it easy to rotate from landscape to portrait position along with the ability to tilt and swivel the iPad to the position you need. I have started to use my iPad more as my everyday computer and this stand makes it comfortable to use for long hours. My only regret is not buying this sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "DanC",
      "helpful_votes": 22,
      "publication_date": 20170604
    },
    {
      "title": "Didn't last 2 months before falling apart.",
      "text": "I have a nearly identical stand that I used for my previous iPad, made by AIDATA, and I have had it for 2 or 3 years. I bought the iPad Pro which is too large for the stand that I already had, so I bought this one. I haven't had it for 2 months, and it is about to break--the piece that allows you to rotate/change orientation of the tablet has become incredibly loose and based on the other reviews of people that have had this same issue (that I only just now read) it is most likely about to break, and I no longer trust it to hold my iPad. Thoroughly disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 5,
      "publication_date": 20180808
    },
    {
      "title": "New Business Use",
      "text": "I'm so excited about this tablet holder purchase! These will work perfect to hold my business iPads (I purchased two). I didn't want to have to start with the square system holders right off due to the expense. These were easy to put together, however there wasn't any instructions but common sense should do it! If I decide to upgrade to larger iPads, I can still use these holders. I love the fact they twist and tilt, which is needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Santana",
      "helpful_votes": 20,
      "publication_date": 20170811
    },
    {
      "title": "... for my new iPad & I couldn't be more pleased. I holds my 12",
      "text": "This is my 1st stand for my new iPad & I couldn't be more pleased. I holds my 12.9\" perfectly when protected just with shell case. Although a thicker case poses a problem (if too thick, stand brackets can't grasp the iPad edges properly), this item has great stability and holds securely. It also has great viewing angles and rotates for multiple viewing angles and perspectives. I'm very pleased that I can place iPad in the stand and watch TV / movies from other side of the room with no difficulty. I would buy again -- if I needed another!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jazzy D",
      "helpful_votes": 21,
      "publication_date": 20180529
    },
    {
      "title": "LOOKS GREAT BUT BROKE TO $@ AT 30 DAYS.",
      "text": "I loved this product SO MUCH at first but I don't write reviews until I've had something for a little while. Well, this is prime example why. It cracked all to hell and broke off at the base, screw came out, no way to even fix it. Completely broke POS. I never dropped it, it was wonderful for an entire 30 days then bam, fell apart. So annoyed.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephenie LeFevers",
      "helpful_votes": 5,
      "publication_date": 20190616
    },
    {
      "title": "nice stand",
      "text": "really a nice stand. been using it for the past few weeks. seems like it will hold up in the long run. using it for a POS at our start up winery. the base is heavy enough that moving it around with the tablet on it doesn't tip it over. Holds the tablet very secure.",
      "rating": 5.0,
      "verified": true,
      "author": "PlaysCbricks",
      "helpful_votes": 13,
      "publication_date": 20180713
    },
    {
      "title": "Bad manufacturing",
      "text": "I bought 16 of these for a work event and ALL OF THEM were not manufactured correctly and wouldn’t assemble. Such a waste of time. Amazon let me return them, but it was annoying",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181130
    },
    {
      "title": "Perfect! We use this as our square stand on ...",
      "text": "Perfect! We use this as our square stand on a daily basis in our consignment shop. We run Credit cards on it, customers sign on it, we are working this thing everyday and it has held up really well. The only thing to keep in mind is the placement of the clamps to your charging port. The clamp ended up right over top of the charging port so our is actually seated of center so we can plug in our tablets's power cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Garton",
      "helpful_votes": 13,
      "publication_date": 20180108
    },
    {
      "title": "Simple Design, Great Versatility!",
      "text": "The stand is a little shorter than we expected, but it works very well with our iPad's protective case installed. We placed the stand on an elevated surface and it is at the perfect height for typing. Also, we are able to wrap our security cable through the opening of the riser, and it all works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Feldmeier",
      "helpful_votes": 14,
      "publication_date": 20171120
    },
    {
      "title": "Great product, but does not work with Mini IPad and swipe simple plugged in to the audio jack",
      "text": "Nice product but I bought it to upgrade my iPad Mini stand that we use in an office as a POS point of sale device. The pictures shown must be with a full size iPad. With the mini, the clamps of the stand are right next to the audio jack making it useless with swipe device. If it were possible to mount the mini from the narrow side it would work. I RETURNED THE PRODUCT AND THE COMPANY CONTACTED ME WITH A LINK FOR THE PERFECT IPAD MINI STAND THAT DOES WORK WITH A SWIPER:  AWESOME CUSTOMER SERVICE AND THEY FOUND ME THE PRODUCT I NEEDED!",
      "rating": 5.0,
      "verified": true,
      "author": "julian c from wv",
      "helpful_votes": 17,
      "publication_date": 20180402
    },
    {
      "title": "Love this stand! Perfect for watching shows or as a stand while making a recipe.",
      "text": "I love this stand. It is sturdy and a can be used for a multitude of purposes. I have used it to watch shows while baking, as a stand for my recipe app, as a stand while typing docomentsbfor work on my Bluetooth keyboard and as a stand for my Partybooth app. which was a huge hit! I have gotten many compliments on this stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Coline Emond",
      "helpful_votes": 12,
      "publication_date": 20180319
    },
    {
      "title": "It was great for two months but then 👎",
      "text": "I bought this to hold my iPad that I was using to check customers out at my boutique. My boutique opened on May 4th. Two days ago it started feeling loose. Wouldn’t hold the iPad straight. Today I turned it for a customer to sign their CC transaction and it falls apart. Fail. I expected it to last longer than two months.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Helm",
      "helpful_votes": 6,
      "publication_date": 20180628
    },
    {
      "title": "Love it!",
      "text": "Live this sturdy little stands. It's perfect to use for accepting square payments or to hold iOS while recording demos, FB Live videos or tutorials. It swivels, turns and is weighted enough to feel comfortable leaving it on a table and not worrying about your iPad being knocked over. It holds my iPad 9.7 screen perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "StephRenae2508",
      "helpful_votes": 14,
      "publication_date": 20170622
    },
    {
      "title": "It's All About the Base",
      "text": "I was looking for a sturdy base where my child can button mash the screen without it tilting over with the ability for a 90 degree angle so the camera wasn't point at the top of his head or ceiling. I came across rotating stand and it does the trick. The base is extremely sturdy and won't fall backwards/tilt when the screen is pushed by kids that don't understand the word \"GENTLE\". This is able to turn vertical and horizontal, by simply just rotating the tablet. As you can see from the photos it's a nice fit for even the 12.9 iPad Pro. So far so good!",
      "rating": 4.0,
      "verified": true,
      "author": "G. Ku",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Great idea.",
      "text": "Love it. Can keep it sitting on our kitchen counter all the time to talk with Siri about the weather or whatever. Then it is hand.to to use to watch Netflix. Easy snap out to put it inside its cover to take somewhere. Glad that a friend recommended it.",
      "rating": 5.0,
      "verified": true,
      "author": "Light and Harmony",
      "helpful_votes": 13,
      "publication_date": 20171011
    },
    {
      "title": "Great value stand",
      "text": "Just received this. The product is great - very stable. I had one question and customer service was very responsive. A great value. Not an ideal fit for the Fire 8 (2017) in the horizonal position - hard to avoid the buttons - but we made it work.",
      "rating": 5.0,
      "verified": true,
      "author": "Nauticow",
      "helpful_votes": 13,
      "publication_date": 20170611
    },
    {
      "title": "The stand is definitely sturdy and grips my iPad Air well",
      "text": "Received the stand today – a quick review. The stand is definitely sturdy and grips my iPad Air well. It’s not going to slip off. It also does as stated – rotates 360 degrees and has adjustable angles. Two things I didn’t know. First – it only rotates clockwise, not counter clockwise. Not a deal breaker but you’ll need to adjust you cable connections according. Second – while the iPad is secured within the bracket holder, there is some ‘play’. It’ll rock to the left and right. Again, not a deal breaker but just thought I’d mention it. Over all, I’m happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Sturdy, well made stand",
      "text": "I like it a lot, it's sturdy, no worry about my ipad falling out, or the unit tipping over. I just pick up the whole stand by the vertical part and carry it from room to room. It rotates the ipad clockwise, but I can't rotate it counter-clockwise to the position it was in to start with. That sounds minor, but it is annoying to have to go all the way around when I just want to go back one click--especially when I have the ipad plugged in. And that happens a lot. BUT...when it's vertical it stays solidly vertical, when it's horizontal it stays horizontal--no wobbles. I never use my ipad cover anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "Granny",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Check immediately for flaws - see other reviews",
      "text": "Received item. No instructions & screw to hold together fails to do so. Am requesting replacement but after reading reviews here about it falling apart so easy and fast, am not optimistic about quality as many reviews state it falls apart. Needs a washer. CAUTION.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarassheena",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "This is one of the best purchases I have made for my small side business",
      "text": "This is one of the best purchases I have made for my small side business. It can be separated into two pieces, which makes it compact and easy to store/transport. It is sturdy and can be tilted to different heights. It fits my old Ipad but can be used for various size tablets. It can be turned vertically or horizontally. It makes my checkout process professional and convenient for customers. You can see it in the back right corner of the photo, setup for one of my shows!",
      "rating": 5.0,
      "verified": true,
      "author": "CRoss",
      "helpful_votes": 2,
      "publication_date": 20180121
    },
    {
      "title": "Using for POS",
      "text": "I am using this in my store for POS transactions. I love that it comes with two different heads so it should really fit with almost any tablet. I have a I pad mini and a I pad and its great! I love that the base is heavy enough to allow you to just swivel if you need a signature or while you enter the transaction. This is also cheaper then any stand the POS co would offer. Great option at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "CCOTop Contributor: Nail Art",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Really good value!",
      "text": "I use this for on-site usage with an ipad so our guests can sign our electronic waiver. It has been surprisingly sturdy and easy to set up. We travel to our event sites and it gets packed and unpacked assembled in a storage tote. It had survived this season VERY well and has never fallen over, slipped off a table, or broken. I think I may buy a couple more as we expand our event registration towards paperless.",
      "rating": 5.0,
      "verified": true,
      "author": "skrause",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Worked Very Well for Our Conference",
      "text": "We used these stands as part of a conference we host. We used them at the check-in desk and they worked really well for swiveling between myself and the attendee. However, the top piece where you would rotate the iPad only works in a clockwise position so sometimes it took a few extra rotations to get the iPad in the correct direction again. It was easy to assemble and was sturdy during 3 and a half days of use. I really liked how it came with two different sized tops to fit a variety of devices in different ways.",
      "rating": 4.0,
      "verified": true,
      "author": "Brianna S",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "An awesome way to make a tablet into a point of sale terminal",
      "text": "This device is a great design except for the limitations of tablet sizes it will hold. It rotates, tips and swivels. I use it to hold a 10\" tablet for point of sale transactions, and can simply flip the tablet over for the customer to sign. Well worth the money spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Darryl",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Holds My tablet securely",
      "text": "Needed a secure tablet Stand in my TV Control room. The Clamp is secure enough to hold an 8 inch tablet with multiple cables attached. Bonus, It comes with two size clamps and is easy to install. The only downside is that it spins a little to easily. But if you are looking for a unit that rotates easily, then this is the unit for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Lleland Abernathy",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Not Really for Business",
      "text": "This is an okay stand but not really good for a business to use. Once the ipad is in; its very shaky and unstable. The ipad slips around so you are constantly centering it again. Also there is not lock. Our ipad was stolen 4 days after buying this stand. In hindsight I sure wish I had bought a locking stand. This stand is more geared to home use.",
      "rating": 3.0,
      "verified": true,
      "author": "kayscrochet",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Easy for adult to adjust",
      "text": "The footprint of this product is quite small. It holds on to the tablet securely. I love that it can be rotated 360 degrees, tilt it at a certain angle. Though easy for adults to adjust the angle, my child needed more help as he tipped it multiple times trying to adjust it during his zoom class.",
      "rating": 4.0,
      "verified": true,
      "author": "SewCakeNPretty",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Good \"in place\" holder, not ment for extended reach movement.",
      "text": "I didn't research this product well enough. While the tablet is on the chairside table, I was expecting to get easier access to the screen while sitting in my recliner. Not so. I still have to reach far. This device only elevates tablet about 4 inches, swivels 360°, and tilts back, While base is in place on the table. I guess I need a long arm adjustable tablet holder.",
      "rating": 3.0,
      "verified": true,
      "author": "david m.",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Best tablet stand ever!!",
      "text": "I just received the 3 stands yesterday and they are so nice. I have 2 9.7” tablets and 12.9” tablet and they work perfectly for all 3. You would be crazy not to order this tablet stand. They are truly the best stands I have ever owned!! Perfect for remote learning! Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "RLZ",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Liked it for a month....",
      "text": "I liked the stand for the first month. It is sturdy and fit my ipad pro. Then I went to adjust the tilt of the stand and one of the tabs that hold the tablet in place just snapped off. Pretty expensive for molded plastic for it to break under normal use just from the pressure of holding an ipad in place.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Clark",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Great for On-Line Meetings",
      "text": "Purchased this to mount my iPad Pro during meetings. Sturdy design, almost like the ones used in electronic department stores. Will hold your iPad vertically or horizontally and pivots on the vertical axis, and a horizonal axis. I would definitely purchase this for a friend or co-worker.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric S.",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Poor Quality",
      "text": "Returning this. Flimsy and cheap. Poor quality stamped metal. It wobbles and spins every time you touch it. NO.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob B.",
      "helpful_votes": 4,
      "publication_date": 20180222
    },
    {
      "title": "The stand works pretty well. It's nice and sturdy",
      "text": "The stand works pretty well. It's nice and sturdy, however, our tablet just fits without having to extend the part that holds the tablet. The only way for it to hold our tablet is horizontally and then it's a little bit loose. Since the volumne and power buttons are on the top edge of the tablet in this position, it wiggles a little when you're trying to push on them. If we put it in vertically the tablet slides to the bottom of the stand. Wish it was just a little smaller.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra Davies",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Good sturdy stand for Tablets",
      "text": "Great sturdy product! However, the screw to hold the top and the base was too short and too small. I had to go and buy a screw to it together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Not a good buy for business",
      "text": "When you touch the iPad the stand moves all over the place. I’ve even put the rubber mat under it but now it just tips over. I will be looking for a replacement as I can’t have this tipping over.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer C.",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Ipad 11 pro pencil charging issue with this sturdy stand",
      "text": "I used the bigger frame to hold my ipad 11 pro but i need to charge my apple pencil for that i have to remove ipad from this frame bcz i can put this frame vertically its not stretched tht much.i did not realize when i bought this.its. Very sturdy No doubt.",
      "rating": 4.0,
      "verified": true,
      "author": "Jass gill",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "I Pad Holder",
      "text": "I have one dislike of the unit, it only rotates in one direction which causes the panel to dislodge. Also it is difficult to reset the panel on the stand with an I Pad on it. Otherwise it is a great stand. That the reason for the four stars.",
      "rating": 4.0,
      "verified": true,
      "author": "James Smith",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Received a preowned stand",
      "text": "I received this AboveTek universal tablet stand in a timely fashion. When I opened the the Amazon envelope and removed the stand and screen protector the box containing the stand was bulging with one end noticeably forced shut. I opened the box and removed the stand parts , in bags that were torn open and the tape was mangled and not sticking to the bag. I then looked at all of the pieces and determined they were OK. I think Amazon should have sold this product as pre-owned and not as new. Tisk, Tisk I hope I don't have any problems when I try To use it. I'll keep you informed",
      "rating": 3.0,
      "verified": true,
      "author": "Brian Henson WYoNaturals ",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great for students tablets for online learning.",
      "text": "Our kids are 6 & 7, so when they sit in a chair, the tablet camera's done see them very well. So we bought these to help with that. They are very sturdy and help our 2 with their school work.",
      "rating": 5.0,
      "verified": true,
      "author": "Abbadeer",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Functional and easy to use",
      "text": "While my tablet weighs more than the stand I find that, as a whole, it feels very stable. The interchangeable holders would be more useful if I had a larger phone (my phone is to small for either) but over all I'm pleased with this unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Roger Buzby",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Met expectations",
      "text": "Explanation of my ratings: Exceeds expectation 5 stars Met expectations 4 stars Met some not all 3 stars Mostly failed 2 stars Wish I skipped this purchase 1 star I add nothing more to evaluating",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth R.",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "False size advertising",
      "text": "I got this stand because I figured it would make a nice terminal for when I do craft shows. This listing states that it fits tablets 6-13.5\" but apparently my 10.1\" tablet does not fit into their dimensions???? Make sure you don't have a 10.1\" tablet or else this will not work for you.",
      "rating": 2.0,
      "verified": true,
      "author": "TrustInPaws",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Good Table Stand for Tablet, Two Suggestions",
      "text": "I really like this device. Used with an iPad Air in landscape mode, the stand was stable and rotated in all the necessary dimensions. Two suggested improvements: 1. assemble/disassemble without a screwdriver (or equiv..) and 2. eliminate swivel play in the stand to frame connector. I'd purchase again (and did).",
      "rating": 4.0,
      "verified": true,
      "author": "Gadget Dad",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Great but not durable over 1 year",
      "text": "Great functionality used for our little retail shop. But the holder on the side broke and this is no longer usable after a year.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "The product is pretty solid. The base is nice and heavy so ...",
      "text": "The product is pretty solid. The base is nice and heavy so the stand does not tip over. I like the click latch to help spin the tablet in any angle. I would recommend giving extra screws for this product. This product only came with one screw, but I notice you can add more at the bottom. This product felt like it was missing pieces. Over all after the set up it’s pretty solid except for the plastic feel.",
      "rating": 4.0,
      "verified": true,
      "author": "Thien Huynh",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Misleading packaging",
      "text": "I am only giving this item 4 stars because I feel the description and packaging is misleading. One spot on the box states the bracket would fit 6”-11”. Another spot claims it fits 6”-13”. It does not fit 13”. The item itself is good quality and will hold my iPad securely.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Think it will Definitely Work for iPad Pro",
      "text": "I liked that it was easy to assemble. I thought it would telescope a little more, but seems pretty stable. Now that more people are using face-time, etc., I feel this holder will do trick.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Jones",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Centering is off",
      "text": "While it does work, it tilts to the right preventing my screen from being centered. Appears to be a bit loose. For the price point, that's a bit disappointing but it'll so for now.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "good item did the job",
      "text": "It is made of plastic and it has a sturdy base however for our high volume I did velcro it to the surface so it would not fall if it was handled too much. I think this is a great intro to theses types of items. I am happy with the purchase so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Trina M. Brown",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Good design, well made",
      "text": "This is very well designed and built. It simply works. My wife and I have two different sizes of iPads and the two sizes fit perfectly. (We bought two for Zoom use.)",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy in PG",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Excellent product, well made.  Manufacturer should include a “ lap base” for reading in bed.",
      "text": "Like the product because it accepts all of my iPad and iPhone devices. Don’t like adding the base for desk top use because I use it a lot for reading in bed. Manufacture should include some sort of long base for lap reading in bed.",
      "rating": 4.0,
      "verified": true,
      "author": "Womach",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Poor quality, from someone who has tested many stands",
      "text": "I can't believe this stand is as well rated as showing. It's not a quality product. The major flaw is the construction of the rotating mount behind the device. It is loose in the joint, and cannot be adjusted. ipad wobbles even with the lightest touch.",
      "rating": 1.0,
      "verified": true,
      "author": "soccerstar",
      "helpful_votes": 3,
      "publication_date": 20180827
    },
    {
      "title": "Good but hoped it would hold the tablet with the outer box on it.",
      "text": "Works good but you have to be careful whiten seeing up that the power button is right where the sides clamp on. I had to take my son's protective outer box off the tablet to use it.",
      "rating": 3.0,
      "verified": true,
      "author": "KarynD",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Features Are Good",
      "text": "the features for this stand was pretty good, they just didn't fit my device but it was exactly what I was looking for. I just couldn't use it. The construction was well made except expandable sections they hard to pull apart. overall the item was very good.",
      "rating": 3.0,
      "verified": true,
      "author": "DEBRA GALLIMORE",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "2018 iPad Pro",
      "text": "Good stand, but doesn’t work with the 2018 iPad Pro with Apple Pencil.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181114
    },
    {
      "title": "Exactly as I had hoped",
      "text": "I don't have much to say except that the product held the IPad perfectly. It rotates well and seems sturdy. I believe it will hold up well and I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "M&T",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Not Made to be used with Kindle Fire HD8",
      "text": "They tell you its compatible with the Fire HD8, but it isnt at all. The arms that hold the tablet to the stand are positioned so that they constantly push either the volume button or the lock button on the tablet. It is not made to work together at all. Super disappointed by this.",
      "rating": 1.0,
      "verified": true,
      "author": "CCC",
      "helpful_votes": 3,
      "publication_date": 20181203
    },
    {
      "title": "Don’t buy",
      "text": "I received the stand as a gift it broke in six weeks just after the return window closed. Don’t buy looks sturdy but inside components are plastic and will break.",
      "rating": 1.0,
      "verified": true,
      "author": "kris nemeroff",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "I like that I can have my iPad on the desk ...",
      "text": "I like that I can have my iPad on the desk or counter but it is not useful if I need to hold it. The bottom base spins so I have a hard time positioning it. I also have arthritis in my hands that makes using it a lot harder.",
      "rating": 3.0,
      "verified": true,
      "author": "Marilyn Shabbick",
      "helpful_votes": 2,
      "publication_date": 20180114
    },
    {
      "title": "Lightweight",
      "text": "I bought this to hold our IPad that we use for a POS system. This stand is super light and does not feel durable at all. Every time you touch the iPad the whole stand moves. Not what I was expecting",
      "rating": 2.0,
      "verified": true,
      "author": "Alexandra",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Disappointed",
      "text": "I have a smaller sturdier one for my iPad Air. This one is for my iPad Pro and it's cheap plastic and doesn't have the swivel capabilities. Very disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "Robin Dix",
      "helpful_votes": 2,
      "publication_date": 20170828
    },
    {
      "title": "Would be nice if the vertical height is a little bit longer ...",
      "text": "Would be nice if the vertical height is a little bit longer so that it can easily rotate an iPad Pro 12.9 without having to flip often.",
      "rating": 3.0,
      "verified": true,
      "author": "EdmundOldGuy",
      "helpful_votes": 2,
      "publication_date": 20171023
    },
    {
      "title": "Sturdy and Lightweight",
      "text": "I am using this in my business as an Apple Ipad desktop kiosk setup. Sturdy and very mobile so far. Priced right and easy setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Best I-ad stand ever!!",
      "text": "Just received this, fast shipping. I have the iPad Pro the original, the 12.9 inch screen. Fits it beautifully! 100% must buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Works great! Totally fufills my needs",
      "text": "Works great! Totally fufills my needs. I use this during career fairs for work and it’s a solid base and allows you to type on the screen easily as well as using a stylus. Purchased a few extra for my workmates.",
      "rating": 5.0,
      "verified": true,
      "author": "David Giffin",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Great buy",
      "text": "Worked perfect for my iPad model 2019. If you think it doesn’t fit. Rotate your iPad or just switch out the arms. One will fit it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lesley Shaffer",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Well built, but...",
      "text": "It is a well built item. I had issues with putting the unit back in the stand with my iPad with the detachable bracket on it. You have to push in the two clips on the bracket While trying to put it back on the stand. Since the stand in not mounted to the desk, it moves while trying to attach it. I found this awkward to do. I ended up returning the item.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike Shrout",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Good stand",
      "text": "Purchased for iPad Pro 12.9. The only problem I’m having is charging my iPad pencil while it is in the stand.",
      "rating": 4.0,
      "verified": true,
      "author": "Sophie",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Stand Tall",
      "text": "I had a similar stand for a previous iPad then upgraded to iPad Pro. I needed same type of stand & this is PERFECT!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndi",
      "helpful_votes": 2,
      "publication_date": 20170903
    },
    {
      "title": "Used for kid’s online classes",
      "text": "My kid’s school gave them IPads for virtual learning classes. Bought this so it would be easy for him to use it. I bought adhesive Velcro and used it to hold the iPad to the stand so my kid wouldn’t break it. Works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Acosta",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Love it",
      "text": "Love it! This is so easy to put together in is very sturdy for the price! I highly recommend this for anyone who has an iPad!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Versatile",
      "text": "Excellent holder, capable of much more than what you would think. We is it for our Microsoft surfaces in conjunction with a Bluetooth keyboard and it allows the surface to be at a much better working height that would it would be attached standard keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "LF",
      "helpful_votes": 2,
      "publication_date": 20171022
    },
    {
      "title": "Great solution for tablets",
      "text": "I use a Surface Pro and the tablet set up with the standard keyboard and stand. This places the angle of the front camera tilted up at an extreme angle. I bought this stand to give me a more eye level view of the front camera. Easy to set up and works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley H.",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Amazing Service",
      "text": "I had my Tablet stand for about a month and accidentally broke the clasps that hold the tablet. I merely requested information about replacement parts and two days later, to my surprise receive what I needed. These guys are amazing. I'm a lifelong customer!!",
      "rating": 5.0,
      "verified": true,
      "author": "First Presbyterian Gulfport",
      "helpful_votes": 2,
      "publication_date": 20170723
    },
    {
      "title": "Highly recommend!",
      "text": "I bought this to hold my 6 year old sons iPad for school. It works so well! The iPad is held in place, doesn’t wobble or move. The bottom does not slide. I am so happy and would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey Widle",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great Buy!",
      "text": "My only negative is that I have to take my iPad out of the Otterbox case to effectively use this stand. Other than that I love the stand!",
      "rating": 4.0,
      "verified": true,
      "author": "Alwayz4Belle",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "check the size",
      "text": "did not fit my Samsung Tab s6 with either attachment provided. very nice and stable unit if it fits your tab...",
      "rating": 3.0,
      "verified": true,
      "author": "kcmo.me",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "#1",
      "text": "This is the best stand I ever had.so comfortable to use and u can carry everywhere without u drop it. I had a few stand but so fat this is the best one.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn S.",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Fell apart after 2 weeks",
      "text": "So at first we loved this!!! We used it for 2 weeks and then the screw came out! I am a pretty handy person so I thought I may be able just to put it back...... Nope now it's useless 😒",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Perfect for our needs!",
      "text": "We use this is our retail location at checkout, 100% perfect for holding the ipad, worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn B",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "does the Job",
      "text": "This did the job fine for us. I would say the only thing I would ask for is that it had a little more substance to it but for the price it was what we needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Devlin",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "slick way  to  use  i  pad",
      "text": "I saw one of these at a doctors office. Really easy to mount and dismount Put it on my desk and I can use it so much easier love it",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Johnson",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Great customer service",
      "text": "Update: customer service was fantastic. They called and worked with me to get me a replacement. Great customer service! Worked great, but didn’t work for long. We had this in my store for 2 months before the clasp fell off and the iPad fell out. Tried to repair it with a longer screw but would not stay. It’s a lot of money for it to not last.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Good stand",
      "text": "Comes with two sizes of holder for iPad so will work on larger and smaller iPads. Great for kitchen to pull up recipes while cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Nomdeguerre",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "It is very Sturdy and of good quality",
      "text": "Unfortunately, I have to RETURN The Stand. It Only fits one of my many Tablets. I was hoping it would work. It is very Sturdy and of good quality. Could you send me whatever information needed to return it. Thank you in advance.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Good Square Reader Stand Alternative",
      "text": "I was afraid that this wouldn't be sturdy enough to hold my 12.9\" iPad Pro but the weighted bottom holds up and the ability to pivot it around 360 degrees in any direction is making it a great cheaper alternative to a Square Reader stand. Now when I need a customer to sign I just have to swivel the tablet around.",
      "rating": 5.0,
      "verified": true,
      "author": "Christa D.",
      "helpful_votes": 0,
      "publication_date": 20170831
    }
  ],
  "product_meta": {
    "title": "AboveTEK Retail Kiosk iPad Stand, 360° Rotating Commercial Tablet Stand, 6-13.5\" iPad Mini Pro Business Tablet Holder, Swivel Design for Store POS Office Showcase Reception Kitchen Desktop (White)",
    "rating": 4.6,
    "feature_bullets": [
      "HIGHLY FLEXIBLE - The 360° rotatable base and tablet bracket holder combined with a folding arm offer unparalleled adjustment for typing or showcasing without missing any viewing angles. Turn display in a second between cashier and shopper or switch landscape/portrait mode instantly.",
      "BUSINESS ORIENTED - Two size rubber padded bracket holders collectively fit 6\"-13.5\" tablets or any gadgets with width or height measurement in the RANGE of 6.6\"-9.6\", an ideal docking station stand for perfect match of large or small tablet PCs typically used at restaurant shop point of sale, office home desk, etc.",
      "ERGONOMIC DESIGN - Quick attach/detach of holder with simple push of the button creates no hassle for easy storage and carrying. A true universal iPad kiosk stand with easy pull handlebar and dedicated space for power cord charging.",
      "BROAD APPLICATION - Not only does it make your iPads/Android/Windows Surface Tablets a desktop display computer, it allows you to type, press, view, swivel with great stability. Confidently interact with customers at restaurant, check out at register, collaborate in group meeting at office, present products or services at showroom, and many more.",
      "STEADY SUPPORT - Light and smooth turning of bracket holder/arm provides high efficiency in busy settings. The weighted base plus hard folding arm offer sturdy structure to withstand weights of large tablets and heavy operation on the device, a professional grade tablet stand."
    ],
    "specifications": {
      "Brand": "AboveTEK",
      "Item model number": "TS-138W-CA",
      "Item Weight": "1.5 pounds",
      "Product Dimensions": "7.1 x 7.1 x 10.6 inches",
      "Item Dimensions  LxWxH": "7.1 x 7.1 x 10.6 inches",
      "Color": "White",
      "Manufacturer": "AboveTEK",
      "ASIN": "B06XB7KWGV",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 25, 2017",
      "Customer Reviews": "4.6 out of 5 stars1,489 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#43 in Tablet Stands"
    },
    "categories": [
      "Tablet Accessories",
      "Computers & Accessories",
      "Electronics",
      "Stands"
    ],
    "price": 37.99
  }
}