{
  "website_summaries": [
    {
      "verdict": "Breathes new life into internet connections with its multiple-connection capability.",
      "pros": [
        "Multi-User MIMO enables multiple high-speed connections",
        "Sets up quickly and connects almost instantly to enabled devices, including Alexa, Wink, and more",
        "Good Wi-Fi range"
      ],
      "cons": [
        "May develop personality issues, bumping users offline at random",
        "Newer users may have trouble configuring router, particularly parental controls, as instructions are somewhat sparse"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Wifi in a world gone mad!",
      "text": "My wife is a teacher and has been holding classes online since the world fell on it's a$$! Our older Linksys (2015/16) router had seen its last glitching freeze frame. \"Gone are the days of $50 routers my job site IT tech told me after approving of this model. It took a painless few minutes to install and set up network via the app. Soon after we were basking in the loving glow of wifi streaming and video conferencing! Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Russ",
      "helpful_votes": 7,
      "publication_date": 20200512
    },
    {
      "title": "Doesn’t Work Well At Our House",
      "text": "Received this unit a few days ago and the range on this device is horrible for 5 GHz and switched you to 2.4 GHz. Talked with tech support for almost 3 hours to fix the problem. They did fix it were it wouldn’t switch you to 2.4 but the speed test is terrible. My old unit is a different manufacturer and covered the whole house with great results on the speed tests. I went with this one because of the good reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Spencer",
      "helpful_votes": 6,
      "publication_date": 20190413
    },
    {
      "title": "Stopped functioning correctly a month after we bought it.",
      "text": "Frankly, this router worked fine for a month, just long enough to get out of the return window. (What timing.) And then it starts dropping packets like a madman after being on for a while. When I try and restart it, about 50% of the time, it doesn't even boot up, and I have to restart it a few times until it decides to actually work. And now, the internal website doesn't even work correctly. Some of the sister models to this seem to have access to DD-WRT, but this one does not. So I can't even attempt to troubleshoot it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20171019
    },
    {
      "title": "Router seems very stable for the first few days!",
      "text": "And faster then the LInksys AC1900 that it replaced. The standard Linksys interface software is there as always. BUT - in order to set up up, it requires a phone app. However, once you do minimum setup, which seemingly forces you to use a Web based signon, you can bypass the cloud and go straight to the settings. It also links well with an Engenius Access Point. The transition was very smooth. I've preferred the consistency of Linksys products for years. I think this is worth the price. I previously tried the Linksys AC2200, but it failed after two weeks. Crossing my fingers for this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Mister Mike",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Device was faulty. Replaced with another faulty device. Refused replacement.",
      "text": "I purchased this router and around 7 or 8 months after I purchased it it stopped working. A few hours on the phone with support and I got an upgraded device for free. It had a broken antenna on arrival but it still worked. Great! A few months later (yesterday) the device failed. Called support and told them specifically what I thought was broken. Three hours later they finally ran a 30 second test on that specific component and told me I'm out of luck. And tried to recommend more linksys routers for me to buy. Fat chance. I will not be purchasing another linksys router due to unknowlagable and unhelpful support, and repeated faulty devices.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "It works.",
      "text": "It moves the 1s and 0s faster than the old box. And they don't get stuck in the pipe. I used to have to shake the old box every week or so to unclog the 1s that would get bunched up. Also, Epstein didn't off himself.",
      "rating": 5.0,
      "verified": true,
      "author": "ThornMonkey",
      "helpful_votes": 4,
      "publication_date": 20191108
    },
    {
      "title": "Bricked after 15 months of use.",
      "text": "I paid for this last year, it was $169.99 -- after about 15 months it bricked, error lights, no response. The warranty is 12 months. I called Linksys to see if they would go beyond their one year warranty to remedy the situation. They refused. I'm not really interested in using Linksys products anymore obviously. To spend close to $200 on a router that is only going to last a little over a year isn't particularly acceptable. I'm going to have to review competitors, as you should too before buying Linksys.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20191014
    },
    {
      "title": "Don't buy it",
      "text": "This thing splits the signal with all devices regardless of their activity. so you could have one device can be active and it will have poor signal because the thing will not allow more bandwidth. So currently when I check the speed on itself it's I've 450MBS download but the max I can get in wifi is 85MBS with 1 device active. Complete trash of router",
      "rating": 1.0,
      "verified": true,
      "author": "C.P.",
      "helpful_votes": 3,
      "publication_date": 20190929
    },
    {
      "title": "The Little Router that Could",
      "text": "I switched to this router from other router, no more FTP, SSH and embedded LINUX cracks. Remote admin is still available, but logical solution on other router is standard. Admin here is for domain needy clients. Its WiFi 5 is friendly to home users with big homes. If your home is experiencing drop signals, available port forwarding let's you daisy chain a 2nd router. For big families, IPv6 SLAAC feature can assist overloaded residential gateway router. I tested 3T/3R USB NIC on it but still don't know if router is 2+1 pairing. Because the NIC cannot 2+1 pair on its own, so WiFi 6 may be a replacement for 3T/3R compatibility.",
      "rating": 5.0,
      "verified": true,
      "author": "Duckie",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Good Router with a decent range",
      "text": "I bought this router on sale on Amazon, because my previous router had died and the router on my cable modem was too weak for my older home. Since our house is from the late 20s, the plaster and lathe can cause issues with wifi signal. This router is able to reach all the corners of the home. Setup is easy if you are familiar with Linksys routers. One feature I do really enjoy is the ability to prioritize traffic either by application or device. Since we stream a lot using our smart tv, I set that to be prioritized traffic. I have yet to have network interference or other issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Fitzgerald",
      "helpful_votes": 2,
      "publication_date": 20190304
    },
    {
      "title": "ports failed",
      "text": "after 10 months, the ports failed. Wifi still works but the ports suddenly stopped working. Doing a search, I discovered that this issue is a frequent occurrence with the Linksys EA models. Since I had changed providers due to internet issues unrelated to this router, I thought I was once again getting the run around with the ISP. This time around, they were correct that it is my router.",
      "rating": 1.0,
      "verified": true,
      "author": "The OC",
      "helpful_votes": 2,
      "publication_date": 20191223
    },
    {
      "title": "Easy Setup",
      "text": "I found setting up this router to be pretty simple. A little more than plug and play, but easy enough to follow the instructions. I have my router in a coat closet, so the signal is blocked a bit, but outside of the farther reaches of my home, it works. I paired this with a RE7000 to get the additional coverage and that was easy to set up with the WPS (I know some were having issues with it) and works like a charm. I would recommend this router if you are not willing to pay for the expense of a mesh system.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Ganz",
      "helpful_votes": 2,
      "publication_date": 20200709
    },
    {
      "title": "This is a refurbished Linksys EA8300 being sold as new.",
      "text": "This is a refurbished Linksys EA8300 being sold as new by Amazon.com Services, Inc. When I called Linksys tech support because it wouldn't connect to the internet they informed me this serial number was refurbished. Wasting hours of my life with a refurbished router that doesn't work is not appreciated.",
      "rating": 1.0,
      "verified": true,
      "author": "Explore233",
      "helpful_votes": 3,
      "publication_date": 20191008
    },
    {
      "title": "Intermittent Connectivity",
      "text": "My old Asus performed better than this brick. While my Asus was giving me speed issues I never once had an issue with devices connecting. This Linksys has given me nothing but problems; it allows some devices to connect and not others. Some devices that were connected one day cannot not connect the next. The speeds have been great, signal strength has been great (I live in a 2-story house). But the inability to connect new devices and existing devices permanently being disallowed, shame on Linksys.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 3,
      "publication_date": 20181024
    },
    {
      "title": "Router works GREAT, but...",
      "text": "I got this router a couple of years ago, long before my kid can figure out the internet. Now, the kid's older and he can use it anytime he wants. So, this is where parental controls come in and guess what? IT DOESN'T WORK!!!! This was one of the features I wanted in a router only to find out a couple of years later, it does not work as advertised. This appears to be a problem across ALL Linksys products so I would avoid this brand and go somewhere else where it actually works. So disappointed...",
      "rating": 2.0,
      "verified": true,
      "author": "physical therapist",
      "helpful_votes": 2,
      "publication_date": 20190606
    },
    {
      "title": "Trash- don't buy it",
      "text": "Horrible, The configuration page on the device kept crashing, I wasn't able to login into the router without powering down and on again. Settings were not saving, there's no VPN software on this device like the other routers (i.e asus). Although it does say that the EA8300 is set to include OpenVPN at some point in the future. Speeds were inconsistent, my ISP caps at 200mbps, I was getting around 120-140 via the speed test on the router it's self, via phone over 5Ghz wifi I got 3mbps down, 2mbps up.. I suspect my device was a defective one. Staying with asus Linksys has gone WAYYY down hill since Belkin (yuck) has bought them out.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Bacon",
      "helpful_votes": 6,
      "publication_date": 20170719
    },
    {
      "title": "Fast enough",
      "text": "My main reason for purchasing this was to utilize the 1gbit Internet connection I have, especially for wired LAN connections. It does this fairly well, I get about 850 to 900mbps where as the previous rounter I had, a Netgear 6400v2 was lucky to get 500mbps. The Netgear would slow down with every FW update it seemed as well. Wireless works ok so far as well. The reason for only 4 starts is the user interface is very slow. Just logging in or changing pages takes 10 to 20 seconds.",
      "rating": 4.0,
      "verified": true,
      "author": "Insufficient Funds",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "WiFi and Ethernet speeds are amazing!",
      "text": "I upgraded from a 3 year old Netgear router, and I am so happy with the speeds I am getting. I am getting 100-150mbps on WiFi and 400-450 on Ethernet. It is super easy to setup, app is easy to use. I did a setup to keep my 2.5G and 5G separate. It can automatically switch between both of 5G bands. One downside of the App is- I don't trust the WiFi speeds they show. It always show a higher speed than it actually is. So, use Speedtest.net The best part is logo lights up when the power is plugged in.",
      "rating": 5.0,
      "verified": true,
      "author": "Krisan",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "great upgrade!",
      "text": "This replaced a very dated Lynksis 2500, So far everything is going great when it comes to internet speeds. It was super easy to set up, and I definitely enjoy that I can control many features via the app on my phone! I've been using this Router for over a month now and haven't ran into any issues so far! If anything changes I will return to update my review.",
      "rating": 5.0,
      "verified": true,
      "author": "Niko Ramirez",
      "helpful_votes": 3,
      "publication_date": 20181124
    },
    {
      "title": "Could be better on the settings side",
      "text": "Used to have an older Linksys, and somehow the new UI seems to go backward. Most of the settings are very similar even after 4 years; although this router does not have a way to turn off only the 2.4 or 5GHz band; either you turn wifi off or on; there is no way to turn off only one of the 2 bands. As far as dividing the load on different bands; I did not notice any tangible difference compared to my old router. The 4 antennas does not seem to do much for the signal either; since I see the same performances and range of my previous router.",
      "rating": 4.0,
      "verified": true,
      "author": "CFTop Contributor: Star Trek",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Huge step up from the N900.",
      "text": "Definitely has more engine power than my older N900 from Netgear. We have fast internet, but were constantly seeing Netflix 'drop' quality to keep the streaming going. Not so with this router! Everything is on-point, and we've seen no signal issues. The range on 2.4ghz is great, and 5ghz is improved over my last router, but could still be better. We have about 15 devices connected to it, and it prioritizes them perfectly. I did add my Samsung 9-series to the high-priority list, just to make sure it get preference over other streaming devices if we ever get loaded with lots of network use. Excellent product.",
      "rating": 4.0,
      "verified": true,
      "author": "Levi Allen",
      "helpful_votes": 3,
      "publication_date": 20170909
    },
    {
      "title": "Amazing router!!! I have two of this model at home, both amazing!",
      "text": "Amazing router!!! I have two of this model at home, one as a router and one as a repeater and they are both amazing! I had 3 ASUS routers and repeaters, same category as this router (AC1900/AC2200), and both had serious issues! I'm an IT manager and I need high quality routers with minimal downtime, and this is the right one. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Johns",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Linksys Tri-Band Router",
      "text": "I bought this router to help service the many wi fi devices in our household and to provide better range into the back yard. The old router was not put out to pasture, either. There are many video clips online (LINKSYS offers them, too) that describe how to convert a router to a wi fi extender, so the old router is still being used. I followed the instructions and the new router was set up in a few minutes. Many thanks to the other reviewers that left their thoughts about this product on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Faaborg",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Works as advertised",
      "text": "Bought used/like new condition and is working fine. Nothing wrong so far... I have extended my Wi-Fi range from front corner of house to 10ft outside in backyard. My home has old plaster walls and is long. So far getting 866mbps on pc using a Trendnet TEW-809UB and 5Ghz signal is strong from rear of house where I do my work. Extremely fast for using STEAMLINK program to transmit pc games over Wi-Fi to TV. I did find connecting a device sometimes shows that there is no internet until you actually start using it, weird.",
      "rating": 4.0,
      "verified": true,
      "author": "Koala",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Excellent range and signal strength.",
      "text": "I bought this to replace the provided router by my ISP (optimum) and this thing is WAY better. Linksys has always been my favorite and this one will not upset. The setup was super simple, the app works great, interface is user friendly. The signal strength works awesome with the 5GHZ through walls in my apartment. Great router. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "LiquidAlloy",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Excellent , except for NAS",
      "text": "Excellent router for internet access, mapping network, good user interface, etc. Just what a router should be. The USB jack for external devices to be used as a NAS is horrible though. Was only able to get it to work with FTP or no shares. Tech support suggested I just use no share (which means no security). If this is the best they can do, honestly just remove the USB interface... Still, it gets four stars as it is really a router and performs that function very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Bryant",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Unreliable ethernet parental controls",
      "text": "Bought this so that I could control my son's wired gaming PC ethernet connection. The parental controls work sometimes, but mostly allow him continuous internet access even if the router says the connection is disabled. Wireless signal seems no better than my old Airport Extreme. Parental controls only allow access to be controlled on the hour, rather than allowing custom times. For a kid, there's a big difference between being off at 8, 8:30, or 9pm. Cost a lot and didn't really fix our parental limit problems.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Feldman",
      "helpful_votes": 3,
      "publication_date": 20171011
    },
    {
      "title": "Best WiFi Router on planet earth.",
      "text": "I have been using Linksys for over 20 years . I upgrade about every 5 years. Linksys gets better every year. This Linksys EA8300 is by far the best I have ever seen. Wi-Fi routers are extremely confusing to use, because there are so many settings. I would suggest just following the basic setup instructions and leave the rest for Linksys to handle. If you want to do more advanced settings find a friend who knows networking. They will need Administrator experience. I worked at IBM for 10 years and I still have a hard time understanding the these settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Del Gran",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Cheaply made chinesium junk",
      "text": "I bought this router about a month and a half ago, and its already dropping connection. Multiple drops per day often very short, but sometimes for thirty or forty seconds. This router replaced a Linksys router that was made back when they made quality products. Now they just make ultra poor quality garbage just like the rest of the crap churned out in China. Sadly, it's one of the best of the available lot. No company makes a router that actually works well anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Freeport",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Parental Controls / Blocking",
      "text": "Review is simply targeted towards blocking / parental controls. Router has NO means to globally block URLs. Parental control, device-by-device is the only option (tedious) and does not work. Multiple, long threads on the Linksys forum and their support staff is zero help. A few users have found workarounds using various, un-related options that only last until next reboot and that other users are unable to replicate. Website blocking is a basic feature that any router should have (and globally, not device specific!) - my next purchase will NOT be Linksys due to this.",
      "rating": 1.0,
      "verified": true,
      "author": "IGotMoose",
      "helpful_votes": 3,
      "publication_date": 20180926
    },
    {
      "title": "Underwhelming",
      "text": "a little bit disappointed when comparing this to my old wrt54G. Multiple advanced settings are now missing from the interface...and by that i mean the router only has the most basic setting available to configure. If you are even a bit advanced this router is not for you. The UI is itself painfully buggy a change in the wrong direction compared to clean cut wrt54g interface. Sadly i had to return.",
      "rating": 2.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 2,
      "publication_date": 20180902
    },
    {
      "title": "Well worth the upgrade - Great Router",
      "text": "I'm upgrading from an EA7300 which is also MIMO. My old one wasn't keeping up. I've had my new EA8300 for about a day now and the difference so far is phenomenal. Individual tests in a controlled environment are about the same as the old router. The difference is when EVERYTHING is going full speed. This one keeps up like a champ. The only thing I had to look up was the location for the WPS button - It's on the side. Everything else has been super easy and this is working great.",
      "rating": 5.0,
      "verified": true,
      "author": "GC",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Takes way too long to set up",
      "text": "Takes way too long to set up. This router is not as smart as it was described to be. The user interface looks to be straight forward but i eventually had to call tech support and they wanted to sell me a service plan instead of helping me. I eventually got phone walkthrough on the set up but it took all day. A very frustrating experience to say the least. Now that it works, it works well. Not for the technically challenged though and that's an understatement.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Inconsistent wireless speeds",
      "text": "Could have been great, but had technical flaw, had to return it. Wireless speed would significantly fluctuate even standing right next to unit. Tested with multiple devices, and different configurations based on Linksys forum suggestions. Clearly a lot of people had similar experience. Consistent speed with wired connection, but wireless is key. Should work straight out of the box. My old $25 tp-link router put out a consistent max speed signal. But I wanted better range and features. Ended up buying a tp-link AC router for about $60 less at Target. Works straight out of the box. I'm shaking my head at you Linksys. What happened?",
      "rating": 2.0,
      "verified": true,
      "author": "Big M",
      "helpful_votes": 2,
      "publication_date": 20170921
    },
    {
      "title": "Fantastic router!",
      "text": "This has seriously fixed my internet problems. What I did not know is that when a cable company provides a modem / router combination units, they only support up to about 10 connected devices. By purchasing this separate router my Internet is just rocking now. I can even walk all the way out to my sidewalk, and all the way to the back of my yard and still have complete internet connection. The setup was also pretty easy to do oh, and I like some of the smart features that are available using the smart app.",
      "rating": 5.0,
      "verified": true,
      "author": "Cowboy Jim",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "No more port blocking, BAD!",
      "text": "Linksys has done away with port blocking, a fundamental capability of both consumer and professional network routing devices. Linksys' solution is to use QOS, clearly confusing the need for \"blocking\" traffic, not prioritizing it. Had I been aware of this fundamental flaw, I would have gone with a different router. The lack of this capability is an unacceptable omission of feature/function",
      "rating": 1.0,
      "verified": true,
      "author": "IanM",
      "helpful_votes": 3,
      "publication_date": 20171221
    },
    {
      "title": "Love it, easy set up, and great power",
      "text": "Just got this all set up, and must say that I am very pleased. Setup was a breeze and management seems like it will be easy enough. I am coming from an older Netgear setup and it was just getting older, and needing to be reset more often. It was also not as user friendly to set up. I am using this for personal computer(wired), Xbox(wired), and then wireless for camera, phones, tablets, and TV streaming devices. Setting a static IP was super easy, and so far it is working flawlessly. Management from the app seems pretty intuitive also. I am very pleased, and would recommend this to anyone. If I do have issues I will edit my review accordingly.",
      "rating": 5.0,
      "verified": true,
      "author": "Auburngrad",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Linksys",
      "text": "So Far....So Good!!! Major improvement over an older model Linksys that finally gave in to having more devices being connected to it than it was rated for. Gave me 3 hard years of service tho. I really like the features Linksys provides via there sight. you can monitor, adjust...etc and if you download the app....you can do it from your phone. In the past when I needed help with older routers, Linksys has always came thru to correct issues and configure to optimal performance. As with any customer service/tech support....be cool and polite with them and they will do what they can to remedy issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Rybk",
      "helpful_votes": 2,
      "publication_date": 20170421
    },
    {
      "title": "Great Product",
      "text": "Although I just put this up 24 hours ago, the entire family can't believe how much faster our internet is. Love having the three separate bands and the guest access! Left the device to hunt the bands but there is the ability to dedicate high use devices such as smart TVs and such to a single band to ensure the best bandwidth for that device. Great product so far. The only suggestion I have is indicator lights on the front as my device is up high on a shelf and I can't see if it is working like my past routers.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Good transmission, fast speed, good interface to monitor",
      "text": "I finally replaced my ancient Apple Airport Wireless N router with this one. Amazing difference in upload/download speed. I like the interface to configure the router. Using this with an AT&T Broadband modem. The hardest part was the initial install- had to figure out how to configure the AT&T and disable its routing capability first. Other than that this has worked like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Atamian",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Excellent whole home coverage",
      "text": "I added two of these to my base Linksys router. Did not want to have to buy a whole new \"mesh router\" setup in order to get better coverage in the corners. Setup, once I learned to use the local \"WiFi to the mobile phone\" approach was simple and the coverage, and roaming, works flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "greybear125",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great all around Router!",
      "text": "Pros - The antennas give great range! - The app makes it easy to set up and gives a wealth of features. You can easily open / forward ports if necessary and give priority to certain devices for maximum bandwidth! - The increased speeds work great for running multiple gaming systems, phones and computers. - This router allows me to stream and do online gaming at the same time! Cons - What cons?",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Lando",
      "helpful_votes": 2,
      "publication_date": 20180524
    },
    {
      "title": "Strong signal",
      "text": "Pros: I’ve never had any connectivity issues. Strong signal throughout house and outdoors. Easy setup and has a nice phone app. Cons: the parental controls don’t work. I wanted to be able to turn the WiFi signal on/off on my kids devices. One of the main features why I purchased. It will allow me to turn on/off once then it doesn’t work after that unless I reset the router.",
      "rating": 3.0,
      "verified": true,
      "author": "Clippernation",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great update from current router",
      "text": "I purchased this router to replace my old netgear router. The installation was so simple a cave man can do it. The range of this router is outstanding. I have a detached garage that is about 100' away from my house. The old netgear router did not reach that far and now I get full wifi signal while in my garage. The only complaint that I do have is that the power cord that came with the router is shorter than the netgear router power cord. I have my router sitting up high on a corner shelf so the supplied cord didn't work. So I had to reuse the power cord from the old router.",
      "rating": 5.0,
      "verified": true,
      "author": "Dwayne T",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Does not do parental filtering",
      "text": "I love how they claim that you can do parental filtering with these routers when they know this is a false claim. This router will not filter https sites because they are encrypted. Don't know why but I know that most routers won't filter these sites. So it is not possible for this router to be setup to protect against really bad sites. I can't really understand why they can't make a router that will filter out any site you don't want coming into your home, but apparently that is not possible. So they really ought to quite making the claim",
      "rating": 3.0,
      "verified": true,
      "author": "Scott Howard",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Returned",
      "text": "Returned router. Spent 3 hours on the phone with LinkSys Tech and they couldn’t get it to work.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 2,
      "publication_date": 20200907
    },
    {
      "title": "Died after 6 weeks",
      "text": "The product worked great, strong signal throughout the house until it suddenly quit routing the internet to the network. Constantly has no internet globe on the top. Reset it and it still has the globe when it comes back up. Too late for Amazon return. Trying to get support from Linksys now.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin  W.",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "No longevity out of this unit",
      "text": "This router worked great for 16 months, then just crapped out. Tech support wouldn’t do any warranty, for $150 I expect more out of a product than 16 months. Hell my apple router gave me three years with no problems. Is pathetic LINKSYS CAN KISS MY ASS!!",
      "rating": 2.0,
      "verified": true,
      "author": "bethany",
      "helpful_votes": 2,
      "publication_date": 20200907
    },
    {
      "title": "expensive but worth it",
      "text": "This is my 3rd router this year. The first 2 were ok but buffered all the time while steaming movies. This one hardly buffers so far. I should have bought this router in the beginning and not waste money with the other two. This was easy to install but I have one complaint, which is when i step outside my house, i lose the internet. So this works great indoors but I might have to get an extender for outdoor wifi capabilties.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael C. Jocson",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Does the job well so far",
      "text": "I went from a 2TB Apple Time Capsule... I prefer to use the apple product but it had so many shortcomings that I had to move on. I get much more range and more capability to customize and configure. There are no more dead spots in my house and I could wall mount it. I just transferred the data from my Apple router to a 2TB USB external. Works fine - the only problem I have so far is accessing my drive via FTP which I should figure out soon. It was seamless with the Apple router but as long as I can get it working eventually I don't mind doing the work.",
      "rating": 5.0,
      "verified": true,
      "author": "Rolando Petit",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Great Tri-Band Router for the price",
      "text": "We have a 2,600 SF 2-story home and this router covers our entire house & yard. We also cut the cord on cablue, so we stream everything. We’ve got multiple Smart Home devices, iPads, iPhones, and streaming media players. With the beam forming and band steering we couldn’t be happier with this router. Setup is a breeze and there is an app you can download to monitor your network from anywhere. It’s not going to beat routers that cost $200 more, but for this price range this Linksys is hard to beat.",
      "rating": 5.0,
      "verified": true,
      "author": "TexasBuckeye",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Works good.",
      "text": "The router is good. No issues. Worked out of the box. One gripe- the range is ok-ish. If I'm out in the backyard, the signal is average. But otherwise very satisfied with it. One extra thing I love about it === signal priority i.e. which Wi-Fi device to prioritize over others when there are multiple streamers. I have set it for my TV as we use Netflix and such. I love this feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Strong & Reliable Signal Great Improvement",
      "text": "I bought this for my parents home. They had 100 mbps speeds to their modem from their service provider but were getting terrible WiFi signal in most areas of the home with the built in WiFi that was on the ISP provided modem. Installation was easy enough for me to talk my father through it over the phone. The web app for configuration allowed me to prioritize devices on his network remotely and test the speed from the modem, etc.. The rooms that were averaging at or below 5mbps are now at 75mbps+. Couldn't have asked for a better result. Very much recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "brittle",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Range is poor at best",
      "text": "This is for Max-Stream AC2200 MU-MIMO Fast Wireless Router. Had to replace my 5 year old nighthawk and was hoping that the Linksys would have better range. To my surprise, the answer is no. Actually, it was worse. It's fine if you're within 25 feet, but after that - good luck. It was easy to set up and like the interface/App, but was really hoping for extended range to my garage.",
      "rating": 3.0,
      "verified": true,
      "author": "MAV",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "No more wifi issues!!",
      "text": "We have Comcast cable and we're constantly running into connection issues with the wifi router box that we were renting from Comcast. They insisted it wasn't because of the box...!! After having tech after tech out to the house, and running new line from the curb to the house, but still experiencing problems, I decided to bite the bullet and buy my own wifi router (and modem). No more problems!! There are a few spots in the house that this router doesn't really reach, and we ran ether net cable to all the desktops, but the signal from this unit is strong, consistent, and very reliable...!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark N.",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Good value, bang for your buck.",
      "text": "Big boost in internet and wifi speed gets the most out of your 100+ Mbps broadband connection. Provides better wifi coverage over a few year old similar make and model. User interface is meh, lacking features other software has like no built-in VPN. Handy guest Network isolates guest traffic from your main network keeping work safe from visitors.",
      "rating": 5.0,
      "verified": true,
      "author": "Drummer",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Robust router that meets the needs of a connected lifestyle.",
      "text": "I have over 20 devices connected to this router ranging from camera systems to smartphones. Extremely pleased with the performance so far. Streaming ultra HD content is flawless. Great configuration options to meet personal needs. Highly recommend this router for anyone who has a smart home and streams entertainment content. Meets high demand needs!",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Bauer",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "A little hindered but a great value",
      "text": "This is an entry level tri-band. The bands are semi throttled but this is about 3089732 steps above most consumer grade (read big box store) dual band routers. Set up was a total of 15 minutes. I have 3 iphones, 2 tvs, 2 playstations, 3 computers, an ipad, and a camera system ont his. Works.",
      "rating": 4.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "EXCELLENT 4K TV",
      "text": "I love to surf live webcams on \"Youtube\". My 65 inch 4k TV is connected wirelessly. I bought this router to replace a 2mghz router and improve performance. I does that to perfection. I wanted the feature that automatically selects the best channel available for each device to be certain I got the best performance available.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. John P. Lux",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "Great reception",
      "text": "Got a great reception when I added this to my home network. Was having connectivity issues with my providers, provided cable/wifi router reaching upstairs to the other side of the house. Not only did this router solve my connectivity issue, it also got me the bandwidth I was paying for, where as the previous wifi router was super slow. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Herbert Wilson",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "This was very easy to set up",
      "text": "This was very easy to set up. As I walked around my house after setting it up, most of the dead spots were gone. I live in an old house full of lath and plaster, and just one el-shaped hallway had only middling reception. Following another reviewer's suggestion, I gave my new network the same name and password as the network I had with my old router, so there wasn't even a hiccup with the various household devices. I've noticed a significant speed bump as well. I'm actually getting my provider's advertised speed for the first time . . .",
      "rating": 5.0,
      "verified": true,
      "author": "Two Bears",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Excellent Router, Easy Setup",
      "text": "I purchased this router as an upgrade to my older Cisco router, which was intermittently dropping the internet signal and requiring rebooting. I am very happy with the product. Set up was very easy, and now have improved Wi-Fi range in my house. Have not been able to test it from outside on our deck, but expect it to be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Bookworm",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Royal Tech Plus is great.",
      "text": "The router works great. Stronger signal and the MU-MIMO protocols make it so much faster to . . . everything. As expected and more. The seller deserves a hats off as well! Everything shipped quickly, was prepared for shipment with care and consideration, and it all arrived more than a week early! Thank you Royal Tech Plus. If they're a vendor choice for something you're shopping, give them a chance to impress.",
      "rating": 5.0,
      "verified": true,
      "author": "George805",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "I went from 20mbps on my old router to 60mbps download times on this one!",
      "text": "I upgraded from a Linksys EA4500. I was paying for 60mbps download speeds. With the EA4500, all my devices would top out around 20mbps. After setting up this router, I get between 55mbps and 65mbps! And the range is much better also. If you don't have the latest technology, you could be paying for something you are not getting. On the speed test picture, the bottom three are the old router and the top three are the new!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20170513
    },
    {
      "title": "Cutting the cable!!",
      "text": "So far so good. We cut the cable and needed a faster router with greater wifi range in our house. So now we have three Roku's, our old PS3 that has not been hooked up in years, our smart tv all running seamlessly. Did need some assistance setting it up since twc/spectrum couldnt initially activate our new modem (also with increased speed), but once the modem issue was resolved and everything restarted (make sure when you restart this router, turn it off AND unplug it for 20-30 seconds) and all was good. Great signal even in our basement ( which was a dead zone before). Very happy so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "MU-MIMO Tri-Band Rocks!",
      "text": "This thing is A-W-E-S-O-M-E! I have many devices on my network and with my old D***** router, I would get dropped, experience ridiculous latency, and if I had an IPSec tunnel going, forget it. Latency was certainly not momentary and my family and I would be frustrated as it would literally take 30 to 60 secs. to load a web page. This Linksys router handles everything we throw at it. Stream, VPN, online game playing, downloading, etc. all works fantastic and that's with ALL of our devices online simultaneously. And it just plain looks cool! I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Highly recommend. 12+ devices connected to WiFi",
      "text": "Experienced very slow internet speeds for a while BEFORE buying this product (50-60 mbps). I added way more devices to my WiFi Network over the last year, including Blink Home XT2 WiFi security cameras, so bandwidth was an issue. AFTER buying this product, I’ve experienced no lag, no connectivity issues, and my MBPS per device has held constant at 230+ MBPS on Xfinity Internet service (paying for 200 MBPS). Highly recommend it. Solved all of my issues. - Household devices connected to WiFi at any given time: 12-15 - MBPS Download speed per device: 230+ - MBPS Upload Speed per devise: 11.5 - 12.5 ** Also upgraded modem to Netgear CM700 at the same time **",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey K.",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Great while it lasted",
      "text": "I've connected this router to my primary router via ethernet cable, to serve another part of my house and reduce the wifi burden on the primary. The signal is strong and stable. Splitting up the wifi devices between the two routers has worked well. Update 04-28-19. It quit. Lasted all of 8 months. I can see it listed among wifi devices on my Android phone, but when I connect to it I'm told there is no Internet. I tried resets, power cycling. No benefit.",
      "rating": 2.0,
      "verified": true,
      "author": "Sonoma Geezer",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Great, rock solid router",
      "text": "I first bought a different brand, and experienced dropped connections and frequent need for reboots, and the signal was not great After returning and buying this router, it has been rock solid, great signal, and the router features and admin interface are robust and fairly easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Great product",
      "text": "Great router, I did a switch from Netgear Nighthawk AC1900. Tri-Band really makes a difference. My video was buffering constantly with the other router although my ISP speeds were over 200mbps I have made a switch a no more problems. The only problem that I had was by Amazon delivery courier that delivered to the wrong address, that's what you get for next day or same day delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Primemember83",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "So far So good!",
      "text": "Received this item about a week ago. DEFINITE improvement on our ability to use our internet. Especially with google home and all it’s connected appliances. We noticed Netflix would stop to load every so often, but with this, its really no longer an issue. It’s also nice to be able to check how many devices are online at any given time. As of the time of this writing, a DEFINITE recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "great interface and fast LAN",
      "text": "It's great that I don't have to reset my router as much when there are too many devices on the network. It handles routing speeds to every device very well. The interface is easy to use. I had to initially call tech support during setup but it was very easy overall.",
      "rating": 5.0,
      "verified": true,
      "author": "SCAM ALERT",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Unit works quite well. Was counting on greater range & connection of more devices wirelessly.",
      "text": "Unit works quite well. Was counting on greater range & connection of more devices wirelessly. Found the range better than my present NetGear, but, not as strong as I would like. After much research, did NOT know ONLY 15 devices could be connected wirelessly. I presently have 13 devices connected. I expect that with future smart-device developments more connections will be needed, which means another piece of equipment.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas L. Jamison",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Great with Spectrum",
      "text": "We have spectrum internet/modem and it's compatible and works well together. We have a 2 story home with this downstairs next to the primary TV. No issues with connecting TV's or smart devices other places in the house. Everything in the home runs off this - probably 40 devices connected between TVs, phones, cameras, and other smart electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "Prime Shopper",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Perfect Performance After 1 Month",
      "text": "After a month of use, I'm happy to say this product has worked very well for me. I don't know a whole lot about internet technology, but I do regular speed tests of my connection strength through WiFi. I pay for 300 mbps speed, and I regularly get over that. Again, I'm no expert, but this router's performance has been on-par with a hard-wired connection. It's a lot of money, but it's worth every penny to get a reliable internet connection without having to rely on a mess of wires.",
      "rating": 5.0,
      "verified": true,
      "author": "Connor",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Improves WI-FI Range",
      "text": "It has almost Doubled the WI-FI Range of the Linksys AC-1200 it replaced, our Ring Exterior Cameras now connect with no Lagging issues. The Set Up took about 20 minutes (Firmware Update) I was able to do it with no issues, I carried over the Name & PW info from the Router it replaced so once it was online everything reconnected to the new Router.",
      "rating": 5.0,
      "verified": true,
      "author": "EMDF7",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Very nice Router with great options",
      "text": "I know have 2 of these, one for home and one for our cottage.They are very easy to set up. The range is much farther then any router than I have had in the past. The app isn’t very easy to use as well and allows me to easily see who is on the network. I have a smart thermostat and it was very easy to prioritize the thermostat to ensure it has priority on the network when we have a lot of users. It also very nice having multiple channels. It is much faster than and other router that I have used.I would highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "JJSoccerCoach",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Good Router",
      "text": "Pretty easy setup, however when I changed the router name, it didn't change on the desktop I used to set it up. Called tech support and was VERY disappointed. They said I would have to go into my registry to changed it, and might have to download a program to do it. Router is working OK since I purchased it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry B",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Setup was super easier, and I now see speeds three times ...",
      "text": "Used this to replace a slightly older Netgear router that would no longer update. Setup was super easier, and I now see speeds three times of the previous router. I have a 1700sqft 1929 colonial and we had previously suffered from spotty coverage, even with an expensive extender. The issue no longer exists. Speed tests have me cruising all over the house. We currently operate 18 devices all using the signal.",
      "rating": 4.0,
      "verified": true,
      "author": "ThreeInWisco",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Fast, Easy, Great Range!",
      "text": "Bought this after we were having a terrible time with another brand of router, wouldn't reach upstairs and was constantly dropping. My wife's VOIP light has been solid green since plugging this in. Interface is very clean as well, easy to manage the kid's internet time through the app! Also ran speedtest and our download speed more than doubled, VERY happy!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Baldwin",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Super easy to use and fast.",
      "text": "Okay so my Netgear router went dead once again. After three netgear routers I've given up on them and went with linksys. Right out of the box it was super easy to install, everything in my house to include 7 wyze cameras had to be re-linked up but everything is working perfectly and fast. I'm hoping this is the last router I'll need for awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "M.E.",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Serves Its Purpose",
      "text": "The router works, and that's really all I need or want. As a non-tech person I had a little difficulty with the setup, but that reflects my personal characteristics and not those of the product.",
      "rating": 4.0,
      "verified": true,
      "author": "mgrdtch kaimakamian",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "A Great Router",
      "text": "This a great router. Our old router was cutting out intermittently so I purchased this one. What a difference! An this one also has the blazing fast 5 mghz which is really great and runs so much faster. We have a smart house so there are 26 things hooked up to it at the same time! This works great, there are some great options for security. So far we have had virtually no problems at all.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Seems to last longer than Nighthawk, range suffers though",
      "text": "Good router. I really like the functions from the app. Being able to set schedules easily for my kids tablets internet access is handy. The range is only about half of what my older nighthawk router was. Currently I'm sitting about 40 feet away on the driveway with only one window between it and me and I keep dropping connection. I'll have to invest in a few range extenders",
      "rating": 4.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "I'm happy with this router",
      "text": "I'm happy with this router. Easy to use and set up, the App works great. Management is easy. I'm going to upgrade to a AC5400 and will use this for a repeater/booster. Great product, good speeds. I'm running a lot of smart home products and many other wireless devices. This one is budget friendly and I'm happy with the purchase. This will blow away any of the cable companies wireless routers, it's a good upgrade.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Favero",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Fatal flaw of permanently attached antennas",
      "text": "This would be a great product if you could upgrade the antennas to high gain.... but these are permenstly connected. It didn’t quite reach my bedroom and without being able to use the better antennas I got a Linksys router. After 2 days of it acting up I am returning both products and ordering a little older model router from Linksys since it has the ability to take better antennas.",
      "rating": 2.0,
      "verified": true,
      "author": "J.wal-KCCO",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "I knew it was not Cablevision because the wired network stayed fine. Wife came home after I set it up ...",
      "text": "Night and day. Had a 3 year old Linksys and already tried a Netgear that would not even connect. I knew it was not Cablevision because the wired network stayed fine. Wife came home after I set it up and told me the quickness from wireless print command to the printer actually printing sped up. So YAY! Also, give yourself at least 30 minutes because Linksys no longer uses their app program it is all online.",
      "rating": 5.0,
      "verified": true,
      "author": "techenthused",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "very happy with the router.",
      "text": "I was looking to replace my old tp link and after a long reseach this was my choice, I was able to remove my extender and also the speed of my network went up, Im very happy with the purchase, I have several smart devices and computer connected and is holding just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Hector",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Unsure if worth high price tag but it does a decent job",
      "text": "Super easy and fast setup. It increased the range of my wifi to where I won't have to rely on unreliable wifi extenders, but I also had really wanted something that would boost my wifi connection overall. It somewhat achieves that on 5GHz, but not on the 2.4GHz. I got this on the deal of the day so I only spent about $150, but am still unsure if it's that worth of the price since previously I was just using + the 1 extender only for wifi. Perhaps if I also update my modem I will notice a bigger difference.",
      "rating": 4.0,
      "verified": true,
      "author": "mche",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "It fly's and was easy to install.",
      "text": "Love the Linksys 8500, setup was quick and easy. Took approx 10 mins to install and then speed tested the 5g wifi at 498 mbps. We are only running on a 400 mbps from our service provider, so I must have run the speed test off peak hours. House hold of 5, running multiple phones, tablets and streaming internet on the bedroom TV's. NICE!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great customer service.",
      "text": "Very nice unit. Very clean and well built. not flimsy at all. better wi-fi range than my previous 4 year old router. And great customer support. my wife's IMac was not connecting to the new router and in 10 minutes Linksys walked her through the issue to get it connected. it is very easy to setup and has an interactive app to put on your smartphone and monitor all devices connected with the router. i have always liked Linksys quality and there products have served me well. I will buy this unit again. maybe with 8 ports next time.",
      "rating": 5.0,
      "verified": true,
      "author": "Cary W.",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "OUTSTANDING router!",
      "text": "I replaced my older EA6500 router with this Router and couldn't believe the speed increase. I performed an internet speedtest on my old vs. new router and my speed DOUBLED! My provider advertised speed is 100MBPS but could never get more tham 50MBPS with my old router (may 5 years old?). Afetr I installed this AC2200 (EA8300) my speed doubled to the full 100MBPS my internet provider provides. The wireless range is also MUCH greater.",
      "rating": 5.0,
      "verified": true,
      "author": "Satisfied Customer",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Very disappointed with this router",
      "text": "I was not impressed with the software right from the beginning. Not very well laid out and had to search for some basic functions. I really started to dislike this router when it lost my lan settings and set it to a random IP address and issued those IPs via DHCP. It also changed the DHCP reservations to the new address block. If it happens again I will replace the router with a different brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony Cavallaro",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "OK unit - download the manual",
      "text": "I almost sent this back, the quick start guide was not too helpful. After I got the manual things went smoother. 192.168.1.1 and I believe the password was admin. I was not able to log in to wireless management, probably my issue. With the direct connection setup went fine, all works well for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken MTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Read the recent negative reviews and decide for yourself",
      "text": "Beware! Read the 1 star reviews concerning dropped connections, invalid password replies, etc. I have had this unit for a few days and it has been trouble. I have spent about an hour and a half researching solutions which certainly contradicts any \"easy setup\" claims. If the current configuration doesn't resolve my issues, then it is going back to Amazon. Update: Problems unresolved, returning to Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170626
    },
    {
      "title": "Router stopped working after THREE days",
      "text": "This router was a big upgrade from my previous one. Better speeds and stronger signal. Unfortunately, it stopped working three days after it was purchased. I went through troubleshooting with Linksys and they eventually concluded the item is defective. I'm returning it to Amazon and will try a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt R",
      "helpful_votes": 3,
      "publication_date": 20171003
    },
    {
      "title": "Buy a better one.",
      "text": "The Linksys Max Stream AC2200 MU-MIMO Tri-band does not seam to have a very strong signal. I have a 4 room apartment and the laptop in the other end seams to hunt for the signal. It has it then its gone. The TV's seam to pick up the signal much better. They are in adjoining rooms divided by a single wall. Buy a better one this one is just okay. Should of sent it back but then would have no signal for the apartment.",
      "rating": 3.0,
      "verified": true,
      "author": "Barry  Moskowitz",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Must Have for a Kicking Home Network",
      "text": "This is bada**! Easy set up, excellent quality, best I could find! Thank you to all the technical people that left feedback, tips, and tricks. Your knowledge share, tips and tricks are greatly needed and appreciated!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheri C. Baur",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Awesome router!",
      "text": "Bought this thing to run my audio gear. In heavily packed night clubs and venues, the signals always in and out, loosing connections and such with old router. This one works like a beast! No lost signals or drop outs! I must mention, I hide my ssid now so that could also be making a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Rougee",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Glad I made the purchase",
      "text": "This has been fantastic. Have not had an issue yet! We pretty must just stream and download and this router has delivered. We generally have 2 phones, 1 streaming TV but up to 2, a tablet or 2 and some other items connected and they all work just great. We have a two story house about 3k sq. ft. and have not found a dead spot. Still TBD on how far it goes outside but I will update when I do.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Man Certifier",
      "helpful_votes": 0,
      "publication_date": 20180109
    }
  ],
  "product_meta": {
    "title": "Linksys Tri-Band WiFi Router for Home (Max-Stream AC2200 MU-MIMO Fast Wireless Router), black",
    "description": "Style:AC2200Stream 4K content, enjoy favorite online games, browse online all without interruptions using the Linksys Max Stream AC2200 Wi Fi Tri Band Router (EA8300). Ideal for homes that pursh their Wi Fi to the limit, the Max Stream EA8300 wireless router features revolutionary Multi User MIMO technology that delivers Wi Fi to multiple devices at the same time and speeds while improving the overall efficiency of your home Wi Fi. intelligent Tri band Wi Fi speeds up to 2.2 Gbps, four high performance antennas and four Gigabit Ethernet ports provide non stop entertainment for the entire household. Seamless Roaming and advanced Beamforming+ round out the EA8300's impressive suite of Next Gen features found on any ruoter in the market. Easy setup using the Linksys App, which also allows you to control your home Wi Fi from anywhere and at any time using a mobile device. Refer to page 15 in user manual for troubleshooting steps.",
    "rating": 4.3,
    "feature_bullets": [
      "Provides up to 1,500 sq. ft. of WiFi coverage for 15+ wireless devices",
      "Works with existing modem, simple setup through Linksys App",
      "Enjoy 4K HD streaming, gaming and more in high quality without buffering",
      "Tri band technology delivers the fastest combined WiFi speeds to all your devices",
      "Tri band WiFi speeds up to 2.2 Gbps (5 GHz / 400 Mbps) + (5 GHz / 867 Mbps) + (2.4 GHz / 867 Mbps)",
      "Mu Mimo (Multi User Multiple Input Multiple Output) Provides WiFi to Multiple Devices at Once, at the Same High Speed",
      "Supports FAT,NTFS,HSF+ storage file system"
    ],
    "specifications": {
      "Standing screen display size": "11.6 Inches",
      "Wireless Type": "802.11a/b/g/n/ac",
      "Brand": "Linksys",
      "Series": "EA8300",
      "Item model number": "EA8300",
      "Item Weight": "1 pounds",
      "Product Dimensions": "6.37 x 8.41 x 2.16 inches",
      "Item Dimensions  LxWxH": "6.37 x 8.41 x 2.16 inches",
      "Color": "Black, Blue",
      "Batteries": "1 A batteries required.",
      "Manufacturer": "Linksys",
      "ASIN": "B06X9CPC45",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 6, 2017",
      "Customer Reviews": "4.3 out of 5 stars10,858 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#1,155 in Computers & Accessories"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Routers",
      "Networking Products"
    ],
    "price": ""
  }
}