{
  "website_summaries": [
    {
      "verdict": "Create a custom fit with easy adjustments that lend themselves to comfortable rides, even for those very long ones.",
      "pros": [
        "Once you find your correct size, you will appreciate a level of comfort not always associated with body protection",
        "Designed to work through all seasons, this protective gear does its job and you may forget you're wearing it"
      ],
      "cons": [
        "Nailing down the right size seems to be a common complaint among customers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great protection",
      "text": "Super light weight, and fits great under my jersey. Price is affordable. The Velcro straps on the sides help to keep the vest in place and snug. It has adjustable straps on the shoulders in case you need it. The protection on the back is fantastic. I'm 5'9\" and about 180 lbs. I bought the large and it fits great. I'm satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Manzy",
      "helpful_votes": 22,
      "publication_date": 20180305
    },
    {
      "title": "Good protection",
      "text": "Fits my 12 year old great. (5’4 and 115lbs) Haven’t gotten to use it yet.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Mortimer",
      "helpful_votes": 13,
      "publication_date": 20190114
    },
    {
      "title": "Nice vest for riding",
      "text": "Bought two of these for my sons who ride on the back of our bikes with us often during the season. They are nice and adjustable which allows them some comfort still while riding. I like that this will give them a little added protection shall the unmentionable happen. They are both as happy as I am with the product!",
      "rating": 5.0,
      "verified": true,
      "author": "EKV",
      "helpful_votes": 14,
      "publication_date": 20180316
    },
    {
      "title": "Not for street bikes, or any anything like that.",
      "text": "Way to thin to even think about wearing on a street bike. It’s almost like a piece of cardboard with small pieces of plastic on it. No way they would take a hit to the chest or back on the pavement at any speed. Very cheaply made, maybe for paintball or riding a bicycle or something, but for sure not for any motorcycle riding on or off the road. Worse purchase, I’ve never left bad feedback, but being a street bike rider, wanted to let everyone know not to purchase it for that reason.",
      "rating": 1.0,
      "verified": true,
      "author": "robert hess",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Comfortable and adjustable",
      "text": "I haven't used a lot of chest protectors, but this one has all the features I'm looking for as far as comfort and fit. The velcro fasteners cover a big area, so you can really adjust how this fits well. And the elastic has a good amount of stretch so you aren't suffocating yourself. This mainly covers the upper chest and mid-to-upper back, and offers really good freedom of movement.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20181105
    },
    {
      "title": "Satisfied!",
      "text": "This riding vest is exquisitely crafted and very sturdy. The protection of the chest and back is very comprehensive, and it looks very cool. It can be used for motorcycle riding, skiing and other activities. I am very satisfied with my shopping.",
      "rating": 5.0,
      "verified": true,
      "author": "Griff",
      "helpful_votes": 3,
      "publication_date": 20191126
    },
    {
      "title": "Good quality product, well made.",
      "text": "Overall good quality product. I accidently bought a medium vs. a large so the only reason I returned mine was to buy a large but I really liked it. I am 5'6 and felt the medium was too short in front, felt like sized for a kid even with the adjustable straps. Returned so I can buy a large. Lightweight perfect for warmer months. Would recommend, very well made.",
      "rating": 4.0,
      "verified": true,
      "author": "Two Cents",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Ok for the price.",
      "text": "This piece is light weight. I got a medium. I’m 5ft and 175 lbs. probably needed a smaller size. It doesn’t adjust to make it tighter. It’s secured by Velcro. Not sure I like that, would have preferred something else to hold it together. My husband and I both bought one, but returned it because we were looked for something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley ",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Satisfied",
      "text": "Exceeded my expectations! I love it! I was very skeptical at first because I wanted it to cover more lower from the front. But once I received it and put it on for the first time. It just felt so comfortable and covered the front lower than what the picture shows. I wasn't sure the Large would fit as expected cause I weight 180 and 5'3 in height but it sure did.! I love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen A.",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Maybe order a size smaller. It is adjustable.",
      "text": "I ordered a large based on my height (5’10” 140lb, skinny dude), but I wish I got a medium. A bit too loose for me (gotta pack on some lbs.). Great fit though, not uncomfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "j ken",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Ultra lightweight chest protector",
      "text": "This chest protector is very light. The plastic looks strong enough if you fall off your bike only at a low speed.",
      "rating": 3.0,
      "verified": true,
      "author": "Harry",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Five Stars",
      "text": "Nice product. Arrived quickly. Gave as a gift, boys were very happy. Lots of room to grow.",
      "rating": 5.0,
      "verified": true,
      "author": "Bearfam",
      "helpful_votes": 5,
      "publication_date": 20180124
    },
    {
      "title": "Nice Vest",
      "text": "I really like this vest. Lightweight and just feels OK. I rated 3 stars because I haven’t fallen off bike and hit something yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Chairdr",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Inexpensive protection",
      "text": "Easy to wear and remove. Looks great and you feel protected.",
      "rating": 5.0,
      "verified": true,
      "author": "Adan",
      "helpful_votes": 11,
      "publication_date": 20200908
    },
    {
      "title": "Good quality gear",
      "text": "Nice quality but keeps riding up to his neck had to add ties to keep it from doing that works now came in good time",
      "rating": 4.0,
      "verified": true,
      "author": "Bonnie S Stencler",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "great",
      "text": "i love this vest. i love to ride all the time but always feel like i want something more sturdy than the usual motorcycle jackets. this one feels bullet proof almost. at the same time it doesn't weight me down or feel hot inside of it. i've already fallen with it and its protected me",
      "rating": 5.0,
      "verified": true,
      "author": "em pat",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Fit is good",
      "text": "Light weight and fits great under my snowmobile jacket. Like the feeling of a bit extra protection 5'8\" 185lbs and I got the large",
      "rating": 4.0,
      "verified": true,
      "author": "ms",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "Great product.",
      "text": "I like it, very good product, you feel safe yourself in it",
      "rating": 5.0,
      "verified": true,
      "author": "Selcuk",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Light weight and easy to clean.",
      "text": "I'm no expert MTB'er, but the vest did it's job when I fell twice.",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Five Stars",
      "text": "Awesome! It fits perfectly, very convertible, and is easy to put on and take off.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCust2323",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Good",
      "text": "Kinda cheap, you get what you pay for. But it works",
      "rating": 3.0,
      "verified": true,
      "author": "J. Palmer",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Life Saver",
      "text": "The 1st day i wore it i got to see the value for the money. I fell off my bike coming down a steep hill and landed on a log that was laying sideways with a semi sharp branch sticking out. The vest saved some serious injuries. I'd Highly Recommend one to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Juanita Veronica Garza",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Solid protection",
      "text": "Came very quickly, and works perfectly for my nephew who rides dirt bikes.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina H",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "great buy!!!!",
      "text": "Fits great. My husband loved this vest. However package was dropped off in the lobby opened up. Even though I was home for the arrival of my package.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee P.",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Great but the velcro straps too short... Hard to adjust.",
      "text": "It's nice but too big. I was told to get a size bigger than my typical size and they were wrong. I returned it.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex Haidar",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "nice black color",
      "text": "This vest fit very well at the same size as I wear for shirts. It was very snug, nice black color, and has a stylish look. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180410
    },
    {
      "title": "Just use as temporary until you can afford a more qualified vest",
      "text": "This chest protector is nice a little smaller than I would like it to be, overall it's good for the price.. if your a size large you might want to by an extra large size.. but it will work if your just getting started as a new motorcycle ridder..",
      "rating": 3.0,
      "verified": true,
      "author": "joseph terrell",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Not that adjustable",
      "text": "Not as tight around the body as I thought it should be not that good of quality to",
      "rating": 1.0,
      "verified": true,
      "author": "Marissa",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Fits comfortably",
      "text": "Easy to put on and it doesnt move around or interfere with anything once on",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo Aldana",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "I just received my protector2day 1/22/2018. XL seems a ...",
      "text": "I just received my protector2day 1/22/2018.XL seems a little large 4me&I'm 6ft.I'm going2try&make it work bcuz a large may be too small",
      "rating": 3.0,
      "verified": true,
      "author": "gregory",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Gets the job done",
      "text": "Great product for the price. Does what it is intended to do. Very comfortable to wear, you won’t even remember you have it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernando Laino",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Exoskeleton",
      "text": "Great product, looks and fits nicely. Comfortable for all seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric A Portillo",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Nice, but size...",
      "text": "Nice protector, only quarrel is the size. Have to send back for a large instead of XL. Im 6'2\" 200lbs and its to big.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Young",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Five Stars",
      "text": "I love this thing its comfortable it protects me and I hardly know Im wearing it .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "The sizing is wildly inaccuratefeom my experience",
      "text": "The main description is very misleading for fitting sizes. I got the XL as it suggested because I'm 6', 170lbs and very athletic yet the straps for the waist are not adjustable at all and could fit a pillow underneath this thing. The shoulder straps are slightly adjustable but barely do anything. If I cross the straps over to the other side covering the protective plate, THEN it fits like I would want it to...which is annoying. I'm returning this today -kinda feels like that generic Halloween costume that just doesn't fit you.",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler W.",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Just a toy!!",
      "text": "Purchased this for horseback riding because i didn't want to spend the money for the real deal eventer vest. What a joke! I am horrified to think of anyone buying this as protective gear. However, if you need this for dress up for Halloween, it's nice quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Rock Candy",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "great product",
      "text": "love it. it does its work, and it can be adjusted to many sizes, be you skinny or with a beer tummy it will fit",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Dont buy it",
      "text": "I was completely unsatified with my purchase returned it, and gave it a review. Within a few days the company offered me free items to pick from if i gave it a better review.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim c.",
      "helpful_votes": 3,
      "publication_date": 20171014
    },
    {
      "title": "One Star",
      "text": "The fit was way off. Not even gonna wear it. I'll chalk this one up as a loss",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170309
    }
  ],
  "product_meta": {
    "title": "PELLOR Cycling Skiing Riding Skateboarding Chest Back Spine Protector Vest Anti-Fall Gear Motorcycle Jacket Motocross Body Guard Vest",
    "rating": 4.2,
    "feature_bullets": [
      "Imported",
      "【Motocross chest protector size Detail】there are 4 sizes for this body guard sports chest protector vest, please choose a right size for you. S: For height：1.1-1.3m/3.6-4.3ft; M: For height：1.3-1.5m/4.3-4.9ft; L: For height：1.5-1.7m/4.9-5.6ft; XL: For height：1.7-1.9m/5.6-6.2ft.",
      "【Excellent Protector Material】PE plastic shell, very sturdy; inside with padded high foaming fabric, makes this portective chest more helpful in high strength sporting.",
      "【Perfect Motocross armor vest】Inside use padded fabric, soft and comfortable, reduce damage from unexpected crash; Outside armor adopt durable and sturdy shell, provide great protect for your chest and back spine.",
      "【Spine protector great for Sports】cycling, motorcycle, motocross, skateboarding,skiing,etc outdoor sports needs armor protector for chest and back spine",
      "【Package include】1x black body guard armor protector for your chest and back spine"
    ],
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Cycling",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 58.99,
    "specifications": {}
  }
}