{
  "website_summaries": [
    {
      "verdict": "Aside from creating great arthritis gloves, this manufacturer goes the extra mile by throwing in a helpful handbook.",
      "pros": [
        "Designed by doctors to deliver effective arthritic pain relief",
        "Accurate sizing with a fit that envelopes each knuckle while still leaving fingertips free for functionality",
        "Included doctor-written handbook features tips and exercises to help educate and empower arthritis sufferers",
        "Excellent customer service"
      ],
      "cons": [
        "Without grips, some owners find they're a bit slippery"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "SURPRISING - I LOVE THEM",
      "text": "I'm glad I waited a while before rating these gloves. They are light & feel like Tee shirt cotton. I was sure they wouldn't do anything. They are comfortable, not tight. I thought perhaps I mismeasured & purchased the wrong size. WRONG. I have been wearing them every night & sometimes during the day. I am amazed at how much better my fingers feel. I have trigger finger caused by mild arthritis in several fingers. These gloves have made my hands warm & mobility has increased. I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra Young",
      "helpful_votes": 150,
      "publication_date": 20171014
    },
    {
      "title": "Compression Gloves for Arthritis",
      "text": "I have had a number of work related issues with my right hand. Carpal tunnel and now the beginnings of arthritis. I have tried other compression gloves and thought this one would be better since it covers most of my fingers. I also liked the handbook that came with the gloves. It provides good information about arthritis and what you can do in terms of over the counter medication and exercises.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 63,
      "publication_date": 20170529
    },
    {
      "title": "They do help and made very well.",
      "text": "Before I ordered I read a lot of reviews. I have RA and trouble with my hands and finger joints. I’m so glad I chose these. They fit great and they so help. Gives more support and helps support the joint. I have even slept with then own. I have washed them by hand and hang up to dry. I have more trouble with right hand so I just put the left hand glove on while it was drying. I need to get an extra pair. These really do help.",
      "rating": 5.0,
      "verified": true,
      "author": "ABjones",
      "helpful_votes": 28,
      "publication_date": 20180826
    },
    {
      "title": "I’m extremely disappointed.",
      "text": "Gloves are being returned. I measured my hand according to to their directions and it was 3 inches. Based on other reviews I went with the small. There was absolutely no support or compression in my hands. The only place I felt it was in the fingers. I bought these gloves because I spend all day typing and am an avid knitter, but my hands have been paying the price. I’m extremely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Claire B",
      "helpful_votes": 25,
      "publication_date": 20171114
    },
    {
      "title": "Don't go by the size chart - MINE TOO BIG.",
      "text": "Size chart shows hand with fingers open. IF YOU ARE CLOSE TO THE NEXT SIZE UP, YOU WILL WIND UP WITH THE WRONG SIZE. UGH MEASURE WITH FINGERS CLOSED. I have large hands, but right on the edge of xl. should have ordered L - no way to return because none of the categories for returning work - unless I lie - which I won't do.",
      "rating": 2.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 12,
      "publication_date": 20190726
    },
    {
      "title": "Poorly designed and stitched",
      "text": "The seams of the gloves are poorly finished and so they dig into my hands with the compression. I ended up wearing them inside out because my hand was hurting and I didn't want to wait to return it and purchase a new item. Due to the issue with the seams I do not recommend these gloves",
      "rating": 1.0,
      "verified": true,
      "author": "TanyaTop Contributor: Sewing",
      "helpful_votes": 12,
      "publication_date": 20190521
    },
    {
      "title": "No miracles here.",
      "text": "These are just silly lightweight stretch gloves. They do nothing to affect arthritis or Reynauds. They are too big on the wrist and fit average on the fingers. No compression. I'd hoped for maybe a warming effect but not even that. They are very thin material.",
      "rating": 1.0,
      "verified": true,
      "author": "Annarae Smetzer",
      "helpful_votes": 14,
      "publication_date": 20181125
    },
    {
      "title": "Highly recommended.",
      "text": "These gloves are made of a light weight material which was important to me because having my hands covered to much gives me anxiety. The compression on these are not too tight and the fingerless design let's me do my office computer job with no problems. If it's the first time using compression gloves it may be a bit difficult getting them on but be patient you'll get the hang of it. I pulled the seam slightly at the bottom with the tough tug but they still works wonderfully.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 24,
      "publication_date": 20170525
    },
    {
      "title": "Grey ones are the best",
      "text": "I really like the grey ones. They came early today and I put them on immediately. I noticed in a couple of hours the stiffness and pain had improved greatly. I also want to add that I previously had ordered the pink ones. They are a big disappointment being a cheap rather thin fabric like some kind of polyester. Also they are poorly constructed and loose on my hands. They are nothing like the grey ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 12,
      "publication_date": 20180316
    },
    {
      "title": "Effective - and affordable!",
      "text": "These are very good, especially for the price. They are true to size and last for months, especially if you skip the dryer. Heat is really hard on lycra. The compression isn't \"medical grade\", but it certainly helps with chores. They also keep your hands warm, which will help with arthritis pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Arvella B. Oliver",
      "helpful_votes": 16,
      "publication_date": 20180208
    },
    {
      "title": "Great compression,  Loose threads",
      "text": "They feel great and they are exactly what I need. However I am deducting 3 stars because the right pinky seam is already loose and starting to come undone. I bought these for work, to start the school year...And it's not right I should have to buy more in less than a week. Edited To Add: The company reached out to me and sent me another pair of gloves, honoring their refund/replacement policy. THIS IS AN ABSOLUTELY FABULOUS COMPANY. They are professional and kind.....And I will buy these gloves from this company for ever!",
      "rating": 5.0,
      "verified": true,
      "author": "SufiFeminist",
      "helpful_votes": 10,
      "publication_date": 20180818
    },
    {
      "title": "the gloves feel good. My hands feel better with them on",
      "text": "Pro: the gloves feel good. My hands feel better with them on, almost comforted. I have very bad osteoarthritis , bumps , crooked painful fingers , and one knuckle replacement. I can exercise more easily in the gloves. Con: they are slippery when trying to hold just about anything such as a mug, pencil, my tablet etc. Not putting silicone dots stragecally placed on the palm side of some of the fingers and thumb seems shortsighted. If you want to sit, watch TV , and pretty much relax, they are fine! Haven't tried crochet, or knitting yet.",
      "rating": 4.0,
      "verified": true,
      "author": "agypsyfoot2",
      "helpful_votes": 16,
      "publication_date": 20170610
    },
    {
      "title": "Very disappointing, poor fit, poor quality.",
      "text": "Compression is lacking especially on the wrist. The thumb is painful at crease to hand. It appears that they are not suitable for people with long thin hands. Quality is poor as my roommatesf fell apart after two washings.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Gunter",
      "helpful_votes": 14,
      "publication_date": 20170807
    },
    {
      "title": "Gets my hands warm in a cool, winter house.",
      "text": "While I don't have arthritis, my hands do get cold (we keep the house at 68* in winter, and my work place is only a little warmer). These keep my hands warm. It is a little difficult to type with these on, but not impractical. I often put these on for an hour which warms up my hands and then take them off to work for a few hours. I wear a size L glove, and I ordered these in L. They are snug, but comfortable. I'm happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "GHLKAL",
      "helpful_votes": 5,
      "publication_date": 20181226
    },
    {
      "title": "you call THIS large??!?!?",
      "text": "I am a am with big hands. ordered this because it was supposedly large sized. got product. fi3 fingers into it. can force 4th but cannot move it only the palm area.. this MIGHT be a large for a 12 your old kid but not a full grown man.",
      "rating": 1.0,
      "verified": true,
      "author": "Timothy Deane",
      "helpful_votes": 5,
      "publication_date": 20190613
    },
    {
      "title": "Poor fitting",
      "text": "TOOOI TIGHT AND EXTREMELY DIFFICULT TO PUT ON AND GET OFF HANDS I RETURNED THEM NO WORTH THE POSTAGE UPDATE—- the company sent a larger pair of gloves Now too LARGE They need to work on sizing and stop asking me to give them a good rating stating how they are a small company trying to get better I told them BRIBERY was not necessary they still sent this larger pair asking me for a good rating NOT NECESSARY ON THEIR PART NOW I HAVE A STILL ILL FITTING GLOVES !!!! Hopefully the company will leave me alone!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "iamcherokee2",
      "helpful_votes": 2,
      "publication_date": 20191215
    },
    {
      "title": "Very good",
      "text": "My mom loves these gloves, so much so, that I’ve ordered 3 pairs so far. She would use them all day if it weren’t for the fact that she has to wet her hands while cooking and cleaning. She uses them mostly for nighttime because they make her hands feel secured while she sleeps, as she’s been having some tendon and arthritis issues in some of her fingers. The only drawback is that they come in grey and it’d be great if there were other color options, or at least nude, so they’re not as noticeable. Given my other comment, it would be amazing if there was a version of these to use during the day that could get wet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat P",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Very good gloves for arthritic hands",
      "text": "I have owned arthritis gloves before but these are the best. I especially like the longer fingers. Other gloves the fingers weren’t long enough and they rode up and were very uncomfortable. The material of these gloves is also very soft and comfortable. I had relief in my arthritic hand in a little over an hour, it is such a relief. If you plan to order these the size chart is accurate so don’t worry about them being too big or too small. Just measure as instructed and they will fit. I enjoyed reading the bonus handbook that came with the gloves. I would recommend these gloves to my family and friends without a doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Gagliardi",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Not well made as of the first wearing.",
      "text": "Just got today, husband put on tonight and the left ring finger already coming apart at the seem. I am hoping they work for the night and then will prob have to return. Such a bummer things can’t be made to last I mean really the first attempt.",
      "rating": 1.0,
      "verified": true,
      "author": "nicole",
      "helpful_votes": 4,
      "publication_date": 20190516
    },
    {
      "title": "They relieve pain and prevent cramping.",
      "text": "I LOVE these arthritis gloves. A couple of days ago, my hands, especially my thumb, began to hurt so badly that the pain distracted me during my Spanish class. I could hardly wait to get home to put on my gloves. They gave me almost immediate relief. The compression is just right and felt really good on that cold day. I also wear them when I sleep every night. The gloves prevent my right ring finger from \"locking,\" which is not only inconvenient and embarrassing, but is also very painful to unlock. I suggest a pain relief cream for added relief. I also suggest you buy two pairs, in case one gets lost, even temporarily.",
      "rating": 5.0,
      "verified": true,
      "author": "Rnbo",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Excellent product",
      "text": "These were purchased as extra gloves for occupational therapy after a badly broken wrist. I have been using them for several months and they are wonderful. During the cold, Midwestern winter, they kept my fingers mobile. At night, they kept swelling to a minimum. They fit under OT splints and provided comfort during and after therapy sessions. I have three pair that I rotate. I have hand washed them dozens of times, and they have held up like a dream. Many thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "student63",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Very comfortable",
      "text": "I am a horticulturist in my 50's and have had raynaud's disease all my life and now have severe arthritis. these gloves felt so nice and are very high quality. I bought 2 pair and will wear them all the time except while at work because the nature of my work would wear them out very fast. I am using the cream penetrex in conjunction with the gloves and seem to have some relief but time will tell. I will review again in a few months.",
      "rating": 5.0,
      "verified": true,
      "author": "learner",
      "helpful_votes": 3,
      "publication_date": 20181130
    },
    {
      "title": "Uneven and not enough compression",
      "text": "One glove is tighter than the other and, in general, the fit is not tight enough. They also seem to have lost some elasticity and have become useless. Would not recommend these.",
      "rating": 1.0,
      "verified": true,
      "author": "Fire100",
      "helpful_votes": 3,
      "publication_date": 20191114
    },
    {
      "title": "Great inside out",
      "text": "Bought these due to cold hands at work. They work really well but the stitching on them makes them uncomfortable to wear, so I turned them inside out as I saw others had. It worked. (& yes I have bought the correct size, the gloves are not too small) To the maker I suggest making them more attractive when turned inside out:)",
      "rating": 3.0,
      "verified": true,
      "author": "Treva Buck",
      "helpful_votes": 6,
      "publication_date": 20181206
    },
    {
      "title": "More relief than I ever expected",
      "text": "I have had so much pain in the joint in my hands. My thumbs have been the worst. When I got these I could not imagine they would do anything, since they seemed so thin. The first night I slept in them and my hands did not wake me up all night.I was able to pick up a glass of water and button my blouse. I can't believe how amazing this has been for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Lohff",
      "helpful_votes": 2,
      "publication_date": 20181026
    },
    {
      "title": "Great fit and dexterity",
      "text": "I have bad degenerative osteoarthritis in both hands. I've had three surgeries because the cartilage in some joints has degenerated to nothing, so it was just bone against bone. These gloves are wonderful! The best that I have found. The compression is so comforting and warm. I two more in fingerless pink and copper infused with fingers. They, also are wonderful. I could never find a product with as much size choice. I am going to order some foot sleeves too. I couldn't be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle CustomerAa",
      "helpful_votes": 2,
      "publication_date": 20191121
    },
    {
      "title": "These Gloves Really Do Help",
      "text": "It's been quite a while since I purchased these gloves. Of late, the arthritis pain has been so severe in my fingers that I had to try wearing these gloves to see just how well they worked. I must say that what is claimed is not hype. The compression on the fingers does tone down the pain, and also seems to diminish the swelling at the knuckles. But range of motion is only achieved by doing exercises, or using the fingers to keep them as supple as possible. In my case, my fingers only have about 30 degrees of flex on my right hand, so whatever can help, I will try. The gloves DO help.",
      "rating": 5.0,
      "verified": true,
      "author": "Caley",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Doesn't cover my thumb",
      "text": "I measured my hand and ordered a M per the sizing chart. It came and didn't reach the joint in my thumb that I ordered it for. I returned it and tried a L. It was a little longer, but still didn't cover the joint in my thumb. I don't have abnormally large hands or long fingers. 1st photo is the L, 2nd is the M, last two show measurements. No issues with either size covering my finger joints, but that's not where my arthritis is. Ordering some finger sleeves instead.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff Olsen",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Not bad at all....",
      "text": "Gloves are comfortable and functional. Very soft. At first they seem to be incapable of making a difference, but as you wear them, the warmth and gentle compression DOES make a difference over the course of your day. I was pleasantly surprised. They even fit underneath your winter gloves (if they're not too tight). The only reason for 4 instead of 5 stars is that the compression fades too quickly until they are washed and dried again.​",
      "rating": 4.0,
      "verified": true,
      "author": "D. Bennethum",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "It actually helps",
      "text": "I really didn't expect much out of such a thin, comfy glove, but with the recent weather change the arthritis in my hand had flared up so badly that I was willing to try anything. Very pleasantly surprised when it actually did relieve the pain in wrist and fingers quite a bit, especially at night where the pain kept me awake before. My only problem is that due my odd finger length it does not cover the last joints on my middle and ring finger, where I could really use the compression help (but if I ordered a size larger my pointer and pinky would get lost).",
      "rating": 5.0,
      "verified": true,
      "author": "Antje",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Poor quality",
      "text": "I received these gloves today and have wOrn them now for 3 hours doing normal “around the house” things (i.e. computer, watching TV, making the bed, loading dishwasher, etc). The stitching around ALL fingers is unraveling . I ordered a size “small” as my palm measurement was 3”. The fit is fine - a bit loose. I feel the support/compression more in the fingers and none in wrist/palm area. Overall, not particularly impressed with this product given the shoddy quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Nice everyday gloves to wear",
      "text": "Pros: it fits like as described. I bought a medium but I can wear a small. The reason why I got a medium was so I can use these as daily gloves because my hands get cold easily and I didn’t want them too snug. If you want compression, buy the exact size as recommended. Anyway, they are warm, flexible and attractive. I use them as hobby gloves for knitting, so my fingers don’t hurt. I use them as semi fingerless gloves driving or running errands. I like the fact that they are thin, soft, and well made. Cons: my wrists are small so they don’t feel as snug but the I bought them a size up for that reason.",
      "rating": 5.0,
      "verified": true,
      "author": "Golden Phnx",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Additional support",
      "text": "I've been pleased with the Dr. Arthritis wrist brace, and impressed with the attention from the company, so I took their invitation to try the gloves. They are comfortable, and may even add to the pain relief, but then pain relief is the trickiest issue, isn't it? Anti-inflammatories? Turmeric? copper-infused wrist braces? Surgery? That's what is generally on offer. Why not try compression gloves? My pain is in the wrist, so I don't really need the compression action all the way down the fingers, but someone else may appreciate the coverage.",
      "rating": 4.0,
      "verified": true,
      "author": "Chas.",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Gloves are good for arthritis pain in hands",
      "text": "I got these gloves for arthritis pain in my hands and my left thumb. I wear them during the day and at night. At night they keep my hands from going to sleep. Comfortable to sleep in and not bulky like wrist splints. I got size small fits perfectly. I am petite and have small hands. Got my husband a pair he is on the computer all day. I washed them in a mesh bag and put in washer with other clothes on delicate. Came out fine and laid flat to dry. Really happy with these gloves.",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie S",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Very comfortbale",
      "text": "I bought these gloves because I have bad arthritis in both hands. I wasn't sure how these gloves would work. First, they are extremely comfortable. I love the fabric, its light-weight but firm and feels really good on my hands. I don't know about the pain relief so much, but they certainly don't hurt. I have excellent range of motion when I wear them at work and can type without a problem. I sometimes wear them overnight to try and relieve the numbness I get in my hands but I don't think it's helping much for that either. They DO feel good and I like the pressure on my hands.",
      "rating": 4.0,
      "verified": true,
      "author": "Jesusgirl04",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Pain solution. It just worked !!!",
      "text": "My husband said it work for him. He flick a cigarette butt out the window and pop a vein or something, the middle finger joint was swollen with pain. He went to the chiropractor once and it help a bit, he couldn't lift anything heavy or else it would hurt. After that he was in slight pain for two months, we bought a few things to ease the pain but it didn't work until I order this for him. He said it helped a lot, the swollen has gone down (from my perspective). I will buy more if he accidentally rips or damage it. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "QT",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Poorly constructed, useful exercises",
      "text": "After wearing these gloves for less than 24 hours, the seam on the pinky fell apart. When I turned them inside out to repair, I noticed a polyester tag that irritated my skin. Why did they sew these inside when they could print onto the fabric like most tshirt manufacturers do these days? I have noticed no benefits from wearing these day or night. My hands still fall asleep and wake me up at night. I ordered the medium because I measured and normally wear a size 8, but the gloves didn't feel like they were tight enough. The booklet of hand exercises was useful. Overall, I'm disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Susan Stack",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Don’t waste your money",
      "text": "I bought these to help with my carpal tunnel when I work out. I can’t do weight bearing exercises on my wrists because it hurts to bad. I tried these gloves based on reviews to see if it would help. They did not. I have small hands and bought a small. They were not tight I didn’t feel any compression. It’s did not help I owned other gloves that did help my wrists and I used that brand for years. I lost them and can’t remember the brand I bought. So I’m still searching for something to help with my pain.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina S. Kelly",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "WASH THESE!!!!",
      "text": "I got these and put one on for pain. I slept with it a while. There was something in the glove that I was apparently severely allergic to, it could be a cheap spandex that is breaking down, I've smelled something similar in other products. I woke up and my eyes were swollen and my face was burning. If you have allergies, make sure you wash these when you get them just in case you are allergic to them as well. I don't know if I'll be able to wear them at all again.",
      "rating": 2.0,
      "verified": true,
      "author": "Belinda Short",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Really warm.",
      "text": "Unless you live in a cold climate these gloves cannot be worn much. They are very warm and I have to take them off within 10 minutes. So, I have no idea if they work for compression.",
      "rating": 1.0,
      "verified": true,
      "author": "L.Young",
      "helpful_votes": 2,
      "publication_date": 20200209
    },
    {
      "title": "Back they went.",
      "text": "Returned. Measured hands according to guide and they are too small. The stitching was coming apart at the tips and wrist areas. Cheap and not worth it. One wash and these would come apart.",
      "rating": 1.0,
      "verified": true,
      "author": "ThaSwampDonkey",
      "helpful_votes": 3,
      "publication_date": 20190615
    },
    {
      "title": "Excellent Service.  New Glove with great Quality flexible Fabric for better support",
      "text": "I suffered Radiculopathy following a car accident causing lots of pains from head, through cervical regions and shoulder down to fingers. Using these gloves help relieve the pains. I wear them day and night due to my condition removing once in awhile. Initial fabric did dry my hands and the latest product is more than I expected. I couldn't dream of a better solution for my wrist/hand pains. This is an great quality product and I am extremely satisfied for both service AND follow-up. Next: am considering the shoulder brace.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia K.",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Guitar Player",
      "text": "I don't have arthritis but I've played guitar constantly for last 2 yrs. Finger and elbow tendinitis has developed one day. It made me rest for many days without practicing. It is a wonder product for your fingers pain from instrument. I've wore this glove when I sleep every day and I can play guitar every single day without pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Kim",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "I ordered these based on the good reviews. I have been wearing them to sleep ...",
      "text": "I have been having swelling and pain in my fingers. I ordered these based on the good reviews. I have been wearing them to sleep in and around the house to do chores and to drive in. I've not been able to type in them very well, but wearing them for as many hours a day as I have been has helped them feel better when typing. I have also been doing the hand exercises that are included in the booklet that comes with the gloves and they are really helping as well. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 10,
      "publication_date": 20170623
    },
    {
      "title": "Save your money to get legitimate ones 😕",
      "text": "These do help give the relief that compression gloves should, but they’re of pretty poor quality the seams around the fingers started to split after only a week of wear, and there is a horrible itchy tag on the inside of each glove that when you remove it I did mine super carefully with a seam ripper, you find out that it was stitched in with the same seam of the glove so the sides are split wide open.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200508
    },
    {
      "title": "Fine in theory, but fall apart within a few months.",
      "text": "I think there is a lot to like about these gloves, they are comfortable, easy to use, and help with my typing and computer use to keep my hands from hurting. However, I've gotten two pairs of this design (this is my 2nd) and they unfortunately fall apart on the pinky within a few months. I know that the gloves are inexpensive, but I honestly expected them to keep their stitching together for at least a year before becoming useless, but this pair barely made it four months. I haven't found a better performing version yet, but I don't think I'd re-buy this model of compression glove at this level of quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Aram Zucker-Scharff",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "I was Amazed at the differance theses gloves made!",
      "text": "When I first put my on I was surprised that I imediately felt a sense of comfort! I have been wearing braces on both hands after a while they become uncomfortable or restrict my movement So much I can't do anything. These gloves give me a nice break from my braces while still releiving a significent degree of pain. Only suggestion is that they make an even larger size. I have large hands for a woman but they are slender. If I were heavier or a male these would not work. I ordered size XL",
      "rating": 5.0,
      "verified": true,
      "author": "Durprize",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Super soft & good compression",
      "text": "Was hoping this would be my salvation but sadly it's not. 1st off, this is NOT a bad review of the product! Just a complaint about my broken, old body..... The material is super soft, can throw them in the washer & my hands DO FEEL GOOD for about an hour after I remove them. Was sleeping in them. They are very soft & have good compression. Am sure they will be just what some folks need for relief. Sadly, I am not one of them!!",
      "rating": 4.0,
      "verified": true,
      "author": "J Wentzel",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Soothing warm relief, inflammation and pain reduced",
      "text": "These gloves are so comfortable! I have RA, OA, Raynaulds, and fibromyalgia and severe hand stiffness and pain that limits my ability to do everyday things.I didnt expect much from these gloves, i have tried others in the past, but these actually help! Im serious! At the end of the day i notice less swelling and better range of motion after wearing these for 8-10 hours. I only take them off to sleep, so that i can pet mt cat. Lol! I love these! I wore them today to help me with housework, and i did still have some trouble with my hands, i did notice i can sweep a little easier, i celebrate small victories! Thanks Doctor Arthritis!",
      "rating": 5.0,
      "verified": true,
      "author": "Dorie",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Stitching Quality",
      "text": "My hands measured just over 3\" across. I ordered a size Small in case they were to stretch. They fit snug and comfortable. I worn them today for the 1st time, and within 5 hrs, the stitching on 2 fingers are unravelling at the ends. Bummer. I will return them as defective I do not really notice if gloves are truly compression, they look like normal cotton gloves. I SUGGEST that they be taken OFF your hand from the wrist like your socks. It is hard to pull from the finger ends.....",
      "rating": 1.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Comfortable and breathable",
      "text": "I've been able to use these for the past few weeks. Although they don't seem to help my pain necessarily. This may vary from person to person. My situation is a bit unique because both of my wrists have been broken so it may just not be a product that helps in my current situation until the arthritis really soaks in. However, I will say they are well made, comfortable, functional, and best of all you hands don't sweat in them. Would still recommend as a product to anyone who has arthritis that was diagnosed by a professional.",
      "rating": 4.0,
      "verified": true,
      "author": "Levi",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Wonderful!!!!!!",
      "text": "I had my doubts about these, but man was I wrong! I suffer from Psoriatic Arthritis in my hands, feet and back; and I have had to go so far as to teach myself to write with my off hand to compensate for days when the pain is too bad in my primary hand. The first time I put these gloves on, inside 5 minutes I could feel a difference! Now I find I can sit for extended writing sessions with no problem! Thank you Dr. Arthritis!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "John Hudson",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Five stars overall",
      "text": "I bought this product for my wife, who has some arthritis in her hands. I had previously bought their wrist brace, and absolutely swear by it. I have only had the gloves for a couple of days, so too early to tell if it helps the arthritis which my wife has (it is very slight), but I give it five stars because the gloves are comfortable to wear, are well made, were delivered quickly, the customer support is fantastic, and the documentation is very informative. So overall I give it five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Nall",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "My pain was cut in half almost immediately! I then got MED & had more like 3/4 of the PAIN GONE!",
      "text": "I have been in agony ever since the weather turned cold + damp. I saw these a couple days ago + thot it was worth trying. Arrived quickly. Lightweight + soft material + almost half the pain gone immediately. I'm thinking of getting a MED 4 added pain relief/compression (I do have 2wear them inside out but who cares, the pain is better!! Update: Med take 3/4 of the pain! Bought 2 pairs & ordering my in-laws each a pair 4 arthritis. Any pain relief makes it Worth every cent!",
      "rating": 5.0,
      "verified": true,
      "author": "Sonya H",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Great Customer Service",
      "text": "I ordered a medium, as my hands measure at 3\" across. However, the medium are definitely meant for hands *under* three inches, rather than exactly on that line (or maybe it was other dimensions of my hand causing the issue). Either way, the medium pair I ordered didn't fit at all. After contacting the seller, they promptly replied, offering me a larger pair at no extra cost. They fit fantastically and have been helping with the autumnal ache in my knuckles. Thanks again!",
      "rating": 5.0,
      "verified": true,
      "author": "Oliver McMahon",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Disappointed/Wish it helped as described",
      "text": "Great for pain associated with your fingers, but unfortunately, this product gives me no relief for my thumb/wrist pain that I've been experiencing on my left hand. It's just not tight enough in that area to give any relief. Guess I have to shop around for support for that specific area. I'm very disappointed, I was really looking forward to using it while working. I'm a package delivery handler and have been experiencing some pain due to constant handing of heavy packages. Anyways, as I mentioned, it's great for fingers and palm pain relief, but nothing else.",
      "rating": 3.0,
      "verified": true,
      "author": "L J",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "PAIN IS GONE",
      "text": "THESE AMAZING GLOVES HAVE RELIEVED THE TERRIBLE JOINT PAIN I WAS SUFFERING FROM IN BOTH HANDS. WHEN THE WEATHER STARTS TO COOL DOWN(AT NIGHT) THE SWELLING AND ACCOMPANYING PAIN BECOMES ALMOST UNBEARABLE. THIS IS THE SECOND PAIR OF COMPRESSION GLOVES WE HAVE PURCHASED AS MY WIFE & I BOTH IN OUR LATE 70'S HAVE ARTHRITIS IN OUR HANDS. THE COMPRESSION GLOVES KEEP THE BLOOD CIRCULATION FLOWING AND THIS IS QUITE A BLESSING FOR OUR PAIN RELIEF. THANKS AGAIN FOR SUCH A GREAT PRODUCT. GEORGE & DOLLY B.",
      "rating": 5.0,
      "verified": true,
      "author": "GEORGE Barlow",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great investment--and not even $$$$$",
      "text": "I got the gloves and was dubious. My PA recommended I use them to help with arthritis and carpal tunnel. I'm on the computer for 99% of my job so my hands are always swollen and painful. Boy do these help--and they don't feel like a medieval torture device. They are comfortable! When washing, I suggest using a lingerie bag, delicate laundry soap and NO dryer. Just let them air dry--it doesn't take long.",
      "rating": 5.0,
      "verified": true,
      "author": "Taterpig",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Very helpful glove",
      "text": "I find these very helpful. I have arthritis and carpal tunnel. I wear them under my wrist braces when it’s cold aT night. I wear them during the day and they do help with some of the pain. They are comforting on the hand and protect the joints from cold air. I have worn them on our warmer days without them being uncomfortable. They run true to size and have a good measuring chart. You want them to be snug.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Pineda",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Highly recommend. Lightweight, comfortable and much less pain moving my wrist and thumb.",
      "text": "I had been wearing a wrist brace with a metal support but still had lots of pain. Thought I'd try these. Put them on as soon as I got them and few hours later realized I had been using my hand much more and hadn't felt nearly as much pain picking up items or from moving my wrist and thumb. So nice and lightweight. Followed measurement recommendations and for my 3\" measurement bought the medium as suggested. Perfect fit for me, not too loose and not too tight.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Mama Approves!",
      "text": "I handed (tee hee) these over to my mom who has massive arthritis from old age and being a cancer survivor. The fit is great and she said they are not too tight which can be an issue with some brands. (She got the medium size). They are very stylish according to her and she wants another pair but this time in the pink 😂! She has noticed a great difference in her comfort from day to day since starting to wear these gloves!",
      "rating": 5.0,
      "verified": true,
      "author": "VeevLoot",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Works As Expected Instantly But...",
      "text": "These gloves are great. I use my PC a lot and my wrists would start to hurt after hours of use each day. I can simply pop these on and it basically instantly makes the soreness go away. They make your hands a tiny bit tighter (especially when making a fist or when holding something semi-tight) and take away some natural grip, but the material is a bit sensitive. It's easy for strings to appear from the gloves and slowly get longer, even after a bit of use, resulting in me either cutting or wrapping the strings from or around my fingers.",
      "rating": 5.0,
      "verified": true,
      "author": "Wyl33 J",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Pleasant compression, good symptom relief.",
      "text": "Really nice, all-over compression. Reduces swelling from my carpal tunnel syndrome and provides nice tactile relief for hypersensitivity due to a damaged radial nerve. Fit is perfect from the size chart. I use them when I need fine motor control at work, while knitting, and frequently while sleeping. I buy these gloves every few months and will continue to do so as I'm hard on them and Lycra doesn't last forever. Customer service got in touch when I received a defective pair and offered to replace them. Faith restored. I'm glad to remain a regular customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma Lee",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Keep my hands warm, but the cut is awkward",
      "text": "I got these gloves for warmth while typing rather than pain relief. They fit nicely and definitely do keep my hands warm. My only complaint is the cut of the pinky finger is rather odd (not sure if this is a \"me\" problem or a problem in general). As you can see from my picture, the opening for the pinky finger barely exposes my fingertip, while the other fingers expose more. It makes typing awkward sometimes, but I've mostly gotten used to it.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Love how these feel!",
      "text": "I recently bought these after trying the pink gloves. Although I really liked the pink ones, these gloves are so much better for me. I have had , or at least been diagnosed with RA, since the 1990's but I have had a disabled hand since my youth. The compression on this is a little tighter but not a tight that hurts. It feels really good when I am typing and on the computer several hours a day. I am so glad that I have come across Doctor Arthritis products!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bluebird0304",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great purchase!",
      "text": "Ok, so let me explain. I am 47 years old and starting to acquire osteoarthritis.(many years of torture to my body are catching up to me) I ordered these in an extra large, and they are sturdy, and comfortable! I can already feel a difference in my knuckles and I can see myself wearing these daily at work. 4 star for Range of Motion, because, well, they are compression gloves, so it'll take a bit to get usd to the tightness around the hands, but this is in no way and negative affect on the manufacturer, just letting anyone know who has not worn something like this before. Extremely happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Marosek",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Fine Goves",
      "text": "This is a well-made product that compares favorably with more expensive compression gloves. I allow my gloves to air dry, which they do quickly,rather than subjecting them to a dryer. The company offers excellent customer service as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa  Higgins",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Excellent relief from pain and stiffness",
      "text": "I bought these gloves for a gift, because I love my own. Not only do they help relieve arthritic pain, but they are excellent for musicians - anyone who uses their hands in their work, because they eliminate stiffness. If I wear them while I sleep, my hands feel great in the morning. Another good thing this company does is provide booklets with exercises. The gloves are well made and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherlock",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Warm & Comfortable",
      "text": "I have had these gloves for a few days now. They are very comfortable. I have not noticed the seams being uncomfortable. My palm measured 3”. I bought the small and it is not too tight. My hands are slender. Too soon to tell if it will help my trigger finger on my thumb. The fingers of the glove are long enough to where the first knuckle on fingers are covered. They keep hands nice and warm and I am able to type and do other things without removing them.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Ideal for sleeping & cooler weather",
      "text": "These gloves offer a decent range of motion, and provide a fantastic snug fit to help compress sore hands and joints. As you can see in the video I took, you can easily bend your fingers and wrist. Range of motion is effortless. These would likely be best to sleep in, as they are smooth and do not have a grip to them. Also, the fabric is thicker, so they would be perfect for cooler temperatures.",
      "rating": 5.0,
      "verified": true,
      "author": "D.D.",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "These are perfect. Don't buy the cheaper gloves unless you want to wear inside out",
      "text": "IThis is the first pair of gloves I bought and I really liked them so I was going to buy more and instead decided to go with a cheaper option where the gloves sold in 2 packs. The cheaper gloves have wider seams which was creating a blister between the thumb and forefingers on both hands. I solved that issue by turning them inside out. If you don't want the seams showing then buy this brand. It is really top notch.",
      "rating": 5.0,
      "verified": true,
      "author": "Apademak",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Good Pain felief",
      "text": "One of the best features of these gloves is its’ length. My arthritis is in the first joint in both index fingers. Who would have thought decades of professional photography would take its toll. First tip buy a size smaller, I bought medium, it was very hard to but on, but once on the relief starts. This glove seems to have a tighter weave, hopefully that means the compressibility will last longer.",
      "rating": 5.0,
      "verified": true,
      "author": "David F.Ewart",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Useless",
      "text": "I was very disappointed with these gloves after reading the reviews and everyone boasting and bragging about how great they are I found them to be useless just a pair of gloves with the fingertips cut out don't waste your money I'd return mine but unfortunately I threw the packaging away along with the $17 that these cost",
      "rating": 1.0,
      "verified": true,
      "author": "donna",
      "helpful_votes": 3,
      "publication_date": 20181024
    },
    {
      "title": "Totally Worth It",
      "text": "These gloves paid for themselves the first time I wore them! I have weak hands, pain and Raynauds in both hands. I was able to pick up 8 cases of dog food without fumbling or hurting. The raynauds is staying at bay even with it being in the 50's tonight. They don't constrict movement. Very comfortable and don't allow things to slip through your hands. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Life Saver",
      "text": "I play tennis a lot but am having pain, probably arthritis. I’m able to play pain free. It’s very comfortable. I’m able to hold the racket firmly, no slipping. A nice surprise was that my hands normally get very sweaty in warm weather and I have to use a lot of grip gel in my hand. With this glove, I have no problem. My hand is always nice and dry. I no longer use the grip gel.",
      "rating": 5.0,
      "verified": true,
      "author": "Beach girl",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Not sure they will retain compression ability long",
      "text": "These fit pretty good, at least initially. My worry is that as I wear them they will easily stretch to lose the compression ability as I have been wearing them a bit off and on for several days and can already tell they are loosening. The compression does feel good and helps my hand and wrist pain, but they are kind of annoying to type with on, even with the fingers exposed.",
      "rating": 3.0,
      "verified": true,
      "author": "Maranda Russell",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Loosened quickly, didn’t compress",
      "text": "Didn’t seem to compress. Seemed to loosen quickly with wear, and had no noticeable relief. *Note: I was emailed by the seller requesting that I change or remove my review and they sent me the copper version of these gloves to try. Unfortunately the copper version is equally as loose. Beware of the super positive rating... I have recieved numerous follow up emails continuing to request that I remove my review. If the gloves work for you, great. Unfortunately they did not work for my small hands and that's my honest review.",
      "rating": 2.0,
      "verified": true,
      "author": "erin",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "VERY COMFORTABLE GLOVES",
      "text": "I have arthritis in the joints of my hands and experience pain if I use them for certain activities for too long of a time. I purchased these gloves at the recommendation of a friend. I have been wearing for various activities including yard work, typing on the computer, writing, shuffling cards, and hiking with poles. I have found them to be very comfortable and I have not experienced pain while wearing the gloves. They fit snug but are very comfortable. I hand washed them and they did not shrink or lose shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Exactly what I needed.",
      "text": "I'm a professional software developer so I often use my computer. I started to experience occasional numbness or pain in my wrists, hands, and fingers, so I purchased this to help with the pain. I've tried wearing other types of gloves and hand wraps, but I immediately noticed improvements on the first day with this glove. ~10% of the glove is spandex, so it provides a nice stretch and compression around the individual joints of each finger, thumb, and hand. This individual compression helped tremendously, and is something the other gloves I'd worn did not provide. It won't cure arthritis or carpal tunnel, but the amount of relief it provides relative to the cost more than justifies the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilia",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "the pain has stopped",
      "text": "These gloves are fantastic. I have had terrible pain and swellin in my finger joints for several weeks. When I put the gloves on the pain went away! The compression is helping with the swelling also. These gloves really work!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Jo Phillips",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "So far so good!",
      "text": "I just got these gloves in the mail, so far I really like them I will update this review after I've worn them for a bit longer. I ordered a size small and my hand width was about 3 inches if I remember correctly. My first thoughts are that I like them, they are comfortable, and they fit nicely. Their construction seems solid. The only thing I wish was different is the length of the thumb. I wish it was a smidgen longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kanne13",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Decent gloves",
      "text": "I would have to say these are pretty decent compression gloves and a good value for the money. The only complaint I have and maybe it's because I have really thin hands but I wish there was more compression in the thumbs and palms. I definitely feel the fingers are perfect with the compression though. Normally I wear one under a brace that I sleep with on my thumb and I think the combination of the two have been very helpful. Even so, no regrets on my purchase and happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Heaven Leigh",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Terrible quality... Good compression",
      "text": "Comfortable and good compression but TERRIBLE QUALITY. Multiple seams split in less than 4 weeks use. It's really a shame because they are good.. Even very good for comfort and compression.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "Helps for hand cramps",
      "text": "I have real bad hand cramps, so I thought I would try gloves, and these had some of the best reviews. I have had them for a couple of weeks now, and if I put them on right away when I start to get cramps, the cramps stop. If the cramps have already started, they will help if the cramps are mild, but don't do any good if the cramps are bad.........then I use a heated massager. Overall, I am pleased with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Berg",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Relieved my pain and numbness",
      "text": "I originally gave the gloves a rating of 3 after wearing them for two weeks. I must change it to a 5! I have had them for about 2 months now and wear them everyday! I work on the compute all day and was having pain and numbness to my fingers and wrist. These gloves decrease the pain by at least 75%. They are lightweight and non bulky! They don’t look like much but they work! I definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Denise B.",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Raynaud’s Relief",
      "text": "I have really bad Raynaud’s disease and have terrible discomfort when I have an episode which is pretty regular. I was having one of those episodes when my gloves arrived from amazon and put them on immediately....I didn’t clock it but I would say within the hour they were all better! So happy I tried these and hope to get continued relief. They are super comfortable and if you measure your hands as they recommend you should get the correct size. I have thin hands and usually where a 6 1/2 - 7 in regular gloves and got the small in these. They are thin enough to wear under other gloves as an extra level of insulation.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Painful first wear; returned.",
      "text": "Ordered the size per the measurements recommended. A little tight to get on and off but figured that came with the whole compression aspect of them. Wore them for a night and woke up a painful blister in the ‘web’ where my thumb joins the hand. Had a deep bruised groove running down the middle of the blister (guessing from compressing seam). Returned. Maybe I should have ordered a size bigger than recommended(??)",
      "rating": 2.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Its working",
      "text": "I started having carpal tunnel symptoms since past few months. I have been using these gloves since a week and its taking care of my pain. I try to use them for most of hours of the day and throughout the night. I used to have tingling sensation in my fingers, especially the thumb and pain in the wrist joint. But these gloves seems to be working for my symptoms. Pain has decreased a lot. Recommended for people who have same symptoms as mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ram",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Light and soft",
      "text": "These gloves feel very light not too tight I bought medium size. I thought may be I need to get a smaller size so it would feel tighter but after trying for 1 hour I felt very comfortable in my arms. I am wearing them every night & sometimes during the day to see how it goes. I love how much better my fingers feel.These gloves have made my hands warm and feels comfortable . I like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Indu",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Take two...",
      "text": "My original review was \"Too small\", I have since received a replacement pair of compression gloves in XL and they fit...still a bit snug, but I suppose that's how compression gloves should fit. I particularly like the material, my hands/fingers get very rough come fall/winter and they tend to pull on everything. We they don't pull on these gloves and that's a big plus for me. I'm also very pleased with the high level of customer service/follow up on my original (poor) review.",
      "rating": 4.0,
      "verified": true,
      "author": "Pappa Joe",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "good company..but large product ripped already",
      "text": "haven't worn them long enough uet..but I've tried many.many gloves..and this is the first company that gives you a complete booklet on arthritis. Types of arthritis and hand exercises to help your stiff.sore hands One week later××××××my pair large has already ripped along left side of my hand..I take them o e and off as I get hands wet.I don't want to get gloves wet...So they are ripped and won't last much longer ..Very good info.But now they are ripped more...will try and send back.my wife likes her pair",
      "rating": 5.0,
      "verified": true,
      "author": "Brian aka Big Dog wardogs making it home alum.live shark",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Decreases pain and comfortable to wear",
      "text": "I really like these gloves, this is the second pair I’ve purchased as I misplaced the first. I have RA and can get debilitating pain in my hands and wrists and wearing these help significantly. They compress not just my hands but wrists as well and aren’t bulky/don’t get in the way when I’m doing things around the house. It doesn’t resolve all of the pain but it does decrease it significantly.",
      "rating": 4.0,
      "verified": true,
      "author": "piagg",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Fits like a glove",
      "text": "I was surprised with how soft and comfortable the glove is. Expected something a little tight at a little comfortable. This is just the right amount of tightness and comfort. You still have a lot of flexibility moving your hand around in the two gloves. I like how there’s nothing like in a fingertips I can still use a phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Guillermo Flores",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Strengthens my hands",
      "text": "Originally I bought this as a gift for my mother. They were too large for her so I had to order her a smaller size. They fit me perfectly so I kept them. They keep my hands nice and warm and seem to increase the strength in my hands which I need. And finally I have relief on my thumb joint. I am quite pleased with these. The material does not squeeze my fingers too tight and I have a good mobility. I have no problem typing in them or gripping items with them, so I am very very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Comfortable and work well",
      "text": "The gloves are very comfortable and greatly alleviate issues associated with my mildly arthritic thumb - I've been wearing the glove about 8 hours a day plus during bedtime at night. I actually bought them because I have an upcoming golf trip and was concerned the pain in my thumb might cause a problem during 3 straight days of golf. I'm optimistic and will report back after the golf trip. P.S. I just ordered another pair of the gloves!",
      "rating": 5.0,
      "verified": true,
      "author": "MKB",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Nope",
      "text": "Came unstitched after 3 wears...total wear time, perhaps 8 hours. Did not help relieve the arthritis thumb pain.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Burrage",
      "helpful_votes": 2,
      "publication_date": 20191010
    },
    {
      "title": "They tore the first time I put them on.",
      "text": "Right out of the box, I tried them on (and yes, they were the correct size), and they tore immediately. Horrid quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Gavin Gifford",
      "helpful_votes": 2,
      "publication_date": 20190914
    },
    {
      "title": "CAUTION",
      "text": "They're soft and feel nice. However, they caused fingertips to swell more with osteoarthritis and Rhumatoid Arthritis in finger joints. Finger tips were also colder while wearing gloves to help for Raynaud's. They're nice. Just didn't work for my daughter and I.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200128
    },
    {
      "title": "Best compression style gloves I've had yet",
      "text": "I really like that when I wear these they are A. soft B.tight but not uncomfortable. Perfect size. I can tell they work bc ususally my hands swell at night and are painful and when I wear these to bed I wake up and take them off there are marks on my fingers from the stitching in the glove where you can tell my hands tried to swell but the gloves really helped. I would buy these over and over and over. I found nothing wrong at all other than you cant feel what you're doing if you work with your hands. They go all the way to the finger tips and are thick enough to lose sensation. PERFECT GLOVES",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Gloves live up to you expectation and more. So comfortable",
      "text": "So comfortable you forget you're wearing them. Great relief of pain and swelling from arthritis. I can wear all day. Easy on and easy off. I recommend without reservation. You will be very pleased if you purchase this very well made product. Excellent pain relief and increase of finger motion. You won't regret this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Jim G NewYork",
      "helpful_votes": 0,
      "publication_date": 20200927
    }
  ],
  "product_meta": {
    "title": "Doctor Developed Compression Arthritis Gloves - Doctor Written Handbook Included: Relieve Arthritis Symptoms, Raynauds Disease & Carpal Tunnel (L)",
    "rating": 4.2,
    "feature_bullets": [
      "✅DEVELOPED BY DOCTORS: While other Arthritis Gloves are sized inaccurately, breakdown quickly and made by low-cost manufacturers, the Dr. Arthritis Gloves are developed by Medical Doctors with first-hand experience in managing pain, stiffness and swelling associated with arthritis and other hand conditions. Ultimately, this means BETTER RELIEF for your hands and fingers and better results",
      "✅DOCTOR WRITTEN HANDBOOK INCLUDED: Want to know more about your condition, treatment options available, our best tips, and exercises that can optimise the strength and function of your hands as well as aid recovery? Read our handbook for your complete guide.",
      "✅EXCELLENT CUSTOMER SERVICE: With all questions answered within 24 hours by a team that includes medical doctors who offer a 100% satisfaction or money back guarantee and free sizing exchange, you can purchase confidently knowing you’ll get any support you need.",
      "✅COMFORTABLE COMPRESSIVE COTTON MATERIAL: The high quality blend of cotton nylon and spandex optimises comfort, allowing all day wear. See SIZING CHART (image 2 on left) for optimum fit.",
      "✅MULTI-USE: Whether it’s osteoarthritis, rheumatoid arthritis, Raynaud’s phenomenon, carpal tunnel syndrome, Dupuytren’s contracture, psoriatic arthritis and even soft tissue and sport-related injuries our gloves will provide symptom relief in style!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.4 x 4.7 x 0.8 inches; 0.64 Ounces",
      "Date First Available": "March 28, 2017",
      "Manufacturer": "Dr. Arthritis",
      "ASIN": "B06XWXQBY8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Braces, Splints & Supports",
      "Medical Supplies & Equipment",
      "Arthritis Gloves",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 15.95
  }
}