{
  "website_summaries": [
    {
      "verdict": "Higher-than-average bumpers paired with a deep recess make this popular lounger especially well suited for co-sleeping.",
      "pros": [
        "High sides help co-sleeping parents rest a bit easier",
        "Bottom unbuckles to accommodate growing babies",
        "Made with Microclimate technology to combat heat retention",
        "Toy loops give parents the option to attach a compatible toy arch",
        "Pure cotton cover is easy on sensitive skin"
      ],
      "cons": [
        "High price",
        "Hot sleepers might still end up sweating in spite of the temperature regulating design"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Rough on baby’s head.",
      "text": "It’s really hard for me to rate this product because we loved it at first we were using it as a co sleeper following all instructions. It made it much easier to feed my baby throughout the night after having a c-section. She is two months now and I noticed one morning that there was hair on the dockatot where her head lays and my baby had a bald spot on the back of her head. No matter if my baby moves her head sometimes I don’t think anything should be so rough to rub her hair off. Especially something so expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "Freddy Cashman",
      "helpful_votes": 25,
      "publication_date": 20191010
    },
    {
      "title": "Must have item",
      "text": "My first baby was a horrible sleeper, truly horrible. When baby #2 rolled around I was terrified of repeating what we went through the first time around. When my baby was about 3 weeks old I bought the Dock and it was magic. He slept for 5 hours straight the first night and I panicked that something was wrong. Nothing was wrong, he was just comfortable and asleep. Then he slept for 6 hours. He's 5 months old now and will sleep for 8+ hours in this. I only wish I would have bought the bigger one and that it wasn't so insanely expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Glitteranddiamonds",
      "helpful_votes": 13,
      "publication_date": 20181101
    },
    {
      "title": "its shaped more like a pool float",
      "text": "They say it \"reinvents the womb\", its shaped more like a pool float. It's heavy and expensive. I just found out it’s even banned in Canada. I wouldn’t recommend it to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 38,
      "publication_date": 20180505
    },
    {
      "title": "Will pay 4 sleep",
      "text": "Amazing. My son started sleeping in this I’m his crib at 2 months and immediately started getting 6 hour stretches of sleep. Now he is 4 months and 17 lbs and still loves it and only wakes once to feed. The cushion is nice and soft which is good because his crib mattress is too firm. Also it’s great for traveling to grandmas he still feels at home . He got too long for the buckled end real quick and I haven’t even attempted to clean it yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20181010
    },
    {
      "title": "Get the Grand unless your baby is tiny!!",
      "text": "Unless your child is tiny, or a newborn, get the Grand! My baby is 5 months and doesn’t fit in the one I bought him. Ordered the Grand so we will see how it goes when it gets here! He is a fairly big baby, 18 lbs and probably 26 inches now but did not fit at all as you can see haha",
      "rating": 3.0,
      "verified": true,
      "author": "Kelsi",
      "helpful_votes": 7,
      "publication_date": 20200311
    },
    {
      "title": "Amazing for a bassinet and new born.",
      "text": "Our baby had always slept in the bassinet next to our bed. She had a really hard time sleeping because she always liked to be close to the edge (the net) or she would cry because she could not get comfortable. We put the dockatot in our bassinet for her to sleep in at night and it was a total game changer. She loved the feeling of being snuggled in the dockatot and it kept her stable and prevented her from tossing and turning. I would absolutely recommend for any parent. It will allow you to finally get some quality sleep and your baby too! And it’s great because you can take it everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "GetFit NoExcuses",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Beautiful but pulls out hair",
      "text": "This product is beautiful and our little one fits snug in it. She has been taking long supervised naps in it where before she was only able to do so in a swing or glider. My only complaint is that I've found her hair falling out as the material on the white is ribbed and although soft is strong enough to make a few follicles fall out everytime she uses it. Perhaps another cover would solve this problem but we just have been putting a burp cloth under her head and that helps",
      "rating": 4.0,
      "verified": true,
      "author": "Jaime",
      "helpful_votes": 4,
      "publication_date": 20181026
    },
    {
      "title": "Worth it",
      "text": "So like most of you looking at this product, I had a baby who wouldn’t sleep without being held. We ordered a dockatot to try as a last resort. The first night we used it, my baby slept for several hours through the night. That was a month ago, and my babe now sleeps 7 hours straight. It didn’t work over night, but it absolutely is working now. Im glad we bought one and will use with our future children!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Dissatisfied",
      "text": "Don’t love the material think it should be softer, so hard to get on and off & it’s hard when you wash it and air dry it like recommended. If you get the white don’t expect to be able to get anything out of it if you get something on it. Overall not happy with the product & sad I spent so much money on something that was so highly talked about for it to be so easily stained, slightly rough material, and so hard to take on a off.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20191111
    },
    {
      "title": "Not for me...",
      "text": "Very overpriced and over exaggerated. It might be different for others but my son didn’t get any sleep in this thing. Also, even lounging in it scared me to death because of the suffocation hazard! Cute for Instagram photos though..",
      "rating": 1.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 3,
      "publication_date": 20200511
    },
    {
      "title": "Expensive but worth it",
      "text": "I reluctantly spent the money on what me and my husband thought was just a glorified baby pillow... but ultimately, I’m glad we bit the bullet and got it. It’s the only lounger my son will nap in and I believe it made the transition into his crib easier since he wasn’t napping in a lounger that was inclined. It’s easy to wash but I feel like I’m wrestling with the cover to put it back on since it has no stretch to it. Overall, I’m pleased with the product, effectiveness and quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great Purchase",
      "text": "Absolutely love this and baby sleeps well and safely while in it. Easy to put in plastic carrying case to take to Grandma’s etc. It’s a little bit of a process to take cover off for washing and to put back on...cover has a very tight fit (good and necessary). Pristine white color might not be best choice as it quickly shows sweat marks, spit up stains, etc. . However, the material washes well and nothing has left permanent stains so far (2 months in).",
      "rating": 5.0,
      "verified": true,
      "author": "Carie",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "A faster better sleep for baby",
      "text": "My newborn is immediately falling asleep faster and for longer periods since I got the Dockatot. It’s also easy to move around and use in different parts of the house. I was skeptical due to the price but I am very happy with the purchase now.",
      "rating": 5.0,
      "verified": true,
      "author": "ck17",
      "helpful_votes": 3,
      "publication_date": 20181022
    },
    {
      "title": "Not a Gimmicky baby item",
      "text": "I was VERY on the fence about this product, but when amazon sold it at a discount for the deal of the day i decided to give it a try. I dont use this item as a cosleeper, but more as a lounger. My son sleeps in this for naps all over the house. Or if i need to put him in a safe space while i shower or grab the mail.. I will say It is easy to get off, but a bit of a struggle to get back on. I followed the washing instructions to a T and found myself needing a 3rd hand to get it back on. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "philip",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Size",
      "text": "I love that it's so light. It's perfect for travel. It's hard to clean and put back together but that could just be because my hands are weak. I wish it were a little bigger. I think online it says it's up to 9 months but when you get it, it says up to 8 months. Either way my 4 month old isn't tall or big and fits perfectly. I'm worried that he'll grow out of it before he reaches 6 months. Otherwise he sleeps perfectly and it doesn't take up that much space in the bed.",
      "rating": 4.0,
      "verified": true,
      "author": "Susannah",
      "helpful_votes": 2,
      "publication_date": 20181214
    },
    {
      "title": "Great for the first months of life",
      "text": "I was hesitant to spent that much on a product that only gonna be used for a few months, but I am glad I did. We ve used it every day since birth. My daughter is 15 weeks and she is getting too big for it. It was especially useful during first month of life. She basically lived in it. I ve used my DocATot for cosleeping but it's not for every baby/parent. Definitely great for supervised naps/lounging for the first months of life",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Keeps baby snug n warm.",
      "text": "I really do love this. My newborn sleeps so well in this. I put it in her crib even in the pack n play. She is 5 days old. 7lbs. I wrap her up in a thin receiving blanket and she fits perfectly. Extra room by her arms and at her feet. I know in a few months she will grow out of it. I wish it wasn't this expensive for only being able to use it couple months.",
      "rating": 4.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "If your wife wants this one just buy it",
      "text": "Wife wanted this because the hype.. seems like it is actually really high quality and with how dangerous it can be laying an infant down in something like this it’s better to just spend the money and get the more expensive option because they have somewhat focused on safety",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181231
    },
    {
      "title": "Middling product",
      "text": "Bought this for my newborn. Baby’s fine with sleeping in it, it gets a bit hot from time to time on the back, so watch out for overheating. It wasn’t used for that long, baby outgrew it really fast. I used it mostly for a pad to place baby next to me in the toilet while i had to go wee, but then again a thick towel would do the same.",
      "rating": 3.0,
      "verified": true,
      "author": "Phinn",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Comfort + Convenient",
      "text": "My son loved his dockatot so we purchased this one for our baby due in November. I recommend these to everyone, we traveled with ours when he was 5 months old. So easy to move from room to room, easy to clean, super comfortable did him. We bought the SnuggleMe for color preference but I returned it immediately after opening it because I could tell it wasn’t going to be nearly as comfortable. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Woodruff",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Newborn sleeping better!",
      "text": "My new granddaughter was not sleeping well at night waking up practically every 45 minutes and I felt sorry for her parents not getting sleep either. After hearing about this product and the possibility of a remedy for all, I ordered two immediately, another one for a granddaughter arriving soon. Within three days I received the package and baby slept over three and a half hours straight! Parents and baby are resting wonderfully.",
      "rating": 5.0,
      "verified": true,
      "author": "Tobbie M",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Worth the cost",
      "text": "Game changer! I wish I had this long ago! my kids hated the bassinet, this is the only thing my baby sleeps great in! I was hesitant to purchase because of the price but glad I did. My only complaint is after washing it’s a little challenging to make sure it’s back on perfectly .",
      "rating": 5.0,
      "verified": true,
      "author": "Tiana",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Does not hold up to cleaning!",
      "text": "The tube completely fell apart after first time cleaning it despite following the exact instructions. We never got to try it and it is now unusable",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 5,
      "publication_date": 20181105
    },
    {
      "title": "Still using it with 5 month old",
      "text": "We've been using this for 4 months now and we love it so far. We use it everyday. The only thing we don't like about it is that our daughter seems to get a little hot while sleeping in it. She has a lot of hair btw and when we picked her up we've noticed that she was sweating. We've covered the dockatot with a 100% cotton blanket and the sweating stopped.",
      "rating": 5.0,
      "verified": true,
      "author": "Batzul",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Does not dry in the drier",
      "text": "Just extremely difficult to clean. It's a crime to make covers for new parents to buy. It takes a day to line dry.... Line dry no drier good luck if you buy it. Felt there are things fine as sleepers. Second the toy thing comes with no toys.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Helped my baby sleep near me",
      "text": "We tried a bassinet and generic co sleeper but my baby did not like it. I think he had too much ability to move freely and didn’t like it. Bought this and the more enclosed space helped him actually sleep in his co cleeper with this. Downside is my baby is on the longer side at 6 weeks so his legs are already near the end of this. Definitely recommended tho.",
      "rating": 5.0,
      "verified": true,
      "author": "jackiewacky",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Cheaply made clip!",
      "text": "The clip is VERY cheap! For such an expensive purchase you would think there would be a better made clup that hold better. It does not stay on. I don’t know if mine is defected but to buy a new cover is $75! No thank you! Other than that I have ZERO COMPLAINTS. I’m very happy with our dock a tot and our son has used it every single day since he came home. Great product! Post edit!: Dock a tot DID reach out and send a new clip. Everything is working great! Mine must have me defective.",
      "rating": 4.0,
      "verified": true,
      "author": "Yaneisys Molina ",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Not worth the high price",
      "text": "Honestly for the price this is not much different than a boppy pillow Lounger. And boppy is like 40$.",
      "rating": 3.0,
      "verified": true,
      "author": "C W",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Buy it now, before you miss out",
      "text": "I wish I had gotten this before my first born arrived. Just got it with my second son at five months. It’s worth every dime. Wish they made a bigger one since not all babies are the same size like these baby clothes",
      "rating": 5.0,
      "verified": true,
      "author": "Ben and Lynn",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Comfortable for baby to set up sleep time anywhere.",
      "text": "Keeps your infant in the position you put them in. Very easy to clean, unzips and place in washer. Easy to zip back on foam which is also covered. Baby seems very comfortable and falls asleep easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Williams",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Expensive and you can’t zip back up after cleaning",
      "text": "I originally gave this a good rating but after washing it 2 times and putting it back together.. good luck. It’s damn near impossible to zip back. I’m probably gonna buy a cheaper model. Way over priced. Takes 10 minutes to zip back up after cleaning... seriously",
      "rating": 3.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Honestly...",
      "text": "I needed somewhere to put her down. It does that. But probably the cover back on after washing it is horrible! A two person with baby napping in crib job! Also you will have to wash it bc you will get spit up or poop on it. Don't get White. With that said I think we will be getting the bigger one when it's time but definitely a patterned one",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Kinna amazing.",
      "text": "So far this is the only thing my little girl will fall asleep in at two months old now. My husband thought I was crazy to pay this much for this, not so much now haha",
      "rating": 5.0,
      "verified": true,
      "author": "mammoth bear",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Good quality but price is high",
      "text": "I’m docking a star because it’s really pricey. My baby is ok sleeping in this. Keeps her all cocooned and cozy. She’s 6 weeks old now and 23 inches and her feet are alsreasy touching the bottom but tou can unclip it so it opens and have her feet out. Perfect for co sleeping since she doesn’t like the bassinet.",
      "rating": 4.0,
      "verified": true,
      "author": "Xutzen",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Amazing product",
      "text": "Please educate yourself on bed sharing and make sure you’re comfortable with it before doing it! We used this to bed share and absolutely loved it! Our son who’s a year old and way too big to fit in it, still lays and watches tv in it!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "High quality product",
      "text": "So far our new born has slept through the night every night. Only waking up for one feed and change. High quality product. Easy to clean, easy to use. Our last baby never slept. It’s amazing getting some sleep this time around.",
      "rating": 5.0,
      "verified": true,
      "author": "Ambur Walker",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Love this!!!",
      "text": "My newborn grandson loved sleeping in this. You can put it anywhere. The baby is safe and comfortable. It's like a portable bassinet. It also fits in the bassinet! It's great! I bought the \"Grand\" at first and realized I bought the wrong size! I didn't know there were two sizes. I returned the \"Grand\" and got the \"Deluxe\" for my next grand baby!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Best baby sleep",
      "text": "Best product for baby sleep and travel. We move this all around the house and pack it up to take with us when we travel. Both of our kids slept/sleep amazing in this thing. Worth every penny. I would recommend buying the cover because after my first child used it there was a dark spot where her head was. I had the all white one.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Good product",
      "text": "We are very pleased with our dock a tot. It was a bit smaller than expected. Our son is 3 months and he takes up the entire dock. He seems to like being snug in there but often put one of his legs over the side to get comfy while he sleeps. I’m not convinced it has led to longer stretches of sleep but it is definitely great for helping him get comfortable in his crib.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180827
    },
    {
      "title": "Love Love Love",
      "text": "Absolutely love my dockatot we were having problems with my 2 month old sleeping without being held. She went from being awake every hour in her bassinet to sleeping 4-5 in the Dockatot! On top of having piece of mind sleeping in the same bed with her. The only downside I have is that it’s a little hard to take apart for cleaning but totally worth the price and inconvenience of cleaning. Wish I would’ve bit the bullet a bought one for my first child.",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn King",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Perfect sleeper!",
      "text": "Surprisingly easy to clean and keep clean. I really wasn’t thrilled about white but never had any issues! Love this item!! My baby loves this, I take it to work with me and she slept in it so well and comfortably. Super light weight and easy to take and use anywhere!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Baby Gift Item",
      "text": "I purchased this for a Baby Gift Item! It was the young mother's first choice for the most wanted gift.",
      "rating": 5.0,
      "verified": true,
      "author": "LaMagnolia",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "great product, used for months",
      "text": "We used this for our newborn to sleep in our bed between us until he was around 2 months and would sleep in his bassinet. Even then he would come into the Dockatot often in the night as he seemed to sleep better in it. After he outgrew his bassinet, we used the Dockatot to help transition him to his crib. It worked quite well. I took a star off ease to clean because the cover has to air dry, so it takes some planning and time. Also a little bit hard to get the cover back on but doable alone and easier with a partner.",
      "rating": 5.0,
      "verified": true,
      "author": "Alison Green",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Quality product",
      "text": "Excellent product for new borns. Product is constructed well. The removable slip cover is nice although not sure how easily it goes back on after being washed as I have not had to wash it yet. Price is a bit high and that’s the only reason I did not give 5 starts overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "pretty neat",
      "text": "bought for a friend.. she loves it. works well for her baby. would love to have one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Worth it’s weight in gold",
      "text": "We used this from birth to 9 months and it’s worth it’s weight in gold. We used a soft blanket to make it more cozy and to lessen the need to clean the cover because putting the cover back on after washing is a pain in the neck but still worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "BUT IT NOW",
      "text": "I wish I would of bought it sooner. I bought it when she was 2 months old and it helps her sleep in her crib in her own room a lot better. Before we got the dock a tot she would start in her crib at the beginning of the night and within a couple of hours I had to move her to her swing. Now she sleeps in her doc a tot in her crib the whole night. She is 3 months old now and we are only getting up once a night just to eat.",
      "rating": 5.0,
      "verified": true,
      "author": "Abbey Swenson",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Too expensive for what you get.",
      "text": "This is an okay product but not worth the money that is charged for it. You could easily make this out of pool noodles with fabric on them.",
      "rating": 3.0,
      "verified": true,
      "author": "Chudy",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Great for Baby",
      "text": "We bought this as a gift. Our daughter in law loves the convenience of this product. You can put it anywhere. Holds the baby secure. I would recommend this product for any new Mom.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Fortunatoi",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "You need this and worth it",
      "text": "YOU NEED THIS! I purchased it for my newborn and I couldn’t do without it in the first month. That’s all she would sleep in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Helped my Granddaughter Sleep",
      "text": "This is what we needed my Granddaughter doesn't like be swaddled so wouldn't sleep for very long. This helped her from moving around too much and she has been sleeping better.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Davis",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Hands down, best baby product!",
      "text": "This product came highly recommended from friends and family! Our little one is due in two weeks but we love the size and portability of it. We love the idea of having the baby sleep in the same bed regardless of being home or traveling. Looks fantastic and is soft and all you would expect of this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Trey Ellis",
      "helpful_votes": 2,
      "publication_date": 20180826
    },
    {
      "title": "Amazing!!",
      "text": "I’m so glad my husband bought me the DocATot! First night at the hospital baby struggled to sleep. Once I got home and put her in her DocATot she immediately fell asleep for 3 hours. This was definitely a splurge item but very worth every penny! Baby sleeps amazing in this. Plus it’s easy to carry everywhere and easy to clean. I’ve already had to wash the cover. Did so on the delicate chow and let air dry! No shrinking or damage. Would recommend for any new moms!!",
      "rating": 5.0,
      "verified": true,
      "author": "daisy guijarro",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Well worth the money!",
      "text": "I was unsure whether I wanted to spend the money on a pillow, but I am sure glad I did! My granddaughter sleeps securely in her dock a tot and her mother doesn’t have to worry about her sleeping angel. I highly recommend this pillow",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey Weston",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Makes those few weeks of newborn life easier!",
      "text": "Pricey but worth the money - anything that makes the first couple months of newborn life easier is must have! It was perfect to put o it little baby in while sitting on the couch or while eating dinner. It was also nice to have when visitors came over, the baby could be looked at but didn’t have to be held!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "We love our doc",
      "text": "We love our doc! Our babe is only swaddled & in doc at night. He's two months and get up only about once a night to feed.",
      "rating": 5.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 5,
      "publication_date": 20170727
    },
    {
      "title": "Worth it",
      "text": "My baby sleeps very soundly On DokATot. Totally worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Joline",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Baby loves it",
      "text": "My sister loves this for my niece. She naps well in it and it’s portable, which is great. It’s expensive, but I split the cost with my sister in law.",
      "rating": 5.0,
      "verified": true,
      "author": "Countrymouse",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Purrfect",
      "text": "Went on vacation and a 6 week old slept so snug in one of these - which was referred by a friend. Just bought this one for the newest grandbabe.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss P",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Too small for 0-8mo advertising",
      "text": "My baby is a 3mo. Old baby 13lbs. 24long and this is already snug and small she dont fit. Dont know if it would of work since my baby already didn't fit in there. Sad cause I really wanted it to work!",
      "rating": 3.0,
      "verified": true,
      "author": "Sandra Elenes ",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Gender neutral!",
      "text": "My daughter is expecting a baby girl in March and she chose this product. She is very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "The best baby product I've purchased!",
      "text": "The doc a tot has been a lifesaver for my family! My son has slept in it from the first night we brought him home from the hospital to now, he's 5 months old. He has been sleeping through the night since he was 2 months old and I think it's because of the doc a tot. It's a must buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Pricey But a Good Buy",
      "text": "I like that the doc a tot is portable and easy to clean. As well as the security of the baby not rolling out. However, it is a little pricey!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Loved it",
      "text": "Trying to get the material back on was tough because it’s so tight but I understand why. My baby that hated sleep when he was born and wouldn’t sleep anywhere but with us slept great in it. He’d slept between me and my husband in our king bed so I was always able to see him",
      "rating": 5.0,
      "verified": true,
      "author": "jessica mladinov",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Newborn Grandson loves it!!",
      "text": "This is so versatile and so comfy and safe for babies - my daughter-in-law is so grateful I purchased for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "BEST THING EVER!",
      "text": "This is the reason why my baby sleeps through the night. If you have not gotten it, what are you waiting for?! We will be purchasing the next size up when she grows out of it. Lifesaver!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah Nelson",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Cozy for infants; frustrating to zip up",
      "text": "Baby loved her Dockatot until she outgrew the Deluxe by 3.5 months. She loved to sleep in this. The white cover cleans well (seems to be stain repellent) but it takes two people to put the cover back on (and I didn't put it in the dryer so it didn't shrink).",
      "rating": 4.0,
      "verified": true,
      "author": "ab2017",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Great use for newborns!",
      "text": "I'm so glad I invested in this!!! For the first couple of weeks, this was a life saver! We still use it occasionally when the baby naps during the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great Location for 2 mo old to sleep",
      "text": "Like how baby is sooooo comfortable sleeping in the dockatot. We move it between a crib and a bed- very versatile. thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Advid Tech User",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "newborn necessity",
      "text": "I love it and baby loves it. Will be buying the next size when she gets too big for this one. Definitely worth the high price, don’t know how either of us would get sleep without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Geary",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Best thing ever!",
      "text": "My baby would not sleep in her bassinet and loved sleeping in this! A true life saver for me and my husband!",
      "rating": 5.0,
      "verified": true,
      "author": "Shilev",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Buy it! You won’t regret it!",
      "text": "My son loves his! What a great buy! I was worried I’d waste my money but I definitely got my money’s worth out of it!",
      "rating": 5.0,
      "verified": true,
      "author": "krystal",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Helps with transition to crib",
      "text": "It’s a quality product. I was a little worried about the price but it has been worth it. This has really helped our baby transition more easily from a bassinet to crib.",
      "rating": 5.0,
      "verified": true,
      "author": "Alison Miller",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "If your thinking about it just do it !!",
      "text": "This is the absolute most used baby product in my home. Our 3m old baby sleeps like a rock in this. Only suggestion is to get a extra cover bc they need to line dry and we can’t go a day without it !",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Not worth the money",
      "text": "I was disappointed after reading all the rave reviews for this product. Functions as a good bumper if you’re worried about rolling onto your baby while cosleepjng, but definitely was not the miracle sleep aid that so many others have claimed. I suppose every baby is different, but not worth the money IMO.",
      "rating": 3.0,
      "verified": true,
      "author": "Todd Schoentrup",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Great for babies who don’t like to be swaddled but startles themselves awake",
      "text": "Amazing product. My son wasn’t sleeping through the night until we started using the Dockatot. I recommend getting a second cover since the cover machine washable but is line dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather T.",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Baby loves it",
      "text": "My baby loves to sleep in her dockatat!! By far the best purchase made for her",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "The best",
      "text": "In love with this ! Super comfy for my baby very affordable and one of the most needed items on my list",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "So worth it!",
      "text": "One of the best baby purchases i made! Easy to transport around house!100% worth the investment! The only thing complicated is the changing of the sheets, its not very easy! Its a pain to change it but the product is amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Rock + Bone",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Saved my sanity",
      "text": "This thing has saved my life. I was hesitant about buying the smaller one since my daughter is almost 6 months but I'm so glad I did. I have a baby that I can not put down and pops her eyes open right when I try to get out of bed. This has been so helpful for us.",
      "rating": 5.0,
      "verified": true,
      "author": "taylor",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Review",
      "text": "I don’t know what kind of sorcery this thing is, but it has helped my very clingy baby sleep while not being held by someone. My only complaint is that the fabric of the pristine white one is incredibly coarse.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen Broyles",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Best sleeper ever!",
      "text": "I'm forever thankful for the dockatot for helping my littles sleep well! Keeps them nice and snug. Plus I love when they're on sale :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley W.",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Sleep tight",
      "text": "My daughter-in-law loves it for the baby! She says it’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Gabriel",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Good but pricey.",
      "text": "Very good product, but very expensive for essentially a pillow.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie C",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "More sleep thank you",
      "text": "Swearing by this gift from above and my mother lol",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra Hopkins",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Just buy it!!!",
      "text": "A lifesaver! Sadly our son grew out of this by the time he was 5 months old but we loved it! He turned into a tummy sleeper right about the time he outgrew it so we didn’t use it very long. I would recommend this to all moms out there! It’s GOLD for those sleepless nights.",
      "rating": 5.0,
      "verified": true,
      "author": "JHarman",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Not worth it",
      "text": "For the price tag, really disappointed in the product. Cover comes of easily, for washing, but while putting it back on you need two persons. Also, the 'breathable' material of pillow is so easy to get tangled in the zipper, rips off easily, and cotton comes out. So I would say it is terrible chocking hazard if you are not careful.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon_verified_customer",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Daughter loves it",
      "text": "This was a gift my Daughter for my grandson. She loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Five Stars",
      "text": "THIS WAS A GIFT TO FOR MY 10TH GREAT GRANDCHILD, HE AND HIS PARENTS REALLY LOVE IT",
      "rating": 5.0,
      "verified": true,
      "author": "Rose M. Mihos",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Excellent Quality Merchandise",
      "text": "Received item prior to Christmas & was told it wouldn't be here until after Christmas. Quality is excellent & I was very pleased as it was a gift for great grandbaby.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Seller",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "Worth every penny!",
      "text": "Gave this to my son and daughter in law for their baby girl and they both including baby love it. Baby feels snug as a bug in it and only wakes one time during the night! Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Longer",
      "text": "I like that my baby sleeps great throughout the night but wish they had longer ones as she is already growing out of it and is only 2.5 months.",
      "rating": 4.0,
      "verified": true,
      "author": "juli",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Worth it",
      "text": "She definitely sleeps better in it. It’s heavier than expected, but not too heavy. Worth it because when it’s hot I don’t want to hold her all day long and it’s nice to set her in it while I do chores.",
      "rating": 5.0,
      "verified": true,
      "author": "katrina simpson",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Must have",
      "text": "Helped me with my 6 weeks old son. Make him sleep longer. You wont regret buying it.",
      "rating": 5.0,
      "verified": true,
      "author": "Hazel ",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Love it",
      "text": "I love the this for sleeping, the only small problem is my baby sweats too much in it. Also my baby out grew it by 3 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Garcia",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Cozy and convenient",
      "text": "Our son loves the DockATot. Its convenient to move and put him in while we are in different areas of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina L",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "A must have for a good nights sleep!",
      "text": "My 3mo has been sleeping in her doc-a-tot since she was about 6 weeks old. She sleeps significantly better in the doc-a-tot compared to when we’ve not used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett J. Dickson",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Worth the money!",
      "text": "Love! Our 2 week old HATED sleeping in the bassinet so we didn’t know what to try. Some one told us to try co sleeping with the dock a tot and we do not regret buying this! Sleeps so much better!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "but wow I love it. And my baby loves it",
      "text": "I really didn’t want to spend this much money, but wow I love it. And my baby loves it. It’s the only place he’ll nap. Priceless!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Hayes",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "A must have for new moms.",
      "text": "I bought this for my niece who absolutely loves it. The baby sleeps so sound and her naps are longer when she’s in it. Would recommend a thousand times.",
      "rating": 5.0,
      "verified": true,
      "author": "Sondra Reed",
      "helpful_votes": 0,
      "publication_date": 20200220
    }
  ],
  "product_meta": {
    "title": "DockATot Deluxe+ Dock (Pristine White) - The All in One Baby Lounger - Perfect for Co Sleeping - Suitable from 0-8 Months (Pristine White)",
    "rating": 4.7,
    "feature_bullets": [
      "Cover = 100% Cotton, Tube = 100% Polyester, Pad = 100% Polyester",
      "REINVENTS THE WOMB: DockATot has been designed to offer a snug and soothing environment for babies. Many babies prefer a nurturing, cozy surrounding that mimics the mother’s womb.",
      "FACILITATES TUMMY TIME: DockATot is the ideal spot to have tummy time with your little one. When baby is awake and ready to play with you, the rounded sides help to prop up your baby when placed under his/her arms. Tummy time can help babies develop neck strength and motor skills. It is important to closely supervise your baby during tummy time.",
      "PROVIDES A COMFORTABLE MICROCLIMATE: DockATot is made in the EU with OEKO-TEX certified fabrics that do not harbor heat. This ensures that the micro-climate (space directly affecting their surroundings) is the best possible for baby.",
      "TRAVEL FRIENDLY: The DockATot is an ideal travel companion for moms with babies and toddlers, as it maintains familiarity in a new environment. We offer stylish and functional Travel Bags to help keep your dock protected while on the go.",
      "IDEAL FOR CO-SLEEPING/BED SHARING: With rounded sides, the DockATot helps create a barrier between baby and parents to give your child their own cozy space. When used in an adult bed properly, DockATot offers a better way to co-sleep."
    ],
    "specifications": {
      "Product Dimensions": "24 x 6 x 18 inches",
      "Is Discontinued By Manufacturer": "No",
      "Batteries required": "No",
      "Dishwasher safe": "No",
      "Is portable": "No",
      "Item Weight": "1.25 pounds",
      "ASIN": "B06XGYJ9NL",
      "Customer Reviews": "4.7 out of 5 stars858 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#1,390 in Baby"
    },
    "categories": [
      "Home & Kitchen",
      "Floor Seats & Loungers",
      "Baby Products",
      "Activity & Entertainment"
    ],
    "price": 175.0
  }
}