{
  "website_summaries": [
    {
      "verdict": "A versatile entry-level Generac pressure washer that is missing some of the bells and whistles of the higher priced units, but it's available at a more affordable price.",
      "pros": [
        "This model works at a maximum 2,900 psi",
        "However, it comes with a Turbo Nozzle to make it easier to remove grime and the included soap blaster can spray soap up to 3 times farther than the regular soap nozzle"
      ],
      "cons": [
        "Some units may rattle and shake enough to make you feel uncomfortable with their build quality"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "ran terrible",
      "text": "Sent it back, thanks Amazon for refunding my payment. Read the mixed reviews and still went ahead thinking some people may of had problems. Well mine ran like crap, shaking with low pressure then ran for 15 minutes with good pressure, then stopped and wouldn't start. Changed the gas out thinking that could be the problem and put in fresh gas. Continued shaking low pressure ran like that for 10 minutes and then stopped. Again wouldn't start back up. My last gas pressure washer lasted 12 years. This one, 15 minutes. I then bought a Power Stroke with a Honda engine. That one starts easily and runs smooth.",
      "rating": 1.0,
      "verified": true,
      "author": "grez",
      "helpful_votes": 7,
      "publication_date": 20200626
    },
    {
      "title": "Complete garbage.",
      "text": "Well bought this power washer to replace my 20 year old generac power washer. This is when generac was red before they changed colors. So far not happy. On/off switch was hanging off of machine. Luckily was able to put back in without breaking it. Second manual calls for 20oz of SAE 30 oil but they only include 16oz. Not sure why. Was given detergent hose but no detergent cap as shown in manual. Guess spending $300 doesn't get you plastic cap. All in all poorly made. Not like the generac of 20+ years ago. Definitely returning and looking elsewhere. Won't get one year out of this machine unfortunately.",
      "rating": 1.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 2,
      "publication_date": 20200527
    },
    {
      "title": "Terrible Amazon Handling",
      "text": "This is the second time this has happened with pressure washers - once from Home Depot one from amazon. Shipment case and it was very evident it was a used product. all bags open, tape used on packaging and bags. Additionally, multiple components and items were broken inside, one was completely shattered. Do not buy a pressure washer from here. Amazon Customer Service was incredible as usual on this however. Issued a refund and thankfully did not lose any money on this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 2,
      "publication_date": 20200711
    },
    {
      "title": "Good value. Tough first try.",
      "text": "Only issue I had was first time trying to use. Filled it with gas and followed directions perfectly. Wouldn’t start. Didn’t even act like it wanted to. Nothing. Then I left for 2 hours, came back and it started with 1 pull. Runs perfect and works very well.",
      "rating": 4.0,
      "verified": true,
      "author": "nryan",
      "helpful_votes": 3,
      "publication_date": 20200307
    },
    {
      "title": "Works great first time, unfortunately only",
      "text": "Worked great the first time. Less than a month later the screws on the top are rusted. What kind of keep screw did you use on a machine that uses water. By the third used the gun is already leaking where the metal pipe and plastic housing leak. Would not recommend! Terrible quality. Expected a lot better from generac, especially for the money paid. UPDATED: little over a month later and now the u it can not hold pressure and is making weird grinding noises. Reached out to the manufacture and still no response two weeks later.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Awesome!!",
      "text": "My S/O had me purchase this for him to clean his dirt bikes and works amazing! He was very impressed and happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kenedee",
      "helpful_votes": 4,
      "publication_date": 20200224
    },
    {
      "title": "I figured out myself to just unscrew where the pull string is and loosen the middle knot and it worked like a charm",
      "text": "Customer service wasn't very helpful when I couldn't start the engine. The first day that I tried using I called Customer Service 3 times and no one could help figure out why it didn't start. I figured out myself to just unscrew where the pull string is and loosen the middle knot and it worked like a charm.",
      "rating": 3.0,
      "verified": true,
      "author": "Techhead",
      "helpful_votes": 6,
      "publication_date": 20180103
    },
    {
      "title": "So far, we love it",
      "text": "Bought as a replacement to Craftsman that lasted years. I love this Generac even more. The handle is user friendly, trigger doesn't have a lock but is comfortable for gripping for extended use....update 6/3/2020 the handle/trigger does not work with a circular cement cleaner. Don't give up. I changes it out with my old Craftsman handle and works like a charm!!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy shopper",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "A good all around cleaner with a few minor issues.",
      "text": "I've had this for several months now. I honestly wanted a 3100+ PSI but missed a deal and got this one at a great price. Overall i'm very pleased. It sets up quickly and runs well. Power is good and the adjust on the handle wheel is awesome. The hose is somewhat annoying as it doesn't flex well so storing is not great. The turbo tool is the absolute best but the foam sprayer not so much. So, it won't cut a brick in half but it can still do some damage, which in my case is may be a good thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Soylentboy",
      "helpful_votes": 2,
      "publication_date": 20180801
    },
    {
      "title": "Weak and Poor Quality",
      "text": "Wobbles all over the place, nozzles have rusted after a year and just refuses to start this year. Used fuel stabilizer and oil. Extremely loud and pressure is good enough to wash a car and that’s about it. For the cost, I expected quality. Didn’t happen. Update: 4/19/2020 Went to start this spring. Engine completely seized up. Worthless piece of garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "DaGuru",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Works Great but an important tip to get Started",
      "text": "Overall, this was a good buy. I bought this pressure washer to clean my wooden deck and porch and it works as advertised. One thing to keep in mind though, I found out the hard way that the carburetor was filled with machining oil which prevented the motor from getting fuel. Simple fix, just remove the bowl at the bottom of the carburetor and empty the oil. Once I did that, the motor started right up. My only complaint is that as complete as the user manual was for this item, I believe this step should have been included.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Not too bad for the price, Shut-off switch broke first use.",
      "text": "The quality of the unit is built OK, except the cheap plastic ON/Off switch which was loose on arrival it broke off during the first 5 minutes of use and I had no way of turning it off, only by gas shut-off. Hopefully I can get a new switch under warranty. It will be unsafe to use until then. Otherwise, the pump and engine work great, cleans with great pressure and the nozzle selections included are prefect for home and auto. Make sure to use Ethanol free gas always in small engines.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Schoedler",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Generac 2900 psig pressure washer",
      "text": "This unit replaces an old, well used Generac 2500psig, 3gpm unit. Just received/assembled unit and used it to clean the patio. The additional pressure in addition to being a new machine makes it significantly more effective than the old unit. Only time will tell if it holds up as well as the original, but so far, I am impressed and recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "C.A. O.",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Adjustable power handle makes it easy to go from one surface to another without changing anything.",
      "text": "Gets the job done. Powerful enough and the adjustable power handle is what sold me. The detergent option is useful and quick-connect hose system makes the machine easy to use. I ended up buying a power sweeper that attaches to the end of this machines wand. It makes it easy to cover large areas. Saves time, effort & wear on the machine. Oil is easy enough to change and hose doesn’t kink up. Hose connections are sturdy. Keep track of the hours you use it because that’s what determines oil change intervals",
      "rating": 5.0,
      "verified": true,
      "author": "Chris D",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Liking this so far",
      "text": "Generac is well known for good products, that’s why I didn’t hesitate to purchase this one, product arrived and was very easy to assemble, with well laid out directions, it fired up first pull,And did a very nice job cleaning off my fence, and had very good pressure, if I had to say one thing I wasn’t crazy about was the flimsy plastic mount on the frame that you hang the gun on, that’s all, a very well-made piece of equipment",
      "rating": 4.0,
      "verified": true,
      "author": "barry bogarde",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "broken siphon tube attachment",
      "text": "update 03june 2020. siphon tube attachment fitting broke/blew off have sent emails and talk with generac rep on phone. was told a small part was not replaceable and you will need to buy a complete pump. given direction to take to dealer for repair and said they could not guarantee it would be replaced under 3 year warranty purchased (APRIL 2018). DO NOT RECOMMEND BUYING GENERAC PRODUCTS. CUSTOMER SERVICE AND PRODUCT WARRANTY ARE NONEXISTENT. BUY ANOTHER BRAND. VERY FRUSTRATING TRYING TO DEAL WITH GENERAC.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Easy to assemble and use.",
      "text": "I've used it for about 8 hours so far. Used it for cleaning vinyl siding and walkways. Only two problems I had were: #1 making sure the suction hose for the detergent was at the bottom of the container. The plastic hose is curved (from being curled in packaging?) and you can insert it too far and it curls upward and will stop suctioning the detergent before the container is empty. #2 the hose for the water and wand connections are too close together and this makes them hard to connect once one is connected. Not a big issue but I think they could have been designed further apart.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael E. Triggs",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Rough transportation ride.",
      "text": "The frame is bent, see attached picture, and the packaging indicates rough and wet handling! Machine performance exceeds expectations and I did not experience any problems starting or running. The oscillating and soap dispenser nozzles are excellent but care must be exercised using the oscillating nozzle of wood surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20191114
    },
    {
      "title": "Great Product",
      "text": "I did a lot of research before purchasing a power washer. This one was rated number one and I can truly say it is. Not only does it do an excellent job, but by buying this at the price it would have cost me to have someone power wash for me, I will be able to use it year after year. You can go from cleaning concrete to lower pressure to clean siding and vehicles. Great tool at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Would not start out of the box.",
      "text": "Would not work out of the box. Filled the engine with oil, and it began leaking from the throttle housing. Easy fix tough. Went to start it, pull chord was jammed. Fixed. Went to start it again, and the engine would not turn over. Tried starting with water running through the system like the manual says, and dry still would not turn over. Now this puts my project weeks behind. Had to drain oil and fuel to ship back, not easy to drain the fuel without making a mess. However the oil was easy to drain since it had a drain plug. Poor quality control by Genrac .",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 13,
      "publication_date": 20170720
    },
    {
      "title": "Most versatile power washer ever.",
      "text": "Needed a power washer, needed a good brand. Needed adjustable pressure. This provides all 3 things. I can wash the car without stripping the paint, I can blast the grime off a sidewalk, I can even blast grime off the side of my house vinyl siding. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Prfine",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Stay away!",
      "text": "This thing is junk. Won't start, brand new out of the box. Generac representative was no help. Told me I could take it an authorized repair shop but I may be charged if they say it is not the result of a defective product. Huh? I am mechanically inclined and tried several things to try and get it to start over a couple of days. Had to ask myself why I have to spend so much time trying to start a brand new pressure washer. Generac should just stay with their generator business and not try to venture into making other products. Amazon was very helpful though and made things right with me.",
      "rating": 1.0,
      "verified": true,
      "author": "bro30a",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "misleading soap dispenser description",
      "text": "My previous power washer requires siphoning soap via a clear plastic tube, but I've owned other power washers that have an integrated soap dispenser setup. This model appears to operate like that, but the soap holder simply syphons soap in a clear vinyl tube, around the hot engine, to by connected in the back of the unit - very poor design. I haven't even finished assembly, but Amazon says that it can't be returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Fresia",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "You don't get what you pay for",
      "text": "When it does work, it does a good job, but crappy off-brand carburetor makes this thing unreliable. Even if you run the unit dry of gasoline before storage the needle valve corrodes and the thing won't run. It makes me think seriously about the quality and reliability of their emergency generators.",
      "rating": 3.0,
      "verified": true,
      "author": "Stanwyck",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "DO NOT BUY!!",
      "text": "This thing ran for 10 minutes and died. All oil and levels filled and checked before first start. Bad pump out of the box. Soured me on this brand for any and all Generac products! Would have be better to blow the money I paid for this junk at the casino!",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Wedemeyer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Not dissappointed!",
      "text": "Not dissappointed! Starts on first pull every time and no issues what so ever! Great pressure and great to have different options on the handle. Comfortable to use and tons of pressure. If you're looking for a good reliable pressure washer at a great price then look no farther!",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Fisher",
      "helpful_votes": 3,
      "publication_date": 20170802
    },
    {
      "title": "Once I had to turn off the motor and empty any water in the gun and then start the motor again and then it was fine..",
      "text": "The only problem was sometimes air would build up in the garden hose and it would suddenly stop the water flow... Once I had to turn off the motor and empty any water in the gun and then start the motor again and then it was fine... STRANGE... happened twice out of three times.",
      "rating": 4.0,
      "verified": true,
      "author": "DS Brandt",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "good product",
      "text": "good product. only issue is the location of the wand holder, which is close to the engine exhaust. Be careful not to melt the high-pressure hose or parts of the wand.",
      "rating": 4.0,
      "verified": true,
      "author": "Chattanooga",
      "helpful_votes": 4,
      "publication_date": 20170723
    },
    {
      "title": "Where to get parts?",
      "text": "I just purchased a power washer (6882). It was easy to assembly and started up in just 2 pulls and very powerful. However when I put the first nozzle on the gun, I didn't secure it correctly and the nozzle (Green) shot away and I can't locate it. Where can I get a replacement? I can't seem to find where on Generac's web site. .... Generac sent me a new set of nozzles with no charge after this post. Very pleased at their generous response since it was my mistake. Thanks you Generac.",
      "rating": 5.0,
      "verified": true,
      "author": "James Trotter",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Buying Generac from Amazon might be a problem.",
      "text": "Did not work right out of the box. Generac is not helping because I bought it from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "M1A",
      "helpful_votes": 6,
      "publication_date": 20171027
    },
    {
      "title": "Starts easy and runs good.",
      "text": "Very easy to assemble, no tools required. Started on the first pull, and very has good pressure. The high pressure hose is a little short but I knew that was going to be the case before purchasing. I have a 50' hose on the way now. I'm very happy with this generac pressure washer so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Not a good experience",
      "text": "Utter crap. Worked 1 time at startup and then didn’t work again called for help and got no answers except I could take it to get repaired. Brand new and take it to repair I don’t think so. Had to empty oil gas and repack to return. I cannot recommend",
      "rating": 1.0,
      "verified": true,
      "author": "MIsterdoggy",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Wouldnt start until I drained the oil from the Carburetor.",
      "text": "Mine is working great now, but would not start on arrival. I read from someone else on a web search that their carburetor had oil in it. I unscrewed the drain on the bottom of the carb and it was full of oil! i left the drain screw out and the fuel in the on position until gas was running out. I put the drain screw back in and the engine started after a couple of pulls. After trying to get it running for over two hours i was nearly ready to send it back! The pressure adjustment on the gun is awesome and the washer has tons of power. I will be keeping it!",
      "rating": 5.0,
      "verified": true,
      "author": "Reluctant Reviewer",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Another GREAT product by Generac",
      "text": "The hose could be a little more flexible. But other then that its another great product by Generac !! 2900 PSI , every bit of it . Cleaned the mold and mildew off my vinyl siding with ease . Put oil and gas in and it started first pull . And ran fine right out of the box .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Pissed to Pleased!",
      "text": "Read this! I saw several reviews where machines were delivered brand new and wouldn’t start! Here is probably why: Check the box it came in! Mine had oil all over it from the pressure washer being upside down during shipping. All of whatever fluids were inside the machine had drained out making the air filter wet. When we Checked the air filter it almost felt dry but after taking it out it fired right up and ran like a dream.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracie",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Stop Shopping. This Is It!",
      "text": "Great pressure washer. Easy set up. Quality construction. The options this washer provides is second to none. I can go from cleaning off the driveway to spraying down the house without worry that I will damage anything. The attachments go on and off very easily, the handle is comfortable and the hose is durable. Nothing cheap here. You get what you pay for. Don't make the mistake of going cheap only to have to buy another the following year.",
      "rating": 5.0,
      "verified": true,
      "author": "RWK1",
      "helpful_votes": 3,
      "publication_date": 20170511
    },
    {
      "title": "Generac is Terrible",
      "text": "The moment I started the Power Washer the first time it did not idle correctly. It had very little power so I shut it down. It was under warranty & I was instructed to take it to a Generac warranty provider. 40 minutes away so it would be covered. The repairs were made however my claim was denied. Customer Service is zero help - no one from Generac will return a call. Never again will I buy a product from this company. Poor quality. Poor customer service. Save yourself the trouble. This machine is junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Schreiber",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "A good power washer",
      "text": "Assembly of the Generac power washer was very easy. I used one wrench, a 7/8\" to make sure the wand was tight. Work well. As easy to start as my Generac generator.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Peck",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "first new pressure washer.",
      "text": "I am very happy with purchase. It has plenty of power. Easy to move around and doesn't take up a lot storage space. great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Buy it",
      "text": "We bought this to power wash our deck and it was a great purchase, have used it to wash our cars, trucks, house, deck and fence it has definitely been worth the money and would recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Happy Owner",
      "text": "Only time it doesn't start on the first or second pull is when I have the choke set wrong. Just remember to turn the gas off and let it die due to fuel starvation. Also, I put Stable in the fuel to be safe. Comes with many nozzles, but I like the \"turbo\" one the best. Excellent cleaning power, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Wild Bill 57",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Great purchase",
      "text": "Very pleased with our purchase. We have used it on the driveway and patio and it does not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark in S C",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "General SpeedWasher evaluation",
      "text": "Assembly was easy. Power washer has plenty of power. I used it on concrete and vynal siding with excellent results.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald L. Hall",
      "helpful_votes": 3,
      "publication_date": 20170726
    },
    {
      "title": "3rd time and not working for sh*t",
      "text": "Third time using it, and when depressing the handle to spray, it all but chokes out the engine, and there's barely any power. Wrote to return, and they won't take it back, and customer service is unhelpful.",
      "rating": 1.0,
      "verified": true,
      "author": "Zondag3",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Beware of hose touching the muffler.",
      "text": "Was using this pressure washer for the first time and loving it until the hose came into contact with the muffler which is very close to it. The hose melted. Have to purchase a new hose already. Will try zip tying the hose away from the muffler next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Dorothy G. Musselman",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Generac cannot be beat!",
      "text": "Love this product after having tried two previous power washers which we returned almost immediately due to shoddy workmanship. This one is easily moved about and easy to use, easy to start and of course it's Generac -- how can you miss.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "The pump would not hold pressure and had to be ...",
      "text": "The pump would not hold pressure and had to be replaced within one year. It was covered under warranty and I have used it several times without any issue. if I wouldn't have had that one issue, this would be a 5 star review.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Product lacking",
      "text": "Didn’t work from day one. Had to drive an hour to have it serviced. They would not replace it. Expensive purchase for Fathers Day. It wasn’t available for many months. So disappointed for sure.",
      "rating": 1.0,
      "verified": true,
      "author": "Mvmom",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "2900 PSI is fantastic",
      "text": "2900 model. 1. Awesome 2. Came with oil (people put it in the gas tank?) Add oil to the oil tank 3. It has bolts and not rivets (someone complaining at that but now fixed) 4. Starts quicky. Small details like oil pouch, adjustable spray strength, ECT",
      "rating": 5.0,
      "verified": true,
      "author": "Adrienne H",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Nice pressure washer for the $",
      "text": "Much more powerfull than the electric ones I've owned. Very easy to assemble with no tools needed. I just put the required oil (included) in.Gased her up, started on the first pull. I was impressed by how easy it was to use, and how powerful it seemed even @ only 2900psi.",
      "rating": 5.0,
      "verified": true,
      "author": "James Freeman",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Awesome power washer",
      "text": "I bought this unit to replace a Sears power washer that worked fine but just didn't meet my standards. After much research I opted for this incredibly awesome washer. Very easy to set up, add oil that is included, gas, and it started the very first pull. Hands down an excellent choice. Well worth the money spent. Also very well built and looks like a quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "anita",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Great value seems to be a quality product for the price point",
      "text": "I was a little Leary after reading some of the reviews but I was pleasantly surprised it’s probably the quietest pressure washer I’ve ever owned started on the second pull I just got it but I would definitely suggest it, for $300 and change it’s worth it in my book just have to wait and see how it holds up over time.",
      "rating": 5.0,
      "verified": true,
      "author": "nathan ainsworth",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Ran great for a short time and then...",
      "text": "After about 10-12 hours of run time it simply would not start. Took it to a local area shop to get it repaired 'out of my own pocket' and come to find out, it had 'no compression.' Further inspection found it had blown the compression rings off of it. Got another machine and trying it out. So far no troubles.",
      "rating": 3.0,
      "verified": true,
      "author": "James L. Weston",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Happy,NOT HAPPY",
      "text": "Great machine after I had to replace oil soaked air filter and change spark plug right out of the box. It took me forever to get this powerwasher running. Once it started it had no power and black smoke coming out the exhaust. Changed air filter and spark plug. Runs real nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Law1",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "So far, will not start",
      "text": "Bought in October, 2019, brought out to use for first time in June, 2020. Will not start, no matter what we do. Searching now for warranty info to get serviced locally. Will update review once we do. Hope Generac comes through for us!",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Might as well rent from Home Depot",
      "text": "Used it three times now tsk broken. Several other said not to buy wasn’t reliable should have listened.",
      "rating": 2.0,
      "verified": true,
      "author": "CNote",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Add a few more bucks and get Honda quality",
      "text": "Stopped working. If I could I would buy the honda",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis H",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Didn’t work",
      "text": "I didn’t get a functional pressure washer. We checked the basic troubleshooting steps like oil and gas but the engine wouldn’t start. Had to return the item- carrying a 69 pound box to UPS wasn’t fun",
      "rating": 1.0,
      "verified": true,
      "author": "V S",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Worked great for an hour",
      "text": "Worked great for an hour, then it died and would not restart. Something with the engine. It was a real pain to drain the fluids and repack, but amazon was good about returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "harry202",
      "helpful_votes": 12,
      "publication_date": 20170707
    },
    {
      "title": "Good value",
      "text": "I've used it a few times now...no complaints. It's a nice machine",
      "rating": 5.0,
      "verified": true,
      "author": "ree",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "clean mold on siding, driveway & pool concrete surface",
      "text": "Bought it for my son & he loves it. I checked reviews on Consumer Reports who recommended it.",
      "rating": 5.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Commercial and residential contractor",
      "text": "This pressure washer is flawless, I make profit from this unit on every job, I'm so glad I bought this one for preparing my painting jobs, its powerful enough to prep concrete and prepare houses for refinishing, it paid for itself off two jobs. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Nasa We have a problem!!!!!",
      "text": "I got this power washer and used it twice. I just encountered a total pump malfunction. Water pouring out of pump manifold and oil coming from the pump head. I don't know what I can do, due to having this power washer 2 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Timothy Lee",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "This Generac has been going great so far",
      "text": "This is my 4th pressure washer. My 1st. two were electric.They only lasted 2 seasons. My 3rd. was gas a well named model but at a lower price. I got 3 full seasons and it died. This Generac has been going great so far. I don't use it a lot but it just seems to be built and put together a lot better.",
      "rating": 4.0,
      "verified": true,
      "author": "lenard makowski",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Very happy with the unit",
      "text": "Runs well, works well. Easy to use and gets the job done",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "This product sucks",
      "text": "I used 4 times since I bought it a month and a half ago. Now it will not start and the return policy is over. I don't recommend buying this item. Tried to save a few bucks and now I have to spend money on fixing it!!! Wish I could give it 0 stars",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "If it don’t start try cleaning the carburetor",
      "text": "It was delivered upside down so when I went too start it it wouldn’t start so after doing some research I took the carburetor off and cleaned it with carburetor cleaner put it back together and it started perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "The first time I used it there were problems.",
      "text": "Had to get it serviced right away. The engine would flood and always sounded like the choke was on. When it stayed running, there was only pressure for the first 15 minutes. The pressure never came back and then the engine died.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy Maylone",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Great results with this pressure washer!",
      "text": "Arrived as stated. Got it all set up! Started and was pleasantly surprised! Works beautifully. My handyman was excited as to how well it removed the mildew and algae stains!! Love all the different nozzle adapters!",
      "rating": 4.0,
      "verified": true,
      "author": "Reilly",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Works great, started right up.",
      "text": "A little difficult to assemble with just one person but it can be done!",
      "rating": 5.0,
      "verified": true,
      "author": "Brent N.",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "It has plenty of power for the price! Highly recommend",
      "text": "Added fuel and oil and it started on the first pull! Had plenty of power to wash my Cement walkway and my wooden deck. Did an amazing job on my vehicles also. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick m.",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Good purchase!",
      "text": "Easy to use and powerful for its size. Im very happy with my purchase. My friends like it too; but they gotta but their own. LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Sylar",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "This pressure washer is awesome!! Very easy to setup and started right ...",
      "text": "This is my first pressure washer and, oh man, I don't regret this purchase at all! This pressure washer is awesome!! Very easy to setup and started right up with the first pull. I washed my driveway and decks. I used it for a total of 8 hours (5 hours Saturday and 3 hours Sunday) with no issues. I highly recommend this Generac SpeedWash 6882 2900 PSI",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Laccruche",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Nice machine with plenty of power",
      "text": "Opened box put together wich was very easy,filled with gas,and oil,1 pull 2 pull 3 pull start, nice pressure washer with plenty off pressure",
      "rating": 5.0,
      "verified": true,
      "author": "ed behm",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Two Stars",
      "text": "Had to return it damaged right out of the box frame was really bent bad",
      "rating": 2.0,
      "verified": true,
      "author": "Okydoky",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Arrived Damaged",
      "text": "It works great, came in a damaged box with some scratches on it and the rubber support for the front of the frame was missing. Reported it but never got a reply",
      "rating": 2.0,
      "verified": true,
      "author": "MARC",
      "helpful_votes": 2,
      "publication_date": 20170927
    },
    {
      "title": "Returned",
      "text": "Had to return it was leaking. We were told a local place that would do warranty work but they could not get parts for it. Then we were told of another place several hours away but it was a huge hassle so easier to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "would not start right out of box",
      "text": "my wife got this for me as a birthday gift. It is now fall. I unboxed it, followed all instructions and it would not start. Called generac and everything they told me to try did not work. Now it is at a warranty repair shop. I am so disappointed.. If I had not destroyed the box I would send it back for a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Puka",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Great machine",
      "text": "This works great. Nice pressure. Excellent quality for the price. The 30ft hose is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Generac Pressure Washer, Awesome",
      "text": "It came in before they said, I put it together as the instructions and it's been nice ever since. Works like a charm",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Lavigne",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Worked well.",
      "text": "I had a problem with the assembly. One of the push buttons that slide through the handle does not. It sticks and won't pop out once I slide the handle tubes over the built in tubes.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken Kemnitz",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Runs Great",
      "text": "A great purchase and runs very well. Used it to clean house and other outside furniture",
      "rating": 5.0,
      "verified": true,
      "author": "buyartforless",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Works great and cleans the house",
      "text": "No issues with it. Works great and cleans the house, driveway, work truck, and fence.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Peterson",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Generac 6882 GPW 2900PSI Power Washer SPEEDW, 2900 PSI",
      "text": "Great price for a great product. easy to use and versitile. has different pressure for different jobs, highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "patrick winkler",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Fits the bill",
      "text": "Arrived promptly, works perfectly. Plenty of power for typical household cleaning- fences, concrete etc",
      "rating": 5.0,
      "verified": true,
      "author": "Len Donovan",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Real value for the money.",
      "text": "It works just like it's suppose to. It's as compact as any, very manageable weight and does an excellent job cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Nelson",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great product",
      "text": "Not much to assemble at all. Put gas and oil in it and it started right up on the second pull. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Five Stars",
      "text": "An amazing product, super fast to clean, got the power broom attachment & very glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "mtpockets",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Works the way it is supposed to!",
      "text": "I found this very easy to assemble (it comes mostly together) and get started. The different nozzles work exactly as described. I power washed my vinyl siding, cement walk and garden shed with ease. It is perfect for home use.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S. Donnelly",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Fired Right Up",
      "text": "Love this pressure washer, the anti fatigue trigger and wand selector for pressure is very helpful. Straight forward assembly, add oil add gas. Get to it!",
      "rating": 5.0,
      "verified": true,
      "author": "Logan F.",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "It's so easy to clean and takes up little space",
      "text": "Works really well. It's so easy to clean and takes up little space. A+++×",
      "rating": 5.0,
      "verified": true,
      "author": "Dedee",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Very happy with this!",
      "text": "This power washer works great!!!! It is easy to start, easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Short term use",
      "text": "Worked well for a bit... now it won't start. A little over a month of purchase",
      "rating": 2.0,
      "verified": true,
      "author": "Hcook49653",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Power and value",
      "text": "Why did I waited so long to buy this product? Very impressive. Great value, excellent choice.",
      "rating": 5.0,
      "verified": true,
      "author": "ESTEBAN  PITRE",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Better packaging",
      "text": "Good product gun came damaged (bent ) but still operational",
      "rating": 5.0,
      "verified": true,
      "author": "gregory saunders",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Brand new right out of the box and didn’t start",
      "text": "As soon as I received the product it didn’t work right out of the box. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley McCabe",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "easy to assemble added oil and gas and it started right up",
      "text": "pressure washed my driveway no problems ,great job on packing,recomend to anyone",
      "rating": 5.0,
      "verified": true,
      "author": "RAYMOND",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Great pressure washer",
      "text": "Great pressure washer. The adjustable pressure settings work well for switching between materials and not damaging surfaces. Well worth the slight extra cost over a cheap no name pressure washer.",
      "rating": 5.0,
      "verified": true,
      "author": "Enginerd",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Great pressure washer",
      "text": "Easy to use and works great. No problems so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Nice",
      "text": "High quality and easy to assemble, also easy to use. It works very well and is very versatile and easily portable",
      "rating": 4.0,
      "verified": true,
      "author": "john corboo",
      "helpful_votes": 0,
      "publication_date": 20170719
    }
  ],
  "product_meta": {
    "title": "Generac 6882 GPW 2900PSI Power Washer SPEEDW, 2900 PSI, Black & Orange",
    "description": "Style:2900PSI 50-State/CSAGenerac's SPEEDWASH 6882 gas powered pressure washer provides you with a complete washing system featuring best-in-class cleaning power. This complete cleaning system includes a family of innovative cleaning attachments (turbo nozzle and soap blaster) to deliver better cleaning results in less time. The turbo nozzle attachment with rotating pinpoint stream is designed to remove stubborn dirt and grime off tough surfaces 30% faster than standard nozzles while the soap blaster attachment sprays soap 3X farther than a standard nozzle tip to penetrate tough stains and improve cleaning results.",
    "rating": 4.3,
    "feature_bullets": [
      "Clean smarter. Clean up to 50% faster.",
      "Attachments included: Turbo nozzle removes dirt and grime 30% faster and soap blaster sprays soap 3x farther",
      "Generac 196cc OHV engine delivers maximum cleaning performance",
      "Includes 25 feet high pressure flex hose (kink resistent, non-marring) and 4 quick-change nozzle tips: 0 Degree, 25 Degree, 40 Degree and soap"
    ],
    "specifications": {
      "Product Dimensions": "24.2 x 18.9 x 35.5 inches",
      "Item Weight": "57 pounds",
      "Manufacturer": "Generac",
      "ASIN": "B06XHGW6KH",
      "Item model number": "6882",
      "Customer Reviews": "4.3 out of 5 stars422 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#21,063 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Pressure Washers",
      "Outdoor Power Tools",
      "Garden & Outdoor"
    ],
    "price": 341.1
  }
}